let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171117985",
            "dpc": "03010140801",
            "name": "កែវ ឃឿន"
        },
        {
            "barcode": "171117986",
            "dpc": "03010140901",
            "name": "ប៊ូ ប៊ុនសត្ថា"
        },
        {
            "barcode": "171117987",
            "dpc": "03010141001",
            "name": "សេង ឈុនឡាយ"
        },
        {
            "barcode": "171117988",
            "dpc": "03010141101",
            "name": "ជា មន្នា"
        },
        {
            "barcode": "171117989",
            "dpc": "03010141201",
            "name": "ស្រី ប៊ុនម៉ា"
        },
        {
            "barcode": "171117990",
            "dpc": "03010141301",
            "name": "សេក ស៊ីនួន"
        },
        {
            "barcode": "171117991",
            "dpc": "03010141401",
            "name": "ពៅ ឌឿន"
        },
        {
            "barcode": "171117992",
            "dpc": "03010141501",
            "name": "សេក ធីតា"
        },
        {
            "barcode": "171117993",
            "dpc": "03010141601",
            "name": "ប៉ែន ធីតា"
        },
        {
            "barcode": "171117994",
            "dpc": "03010141701",
            "name": "ជិម ចិន្តា"
        },
        {
            "barcode": "171117995",
            "dpc": "03010141801",
            "name": "ជឹម រឿងរិឡ"
        },
        {
            "barcode": "171117996",
            "dpc": "03010141901",
            "name": "គឹម ចាន់ម៉ាលី"
        },
        {
            "barcode": "171117997",
            "dpc": "03010142401",
            "name": "ឡូត ហឿន"
        },
        {
            "barcode": "171117998",
            "dpc": "03010142201",
            "name": "ព្រំ សុផៃ"
        },
        {
            "barcode": "171117999",
            "dpc": "03010142301",
            "name": "ព្រំ សុផង់"
        },
        {
            "barcode": "171118000",
            "dpc": "03010142001",
            "name": "ប៊ុន ចាន់នី"
        },
        {
            "barcode": "171118001",
            "dpc": "03010142701",
            "name": "កែវ គឹមលី"
        },
        {
            "barcode": "171118002",
            "dpc": "03010142801",
            "name": "លឹម សូសាគុណ"
        },
        {
            "barcode": "171118003",
            "dpc": "03010142901",
            "name": "ហេង វុទ្ធី"
        },
        {
            "barcode": "171118004",
            "dpc": "03010143001",
            "name": "ប៉ោ ជិនជូ"
        },
        {
            "barcode": "171118005",
            "dpc": "03010143101",
            "name": "លឹម គៀវ"
        },
        {
            "barcode": "171118006",
            "dpc": "03010143201",
            "name": "ឱ សាអាល់"
        },
        {
            "barcode": "171118007",
            "dpc": "03010143301",
            "name": "ហួត ញ៉"
        },
        {
            "barcode": "171118008",
            "dpc": "03010143401",
            "name": "ហាវ អាន"
        },
        {
            "barcode": "171118009",
            "dpc": "03010143501",
            "name": "វ៉ា ស៊ីណា"
        },
        {
            "barcode": "171118010",
            "dpc": "03010143601",
            "name": "លី ហ៊ាង"
        },
        {
            "barcode": "171118011",
            "dpc": "03010143701",
            "name": "នូ សុខឃឿន"
        },
        {
            "barcode": "171118012",
            "dpc": "03010143801",
            "name": "នូ សុខខឿត"
        },
        {
            "barcode": "171118013",
            "dpc": "03010143901",
            "name": "នូ សុគន្ធ"
        },
        {
            "barcode": "171118014",
            "dpc": "03010144001",
            "name": "កែវ រិទ្ធ"
        },
        {
            "barcode": "171118015",
            "dpc": "03010144101",
            "name": "ដាំ សុធា"
        },
        {
            "barcode": "171118016",
            "dpc": "03010144201",
            "name": "សេក សោភ័ណ្ឌ"
        },
        {
            "barcode": "171118017",
            "dpc": "03010144301",
            "name": "ចៅ គឹមឡេង"
        },
        {
            "barcode": "171118018",
            "dpc": "03010144401",
            "name": "លឹម គឹមណា"
        },
        {
            "barcode": "171118019",
            "dpc": "03010144501",
            "name": "តាំង លឹម"
        },
        {
            "barcode": "171118020",
            "dpc": "03010144601",
            "name": "សោ ស្រីណុច"
        },
        {
            "barcode": "171118021",
            "dpc": "03010144701",
            "name": "លី យ៉ាន"
        },
        {
            "barcode": "171118022",
            "dpc": "03010144801",
            "name": "យ៉ាវ គង់"
        },
        {
            "barcode": "171118023",
            "dpc": "03010144901",
            "name": "ឯម សារិន"
        },
        {
            "barcode": "171118024",
            "dpc": "03010145001",
            "name": "លាង ហុង"
        },
        {
            "barcode": "171118025",
            "dpc": "03010145101",
            "name": "ប៉ាល់  កាណា"
        },
        {
            "barcode": "171118026",
            "dpc": "03010145201",
            "name": "យ៉ុម ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171118027",
            "dpc": "03010145301",
            "name": "ស៊ីម ផល្លី"
        },
        {
            "barcode": "171118028",
            "dpc": "03010145501",
            "name": "ស្រេង ស្រូន"
        },
        {
            "barcode": "171118029",
            "dpc": "03010145601",
            "name": "គឹម សូភី"
        },
        {
            "barcode": "171118030",
            "dpc": "03010145801",
            "name": "ឈន សុភា ១"
        },
        {
            "barcode": "171118031",
            "dpc": "03010145901",
            "name": "ឈន សារឿន"
        },
        {
            "barcode": "171118032",
            "dpc": "03010146201",
            "name": "ឈន សុភា ២"
        },
        {
            "barcode": "171118033",
            "dpc": "03010146301",
            "name": "ស៊ឹម សំណាង"
        },
        {
            "barcode": "171118034",
            "dpc": "03010146401",
            "name": "នាល ហ៊ិន"
        },
        {
            "barcode": "171118035",
            "dpc": "03010146501",
            "name": "សន សុង"
        },
        {
            "barcode": "171118036",
            "dpc": "03010146601",
            "name": "ចាន់ ធូ"
        },
        {
            "barcode": "171118037",
            "dpc": "03010146901",
            "name": "ញ៉ាន់ សុភិន"
        },
        {
            "barcode": "171118038",
            "dpc": "03010147101",
            "name": "កែន កន"
        },
        {
            "barcode": "171118039",
            "dpc": "03010142501",
            "name": "ក្រម សារឿយ"
        },
        {
            "barcode": "171118040",
            "dpc": "03010142601",
            "name": "ចន ធឿន"
        },
        {
            "barcode": "171118041",
            "dpc": "03010146801",
            "name": "អ៊ឹង សំបូរ"
        },
        {
            "barcode": "171118042",
            "dpc": "03010147201",
            "name": "សេង ថង"
        },
        {
            "barcode": "171118043",
            "dpc": "03010147301",
            "name": "សុង វណ្ណា"
        },
        {
            "barcode": "171118044",
            "dpc": "03010147401",
            "name": "លៀង អ៊ួច"
        },
        {
            "barcode": "171118045",
            "dpc": "03010147501",
            "name": "ស្រូច ម៉ៅ"
        },
        {
            "barcode": "171118046",
            "dpc": "03010147601",
            "name": "ស៊ុន មី"
        },
        {
            "barcode": "171118047",
            "dpc": "03010147801",
            "name": "សួស សារី"
        },
        {
            "barcode": "171118048",
            "dpc": "03010138901",
            "name": "នៅ សោភ័ណ្ឌ"
        },
        {
            "barcode": "171118049",
            "dpc": "03010139001",
            "name": "ហ៊ី គា"
        },
        {
            "barcode": "171118050",
            "dpc": "03010139101",
            "name": "ផែ អ៊ីវ"
        },
        {
            "barcode": "171118051",
            "dpc": "03010139201",
            "name": "ជឹម បូរ៉ា"
        },
        {
            "barcode": "171118052",
            "dpc": "03010139301",
            "name": "វង្ស លន់"
        },
        {
            "barcode": "171118053",
            "dpc": "03010139501",
            "name": "ងួន ចាន់ថន"
        },
        {
            "barcode": "171118054",
            "dpc": "03010139601",
            "name": "អឿន សារួន"
        },
        {
            "barcode": "171118055",
            "dpc": "03010139801",
            "name": "អឿន កែវ"
        },
        {
            "barcode": "171118056",
            "dpc": "03010139901",
            "name": "គួច   ជួ"
        },
        {
            "barcode": "171118057",
            "dpc": "03010140001",
            "name": "ឈឹម វណ្ណា"
        },
        {
            "barcode": "171118058",
            "dpc": "03010140101",
            "name": "ណ  លីណា"
        },
        {
            "barcode": "171118059",
            "dpc": "03010140201",
            "name": "ប្រាក់ សាមឿន"
        },
        {
            "barcode": "171118060",
            "dpc": "03010140301",
            "name": "លឿម ឡៃ"
        },
        {
            "barcode": "171118061",
            "dpc": "03010147701",
            "name": "រី សារ៉ាក់"
        },
        {
            "barcode": "171118062",
            "dpc": "03010147901",
            "name": "សេង សុរ័ត្ន"
        },
        {
            "barcode": "171118063",
            "dpc": "03010138701",
            "name": "ឈិន វណ្ណដា"
        },
        {
            "barcode": "171118064",
            "dpc": "03010138601",
            "name": "អ៊ិត   វើន"
        },
        {
            "barcode": "171118065",
            "dpc": "03010138401",
            "name": "ឱ សុភី"
        },
        {
            "barcode": "171118066",
            "dpc": "03010138301",
            "name": "ទេព វុទ្ធី"
        },
        {
            "barcode": "171118067",
            "dpc": "03010138201",
            "name": "ម៉ា ជា"
        },
        {
            "barcode": "171118068",
            "dpc": "03010138101",
            "name": "យក់ វ៉ាន់"
        },
        {
            "barcode": "171118069",
            "dpc": "03010138001",
            "name": "តូច សៀក"
        },
        {
            "barcode": "171118070",
            "dpc": "03010137901",
            "name": "ហែម បូរី"
        },
        {
            "barcode": "171118071",
            "dpc": "03010137801",
            "name": "នួន ចំរើន"
        },
        {
            "barcode": "171118072",
            "dpc": "03010137701",
            "name": "កា តិមួយ"
        },
        {
            "barcode": "171118073",
            "dpc": "03010135401",
            "name": "ស៊ីត ស្មាន់"
        },
        {
            "barcode": "171118074",
            "dpc": "03010135501",
            "name": "តា ក្រូច"
        },
        {
            "barcode": "171118075",
            "dpc": "03010135601",
            "name": "ងួន ហេង"
        },
        {
            "barcode": "171118076",
            "dpc": "03010135701",
            "name": "ឈឹម ម៉ាលី"
        },
        {
            "barcode": "171118077",
            "dpc": "03010135801",
            "name": "សុខ ស៊ីវង្ស"
        },
        {
            "barcode": "171118078",
            "dpc": "03010135901",
            "name": "កៅ សុខា"
        },
        {
            "barcode": "171118079",
            "dpc": "03010136001",
            "name": "សែម សារិន"
        },
        {
            "barcode": "171118080",
            "dpc": "03010136101",
            "name": "ស្រី វឿត"
        },
        {
            "barcode": "171118081",
            "dpc": "03010136201",
            "name": "កាំង ប៊ុនឡុង"
        },
        {
            "barcode": "171118082",
            "dpc": "03010136401",
            "name": "ឆន វណ្ណី"
        },
        {
            "barcode": "171118083",
            "dpc": "03010136501",
            "name": "ហេង ស្រីពៅ"
        },
        {
            "barcode": "171118084",
            "dpc": "03010136601",
            "name": "សំ សំអឿន"
        },
        {
            "barcode": "171118085",
            "dpc": "03010136701",
            "name": "ឆេង ឆិ"
        },
        {
            "barcode": "171118086",
            "dpc": "03010136801",
            "name": "សេង សាហ៊ីម១"
        },
        {
            "barcode": "171118087",
            "dpc": "03010136901",
            "name": "សេង សាហ៊ីម២"
        },
        {
            "barcode": "171118088",
            "dpc": "03010137101",
            "name": "អែម សុផល"
        },
        {
            "barcode": "171118089",
            "dpc": "03010137201",
            "name": "ហ៊ុល លី"
        },
        {
            "barcode": "171118090",
            "dpc": "03010137301",
            "name": "ហែន ផល្លា"
        },
        {
            "barcode": "171118091",
            "dpc": "03010137501",
            "name": "ឆូត តង"
        },
        {
            "barcode": "171118092",
            "dpc": "03010137601",
            "name": "ចាន់​ ផា"
        },
        {
            "barcode": "171118093",
            "dpc": "03010118601",
            "name": "គឹម វេង២"
        },
        {
            "barcode": "171118094",
            "dpc": "03010146001",
            "name": "ឈួន ឈ"
        },
        {
            "barcode": "171118095",
            "dpc": "03010116301",
            "name": "ង៉ែត វុទ្ធី"
        },
        {
            "barcode": "171118096",
            "dpc": "03010116401",
            "name": "សេង សុផល ១"
        },
        {
            "barcode": "171118097",
            "dpc": "03010116501",
            "name": "សេង​ សុផល ២"
        },
        {
            "barcode": "171118098",
            "dpc": "03010114801",
            "name": "ឡាញ់ ផាន់ណេ"
        },
        {
            "barcode": "171118099",
            "dpc": "03010114901",
            "name": "ហ៊ុយ ភាជ"
        },
        {
            "barcode": "171118100",
            "dpc": "03010115101",
            "name": "តាំង សុង"
        },
        {
            "barcode": "171118101",
            "dpc": "03010115401",
            "name": "ប្រាក់ ថុង"
        },
        {
            "barcode": "171118102",
            "dpc": "03010115601",
            "name": "កែវ ឃឿង"
        },
        {
            "barcode": "171118103",
            "dpc": "03010115701",
            "name": "ជា វណ្ណៈ"
        },
        {
            "barcode": "171118104",
            "dpc": "03010115801",
            "name": "គង់ ជាង"
        },
        {
            "barcode": "171118105",
            "dpc": "03010115901",
            "name": "ឌុល ពេជ្រ"
        },
        {
            "barcode": "171118106",
            "dpc": "03010116001",
            "name": "ឈួន  ឈន"
        },
        {
            "barcode": "171118107",
            "dpc": "03010116101",
            "name": "ពិន   ទី"
        },
        {
            "barcode": "171118108",
            "dpc": "03010107701",
            "name": "ចាន់ សេង"
        },
        {
            "barcode": "171118109",
            "dpc": "03010107901",
            "name": "ភិន វុទ្ធី ២"
        },
        {
            "barcode": "171118110",
            "dpc": "03010108001",
            "name": "ម៉ៅ ម៉ន"
        },
        {
            "barcode": "171118111",
            "dpc": "03010108101",
            "name": "អេង ណាង"
        },
        {
            "barcode": "171118112",
            "dpc": "03010108201",
            "name": "លី គឹមសាន្ត"
        },
        {
            "barcode": "171118113",
            "dpc": "03010108301",
            "name": "ជៀម ជិន"
        },
        {
            "barcode": "171118114",
            "dpc": "03010108401",
            "name": "ហ៊ុយ ឈឿន"
        },
        {
            "barcode": "171118115",
            "dpc": "03010108501",
            "name": "ប៊ុន បឿន"
        },
        {
            "barcode": "171118116",
            "dpc": "03010108601",
            "name": "ខៀវ សំហាត"
        },
        {
            "barcode": "171118117",
            "dpc": "03010108701",
            "name": "ហាត់ ឡៃឡែ"
        },
        {
            "barcode": "171118118",
            "dpc": "03010108801",
            "name": "វ៉ឹង ហុង"
        },
        {
            "barcode": "171118119",
            "dpc": "03010108901",
            "name": "យឹម យីន"
        },
        {
            "barcode": "171118120",
            "dpc": "03010107801",
            "name": "ភិន វុទ្ធី ១"
        },
        {
            "barcode": "171118121",
            "dpc": "03010109001",
            "name": "សូ កិធិ"
        },
        {
            "barcode": "171118122",
            "dpc": "03010109101",
            "name": "ម៉ី វណ្ណារ៉េត"
        },
        {
            "barcode": "171118123",
            "dpc": "03010109201",
            "name": "សុក រ៉ិត"
        },
        {
            "barcode": "171118124",
            "dpc": "03010109301",
            "name": "ស្ងួន សុផល"
        },
        {
            "barcode": "171118125",
            "dpc": "03010109401",
            "name": "ផាយ សុភ័ក្រ"
        },
        {
            "barcode": "171118126",
            "dpc": "03010109501",
            "name": "ដែង ចន្ធូ"
        },
        {
            "barcode": "171118127",
            "dpc": "03010109601",
            "name": "តែ សេងហ៊ីម"
        },
        {
            "barcode": "171118128",
            "dpc": "03010109701",
            "name": "លាន បុប្ផា"
        },
        {
            "barcode": "171118129",
            "dpc": "03010109801",
            "name": "សេង វ៉ាស៊ីន"
        },
        {
            "barcode": "171118130",
            "dpc": "03010109901",
            "name": "ផែ សុខ"
        },
        {
            "barcode": "171118131",
            "dpc": "03010110101",
            "name": "អួន វុន ១"
        },
        {
            "barcode": "171118132",
            "dpc": "03010110201",
            "name": "អួន វុន ២"
        },
        {
            "barcode": "171118133",
            "dpc": "03010110301",
            "name": "អួន ផល្លី"
        },
        {
            "barcode": "171118134",
            "dpc": "03010110501",
            "name": "គុយ គឹមឈន"
        },
        {
            "barcode": "171118135",
            "dpc": "03010110801",
            "name": "គង ជិនហោ"
        },
        {
            "barcode": "171118136",
            "dpc": "03010110401",
            "name": "សុង គឹមលាភ"
        },
        {
            "barcode": "171118137",
            "dpc": "03010110601",
            "name": "ទុយ សិទ្ធ"
        },
        {
            "barcode": "171118138",
            "dpc": "03010110701",
            "name": "ហេង សុទីនី"
        },
        {
            "barcode": "171118139",
            "dpc": "03010121201",
            "name": "ខៀវ សែ"
        },
        {
            "barcode": "171118140",
            "dpc": "03010121301",
            "name": "ហម សំបូរ"
        },
        {
            "barcode": "171118141",
            "dpc": "03010121401",
            "name": "គឹម បូរិន"
        },
        {
            "barcode": "171118142",
            "dpc": "03010121601",
            "name": "សឿម ដៀប"
        },
        {
            "barcode": "171118143",
            "dpc": "03010122201",
            "name": "លឹម គឹមអេង"
        },
        {
            "barcode": "171118144",
            "dpc": "03010122001",
            "name": "ម៉ក់ ណាគ្រី"
        },
        {
            "barcode": "171118145",
            "dpc": "03010122101",
            "name": "អ៊ឹង ធឹង"
        },
        {
            "barcode": "171118146",
            "dpc": "03010121801",
            "name": "លឿង សារ៉ុន"
        },
        {
            "barcode": "171118147",
            "dpc": "03010121901",
            "name": "ឆាំ សុខា"
        },
        {
            "barcode": "171118148",
            "dpc": "03010122301",
            "name": "សឿ រៀន"
        },
        {
            "barcode": "171118149",
            "dpc": "03010122401",
            "name": "សឿ រិទ្ធ"
        },
        {
            "barcode": "171118150",
            "dpc": "03010122501",
            "name": "ថឹក ម៉ៅ"
        },
        {
            "barcode": "171118151",
            "dpc": "03010122601",
            "name": "ចាន់ គារ"
        },
        {
            "barcode": "171118152",
            "dpc": "03010122901",
            "name": "ថង ដេក"
        },
        {
            "barcode": "171118153",
            "dpc": "03010123001",
            "name": "ចាយ  សារ៉ាន"
        },
        {
            "barcode": "171118154",
            "dpc": "03010123101",
            "name": "សោម សាមុត"
        },
        {
            "barcode": "171118155",
            "dpc": "03010123201",
            "name": "វ៉ាន់ រិទ្ធី"
        },
        {
            "barcode": "171118156",
            "dpc": "03010123301",
            "name": "ហេង ដាវុធ"
        },
        {
            "barcode": "171118157",
            "dpc": "03010123401",
            "name": "ឈុំ ឈួន"
        },
        {
            "barcode": "171118158",
            "dpc": "03010123501",
            "name": "សៅ ញិប"
        },
        {
            "barcode": "171118159",
            "dpc": "03010120201",
            "name": "កែ ខាន់ថន"
        },
        {
            "barcode": "171118160",
            "dpc": "03010120301",
            "name": "ជា យ៉ុង"
        },
        {
            "barcode": "171118161",
            "dpc": "03010120501",
            "name": "ឆាន់ កង"
        },
        {
            "barcode": "171118162",
            "dpc": "03010120601",
            "name": "លឹម សុវណ្ណរិទ្ធ"
        },
        {
            "barcode": "171118163",
            "dpc": "03010120701",
            "name": "ប្រាក់ សូដាវី"
        },
        {
            "barcode": "171118164",
            "dpc": "03010120801",
            "name": "ម៉ាត់ ផល្លី"
        },
        {
            "barcode": "171118165",
            "dpc": "03010120901",
            "name": "អ៊ុយ សារឿន"
        },
        {
            "barcode": "171118166",
            "dpc": "03010121001",
            "name": "ចាយ សារៀន"
        },
        {
            "barcode": "171118167",
            "dpc": "03010121101",
            "name": "យស់ យឿន"
        },
        {
            "barcode": "171118168",
            "dpc": "03010123601",
            "name": "កា រ៉េត"
        },
        {
            "barcode": "171118169",
            "dpc": "03010123701",
            "name": "ស៊ុន សុគន្ធា"
        },
        {
            "barcode": "171118170",
            "dpc": "03010123801",
            "name": "ឡេង រដ្ឋា"
        },
        {
            "barcode": "171118171",
            "dpc": "03010123901",
            "name": "យន់ ប្រម"
        },
        {
            "barcode": "171118172",
            "dpc": "03010124001",
            "name": "ម៉ឹង ម៉ៅ"
        },
        {
            "barcode": "171118173",
            "dpc": "03010124201",
            "name": "ជុក ជួម"
        },
        {
            "barcode": "171118174",
            "dpc": "03010124301",
            "name": "វ៉ាន់ ថា"
        },
        {
            "barcode": "171118175",
            "dpc": "03010124401",
            "name": "អោម ចាន់ថា"
        },
        {
            "barcode": "171118176",
            "dpc": "03010124501",
            "name": "ចាន់ ណៃ"
        },
        {
            "barcode": "171118177",
            "dpc": "03010124601",
            "name": "ផាន ថុល"
        },
        {
            "barcode": "171118178",
            "dpc": "03010124701",
            "name": "មាស កុសល"
        },
        {
            "barcode": "171118179",
            "dpc": "03010124801",
            "name": "ឡិ ប៊ុនលី"
        },
        {
            "barcode": "171118180",
            "dpc": "03010124901",
            "name": "ឆាន់ ឈី"
        },
        {
            "barcode": "171118181",
            "dpc": "03010125001",
            "name": "ឌិ  កុសល់"
        },
        {
            "barcode": "171118182",
            "dpc": "03010125101",
            "name": "ខ្លូត វ៉ាន់ឆៃ"
        },
        {
            "barcode": "171118183",
            "dpc": "03010125201",
            "name": "ភេម សុគុន"
        },
        {
            "barcode": "171118184",
            "dpc": "03010125301",
            "name": "សួស វ៉ាន់ថា"
        },
        {
            "barcode": "171118185",
            "dpc": "03010125401",
            "name": "ខៀវ សារី"
        },
        {
            "barcode": "171118186",
            "dpc": "03010125701",
            "name": "អ៊ីវ វ៉ាន់ដេត"
        },
        {
            "barcode": "171118187",
            "dpc": "03010125501",
            "name": "លឹម ហាក់ហេង"
        },
        {
            "barcode": "171118188",
            "dpc": "03010125801",
            "name": "ម៉ាន់ រ៉េត"
        },
        {
            "barcode": "171118189",
            "dpc": "03010125901",
            "name": "ហុក ជាល្លី"
        },
        {
            "barcode": "171118190",
            "dpc": "03010126001",
            "name": "គឹម ប៊ុនទិត"
        },
        {
            "barcode": "171118191",
            "dpc": "03010126201",
            "name": "គឹម ញិប"
        },
        {
            "barcode": "171118192",
            "dpc": "03010126301",
            "name": "លី រ៉ានី"
        },
        {
            "barcode": "171118193",
            "dpc": "03010126501",
            "name": "ស សុធិ"
        },
        {
            "barcode": "171118194",
            "dpc": "03010126601",
            "name": "ហៃ សាន"
        },
        {
            "barcode": "171118195",
            "dpc": "03010126701",
            "name": "ប៉ា ហឿន"
        },
        {
            "barcode": "171118196",
            "dpc": "03010126801",
            "name": "ស៊ីម អួន"
        },
        {
            "barcode": "171118197",
            "dpc": "03010126901",
            "name": "រើន នី"
        },
        {
            "barcode": "171118198",
            "dpc": "03010127001",
            "name": "លឹម ស៊ីចេង"
        },
        {
            "barcode": "171118199",
            "dpc": "03010127101",
            "name": "លឹម ទី"
        },
        {
            "barcode": "171118200",
            "dpc": "03010127401",
            "name": "ខៃ សៃ"
        },
        {
            "barcode": "171118201",
            "dpc": "03010127501",
            "name": "ម៉ៅ ហួយ"
        },
        {
            "barcode": "171118202",
            "dpc": "03010127601",
            "name": "សាយ សូនី"
        },
        {
            "barcode": "171118203",
            "dpc": "03010103101",
            "name": "ប៊ុន ទូច"
        },
        {
            "barcode": "171118204",
            "dpc": "03010118701",
            "name": "ជា រៈវ៉ិត"
        },
        {
            "barcode": "171118205",
            "dpc": "03010118801",
            "name": "តាន់ ឃុនរដ្ឋា"
        },
        {
            "barcode": "171118206",
            "dpc": "03010119001",
            "name": "សុខ វី"
        },
        {
            "barcode": "171118207",
            "dpc": "03010119101",
            "name": "បេង សុវណ្ណ"
        },
        {
            "barcode": "171118208",
            "dpc": "03010119201",
            "name": "ឌិត វ៉ាន់ដន"
        },
        {
            "barcode": "171118209",
            "dpc": "03010119401",
            "name": "តាំង  ម៉េងអាន ១"
        },
        {
            "barcode": "171118210",
            "dpc": "03010119601",
            "name": "តាំង  ម៉េងអាន ២"
        },
        {
            "barcode": "171118211",
            "dpc": "03010119801",
            "name": "សាន បៀន"
        },
        {
            "barcode": "171118212",
            "dpc": "03010119901",
            "name": "ផា សុផាត"
        },
        {
            "barcode": "171118213",
            "dpc": "03010120001",
            "name": "ឃឹម សាខន"
        },
        {
            "barcode": "171118214",
            "dpc": "03010127701",
            "name": "វិញ ង៉ោស៊ី"
        },
        {
            "barcode": "171118215",
            "dpc": "03010127801",
            "name": "វ៉ាន់ ម៉ម"
        },
        {
            "barcode": "171118216",
            "dpc": "03010127901",
            "name": "ម៉ាន សុធា"
        },
        {
            "barcode": "171118217",
            "dpc": "03010128001",
            "name": "ង៉ែត ផេង"
        },
        {
            "barcode": "171118218",
            "dpc": "03010128101",
            "name": "មុយ ឡេង"
        },
        {
            "barcode": "171118219",
            "dpc": "03010128201",
            "name": "សាត វត្ថា"
        },
        {
            "barcode": "171118220",
            "dpc": "03010128301",
            "name": "ជា ប៊ុនលឿត"
        },
        {
            "barcode": "171118221",
            "dpc": "03010128501",
            "name": "ហ៊ិន ឃៀន"
        },
        {
            "barcode": "171118222",
            "dpc": "03010128601",
            "name": "គី ហៀង"
        },
        {
            "barcode": "171118223",
            "dpc": "03010128701",
            "name": "ម៉េង ហៀង"
        },
        {
            "barcode": "171118224",
            "dpc": "03010128901",
            "name": "ចាប គួយ"
        },
        {
            "barcode": "171118225",
            "dpc": "03010129101",
            "name": "ជ រ៉ាឌី"
        },
        {
            "barcode": "171118226",
            "dpc": "03010129201",
            "name": "ហូយ ណាគ្រី"
        },
        {
            "barcode": "171118227",
            "dpc": "03010129301",
            "name": "តាំង  សេង"
        },
        {
            "barcode": "171118228",
            "dpc": "03010129401",
            "name": "ឆាយ សុភ័ណ"
        },
        {
            "barcode": "171118229",
            "dpc": "03010129501",
            "name": "អ៊ុយ ម៉ាឡា"
        },
        {
            "barcode": "171118230",
            "dpc": "03010118201",
            "name": "ប៉ិច  កន្ទុយគោ"
        },
        {
            "barcode": "171118231",
            "dpc": "03010118301",
            "name": "ចៅ ឈឿង"
        },
        {
            "barcode": "171118232",
            "dpc": "03010118401",
            "name": "លី គឹមសៀន ១"
        },
        {
            "barcode": "171118233",
            "dpc": "03010118501",
            "name": "គឹម ថៃ"
        },
        {
            "barcode": "171118234",
            "dpc": "03010129601",
            "name": "ជា ផាត"
        },
        {
            "barcode": "171118235",
            "dpc": "03010129701",
            "name": "ហាក់ អេង"
        },
        {
            "barcode": "171118236",
            "dpc": "03010129801",
            "name": "គួ លន់"
        },
        {
            "barcode": "171118237",
            "dpc": "03010130001",
            "name": "សៀម ឡាយ"
        },
        {
            "barcode": "171118238",
            "dpc": "03010130101",
            "name": "ទុយ ទូច"
        },
        {
            "barcode": "171118239",
            "dpc": "03010130201",
            "name": "ផ្លឹង សំអឿន"
        },
        {
            "barcode": "171118240",
            "dpc": "03010130301",
            "name": "អ៊ុក  វណ្ណថា"
        },
        {
            "barcode": "171118241",
            "dpc": "03010130401",
            "name": "ចាន់ សុផល"
        },
        {
            "barcode": "171118242",
            "dpc": "03010130701",
            "name": "ហេង ណារិន"
        },
        {
            "barcode": "171118243",
            "dpc": "03010130801",
            "name": "ជ្រឹង ចាន់បូ"
        },
        {
            "barcode": "171118244",
            "dpc": "03010130901",
            "name": "អ៊ុយ សុផាត"
        },
        {
            "barcode": "171118245",
            "dpc": "03010131201",
            "name": "អៀប សេង"
        },
        {
            "barcode": "171118246",
            "dpc": "03010131301",
            "name": "អ៊ាប សុខឿន"
        },
        {
            "barcode": "171118247",
            "dpc": "03010131401",
            "name": "គឹម ស៊ុន"
        },
        {
            "barcode": "171118248",
            "dpc": "03010131501",
            "name": "ហៀក  ខ្លា"
        },
        {
            "barcode": "171118249",
            "dpc": "03010131601",
            "name": "ឡាំ ធីសុរិន"
        },
        {
            "barcode": "171118250",
            "dpc": "03010131701",
            "name": "យក់ អឿ"
        },
        {
            "barcode": "171118251",
            "dpc": "03010131801",
            "name": "វុន តូយ"
        },
        {
            "barcode": "171118252",
            "dpc": "03010131901",
            "name": "អ៊ុន សុខា"
        },
        {
            "barcode": "171118253",
            "dpc": "03010132001",
            "name": "ដួង ទូច"
        },
        {
            "barcode": "171118254",
            "dpc": "03010132101",
            "name": "ទី តូ"
        },
        {
            "barcode": "171118255",
            "dpc": "03010132301",
            "name": "សល់ មិថុនា"
        },
        {
            "barcode": "171118256",
            "dpc": "03010132501",
            "name": "សេង យឿម"
        },
        {
            "barcode": "171118257",
            "dpc": "03010132601",
            "name": "សេង ឈុនឃី"
        },
        {
            "barcode": "171118258",
            "dpc": "03010132801",
            "name": "ម៉ៅ សុខ"
        },
        {
            "barcode": "171118259",
            "dpc": "03010132901",
            "name": "ហោ ប៉េងសៀង"
        },
        {
            "barcode": "171118260",
            "dpc": "03010133001",
            "name": "លឹម អូន"
        },
        {
            "barcode": "171118261",
            "dpc": "03010133101",
            "name": "ម៉ាត់ នៅ"
        },
        {
            "barcode": "171118262",
            "dpc": "03010133201",
            "name": "សុខ ស៊ីវង្ស"
        },
        {
            "barcode": "171118263",
            "dpc": "03010133301",
            "name": "អាង  ភាព"
        },
        {
            "barcode": "171118264",
            "dpc": "03010133401",
            "name": "ម៉ាន យ៉ុម"
        },
        {
            "barcode": "171118265",
            "dpc": "03010133501",
            "name": "ជា គឹមឡុង"
        },
        {
            "barcode": "171118266",
            "dpc": "03010133601",
            "name": "ជា សាប់"
        },
        {
            "barcode": "171118267",
            "dpc": "03010133701",
            "name": "អ៊ិត សុភាព"
        },
        {
            "barcode": "171118268",
            "dpc": "03010133801",
            "name": "គុន មុន្នី"
        },
        {
            "barcode": "171118269",
            "dpc": "03010133901",
            "name": "ហេង ថូ"
        },
        {
            "barcode": "171118270",
            "dpc": "03010134001",
            "name": "សំ សុខ"
        },
        {
            "barcode": "171118271",
            "dpc": "03010134101",
            "name": "គាន់ បូគង់"
        },
        {
            "barcode": "171118272",
            "dpc": "03010134301",
            "name": "គួយ តូ"
        },
        {
            "barcode": "171118273",
            "dpc": "03010134501",
            "name": "ឈឹម សំអាត"
        },
        {
            "barcode": "171118274",
            "dpc": "03010134601",
            "name": "ហុក វន"
        },
        {
            "barcode": "171118275",
            "dpc": "03010134701",
            "name": "ខ្វែក ផាត់"
        },
        {
            "barcode": "171118276",
            "dpc": "03010134901",
            "name": "ឆេង គឹមណៃ"
        },
        {
            "barcode": "171118277",
            "dpc": "03010135001",
            "name": "កែង ស៊ីថា"
        },
        {
            "barcode": "171118278",
            "dpc": "03010135201",
            "name": "ធៀម ប៊ុនសែ"
        },
        {
            "barcode": "171118279",
            "dpc": "03010135301",
            "name": "ថៃ ស្រីពៅ"
        },
        {
            "barcode": "171118280",
            "dpc": "03010100101",
            "name": "វិន នល់"
        },
        {
            "barcode": "171118281",
            "dpc": "03010100201",
            "name": "ចៅ យ៉ាន់"
        },
        {
            "barcode": "171118282",
            "dpc": "03010100301",
            "name": "ចៅ ភិរម្យ"
        },
        {
            "barcode": "171118283",
            "dpc": "03010100401",
            "name": "សួង សុផល"
        },
        {
            "barcode": "171118284",
            "dpc": "03010100501",
            "name": "អឿ គឹមឈន"
        },
        {
            "barcode": "171118285",
            "dpc": "03010100601",
            "name": "អ៊ាប លឹមហុង"
        },
        {
            "barcode": "171118286",
            "dpc": "03010100701",
            "name": "ប៊ូ វ៉ាឡៃ"
        },
        {
            "barcode": "171118287",
            "dpc": "03010100801",
            "name": "យ៉ាន សាលី"
        },
        {
            "barcode": "171118288",
            "dpc": "03010100901",
            "name": "តុម ចាន់ផល្លា"
        },
        {
            "barcode": "171118289",
            "dpc": "03010101001",
            "name": "ជេត សាត"
        },
        {
            "barcode": "171118290",
            "dpc": "03010101101",
            "name": "នូវ ចាន់ដាវី"
        },
        {
            "barcode": "171118291",
            "dpc": "03010101201",
            "name": "គុយ គឹមផាន"
        },
        {
            "barcode": "171118292",
            "dpc": "03010101301",
            "name": "ស៊ីន ថ្លាង"
        },
        {
            "barcode": "171118293",
            "dpc": "03010101401",
            "name": "ស៊ីន ប៊ុណ្ណា"
        },
        {
            "barcode": "171118294",
            "dpc": "03010101501",
            "name": "យ៉ន បូរ៉ា"
        },
        {
            "barcode": "171118295",
            "dpc": "03010101601",
            "name": "ចៅ ចាន់"
        },
        {
            "barcode": "171118296",
            "dpc": "03010101701",
            "name": "ង៉ែត ប្រម"
        },
        {
            "barcode": "171118297",
            "dpc": "03010101801",
            "name": "ចាន់ មួយគា"
        },
        {
            "barcode": "171118298",
            "dpc": "03010101901",
            "name": "លឿង ស៊ីម"
        },
        {
            "barcode": "171118299",
            "dpc": "03010102001",
            "name": "ឆាត់ ឆាយឆដា"
        },
        {
            "barcode": "171118300",
            "dpc": "03010102101",
            "name": "សួ ប៊ុណ្ណារ៉ុង"
        },
        {
            "barcode": "171118301",
            "dpc": "03010102201",
            "name": "លី គឹមឃន ១"
        },
        {
            "barcode": "171118302",
            "dpc": "03010102301",
            "name": "ទឹម សុធិន"
        },
        {
            "barcode": "171118303",
            "dpc": "03010102401",
            "name": "លី គឹមឃន ២"
        },
        {
            "barcode": "171118304",
            "dpc": "03010102501",
            "name": "ប៊ុន រ៉ា"
        },
        {
            "barcode": "171118305",
            "dpc": "03010102601",
            "name": "ហួន សាយ"
        },
        {
            "barcode": "171118306",
            "dpc": "03010102801",
            "name": "សុន ជៀក"
        },
        {
            "barcode": "171118307",
            "dpc": "03010102901",
            "name": "សុខ ឃាង"
        },
        {
            "barcode": "171118308",
            "dpc": "03010103501",
            "name": "ហេង ចាន់ធា"
        },
        {
            "barcode": "171118309",
            "dpc": "03010103001",
            "name": "ឃុន ឡុង"
        },
        {
            "barcode": "171118310",
            "dpc": "03010103201",
            "name": "អួង សន"
        },
        {
            "barcode": "171118311",
            "dpc": "03010103301",
            "name": "ស៊ីន សំអាត"
        },
        {
            "barcode": "171118312",
            "dpc": "03010103401",
            "name": "សៀក ឌី"
        },
        {
            "barcode": "171118313",
            "dpc": "03010103701",
            "name": "ឈា កៀង"
        },
        {
            "barcode": "171118314",
            "dpc": "03010103801",
            "name": "អៀង វត្តី"
        },
        {
            "barcode": "171118315",
            "dpc": "03010103901",
            "name": "គុណ ណារី"
        },
        {
            "barcode": "171118316",
            "dpc": "03010104901",
            "name": "សាលាឃុំរតនៈ"
        },
        {
            "barcode": "171118317",
            "dpc": "03010104101",
            "name": "វង៉ ថាជឹង"
        },
        {
            "barcode": "171118318",
            "dpc": "03010104201",
            "name": "ងី វណ្ណៈ"
        },
        {
            "barcode": "171118319",
            "dpc": "03010104401",
            "name": "ប៊ុង ឡុង"
        },
        {
            "barcode": "171118320",
            "dpc": "03010104801",
            "name": "ឈឿង វ៉ាន់"
        },
        {
            "barcode": "171118321",
            "dpc": "03010104601",
            "name": "ខាត់ សារ៉ន"
        },
        {
            "barcode": "171118322",
            "dpc": "03010104701",
            "name": "ហែម គឹមហូរ"
        },
        {
            "barcode": "171118323",
            "dpc": "03010105001",
            "name": "សំ សារិន"
        },
        {
            "barcode": "171118324",
            "dpc": "03010105101",
            "name": "លី សេង"
        },
        {
            "barcode": "171118325",
            "dpc": "03010105201",
            "name": "សល់ ហ៊ីង"
        },
        {
            "barcode": "171118326",
            "dpc": "03010105401",
            "name": "ចក់ សារឿម"
        },
        {
            "barcode": "171118327",
            "dpc": "03010105501",
            "name": "កែវ ចំរើន"
        },
        {
            "barcode": "171118328",
            "dpc": "03010105601",
            "name": "វណ្ណ វុទ្ធី"
        },
        {
            "barcode": "171118329",
            "dpc": "03010105701",
            "name": "ហ៊ុយ ផាន់ណា"
        },
        {
            "barcode": "171118330",
            "dpc": "03010105801",
            "name": "លឹម ប៊ុនធឿន"
        },
        {
            "barcode": "171118331",
            "dpc": "03010105901",
            "name": "លី សេងស្រួយ"
        },
        {
            "barcode": "171118332",
            "dpc": "03010106001",
            "name": "លី គក់"
        },
        {
            "barcode": "171118333",
            "dpc": "03010106101",
            "name": "ឈៀង តូ ១"
        },
        {
            "barcode": "171118334",
            "dpc": "03010106201",
            "name": "ឈៀង តូ ២"
        },
        {
            "barcode": "171118335",
            "dpc": "03010106301",
            "name": "លន់ សំប៊ី"
        },
        {
            "barcode": "171118336",
            "dpc": "03010106401",
            "name": "អ៊ុក ផារី"
        },
        {
            "barcode": "171118337",
            "dpc": "03010106501",
            "name": "ឌុក សាវុធ"
        },
        {
            "barcode": "171118338",
            "dpc": "03010106601",
            "name": "សុក សំអ៊ុល"
        },
        {
            "barcode": "171118339",
            "dpc": "03010106701",
            "name": "ឌុក ស៊ីនួន"
        },
        {
            "barcode": "171118340",
            "dpc": "03010106801",
            "name": "ង៉ែត សារ៉ន"
        },
        {
            "barcode": "171118341",
            "dpc": "03010112301",
            "name": "ជឹង យូហួត"
        },
        {
            "barcode": "171118342",
            "dpc": "03010107201",
            "name": "ឡុង ម៉ាដា ៤"
        },
        {
            "barcode": "171118343",
            "dpc": "03010107101",
            "name": "ឡុង ម៉ាដា ៣"
        },
        {
            "barcode": "171118344",
            "dpc": "03010106901",
            "name": "ឡុង ម៉ាដា ១"
        },
        {
            "barcode": "171118345",
            "dpc": "03010111901",
            "name": "ឆាយ ហេង"
        },
        {
            "barcode": "171118346",
            "dpc": "03010114601",
            "name": "គឹម អាន ១"
        },
        {
            "barcode": "171118347",
            "dpc": "03010114701",
            "name": "ទេព វ៉ិត"
        },
        {
            "barcode": "171118348",
            "dpc": "03010114501",
            "name": "ម៉េង ហ៊ុយ"
        },
        {
            "barcode": "171118349",
            "dpc": "03010114301",
            "name": "ប៊ូ បូរ៉ា"
        },
        {
            "barcode": "171118350",
            "dpc": "03010113901",
            "name": "ឡៅ ជីងហ៊ួរ"
        },
        {
            "barcode": "171118351",
            "dpc": "03010113301",
            "name": "ខៀវ ថោង"
        },
        {
            "barcode": "171118352",
            "dpc": "03010113101",
            "name": "តូ ដារ៉ា ២"
        },
        {
            "barcode": "171118353",
            "dpc": "03010113001",
            "name": "ធៀន រស់"
        },
        {
            "barcode": "171118354",
            "dpc": "03010112901",
            "name": "ហ៊ីម ចាន់ដារ៉ា"
        },
        {
            "barcode": "171118355",
            "dpc": "03010112801",
            "name": "ប៊ូយ ហ៊ីម"
        },
        {
            "barcode": "171118356",
            "dpc": "03010112701",
            "name": "គុជ ជ"
        },
        {
            "barcode": "171118357",
            "dpc": "03010112601",
            "name": "អ៊ុក ផលលឿន"
        },
        {
            "barcode": "171118358",
            "dpc": "03010112501",
            "name": "លី ម៉េង"
        },
        {
            "barcode": "171118359",
            "dpc": "03010112401",
            "name": "ហេង ម៉ៅ"
        },
        {
            "barcode": "171118360",
            "dpc": "03010112201",
            "name": "សុខ ឃីម"
        },
        {
            "barcode": "171118361",
            "dpc": "03010113401",
            "name": "សេង   លាភ"
        },
        {
            "barcode": "171118362",
            "dpc": "03010113501",
            "name": "រៀម  ផល្លី"
        },
        {
            "barcode": "171118363",
            "dpc": "03010113701",
            "name": "គឹម  សុផៃ"
        },
        {
            "barcode": "171118364",
            "dpc": "03010113801",
            "name": "ជួន  អៀន ១"
        },
        {
            "barcode": "171118365",
            "dpc": "03010114001",
            "name": "ប្លុង   សុផាន់ឌី"
        },
        {
            "barcode": "171118366",
            "dpc": "03010114101",
            "name": "ឈុន  សុផល"
        },
        {
            "barcode": "171118367",
            "dpc": "03010110901",
            "name": "ម៉េង ប៊ុនឡៃ"
        },
        {
            "barcode": "171118368",
            "dpc": "03010111001",
            "name": "ហ៊ុយ ចេន"
        },
        {
            "barcode": "171118369",
            "dpc": "03010111101",
            "name": "ម៉ៅ សារ៉ាត ១"
        },
        {
            "barcode": "171118370",
            "dpc": "03010111401",
            "name": "ផា ភាព"
        },
        {
            "barcode": "171118371",
            "dpc": "03010111301",
            "name": "ឡឹម ស៊ីម"
        },
        {
            "barcode": "171118372",
            "dpc": "03010111501",
            "name": "ពេជ្រ សុគន្ធ"
        },
        {
            "barcode": "171118373",
            "dpc": "03010111701",
            "name": "ថាប់ ចិន"
        },
        {
            "barcode": "171118374",
            "dpc": "03010111601",
            "name": "ម៉ៅ សារ៉ាត ២"
        },
        {
            "barcode": "171118375",
            "dpc": "03010112001",
            "name": "ជ្រឹង រី"
        },
        {
            "barcode": "171118376",
            "dpc": "03010111801",
            "name": "អ៊ូ សាវ៉ុង"
        },
        {
            "barcode": "171118377",
            "dpc": "03010139701",
            "name": "អឿន  សាវុន"
        },
        {
            "barcode": "171118378",
            "dpc": "03010116201",
            "name": "អេង  ធា"
        },
        {
            "barcode": "171118379",
            "dpc": "03010116601",
            "name": "ហៀង  សុធី"
        },
        {
            "barcode": "171118380",
            "dpc": "03010116701",
            "name": "គឹម  វេង"
        },
        {
            "barcode": "171118381",
            "dpc": "03010116801",
            "name": "ហៃ  លី"
        },
        {
            "barcode": "171118382",
            "dpc": "03010116901",
            "name": "ហ៊ុយ  យាន"
        },
        {
            "barcode": "171118383",
            "dpc": "03010117001",
            "name": "ឃុយ  ងី"
        },
        {
            "barcode": "171118384",
            "dpc": "03010117101",
            "name": "លី  គឹមស៊ា"
        },
        {
            "barcode": "171118385",
            "dpc": "03010117201",
            "name": "អ៊ឹម  តាន់យ៉ា"
        },
        {
            "barcode": "171118386",
            "dpc": "03010117301",
            "name": "ប៉ាល់ គឹមស៊ាង"
        },
        {
            "barcode": "171118387",
            "dpc": "03010117401",
            "name": "ជ្រា    ស្រីមុំ"
        },
        {
            "barcode": "171118388",
            "dpc": "03010117501",
            "name": "នូវ  ឈាងហ៊ត"
        },
        {
            "barcode": "171118389",
            "dpc": "03010117601",
            "name": "លឹម  ហេង"
        },
        {
            "barcode": "171118390",
            "dpc": "03010117701",
            "name": "សោម  យូអូន"
        },
        {
            "barcode": "171118391",
            "dpc": "03010117801",
            "name": "វង្ស   យូ"
        },
        {
            "barcode": "171118392",
            "dpc": "03010117901",
            "name": "នូ  ផល្លី"
        },
        {
            "barcode": "171118393",
            "dpc": "03010118901",
            "name": "ឆាយ  ហេង"
        },
        {
            "barcode": "171118394",
            "dpc": "03010119701",
            "name": "មូល  សុង"
        },
        {
            "barcode": "171118395",
            "dpc": "03010122701",
            "name": "គឹម   ប៉ូ"
        },
        {
            "barcode": "171118396",
            "dpc": "03010126401",
            "name": "ឈឹម  គឹមសៀង"
        },
        {
            "barcode": "171118397",
            "dpc": "03010129001",
            "name": "គង់  ឃៀន"
        },
        {
            "barcode": "171118398",
            "dpc": "03010135101",
            "name": "រស់  សារ៉េត"
        },
        {
            "barcode": "171118399",
            "dpc": "03010137001",
            "name": "ហៀង   សុធី"
        },
        {
            "barcode": "171118400",
            "dpc": "03010140401",
            "name": "សុខ  សារឿន"
        },
        {
            "barcode": "171118401",
            "dpc": "03010140601",
            "name": "ឈឹន  សុគន្ធា"
        },
        {
            "barcode": "171118402",
            "dpc": "03010148001",
            "name": "ជឹម ប៊ុនធឿន"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});

