let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171120416",
            "dpc": "03010239001",
            "name": "ថង សារ៉េត"
        },
        {
            "barcode": "171120417",
            "dpc": "03010213001",
            "name": "សុខ គុណរិទ្ធ"
        },
        {
            "barcode": "171120418",
            "dpc": "03010212701",
            "name": "អោម ផល្លា"
        },
        {
            "barcode": "171120419",
            "dpc": "03010212901",
            "name": "ទិត សុខា ២"
        },
        {
            "barcode": "171120420",
            "dpc": "03010210501",
            "name": "វ៉ាន វង្ស"
        },
        {
            "barcode": "171120421",
            "dpc": "03010210601",
            "name": "ម៉ុង ចាន់សារ័ត្ន"
        },
        {
            "barcode": "171120422",
            "dpc": "03010210701",
            "name": "លាង ធារី"
        },
        {
            "barcode": "171120423",
            "dpc": "03010210801",
            "name": "ជា សរ"
        },
        {
            "barcode": "171120424",
            "dpc": "03010210901",
            "name": "សៅ ទេពសត្ថា"
        },
        {
            "barcode": "171120425",
            "dpc": "03010211001",
            "name": "អឿ ផាន"
        },
        {
            "barcode": "171120426",
            "dpc": "03010211501",
            "name": "ប៊ុត ធូ"
        },
        {
            "barcode": "171120427",
            "dpc": "03010211101",
            "name": "យស់ សំបឿន"
        },
        {
            "barcode": "171120428",
            "dpc": "03010211201",
            "name": "ឡាយ ផាន្នី"
        },
        {
            "barcode": "171120429",
            "dpc": "03010211301",
            "name": "ឃូន សុខខេង"
        },
        {
            "barcode": "171120430",
            "dpc": "03010211601",
            "name": "ពេជ្រ ណូរ៉ែម"
        },
        {
            "barcode": "171120431",
            "dpc": "03010211701",
            "name": "នាង ចន្ធី"
        },
        {
            "barcode": "171120432",
            "dpc": "03010211901",
            "name": "ប៊ុន គង់"
        },
        {
            "barcode": "171120433",
            "dpc": "03010212001",
            "name": "គួច ប៊ុនលី"
        },
        {
            "barcode": "171120434",
            "dpc": "03010212101",
            "name": "ស្រេង គឹមស្រេង"
        },
        {
            "barcode": "171120435",
            "dpc": "03010212301",
            "name": "ម៉ៅ មួន"
        },
        {
            "barcode": "171120436",
            "dpc": "03010212401",
            "name": "ស៊ឹម លឹម"
        },
        {
            "barcode": "171120437",
            "dpc": "03010212501",
            "name": "យៀវ យ៉ុត"
        },
        {
            "barcode": "171120438",
            "dpc": "03010212601",
            "name": "យិន ឡាំ"
        },
        {
            "barcode": "171120439",
            "dpc": "03010211801",
            "name": "កៅ សារ៉េត"
        },
        {
            "barcode": "171120440",
            "dpc": "03010212201",
            "name": "ឆេង ពៅ"
        },
        {
            "barcode": "171120441",
            "dpc": "03010209301",
            "name": "វង្ស វៀត"
        },
        {
            "barcode": "171120442",
            "dpc": "03010209401",
            "name": "ហួត សុហេង"
        },
        {
            "barcode": "171120443",
            "dpc": "03010209501",
            "name": "នេត សុវណ្ណ"
        },
        {
            "barcode": "171120444",
            "dpc": "03010209601",
            "name": "ឃុន ឧត្តម"
        },
        {
            "barcode": "171120445",
            "dpc": "03010209701",
            "name": "ត្រឹង ឆោម"
        },
        {
            "barcode": "171120446",
            "dpc": "03010209801",
            "name": "ត្រឹង ឆាយ"
        },
        {
            "barcode": "171120447",
            "dpc": "03010209901",
            "name": "វ៉ាន់ ឡុញ"
        },
        {
            "barcode": "171120448",
            "dpc": "03010210001",
            "name": "អាត់ រ៉ាឌី"
        },
        {
            "barcode": "171120449",
            "dpc": "03010210201",
            "name": "អ៊ិត ហៃ"
        },
        {
            "barcode": "171120450",
            "dpc": "03010210301",
            "name": "ពូ ហ៊ាង"
        },
        {
            "barcode": "171120451",
            "dpc": "03010210401",
            "name": "កើត យុថា"
        },
        {
            "barcode": "171120452",
            "dpc": "03010208801",
            "name": "អ៊ាន លី"
        },
        {
            "barcode": "171120453",
            "dpc": "03010208501",
            "name": "ទូច វណ្ណា"
        },
        {
            "barcode": "171120454",
            "dpc": "03010208901",
            "name": "សោម ជឿង"
        },
        {
            "barcode": "171120455",
            "dpc": "03010209101",
            "name": "ឆុង ហ៊ី"
        },
        {
            "barcode": "171120456",
            "dpc": "03010209201",
            "name": "ប៉ូ ខេងរ៉ន"
        },
        {
            "barcode": "171120457",
            "dpc": "03010204701",
            "name": "ហ៊ី ពិសិទ្ធ"
        },
        {
            "barcode": "171120458",
            "dpc": "03010204801",
            "name": "គី វៀត"
        },
        {
            "barcode": "171120459",
            "dpc": "03010204901",
            "name": "ញ៉ែម ផៃ"
        },
        {
            "barcode": "171120460",
            "dpc": "03010205001",
            "name": "ស្រេង ហេង"
        },
        {
            "barcode": "171120461",
            "dpc": "03010205201",
            "name": "អ៊ាន រឿន"
        },
        {
            "barcode": "171120462",
            "dpc": "03010205301",
            "name": "គង់ សុខឃាង"
        },
        {
            "barcode": "171120463",
            "dpc": "03010205401",
            "name": "ព្រំ សៀង"
        },
        {
            "barcode": "171120464",
            "dpc": "03010205501",
            "name": "សៀង សុផល"
        },
        {
            "barcode": "171120465",
            "dpc": "03010205601",
            "name": "សាម គា"
        },
        {
            "barcode": "171120466",
            "dpc": "03010208101",
            "name": "នួន សាន"
        },
        {
            "barcode": "171120467",
            "dpc": "03010208301",
            "name": "ម៉ៅ ម៉ន"
        },
        {
            "barcode": "171120468",
            "dpc": "03010208401",
            "name": "ហៀង ហាញ់"
        },
        {
            "barcode": "171120469",
            "dpc": "03010208601",
            "name": "ណុប សាម៉ន"
        },
        {
            "barcode": "171120470",
            "dpc": "03010207101",
            "name": "តូច អេង"
        },
        {
            "barcode": "171120471",
            "dpc": "03010207201",
            "name": "ស្រស់ សារ៉ុម"
        },
        {
            "barcode": "171120472",
            "dpc": "03010207301",
            "name": "ចាន់ ធឿន"
        },
        {
            "barcode": "171120473",
            "dpc": "03010207401",
            "name": "អឿន សារុន"
        },
        {
            "barcode": "171120474",
            "dpc": "03010207501",
            "name": "ចៅ ឈីវី"
        },
        {
            "barcode": "171120475",
            "dpc": "03010207601",
            "name": "ឃួន ឈាន"
        },
        {
            "barcode": "171120476",
            "dpc": "03010207701",
            "name": "លី សុផល"
        },
        {
            "barcode": "171120477",
            "dpc": "03010207801",
            "name": "ខាត់ បូរិន"
        },
        {
            "barcode": "171120478",
            "dpc": "03010208001",
            "name": "ប៉ា ប៊ុនហាង"
        },
        {
            "barcode": "171120479",
            "dpc": "03010205801",
            "name": "តាំង ឈាងហួរ"
        },
        {
            "barcode": "171120480",
            "dpc": "03010205701",
            "name": "ភន ជិន"
        },
        {
            "barcode": "171120481",
            "dpc": "03010206001",
            "name": "នួន ស្នា"
        },
        {
            "barcode": "171120482",
            "dpc": "03010205901",
            "name": "នាក ជា"
        },
        {
            "barcode": "171120483",
            "dpc": "03010206101",
            "name": "ឡុង សេរីវុឌ្ឍៈ"
        },
        {
            "barcode": "171120484",
            "dpc": "03010206201",
            "name": "ជាម ដារ៉ា"
        },
        {
            "barcode": "171120485",
            "dpc": "03010206301",
            "name": "ម្លប់ស្បូវម៉ាលី"
        },
        {
            "barcode": "171120486",
            "dpc": "03010206401",
            "name": "ម្លប់ ឆាត់"
        },
        {
            "barcode": "171120487",
            "dpc": "03010206501",
            "name": "ឆាយ ទូច"
        },
        {
            "barcode": "171120488",
            "dpc": "03010206601",
            "name": "សេង ហឺ"
        },
        {
            "barcode": "171120489",
            "dpc": "03010206701",
            "name": "ជយ ហាង"
        },
        {
            "barcode": "171120490",
            "dpc": "03010206801",
            "name": "ថ្លាង ថារេត"
        },
        {
            "barcode": "171120491",
            "dpc": "03010236201",
            "name": "ទី លីនដូ"
        },
        {
            "barcode": "171120492",
            "dpc": "03010236101",
            "name": "ម៉ៅ ង៉ាវ"
        },
        {
            "barcode": "171120493",
            "dpc": "03010235901",
            "name": "គង់ សារឿន"
        },
        {
            "barcode": "171120494",
            "dpc": "03010236001",
            "name": "ហោ ភិរុណ"
        },
        {
            "barcode": "171120495",
            "dpc": "03010231501",
            "name": "សូម កុសល"
        },
        {
            "barcode": "171120496",
            "dpc": "03010221001",
            "name": "ប៊ុត ធូ"
        },
        {
            "barcode": "171120497",
            "dpc": "03010220801",
            "name": "ឡុង វ៉ាង"
        },
        {
            "barcode": "171120498",
            "dpc": "03010220701",
            "name": "ស៊ុន ស៊ុយ"
        },
        {
            "barcode": "171120499",
            "dpc": "03010220601",
            "name": "លន ប៊ុនឈន"
        },
        {
            "barcode": "171120500",
            "dpc": "03010220501",
            "name": "ធូ ប៊ុនធឿន"
        },
        {
            "barcode": "171120501",
            "dpc": "03010220401",
            "name": "អេង ណារ៉ុង"
        },
        {
            "barcode": "171120502",
            "dpc": "03010220301",
            "name": "ខុង ខន"
        },
        {
            "barcode": "171120503",
            "dpc": "03010220201",
            "name": "ស៊ុន រ៉ន"
        },
        {
            "barcode": "171120504",
            "dpc": "03010220101",
            "name": "កែវ វាសនា"
        },
        {
            "barcode": "171120505",
            "dpc": "03010220001",
            "name": "ភេង អង"
        },
        {
            "barcode": "171120506",
            "dpc": "03010219901",
            "name": "សំរិត នូ"
        },
        {
            "barcode": "171120507",
            "dpc": "03010219801",
            "name": "ស៊ឹម អឿន"
        },
        {
            "barcode": "171120508",
            "dpc": "03010219701",
            "name": "ហេង កៅ"
        },
        {
            "barcode": "171120509",
            "dpc": "03010219601",
            "name": "សាន ហោ"
        },
        {
            "barcode": "171120510",
            "dpc": "03010219501",
            "name": "ស៊ិន ហេង"
        },
        {
            "barcode": "171120511",
            "dpc": "03010219401",
            "name": "ស គឹមប៉ូ"
        },
        {
            "barcode": "171120512",
            "dpc": "03010219301",
            "name": "ឈឿង គឹមសុង"
        },
        {
            "barcode": "171120513",
            "dpc": "03010219201",
            "name": "វ៉ាត ពង់"
        },
        {
            "barcode": "171120514",
            "dpc": "03010219101",
            "name": "ទេស មាន"
        },
        {
            "barcode": "171120515",
            "dpc": "03010219001",
            "name": "ទេស ស៊ី"
        },
        {
            "barcode": "171120516",
            "dpc": "03010218801",
            "name": "ចិន អមរា"
        },
        {
            "barcode": "171120517",
            "dpc": "03010218701",
            "name": "សាន់ ផាន់ណា"
        },
        {
            "barcode": "171120518",
            "dpc": "03010218601",
            "name": "សាំង លាភ"
        },
        {
            "barcode": "171120519",
            "dpc": "03010218501",
            "name": "គិត ឆដា"
        },
        {
            "barcode": "171120520",
            "dpc": "03010218401",
            "name": "ជូ តុប"
        },
        {
            "barcode": "171120521",
            "dpc": "03010218301",
            "name": "លឹម សារ៉ែម"
        },
        {
            "barcode": "171120522",
            "dpc": "03010218201",
            "name": "យ៉ម ចំរើន ៦"
        },
        {
            "barcode": "171120523",
            "dpc": "03010218101",
            "name": "ឈូក  វណ្ណស៊ី"
        },
        {
            "barcode": "171120524",
            "dpc": "03010218001",
            "name": "ចៅ ហ៊ាង"
        },
        {
            "barcode": "171120525",
            "dpc": "03010217901",
            "name": "ឡៃ ហ៊ាង"
        },
        {
            "barcode": "171120526",
            "dpc": "03010217801",
            "name": "អ៊ុង សុភាព"
        },
        {
            "barcode": "171120527",
            "dpc": "03010217701",
            "name": "ចាន់ អាយ"
        },
        {
            "barcode": "171120528",
            "dpc": "03010217501",
            "name": "វ៉ន ឌៀប"
        },
        {
            "barcode": "171120529",
            "dpc": "03010217301",
            "name": "វង្ស យិន"
        },
        {
            "barcode": "171120530",
            "dpc": "03010217101",
            "name": "លឹម លីហឿប"
        },
        {
            "barcode": "171120531",
            "dpc": "03010217001",
            "name": "សុខ ស៊ីវង្ស"
        },
        {
            "barcode": "171120532",
            "dpc": "03010216901",
            "name": "ជាង ឡេង"
        },
        {
            "barcode": "171120533",
            "dpc": "03010216801",
            "name": "សុខ សុវណ្ណ"
        },
        {
            "barcode": "171120534",
            "dpc": "03010216101",
            "name": "ឈិន វណ្ណដា"
        },
        {
            "barcode": "171120535",
            "dpc": "03010216601",
            "name": "ហ៊ិន សំរេច"
        },
        {
            "barcode": "171120536",
            "dpc": "03010216501",
            "name": "អ៊ូច សុផល"
        },
        {
            "barcode": "171120537",
            "dpc": "03010216401",
            "name": "សេស សុខុម"
        },
        {
            "barcode": "171120538",
            "dpc": "03010216301",
            "name": "តាំង  អ៊ីវណាំ"
        },
        {
            "barcode": "171120539",
            "dpc": "03010216201",
            "name": "គឹម ជាតិ"
        },
        {
            "barcode": "171120540",
            "dpc": "03010216001",
            "name": "នាង ឯល"
        },
        {
            "barcode": "171120541",
            "dpc": "03010215901",
            "name": "សេង ស៊ន"
        },
        {
            "barcode": "171120542",
            "dpc": "03010215801",
            "name": "សុខ ធឿន"
        },
        {
            "barcode": "171120543",
            "dpc": "03010215701",
            "name": "គឹម សារ៉ន"
        },
        {
            "barcode": "171120544",
            "dpc": "03010215601",
            "name": "វង្ស ឡេង"
        },
        {
            "barcode": "171120545",
            "dpc": "03010215501",
            "name": "អៀង សុភៀង"
        },
        {
            "barcode": "171120546",
            "dpc": "03010215401",
            "name": "ឡេង មួយ"
        },
        {
            "barcode": "171120547",
            "dpc": "03010215301",
            "name": "អ៊ិន សេង"
        },
        {
            "barcode": "171120548",
            "dpc": "03010215201",
            "name": "នៅ ស៊ីយឿប"
        },
        {
            "barcode": "171120549",
            "dpc": "03010215001",
            "name": "ហួត  លី"
        },
        {
            "barcode": "171120550",
            "dpc": "03010214901",
            "name": "គឹម ចាន់ធូ"
        },
        {
            "barcode": "171120551",
            "dpc": "03010214801",
            "name": "ជៀម  ផារុំ"
        },
        {
            "barcode": "171120552",
            "dpc": "03010214701",
            "name": "គង់ ស៊ីណាត"
        },
        {
            "barcode": "171120553",
            "dpc": "03010214601",
            "name": "ទុយ ចិន្តា"
        },
        {
            "barcode": "171120554",
            "dpc": "03010214501",
            "name": "ផ្កាយ ភីណែ"
        },
        {
            "barcode": "171120555",
            "dpc": "03010214401",
            "name": "ហម ឆាយ"
        },
        {
            "barcode": "171120556",
            "dpc": "03010214301",
            "name": "ពុញ ឆៃ"
        },
        {
            "barcode": "171120557",
            "dpc": "03010214201",
            "name": "សឹង វិសាល"
        },
        {
            "barcode": "171120558",
            "dpc": "03010214101",
            "name": "ឆាយ អូន"
        },
        {
            "barcode": "171120559",
            "dpc": "03010213901",
            "name": "លឿង យីវ"
        },
        {
            "barcode": "171120560",
            "dpc": "03010213801",
            "name": "តន់ តូច"
        },
        {
            "barcode": "171120561",
            "dpc": "03010213701",
            "name": "អ៊ាង វុទ្ធី"
        },
        {
            "barcode": "171120562",
            "dpc": "03010213501",
            "name": "ដែង សុវណ្ណ"
        },
        {
            "barcode": "171120563",
            "dpc": "03010213401",
            "name": "អ៊ិន តាប់"
        },
        {
            "barcode": "171120564",
            "dpc": "03010213301",
            "name": "សេង យីវ"
        },
        {
            "barcode": "171120565",
            "dpc": "03010213201",
            "name": "លឹម អ៊ីនស្រ៊ុន"
        },
        {
            "barcode": "171120566",
            "dpc": "03010222401",
            "name": "ណុប ដារ៉ា ៣"
        },
        {
            "barcode": "171120567",
            "dpc": "03010222501",
            "name": "តាំង ឡូយ"
        },
        {
            "barcode": "171120568",
            "dpc": "03010222201",
            "name": "អ៊ាប ជីម៉ាន់"
        },
        {
            "barcode": "171120569",
            "dpc": "03010221901",
            "name": "ញ៉ិល  ច្រិច"
        },
        {
            "barcode": "171120570",
            "dpc": "03010222101",
            "name": "កៅ ស៊ាន"
        },
        {
            "barcode": "171120571",
            "dpc": "03010221701",
            "name": "ខា ខូយ"
        },
        {
            "barcode": "171120572",
            "dpc": "03010221801",
            "name": "ស៊ុត សឿង"
        },
        {
            "barcode": "171120573",
            "dpc": "03010221601",
            "name": "ប៊ុន ហៀង"
        },
        {
            "barcode": "171120574",
            "dpc": "03010221501",
            "name": "ប៊ុន លាង"
        },
        {
            "barcode": "171120575",
            "dpc": "03010221401",
            "name": "ឈុន លី"
        },
        {
            "barcode": "171120576",
            "dpc": "03010221201",
            "name": "ទូច  ញិប"
        },
        {
            "barcode": "171120577",
            "dpc": "03010221101",
            "name": "សុខ ហេង"
        },
        {
            "barcode": "171120578",
            "dpc": "03010222801",
            "name": "ប៊ុន សាំង"
        },
        {
            "barcode": "171120579",
            "dpc": "03010222601",
            "name": "ខឹម ស៊ីផាត"
        },
        {
            "barcode": "171120580",
            "dpc": "03010222701",
            "name": "ស៊ុយ សាវុធ"
        },
        {
            "barcode": "171120581",
            "dpc": "03010222901",
            "name": "ឃួយ  ស៊ីម៉ុង"
        },
        {
            "barcode": "171120582",
            "dpc": "03010223101",
            "name": "ពី ឈន"
        },
        {
            "barcode": "171120583",
            "dpc": "03010223501",
            "name": "ព្រាប ផន"
        },
        {
            "barcode": "171120584",
            "dpc": "03010223301",
            "name": "សុង រ៉ាវាល់ពិនឌី"
        },
        {
            "barcode": "171120585",
            "dpc": "03010223201",
            "name": "រ៉ុង សាឌីន"
        },
        {
            "barcode": "171120586",
            "dpc": "03010223601",
            "name": "វ៉ាន សុខុម"
        },
        {
            "barcode": "171120587",
            "dpc": "03010223401",
            "name": "អ៊ួន សុក"
        },
        {
            "barcode": "171120588",
            "dpc": "03010223701",
            "name": "ប៉ែន រដ្ឋា"
        },
        {
            "barcode": "171120589",
            "dpc": "03010223801",
            "name": "ពេជ្រ តុង"
        },
        {
            "barcode": "171120590",
            "dpc": "03010223901",
            "name": "ប៉ិច ដារ៉ារិទ្ធ"
        },
        {
            "barcode": "171120591",
            "dpc": "03010224001",
            "name": "ញ៉ែម យ៉ានី"
        },
        {
            "barcode": "171120592",
            "dpc": "03010224101",
            "name": "កាំង ឈីវឃៀម"
        },
        {
            "barcode": "171120593",
            "dpc": "03010224201",
            "name": "កុយ ហ៊ាង"
        },
        {
            "barcode": "171120594",
            "dpc": "03010224301",
            "name": "ជា បូ"
        },
        {
            "barcode": "171120595",
            "dpc": "03010224401",
            "name": "ហ៊ាង ប៊ុនហុក"
        },
        {
            "barcode": "171120596",
            "dpc": "03010224601",
            "name": "គង់ ឡៃហាន់"
        },
        {
            "barcode": "171120597",
            "dpc": "03010224701",
            "name": "ទិស្នាក់ការ"
        },
        {
            "barcode": "171120598",
            "dpc": "03010224801",
            "name": "ហេង មន្នីចិន្តា"
        },
        {
            "barcode": "171120599",
            "dpc": "03010224901",
            "name": "យ៉ម ចំរើន ៣"
        },
        {
            "barcode": "171120600",
            "dpc": "03010225001",
            "name": "យ៉ម ចំរើន ៥"
        },
        {
            "barcode": "171120601",
            "dpc": "03010225101",
            "name": "សឿន សុភី"
        },
        {
            "barcode": "171120602",
            "dpc": "03010225201",
            "name": "អ៊ឹង សារី"
        },
        {
            "barcode": "171120603",
            "dpc": "03010225301",
            "name": "ប៉ែន សាវុធ"
        },
        {
            "barcode": "171120604",
            "dpc": "03010225401",
            "name": "រស់ យ៉េង"
        },
        {
            "barcode": "171120605",
            "dpc": "03010225501",
            "name": "សេក ម៉ាលីស"
        },
        {
            "barcode": "171120606",
            "dpc": "03010225601",
            "name": "លី រ៉ូវីដា"
        },
        {
            "barcode": "171120607",
            "dpc": "03010225701",
            "name": "វ៉ៃ ប៉ូ"
        },
        {
            "barcode": "171120608",
            "dpc": "03010225801",
            "name": "ប៉ូ វិវឌ្ឍនៈ"
        },
        {
            "barcode": "171120609",
            "dpc": "03010225901",
            "name": "ភិន សាមឿន ១"
        },
        {
            "barcode": "171120610",
            "dpc": "03010226001",
            "name": "ភិន សាមឿន ២"
        },
        {
            "barcode": "171120611",
            "dpc": "03010226101",
            "name": "ភិន សាមឿន 3"
        },
        {
            "barcode": "171120612",
            "dpc": "03010226201",
            "name": "ភិន សាមឿន ៤"
        },
        {
            "barcode": "171120613",
            "dpc": "03010226401",
            "name": "ទ្រឿង ល័ក្ខ"
        },
        {
            "barcode": "171120614",
            "dpc": "03010226501",
            "name": "សួស ស៊ីណាន"
        },
        {
            "barcode": "171120615",
            "dpc": "03010226801",
            "name": "មាស សារុន"
        },
        {
            "barcode": "171120616",
            "dpc": "03010226701",
            "name": "គង់ ម៉ៅ"
        },
        {
            "barcode": "171120617",
            "dpc": "03010227001",
            "name": "សូ កូវីតា​ (មុខ)"
        },
        {
            "barcode": "171120618",
            "dpc": "03010227101",
            "name": "នង សាមឿន"
        },
        {
            "barcode": "171120619",
            "dpc": "03010224501",
            "name": "អួន គុណ"
        },
        {
            "barcode": "171120620",
            "dpc": "03010227301",
            "name": "សេង ដាន់ណា"
        },
        {
            "barcode": "171120621",
            "dpc": "03010227401",
            "name": "មាស ទុំ"
        },
        {
            "barcode": "171120622",
            "dpc": "03010227701",
            "name": "លឹម ហ៊ួសាន"
        },
        {
            "barcode": "171120623",
            "dpc": "03010227501",
            "name": "ជួន ស្រីមុំ"
        },
        {
            "barcode": "171120624",
            "dpc": "03010227601",
            "name": "ជួប សាវឿន"
        },
        {
            "barcode": "171120625",
            "dpc": "03010227801",
            "name": "ញ៉ែម ចាន់នី"
        },
        {
            "barcode": "171120626",
            "dpc": "03010227901",
            "name": "ឈាង សែ"
        },
        {
            "barcode": "171120627",
            "dpc": "03010228001",
            "name": "គី ប៊ុនណាល់"
        },
        {
            "barcode": "171120628",
            "dpc": "03010228101",
            "name": "ជុង សុចិត្រា"
        },
        {
            "barcode": "171120629",
            "dpc": "03010228201",
            "name": "អេង ង៉ោ"
        },
        {
            "barcode": "171120630",
            "dpc": "03010228301",
            "name": "អៀង សេរី"
        },
        {
            "barcode": "171120631",
            "dpc": "03010229701",
            "name": "អ៊ុក សាមឿន"
        },
        {
            "barcode": "171120632",
            "dpc": "03010229801",
            "name": "សាន់ លីហ៊ាង"
        },
        {
            "barcode": "171120633",
            "dpc": "03010229901",
            "name": "ឈឹម ទឹម"
        },
        {
            "barcode": "171120634",
            "dpc": "03010228501",
            "name": "ស៊ុន ក្រូច"
        },
        {
            "barcode": "171120635",
            "dpc": "03010228801",
            "name": "វែន សុភ័ក្រ្ត"
        },
        {
            "barcode": "171120636",
            "dpc": "03010228601",
            "name": "ខឹម សុភា"
        },
        {
            "barcode": "171120637",
            "dpc": "03010228701",
            "name": "មាស វិចិត្រ"
        },
        {
            "barcode": "171120638",
            "dpc": "03010228401",
            "name": "ណឹម ប៉េកាឡេ"
        },
        {
            "barcode": "171120639",
            "dpc": "03010228901",
            "name": "អ៊ឹង វឌ្ឍនៈ"
        },
        {
            "barcode": "171120640",
            "dpc": "03010229001",
            "name": "សុក វិត"
        },
        {
            "barcode": "171120641",
            "dpc": "03010229101",
            "name": "ងួន រតនៈ"
        },
        {
            "barcode": "171120642",
            "dpc": "03010229201",
            "name": "គង់ បាន ២"
        },
        {
            "barcode": "171120643",
            "dpc": "03010229301",
            "name": "ប៉ោ ទ្រីឌឿន ២"
        },
        {
            "barcode": "171120644",
            "dpc": "03010229401",
            "name": "ប៉ោ ទ្រីឌឿន ១"
        },
        {
            "barcode": "171120645",
            "dpc": "03010229601",
            "name": "រ៉ាយ ប៊ុនធឿន"
        },
        {
            "barcode": "171120646",
            "dpc": "03010231401",
            "name": "ឯម វរិទ្ធ"
        },
        {
            "barcode": "171120647",
            "dpc": "03010231301",
            "name": "ជី នី"
        },
        {
            "barcode": "171120648",
            "dpc": "03010231001",
            "name": "ឡាំង វង្ស"
        },
        {
            "barcode": "171120649",
            "dpc": "03010230201",
            "name": "វង្ស វ៉ាន"
        },
        {
            "barcode": "171120650",
            "dpc": "03010230001",
            "name": "យូ ឈឿម"
        },
        {
            "barcode": "171120651",
            "dpc": "03010230101",
            "name": "ហ៊ុល ហេង"
        },
        {
            "barcode": "171120652",
            "dpc": "03010230401",
            "name": "ភួង ភិរ័ត្ន"
        },
        {
            "barcode": "171120653",
            "dpc": "03010230301",
            "name": "ជា ដាលីន"
        },
        {
            "barcode": "171120654",
            "dpc": "03010230501",
            "name": "ឡេង ហ៊ន"
        },
        {
            "barcode": "171120655",
            "dpc": "03010230601",
            "name": "ហម អនុជ"
        },
        {
            "barcode": "171120656",
            "dpc": "03010230701",
            "name": "ទាត់ ធឿន"
        },
        {
            "barcode": "171120657",
            "dpc": "03010230901",
            "name": "សុខ វីរៈ"
        },
        {
            "barcode": "171120658",
            "dpc": "03010231201",
            "name": "ខៀវ សុជាតិ"
        },
        {
            "barcode": "171120659",
            "dpc": "03010232401",
            "name": "អ៊ុយ វណ្ណនី"
        },
        {
            "barcode": "171120660",
            "dpc": "03010232301",
            "name": "តេង ហុកហេង"
        },
        {
            "barcode": "171120661",
            "dpc": "03010232201",
            "name": "ជ័យ សែន"
        },
        {
            "barcode": "171120662",
            "dpc": "03010232101",
            "name": "ទេព វិត"
        },
        {
            "barcode": "171120663",
            "dpc": "03010232001",
            "name": "សោ វុទ្ធី"
        },
        {
            "barcode": "171120664",
            "dpc": "03010231901",
            "name": "សួង សុគន្ធ"
        },
        {
            "barcode": "171120665",
            "dpc": "03010231801",
            "name": "សួង ចាន់ទី"
        },
        {
            "barcode": "171120666",
            "dpc": "03010231701",
            "name": "សួង សុធា"
        },
        {
            "barcode": "171120667",
            "dpc": "03010231601",
            "name": "ពេជ្រ ព្រហ្មមុនី"
        },
        {
            "barcode": "171120668",
            "dpc": "03010235801",
            "name": "នឹម សួ"
        },
        {
            "barcode": "171120669",
            "dpc": "03010235701",
            "name": "មួង សារ៉េន ១"
        },
        {
            "barcode": "171120670",
            "dpc": "03010235601",
            "name": "ឡុង ផលគុណ"
        },
        {
            "barcode": "171120671",
            "dpc": "03010235501",
            "name": "ខាន់ ម៉ាណេ"
        },
        {
            "barcode": "171120672",
            "dpc": "03010235401",
            "name": "ព្រះវិហារ"
        },
        {
            "barcode": "171120673",
            "dpc": "03010235301",
            "name": "យ៉ុន ធារិទ្ធ"
        },
        {
            "barcode": "171120674",
            "dpc": "03010235101",
            "name": "ហ៊ាង រ៉ាវុត"
        },
        {
            "barcode": "171120675",
            "dpc": "03010235001",
            "name": "អ៊ឹង ឆាយ"
        },
        {
            "barcode": "171120676",
            "dpc": "03010234801",
            "name": "ចេង សុខណា"
        },
        {
            "barcode": "171120677",
            "dpc": "03010234701",
            "name": "ឡាំ គឹមហេង"
        },
        {
            "barcode": "171120678",
            "dpc": "03010234601",
            "name": "ឡាញ សាអូន"
        },
        {
            "barcode": "171120679",
            "dpc": "03010234501",
            "name": "ទស្ស ហុង"
        },
        {
            "barcode": "171120680",
            "dpc": "03010234301",
            "name": "ទិត្យ ហ៊ាន"
        },
        {
            "barcode": "171120681",
            "dpc": "03010234201",
            "name": "ប៉ែន សារិទ្ធ"
        },
        {
            "barcode": "171120682",
            "dpc": "03010234101",
            "name": "ឃួន ស៊ីម៉ង"
        },
        {
            "barcode": "171120683",
            "dpc": "03010234001",
            "name": "គី ឌីណា"
        },
        {
            "barcode": "171120684",
            "dpc": "03010233901",
            "name": "អៀ សាវុធ"
        },
        {
            "barcode": "171120685",
            "dpc": "03010233801",
            "name": "ឈាង ហាក់"
        },
        {
            "barcode": "171120686",
            "dpc": "03010233701",
            "name": "ឡុង ម៉ាដា"
        },
        {
            "barcode": "171120687",
            "dpc": "03010233401",
            "name": "ជី"
        },
        {
            "barcode": "171120688",
            "dpc": "03010233301",
            "name": "តាំង អ៊ិចហុង"
        },
        {
            "barcode": "171120689",
            "dpc": "03010233101",
            "name": "ថេត ថេន"
        },
        {
            "barcode": "171120690",
            "dpc": "03010233001",
            "name": "ហុក ដាវិន"
        },
        {
            "barcode": "171120691",
            "dpc": "03010232901",
            "name": "សាយ សុវណ្ណរ៉េត"
        },
        {
            "barcode": "171120692",
            "dpc": "03010232801",
            "name": "សុ វណ្ណារី"
        },
        {
            "barcode": "171120693",
            "dpc": "03010232701",
            "name": "ពិន សុជាតា"
        },
        {
            "barcode": "171120694",
            "dpc": "03010232601",
            "name": "លក ស៊ូ"
        },
        {
            "barcode": "171120695",
            "dpc": "03010232501",
            "name": "សេង សាវុធ"
        },
        {
            "barcode": "171120696",
            "dpc": "03010240001",
            "name": "ឈឿន វេង"
        },
        {
            "barcode": "171120697",
            "dpc": "03010239801",
            "name": "ឃួន ឈឿត ២"
        },
        {
            "barcode": "171120698",
            "dpc": "03010239901",
            "name": "ឃួន ឈឿត ៣"
        },
        {
            "barcode": "171120699",
            "dpc": "03010239701",
            "name": "ឃួន ឈឿត ១"
        },
        {
            "barcode": "171120700",
            "dpc": "03010239601",
            "name": "រស់ សុធី"
        },
        {
            "barcode": "171120701",
            "dpc": "03010239501",
            "name": "សៀ បេន"
        },
        {
            "barcode": "171120702",
            "dpc": "03010239401",
            "name": "សូ ភីយា"
        },
        {
            "barcode": "171120703",
            "dpc": "03010239301",
            "name": "ចាយ តុងកឹង"
        },
        {
            "barcode": "171120704",
            "dpc": "03010239101",
            "name": "ផុន សាវឿន"
        },
        {
            "barcode": "171120705",
            "dpc": "03010240301",
            "name": "ហ៊ុល ធី"
        },
        {
            "barcode": "171120706",
            "dpc": "03010240201",
            "name": "ម៉េង វ៉ានដានីន"
        },
        {
            "barcode": "171120707",
            "dpc": "03010239201",
            "name": "លឹម ហូរ"
        },
        {
            "barcode": "171120708",
            "dpc": "03010237701",
            "name": "ព្រហ្ម មរណៈ"
        },
        {
            "barcode": "171120709",
            "dpc": "03010237201",
            "name": "អ៊ឹង ពោធិរដ្ឋ"
        },
        {
            "barcode": "171120710",
            "dpc": "03010237101",
            "name": "ឡុច ឈឿត"
        },
        {
            "barcode": "171120711",
            "dpc": "03010237001",
            "name": "ភោគ សុផុន ២"
        },
        {
            "barcode": "171120712",
            "dpc": "03010236801",
            "name": "ស៊ុត សៅរ៉ាន"
        },
        {
            "barcode": "171120713",
            "dpc": "03010236701",
            "name": "ស្វិត ជេដ្ឋា"
        },
        {
            "barcode": "171120714",
            "dpc": "03010238001",
            "name": "សោ បូរិទ្ធ"
        },
        {
            "barcode": "171120715",
            "dpc": "03010237901",
            "name": "មួង រ៉េន"
        },
        {
            "barcode": "171120716",
            "dpc": "03010240101",
            "name": "ព្រហ្ម មរណៈ"
        },
        {
            "barcode": "171120717",
            "dpc": "03010237801",
            "name": "អ៊ុក វី"
        },
        {
            "barcode": "171120718",
            "dpc": "03010237601",
            "name": "អូន វិបុល"
        },
        {
            "barcode": "171120719",
            "dpc": "03010237501",
            "name": "ឯក សំអូន ៣"
        },
        {
            "barcode": "171120720",
            "dpc": "03010237401",
            "name": "ឯក សំអូន ១"
        },
        {
            "barcode": "171120721",
            "dpc": "03010237301",
            "name": "ប៊ុន  ប៉ា"
        },
        {
            "barcode": "171120722",
            "dpc": "03010236401",
            "name": "ម៉ម ហ៊ីម"
        },
        {
            "barcode": "171120723",
            "dpc": "03010236501",
            "name": "វ៉ា គឹមអូន"
        },
        {
            "barcode": "171120724",
            "dpc": "03010236601",
            "name": "ជា ហុង"
        },
        {
            "barcode": "171120725",
            "dpc": "03010246901",
            "name": "យិន នូ"
        },
        {
            "barcode": "171120726",
            "dpc": "03010246601",
            "name": "ស សារិន"
        },
        {
            "barcode": "171120727",
            "dpc": "03010238901",
            "name": "ហួយ ប៊ុនឡេង"
        },
        {
            "barcode": "171120728",
            "dpc": "03010238801",
            "name": "ឯក សុផាន"
        },
        {
            "barcode": "171120729",
            "dpc": "03010240801",
            "name": "ពៅ ពីដារិទ្ធ"
        },
        {
            "barcode": "171120730",
            "dpc": "03010240601",
            "name": "ម៉ី វណ្ណទូច"
        },
        {
            "barcode": "171120731",
            "dpc": "03010240501",
            "name": "ជា ឆន"
        },
        {
            "barcode": "171120732",
            "dpc": "03010240401",
            "name": "អ៊ិន ស៊ីដារ៉េ"
        },
        {
            "barcode": "171120733",
            "dpc": "03010238701",
            "name": "កែវ សាឡាត់"
        },
        {
            "barcode": "171120734",
            "dpc": "03010238301",
            "name": "ចាន់ សារឿម"
        },
        {
            "barcode": "171120735",
            "dpc": "03010238401",
            "name": "នាង ផល្លា"
        },
        {
            "barcode": "171120736",
            "dpc": "03010238201",
            "name": "ហ៊ាង រ័ត្ន"
        },
        {
            "barcode": "171120737",
            "dpc": "03010238101",
            "name": "ចាន ធូ"
        },
        {
            "barcode": "171120738",
            "dpc": "03010246801",
            "name": "តុល ចាន់សុខ"
        },
        {
            "barcode": "171120739",
            "dpc": "03010246701",
            "name": "ប៉ិល សៃ"
        },
        {
            "barcode": "171120740",
            "dpc": "03010241901",
            "name": "សួន សុខន"
        },
        {
            "barcode": "171120741",
            "dpc": "03010242101",
            "name": "ចាន់ ថុលឡា"
        },
        {
            "barcode": "171120742",
            "dpc": "03010241601",
            "name": "ឯម សុភាព"
        },
        {
            "barcode": "171120743",
            "dpc": "03010241401",
            "name": "សោម សុវណ្ណ"
        },
        {
            "barcode": "171120744",
            "dpc": "03010241201",
            "name": "ឆេង ស្រីនាថ"
        },
        {
            "barcode": "171120745",
            "dpc": "03010241101",
            "name": "សំ សុវណ្ណ"
        },
        {
            "barcode": "171120746",
            "dpc": "03010240901",
            "name": "ផាន់ សុវណ្ណ"
        },
        {
            "barcode": "171120747",
            "dpc": "03010241001",
            "name": "ចាន់ គឹមហុង"
        },
        {
            "barcode": "171120748",
            "dpc": "03010243801",
            "name": "ស៊ុប ធី (វត្តសង្កែ)"
        },
        {
            "barcode": "171120749",
            "dpc": "03010241301",
            "name": "វត្តសង្កែ"
        },
        {
            "barcode": "171120750",
            "dpc": "03010241801",
            "name": "សោម មាន"
        },
        {
            "barcode": "171120751",
            "dpc": "03010241701",
            "name": "ចំរើ រដ្ឋ"
        },
        {
            "barcode": "171120752",
            "dpc": "03010245701",
            "name": "ឌុច ហឿម"
        },
        {
            "barcode": "171120753",
            "dpc": "03010245601",
            "name": "ប៊ូ ប៉ុច"
        },
        {
            "barcode": "171120754",
            "dpc": "03010245401",
            "name": "នុល ឈឿង"
        },
        {
            "barcode": "171120755",
            "dpc": "03010245301",
            "name": "ទេព ទូ"
        },
        {
            "barcode": "171120756",
            "dpc": "03010245201",
            "name": "ដូង  រតនះ"
        },
        {
            "barcode": "171120757",
            "dpc": "03010245101",
            "name": "ប៉េ ហួម"
        },
        {
            "barcode": "171120758",
            "dpc": "03010245001",
            "name": "ប៉ិច ប៉ុក"
        },
        {
            "barcode": "171120759",
            "dpc": "03010244901",
            "name": "ប៉ិច ហាប់"
        },
        {
            "barcode": "171120760",
            "dpc": "03010244801",
            "name": "លួង ឆយ"
        },
        {
            "barcode": "171120761",
            "dpc": "03010244601",
            "name": "ភន រដ្ឋា"
        },
        {
            "barcode": "171120762",
            "dpc": "03010244501",
            "name": "ស៊ុត សឿង"
        },
        {
            "barcode": "171120763",
            "dpc": "03010244401",
            "name": "អៀប រិននឿត"
        },
        {
            "barcode": "171120764",
            "dpc": "03010244201",
            "name": "អៀក ឈៀត"
        },
        {
            "barcode": "171120765",
            "dpc": "03010244101",
            "name": "អៀក ភៀង"
        },
        {
            "barcode": "171120766",
            "dpc": "03010244001",
            "name": "លួត ភួង"
        },
        {
            "barcode": "171120767",
            "dpc": "03010246401",
            "name": "សៀ ប៊ុនយឺ"
        },
        {
            "barcode": "171120768",
            "dpc": "03010246301",
            "name": "សៀ គឹមណៃ"
        },
        {
            "barcode": "171120769",
            "dpc": "03010246201",
            "name": "ផាន់ សុគឿន"
        },
        {
            "barcode": "171120770",
            "dpc": "03010246001",
            "name": "ឡុង ផលគុន"
        },
        {
            "barcode": "171120771",
            "dpc": "03010245801",
            "name": "ប៊ុន ប្រសិទ្ធ"
        },
        {
            "barcode": "171120772",
            "dpc": "03010245901",
            "name": "ម៉ាក់ សុខា"
        },
        {
            "barcode": "171120773",
            "dpc": "03010242601",
            "name": "ម៉ម សុម៉ាវត្តី"
        },
        {
            "barcode": "171120774",
            "dpc": "03010242501",
            "name": "ហោ គឹមសឿង"
        },
        {
            "barcode": "171120775",
            "dpc": "03010242401",
            "name": "ហ៊ុយ យិនង៉"
        },
        {
            "barcode": "171120776",
            "dpc": "03010242301",
            "name": "ប៉ុក ណាវី"
        },
        {
            "barcode": "171120777",
            "dpc": "03010243701",
            "name": "តាន់ ម៉េង"
        },
        {
            "barcode": "171120778",
            "dpc": "03010243601",
            "name": "ម៉េង សុឡាតា"
        },
        {
            "barcode": "171120779",
            "dpc": "03010243501",
            "name": "ម៉េង សុគិត"
        },
        {
            "barcode": "171120780",
            "dpc": "03010243401",
            "name": "សំ ឆន"
        },
        {
            "barcode": "171120781",
            "dpc": "03010243301",
            "name": "នាង ឡានី"
        },
        {
            "barcode": "171120782",
            "dpc": "03010243201",
            "name": "ឌុក សាង"
        },
        {
            "barcode": "171120783",
            "dpc": "03010243001",
            "name": "មន្ទីរពេទ្យសុខសាន"
        },
        {
            "barcode": "171120784",
            "dpc": "03010242801",
            "name": "សង ថន"
        },
        {
            "barcode": "171120785",
            "dpc": "03010202601",
            "name": "ថន ប៊ុនថាន់"
        },
        {
            "barcode": "171120786",
            "dpc": "03010202701",
            "name": "គឹម សាន្ត"
        },
        {
            "barcode": "171120787",
            "dpc": "03010202801",
            "name": "រៀន សំណាង"
        },
        {
            "barcode": "171120788",
            "dpc": "03010203101",
            "name": "ម៉ែន សុខុម"
        },
        {
            "barcode": "171120789",
            "dpc": "03010203001",
            "name": "ជា វណ្ណៈ"
        },
        {
            "barcode": "171120790",
            "dpc": "03010203301",
            "name": "ហេង សុភាព"
        },
        {
            "barcode": "171120791",
            "dpc": "03010203401",
            "name": "វ៉ន ណារ៉ូ"
        },
        {
            "barcode": "171120792",
            "dpc": "03010200401",
            "name": "ប៉ូវ សំភី"
        },
        {
            "barcode": "171120793",
            "dpc": "03010200801",
            "name": "ម៉ី សារី"
        },
        {
            "barcode": "171120794",
            "dpc": "03010200901",
            "name": "យិន ពៅ"
        },
        {
            "barcode": "171120795",
            "dpc": "03010201001",
            "name": "សារ័ត្ន មុន្នី"
        },
        {
            "barcode": "171120796",
            "dpc": "03010201101",
            "name": "កេត្រ ស៊ីយ៉ារ៉ា"
        },
        {
            "barcode": "171120797",
            "dpc": "03010201201",
            "name": "យឹម យឿន"
        },
        {
            "barcode": "171120798",
            "dpc": "03010201301",
            "name": "យ៉ាត ស្រីសុខុម"
        },
        {
            "barcode": "171120799",
            "dpc": "03010201401",
            "name": "កុយ នុយ"
        },
        {
            "barcode": "171120800",
            "dpc": "03010201501",
            "name": "សេង សុភី"
        },
        {
            "barcode": "171120801",
            "dpc": "03010201701",
            "name": "ប៊ិន យួម"
        },
        {
            "barcode": "171120802",
            "dpc": "03010201801",
            "name": "ហឿង ហាយ"
        },
        {
            "barcode": "171120803",
            "dpc": "03010201901",
            "name": "អួង ណារ៉េត"
        },
        {
            "barcode": "171120804",
            "dpc": "03010202001",
            "name": "យ៉ន បូរ៉ា"
        },
        {
            "barcode": "171120805",
            "dpc": "03010202101",
            "name": "ហូរ ធី"
        },
        {
            "barcode": "171120806",
            "dpc": "03010200601",
            "name": "កេត្រ ចន្ត្រា"
        },
        {
            "barcode": "171120807",
            "dpc": "03010202401",
            "name": "សៅ ណាវី"
        },
        {
            "barcode": "171120808",
            "dpc": "03010202301",
            "name": "ហេង ស៊ុនហូរ"
        },
        {
            "barcode": "171120809",
            "dpc": "03010202201",
            "name": "ពុម ប៊ុនង៉ា"
        },
        {
            "barcode": "171120810",
            "dpc": "03010201601",
            "name": "លឿម សុខហេង"
        },
        {
            "barcode": "171120811",
            "dpc": "03010200101",
            "name": "ឡាច សាមឿន"
        },
        {
            "barcode": "171120812",
            "dpc": "03010200201",
            "name": "នូវ ខន្តី"
        },
        {
            "barcode": "171120813",
            "dpc": "03010200301",
            "name": "ចាន់ តុន"
        },
        {
            "barcode": "171120814",
            "dpc": "03010247501",
            "name": "គុយ ឈុំណាត"
        },
        {
            "barcode": "171120815",
            "dpc": "03010247901",
            "name": "ជុន ណៃឈឿត"
        },
        {
            "barcode": "171120816",
            "dpc": "03010247301",
            "name": "សួន ចាន់សឿន"
        },
        {
            "barcode": "171120817",
            "dpc": "03010203601",
            "name": "ផូ សុងហេង"
        },
        {
            "barcode": "171120818",
            "dpc": "03010203501",
            "name": "សូ ឈឿងលី"
        },
        {
            "barcode": "171120819",
            "dpc": "03010203801",
            "name": "ជយ ហឿម"
        },
        {
            "barcode": "171120820",
            "dpc": "03010203901",
            "name": "ថន សារិទ្ធ"
        },
        {
            "barcode": "171120821",
            "dpc": "03010204001",
            "name": "សុក ពុធ"
        },
        {
            "barcode": "171120822",
            "dpc": "03010204201",
            "name": "សន ប៊ុនធឿន"
        },
        {
            "barcode": "171120823",
            "dpc": "03010204501",
            "name": "ជួង ខ្វា"
        },
        {
            "barcode": "171120824",
            "dpc": "03010204301",
            "name": "ហ៊ាន  ហឹម"
        },
        {
            "barcode": "171120825",
            "dpc": "03010207001",
            "name": "រ៉ាយ  សារ៉ុម"
        },
        {
            "barcode": "171120826",
            "dpc": "03010220901",
            "name": "ជាង  ម៉េត"
        },
        {
            "barcode": "171120827",
            "dpc": "03010226301",
            "name": "ឌួង វិបុល"
        },
        {
            "barcode": "171120828",
            "dpc": "03010229501",
            "name": "ឈុន  ស្រេង"
        },
        {
            "barcode": "171120829",
            "dpc": "03010233601",
            "name": "ថង សៀង"
        },
        {
            "barcode": "171120830",
            "dpc": "03010234401",
            "name": "យឹម  សុខា"
        },
        {
            "barcode": "171120831",
            "dpc": "03010235201",
            "name": "ផូ  ធូរេន"
        },
        {
            "barcode": "171120832",
            "dpc": "03010236301",
            "name": "ខៀវ  សំហេន"
        },
        {
            "barcode": "171120833",
            "dpc": "03010236901",
            "name": "តាំង  ប៊ុនហ៊ីម"
        },
        {
            "barcode": "171120834",
            "dpc": "03010238501",
            "name": "សុខ  ចាន់"
        },
        {
            "barcode": "171120835",
            "dpc": "03010238601",
            "name": "ជុំ  សុខុម"
        },
        {
            "barcode": "171120836",
            "dpc": "03010241501",
            "name": "សុខ  ឃាង"
        },
        {
            "barcode": "171120837",
            "dpc": "03010242001",
            "name": "សុខ  ធឿន"
        },
        {
            "barcode": "171120838",
            "dpc": "03010244301",
            "name": "តាន់  សារឿន"
        },
        {
            "barcode": "171120839",
            "dpc": "03010247201",
            "name": "ញ៉ែម  សុខា"
        },
        {
            "barcode": "171120840",
            "dpc": "03010247401",
            "name": "ស៊ាង  ចាន់ធាម"
        },
        {
            "barcode": "171120841",
            "dpc": "03010247601",
            "name": "គឹម  ផាត់"
        },
        {
            "barcode": "171120842",
            "dpc": "03010247701",
            "name": "សៅ  ហ៊ាល"
        },
        {
            "barcode": "171120843",
            "dpc": "03010247801",
            "name": "សៅ  មន្ថា"
        },
        {
            "barcode": "171120844",
            "dpc": "03010248001",
            "name": "ម៉ី ជឿន"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
