let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171121728",
            "dpc": "03010302201",
            "name": "ងឿន រិទ្ធ"
        },
        {
            "barcode": "171121729",
            "dpc": "03010302301",
            "name": "ហេង សុផល"
        },
        {
            "barcode": "171121730",
            "dpc": "03010302501",
            "name": "ធាវ  អ៊ិត"
        },
        {
            "barcode": "171121731",
            "dpc": "03010302701",
            "name": "វណ្ណា ដា"
        },
        {
            "barcode": "171121732",
            "dpc": "03010302801",
            "name": "ភន សុខា"
        },
        {
            "barcode": "171121733",
            "dpc": "03010303001",
            "name": "សុខ ជា"
        },
        {
            "barcode": "171121734",
            "dpc": "03010303101",
            "name": "ស៊ាន ហ៊ុល"
        },
        {
            "barcode": "171121735",
            "dpc": "03010303201",
            "name": "គា យ៉ាន"
        },
        {
            "barcode": "171121736",
            "dpc": "03010303301",
            "name": "រស់ សារ៉េត"
        },
        {
            "barcode": "171121737",
            "dpc": "03010303401",
            "name": "ចាន់ សុខឡេង"
        },
        {
            "barcode": "171121738",
            "dpc": "03010303501",
            "name": "យឹម សាវ៉ាត"
        },
        {
            "barcode": "171121739",
            "dpc": "03010303601",
            "name": "មុត សារឿន"
        },
        {
            "barcode": "171121740",
            "dpc": "03010303701",
            "name": "សេង អាន"
        },
        {
            "barcode": "171121741",
            "dpc": "03010303901",
            "name": "សេក អៀង"
        },
        {
            "barcode": "171121742",
            "dpc": "03010303801",
            "name": "អ៊ិត ស៊ីធា"
        },
        {
            "barcode": "171121743",
            "dpc": "03010304001",
            "name": "អែម គឹមស៊ុន"
        },
        {
            "barcode": "171121744",
            "dpc": "03010304101",
            "name": "ទាវ អ៊ុយសឹង"
        },
        {
            "barcode": "171121745",
            "dpc": "03010304201",
            "name": "អែម ប៊ុនណាត"
        },
        {
            "barcode": "171121746",
            "dpc": "03010304301",
            "name": "ង៉ែត វុទ្ធី"
        },
        {
            "barcode": "171121747",
            "dpc": "03010304401",
            "name": "ឡាច ម៉ាន់"
        },
        {
            "barcode": "171121748",
            "dpc": "03010304601",
            "name": "ចាន់ សំបូរ"
        },
        {
            "barcode": "171121749",
            "dpc": "03010304701",
            "name": "ទាន់ សម័យ"
        },
        {
            "barcode": "171121750",
            "dpc": "03010304801",
            "name": "គឹម បូរី"
        },
        {
            "barcode": "171121751",
            "dpc": "03010305001",
            "name": "ទិត ជិន"
        },
        {
            "barcode": "171121752",
            "dpc": "03010304901",
            "name": "គង់ ហ៊ាន"
        },
        {
            "barcode": "171121753",
            "dpc": "03010333401",
            "name": "អ៊ីវ អមរា"
        },
        {
            "barcode": "171121754",
            "dpc": "03010333501",
            "name": "ឃី ធារ៉ា"
        },
        {
            "barcode": "171121755",
            "dpc": "03010333601",
            "name": "គង់ ហ៊ាន"
        },
        {
            "barcode": "171121756",
            "dpc": "03010333701",
            "name": "អាត ទីត ១"
        },
        {
            "barcode": "171121757",
            "dpc": "03010333801",
            "name": "អាត ទីត ២"
        },
        {
            "barcode": "171121758",
            "dpc": "03010333901",
            "name": "ថង ជី"
        },
        {
            "barcode": "171121759",
            "dpc": "03010334001",
            "name": "អៀប សាវឿត"
        },
        {
            "barcode": "171121760",
            "dpc": "03010334201",
            "name": "អ៊ឹប លឿត ១"
        },
        {
            "barcode": "171121761",
            "dpc": "03010334301",
            "name": "ហ៊ឹង ចំរើន"
        },
        {
            "barcode": "171121762",
            "dpc": "03010334401",
            "name": "ជា​ សុធា"
        },
        {
            "barcode": "171121763",
            "dpc": "03010334501",
            "name": "ស៊ិន ឈៀន"
        },
        {
            "barcode": "171121764",
            "dpc": "03010334601",
            "name": "ចែក ប៊ុនឈៀង"
        },
        {
            "barcode": "171121765",
            "dpc": "03010334701",
            "name": "ស៊ិន សាលី"
        },
        {
            "barcode": "171121766",
            "dpc": "03010334801",
            "name": "រ័ត្ន វ៉ាន់ថា"
        },
        {
            "barcode": "171121767",
            "dpc": "03010334901",
            "name": "សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171121768",
            "dpc": "03010335001",
            "name": "លាស់ សុទ្ធ២"
        },
        {
            "barcode": "171121769",
            "dpc": "03010335101",
            "name": "លាស់ សុទ្ធ ២"
        },
        {
            "barcode": "171121770",
            "dpc": "03010335201",
            "name": "ម៉េង ហ៊ាង"
        },
        {
            "barcode": "171121771",
            "dpc": "03010335301",
            "name": "ឈុន លី"
        },
        {
            "barcode": "171121772",
            "dpc": "03010335401",
            "name": "វ៉ាត វ៉ារីម"
        },
        {
            "barcode": "171121773",
            "dpc": "03010335501",
            "name": "ពួក   លីហាក់"
        },
        {
            "barcode": "171121774",
            "dpc": "03010335601",
            "name": "សឹង ខូច"
        },
        {
            "barcode": "171121775",
            "dpc": "03010335701",
            "name": "ហេង ផាន់"
        },
        {
            "barcode": "171121776",
            "dpc": "03010335801",
            "name": "សឹង ង៉ុយ"
        },
        {
            "barcode": "171121777",
            "dpc": "03010335901",
            "name": "តាំង ម៉េង"
        },
        {
            "barcode": "171121778",
            "dpc": "03010336001",
            "name": "ប៉ូ សុខអេង"
        },
        {
            "barcode": "171121779",
            "dpc": "03010336101",
            "name": "ឈុន ណៃ"
        },
        {
            "barcode": "171121780",
            "dpc": "03010336201",
            "name": "ប៉ូ ស៊ុនទាក"
        },
        {
            "barcode": "171121781",
            "dpc": "03010336301",
            "name": "ទ្រី ម៉េងឡាយ"
        },
        {
            "barcode": "171121782",
            "dpc": "03010336401",
            "name": "សេង សុភា"
        },
        {
            "barcode": "171121783",
            "dpc": "03010336501",
            "name": "សេម ម៉ារីន"
        },
        {
            "barcode": "171121784",
            "dpc": "03010336601",
            "name": "ស៊ុយ ងិន"
        },
        {
            "barcode": "171121785",
            "dpc": "03010336701",
            "name": "យឹក ចន្ធី"
        },
        {
            "barcode": "171121786",
            "dpc": "03010336801",
            "name": "អោម ពិសិទ្ធ"
        },
        {
            "barcode": "171121787",
            "dpc": "03010336901",
            "name": "ឈៀង ហាក"
        },
        {
            "barcode": "171121788",
            "dpc": "03010337001",
            "name": "អ៊ឹម លឿត"
        },
        {
            "barcode": "171121789",
            "dpc": "03010337101",
            "name": "គុជ ជ"
        },
        {
            "barcode": "171121790",
            "dpc": "03010337301",
            "name": "ប៊ុន វណ្ណា"
        },
        {
            "barcode": "171121791",
            "dpc": "03010337401",
            "name": "សេម ចំរ៉ាត់"
        },
        {
            "barcode": "171121792",
            "dpc": "03010337501",
            "name": "ខី ហ៊ត"
        },
        {
            "barcode": "171121793",
            "dpc": "03010337601",
            "name": "លន់ សៀន"
        },
        {
            "barcode": "171121794",
            "dpc": "03010337701",
            "name": "ទ្រី ម៉េង"
        },
        {
            "barcode": "171121795",
            "dpc": "03010337901",
            "name": "ឃុន ដាលាង"
        },
        {
            "barcode": "171121796",
            "dpc": "03010338001",
            "name": "តាន់ សុផល"
        },
        {
            "barcode": "171121797",
            "dpc": "03010338101",
            "name": "ទិត សំពាក្យ"
        },
        {
            "barcode": "171121798",
            "dpc": "03010338201",
            "name": "សយ ហ៊ាង"
        },
        {
            "barcode": "171121799",
            "dpc": "03010338301",
            "name": "ទិត កៀត"
        },
        {
            "barcode": "171121800",
            "dpc": "03010304501",
            "name": "ង៉ែត ឈី"
        },
        {
            "barcode": "171121801",
            "dpc": "03010306001",
            "name": "គី មឿន"
        },
        {
            "barcode": "171121802",
            "dpc": "03010306101",
            "name": "អនសុខម៉ាលភាព ១"
        },
        {
            "barcode": "171121803",
            "dpc": "03010305601",
            "name": "លឹម ស៊ីណាត"
        },
        {
            "barcode": "171121804",
            "dpc": "03010305801",
            "name": "សុខ ចាន់ថា"
        },
        {
            "barcode": "171121805",
            "dpc": "03010305701",
            "name": "ងិន អូន"
        },
        {
            "barcode": "171121806",
            "dpc": "03010305901",
            "name": "ទី ហ៊ាង"
        },
        {
            "barcode": "171121807",
            "dpc": "03010306201",
            "name": "ចាន់ ទូច"
        },
        {
            "barcode": "171121808",
            "dpc": "03010306301",
            "name": "វ៉ាន់ គ្រី"
        },
        {
            "barcode": "171121809",
            "dpc": "03010306401",
            "name": "ទេស ឃឿន"
        },
        {
            "barcode": "171121810",
            "dpc": "03010306701",
            "name": "ឡៃ ស៊ីម"
        },
        {
            "barcode": "171121811",
            "dpc": "03010306501",
            "name": "ឌុន វុទ្ធី"
        },
        {
            "barcode": "171121812",
            "dpc": "03010306601",
            "name": "ហង សារៀប"
        },
        {
            "barcode": "171121813",
            "dpc": "03010306901",
            "name": "បង ណាក់"
        },
        {
            "barcode": "171121814",
            "dpc": "03010306801",
            "name": "វ៉ាន់ សុឆិន"
        },
        {
            "barcode": "171121815",
            "dpc": "03010307001",
            "name": "ភួង គឹមស៊ុន"
        },
        {
            "barcode": "171121816",
            "dpc": "03010307101",
            "name": "ស៊ូ ប៊ុនសុំ"
        },
        {
            "barcode": "171121817",
            "dpc": "03010307201",
            "name": "ចាប សំណាង ២"
        },
        {
            "barcode": "171121818",
            "dpc": "03010307301",
            "name": "នៀត"
        },
        {
            "barcode": "171121819",
            "dpc": "03010307401",
            "name": "អ៊ុំ យ៉ា"
        },
        {
            "barcode": "171121820",
            "dpc": "03010307501",
            "name": "ទ្រៀង វិន"
        },
        {
            "barcode": "171121821",
            "dpc": "03010307601",
            "name": "ទ្រឿង វុទ្ធា"
        },
        {
            "barcode": "171121822",
            "dpc": "03010307701",
            "name": "ចាប សំណាង ១"
        },
        {
            "barcode": "171121823",
            "dpc": "03010307801",
            "name": "រូត  ប៉ូលីន"
        },
        {
            "barcode": "171121824",
            "dpc": "03010307901",
            "name": "គឹម សារ៉ាន់"
        },
        {
            "barcode": "171121825",
            "dpc": "03010308001",
            "name": "ព្រុំ សាវន"
        },
        {
            "barcode": "171121826",
            "dpc": "03010308101",
            "name": "និវ  ណន"
        },
        {
            "barcode": "171121827",
            "dpc": "03010308201",
            "name": "យឿម យ៉េង"
        },
        {
            "barcode": "171121828",
            "dpc": "03010308301",
            "name": "ថោង ប្រានី"
        },
        {
            "barcode": "171121829",
            "dpc": "03010308401",
            "name": "ផន សាលីន"
        },
        {
            "barcode": "171121830",
            "dpc": "03010305201",
            "name": "ម៉េង សុឡាតា"
        },
        {
            "barcode": "171121831",
            "dpc": "03010305301",
            "name": "អន ផល្លា"
        },
        {
            "barcode": "171121832",
            "dpc": "03010305501",
            "name": "ម៉ម ស្រីរដ្ឋ"
        },
        {
            "barcode": "171121833",
            "dpc": "03010305401",
            "name": "អោក ចានធឿន ១"
        },
        {
            "barcode": "171121834",
            "dpc": "03010309501",
            "name": "ទូច មន្នី"
        },
        {
            "barcode": "171121835",
            "dpc": "03010309601",
            "name": "ហ៊ី ហ៊ីង"
        },
        {
            "barcode": "171121836",
            "dpc": "03010309701",
            "name": "ជា ចន្យា"
        },
        {
            "barcode": "171121837",
            "dpc": "03010309801",
            "name": "ជា សេត"
        },
        {
            "barcode": "171121838",
            "dpc": "03010309901",
            "name": "ស៊ូ សឿន"
        },
        {
            "barcode": "171121839",
            "dpc": "03010310001",
            "name": "យិន ហ៊ាង"
        },
        {
            "barcode": "171121840",
            "dpc": "03010310101",
            "name": "មុំ សេង"
        },
        {
            "barcode": "171121841",
            "dpc": "03010310201",
            "name": "ស៊ុយ  មុំ"
        },
        {
            "barcode": "171121842",
            "dpc": "03010310401",
            "name": "ហេង រ៉ាឌី"
        },
        {
            "barcode": "171121843",
            "dpc": "03010310501",
            "name": "យ៉ា ខឿប"
        },
        {
            "barcode": "171121844",
            "dpc": "03010310601",
            "name": "ហុង សាខឿន"
        },
        {
            "barcode": "171121845",
            "dpc": "03010310801",
            "name": "ហេង សុផាត"
        },
        {
            "barcode": "171121846",
            "dpc": "03010310901",
            "name": "ហេង សុភាព"
        },
        {
            "barcode": "171121847",
            "dpc": "03010311001",
            "name": "ង៉ាត វ៉ានថា"
        },
        {
            "barcode": "171121848",
            "dpc": "03010309401",
            "name": "រស់ កិត្យា"
        },
        {
            "barcode": "171121849",
            "dpc": "03010311101",
            "name": "ព្រះវិហារគ្រីះបរិសុទ្ធ"
        },
        {
            "barcode": "171121850",
            "dpc": "03010311201",
            "name": "អ៊ិត ឃឿត"
        },
        {
            "barcode": "171121851",
            "dpc": "03010311301",
            "name": "ដើង ស៊ីថា"
        },
        {
            "barcode": "171121852",
            "dpc": "03010311401",
            "name": "ហួត ចានថង"
        },
        {
            "barcode": "171121853",
            "dpc": "03010311501",
            "name": "ហួត ចាន់ស៊ី"
        },
        {
            "barcode": "171121854",
            "dpc": "03010311601",
            "name": "ជឺ  បុទុំ"
        },
        {
            "barcode": "171121855",
            "dpc": "03010311801",
            "name": "ទូច សឿន"
        },
        {
            "barcode": "171121856",
            "dpc": "03010311901",
            "name": "ចុង ស៊ីន"
        },
        {
            "barcode": "171121857",
            "dpc": "03010312001",
            "name": "អាត វណ្ណា ១"
        },
        {
            "barcode": "171121858",
            "dpc": "03010312101",
            "name": "សេង គួន"
        },
        {
            "barcode": "171121859",
            "dpc": "03010312301",
            "name": "យោក ស៊ីផុន"
        },
        {
            "barcode": "171121860",
            "dpc": "03010312401",
            "name": "អាត់ វណ្ណា ២"
        },
        {
            "barcode": "171121861",
            "dpc": "03010312501",
            "name": "វណ្ណា  រ៉េ ១"
        },
        {
            "barcode": "171121862",
            "dpc": "03010312601",
            "name": "ថន ច្ឆា"
        },
        {
            "barcode": "171121863",
            "dpc": "03010312701",
            "name": "ឆាត់ ឆាយឆដា១"
        },
        {
            "barcode": "171121864",
            "dpc": "03010312801",
            "name": "វ៉ន យួង"
        },
        {
            "barcode": "171121865",
            "dpc": "03010312901",
            "name": "ជ័យ សុផាត"
        },
        {
            "barcode": "171121866",
            "dpc": "03010313001",
            "name": "អ៊ុន សាវ៉ុន"
        },
        {
            "barcode": "171121867",
            "dpc": "03010313101",
            "name": "សុខ ចំរើន"
        },
        {
            "barcode": "171121868",
            "dpc": "03010313201",
            "name": "រី សុធារ៉ា"
        },
        {
            "barcode": "171121869",
            "dpc": "03010313301",
            "name": "តិច សេង"
        },
        {
            "barcode": "171121870",
            "dpc": "03010313401",
            "name": "តិច ស៊ាង"
        },
        {
            "barcode": "171121871",
            "dpc": "03010313501",
            "name": "អោម នៅ"
        },
        {
            "barcode": "171121872",
            "dpc": "03010313601",
            "name": "ខុង កវី"
        },
        {
            "barcode": "171121873",
            "dpc": "03010313701",
            "name": "ហៀង ឃាង"
        },
        {
            "barcode": "171121874",
            "dpc": "03010313801",
            "name": "ចាន សុខលីន"
        },
        {
            "barcode": "171121875",
            "dpc": "03010313901",
            "name": "តា ហេង"
        },
        {
            "barcode": "171121876",
            "dpc": "03010314001",
            "name": "គួច  ម៉ារី ១"
        },
        {
            "barcode": "171121877",
            "dpc": "03010314101",
            "name": "គួច  ម៉ារី ២"
        },
        {
            "barcode": "171121878",
            "dpc": "03010314201",
            "name": "ហេង សន"
        },
        {
            "barcode": "171121879",
            "dpc": "03010314301",
            "name": "ឡាញ់ ម៉ុងទី"
        },
        {
            "barcode": "171121880",
            "dpc": "03010331301",
            "name": "អ៊ុយ សុខុម"
        },
        {
            "barcode": "171121881",
            "dpc": "03010331401",
            "name": "ហ៊ាង អូន"
        },
        {
            "barcode": "171121882",
            "dpc": "03010331501",
            "name": "នុត សារុន"
        },
        {
            "barcode": "171121883",
            "dpc": "03010331601",
            "name": "នុត សារិទ្ធ"
        },
        {
            "barcode": "171121884",
            "dpc": "03010331701",
            "name": "មាស សុភិន ១"
        },
        {
            "barcode": "171121885",
            "dpc": "03010331801",
            "name": "មាស សុភិន ២"
        },
        {
            "barcode": "171121886",
            "dpc": "03010331901",
            "name": "ហូរ ប៊ុនហេង"
        },
        {
            "barcode": "171121887",
            "dpc": "03010332001",
            "name": "ហុង ចាន់នី"
        },
        {
            "barcode": "171121888",
            "dpc": "03010332101",
            "name": "ងិន សុជា"
        },
        {
            "barcode": "171121889",
            "dpc": "03010332201",
            "name": "តាំង ហុង"
        },
        {
            "barcode": "171121890",
            "dpc": "03010332301",
            "name": "ប៉ាវ សុភាព"
        },
        {
            "barcode": "171121891",
            "dpc": "03010332501",
            "name": "ជា ចាន់ថា"
        },
        {
            "barcode": "171121892",
            "dpc": "03010332601",
            "name": "ឈុំ ហៀង"
        },
        {
            "barcode": "171121893",
            "dpc": "03010332701",
            "name": "សាំង ឈិនហូរ"
        },
        {
            "barcode": "171121894",
            "dpc": "03010332801",
            "name": "កែវ ពិសិទ្ធ"
        },
        {
            "barcode": "171121895",
            "dpc": "03010332901",
            "name": "ចាន់ ឃុយ"
        },
        {
            "barcode": "171121896",
            "dpc": "03010333001",
            "name": "សុខ អាន"
        },
        {
            "barcode": "171121897",
            "dpc": "03010333101",
            "name": "ជ័យ សារឿន"
        },
        {
            "barcode": "171121898",
            "dpc": "03010333301",
            "name": "សុខ វណ្ណី"
        },
        {
            "barcode": "171121899",
            "dpc": "03010328501",
            "name": "អ៊ិន សារឿន"
        },
        {
            "barcode": "171121900",
            "dpc": "03010328901",
            "name": "រស ផល"
        },
        {
            "barcode": "171121901",
            "dpc": "03010329001",
            "name": "សៅ ញ៉ាំង"
        },
        {
            "barcode": "171121902",
            "dpc": "03010329401",
            "name": "វ៉ាន់ ធី"
        },
        {
            "barcode": "171121903",
            "dpc": "03010308501",
            "name": "ពេជ្រ បូរ"
        },
        {
            "barcode": "171121904",
            "dpc": "03010309201",
            "name": "រ៉ុង ឈឿន"
        },
        {
            "barcode": "171121905",
            "dpc": "03010308601",
            "name": "ព្រំ ឆៃយ៉ាន"
        },
        {
            "barcode": "171121906",
            "dpc": "03010308701",
            "name": "សេង ថាឌី ១"
        },
        {
            "barcode": "171121907",
            "dpc": "03010308801",
            "name": "សេង ថាឌី ២"
        },
        {
            "barcode": "171121908",
            "dpc": "03010308901",
            "name": "សរ យស់ថាវរៈ"
        },
        {
            "barcode": "171121909",
            "dpc": "03010309101",
            "name": "អែវ និមល"
        },
        {
            "barcode": "171121910",
            "dpc": "03010326901",
            "name": "យិន សារឿន ១"
        },
        {
            "barcode": "171121911",
            "dpc": "03010327001",
            "name": "យិន សារឿន ២"
        },
        {
            "barcode": "171121912",
            "dpc": "03010327101",
            "name": "យិន សារឿន ៣"
        },
        {
            "barcode": "171121913",
            "dpc": "03010327301",
            "name": "ឈាង ឌុក"
        },
        {
            "barcode": "171121914",
            "dpc": "03010327501",
            "name": "ថ្លាង ប៊ុនណាត"
        },
        {
            "barcode": "171121915",
            "dpc": "03010327801",
            "name": "អ៊ុំ រ៉ា"
        },
        {
            "barcode": "171121916",
            "dpc": "03010328301",
            "name": "អ៊ុន រឿន"
        },
        {
            "barcode": "171121917",
            "dpc": "03010329701",
            "name": "ហ៊ុល យ៉ាង"
        },
        {
            "barcode": "171121918",
            "dpc": "03010329601",
            "name": "ទាវ វុទ្ធី"
        },
        {
            "barcode": "171121919",
            "dpc": "03010329501",
            "name": "ឃឹម សារ៉ាត់"
        },
        {
            "barcode": "171121920",
            "dpc": "03010329301",
            "name": "អ៊ុយ លីវ ៣"
        },
        {
            "barcode": "171121921",
            "dpc": "03010329201",
            "name": "អ៊ុយ លីវ ២"
        },
        {
            "barcode": "171121922",
            "dpc": "03010328801",
            "name": "ខាំ សារ៉ុម"
        },
        {
            "barcode": "171121923",
            "dpc": "03010328401",
            "name": "យ៉ាន សុភី"
        },
        {
            "barcode": "171121924",
            "dpc": "03010328201",
            "name": "កែវ ហឿន"
        },
        {
            "barcode": "171121925",
            "dpc": "03010328101",
            "name": "កែវ  រ៉ាដា"
        },
        {
            "barcode": "171121926",
            "dpc": "03010328001",
            "name": "ឯម សុភី"
        },
        {
            "barcode": "171121927",
            "dpc": "03010327601",
            "name": "កាន់ ណាឌី"
        },
        {
            "barcode": "171121928",
            "dpc": "03010327401",
            "name": "តាង សារ៉េត"
        },
        {
            "barcode": "171121929",
            "dpc": "03010327201",
            "name": "ថោង ផល្លា"
        },
        {
            "barcode": "171121930",
            "dpc": "03010319201",
            "name": "សាលារៀនព្រែកព្រះស្តេច"
        },
        {
            "barcode": "171121931",
            "dpc": "03010319301",
            "name": "កែវ ផូ"
        },
        {
            "barcode": "171121932",
            "dpc": "03010319701",
            "name": "សុង ស៊ឹង"
        },
        {
            "barcode": "171121933",
            "dpc": "03010320201",
            "name": "ភុំ រីណូ"
        },
        {
            "barcode": "171121934",
            "dpc": "03010320301",
            "name": "សៀង ស៊ាត"
        },
        {
            "barcode": "171121935",
            "dpc": "03010320401",
            "name": "លី សេង"
        },
        {
            "barcode": "171121936",
            "dpc": "03010320601",
            "name": "រឿន ឈិន"
        },
        {
            "barcode": "171121937",
            "dpc": "03010320701",
            "name": "ហុង សុជា"
        },
        {
            "barcode": "171121938",
            "dpc": "03010320801",
            "name": "ហាក់ ទៀង"
        },
        {
            "barcode": "171121939",
            "dpc": "03010321001",
            "name": "គឹម ប៊ុនថា"
        },
        {
            "barcode": "171121940",
            "dpc": "03010321101",
            "name": "ថោង សារ៉ន"
        },
        {
            "barcode": "171121941",
            "dpc": "03010329801",
            "name": "ថង ចេង"
        },
        {
            "barcode": "171121942",
            "dpc": "03010330701",
            "name": "ហ៊ាង ណៃជឹង"
        },
        {
            "barcode": "171121943",
            "dpc": "03010330601",
            "name": "សាត សារ៉ន"
        },
        {
            "barcode": "171121944",
            "dpc": "03010330501",
            "name": "នូ សំបូរ"
        },
        {
            "barcode": "171121945",
            "dpc": "03010330301",
            "name": "ហ៊ាង តឹកលី"
        },
        {
            "barcode": "171121946",
            "dpc": "03010330201",
            "name": "យន់ ឡៃ"
        },
        {
            "barcode": "171121947",
            "dpc": "03010330101",
            "name": "ឪ សារឿន"
        },
        {
            "barcode": "171121948",
            "dpc": "03010330001",
            "name": "ជិន សំប៊ុន"
        },
        {
            "barcode": "171121949",
            "dpc": "03010329901",
            "name": "ថង សៀង"
        },
        {
            "barcode": "171121950",
            "dpc": "03010330901",
            "name": "ព្រិល ហ៊ាង"
        },
        {
            "barcode": "171121951",
            "dpc": "03010331001",
            "name": "ឈឿ ឈួន"
        },
        {
            "barcode": "171121952",
            "dpc": "03010331101",
            "name": "ប៉ែន ភូង"
        },
        {
            "barcode": "171121953",
            "dpc": "03010331201",
            "name": "ធីតា លក្ខិណា"
        },
        {
            "barcode": "171121954",
            "dpc": "03010309301",
            "name": "អ៊ឹង ថាវី"
        },
        {
            "barcode": "171121955",
            "dpc": "03010314401",
            "name": "ស៊ីន វុឌ្ឍី"
        },
        {
            "barcode": "171121956",
            "dpc": "03010314501",
            "name": "គង់ សក់"
        },
        {
            "barcode": "171121957",
            "dpc": "03010314701",
            "name": "ឃួន ផន"
        },
        {
            "barcode": "171121958",
            "dpc": "03010314801",
            "name": "កែវ ម៉ូរ៉ាគន្ធ"
        },
        {
            "barcode": "171121959",
            "dpc": "03010314901",
            "name": "សំ សែម"
        },
        {
            "barcode": "171121960",
            "dpc": "03010315001",
            "name": "មុំ រ៉ៃ"
        },
        {
            "barcode": "171121961",
            "dpc": "03010315201",
            "name": "អ៊ុំ ម៉ាលី"
        },
        {
            "barcode": "171121962",
            "dpc": "03010315101",
            "name": "កៅ ថា"
        },
        {
            "barcode": "171121963",
            "dpc": "03010315301",
            "name": "ម៉ិល ហេង"
        },
        {
            "barcode": "171121964",
            "dpc": "03010315401",
            "name": "មាស ស្រាង"
        },
        {
            "barcode": "171121965",
            "dpc": "03010315501",
            "name": "ហង្ស ស៊ីណា"
        },
        {
            "barcode": "171121966",
            "dpc": "03010315601",
            "name": "សុទ្ធ ឈឿម"
        },
        {
            "barcode": "171121967",
            "dpc": "03010318401",
            "name": "សុក សោភា"
        },
        {
            "barcode": "171121968",
            "dpc": "03010318501",
            "name": "ម៉ាច គឹមឆាយ"
        },
        {
            "barcode": "171121969",
            "dpc": "03010318601",
            "name": "មៀន គឹមហ៊ាង"
        },
        {
            "barcode": "171121970",
            "dpc": "03010318701",
            "name": "យិន ប៉ក"
        },
        {
            "barcode": "171121971",
            "dpc": "03010318901",
            "name": "ម៉ន រ៉ែត"
        },
        {
            "barcode": "171121972",
            "dpc": "03010319001",
            "name": "ផាត់ សេង"
        },
        {
            "barcode": "171121973",
            "dpc": "03010319101",
            "name": "ឡេង ជីវ"
        },
        {
            "barcode": "171121974",
            "dpc": "03010319901",
            "name": "ភិវ ចំរើន"
        },
        {
            "barcode": "171121975",
            "dpc": "03010317601",
            "name": "ឥត ចំណាន"
        },
        {
            "barcode": "171121976",
            "dpc": "03010317701",
            "name": "កៀវ គឹមលន"
        },
        {
            "barcode": "171121977",
            "dpc": "03010317801",
            "name": "ចៅ គឹមអូន ១"
        },
        {
            "barcode": "171121978",
            "dpc": "03010317901",
            "name": "ចៅ គឹមអូន ២"
        },
        {
            "barcode": "171121979",
            "dpc": "03010318101",
            "name": "រស់ សារួន"
        },
        {
            "barcode": "171121980",
            "dpc": "03010318201",
            "name": "ឡាយ ទិតដារ៉ា"
        },
        {
            "barcode": "171121981",
            "dpc": "03010318301",
            "name": "ភឿក រ័ត្ន"
        },
        {
            "barcode": "171121982",
            "dpc": "03010315701",
            "name": "យក់ វ៉ានឆវី"
        },
        {
            "barcode": "171121983",
            "dpc": "03010315801",
            "name": "កែវ ដារ៉ា"
        },
        {
            "barcode": "171121984",
            "dpc": "03010315901",
            "name": "លឹម សាម៉េត"
        },
        {
            "barcode": "171121985",
            "dpc": "03010316101",
            "name": "ស៊ាង យ៉ាងហ្គោ"
        },
        {
            "barcode": "171121986",
            "dpc": "03010316601",
            "name": "លួង ឡេង"
        },
        {
            "barcode": "171121987",
            "dpc": "03010316701",
            "name": "ប៉ាន ប៊ុនរឿន"
        },
        {
            "barcode": "171121988",
            "dpc": "03010316501",
            "name": "ម៉ី ប៊ុនហួរ១"
        },
        {
            "barcode": "171121989",
            "dpc": "03010316201",
            "name": "ម៉ី ប៊ុនហូរ"
        },
        {
            "barcode": "171121990",
            "dpc": "03010316901",
            "name": "ឡឹក សុខុន"
        },
        {
            "barcode": "171121991",
            "dpc": "03010316801",
            "name": "ទូច លន"
        },
        {
            "barcode": "171121992",
            "dpc": "03010316301",
            "name": "នូវ សុភាព ១"
        },
        {
            "barcode": "171121993",
            "dpc": "03010317001",
            "name": "សំ វែង"
        },
        {
            "barcode": "171121994",
            "dpc": "03010317101",
            "name": "អ៊ុក សឿន"
        },
        {
            "barcode": "171121995",
            "dpc": "03010317201",
            "name": "គុណ សាលឿត"
        },
        {
            "barcode": "171121996",
            "dpc": "03010317301",
            "name": "កែវ ភ័ក្រ្ត"
        },
        {
            "barcode": "171121997",
            "dpc": "03010317401",
            "name": "សៅ សុជាតិ ១"
        },
        {
            "barcode": "171121998",
            "dpc": "03010318001",
            "name": "ចៅ  គឹមអូន ៣"
        },
        {
            "barcode": "171121999",
            "dpc": "03010338501",
            "name": "លី យូសូស"
        },
        {
            "barcode": "171122000",
            "dpc": "03010300401",
            "name": "ជឹម ឈិញ"
        },
        {
            "barcode": "171122001",
            "dpc": "03010338601",
            "name": "ហួយ ហុង"
        },
        {
            "barcode": "171122002",
            "dpc": "03010338701",
            "name": "ស្រី ល័ក្ខ"
        },
        {
            "barcode": "171122003",
            "dpc": "03010338801",
            "name": "ប្រាង ភឿត"
        },
        {
            "barcode": "171122004",
            "dpc": "03010338901",
            "name": "សេង ហូរ"
        },
        {
            "barcode": "171122005",
            "dpc": "03010339001",
            "name": "យ៉ាត ចរិយា"
        },
        {
            "barcode": "171122006",
            "dpc": "03010339101",
            "name": "អ៊ុល រឿន"
        },
        {
            "barcode": "171122007",
            "dpc": "03010339201",
            "name": "អ៊ាប វិសាល"
        },
        {
            "barcode": "171122008",
            "dpc": "03010339301",
            "name": "សយ សាវិច"
        },
        {
            "barcode": "171122009",
            "dpc": "03010339401",
            "name": "ជឿម ឃុន"
        },
        {
            "barcode": "171122010",
            "dpc": "03010339501",
            "name": "ទុំ ប៊ុនធៀន"
        },
        {
            "barcode": "171122011",
            "dpc": "03010321401",
            "name": "ឆឹង ដួង"
        },
        {
            "barcode": "171122012",
            "dpc": "03010321201",
            "name": "ហុង គុយ"
        },
        {
            "barcode": "171122013",
            "dpc": "03010320901",
            "name": "ទូច ហួត"
        },
        {
            "barcode": "171122014",
            "dpc": "03010320501",
            "name": "សាយ សុភាព"
        },
        {
            "barcode": "171122015",
            "dpc": "03010320101",
            "name": "មឹង សួន"
        },
        {
            "barcode": "171122016",
            "dpc": "03010320001",
            "name": "ស ធុច"
        },
        {
            "barcode": "171122017",
            "dpc": "03010319801",
            "name": "ម៉ី ផាន់ណារិទ្ធ"
        },
        {
            "barcode": "171122018",
            "dpc": "03010319401",
            "name": "ស្រី ឆូ"
        },
        {
            "barcode": "171122019",
            "dpc": "03010319601",
            "name": "តោ សាហឿយ"
        },
        {
            "barcode": "171122020",
            "dpc": "03010319501",
            "name": "តោ ហ៊ុន"
        },
        {
            "barcode": "171122021",
            "dpc": "03010326701",
            "name": "លាស គួយ"
        },
        {
            "barcode": "171122022",
            "dpc": "03010326601",
            "name": "ភិន វណ្ណា"
        },
        {
            "barcode": "171122023",
            "dpc": "03010338401",
            "name": "គង់ ឈួន"
        },
        {
            "barcode": "171122024",
            "dpc": "03010326501",
            "name": "ងួន កិត្យា"
        },
        {
            "barcode": "171122025",
            "dpc": "03010326401",
            "name": "ឆឹង ឈួម"
        },
        {
            "barcode": "171122026",
            "dpc": "03010326301",
            "name": "ឆយ ម៉ូវធាង"
        },
        {
            "barcode": "171122027",
            "dpc": "03010326201",
            "name": "វ៉ាន់ ឃាង"
        },
        {
            "barcode": "171122028",
            "dpc": "03010326101",
            "name": "ប៉ក ចាន់"
        },
        {
            "barcode": "171122029",
            "dpc": "03010326001",
            "name": "ប៉ូយ ហ៊ីម"
        },
        {
            "barcode": "171122030",
            "dpc": "03010325901",
            "name": "អេង ង៉ោ"
        },
        {
            "barcode": "171122031",
            "dpc": "03010325801",
            "name": "សុខ អឿន"
        },
        {
            "barcode": "171122032",
            "dpc": "03010325701",
            "name": "ឆឹង ឆាង"
        },
        {
            "barcode": "171122033",
            "dpc": "03010325601",
            "name": "សន ផាន់នី"
        },
        {
            "barcode": "171122034",
            "dpc": "03010325401",
            "name": "ប៉ែន សំបូរ"
        },
        {
            "barcode": "171122035",
            "dpc": "03010325301",
            "name": "មុំ វ៉ាត"
        },
        {
            "barcode": "171122036",
            "dpc": "03010325501",
            "name": "ឡុង សុផាន"
        },
        {
            "barcode": "171122037",
            "dpc": "03010325201",
            "name": "ឡេង សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171122038",
            "dpc": "03010325101",
            "name": "សៀង សាវឿន"
        },
        {
            "barcode": "171122039",
            "dpc": "03010325001",
            "name": "ស ចាន់ថា"
        },
        {
            "barcode": "171122040",
            "dpc": "03010324901",
            "name": "ព្រែក ថា"
        },
        {
            "barcode": "171122041",
            "dpc": "03010324801",
            "name": "ហោ ផល្លី"
        },
        {
            "barcode": "171122042",
            "dpc": "03010324701",
            "name": "គុយ ចាន់ធូ"
        },
        {
            "barcode": "171122043",
            "dpc": "03010324601",
            "name": "ហាក គឹមលាង"
        },
        {
            "barcode": "171122044",
            "dpc": "03010324201",
            "name": "អួង បូរ៉ាផា"
        },
        {
            "barcode": "171122045",
            "dpc": "03010324401",
            "name": "មាស ផុន"
        },
        {
            "barcode": "171122046",
            "dpc": "03010324501",
            "name": "ហុក លាភ"
        },
        {
            "barcode": "171122047",
            "dpc": "03010324301",
            "name": "គី ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171122048",
            "dpc": "03010324101",
            "name": "ឈិន សុផានី"
        },
        {
            "barcode": "171122049",
            "dpc": "03010323901",
            "name": "អេង សាលឿន"
        },
        {
            "barcode": "171122050",
            "dpc": "03010323801",
            "name": "ឆោម គឹមយួង"
        },
        {
            "barcode": "171122051",
            "dpc": "03010323701",
            "name": "ទឹម សេរី"
        },
        {
            "barcode": "171122052",
            "dpc": "03010323601",
            "name": "ឃួន ស៊ាប"
        },
        {
            "barcode": "171122053",
            "dpc": "03010323501",
            "name": "អឿម ប៊ុណ្ណា"
        },
        {
            "barcode": "171122054",
            "dpc": "03010323401",
            "name": "លាន នី"
        },
        {
            "barcode": "171122055",
            "dpc": "03010323301",
            "name": "សយ សារ៉ន"
        },
        {
            "barcode": "171122056",
            "dpc": "03010323201",
            "name": "ខុង ធួក"
        },
        {
            "barcode": "171122057",
            "dpc": "03010323101",
            "name": "អ៊ុក សំផុន"
        },
        {
            "barcode": "171122058",
            "dpc": "03010323001",
            "name": "សយ រៀង"
        },
        {
            "barcode": "171122059",
            "dpc": "03010322801",
            "name": "សូ ផេងគុណ"
        },
        {
            "barcode": "171122060",
            "dpc": "03010322701",
            "name": "ហួត  គីរីរិត"
        },
        {
            "barcode": "171122061",
            "dpc": "03010322601",
            "name": "ភឿប​ ផាយោ"
        },
        {
            "barcode": "171122062",
            "dpc": "03010322401",
            "name": "រ៉ែត គុណធារី"
        },
        {
            "barcode": "171122063",
            "dpc": "03010322301",
            "name": "សុខ វិបុល"
        },
        {
            "barcode": "171122064",
            "dpc": "03010322201",
            "name": "ខាត់ ឡុង"
        },
        {
            "barcode": "171122065",
            "dpc": "03010322901",
            "name": "ឈុត សុគន្ធា"
        },
        {
            "barcode": "171122066",
            "dpc": "03010322101",
            "name": "ថៃ ហេង"
        },
        {
            "barcode": "171122067",
            "dpc": "03010322001",
            "name": "យស ឈួន"
        },
        {
            "barcode": "171122068",
            "dpc": "03010321901",
            "name": "បេង សុធី"
        },
        {
            "barcode": "171122069",
            "dpc": "03010321801",
            "name": "ហុង វណ្ណារិទ្ធ"
        },
        {
            "barcode": "171122070",
            "dpc": "03010321601",
            "name": "តាន់ សិទ្ធ"
        },
        {
            "barcode": "171122071",
            "dpc": "03010321701",
            "name": "យ៉ាត ថូ"
        },
        {
            "barcode": "171122072",
            "dpc": "03010321501",
            "name": "សំ វ៉ានថុល"
        },
        {
            "barcode": "171122073",
            "dpc": "03010342101",
            "name": "កែវ ម៉ាន់ធឿន"
        },
        {
            "barcode": "171122074",
            "dpc": "03010342201",
            "name": "សាង សាវុន"
        },
        {
            "barcode": "171122075",
            "dpc": "03010342401",
            "name": "ភឹម ហេង"
        },
        {
            "barcode": "171122076",
            "dpc": "03010342501",
            "name": "តាំង ម៉េង"
        },
        {
            "barcode": "171122077",
            "dpc": "03010342601",
            "name": "ងួន រតនៈ ២"
        },
        {
            "barcode": "171122078",
            "dpc": "03010342701",
            "name": "ឆយ ម៉ូវធៀង"
        },
        {
            "barcode": "171122079",
            "dpc": "03010342901",
            "name": "ឈឿត សំខាន់"
        },
        {
            "barcode": "171122080",
            "dpc": "03010342801",
            "name": "ហេង ហៀង"
        },
        {
            "barcode": "171122081",
            "dpc": "03010343001",
            "name": "ងិន ណារី"
        },
        {
            "barcode": "171122082",
            "dpc": "03010343101",
            "name": "សឹង កាក់"
        },
        {
            "barcode": "171122083",
            "dpc": "03010343301",
            "name": "ប៉េង រ៉ាដេត"
        },
        {
            "barcode": "171122084",
            "dpc": "03010343401",
            "name": "ឃុន កី"
        },
        {
            "barcode": "171122085",
            "dpc": "03010343501",
            "name": "ចាន់ គឹមឡេង"
        },
        {
            "barcode": "171122086",
            "dpc": "03010343601",
            "name": "គី គឹមឡេង"
        },
        {
            "barcode": "171122087",
            "dpc": "03010343701",
            "name": "សយ ឈួន"
        },
        {
            "barcode": "171122088",
            "dpc": "03010343801",
            "name": "សឿន ឃឿប"
        },
        {
            "barcode": "171122089",
            "dpc": "03010343901",
            "name": "ក្រូច គីរី"
        },
        {
            "barcode": "171122090",
            "dpc": "03010344001",
            "name": "សាត សុខុំ"
        },
        {
            "barcode": "171122091",
            "dpc": "03010344101",
            "name": "ធូ ធិន"
        },
        {
            "barcode": "171122092",
            "dpc": "03010344901",
            "name": "ឆឺយ ស៊ីន"
        },
        {
            "barcode": "171122093",
            "dpc": "03010344701",
            "name": "សុខ លាងហួយ"
        },
        {
            "barcode": "171122094",
            "dpc": "03010344501",
            "name": "រ័ត្ន វ៉ាន់"
        },
        {
            "barcode": "171122095",
            "dpc": "03010344301",
            "name": "អ៊ុន ឆៃហ៊ាង"
        },
        {
            "barcode": "171122096",
            "dpc": "03010344201",
            "name": "ទី ផាត"
        },
        {
            "barcode": "171122097",
            "dpc": "03010345201",
            "name": "ស៊ុយ សុវណ្ណមន្នី"
        },
        {
            "barcode": "171122098",
            "dpc": "03010337801",
            "name": "សៀង  លីម"
        },
        {
            "barcode": "171122099",
            "dpc": "03010344801",
            "name": "គង់ បណ្តូល"
        },
        {
            "barcode": "171122100",
            "dpc": "03010345501",
            "name": "ហេង ពៅ"
        },
        {
            "barcode": "171122101",
            "dpc": "03010345301",
            "name": "វិទ្យាស្ថានអភិវឌ្ឍន៍"
        },
        {
            "barcode": "171122102",
            "dpc": "03010345401",
            "name": "ងួន គង់"
        },
        {
            "barcode": "171122103",
            "dpc": "03010345601",
            "name": "សឿន ស៊ីថា"
        },
        {
            "barcode": "171122104",
            "dpc": "03010345701",
            "name": "អ៊ុក សាវុន"
        },
        {
            "barcode": "171122105",
            "dpc": "03010345801",
            "name": "ទឹម ដារ៉េត"
        },
        {
            "barcode": "171122106",
            "dpc": "03010345901",
            "name": "ឡាច លីម"
        },
        {
            "barcode": "171122107",
            "dpc": "03010346001",
            "name": "ចាន់ ទូច"
        },
        {
            "barcode": "171122108",
            "dpc": "03010346101",
            "name": "ម៉ា ម៉ុន្ថា"
        },
        {
            "barcode": "171122109",
            "dpc": "03010346201",
            "name": "ចាន់ រ៉ា"
        },
        {
            "barcode": "171122110",
            "dpc": "03010346301",
            "name": "អោម ភាព"
        },
        {
            "barcode": "171122111",
            "dpc": "03010346401",
            "name": "ងួន ប៊ុនណា"
        },
        {
            "barcode": "171122112",
            "dpc": "03010346501",
            "name": "ជឹម  ជឿន"
        },
        {
            "barcode": "171122113",
            "dpc": "03010346801",
            "name": "ឡុង ហុកម៉េង"
        },
        {
            "barcode": "171122114",
            "dpc": "03010346601",
            "name": "សន សុផាន់នី"
        },
        {
            "barcode": "171122115",
            "dpc": "03010346901",
            "name": "លន់ ហ៊ិន"
        },
        {
            "barcode": "171122116",
            "dpc": "03010347001",
            "name": "ខាត់ ជុន"
        },
        {
            "barcode": "171122117",
            "dpc": "03010347101",
            "name": "យន់ រ៉ាវី"
        },
        {
            "barcode": "171122118",
            "dpc": "03010347401",
            "name": "ប៉ាវ ចាន់ដារ៉ា"
        },
        {
            "barcode": "171122119",
            "dpc": "03010339601",
            "name": "គឹម ភិគុណ"
        },
        {
            "barcode": "171122120",
            "dpc": "03010339701",
            "name": "នន់ នៅ"
        },
        {
            "barcode": "171122121",
            "dpc": "03010339801",
            "name": "ហេង សុផាត"
        },
        {
            "barcode": "171122122",
            "dpc": "03010340001",
            "name": "ឃឹម សាវុធ"
        },
        {
            "barcode": "171122123",
            "dpc": "03010339901",
            "name": "ទិត និត"
        },
        {
            "barcode": "171122124",
            "dpc": "03010340101",
            "name": "យ៉ាន ធី"
        },
        {
            "barcode": "171122125",
            "dpc": "03010340201",
            "name": "ជា ណាវី"
        },
        {
            "barcode": "171122126",
            "dpc": "03010340301",
            "name": "ឈួន សំណាង"
        },
        {
            "barcode": "171122127",
            "dpc": "03010340501",
            "name": "ស៊ីម ហុង"
        },
        {
            "barcode": "171122128",
            "dpc": "03010340701",
            "name": "ឡាយ សារ៉ុង"
        },
        {
            "barcode": "171122129",
            "dpc": "03010340601",
            "name": "ចាយ សំណាង"
        },
        {
            "barcode": "171122130",
            "dpc": "03010340801",
            "name": "ភេង សាធី"
        },
        {
            "barcode": "171122131",
            "dpc": "03010340901",
            "name": "ចាន់ វណ្ណៈ"
        },
        {
            "barcode": "171122132",
            "dpc": "03010341001",
            "name": "ប៉ែន តាន់"
        },
        {
            "barcode": "171122133",
            "dpc": "03010341101",
            "name": "ម៉ាន់ សូនី"
        },
        {
            "barcode": "171122134",
            "dpc": "03010341201",
            "name": "គឹម ចាន់"
        },
        {
            "barcode": "171122135",
            "dpc": "03010341301",
            "name": "អ៊ុល កញ្ញា"
        },
        {
            "barcode": "171122136",
            "dpc": "03010341401",
            "name": "ទេព កុសល"
        },
        {
            "barcode": "171122137",
            "dpc": "03010341501",
            "name": "ញ៉ូ សាអ៊ីម"
        },
        {
            "barcode": "171122138",
            "dpc": "03010341601",
            "name": "ញ៉ូ សុផារី"
        },
        {
            "barcode": "171122139",
            "dpc": "03010341701",
            "name": "កែវ ឡុង"
        },
        {
            "barcode": "171122140",
            "dpc": "03010341801",
            "name": "ម៉ាត់ យើ"
        },
        {
            "barcode": "171122141",
            "dpc": "03010341901",
            "name": "ម៉ាត់ លះ"
        },
        {
            "barcode": "171122142",
            "dpc": "03010342001",
            "name": "ម៉ាត់ យ៉ាន"
        },
        {
            "barcode": "171122143",
            "dpc": "03010346701",
            "name": "រី ចាន់ដូ"
        },
        {
            "barcode": "171122144",
            "dpc": "03010347201",
            "name": "ហ៊ីម សុភាព"
        },
        {
            "barcode": "171122145",
            "dpc": "03010347301",
            "name": "ចាប សារី"
        },
        {
            "barcode": "171122146",
            "dpc": "03010347501",
            "name": "ឃ្លាំង សូគីម៉ិច"
        },
        {
            "barcode": "171122147",
            "dpc": "03010347601",
            "name": "នង ប៉ុនធឿន"
        },
        {
            "barcode": "171122148",
            "dpc": "03010347701",
            "name": "ហេង ចាន់ថាវី"
        },
        {
            "barcode": "171122149",
            "dpc": "03010347801",
            "name": "សំ គឹមហ៊ុន"
        },
        {
            "barcode": "171122150",
            "dpc": "03010347901",
            "name": "ឃឿ យូលី"
        },
        {
            "barcode": "171122151",
            "dpc": "03010302601",
            "name": "ឡាយ  ជាង"
        },
        {
            "barcode": "171122152",
            "dpc": "03010305101",
            "name": "តាន់ បូរ៉ាវណ្ណ"
        },
        {
            "barcode": "171122153",
            "dpc": "03010310301",
            "name": "ហុង  សុវណ្ណ"
        },
        {
            "barcode": "171122154",
            "dpc": "03010312201",
            "name": "ស វ៉ាន់ណារ៉េត"
        },
        {
            "barcode": "171122155",
            "dpc": "03010300101",
            "name": "គង់  យិន"
        },
        {
            "barcode": "171122156",
            "dpc": "03010300201",
            "name": "គង់  ហាច"
        },
        {
            "barcode": "171122157",
            "dpc": "03010300301",
            "name": "លួង  ខន"
        },
        {
            "barcode": "171122158",
            "dpc": "03010300601",
            "name": "ប៉ិច  គឹមលី"
        },
        {
            "barcode": "171122159",
            "dpc": "03010300701",
            "name": "សៅ  រិន្ទ"
        },
        {
            "barcode": "171122160",
            "dpc": "03010300901",
            "name": "លី  សំណាង"
        },
        {
            "barcode": "171122161",
            "dpc": "03010301001",
            "name": "ស៊ីម  សាវុន"
        },
        {
            "barcode": "171122162",
            "dpc": "03010301101",
            "name": "ជា ខេមរិន"
        },
        {
            "barcode": "171122163",
            "dpc": "03010301201",
            "name": "ពក  សម្បត្តិ"
        },
        {
            "barcode": "171122164",
            "dpc": "03010301301",
            "name": "សៅ  ប៊ុនសុង"
        },
        {
            "barcode": "171122165",
            "dpc": "03010301401",
            "name": "ងឹម ខេមរិទ្ធ"
        },
        {
            "barcode": "171122166",
            "dpc": "03010301501",
            "name": "ស៊ូ  គឹមហេង"
        },
        {
            "barcode": "171122167",
            "dpc": "03010301601",
            "name": "លឹម គឹមលាង"
        },
        {
            "barcode": "171122168",
            "dpc": "03010301701",
            "name": "ស៊ីន ពៅចិន្តា"
        },
        {
            "barcode": "171122169",
            "dpc": "03010301801",
            "name": "យិន លិននិន"
        },
        {
            "barcode": "171122170",
            "dpc": "03010301901",
            "name": "ឆាំ សោនីរដ្ឋ"
        },
        {
            "barcode": "171122171",
            "dpc": "03010302101",
            "name": "រុំ  រ៉េត"
        },
        {
            "barcode": "171122172",
            "dpc": "03010348001",
            "name": "ភួង សារុំ"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
