let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171123460",
            "dpc": "03010408401",
            "name": "អ៊ូ រ៉ាវុធ"
        },
        {
            "barcode": "171123461",
            "dpc": "03010400101",
            "name": "ហ៊ាង ញ៉េប"
        },
        {
            "barcode": "171123462",
            "dpc": "03010400201",
            "name": "ជា តិច"
        },
        {
            "barcode": "171123463",
            "dpc": "03010400301",
            "name": "លឹម គង់"
        },
        {
            "barcode": "171123464",
            "dpc": "03010400401",
            "name": "អ៊ីវ ឃួយ"
        },
        {
            "barcode": "171123465",
            "dpc": "03010400501",
            "name": "ហង ហួម"
        },
        {
            "barcode": "171123466",
            "dpc": "03010430101",
            "name": "លី សេង"
        },
        {
            "barcode": "171123467",
            "dpc": "03010400601",
            "name": "យូ សុភាព"
        },
        {
            "barcode": "171123468",
            "dpc": "03010400701",
            "name": "នុត ហឿម"
        },
        {
            "barcode": "171123469",
            "dpc": "03010400801",
            "name": "សោម សារឿន"
        },
        {
            "barcode": "171123470",
            "dpc": "03010401101",
            "name": "វ៉ាន់ លាភ"
        },
        {
            "barcode": "171123471",
            "dpc": "03010403201",
            "name": "ស៊ុន សន"
        },
        {
            "barcode": "171123472",
            "dpc": "03010403401",
            "name": "ហ៊ុន ចេង"
        },
        {
            "barcode": "171123473",
            "dpc": "03010403701",
            "name": "ជួម ជឿម"
        },
        {
            "barcode": "171123474",
            "dpc": "03010403801",
            "name": "ស៊ុន ទូច"
        },
        {
            "barcode": "171123475",
            "dpc": "03010403601",
            "name": "នង វួចហេង"
        },
        {
            "barcode": "171123476",
            "dpc": "03010403901",
            "name": "ចាន សារ៉េន"
        },
        {
            "barcode": "171123477",
            "dpc": "03010404001",
            "name": "សុខ គឹមហ៊ាង"
        },
        {
            "barcode": "171123478",
            "dpc": "03010404101",
            "name": "អៀង សារិទ្ធ"
        },
        {
            "barcode": "171123479",
            "dpc": "03010404201",
            "name": "សេង លីម៉េង"
        },
        {
            "barcode": "171123480",
            "dpc": "03010404301",
            "name": "ជិញ ស៊ីវប៉ី"
        },
        {
            "barcode": "171123481",
            "dpc": "03010404401",
            "name": "កែវ ស៊ីថា"
        },
        {
            "barcode": "171123482",
            "dpc": "03010419801",
            "name": "ទន់ ម៉ក់"
        },
        {
            "barcode": "171123483",
            "dpc": "03010419901",
            "name": "សាន វណ្ណា"
        },
        {
            "barcode": "171123484",
            "dpc": "03010420101",
            "name": "គង់ រិន"
        },
        {
            "barcode": "171123485",
            "dpc": "03010420201",
            "name": "អ៊ុំ ណារ៉ាន់"
        },
        {
            "barcode": "171123486",
            "dpc": "03010420301",
            "name": "ទៀង យន"
        },
        {
            "barcode": "171123487",
            "dpc": "03010420401",
            "name": "រឿន រ៉េត"
        },
        {
            "barcode": "171123488",
            "dpc": "03010420501",
            "name": "អែប ប៊ុនថា"
        },
        {
            "barcode": "171123489",
            "dpc": "03010420601",
            "name": "គឹម ហ៊ាង"
        },
        {
            "barcode": "171123490",
            "dpc": "03010420701",
            "name": "សុខ សារឿន"
        },
        {
            "barcode": "171123491",
            "dpc": "03010420801",
            "name": "ប៉ែន ពៅ"
        },
        {
            "barcode": "171123492",
            "dpc": "03010420901",
            "name": "អ៊ុំ កេន"
        },
        {
            "barcode": "171123493",
            "dpc": "03010421001",
            "name": "ហៅ សៀង"
        },
        {
            "barcode": "171123494",
            "dpc": "03010421101",
            "name": "នេត មុំ"
        },
        {
            "barcode": "171123495",
            "dpc": "03010421201",
            "name": "រឿន កើ"
        },
        {
            "barcode": "171123496",
            "dpc": "03010421301",
            "name": "សៅ គឹមរ៉ាន់"
        },
        {
            "barcode": "171123497",
            "dpc": "03010421401",
            "name": "ហង់ វាសនា"
        },
        {
            "barcode": "171123498",
            "dpc": "03010421501",
            "name": "អៀម ផល្លី"
        },
        {
            "barcode": "171123499",
            "dpc": "03010421601",
            "name": "សោម ស៊ីថា"
        },
        {
            "barcode": "171123500",
            "dpc": "03010421701",
            "name": "ណុង ចាន់ថន"
        },
        {
            "barcode": "171123501",
            "dpc": "03010421801",
            "name": "ឆេង សារិន"
        },
        {
            "barcode": "171123502",
            "dpc": "03010421901",
            "name": "ញាណ ផន"
        },
        {
            "barcode": "171123503",
            "dpc": "03010422001",
            "name": "ឃុន  សេង"
        },
        {
            "barcode": "171123504",
            "dpc": "03010422201",
            "name": "សុខ សារ៉ូ"
        },
        {
            "barcode": "171123505",
            "dpc": "03010422301",
            "name": "ទូច មុនីរ័ត្ន"
        },
        {
            "barcode": "171123506",
            "dpc": "03010422601",
            "name": "សុខ រ៉ួន"
        },
        {
            "barcode": "171123507",
            "dpc": "03010422701",
            "name": "នៅ ហាច"
        },
        {
            "barcode": "171123508",
            "dpc": "03010422801",
            "name": "ហាន់ វណ្ណ"
        },
        {
            "barcode": "171123509",
            "dpc": "03010423101",
            "name": "ស៊ី រឿន"
        },
        {
            "barcode": "171123510",
            "dpc": "03010423201",
            "name": "ឡៅ សុខហ៊ុន"
        },
        {
            "barcode": "171123511",
            "dpc": "03010423401",
            "name": "ទន់ ទូច"
        },
        {
            "barcode": "171123512",
            "dpc": "03010423501",
            "name": "ចាន់ ពលិន"
        },
        {
            "barcode": "171123513",
            "dpc": "03010423601",
            "name": "ទុំ សុវណ្ណនី"
        },
        {
            "barcode": "171123514",
            "dpc": "03010423801",
            "name": "សាំង វីរៈ"
        },
        {
            "barcode": "171123515",
            "dpc": "03010423901",
            "name": "យូ ពិសី"
        },
        {
            "barcode": "171123516",
            "dpc": "03010424001",
            "name": "សាង ម៉ៅ"
        },
        {
            "barcode": "171123517",
            "dpc": "03010424101",
            "name": "ភឹង ភឿន"
        },
        {
            "barcode": "171123518",
            "dpc": "03010424201",
            "name": "និន គឹមសាន្ត"
        },
        {
            "barcode": "171123519",
            "dpc": "03010424401",
            "name": "ចាន់ ធូ"
        },
        {
            "barcode": "171123520",
            "dpc": "03010424501",
            "name": "សុខ ថុង"
        },
        {
            "barcode": "171123521",
            "dpc": "03010424601",
            "name": "សេង ឌី"
        },
        {
            "barcode": "171123522",
            "dpc": "03010424701",
            "name": "ជិន គង់"
        },
        {
            "barcode": "171123523",
            "dpc": "03010424801",
            "name": "សាយ មុំ"
        },
        {
            "barcode": "171123524",
            "dpc": "03010425001",
            "name": "រស សុគន្ធ"
        },
        {
            "barcode": "171123525",
            "dpc": "03010425101",
            "name": "ប៊ុន ហេង"
        },
        {
            "barcode": "171123526",
            "dpc": "03010425201",
            "name": "សុខ ថេន"
        },
        {
            "barcode": "171123527",
            "dpc": "03010425301",
            "name": "តាំង គឹមឆេង"
        },
        {
            "barcode": "171123528",
            "dpc": "03010425401",
            "name": "កង ហៃ"
        },
        {
            "barcode": "171123529",
            "dpc": "03010425601",
            "name": "មិន ហុក"
        },
        {
            "barcode": "171123530",
            "dpc": "03010425701",
            "name": "ជិន ជា"
        },
        {
            "barcode": "171123531",
            "dpc": "03010425801",
            "name": "សួ គឹមសួ"
        },
        {
            "barcode": "171123532",
            "dpc": "03010425901",
            "name": "កាំង សួយងី"
        },
        {
            "barcode": "171123533",
            "dpc": "03010426001",
            "name": "សន ភាព"
        },
        {
            "barcode": "171123534",
            "dpc": "03010426101",
            "name": "យូ ពិសី ២"
        },
        {
            "barcode": "171123535",
            "dpc": "03010426401",
            "name": "លី ម៉េង ១"
        },
        {
            "barcode": "171123536",
            "dpc": "03010426501",
            "name": "ភី សី"
        },
        {
            "barcode": "171123537",
            "dpc": "03010426601",
            "name": "ម៉េង ឡូញ"
        },
        {
            "barcode": "171123538",
            "dpc": "03010426701",
            "name": "ជា សុខហេង"
        },
        {
            "barcode": "171123539",
            "dpc": "03010426901",
            "name": "ស៊ីវ សាន់"
        },
        {
            "barcode": "171123540",
            "dpc": "03010427001",
            "name": "យឹម គឹមលី"
        },
        {
            "barcode": "171123541",
            "dpc": "03010427301",
            "name": "ឃួន គន្ធា"
        },
        {
            "barcode": "171123542",
            "dpc": "03010427101",
            "name": "បៀន ជី"
        },
        {
            "barcode": "171123543",
            "dpc": "03010427201",
            "name": "វែន គីប"
        },
        {
            "barcode": "171123544",
            "dpc": "03010427401",
            "name": "លីម  ណង"
        },
        {
            "barcode": "171123545",
            "dpc": "03010427701",
            "name": "រី សារ័ត្ន"
        },
        {
            "barcode": "171123546",
            "dpc": "03010428601",
            "name": "ខេង ឃាង"
        },
        {
            "barcode": "171123547",
            "dpc": "03010428201",
            "name": "លុន លីទី"
        },
        {
            "barcode": "171123548",
            "dpc": "03010428301",
            "name": "សោម ចាន់ថុល"
        },
        {
            "barcode": "171123549",
            "dpc": "03010428401",
            "name": "កូវ ជឺងប៊ុង"
        },
        {
            "barcode": "171123550",
            "dpc": "03010428501",
            "name": "ឯក លាង"
        },
        {
            "barcode": "171123551",
            "dpc": "03010428101",
            "name": "លឹម វណ្ណារ៉ា"
        },
        {
            "barcode": "171123552",
            "dpc": "03010428001",
            "name": "សោម សុវណ្ណ"
        },
        {
            "barcode": "171123553",
            "dpc": "03010428701",
            "name": "ជា ប៊ុនលាង"
        },
        {
            "barcode": "171123554",
            "dpc": "03010428801",
            "name": "សុក គឹមសួ"
        },
        {
            "barcode": "171123555",
            "dpc": "03010427801",
            "name": "អ៊ុល ស៊ុត"
        },
        {
            "barcode": "171123556",
            "dpc": "03010428901",
            "name": "រស់ សូគាំ"
        },
        {
            "barcode": "171123557",
            "dpc": "03010429001",
            "name": "ចែ ធី"
        },
        {
            "barcode": "171123558",
            "dpc": "03010429101",
            "name": "មាស រីយ៉ា"
        },
        {
            "barcode": "171123559",
            "dpc": "03010429201",
            "name": "ជា ពៅ"
        },
        {
            "barcode": "171123560",
            "dpc": "03010429301",
            "name": "នួន គឹមឡេង"
        },
        {
            "barcode": "171123561",
            "dpc": "03010429401",
            "name": "ហ៊ីម ប៊ុនថន"
        },
        {
            "barcode": "171123562",
            "dpc": "03010429501",
            "name": "លន់ វ៉ង់"
        },
        {
            "barcode": "171123563",
            "dpc": "03010429601",
            "name": "ឆាន់ ចំរើន"
        },
        {
            "barcode": "171123564",
            "dpc": "03010429701",
            "name": "ឃុត វណ្ណៈ"
        },
        {
            "barcode": "171123565",
            "dpc": "03010429801",
            "name": "ដូរ សារី"
        },
        {
            "barcode": "171123566",
            "dpc": "03010429901",
            "name": "គឹម សំណាង"
        },
        {
            "barcode": "171123567",
            "dpc": "03010430001",
            "name": "គង ឡុក"
        },
        {
            "barcode": "171123568",
            "dpc": "03010430201",
            "name": "មាស ធី"
        },
        {
            "barcode": "171123569",
            "dpc": "03010430301",
            "name": "លី លិន"
        },
        {
            "barcode": "171123570",
            "dpc": "03010430401",
            "name": "ប៉ាង វណ្ណនី"
        },
        {
            "barcode": "171123571",
            "dpc": "03010430501",
            "name": "ចៅ យ៉ាន"
        },
        {
            "barcode": "171123572",
            "dpc": "03010430601",
            "name": "ចន្ធូ"
        },
        {
            "barcode": "171123573",
            "dpc": "03010430701",
            "name": "ទឹត្យ សាវុន"
        },
        {
            "barcode": "171123574",
            "dpc": "03010430801",
            "name": "លី ម៉េង"
        },
        {
            "barcode": "171123575",
            "dpc": "03010430901",
            "name": "ហឺ ដាវី"
        },
        {
            "barcode": "171123576",
            "dpc": "03010431001",
            "name": "ស៊ាន យ៉ុង"
        },
        {
            "barcode": "171123577",
            "dpc": "03010431101",
            "name": "ឈុន ឈីន"
        },
        {
            "barcode": "171123578",
            "dpc": "03010431201",
            "name": "កែវ សុភាព"
        },
        {
            "barcode": "171123579",
            "dpc": "03010422901",
            "name": "ច្រែង សុចន"
        },
        {
            "barcode": "171123580",
            "dpc": "03010423001",
            "name": "ជឹម ចន"
        },
        {
            "barcode": "171123581",
            "dpc": "03010418401",
            "name": "សាំង ចំរើន"
        },
        {
            "barcode": "171123582",
            "dpc": "03010418301",
            "name": "តាំង ប៊ូហេង"
        },
        {
            "barcode": "171123583",
            "dpc": "03010418201",
            "name": "សុ ដានី"
        },
        {
            "barcode": "171123584",
            "dpc": "03010418001",
            "name": "ទិត សារឿន"
        },
        {
            "barcode": "171123585",
            "dpc": "03010417901",
            "name": "មាស ស៊ីណា"
        },
        {
            "barcode": "171123586",
            "dpc": "03010417801",
            "name": "គា អាន"
        },
        {
            "barcode": "171123587",
            "dpc": "03010417701",
            "name": "ហុក សៀង"
        },
        {
            "barcode": "171123588",
            "dpc": "03010417601",
            "name": "សុខ ជា"
        },
        {
            "barcode": "171123589",
            "dpc": "03010405801",
            "name": "ហុង ផានឿន"
        },
        {
            "barcode": "171123590",
            "dpc": "03010405701",
            "name": "គង់ ប៊ូ"
        },
        {
            "barcode": "171123591",
            "dpc": "03010405601",
            "name": "គង់ ហឿន"
        },
        {
            "barcode": "171123592",
            "dpc": "03010405501",
            "name": "ឃុត សំអ៊ុល"
        },
        {
            "barcode": "171123593",
            "dpc": "03010405401",
            "name": "តឹង ហ៊ុយយ៉ាង"
        },
        {
            "barcode": "171123594",
            "dpc": "03010405301",
            "name": "ស៊ី ពិសិទ្ធ"
        },
        {
            "barcode": "171123595",
            "dpc": "03010404901",
            "name": "ឡៅ លុន"
        },
        {
            "barcode": "171123596",
            "dpc": "03010404701",
            "name": "ហាង ឃាង"
        },
        {
            "barcode": "171123597",
            "dpc": "03010404601",
            "name": "ហ៊ីង ជុំ"
        },
        {
            "barcode": "171123598",
            "dpc": "03010404501",
            "name": "ចូត ហាយ"
        },
        {
            "barcode": "171123599",
            "dpc": "03010419701",
            "name": "ហៃ សុខុន"
        },
        {
            "barcode": "171123600",
            "dpc": "03010419601",
            "name": "ឆាយ យ៉ុន"
        },
        {
            "barcode": "171123601",
            "dpc": "03010419501",
            "name": "ឡុង ឆុន"
        },
        {
            "barcode": "171123602",
            "dpc": "03010419401",
            "name": "យឹម សុផាន់"
        },
        {
            "barcode": "171123603",
            "dpc": "03010419301",
            "name": "តាំង ធីទៀក"
        },
        {
            "barcode": "171123604",
            "dpc": "03010419201",
            "name": "គួច លាភ"
        },
        {
            "barcode": "171123605",
            "dpc": "03010419101",
            "name": "ខាន់ វណ្ណៈ"
        },
        {
            "barcode": "171123606",
            "dpc": "03010419001",
            "name": "គឹម ដារ៉ា"
        },
        {
            "barcode": "171123607",
            "dpc": "03010418801",
            "name": "សោម ម៉េង"
        },
        {
            "barcode": "171123608",
            "dpc": "03010418701",
            "name": "ពេជ្រ សុវណ្ណ"
        },
        {
            "barcode": "171123609",
            "dpc": "03010418601",
            "name": "ប៊ូ នងសាវិន"
        },
        {
            "barcode": "171123610",
            "dpc": "03010418501",
            "name": "យ៉ម ចំរើន ៦"
        },
        {
            "barcode": "171123611",
            "dpc": "03010416901",
            "name": "តាំង តិចហួរ"
        },
        {
            "barcode": "171123612",
            "dpc": "03010416801",
            "name": "មួយ ហៀក"
        },
        {
            "barcode": "171123613",
            "dpc": "03010416701",
            "name": "គឹម ហួយ"
        },
        {
            "barcode": "171123614",
            "dpc": "03010416601",
            "name": "ស៊ីវ គីមឡេង"
        },
        {
            "barcode": "171123615",
            "dpc": "03010416501",
            "name": "សាង ប្រសើរ"
        },
        {
            "barcode": "171123616",
            "dpc": "03010416401",
            "name": "ពេញ បាំង"
        },
        {
            "barcode": "171123617",
            "dpc": "03010416301",
            "name": "ងួន ត្រាយ"
        },
        {
            "barcode": "171123618",
            "dpc": "03010416201",
            "name": "ទ្រី ហួរ"
        },
        {
            "barcode": "171123619",
            "dpc": "03010416001",
            "name": "ប៊ូច វឌ្ឍនា"
        },
        {
            "barcode": "171123620",
            "dpc": "03010415901",
            "name": "ជា ម៉េង"
        },
        {
            "barcode": "171123621",
            "dpc": "03010415801",
            "name": "ទ្រព្យ ជន"
        },
        {
            "barcode": "171123622",
            "dpc": "03010415701",
            "name": "ថៃ ណាវឿន"
        },
        {
            "barcode": "171123623",
            "dpc": "03010415601",
            "name": "ថៃ ប្រុសលាភ"
        },
        {
            "barcode": "171123624",
            "dpc": "03010415501",
            "name": "ជីវ សោភ័ណ្ឌ"
        },
        {
            "barcode": "171123625",
            "dpc": "03010415401",
            "name": "ប៊ុន ឃាម"
        },
        {
            "barcode": "171123626",
            "dpc": "03010415301",
            "name": "អួង ចេង"
        },
        {
            "barcode": "171123627",
            "dpc": "03010415201",
            "name": "អ៊ឹង អេងម៉េង"
        },
        {
            "barcode": "171123628",
            "dpc": "03010415101",
            "name": "ប៊ូច សុងហេង"
        },
        {
            "barcode": "171123629",
            "dpc": "03010415001",
            "name": "ហ្វាន់ ទី២"
        },
        {
            "barcode": "171123630",
            "dpc": "03010414901",
            "name": "យី ប៊ុនខន"
        },
        {
            "barcode": "171123631",
            "dpc": "03010414801",
            "name": "នក់ ហ្វួយ"
        },
        {
            "barcode": "171123632",
            "dpc": "03010414701",
            "name": "លាវ សុខទាវ"
        },
        {
            "barcode": "171123633",
            "dpc": "03010414501",
            "name": "ជា ចន្នី"
        },
        {
            "barcode": "171123634",
            "dpc": "03010414401",
            "name": "លាង ហួត"
        },
        {
            "barcode": "171123635",
            "dpc": "03010414301",
            "name": "ហេង ភិរម្យ"
        },
        {
            "barcode": "171123636",
            "dpc": "03010414201",
            "name": "សុខ សុចិត្ត"
        },
        {
            "barcode": "171123637",
            "dpc": "03010414101",
            "name": "វិន គឹមហួយ"
        },
        {
            "barcode": "171123638",
            "dpc": "03010408101",
            "name": "ម៉ែន តិចហេង"
        },
        {
            "barcode": "171123639",
            "dpc": "03010408001",
            "name": "ស៊ូ ហេង"
        },
        {
            "barcode": "171123640",
            "dpc": "03010407901",
            "name": "តែ ណារ៉ុង"
        },
        {
            "barcode": "171123641",
            "dpc": "03010407801",
            "name": "ហាក ឆៃលាង"
        },
        {
            "barcode": "171123642",
            "dpc": "03010407701",
            "name": "ឈឿប ឆៃ"
        },
        {
            "barcode": "171123643",
            "dpc": "03010407601",
            "name": "ចែ ម៉ៅ ១"
        },
        {
            "barcode": "171123644",
            "dpc": "03010407401",
            "name": "សុង ប៊ូយ"
        },
        {
            "barcode": "171123645",
            "dpc": "03010407301",
            "name": "ជា សំណាង ២"
        },
        {
            "barcode": "171123646",
            "dpc": "03010407201",
            "name": "ជា សំណាង ១"
        },
        {
            "barcode": "171123647",
            "dpc": "03010407101",
            "name": "ពុធ យ៉ាត"
        },
        {
            "barcode": "171123648",
            "dpc": "03010407001",
            "name": "ឃឹម សុផល"
        },
        {
            "barcode": "171123649",
            "dpc": "03010406901",
            "name": "តូ ផ"
        },
        {
            "barcode": "171123650",
            "dpc": "03010406801",
            "name": "អ៊ិន សុផាត"
        },
        {
            "barcode": "171123651",
            "dpc": "03010406701",
            "name": "ជា ជ"
        },
        {
            "barcode": "171123652",
            "dpc": "03010406601",
            "name": "ភោគ ផល្លា"
        },
        {
            "barcode": "171123653",
            "dpc": "03010406501",
            "name": "ងួន ប៉ូយ"
        },
        {
            "barcode": "171123654",
            "dpc": "03010406301",
            "name": "លឹម វេង"
        },
        {
            "barcode": "171123655",
            "dpc": "03010406201",
            "name": "លី ហ៊ួន"
        },
        {
            "barcode": "171123656",
            "dpc": "03010406101",
            "name": "ហុង ប៊ុនឡេង"
        },
        {
            "barcode": "171123657",
            "dpc": "03010406001",
            "name": "ចេង អឿន"
        },
        {
            "barcode": "171123658",
            "dpc": "03010405901",
            "name": "ឆាន់ វ៉ាន់លឿត"
        },
        {
            "barcode": "171123659",
            "dpc": "03010417501",
            "name": "ម៉ី សីហៈ"
        },
        {
            "barcode": "171123660",
            "dpc": "03010417401",
            "name": "ខៀវ ជំនិត"
        },
        {
            "barcode": "171123661",
            "dpc": "03010404801",
            "name": "អ៊ាង ប៊ុនហូរ"
        },
        {
            "barcode": "171123662",
            "dpc": "03010417201",
            "name": "អ៊ុន សវណ្ណារ៉ា"
        },
        {
            "barcode": "171123663",
            "dpc": "03010417101",
            "name": "សៀ សម្បត្តិ"
        },
        {
            "barcode": "171123664",
            "dpc": "03010417001",
            "name": "លឹម ងិន"
        },
        {
            "barcode": "171123665",
            "dpc": "03010403101",
            "name": "ទីវ ណារ័ត្ន"
        },
        {
            "barcode": "171123666",
            "dpc": "03010403001",
            "name": "ភឹម អូន"
        },
        {
            "barcode": "171123667",
            "dpc": "03010402901",
            "name": "គាត ផេង"
        },
        {
            "barcode": "171123668",
            "dpc": "03010402801",
            "name": "គឹម វន្ថា"
        },
        {
            "barcode": "171123669",
            "dpc": "03010402701",
            "name": "តាំង ហេង"
        },
        {
            "barcode": "171123670",
            "dpc": "03010402601",
            "name": "តាំង ឆេង"
        },
        {
            "barcode": "171123671",
            "dpc": "03010402501",
            "name": "សៀប ប៊ុនរ៉ុង"
        },
        {
            "barcode": "171123672",
            "dpc": "03010402401",
            "name": "ម៉ៅ ដារ៉ាវិឆ័យ"
        },
        {
            "barcode": "171123673",
            "dpc": "03010402301",
            "name": "ញ៉ែម ស៊ីថា"
        },
        {
            "barcode": "171123674",
            "dpc": "03010402101",
            "name": "សេង នឿត"
        },
        {
            "barcode": "171123675",
            "dpc": "03010402001",
            "name": "សូ កូរីតា"
        },
        {
            "barcode": "171123676",
            "dpc": "03010401901",
            "name": "តាយ ស៊ុយហុង"
        },
        {
            "barcode": "171123677",
            "dpc": "03010401801",
            "name": "អឿន ជឿប"
        },
        {
            "barcode": "171123678",
            "dpc": "03010401701",
            "name": "បាន វណ្ណា"
        },
        {
            "barcode": "171123679",
            "dpc": "03010401601",
            "name": "ទូច រ៉ា"
        },
        {
            "barcode": "171123680",
            "dpc": "03010401501",
            "name": "ហង ស៊ីយឿន"
        },
        {
            "barcode": "171123681",
            "dpc": "03010401401",
            "name": "យិន ម៉ានិត"
        },
        {
            "barcode": "171123682",
            "dpc": "03010401301",
            "name": "ពុយ ហួង"
        },
        {
            "barcode": "171123683",
            "dpc": "03010401201",
            "name": "ហុង សុផាត"
        },
        {
            "barcode": "171123684",
            "dpc": "03010414001",
            "name": "ពឹង ហ៊ុយលាង"
        },
        {
            "barcode": "171123685",
            "dpc": "03010413901",
            "name": "ចាន់ សុង"
        },
        {
            "barcode": "171123686",
            "dpc": "03010423301",
            "name": "លឹម ចិន្តា"
        },
        {
            "barcode": "171123687",
            "dpc": "03010413801",
            "name": "លឹម ជៀត"
        },
        {
            "barcode": "171123688",
            "dpc": "03010413701",
            "name": "ប៊ួន ចន្ធី"
        },
        {
            "barcode": "171123689",
            "dpc": "03010413601",
            "name": "ប៊ុន លាង"
        },
        {
            "barcode": "171123690",
            "dpc": "03010413401",
            "name": "ជៀវ សៀម"
        },
        {
            "barcode": "171123691",
            "dpc": "03010409201",
            "name": "តាន់ សុខ"
        },
        {
            "barcode": "171123692",
            "dpc": "03010413201",
            "name": "ហ្វាន់ ទី1"
        },
        {
            "barcode": "171123693",
            "dpc": "03010413001",
            "name": "ជា ភិចជីង"
        },
        {
            "barcode": "171123694",
            "dpc": "03010412901",
            "name": "ជា ដារិទ្ធ"
        },
        {
            "barcode": "171123695",
            "dpc": "03010412801",
            "name": "ហុក ហួរ"
        },
        {
            "barcode": "171123696",
            "dpc": "03010412701",
            "name": "លឹម ដា"
        },
        {
            "barcode": "171123697",
            "dpc": "03010412601",
            "name": "ឆេង ហាក់"
        },
        {
            "barcode": "171123698",
            "dpc": "03010412501",
            "name": "សេង សំអុល"
        },
        {
            "barcode": "171123699",
            "dpc": "03010412401",
            "name": "ឡៃ សេង"
        },
        {
            "barcode": "171123700",
            "dpc": "03010412301",
            "name": "តឹង ហ៊ុយលាង"
        },
        {
            "barcode": "171123701",
            "dpc": "03010412201",
            "name": "សុខ ហួត"
        },
        {
            "barcode": "171123702",
            "dpc": "03010412101",
            "name": "ផេង សុខហេង"
        },
        {
            "barcode": "171123703",
            "dpc": "03010412001",
            "name": "ធឿន ធួក"
        },
        {
            "barcode": "171123704",
            "dpc": "03010411901",
            "name": "ចាន់ វណ្ណា"
        },
        {
            "barcode": "171123705",
            "dpc": "03010411801",
            "name": "សុខ គាន"
        },
        {
            "barcode": "171123706",
            "dpc": "03010411701",
            "name": "គឹម មួយគា"
        },
        {
            "barcode": "171123707",
            "dpc": "03010411601",
            "name": "គឹម ងីម"
        },
        {
            "barcode": "171123708",
            "dpc": "03010411501",
            "name": "ធុល អន"
        },
        {
            "barcode": "171123709",
            "dpc": "03010411401",
            "name": "វ៉ុន សាវឿត"
        },
        {
            "barcode": "171123710",
            "dpc": "03010425501",
            "name": "លឹម ស៊ុន"
        },
        {
            "barcode": "171123711",
            "dpc": "03010411301",
            "name": "តឹត អេងម៉ៅ"
        },
        {
            "barcode": "171123712",
            "dpc": "03010411201",
            "name": "រស ឆែម"
        },
        {
            "barcode": "171123713",
            "dpc": "03010411101",
            "name": "ហ៊ាង អែម"
        },
        {
            "barcode": "171123714",
            "dpc": "03010410801",
            "name": "តាំង ហួយ"
        },
        {
            "barcode": "171123715",
            "dpc": "03010411001",
            "name": "ប៊ុន ហ៊ាង"
        },
        {
            "barcode": "171123716",
            "dpc": "03010410701",
            "name": "វណ្ណា"
        },
        {
            "barcode": "171123717",
            "dpc": "03010410901",
            "name": "ហៀប ប៉េងស្រ៊ុន"
        },
        {
            "barcode": "171123718",
            "dpc": "03010410601",
            "name": "ចាន់ សុខ"
        },
        {
            "barcode": "171123719",
            "dpc": "03010410501",
            "name": "ហ៊ូរ លឹមហាក់"
        },
        {
            "barcode": "171123720",
            "dpc": "03010410401",
            "name": "សេង វណ្ណៈ"
        },
        {
            "barcode": "171123721",
            "dpc": "03010410301",
            "name": "នូ ប៊ុន"
        },
        {
            "barcode": "171123722",
            "dpc": "03010410201",
            "name": "សេង សុខឡា"
        },
        {
            "barcode": "171123723",
            "dpc": "03010410101",
            "name": "យី ប៊ុនឃាង"
        },
        {
            "barcode": "171123724",
            "dpc": "03010410001",
            "name": "ខ្លូត សម្បត្តិ"
        },
        {
            "barcode": "171123725",
            "dpc": "03010409901",
            "name": "ស៊ុយ សុភាព"
        },
        {
            "barcode": "171123726",
            "dpc": "03010409701",
            "name": "ពៅ សូផុត"
        },
        {
            "barcode": "171123727",
            "dpc": "03010409601",
            "name": "នក់ ចាន់ហ្វាន់"
        },
        {
            "barcode": "171123728",
            "dpc": "03010409501",
            "name": "នក់ គង់"
        },
        {
            "barcode": "171123729",
            "dpc": "03010409401",
            "name": "អៀង ហ្គិច"
        },
        {
            "barcode": "171123730",
            "dpc": "03010409301",
            "name": "នៅ សុខហឿន"
        },
        {
            "barcode": "171123731",
            "dpc": "03010409101",
            "name": "លឹម ចិន្តា"
        },
        {
            "barcode": "171123732",
            "dpc": "03010408901",
            "name": "ជីម ស្រេង"
        },
        {
            "barcode": "171123733",
            "dpc": "03010408801",
            "name": "សៀវ គឹមឡេង"
        },
        {
            "barcode": "171123734",
            "dpc": "03010408701",
            "name": "ចិកិ ឪ"
        },
        {
            "barcode": "171123735",
            "dpc": "03010408501",
            "name": "អេង ធី"
        },
        {
            "barcode": "171123736",
            "dpc": "03010408301",
            "name": "ហៀង សៅយ៉ុន"
        },
        {
            "barcode": "171123737",
            "dpc": "03010408201",
            "name": "សោម គឹមរ៉ិច"
        },
        {
            "barcode": "171123738",
            "dpc": "03010440301",
            "name": "ទ្រី ជួរ ១"
        },
        {
            "barcode": "171123739",
            "dpc": "03010431301",
            "name": "ប៉ាង ស៊ីណាត"
        },
        {
            "barcode": "171123740",
            "dpc": "03010431401",
            "name": "រ័ត្ន សុវណ្ណ"
        },
        {
            "barcode": "171123741",
            "dpc": "03010431501",
            "name": "ប៉ូ ប៉េងយី"
        },
        {
            "barcode": "171123742",
            "dpc": "03010431601",
            "name": "ញឹម  ជេដ្ឋា"
        },
        {
            "barcode": "171123743",
            "dpc": "03010431701",
            "name": "ជុំ សុវណ្ណ"
        },
        {
            "barcode": "171123744",
            "dpc": "03010431801",
            "name": "សុខ សំអឿន"
        },
        {
            "barcode": "171123745",
            "dpc": "03010431901",
            "name": "ឌុល សោភ័ណ្ឌ"
        },
        {
            "barcode": "171123746",
            "dpc": "03010432001",
            "name": "ហៃ ចន"
        },
        {
            "barcode": "171123747",
            "dpc": "03010432101",
            "name": "អ៊ូ ស្រីវាធ"
        },
        {
            "barcode": "171123748",
            "dpc": "03010432201",
            "name": "លឹម អូន"
        },
        {
            "barcode": "171123749",
            "dpc": "03010432301",
            "name": "ឈួ ហៀង"
        },
        {
            "barcode": "171123750",
            "dpc": "03010432601",
            "name": "កែវ គន្ធា"
        },
        {
            "barcode": "171123751",
            "dpc": "03010432701",
            "name": "សារី ឃុន"
        },
        {
            "barcode": "171123752",
            "dpc": "03010432801",
            "name": "អ៊ូ ចិន្តា"
        },
        {
            "barcode": "171123753",
            "dpc": "03010432901",
            "name": "ចាន់ នាង"
        },
        {
            "barcode": "171123754",
            "dpc": "03010437001",
            "name": "ឃួន ឈឿត"
        },
        {
            "barcode": "171123755",
            "dpc": "03010433101",
            "name": "នៅ រ៉ា"
        },
        {
            "barcode": "171123756",
            "dpc": "03010436801",
            "name": "ប៊យ ហួយ"
        },
        {
            "barcode": "171123757",
            "dpc": "03010433201",
            "name": "គ្រីន ញ៉ុង"
        },
        {
            "barcode": "171123758",
            "dpc": "03010433301",
            "name": "ឃួន  ប៊ុនធី"
        },
        {
            "barcode": "171123759",
            "dpc": "03010433501",
            "name": "ទ្រី ហាក់"
        },
        {
            "barcode": "171123760",
            "dpc": "03010433601",
            "name": "តូច ឈួនសៅរិទ្ធ"
        },
        {
            "barcode": "171123761",
            "dpc": "03010433701",
            "name": "ឈួក វី"
        },
        {
            "barcode": "171123762",
            "dpc": "03010433801",
            "name": "ឡាច ឡោ"
        },
        {
            "barcode": "171123763",
            "dpc": "03010433901",
            "name": "មុំ មឿត"
        },
        {
            "barcode": "171123764",
            "dpc": "03010434001",
            "name": "ព្រំ សំណាង"
        },
        {
            "barcode": "171123765",
            "dpc": "03010435701",
            "name": "ប៊ុត គឹមស៊ាន"
        },
        {
            "barcode": "171123766",
            "dpc": "03010434101",
            "name": "ឆេង ហ៊ន"
        },
        {
            "barcode": "171123767",
            "dpc": "03010434401",
            "name": "ស្រស់ សារ៉ុម ២"
        },
        {
            "barcode": "171123768",
            "dpc": "03010434501",
            "name": "លី សេង"
        },
        {
            "barcode": "171123769",
            "dpc": "03010434601",
            "name": "ហែម សាវង្ស"
        },
        {
            "barcode": "171123770",
            "dpc": "03010434701",
            "name": "ឡាំ ស្រីងឹម"
        },
        {
            "barcode": "171123771",
            "dpc": "03010434801",
            "name": "មុំ សារ៉ន"
        },
        {
            "barcode": "171123772",
            "dpc": "03010434901",
            "name": "ទូច សម្បត្តិ"
        },
        {
            "barcode": "171123773",
            "dpc": "03010435101",
            "name": "វែន ជុន"
        },
        {
            "barcode": "171123774",
            "dpc": "03010435201",
            "name": "អ៊ឹម សឿន"
        },
        {
            "barcode": "171123775",
            "dpc": "03010435301",
            "name": "ម៉ម ញ៉ា"
        },
        {
            "barcode": "171123776",
            "dpc": "03010435401",
            "name": "ប៉ុញ សុវណ្ណរិទ្ធ ១"
        },
        {
            "barcode": "171123777",
            "dpc": "03010435501",
            "name": "ម៉ិញ ហៀប"
        },
        {
            "barcode": "171123778",
            "dpc": "03010435601",
            "name": "ស៊ិន ដា"
        },
        {
            "barcode": "171123779",
            "dpc": "03010435801",
            "name": "យ៉ាង ជួ"
        },
        {
            "barcode": "171123780",
            "dpc": "03010435901",
            "name": "ជីវ គឹមសាន្ត"
        },
        {
            "barcode": "171123781",
            "dpc": "03010436001",
            "name": "ព្រំ ភឿន"
        },
        {
            "barcode": "171123782",
            "dpc": "03010436101",
            "name": "តែ ឡៃហេង"
        },
        {
            "barcode": "171123783",
            "dpc": "03010436201",
            "name": "ជុត ស៊ាងណៃ"
        },
        {
            "barcode": "171123784",
            "dpc": "03010436301",
            "name": "លូត ហ៊ាង"
        },
        {
            "barcode": "171123785",
            "dpc": "03010436401",
            "name": "ចាង យឹងមុយ"
        },
        {
            "barcode": "171123786",
            "dpc": "03010436501",
            "name": "ឡាយ សារ៉ា"
        },
        {
            "barcode": "171123787",
            "dpc": "03010436601",
            "name": "សុខ ហេង១"
        },
        {
            "barcode": "171123788",
            "dpc": "03010436701",
            "name": "ឌិន សាត"
        },
        {
            "barcode": "171123789",
            "dpc": "03010436901",
            "name": "អ៊ិន សុធី"
        },
        {
            "barcode": "171123790",
            "dpc": "03010437101",
            "name": "លឹម ត្រូល"
        },
        {
            "barcode": "171123791",
            "dpc": "03010437201",
            "name": "ឡាំង ញឹក"
        },
        {
            "barcode": "171123792",
            "dpc": "03010437301",
            "name": "សុខ គិន"
        },
        {
            "barcode": "171123793",
            "dpc": "03010437401",
            "name": "ឈៀង រ៉ុង"
        },
        {
            "barcode": "171123794",
            "dpc": "03010437501",
            "name": "ឆៃ វិនឈឿន"
        },
        {
            "barcode": "171123795",
            "dpc": "03010437601",
            "name": "សេង ម៉ារូ"
        },
        {
            "barcode": "171123796",
            "dpc": "03010437701",
            "name": "វ៉ាន់ ថា"
        },
        {
            "barcode": "171123797",
            "dpc": "03010437801",
            "name": "វ៉ាន សុខាក់"
        },
        {
            "barcode": "171123798",
            "dpc": "03010437901",
            "name": "ធឿន ណារ៉េត"
        },
        {
            "barcode": "171123799",
            "dpc": "03010438001",
            "name": "សុខ ហ៊ាង"
        },
        {
            "barcode": "171123800",
            "dpc": "03010438101",
            "name": "ហ៊ុល សេង"
        },
        {
            "barcode": "171123801",
            "dpc": "03010438201",
            "name": "វ័រ ជី"
        },
        {
            "barcode": "171123802",
            "dpc": "03010438301",
            "name": "ទីវ  ហុកហួត"
        },
        {
            "barcode": "171123803",
            "dpc": "03010438401",
            "name": "អ៊ុំ វុទ្ធី"
        },
        {
            "barcode": "171123804",
            "dpc": "03010438501",
            "name": "ម៉ុង អេង"
        },
        {
            "barcode": "171123805",
            "dpc": "03010438601",
            "name": "វង្ស វ៉ា"
        },
        {
            "barcode": "171123806",
            "dpc": "03010438701",
            "name": "ត័ង"
        },
        {
            "barcode": "171123807",
            "dpc": "03010438801",
            "name": "បាន សុភ័ក្រ"
        },
        {
            "barcode": "171123808",
            "dpc": "03010438901",
            "name": "សេង គឹមហូរ"
        },
        {
            "barcode": "171123809",
            "dpc": "03010439001",
            "name": "ជា ផល្លីន"
        },
        {
            "barcode": "171123810",
            "dpc": "03010439101",
            "name": "ធី ឃាង"
        },
        {
            "barcode": "171123811",
            "dpc": "03010439201",
            "name": "កង ហៃ"
        },
        {
            "barcode": "171123812",
            "dpc": "03010439301",
            "name": "ឃុន អេង"
        },
        {
            "barcode": "171123813",
            "dpc": "03010439401",
            "name": "ម៉ឹង ជុយ ១"
        },
        {
            "barcode": "171123814",
            "dpc": "03010439501",
            "name": "ជីវ ខេងណេង"
        },
        {
            "barcode": "171123815",
            "dpc": "03010439601",
            "name": "អេង សុង"
        },
        {
            "barcode": "171123816",
            "dpc": "03010439701",
            "name": "សេង សុខលាង"
        },
        {
            "barcode": "171123817",
            "dpc": "03010439801",
            "name": "ម៉ឹង ជុយ ២"
        },
        {
            "barcode": "171123818",
            "dpc": "03010440201",
            "name": "គង់ សុធី"
        },
        {
            "barcode": "171123819",
            "dpc": "03010440401",
            "name": "ស៊ា សម្បត្តិ"
        },
        {
            "barcode": "171123820",
            "dpc": "03010440701",
            "name": "សេង សុខឡេង"
        },
        {
            "barcode": "171123821",
            "dpc": "03010440801",
            "name": "គឹម ដា"
        },
        {
            "barcode": "171123822",
            "dpc": "03010441001",
            "name": "យ៉ាំ ឡាន់"
        },
        {
            "barcode": "171123823",
            "dpc": "03010441301",
            "name": "ឯក សុវណ្ណ"
        },
        {
            "barcode": "171123824",
            "dpc": "03010441401",
            "name": "វ៉ង វ៉ា២"
        },
        {
            "barcode": "171123825",
            "dpc": "03010441501",
            "name": "ហ្វាត សិញ"
        },
        {
            "barcode": "171123826",
            "dpc": "03010441701",
            "name": "ចៅ ថន"
        },
        {
            "barcode": "171123827",
            "dpc": "03010441801",
            "name": "ឡាក់ បូរ៉េត"
        },
        {
            "barcode": "171123828",
            "dpc": "03010441901",
            "name": "ហុង វ៉ាន់ដេត"
        },
        {
            "barcode": "171123829",
            "dpc": "03010442101",
            "name": "សេង ស្រេង"
        },
        {
            "barcode": "171123830",
            "dpc": "03010442201",
            "name": "ហេង ណារិទ្ធ"
        },
        {
            "barcode": "171123831",
            "dpc": "03010442301",
            "name": "លឹម ហេង"
        },
        {
            "barcode": "171123832",
            "dpc": "03010442401",
            "name": "ហាំង គង់"
        },
        {
            "barcode": "171123833",
            "dpc": "03010442501",
            "name": "ពៅ"
        },
        {
            "barcode": "171123834",
            "dpc": "03010442701",
            "name": "ឈុំ ឈឿយ"
        },
        {
            "barcode": "171123835",
            "dpc": "03010442801",
            "name": "ប៉េង ប៊ុនលីម"
        },
        {
            "barcode": "171123836",
            "dpc": "03010443001",
            "name": "ហែម សុធា"
        },
        {
            "barcode": "171123837",
            "dpc": "03010443101",
            "name": "ស៊ូ ហាង"
        },
        {
            "barcode": "171123838",
            "dpc": "03010443201",
            "name": "យឹម សុផល"
        },
        {
            "barcode": "171123839",
            "dpc": "03010443301",
            "name": "យឹម រស់"
        },
        {
            "barcode": "171123840",
            "dpc": "03010443401",
            "name": "លី ហេង"
        },
        {
            "barcode": "171123841",
            "dpc": "03010443601",
            "name": "ហ៊ុន សុង"
        },
        {
            "barcode": "171123842",
            "dpc": "03010443701",
            "name": "ផ្លែក ប៊ុនស៊ន"
        },
        {
            "barcode": "171123843",
            "dpc": "03010443801",
            "name": "អេង សាមឿន"
        },
        {
            "barcode": "171123844",
            "dpc": "03010443901",
            "name": "ប៊ុន អូន"
        },
        {
            "barcode": "171123845",
            "dpc": "03010444001",
            "name": "ចៅ ឆាយ"
        },
        {
            "barcode": "171123846",
            "dpc": "03010444101",
            "name": "ឆេង បាន"
        },
        {
            "barcode": "171123847",
            "dpc": "03010444301",
            "name": "សុង ហេង ២"
        },
        {
            "barcode": "171123848",
            "dpc": "03010444401",
            "name": "ចៅ ហុង"
        },
        {
            "barcode": "171123849",
            "dpc": "03010444501",
            "name": "នុត ឆៃយ៉ា"
        },
        {
            "barcode": "171123850",
            "dpc": "03010444601",
            "name": "ចាន់ លី"
        },
        {
            "barcode": "171123851",
            "dpc": "03010444701",
            "name": "យិន រឿន"
        },
        {
            "barcode": "171123852",
            "dpc": "03010444801",
            "name": "ប៉ិច ដារ៉ា"
        },
        {
            "barcode": "171123853",
            "dpc": "03010444901",
            "name": "យ៉េក លី"
        },
        {
            "barcode": "171123854",
            "dpc": "03010445001",
            "name": "សំ ប៊ុនណាត"
        },
        {
            "barcode": "171123855",
            "dpc": "03010445101",
            "name": "ថង ស៊ីណា"
        },
        {
            "barcode": "171123856",
            "dpc": "03010445201",
            "name": "ប៊ូ សំផុន"
        },
        {
            "barcode": "171123857",
            "dpc": "03010445301",
            "name": "ប៊ុត សុធី"
        },
        {
            "barcode": "171123858",
            "dpc": "03010445401",
            "name": "ធឿន សេង"
        },
        {
            "barcode": "171123859",
            "dpc": "03010445601",
            "name": "ប៉ាល់ ជឿម"
        },
        {
            "barcode": "171123860",
            "dpc": "03010445701",
            "name": "ចៅ គឹមឈួន"
        },
        {
            "barcode": "171123861",
            "dpc": "03010445801",
            "name": "សុខ សាន្ត"
        },
        {
            "barcode": "171123862",
            "dpc": "03010445901",
            "name": "កែវ លីដា"
        },
        {
            "barcode": "171123863",
            "dpc": "03010446101",
            "name": "លី គឹមឡេង"
        },
        {
            "barcode": "171123864",
            "dpc": "03010446201",
            "name": "ជា ស្រ៊ុន"
        },
        {
            "barcode": "171123865",
            "dpc": "03010446301",
            "name": "អ៊ុំ ស្រួយ"
        },
        {
            "barcode": "171123866",
            "dpc": "03010446501",
            "name": "មិន ប៊ុនណារ៉ុង"
        },
        {
            "barcode": "171123867",
            "dpc": "03010446601",
            "name": "ឡាយ សំបូរ"
        },
        {
            "barcode": "171123868",
            "dpc": "03010446701",
            "name": "តែ គឹមស្រូយ"
        },
        {
            "barcode": "171123869",
            "dpc": "03010446901",
            "name": "លី សុផល"
        },
        {
            "barcode": "171123870",
            "dpc": "03010447001",
            "name": "សូ  វណ្ណា"
        },
        {
            "barcode": "171123871",
            "dpc": "03010447101",
            "name": "គ្រុយ ឈុនអ៊ឹង"
        },
        {
            "barcode": "171123872",
            "dpc": "03010447301",
            "name": "ឈួន ទូច"
        },
        {
            "barcode": "171123873",
            "dpc": "03010447401",
            "name": "លឹម ប៉ោស្រេង"
        },
        {
            "barcode": "171123874",
            "dpc": "03010447501",
            "name": "ង៉ាន លាភ"
        },
        {
            "barcode": "171123875",
            "dpc": "03010447601",
            "name": "វ៉ូង សឹង"
        },
        {
            "barcode": "171123876",
            "dpc": "03010447701",
            "name": "ងួន លឹមឃាន់"
        },
        {
            "barcode": "171123877",
            "dpc": "03010447901",
            "name": "តាន់ វឌ្ឍនី"
        },
        {
            "barcode": "171123878",
            "dpc": "03010423701",
            "name": "ឈិត  សារ៉យ"
        },
        {
            "barcode": "171123879",
            "dpc": "03010447801",
            "name": "ប្រស់   សឿប"
        },
        {
            "barcode": "171123880",
            "dpc": "03010448001",
            "name": "ម៉ាន វេង"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
