let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171125598",
            "dpc": "03010505001",
            "name": "ជីវ សុខា"
        },
        {
            "barcode": "171125599",
            "dpc": "03010504901",
            "name": "មាន ឡាយ"
        },
        {
            "barcode": "171125600",
            "dpc": "03010504801",
            "name": "សេង ហ៊ាង"
        },
        {
            "barcode": "171125601",
            "dpc": "03010504701",
            "name": "ម៉ូវ អាន"
        },
        {
            "barcode": "171125602",
            "dpc": "03010504601",
            "name": "សឹង ហ៊ង"
        },
        {
            "barcode": "171125603",
            "dpc": "03010504501",
            "name": "យ៉ែម ម៉េង"
        },
        {
            "barcode": "171125604",
            "dpc": "03010504301",
            "name": "សេង ប៊ូ ២"
        },
        {
            "barcode": "171125605",
            "dpc": "03010504201",
            "name": "ប៊ុន លី"
        },
        {
            "barcode": "171125606",
            "dpc": "03010504001",
            "name": "សេង ប៊ូ ១"
        },
        {
            "barcode": "171125607",
            "dpc": "03010503901",
            "name": "តាំង ទ្រី"
        },
        {
            "barcode": "171125608",
            "dpc": "03010503801",
            "name": "ប៊ុន ថា"
        },
        {
            "barcode": "171125609",
            "dpc": "03010503701",
            "name": "ជា ប៊ូ"
        },
        {
            "barcode": "171125610",
            "dpc": "03010503601",
            "name": "ញៀវ វ៉ាន់ណារ៉ា"
        },
        {
            "barcode": "171125611",
            "dpc": "03010503501",
            "name": "កៅ យ៉ៅ"
        },
        {
            "barcode": "171125612",
            "dpc": "03010503401",
            "name": "ជា បានហេង"
        },
        {
            "barcode": "171125613",
            "dpc": "03010503301",
            "name": "ផុន នាង ១"
        },
        {
            "barcode": "171125614",
            "dpc": "03010503201",
            "name": "សុខ ចំណាប់"
        },
        {
            "barcode": "171125615",
            "dpc": "03010503101",
            "name": "លី ហួន"
        },
        {
            "barcode": "171125616",
            "dpc": "03010503001",
            "name": "នាង ធី"
        },
        {
            "barcode": "171125617",
            "dpc": "03010502901",
            "name": "ហេង អ៊ូរ"
        },
        {
            "barcode": "171125618",
            "dpc": "03010502801",
            "name": "ហេង ចាន់ធា"
        },
        {
            "barcode": "171125619",
            "dpc": "03010502601",
            "name": "ខឹម សាម៉ុន"
        },
        {
            "barcode": "171125620",
            "dpc": "03010502501",
            "name": "ឡេង សុផល"
        },
        {
            "barcode": "171125621",
            "dpc": "03010502301",
            "name": "ឡាយ សាន"
        },
        {
            "barcode": "171125622",
            "dpc": "03010502201",
            "name": "ចៃ គង់"
        },
        {
            "barcode": "171125623",
            "dpc": "03010502101",
            "name": "ឃុន ព្រីង"
        },
        {
            "barcode": "171125624",
            "dpc": "03010502001",
            "name": "យី ប៊ុនខន ២"
        },
        {
            "barcode": "171125625",
            "dpc": "03010501901",
            "name": "ថៃ រ៉ន"
        },
        {
            "barcode": "171125626",
            "dpc": "03010501801",
            "name": "គី ខេង"
        },
        {
            "barcode": "171125627",
            "dpc": "03010501701",
            "name": "ឈួន ឆាយ"
        },
        {
            "barcode": "171125628",
            "dpc": "03010501501",
            "name": "លី ម៉ៅ"
        },
        {
            "barcode": "171125629",
            "dpc": "03010501401",
            "name": "ឡុង សុខន"
        },
        {
            "barcode": "171125630",
            "dpc": "03010501301",
            "name": "គង់ គី"
        },
        {
            "barcode": "171125631",
            "dpc": "03010501201",
            "name": "អ៊ឹង ហ៊ីម"
        },
        {
            "barcode": "171125632",
            "dpc": "03010501101",
            "name": "អ៊ឹង សុភា"
        },
        {
            "barcode": "171125633",
            "dpc": "03010501001",
            "name": "ឡេង សំអាត"
        },
        {
            "barcode": "171125634",
            "dpc": "03010500901",
            "name": "ចុង ស៊ីម"
        },
        {
            "barcode": "171125635",
            "dpc": "03010500801",
            "name": "ធូ ពៅ ២"
        },
        {
            "barcode": "171125636",
            "dpc": "03010500701",
            "name": "ធូ ពៅ ១"
        },
        {
            "barcode": "171125637",
            "dpc": "03010500601",
            "name": "សេង ហៃ"
        },
        {
            "barcode": "171125638",
            "dpc": "03010500501",
            "name": "យិន ញ៉ាង"
        },
        {
            "barcode": "171125639",
            "dpc": "03010500401",
            "name": "យ៉ង ស៊ុន"
        },
        {
            "barcode": "171125640",
            "dpc": "03010500301",
            "name": "ផាត សុផាត ២"
        },
        {
            "barcode": "171125641",
            "dpc": "03010500101",
            "name": "ឆេង ឡុង"
        },
        {
            "barcode": "171125642",
            "dpc": "03010508301",
            "name": "រ៉ម វីរៈ"
        },
        {
            "barcode": "171125643",
            "dpc": "03010508401",
            "name": "រ៉ម ញឹម"
        },
        {
            "barcode": "171125644",
            "dpc": "03010508501",
            "name": "ខ ស៊ីវ"
        },
        {
            "barcode": "171125645",
            "dpc": "03010508601",
            "name": "លឹម ឡេង"
        },
        {
            "barcode": "171125646",
            "dpc": "03010508701",
            "name": "ខ សុខុម"
        },
        {
            "barcode": "171125647",
            "dpc": "03010508801",
            "name": "ហុក សុវិចិត្រ"
        },
        {
            "barcode": "171125648",
            "dpc": "03010526801",
            "name": "តា ថាំ"
        },
        {
            "barcode": "171125649",
            "dpc": "03010526901",
            "name": "កញ្ញា សំបូរ"
        },
        {
            "barcode": "171125650",
            "dpc": "03010527501",
            "name": "ឆុង សុភាព"
        },
        {
            "barcode": "171125651",
            "dpc": "03010527001",
            "name": "ឈុំ ឌី"
        },
        {
            "barcode": "171125652",
            "dpc": "03010528801",
            "name": "ចែ ម៉ៅ ៣"
        },
        {
            "barcode": "171125653",
            "dpc": "03010527301",
            "name": "ឈួន ឆុន"
        },
        {
            "barcode": "171125654",
            "dpc": "03010527901",
            "name": "គង់ វត្ថា"
        },
        {
            "barcode": "171125655",
            "dpc": "03010528001",
            "name": "ចៅ ហុង"
        },
        {
            "barcode": "171125656",
            "dpc": "03010528101",
            "name": "លឹម តុង"
        },
        {
            "barcode": "171125657",
            "dpc": "03010528201",
            "name": "ប៉ោ អូ"
        },
        {
            "barcode": "171125658",
            "dpc": "03010528301",
            "name": "កែវ សាវ៉ែ"
        },
        {
            "barcode": "171125659",
            "dpc": "03010528401",
            "name": "សេង លាង"
        },
        {
            "barcode": "171125660",
            "dpc": "03010528501",
            "name": "គឹម ស៊ា"
        },
        {
            "barcode": "171125661",
            "dpc": "03010528601",
            "name": "ណាម វិចិត្រ"
        },
        {
            "barcode": "171125662",
            "dpc": "03010528701",
            "name": "សេង លាំង"
        },
        {
            "barcode": "171125663",
            "dpc": "03010528901",
            "name": "កែវ រតនា"
        },
        {
            "barcode": "171125664",
            "dpc": "03010529001",
            "name": "គួច លាប"
        },
        {
            "barcode": "171125665",
            "dpc": "03010529101",
            "name": "មុំ លាងស្រូយ"
        },
        {
            "barcode": "171125666",
            "dpc": "03010529201",
            "name": "អ៊ុល វេ"
        },
        {
            "barcode": "171125667",
            "dpc": "03010529301",
            "name": "ងូវ  វេងហុក"
        },
        {
            "barcode": "171125668",
            "dpc": "03010527801",
            "name": "ភាព"
        },
        {
            "barcode": "171125669",
            "dpc": "03010523201",
            "name": "គង់ វត្ត"
        },
        {
            "barcode": "171125670",
            "dpc": "03010523301",
            "name": "គឹម ម៉េង"
        },
        {
            "barcode": "171125671",
            "dpc": "03010523401",
            "name": "លឹម សុភាព"
        },
        {
            "barcode": "171125672",
            "dpc": "03010523501",
            "name": "ពុធ ទ្រី"
        },
        {
            "barcode": "171125673",
            "dpc": "03010523601",
            "name": "លឹម ឆាយ ១"
        },
        {
            "barcode": "171125674",
            "dpc": "03010523701",
            "name": "ងួន ហៃ"
        },
        {
            "barcode": "171125675",
            "dpc": "03010523801",
            "name": "ឈុន ឈួន"
        },
        {
            "barcode": "171125676",
            "dpc": "03010523901",
            "name": "លឹម ឆាយ ២"
        },
        {
            "barcode": "171125677",
            "dpc": "03010524001",
            "name": "គឹម សានគាន"
        },
        {
            "barcode": "171125678",
            "dpc": "03010524101",
            "name": "ឈុំ ឆើត"
        },
        {
            "barcode": "171125679",
            "dpc": "03010524201",
            "name": "បេ គឹមវែង"
        },
        {
            "barcode": "171125680",
            "dpc": "03010524301",
            "name": "អ៊ឹង ងួន"
        },
        {
            "barcode": "171125681",
            "dpc": "03010524401",
            "name": "អ៊ឹង សៀកឡេង"
        },
        {
            "barcode": "171125682",
            "dpc": "03010524601",
            "name": "មុត វ៉ាន់នី"
        },
        {
            "barcode": "171125683",
            "dpc": "03010524701",
            "name": "គឹម សាន"
        },
        {
            "barcode": "171125684",
            "dpc": "03010524801",
            "name": "ជន ជុន"
        },
        {
            "barcode": "171125685",
            "dpc": "03010524901",
            "name": "គ្រុយ ឈុន"
        },
        {
            "barcode": "171125686",
            "dpc": "03010525001",
            "name": "សុខ សាន្ត"
        },
        {
            "barcode": "171125687",
            "dpc": "03010525101",
            "name": "គង់ មុំ"
        },
        {
            "barcode": "171125688",
            "dpc": "03010525201",
            "name": "មៀវ ទាវ"
        },
        {
            "barcode": "171125689",
            "dpc": "03010525301",
            "name": "ហេង សុខម៉េង"
        },
        {
            "barcode": "171125690",
            "dpc": "03010525401",
            "name": "សេង គីម"
        },
        {
            "barcode": "171125691",
            "dpc": "03010525501",
            "name": "សម្បត្តិ ផល្លី"
        },
        {
            "barcode": "171125692",
            "dpc": "03010525601",
            "name": "ហោ ឃីម៉ាវ"
        },
        {
            "barcode": "171125693",
            "dpc": "03010525701",
            "name": "ហោ ទ្រី"
        },
        {
            "barcode": "171125694",
            "dpc": "03010525801",
            "name": "លឹម មួយហ៊ាង"
        },
        {
            "barcode": "171125695",
            "dpc": "03010525901",
            "name": "ហេង គឹមទី"
        },
        {
            "barcode": "171125696",
            "dpc": "03010526001",
            "name": "លី សាលី"
        },
        {
            "barcode": "171125697",
            "dpc": "03010526101",
            "name": "ស៊្រុន ហុក"
        },
        {
            "barcode": "171125698",
            "dpc": "03010526201",
            "name": "ចាន់ ប៊ុនឡេង"
        },
        {
            "barcode": "171125699",
            "dpc": "03010526301",
            "name": "សម្បត្តិ សោភា"
        },
        {
            "barcode": "171125700",
            "dpc": "03010526401",
            "name": "ដួង មាច"
        },
        {
            "barcode": "171125701",
            "dpc": "03010526501",
            "name": "យឿន តូច ២"
        },
        {
            "barcode": "171125702",
            "dpc": "03010526601",
            "name": "ផៃ ប៊ុនធឿន"
        },
        {
            "barcode": "171125703",
            "dpc": "03010526701",
            "name": "ជឹង វែងអ៊ាវ"
        },
        {
            "barcode": "171125704",
            "dpc": "03010519401",
            "name": "សន ប៊ុនណា"
        },
        {
            "barcode": "171125705",
            "dpc": "03010522001",
            "name": "ឈួន អួក"
        },
        {
            "barcode": "171125706",
            "dpc": "03010522601",
            "name": "សេង ប៊ូ ៤"
        },
        {
            "barcode": "171125707",
            "dpc": "03010522701",
            "name": "ប៊ុន ពៅ"
        },
        {
            "barcode": "171125708",
            "dpc": "03010522801",
            "name": "លី អៀក"
        },
        {
            "barcode": "171125709",
            "dpc": "03010522901",
            "name": "លី ប៊ុនធឿន"
        },
        {
            "barcode": "171125710",
            "dpc": "03010523101",
            "name": "ហេង គុណ"
        },
        {
            "barcode": "171125711",
            "dpc": "03010522501",
            "name": "ភឿក ប៉ូ"
        },
        {
            "barcode": "171125712",
            "dpc": "03010522401",
            "name": "ខៃ សំបូ"
        },
        {
            "barcode": "171125713",
            "dpc": "03010522301",
            "name": "លី វ័ន្ត"
        },
        {
            "barcode": "171125714",
            "dpc": "03010522201",
            "name": "ប៊ុត ហួត"
        },
        {
            "barcode": "171125715",
            "dpc": "03010522101",
            "name": "សៀម ភក្តី ១"
        },
        {
            "barcode": "171125716",
            "dpc": "03010521801",
            "name": "សុខ ណាត"
        },
        {
            "barcode": "171125717",
            "dpc": "03010521701",
            "name": "ហួត អឿង"
        },
        {
            "barcode": "171125718",
            "dpc": "03010521601",
            "name": "ធូរ៉េ វត្តី ១"
        },
        {
            "barcode": "171125719",
            "dpc": "03010521501",
            "name": "ខា វណ្ណ"
        },
        {
            "barcode": "171125720",
            "dpc": "03010521401",
            "name": "គួយ ឆេងលី"
        },
        {
            "barcode": "171125721",
            "dpc": "03010521301",
            "name": "សម្បត្តិ ញ៉ ២"
        },
        {
            "barcode": "171125722",
            "dpc": "03010521101",
            "name": "លឹម វេង"
        },
        {
            "barcode": "171125723",
            "dpc": "03010520801",
            "name": "លីវ ហៀក"
        },
        {
            "barcode": "171125724",
            "dpc": "03010520601",
            "name": "យស វិន"
        },
        {
            "barcode": "171125725",
            "dpc": "03010520501",
            "name": "អែមបាន"
        },
        {
            "barcode": "171125726",
            "dpc": "03010520401",
            "name": "លឹម ហ្តូរ"
        },
        {
            "barcode": "171125727",
            "dpc": "03010520301",
            "name": "ជា ហ៊ុយ"
        },
        {
            "barcode": "171125728",
            "dpc": "03010520201",
            "name": "ឡៅ ម៉េង"
        },
        {
            "barcode": "171125729",
            "dpc": "03010520101",
            "name": "គិត ញ៉ុល"
        },
        {
            "barcode": "171125730",
            "dpc": "03010520001",
            "name": "សុខ ថេង"
        },
        {
            "barcode": "171125731",
            "dpc": "03010519901",
            "name": "ឯម សេក"
        },
        {
            "barcode": "171125732",
            "dpc": "03010519801",
            "name": "សៀក សន"
        },
        {
            "barcode": "171125733",
            "dpc": "03010519701",
            "name": "អ៊ឹម ឡេង"
        },
        {
            "barcode": "171125734",
            "dpc": "03010519601",
            "name": "ឡេង ណាង"
        },
        {
            "barcode": "171125735",
            "dpc": "03010519501",
            "name": "ង៉ូវ មួយអ៊ី"
        },
        {
            "barcode": "171125736",
            "dpc": "03010519301",
            "name": "មិន លីហួរ ២"
        },
        {
            "barcode": "171125737",
            "dpc": "03010519201",
            "name": "ជា សុរដ្ឋ"
        },
        {
            "barcode": "171125738",
            "dpc": "03010519101",
            "name": "ម៉ាក វ៉ាន្នី"
        },
        {
            "barcode": "171125739",
            "dpc": "03010519001",
            "name": "ផួន សារ៉ូ"
        },
        {
            "barcode": "171125740",
            "dpc": "03010518901",
            "name": "ឈុន ឆាង"
        },
        {
            "barcode": "171125741",
            "dpc": "03010518801",
            "name": "ជីវ គឹមស៊ាន"
        },
        {
            "barcode": "171125742",
            "dpc": "03010518501",
            "name": "ដែក សេង"
        },
        {
            "barcode": "171125743",
            "dpc": "03010518401",
            "name": "លឹម ឆេង"
        },
        {
            "barcode": "171125744",
            "dpc": "03010518301",
            "name": "ឃុត លីសុង"
        },
        {
            "barcode": "171125745",
            "dpc": "03010516201",
            "name": "តាន់ ឡេងថៃ"
        },
        {
            "barcode": "171125746",
            "dpc": "03010518201",
            "name": "សឿន សុផល"
        },
        {
            "barcode": "171125747",
            "dpc": "03010518101",
            "name": "ហា ធៀង"
        },
        {
            "barcode": "171125748",
            "dpc": "03010518001",
            "name": "យូ សន"
        },
        {
            "barcode": "171125749",
            "dpc": "03010517901",
            "name": "តាន់ វណ្ឌី"
        },
        {
            "barcode": "171125750",
            "dpc": "03010517701",
            "name": "ជា សារិទ្ធ"
        },
        {
            "barcode": "171125751",
            "dpc": "03010517801",
            "name": "ស៊្រុន   ហុក"
        },
        {
            "barcode": "171125752",
            "dpc": "03010517601",
            "name": "ប៉ា ឡុងហៃ ១"
        },
        {
            "barcode": "171125753",
            "dpc": "03010517401",
            "name": "អ៊ឹម សារិន"
        },
        {
            "barcode": "171125754",
            "dpc": "03010517301",
            "name": "ផន គឹមយី"
        },
        {
            "barcode": "171125755",
            "dpc": "03010517201",
            "name": "គឹម សាន"
        },
        {
            "barcode": "171125756",
            "dpc": "03010517101",
            "name": "ឃុន នាង"
        },
        {
            "barcode": "171125757",
            "dpc": "03010517001",
            "name": "ទួត ផាន់"
        },
        {
            "barcode": "171125758",
            "dpc": "03010516801",
            "name": "ឆាំង សំ"
        },
        {
            "barcode": "171125759",
            "dpc": "03010516701",
            "name": "ឈៀរ ងី"
        },
        {
            "barcode": "171125760",
            "dpc": "03010516601",
            "name": "កាំង ឡាយ"
        },
        {
            "barcode": "171125761",
            "dpc": "03010516501",
            "name": "គ្រុយ ឈុនអ៊ឹង ២"
        },
        {
            "barcode": "171125762",
            "dpc": "03010516401",
            "name": "ថា ផល្លី"
        },
        {
            "barcode": "171125763",
            "dpc": "03010516101",
            "name": "ឆាង សារឿន"
        },
        {
            "barcode": "171125764",
            "dpc": "03010515801",
            "name": "តាំង គឹមឆេង ២"
        },
        {
            "barcode": "171125765",
            "dpc": "03010508901",
            "name": "ផួង គឿង"
        },
        {
            "barcode": "171125766",
            "dpc": "03010509001",
            "name": "ស៊ិន ប៊ុនសឿន"
        },
        {
            "barcode": "171125767",
            "dpc": "03010509101",
            "name": "លឹម ម៉េង"
        },
        {
            "barcode": "171125768",
            "dpc": "03010509201",
            "name": "យាំង ប៊ុននី"
        },
        {
            "barcode": "171125769",
            "dpc": "03010509301",
            "name": "សួន នាង"
        },
        {
            "barcode": "171125770",
            "dpc": "03010509401",
            "name": "សុខ គៀង"
        },
        {
            "barcode": "171125771",
            "dpc": "03010509501",
            "name": "អ៊ួម រ៉ម"
        },
        {
            "barcode": "171125772",
            "dpc": "03010509601",
            "name": "សឹម សុង"
        },
        {
            "barcode": "171125773",
            "dpc": "03010509801",
            "name": "រឿង សារ៉ាត់"
        },
        {
            "barcode": "171125774",
            "dpc": "03010509901",
            "name": "លឹម សុផល"
        },
        {
            "barcode": "171125775",
            "dpc": "03010510001",
            "name": "អ៊ុំ រិទ្ធី"
        },
        {
            "barcode": "171125776",
            "dpc": "03010510101",
            "name": "ជឺ ណៃហ៊ាង"
        },
        {
            "barcode": "171125777",
            "dpc": "03010510201",
            "name": "លឹម ប៉ិច"
        },
        {
            "barcode": "171125778",
            "dpc": "03010510301",
            "name": "សុខ បីស៊ូ"
        },
        {
            "barcode": "171125779",
            "dpc": "03010510401",
            "name": "ហាក់ ណារិន"
        },
        {
            "barcode": "171125780",
            "dpc": "03010510501",
            "name": "គឹ ចាន់ធី"
        },
        {
            "barcode": "171125781",
            "dpc": "03010510601",
            "name": "លឹម ខេង"
        },
        {
            "barcode": "171125782",
            "dpc": "03010510701",
            "name": "សោម សារឿន"
        },
        {
            "barcode": "171125783",
            "dpc": "03010510901",
            "name": "សែស សារឹម"
        },
        {
            "barcode": "171125784",
            "dpc": "03010511001",
            "name": "រស់ ដារ៉ា"
        },
        {
            "barcode": "171125785",
            "dpc": "03010511101",
            "name": "ហែម ដារ៉ា"
        },
        {
            "barcode": "171125786",
            "dpc": "03010511201",
            "name": "ណុល នឿន"
        },
        {
            "barcode": "171125787",
            "dpc": "03010511301",
            "name": "តាំង ថៃ"
        },
        {
            "barcode": "171125788",
            "dpc": "03010511401",
            "name": "ព្រំ គឿន"
        },
        {
            "barcode": "171125789",
            "dpc": "03010511501",
            "name": "អូន ណារ៉ុង"
        },
        {
            "barcode": "171125790",
            "dpc": "03010511701",
            "name": "លឹម ឆាយ"
        },
        {
            "barcode": "171125791",
            "dpc": "03010512001",
            "name": "មាស សុភាព"
        },
        {
            "barcode": "171125792",
            "dpc": "03010512101",
            "name": "ពៅ សំបូរ"
        },
        {
            "barcode": "171125793",
            "dpc": "03010512301",
            "name": "លេង លាប"
        },
        {
            "barcode": "171125794",
            "dpc": "03010512401",
            "name": "អឿន ឆេង"
        },
        {
            "barcode": "171125795",
            "dpc": "03010512501",
            "name": "ផូ សុខហេង"
        },
        {
            "barcode": "171125796",
            "dpc": "03010512601",
            "name": "ទន់ សុភាព"
        },
        {
            "barcode": "171125797",
            "dpc": "03010512801",
            "name": "តាន់ ទេវី"
        },
        {
            "barcode": "171125798",
            "dpc": "03010512901",
            "name": "ឆែម សេង"
        },
        {
            "barcode": "171125799",
            "dpc": "03010513001",
            "name": "កាន់ រិទ្ធី"
        },
        {
            "barcode": "171125800",
            "dpc": "03010513101",
            "name": "សួស ហួត"
        },
        {
            "barcode": "171125801",
            "dpc": "03010515001",
            "name": "ចាន់ សាវ័ន្ត"
        },
        {
            "barcode": "171125802",
            "dpc": "03010515101",
            "name": "តាំង គឹមឆេង ១"
        },
        {
            "barcode": "171125803",
            "dpc": "03010515201",
            "name": "រៀម សារ៉េត"
        },
        {
            "barcode": "171125804",
            "dpc": "03010515301",
            "name": "គ្រូ ជា"
        },
        {
            "barcode": "171125805",
            "dpc": "03010515401",
            "name": "គី វិរិន្ទ"
        },
        {
            "barcode": "171125806",
            "dpc": "03010515501",
            "name": "ព្រំ វ៉ែយ៉ា ១"
        },
        {
            "barcode": "171125807",
            "dpc": "03010515601",
            "name": "ធា ឈីវកាង"
        },
        {
            "barcode": "171125808",
            "dpc": "03010515701",
            "name": "ព្រំ វ៉ែយ៉ា ២"
        },
        {
            "barcode": "171125809",
            "dpc": "03010505101",
            "name": "អៀង សុខា"
        },
        {
            "barcode": "171125810",
            "dpc": "03010505201",
            "name": "ទូច ប៉ុយ"
        },
        {
            "barcode": "171125811",
            "dpc": "03010505301",
            "name": "ម៉ិញ ម៉ារ៉ា"
        },
        {
            "barcode": "171125812",
            "dpc": "03010505401",
            "name": "ប៊ូ   ដាណា"
        },
        {
            "barcode": "171125813",
            "dpc": "03010505601",
            "name": "លី គ្រុយ"
        },
        {
            "barcode": "171125814",
            "dpc": "03010505701",
            "name": "ទឹម រី"
        },
        {
            "barcode": "171125815",
            "dpc": "03010505801",
            "name": "ឈួន អួក"
        },
        {
            "barcode": "171125816",
            "dpc": "03010505901",
            "name": "ស៊ុំ ប៉ន"
        },
        {
            "barcode": "171125817",
            "dpc": "03010506001",
            "name": "នួន ភឿន"
        },
        {
            "barcode": "171125818",
            "dpc": "03010506301",
            "name": "វេង តាំងលី"
        },
        {
            "barcode": "171125819",
            "dpc": "03010506401",
            "name": "សេង ប៊ូ ៣"
        },
        {
            "barcode": "171125820",
            "dpc": "03010506501",
            "name": "នូ សាវង្ស"
        },
        {
            "barcode": "171125821",
            "dpc": "03010506601",
            "name": "ជា ប៊ូ"
        },
        {
            "barcode": "171125822",
            "dpc": "03010506701",
            "name": "មាស វ៉ាន់ធី"
        },
        {
            "barcode": "171125823",
            "dpc": "03010506801",
            "name": "ជា ធារី"
        },
        {
            "barcode": "171125824",
            "dpc": "03010506901",
            "name": "ផុន នាង ១"
        },
        {
            "barcode": "171125825",
            "dpc": "03010507001",
            "name": "ផុន សុផល"
        },
        {
            "barcode": "171125826",
            "dpc": "03010507101",
            "name": "ប៊ុន វណ្ណារ៉ា"
        },
        {
            "barcode": "171125827",
            "dpc": "03010507201",
            "name": "ប្លុង សាន"
        },
        {
            "barcode": "171125828",
            "dpc": "03010507301",
            "name": "ឆែត សៀង"
        },
        {
            "barcode": "171125829",
            "dpc": "03010507401",
            "name": "អ៊ី ភិរុណ"
        },
        {
            "barcode": "171125830",
            "dpc": "03010507501",
            "name": "សុខ ភារ៉ា"
        },
        {
            "barcode": "171125831",
            "dpc": "03010507701",
            "name": "ម៉ន ណាវី"
        },
        {
            "barcode": "171125832",
            "dpc": "03010507901",
            "name": "ស៊ិន សម្បត្តិ"
        },
        {
            "barcode": "171125833",
            "dpc": "03010508001",
            "name": "ពេជ្រ កុសល"
        },
        {
            "barcode": "171125834",
            "dpc": "03010508101",
            "name": "អឿង សំ"
        },
        {
            "barcode": "171125835",
            "dpc": "03010508201",
            "name": "មាស ទឿម"
        },
        {
            "barcode": "171125836",
            "dpc": "03010513201",
            "name": "សេក គារ"
        },
        {
            "barcode": "171125837",
            "dpc": "03010513301",
            "name": "ស្រស់ សារុន"
        },
        {
            "barcode": "171125838",
            "dpc": "03010511901",
            "name": "នឿន វុទ្ធី"
        },
        {
            "barcode": "171125839",
            "dpc": "03010513401",
            "name": "ជា សុខឃីម"
        },
        {
            "barcode": "171125840",
            "dpc": "03010513501",
            "name": "ផុន ទូច"
        },
        {
            "barcode": "171125841",
            "dpc": "03010513601",
            "name": "គង់ ផុន"
        },
        {
            "barcode": "171125842",
            "dpc": "03010513701",
            "name": "ជឺ គ្រី"
        },
        {
            "barcode": "171125843",
            "dpc": "03010513801",
            "name": "ឡាច សុធី"
        },
        {
            "barcode": "171125844",
            "dpc": "03010513901",
            "name": "ចេង គី"
        },
        {
            "barcode": "171125845",
            "dpc": "03010514001",
            "name": "ប៊ុន ភាច"
        },
        {
            "barcode": "171125846",
            "dpc": "03010514101",
            "name": "ឯម ស៊ីថា"
        },
        {
            "barcode": "171125847",
            "dpc": "03010514201",
            "name": "ស្រេង ប៊ុនថា"
        },
        {
            "barcode": "171125848",
            "dpc": "03010514301",
            "name": "ភឹម ប៊ុនលឿត"
        },
        {
            "barcode": "171125849",
            "dpc": "03010514401",
            "name": "យឹម ង៉ែត"
        },
        {
            "barcode": "171125850",
            "dpc": "03010514501",
            "name": "ស៊ាង ឈឿត"
        },
        {
            "barcode": "171125851",
            "dpc": "03010514601",
            "name": "មាន វីរៈ"
        },
        {
            "barcode": "171125852",
            "dpc": "03010514801",
            "name": "ស័ក្ក លី"
        },
        {
            "barcode": "171125853",
            "dpc": "03010514901",
            "name": "ជិន សានិត"
        },
        {
            "barcode": "171125854",
            "dpc": "03010531001",
            "name": "តាន់ បូណា"
        },
        {
            "barcode": "171125855",
            "dpc": "03010531101",
            "name": "សៀក គឹមសាន"
        },
        {
            "barcode": "171125856",
            "dpc": "03010530901",
            "name": "ឆាង សន"
        },
        {
            "barcode": "171125857",
            "dpc": "03010530801",
            "name": "អេង ស៊ីផា"
        },
        {
            "barcode": "171125858",
            "dpc": "03010530701",
            "name": "ទន់ ទៀង"
        },
        {
            "barcode": "171125859",
            "dpc": "03010530601",
            "name": "ទន់ ឈួត"
        },
        {
            "barcode": "171125860",
            "dpc": "03010530501",
            "name": "ប៉ែន សោភ័ណ្ឌ"
        },
        {
            "barcode": "171125861",
            "dpc": "03010530401",
            "name": "ឆោង វីវីយ៉ា"
        },
        {
            "barcode": "171125862",
            "dpc": "03010530301",
            "name": "ណាល់ ស៊ីនួន"
        },
        {
            "barcode": "171125863",
            "dpc": "03010530201",
            "name": "វ៉ាយ គឹមហៀក"
        },
        {
            "barcode": "171125864",
            "dpc": "03010530101",
            "name": "វ៉ាយ គឹមហឿង"
        },
        {
            "barcode": "171125865",
            "dpc": "03010530001",
            "name": "ពិន ប៊ុនថន"
        },
        {
            "barcode": "171125866",
            "dpc": "03010529901",
            "name": "ទ្រី សាវុធ"
        },
        {
            "barcode": "171125867",
            "dpc": "03010529801",
            "name": "ផាត់ គង់"
        },
        {
            "barcode": "171125868",
            "dpc": "03010529701",
            "name": "ប៉ាត ពយ"
        },
        {
            "barcode": "171125869",
            "dpc": "03010529601",
            "name": "ប្រាក់ សម្បត្តិ"
        },
        {
            "barcode": "171125870",
            "dpc": "03010529501",
            "name": "ខ្លូត សម្បត្តិ"
        },
        {
            "barcode": "171125871",
            "dpc": "03010529401",
            "name": "ប៉ុញ ឧត្តម"
        },
        {
            "barcode": "171125872",
            "dpc": "03010518601",
            "name": "យីវ  គឹមស៊ាន"
        },
        {
            "barcode": "171125873",
            "dpc": "03010539201",
            "name": "តាំង ទៀង"
        },
        {
            "barcode": "171125874",
            "dpc": "03010547501",
            "name": "ភា ស៊ុយ"
        },
        {
            "barcode": "171125875",
            "dpc": "03010547601",
            "name": "កោ គឹមសួង"
        },
        {
            "barcode": "171125876",
            "dpc": "03010547701",
            "name": "ហេង ងី"
        },
        {
            "barcode": "171125877",
            "dpc": "03010547901",
            "name": "រឿង សារ៉ុង"
        },
        {
            "barcode": "171125878",
            "dpc": "03010547401",
            "name": "ភួយ លាងអេង"
        },
        {
            "barcode": "171125879",
            "dpc": "03010547301",
            "name": "ណុប ពោល"
        },
        {
            "barcode": "171125880",
            "dpc": "03010546401",
            "name": "ឈឹម រី"
        },
        {
            "barcode": "171125881",
            "dpc": "03010547201",
            "name": "សេង ហួត"
        },
        {
            "barcode": "171125882",
            "dpc": "03010547101",
            "name": "ឡុង ម៉ៅ"
        },
        {
            "barcode": "171125883",
            "dpc": "03010547001",
            "name": "យិន ហឺ"
        },
        {
            "barcode": "171125884",
            "dpc": "03010546901",
            "name": "វៃ សាវន"
        },
        {
            "barcode": "171125885",
            "dpc": "03010546701",
            "name": "ហ៊ិន ហ៊ុន"
        },
        {
            "barcode": "171125886",
            "dpc": "03010546601",
            "name": "វ៉ាន វាន"
        },
        {
            "barcode": "171125887",
            "dpc": "03010546501",
            "name": "គឹម យូ"
        },
        {
            "barcode": "171125888",
            "dpc": "03010546201",
            "name": "លឿង ហ៊រ"
        },
        {
            "barcode": "171125889",
            "dpc": "03010546101",
            "name": "ពូ ពេជ្រ"
        },
        {
            "barcode": "171125890",
            "dpc": "03010546001",
            "name": "ព្រឿង លាង"
        },
        {
            "barcode": "171125891",
            "dpc": "03010545901",
            "name": "ស៊ុន ប៊ុនរើត"
        },
        {
            "barcode": "171125892",
            "dpc": "03010545801",
            "name": "ប៊ុន ណារី"
        },
        {
            "barcode": "171125893",
            "dpc": "03010545701",
            "name": "គ្រី ស៊ាង"
        },
        {
            "barcode": "171125894",
            "dpc": "03010545601",
            "name": "ម៉ៅ សុភាព"
        },
        {
            "barcode": "171125895",
            "dpc": "03010536301",
            "name": "វ៉ាន ណយ"
        },
        {
            "barcode": "171125896",
            "dpc": "03010536501",
            "name": "ទុំ ឡៃហួយ"
        },
        {
            "barcode": "171125897",
            "dpc": "03010536601",
            "name": "ឡុំ សោម"
        },
        {
            "barcode": "171125898",
            "dpc": "03010536701",
            "name": "សួស តឿ"
        },
        {
            "barcode": "171125899",
            "dpc": "03010536801",
            "name": "អង្គការជំនួយផ្នែកច្បាប់"
        },
        {
            "barcode": "171125900",
            "dpc": "03010536901",
            "name": "ងួន ជីវ័ន្ត"
        },
        {
            "barcode": "171125901",
            "dpc": "03010537001",
            "name": "ងួន ពិសិទ្ធ"
        },
        {
            "barcode": "171125902",
            "dpc": "03010536401",
            "name": "ប្រុក គឿន ៤"
        },
        {
            "barcode": "171125903",
            "dpc": "03010537101",
            "name": "ប៊ូ សុផល"
        },
        {
            "barcode": "171125904",
            "dpc": "03010537201",
            "name": "ហ៊ី ឆៃហ៊ាង"
        },
        {
            "barcode": "171125905",
            "dpc": "03010538201",
            "name": "ប៊ុត សុខា ១"
        },
        {
            "barcode": "171125906",
            "dpc": "03010538301",
            "name": "ផាត ចន្ធី"
        },
        {
            "barcode": "171125907",
            "dpc": "03010538101",
            "name": "ជា សុខុម"
        },
        {
            "barcode": "171125908",
            "dpc": "03010538001",
            "name": "សំ ហឿម"
        },
        {
            "barcode": "171125909",
            "dpc": "03010544101",
            "name": "អ៊ាង គឹមហ៊ាក"
        },
        {
            "barcode": "171125910",
            "dpc": "03010538401",
            "name": "រឿន ម៉ាន ១"
        },
        {
            "barcode": "171125911",
            "dpc": "03010538501",
            "name": "ទន់ សំណាង"
        },
        {
            "barcode": "171125912",
            "dpc": "03010538601",
            "name": "កែវ ណារី"
        },
        {
            "barcode": "171125913",
            "dpc": "03010538701",
            "name": "ស្រី ម៉ៅ"
        },
        {
            "barcode": "171125914",
            "dpc": "03010538801",
            "name": "ទូច សារុំ"
        },
        {
            "barcode": "171125915",
            "dpc": "03010544001",
            "name": "ទឹត ចាន់ហន"
        },
        {
            "barcode": "171125916",
            "dpc": "03010539001",
            "name": "មុត សាឃឿន"
        },
        {
            "barcode": "171125917",
            "dpc": "03010542801",
            "name": "អេង តុល"
        },
        {
            "barcode": "171125918",
            "dpc": "03010540001",
            "name": "អឿន វណ្ណៈ"
        },
        {
            "barcode": "171125919",
            "dpc": "03010539901",
            "name": "ផាត សុខា"
        },
        {
            "barcode": "171125920",
            "dpc": "03010539801",
            "name": "ហេង ប៊ុនធី"
        },
        {
            "barcode": "171125921",
            "dpc": "03010540601",
            "name": "អេង កែវ"
        },
        {
            "barcode": "171125922",
            "dpc": "03010539601",
            "name": "ឆាំ វុឌ្ឍី"
        },
        {
            "barcode": "171125923",
            "dpc": "03010539101",
            "name": "តិ ម៉ុង"
        },
        {
            "barcode": "171125924",
            "dpc": "03010540101",
            "name": "ភិន សុវណ្ណ"
        },
        {
            "barcode": "171125925",
            "dpc": "03010540401",
            "name": "សូ សាវង្ស"
        },
        {
            "barcode": "171125926",
            "dpc": "03010540701",
            "name": "តាំង ម៉ៃ"
        },
        {
            "barcode": "171125927",
            "dpc": "03010540801",
            "name": "ព្រឿន លាន"
        },
        {
            "barcode": "171125928",
            "dpc": "03010540901",
            "name": "គិន អង្គផល្លា"
        },
        {
            "barcode": "171125929",
            "dpc": "03010541101",
            "name": "គឹម ម៉ុន"
        },
        {
            "barcode": "171125930",
            "dpc": "03010541201",
            "name": "ប្រាក់ តឿប"
        },
        {
            "barcode": "171125931",
            "dpc": "03010541301",
            "name": "លី ណូ ១"
        },
        {
            "barcode": "171125932",
            "dpc": "03010541501",
            "name": "សួន  ចាន់នឿន"
        },
        {
            "barcode": "171125933",
            "dpc": "03010541701",
            "name": "ធម្ម សុផល"
        },
        {
            "barcode": "171125934",
            "dpc": "03010541801",
            "name": "ស៊ុយ ជំនឿ ១"
        },
        {
            "barcode": "171125935",
            "dpc": "03010542001",
            "name": "និត សុភាព"
        },
        {
            "barcode": "171125936",
            "dpc": "03010542101",
            "name": "ធិន ធូ"
        },
        {
            "barcode": "171125937",
            "dpc": "03010537301",
            "name": "សែម ឈី"
        },
        {
            "barcode": "171125938",
            "dpc": "03010537401",
            "name": "សាន សាខន"
        },
        {
            "barcode": "171125939",
            "dpc": "03010537701",
            "name": "ម៉ាង សុង"
        },
        {
            "barcode": "171125940",
            "dpc": "03010537601",
            "name": "គឹម សុខុម"
        },
        {
            "barcode": "171125941",
            "dpc": "03010537501",
            "name": "ទួន សុផល"
        },
        {
            "barcode": "171125942",
            "dpc": "03010537801",
            "name": "សាន ជ័យរិទ្ធ"
        },
        {
            "barcode": "171125943",
            "dpc": "03010537901",
            "name": "ប៊ុន សារុន"
        },
        {
            "barcode": "171125944",
            "dpc": "03010541001",
            "name": "រ៉ាយ លាងស"
        },
        {
            "barcode": "171125945",
            "dpc": "03010541401",
            "name": "ឡេង ច័ន្ទដារ៉ា"
        },
        {
            "barcode": "171125946",
            "dpc": "03010541601",
            "name": "យិន ឆុងវិន"
        },
        {
            "barcode": "171125947",
            "dpc": "03010542201",
            "name": "ព្រី ថា"
        },
        {
            "barcode": "171125948",
            "dpc": "03010542301",
            "name": "សុខ ផល្លី"
        },
        {
            "barcode": "171125949",
            "dpc": "03010542601",
            "name": "ស៊ុយ ជំនឿ ២"
        },
        {
            "barcode": "171125950",
            "dpc": "03010545501",
            "name": "សែម គង់"
        },
        {
            "barcode": "171125951",
            "dpc": "03010545401",
            "name": "លឹម គឹមហៀវ"
        },
        {
            "barcode": "171125952",
            "dpc": "03010545301",
            "name": "លឹម សេងលី"
        },
        {
            "barcode": "171125953",
            "dpc": "03010545201",
            "name": "លឹម គឹហង្ស"
        },
        {
            "barcode": "171125954",
            "dpc": "03010544901",
            "name": "ទេស សម្បត្តិ"
        },
        {
            "barcode": "171125955",
            "dpc": "03010545101",
            "name": "យី ស៊ុយ"
        },
        {
            "barcode": "171125956",
            "dpc": "03010545001",
            "name": "គឹម ឡេង"
        },
        {
            "barcode": "171125957",
            "dpc": "03010544801",
            "name": "អ៊ុំ ឡេង"
        },
        {
            "barcode": "171125958",
            "dpc": "03010544601",
            "name": "អៀង ផាន"
        },
        {
            "barcode": "171125959",
            "dpc": "03010544401",
            "name": "តាំង សារី១"
        },
        {
            "barcode": "171125960",
            "dpc": "03010544701",
            "name": "ឆាំ វុឌ្ឍី"
        },
        {
            "barcode": "171125961",
            "dpc": "03010544301",
            "name": "ហាត់ លី"
        },
        {
            "barcode": "171125962",
            "dpc": "03010543301",
            "name": "មជ្ឈមណ្ឌលក្តីនិមិត្តធីម៉ូថេ"
        },
        {
            "barcode": "171125963",
            "dpc": "03010543201",
            "name": "ប៊ុក សុខា ២"
        },
        {
            "barcode": "171125964",
            "dpc": "03010542901",
            "name": "ហួត ជា"
        },
        {
            "barcode": "171125965",
            "dpc": "03010543801",
            "name": "ធម្ម សុផល"
        },
        {
            "barcode": "171125966",
            "dpc": "03010543401",
            "name": "ខាត់ នី"
        },
        {
            "barcode": "171125967",
            "dpc": "03010543501",
            "name": "ជួន នី"
        },
        {
            "barcode": "171125968",
            "dpc": "03010543701",
            "name": "ឡុង សំណាង"
        },
        {
            "barcode": "171125969",
            "dpc": "03010543901",
            "name": "រិន យាន"
        },
        {
            "barcode": "171125970",
            "dpc": "03010531201",
            "name": "ឈុន សារិទ្ធ"
        },
        {
            "barcode": "171125971",
            "dpc": "03010531401",
            "name": "នួន ប៊ុនធឿន"
        },
        {
            "barcode": "171125972",
            "dpc": "03010531701",
            "name": "ព្រំ សាខន"
        },
        {
            "barcode": "171125973",
            "dpc": "03010531601",
            "name": "វី នេត"
        },
        {
            "barcode": "171125974",
            "dpc": "03010531801",
            "name": "តាំង ម៉េងគង់ ១"
        },
        {
            "barcode": "171125975",
            "dpc": "03010531901",
            "name": "តាំង ម៉េងគង់ ២"
        },
        {
            "barcode": "171125976",
            "dpc": "03010532001",
            "name": "អ៊ុំ គឹមឡេង"
        },
        {
            "barcode": "171125977",
            "dpc": "03010532101",
            "name": "គង់ សំរិត"
        },
        {
            "barcode": "171125978",
            "dpc": "03010532201",
            "name": "ព្រំ ចានថន"
        },
        {
            "barcode": "171125979",
            "dpc": "03010532801",
            "name": "តូត គីម"
        },
        {
            "barcode": "171125980",
            "dpc": "03010532701",
            "name": "មូល ប៊ុនធឿន"
        },
        {
            "barcode": "171125981",
            "dpc": "03010532601",
            "name": "ហ៊ុន យូ"
        },
        {
            "barcode": "171125982",
            "dpc": "03010532501",
            "name": "ញឹម សុខុម"
        },
        {
            "barcode": "171125983",
            "dpc": "03010532401",
            "name": "នៅ សុខចំរើន"
        },
        {
            "barcode": "171125984",
            "dpc": "03010532301",
            "name": "រ៉ា រ៉ានី"
        },
        {
            "barcode": "171125985",
            "dpc": "03010532901",
            "name": "សុខហេង"
        },
        {
            "barcode": "171125986",
            "dpc": "03010533001",
            "name": "តូ សុផាត"
        },
        {
            "barcode": "171125987",
            "dpc": "03010533201",
            "name": "សោម សុផុន"
        },
        {
            "barcode": "171125988",
            "dpc": "03010533301",
            "name": "អ៊ុង  សាម"
        },
        {
            "barcode": "171125989",
            "dpc": "03010533401",
            "name": "ទ្រី សុខឃីម"
        },
        {
            "barcode": "171125990",
            "dpc": "03010533501",
            "name": "ក្រុមហ៊ុនរិទ្ធីមន្នី"
        },
        {
            "barcode": "171125991",
            "dpc": "03010533601",
            "name": "សុខ ចាន់មន្នី"
        },
        {
            "barcode": "171125992",
            "dpc": "03010533701",
            "name": "សុខ សំអាត"
        },
        {
            "barcode": "171125993",
            "dpc": "03010533801",
            "name": "ងួន ចន្ធូ"
        },
        {
            "barcode": "171125994",
            "dpc": "03010533901",
            "name": "យឹក ចាន់"
        },
        {
            "barcode": "171125995",
            "dpc": "03010534001",
            "name": "ឈឹម នួន"
        },
        {
            "barcode": "171125996",
            "dpc": "03010534101",
            "name": "ប៊ុន សេងហាក"
        },
        {
            "barcode": "171125997",
            "dpc": "03010534201",
            "name": "គឹម ស្រ៊ុន"
        },
        {
            "barcode": "171125998",
            "dpc": "03010534301",
            "name": "រឿន ឡោ"
        },
        {
            "barcode": "171125999",
            "dpc": "03010534401",
            "name": "ទួត សុខុម"
        },
        {
            "barcode": "171126000",
            "dpc": "03010534501",
            "name": "តិច វែង"
        },
        {
            "barcode": "171126001",
            "dpc": "03010534601",
            "name": "លី ផេង"
        },
        {
            "barcode": "171126002",
            "dpc": "03010534701",
            "name": "គឹម ញ៉ាង"
        },
        {
            "barcode": "171126003",
            "dpc": "03010534801",
            "name": "វ៉ាង យ៉ុង"
        },
        {
            "barcode": "171126004",
            "dpc": "03010534901",
            "name": "វិន អ៊ាន"
        },
        {
            "barcode": "171126005",
            "dpc": "03010535001",
            "name": "គង់ សុផល"
        },
        {
            "barcode": "171126006",
            "dpc": "03010535101",
            "name": "នាត តាក"
        },
        {
            "barcode": "171126007",
            "dpc": "03010535201",
            "name": "សួង មឿន"
        },
        {
            "barcode": "171126008",
            "dpc": "03010535301",
            "name": "ណាង ប៊ុនរឿន"
        },
        {
            "barcode": "171126009",
            "dpc": "03010535401",
            "name": "នឹប ណេរ៉ា"
        },
        {
            "barcode": "171126010",
            "dpc": "03010535501",
            "name": "ឈួន ហ្គីតា"
        },
        {
            "barcode": "171126011",
            "dpc": "03010535601",
            "name": "ហេង ឃាង"
        },
        {
            "barcode": "171126012",
            "dpc": "03010535701",
            "name": "ជា សឿន"
        },
        {
            "barcode": "171126013",
            "dpc": "03010535801",
            "name": "ឈុំ ឈៀង"
        },
        {
            "barcode": "171126014",
            "dpc": "03010535901",
            "name": "ទួត រិន"
        },
        {
            "barcode": "171126015",
            "dpc": "03010536101",
            "name": "ស៊ូ វិចិត្រ"
        },
        {
            "barcode": "171126016",
            "dpc": "03010536201",
            "name": "ទិវ ផាវី"
        },
        {
            "barcode": "171126017",
            "dpc": "03010538901",
            "name": "ទាវ  សារ៉ូ"
        },
        {
            "barcode": "171126018",
            "dpc": "03010539301",
            "name": "ពេជ្រ  រើន"
        },
        {
            "barcode": "171126019",
            "dpc": "03010539701",
            "name": "ហួន  សុខា"
        },
        {
            "barcode": "171126020",
            "dpc": "03010533101",
            "name": "ប្រាក់  ណន"
        },
        {
            "barcode": "171126021",
            "dpc": "03010536001",
            "name": "ផា  សុផល"
        },
        {
            "barcode": "171126022",
            "dpc": "03010539401",
            "name": "ហាក់  ឡាយ"
        },
        {
            "barcode": "171126023",
            "dpc": "03010539501",
            "name": "ពេជ្រ  ឌី"
        },
        {
            "barcode": "171126024",
            "dpc": "03010542401",
            "name": "ហម  សាវ៉ុន"
        },
        {
            "barcode": "171126025",
            "dpc": "03010542501",
            "name": "ឆៃ  វណ្ណះ"
        },
        {
            "barcode": "171126026",
            "dpc": "03010542701",
            "name": "តឹក  សំអឿន"
        },
        {
            "barcode": "171126027",
            "dpc": "03010543601",
            "name": "គឿន  អឿប"
        },
        {
            "barcode": "171126028",
            "dpc": "03010544201",
            "name": "សាលារៀនសូបាណា"
        },
        {
            "barcode": "171126029",
            "dpc": "03010548001",
            "name": "ស៊ាង សាលី"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
