let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171129286",
            "dpc": "03010606701",
            "name": "ទន់  វ៉ាយ"
        },
        {
            "barcode": "171129287",
            "dpc": "03010626901",
            "name": "ហុក គីម"
        },
        {
            "barcode": "171129288",
            "dpc": "03010627101",
            "name": "ភី ផាន"
        },
        {
            "barcode": "171129289",
            "dpc": "03010627201",
            "name": "ជេស ទិត"
        },
        {
            "barcode": "171129290",
            "dpc": "03010627401",
            "name": "លឹម ងិធ"
        },
        {
            "barcode": "171129291",
            "dpc": "03010627501",
            "name": "ថាន់ ចន្តា"
        },
        {
            "barcode": "171129292",
            "dpc": "03010618301",
            "name": "លី  សៀប"
        },
        {
            "barcode": "171129293",
            "dpc": "03010618201",
            "name": "ពេជ្រ  ព្រហ្មមុន្នី"
        },
        {
            "barcode": "171129294",
            "dpc": "03010627301",
            "name": "ប៊ុន ចំរើន"
        },
        {
            "barcode": "171129295",
            "dpc": "03010618001",
            "name": "អ៊ឹម វត្តី"
        },
        {
            "barcode": "171129296",
            "dpc": "03010618101",
            "name": "ភួង   សុភាព"
        },
        {
            "barcode": "171129297",
            "dpc": "03010618401",
            "name": "ម៉ុន សាមឿន"
        },
        {
            "barcode": "171129298",
            "dpc": "03010618501",
            "name": "ម៉ក ទឹម"
        },
        {
            "barcode": "171129299",
            "dpc": "03010618601",
            "name": "ប៊ុច ស៊ត"
        },
        {
            "barcode": "171129300",
            "dpc": "03010618701",
            "name": "សៀក សារ៉េត"
        },
        {
            "barcode": "171129301",
            "dpc": "03010618801",
            "name": "ម៉ៃ សុវណ្ណ"
        },
        {
            "barcode": "171129302",
            "dpc": "03010618901",
            "name": "ទូច ប៊ុនធឿន"
        },
        {
            "barcode": "171129303",
            "dpc": "03010617601",
            "name": "ថុង  សុខជាតិ"
        },
        {
            "barcode": "171129304",
            "dpc": "03010617801",
            "name": "តែ  គឹមហួយ"
        },
        {
            "barcode": "171129305",
            "dpc": "03010617301",
            "name": "សៅ ដាំ"
        },
        {
            "barcode": "171129306",
            "dpc": "03010617401",
            "name": "សេង ថាវ"
        },
        {
            "barcode": "171129307",
            "dpc": "03010617001",
            "name": "ចាន់ វាសនា"
        },
        {
            "barcode": "171129308",
            "dpc": "03010616701",
            "name": "មិត្ត ចិន្តា"
        },
        {
            "barcode": "171129309",
            "dpc": "03010616801",
            "name": "គង់ ទឺ"
        },
        {
            "barcode": "171129310",
            "dpc": "03010619401",
            "name": "នឹម កែវ"
        },
        {
            "barcode": "171129311",
            "dpc": "03010619001",
            "name": "ភិន ប៊ុនរឿន"
        },
        {
            "barcode": "171129312",
            "dpc": "03010619101",
            "name": "អ៊ុំ សារី"
        },
        {
            "barcode": "171129313",
            "dpc": "03010619601",
            "name": "គណបក្សប្រជាជន"
        },
        {
            "barcode": "171129314",
            "dpc": "03010619701",
            "name": "ឈឹម សូលីដែន"
        },
        {
            "barcode": "171129315",
            "dpc": "03010619801",
            "name": "គឹម សៅលឿត"
        },
        {
            "barcode": "171129316",
            "dpc": "03010619901",
            "name": "ប៉ាង នួន"
        },
        {
            "barcode": "171129317",
            "dpc": "03010620101",
            "name": "ហេង កាកសុង"
        },
        {
            "barcode": "171129318",
            "dpc": "03010620601",
            "name": "រិន  សារ៉ន"
        },
        {
            "barcode": "171129319",
            "dpc": "03010620701",
            "name": "អ៊ឹង សី"
        },
        {
            "barcode": "171129320",
            "dpc": "03010617201",
            "name": "យិន  ចន្ធី"
        },
        {
            "barcode": "171129321",
            "dpc": "03010617101",
            "name": "អម រ៉េត"
        },
        {
            "barcode": "171129322",
            "dpc": "03010616601",
            "name": "ទីន ម៉ារី"
        },
        {
            "barcode": "171129323",
            "dpc": "03010620501",
            "name": "ឌុង ឌីម"
        },
        {
            "barcode": "171129324",
            "dpc": "03010620401",
            "name": "រស់ លី"
        },
        {
            "barcode": "171129325",
            "dpc": "03010620301",
            "name": "គង់ រ៉ាវី"
        },
        {
            "barcode": "171129326",
            "dpc": "03010620201",
            "name": "ឃ្លោក ដែន"
        },
        {
            "barcode": "171129327",
            "dpc": "03010621101",
            "name": "ប៊ុត សំអឿ"
        },
        {
            "barcode": "171129328",
            "dpc": "03010626501",
            "name": "ណុប ដារ៉ា"
        },
        {
            "barcode": "171129329",
            "dpc": "03010626601",
            "name": "ហួន  សង្ហា"
        },
        {
            "barcode": "171129330",
            "dpc": "03010626701",
            "name": "តេង សំអាត"
        },
        {
            "barcode": "171129331",
            "dpc": "03010626001",
            "name": "ប៉ិច  ណម"
        },
        {
            "barcode": "171129332",
            "dpc": "03010626101",
            "name": "ស៊ឺន ស៊ីលីណា"
        },
        {
            "barcode": "171129333",
            "dpc": "03010626201",
            "name": "យឹម សេតដារ៉ា"
        },
        {
            "barcode": "171129334",
            "dpc": "03010626301",
            "name": "សោម សង្វាស័ក"
        },
        {
            "barcode": "171129335",
            "dpc": "03010624301",
            "name": "លី លន់"
        },
        {
            "barcode": "171129336",
            "dpc": "03010624501",
            "name": "នាក ណន"
        },
        {
            "barcode": "171129337",
            "dpc": "03010624401",
            "name": "គង់ ចិន្តា"
        },
        {
            "barcode": "171129338",
            "dpc": "03010619301",
            "name": "អៀ សុផាត"
        },
        {
            "barcode": "171129339",
            "dpc": "03010625901",
            "name": "សួន ឧត្តម"
        },
        {
            "barcode": "171129340",
            "dpc": "03010625601",
            "name": "ចៅ សៅ"
        },
        {
            "barcode": "171129341",
            "dpc": "03010625701",
            "name": "ចៅ ម៉ៅ"
        },
        {
            "barcode": "171129342",
            "dpc": "03010619201",
            "name": "ងន សំអុស"
        },
        {
            "barcode": "171129343",
            "dpc": "03010624601",
            "name": "នាក ណាន់"
        },
        {
            "barcode": "171129344",
            "dpc": "03010624801",
            "name": "ប៊ន សារឹម"
        },
        {
            "barcode": "171129345",
            "dpc": "03010624701",
            "name": "យស់ សម្បត្តិ"
        },
        {
            "barcode": "171129346",
            "dpc": "03010624901",
            "name": "សេត ប្រិយ"
        },
        {
            "barcode": "171129347",
            "dpc": "03010625001",
            "name": "សែន សុភ័ណ្ឌ"
        },
        {
            "barcode": "171129348",
            "dpc": "03010625101",
            "name": "សន ប៊ុនណា"
        },
        {
            "barcode": "171129349",
            "dpc": "03010625201",
            "name": "គិវ  គឹមហឿង"
        },
        {
            "barcode": "171129350",
            "dpc": "03010625301",
            "name": "ប៉ែន ហ៊ន"
        },
        {
            "barcode": "171129351",
            "dpc": "03010615601",
            "name": "ចាន់ បុប្ផា"
        },
        {
            "barcode": "171129352",
            "dpc": "03010621001",
            "name": "សួន វុត្ថា"
        },
        {
            "barcode": "171129353",
            "dpc": "03010615501",
            "name": "ថាំង  សៀម"
        },
        {
            "barcode": "171129354",
            "dpc": "03010615401",
            "name": "ហុង  ស៊ីថា"
        },
        {
            "barcode": "171129355",
            "dpc": "03010628101",
            "name": "រ៉ុង គឹមស៊ាន"
        },
        {
            "barcode": "171129356",
            "dpc": "03010627801",
            "name": "ទីន ដារី"
        },
        {
            "barcode": "171129357",
            "dpc": "03010627901",
            "name": "លឹម វ៉ានណែត"
        },
        {
            "barcode": "171129358",
            "dpc": "03010627701",
            "name": "ង៉ោ ស៊ុនហេង"
        },
        {
            "barcode": "171129359",
            "dpc": "03010615901",
            "name": "ទន់ រឿ"
        },
        {
            "barcode": "171129360",
            "dpc": "03010616301",
            "name": "អៀម ផាន់ណា"
        },
        {
            "barcode": "171129361",
            "dpc": "03010616201",
            "name": "ភិន ប្រម"
        },
        {
            "barcode": "171129362",
            "dpc": "03010615701",
            "name": "សយ បូនិត"
        },
        {
            "barcode": "171129363",
            "dpc": "03010615801",
            "name": "កែវ ផានី"
        },
        {
            "barcode": "171129364",
            "dpc": "03010628401",
            "name": "សឿង សឿម"
        },
        {
            "barcode": "171129365",
            "dpc": "03010628901",
            "name": "សយ លីហេង"
        },
        {
            "barcode": "171129366",
            "dpc": "03010629101",
            "name": "បូ ហាក"
        },
        {
            "barcode": "171129367",
            "dpc": "03010629001",
            "name": "ហេង លឹមសេង"
        },
        {
            "barcode": "171129368",
            "dpc": "03010628701",
            "name": "អ៊ុន ដានី ១"
        },
        {
            "barcode": "171129369",
            "dpc": "03010628801",
            "name": "អ៊ុន សុធារី"
        },
        {
            "barcode": "171129370",
            "dpc": "03010628601",
            "name": "លឹម ស៊ាន"
        },
        {
            "barcode": "171129371",
            "dpc": "03010614401",
            "name": "វ៉ា ស៊ីថារ៉ុត"
        },
        {
            "barcode": "171129372",
            "dpc": "03010616501",
            "name": "ឈួន    សាវិន"
        },
        {
            "barcode": "171129373",
            "dpc": "03010629801",
            "name": "រូម  រុន"
        },
        {
            "barcode": "171129374",
            "dpc": "03010629701",
            "name": "ឡេង  ឃីម"
        },
        {
            "barcode": "171129375",
            "dpc": "03010629601",
            "name": "ស  គឹមប៉ាក"
        },
        {
            "barcode": "171129376",
            "dpc": "03010629401",
            "name": "កែវ  វិចិត្រ"
        },
        {
            "barcode": "171129377",
            "dpc": "03010629501",
            "name": "វ៉ាន  ស្រីពៅ"
        },
        {
            "barcode": "171129378",
            "dpc": "03010629201",
            "name": "លឹម ហុង"
        },
        {
            "barcode": "171129379",
            "dpc": "03010630201",
            "name": "សុខ ឈឿន"
        },
        {
            "barcode": "171129380",
            "dpc": "03010630101",
            "name": "ឡុង ផលគុណ"
        },
        {
            "barcode": "171129381",
            "dpc": "03010630001",
            "name": "វណ្ណ សុផល"
        },
        {
            "barcode": "171129382",
            "dpc": "03010631001",
            "name": "ផុន ចន្ត្រា"
        },
        {
            "barcode": "171129383",
            "dpc": "03010631101",
            "name": "សូ ភីយ៉ា"
        },
        {
            "barcode": "171129384",
            "dpc": "03010632001",
            "name": "ចាប លី"
        },
        {
            "barcode": "171129385",
            "dpc": "03010630801",
            "name": "សាង គឹមសាយ"
        },
        {
            "barcode": "171129386",
            "dpc": "03010630601",
            "name": "ពេជ្រ វណ្ណា ៣"
        },
        {
            "barcode": "171129387",
            "dpc": "03010630701",
            "name": "ពេជ្រ វណ្ណា ២"
        },
        {
            "barcode": "171129388",
            "dpc": "03010630501",
            "name": "តាំង គង់"
        },
        {
            "barcode": "171129389",
            "dpc": "03010630301",
            "name": "ឌី សុខលឹម"
        },
        {
            "barcode": "171129390",
            "dpc": "03010631401",
            "name": "យ៉ាន់ សម័យ"
        },
        {
            "barcode": "171129391",
            "dpc": "03010632501",
            "name": "ម៉ៅទឹម សុវណ្ណារិទ្ធ"
        },
        {
            "barcode": "171129392",
            "dpc": "03010632301",
            "name": "សួន បុប្ផា"
        },
        {
            "barcode": "171129393",
            "dpc": "03010631801",
            "name": "ជឿន ចិន្តា"
        },
        {
            "barcode": "171129394",
            "dpc": "03010632401",
            "name": "ចាន់ ញ៉ន"
        },
        {
            "barcode": "171129395",
            "dpc": "03010622901",
            "name": "ទៀប រី"
        },
        {
            "barcode": "171129396",
            "dpc": "03010623001",
            "name": "ការិ.ព្រហ្មទណ្ឌកំរិតស្រាល"
        },
        {
            "barcode": "171129397",
            "dpc": "03010623201",
            "name": "សឿន ម៉ាច"
        },
        {
            "barcode": "171129398",
            "dpc": "03010623301",
            "name": "អៀវ យ៉ា"
        },
        {
            "barcode": "171129399",
            "dpc": "03010623101",
            "name": "ម៉ែន សុភិន"
        },
        {
            "barcode": "171129400",
            "dpc": "03010622601",
            "name": "ស៊ីម ឡៃ"
        },
        {
            "barcode": "171129401",
            "dpc": "03010622301",
            "name": "ខឹម ស៊ីណាន"
        },
        {
            "barcode": "171129402",
            "dpc": "03010622401",
            "name": "នៅ នឿន"
        },
        {
            "barcode": "171129403",
            "dpc": "03010621701",
            "name": "ពុំ ចាន់"
        },
        {
            "barcode": "171129404",
            "dpc": "03010621501",
            "name": "តូយ ភន"
        },
        {
            "barcode": "171129405",
            "dpc": "03010621401",
            "name": "កើង សុខខេង"
        },
        {
            "barcode": "171129406",
            "dpc": "03010615201",
            "name": "ឈួម ពុធ"
        },
        {
            "barcode": "171129407",
            "dpc": "03010621801",
            "name": "ឈួម ឆយ"
        },
        {
            "barcode": "171129408",
            "dpc": "03010621901",
            "name": "ជា ដានី"
        },
        {
            "barcode": "171129409",
            "dpc": "03010615101",
            "name": "យ៉ែម យុន"
        },
        {
            "barcode": "171129410",
            "dpc": "03010633501",
            "name": "គី ឡែ"
        },
        {
            "barcode": "171129411",
            "dpc": "03010633601",
            "name": "ឆយ ជា"
        },
        {
            "barcode": "171129412",
            "dpc": "03010633401",
            "name": "ផឹក រឿន"
        },
        {
            "barcode": "171129413",
            "dpc": "03010633201",
            "name": "វង់ វី"
        },
        {
            "barcode": "171129414",
            "dpc": "03010633301",
            "name": "ប៉ោ ចន្ធី"
        },
        {
            "barcode": "171129415",
            "dpc": "03010632601",
            "name": "មៀច ផល្លី"
        },
        {
            "barcode": "171129416",
            "dpc": "03010632701",
            "name": "លួង ចាន់"
        },
        {
            "barcode": "171129417",
            "dpc": "03010623601",
            "name": "ជួន រិទ្ធី"
        },
        {
            "barcode": "171129418",
            "dpc": "03010623501",
            "name": "កុច ផន"
        },
        {
            "barcode": "171129419",
            "dpc": "03010623401",
            "name": "សៅ ថាច"
        },
        {
            "barcode": "171129420",
            "dpc": "03010623701",
            "name": "វ៉ាន់ ដារ៉ា"
        },
        {
            "barcode": "171129421",
            "dpc": "03010623801",
            "name": "សាលាហូប"
        },
        {
            "barcode": "171129422",
            "dpc": "03010623901",
            "name": "ខាន់ សុភាព"
        },
        {
            "barcode": "171129423",
            "dpc": "03010624001",
            "name": "សន សាន"
        },
        {
            "barcode": "171129424",
            "dpc": "03010624101",
            "name": "យឿន សំអ៊ុល"
        },
        {
            "barcode": "171129425",
            "dpc": "03010624201",
            "name": "សុខ លាងហ៊ាប"
        },
        {
            "barcode": "171129426",
            "dpc": "03010632901",
            "name": "លន់ រិទ្ធ"
        },
        {
            "barcode": "171129427",
            "dpc": "03010632801",
            "name": "ទី សុខុន"
        },
        {
            "barcode": "171129428",
            "dpc": "03010633101",
            "name": "ញ៉ែម  សុធា"
        },
        {
            "barcode": "171129429",
            "dpc": "03010633001",
            "name": "ពេញ ចាន់ដារ៉ា"
        },
        {
            "barcode": "171129430",
            "dpc": "03010614301",
            "name": "ហាច គឹមសុក"
        },
        {
            "barcode": "171129431",
            "dpc": "03010614501",
            "name": "ម៉ៅ វិញ"
        },
        {
            "barcode": "171129432",
            "dpc": "03010614701",
            "name": "គុយ គឹមហេង"
        },
        {
            "barcode": "171129433",
            "dpc": "03010614801",
            "name": "សាំង សោផា"
        },
        {
            "barcode": "171129434",
            "dpc": "03010614901",
            "name": "សុខ ឆែម"
        },
        {
            "barcode": "171129435",
            "dpc": "03010616001",
            "name": "ស៊ូ  វ៉ាន់"
        },
        {
            "barcode": "171129436",
            "dpc": "03010616101",
            "name": "អ៊ុំ   សារិទ្ធ"
        },
        {
            "barcode": "171129437",
            "dpc": "03010616401",
            "name": "អួន  ឈឿប"
        },
        {
            "barcode": "171129438",
            "dpc": "03010616901",
            "name": "វី  លីហួង"
        },
        {
            "barcode": "171129439",
            "dpc": "03010617501",
            "name": "ម៉ែន  សុវណ្ណ"
        },
        {
            "barcode": "171129440",
            "dpc": "03010617901",
            "name": "អ៊ិត  សម្ផស្ស"
        },
        {
            "barcode": "171129441",
            "dpc": "03010620001",
            "name": "សោម  សារឿង"
        },
        {
            "barcode": "171129442",
            "dpc": "03010620801",
            "name": "ហ៊ីម  ចាន់ធី"
        },
        {
            "barcode": "171129443",
            "dpc": "03010620901",
            "name": "ផន  វី"
        },
        {
            "barcode": "171129444",
            "dpc": "03010621201",
            "name": "ប៉ោ  ចិន្តា"
        },
        {
            "barcode": "171129445",
            "dpc": "03010621301",
            "name": "គណបក្សឃុំរតនៈ"
        },
        {
            "barcode": "171129446",
            "dpc": "03010621601",
            "name": "ម៉ែន   ប៊ុនរឿន"
        },
        {
            "barcode": "171129447",
            "dpc": "03010622101",
            "name": "ធូ  ស៊ីពូន"
        },
        {
            "barcode": "171129448",
            "dpc": "03010622201",
            "name": "កេត   អ័កតីដេ"
        },
        {
            "barcode": "171129449",
            "dpc": "03010622801",
            "name": "ប៉ិន  យួម"
        },
        {
            "barcode": "171129450",
            "dpc": "03010628501",
            "name": "ឌុង  វិបុល"
        },
        {
            "barcode": "171129451",
            "dpc": "03010629301",
            "name": "ឃី   តិញ"
        },
        {
            "barcode": "171129452",
            "dpc": "03010630401",
            "name": "លឹម  ឃាង"
        },
        {
            "barcode": "171129453",
            "dpc": "03010631301",
            "name": "ទុយ  សូនី"
        },
        {
            "barcode": "171129454",
            "dpc": "03010631601",
            "name": "ផា  លឿម ផ.  ក.  ភ."
        },
        {
            "barcode": "171129455",
            "dpc": "03010634401",
            "name": "អ៊ី  ហួង"
        },
        {
            "barcode": "171129456",
            "dpc": "03010634101",
            "name": "ស៊ីន សុភ័ក្រ្ត"
        },
        {
            "barcode": "171129457",
            "dpc": "03010634201",
            "name": "ថង សាវដ្តី"
        },
        {
            "barcode": "171129458",
            "dpc": "03010634301",
            "name": "ភោក រិទ្ធា"
        },
        {
            "barcode": "171129459",
            "dpc": "03010636001",
            "name": "ឆឹង សេរីវឌ្ឍន៍"
        },
        {
            "barcode": "171129460",
            "dpc": "03010636201",
            "name": "ម៉ៅ សុវណ្ណរ៉ា"
        },
        {
            "barcode": "171129461",
            "dpc": "03010634701",
            "name": "ចាន ឃាង"
        },
        {
            "barcode": "171129462",
            "dpc": "03010634801",
            "name": "ភឹម ផុន"
        },
        {
            "barcode": "171129463",
            "dpc": "03010634601",
            "name": "ហឿង សារ៉ាត់"
        },
        {
            "barcode": "171129464",
            "dpc": "03010635901",
            "name": "យ៉ាំ ចាន់ចិត្រា"
        },
        {
            "barcode": "171129465",
            "dpc": "03010634901",
            "name": "វ៉ន ឃាង"
        },
        {
            "barcode": "171129466",
            "dpc": "03010635101",
            "name": "នុត ណាយ៉ុម"
        },
        {
            "barcode": "171129467",
            "dpc": "03010635301",
            "name": "ភា បញ្ញា"
        },
        {
            "barcode": "171129468",
            "dpc": "03010634501",
            "name": "ម៉េង សុខម៉ាន់"
        },
        {
            "barcode": "171129469",
            "dpc": "03010635701",
            "name": "អ៊ុយ គឹមឆៃ"
        },
        {
            "barcode": "171129470",
            "dpc": "03010635501",
            "name": "កែវ លីហ៊ុន"
        },
        {
            "barcode": "171129471",
            "dpc": "03010635201",
            "name": "តាក មករា"
        },
        {
            "barcode": "171129472",
            "dpc": "03010635001",
            "name": "អឿន អេង"
        },
        {
            "barcode": "171129473",
            "dpc": "03010635801",
            "name": "ប្រាក ឌីណា"
        },
        {
            "barcode": "171129474",
            "dpc": "03010635601",
            "name": "ហាក់ ចំរើន"
        },
        {
            "barcode": "171129475",
            "dpc": "03010643101",
            "name": "ផា រ៉ាវុធ"
        },
        {
            "barcode": "171129476",
            "dpc": "03010643201",
            "name": "ម៉ម ពៅ"
        },
        {
            "barcode": "171129477",
            "dpc": "03010643301",
            "name": "ជួប   ហាប់"
        },
        {
            "barcode": "171129478",
            "dpc": "03010639101",
            "name": "ហែម វន្ថា"
        },
        {
            "barcode": "171129479",
            "dpc": "03010640001",
            "name": "ថត រីណា"
        },
        {
            "barcode": "171129480",
            "dpc": "03010636301",
            "name": "រឹម សារឿន"
        },
        {
            "barcode": "171129481",
            "dpc": "03010636501",
            "name": "សឺង ម៉ារិទ្ធ"
        },
        {
            "barcode": "171129482",
            "dpc": "03010636701",
            "name": "ហុង  ភីដា"
        },
        {
            "barcode": "171129483",
            "dpc": "03010636601",
            "name": "ទី គឹមហេង"
        },
        {
            "barcode": "171129484",
            "dpc": "03010636901",
            "name": "សយ សាភឿង"
        },
        {
            "barcode": "171129485",
            "dpc": "03010637201",
            "name": "ម៉ាន មារី"
        },
        {
            "barcode": "171129486",
            "dpc": "03010637101",
            "name": "សុខ ហាក"
        },
        {
            "barcode": "171129487",
            "dpc": "03010637001",
            "name": "ណុះ ម៉ាន់"
        },
        {
            "barcode": "171129488",
            "dpc": "03010637301",
            "name": "លី យូសុស"
        },
        {
            "barcode": "171129489",
            "dpc": "03010638401",
            "name": "ស៊ុន វន"
        },
        {
            "barcode": "171129490",
            "dpc": "03010638201",
            "name": "ឆឹង  ថន"
        },
        {
            "barcode": "171129491",
            "dpc": "03010638101",
            "name": "យុត សុភ័ណ្ឌ"
        },
        {
            "barcode": "171129492",
            "dpc": "03010637901",
            "name": "ឃួន ណាវី"
        },
        {
            "barcode": "171129493",
            "dpc": "03010638001",
            "name": "សៀង សុធឿន"
        },
        {
            "barcode": "171129494",
            "dpc": "03010638701",
            "name": "ម៉ាត់ ស្មាន់"
        },
        {
            "barcode": "171129495",
            "dpc": "03010637801",
            "name": "កែវ គឹមអេង"
        },
        {
            "barcode": "171129496",
            "dpc": "03010637701",
            "name": "តាំង ប៉េងហុង"
        },
        {
            "barcode": "171129497",
            "dpc": "03010637601",
            "name": "អ៊ូ ផល្លី"
        },
        {
            "barcode": "171129498",
            "dpc": "03010637501",
            "name": "ស៊ុម រៀម"
        },
        {
            "barcode": "171129499",
            "dpc": "03010639301",
            "name": "លឹម សុភា"
        },
        {
            "barcode": "171129500",
            "dpc": "03010639401",
            "name": "តាំង គឹមហេង"
        },
        {
            "barcode": "171129501",
            "dpc": "03010639501",
            "name": "យ៉ាំ ហាន់"
        },
        {
            "barcode": "171129502",
            "dpc": "03010638601",
            "name": "ផុន មករា"
        },
        {
            "barcode": "171129503",
            "dpc": "03010639601",
            "name": "អ៊ឹង ហួកឺ"
        },
        {
            "barcode": "171129504",
            "dpc": "03010639801",
            "name": "ចក ជូន ២"
        },
        {
            "barcode": "171129505",
            "dpc": "03010639701",
            "name": "ចក ណារ៉ង់ឌី"
        },
        {
            "barcode": "171129506",
            "dpc": "03010639901",
            "name": "ឥន សៅរិទ្ធ"
        },
        {
            "barcode": "171129507",
            "dpc": "03010640101",
            "name": "គឹម ផល្លា"
        },
        {
            "barcode": "171129508",
            "dpc": "03010640401",
            "name": "ខឹម ស្រីម៉ៅ"
        },
        {
            "barcode": "171129509",
            "dpc": "03010640301",
            "name": "ខឹម សុផល"
        },
        {
            "barcode": "171129510",
            "dpc": "03010640501",
            "name": "ខេង សុខុម"
        },
        {
            "barcode": "171129511",
            "dpc": "03010640201",
            "name": "ឆែម វិចិត្រ"
        },
        {
            "barcode": "171129512",
            "dpc": "03010644701",
            "name": "ឈុំ ហេង"
        },
        {
            "barcode": "171129513",
            "dpc": "03010644601",
            "name": "ណែល ផុន"
        },
        {
            "barcode": "171129514",
            "dpc": "03010644501",
            "name": "ប៊ុន រ័ត្ន"
        },
        {
            "barcode": "171129515",
            "dpc": "03010644401",
            "name": "ងួន បាន"
        },
        {
            "barcode": "171129516",
            "dpc": "03010644301",
            "name": "យ៉ុង ឆៃយុត"
        },
        {
            "barcode": "171129517",
            "dpc": "03010644201",
            "name": "យិន ស៊ូ"
        },
        {
            "barcode": "171129518",
            "dpc": "03010644101",
            "name": "សៀម ភក្តី"
        },
        {
            "barcode": "171129519",
            "dpc": "03010643901",
            "name": "ផា  សិលា"
        },
        {
            "barcode": "171129520",
            "dpc": "03010643701",
            "name": "ប៉េង ប៉ូរ៉ា"
        },
        {
            "barcode": "171129521",
            "dpc": "03010643801",
            "name": "អៀ ខេមរា"
        },
        {
            "barcode": "171129522",
            "dpc": "03010643501",
            "name": "សាង សាវុធ"
        },
        {
            "barcode": "171129523",
            "dpc": "03010643601",
            "name": "ឃឿង តាន់ ២"
        },
        {
            "barcode": "171129524",
            "dpc": "03010643401",
            "name": "ប៉ូ ពៅ"
        },
        {
            "barcode": "171129525",
            "dpc": "03010645001",
            "name": "សាញ់ សែម"
        },
        {
            "barcode": "171129526",
            "dpc": "03010644801",
            "name": "ម៉ា សារ៉ុម"
        },
        {
            "barcode": "171129527",
            "dpc": "03010645501",
            "name": "សៅ សុខុម"
        },
        {
            "barcode": "171129528",
            "dpc": "03010645301",
            "name": "ជេត វណ្ណី"
        },
        {
            "barcode": "171129529",
            "dpc": "03010645201",
            "name": "ម៉ៅ ឈឿន"
        },
        {
            "barcode": "171129530",
            "dpc": "03010646001",
            "name": "ស ហេង"
        },
        {
            "barcode": "171129531",
            "dpc": "03010645801",
            "name": "ជឺ ហ៊ង"
        },
        {
            "barcode": "171129532",
            "dpc": "03010645701",
            "name": "មឿង វុត្ថា"
        },
        {
            "barcode": "171129533",
            "dpc": "03010646601",
            "name": "ខាត់ សារិន"
        },
        {
            "barcode": "171129534",
            "dpc": "03010646501",
            "name": "ពេជ្រ ចំរើន"
        },
        {
            "barcode": "171129535",
            "dpc": "03010646401",
            "name": "ឈឹម គឹមលាង"
        },
        {
            "barcode": "171129536",
            "dpc": "03010646301",
            "name": "ម៉ុត សារួន"
        },
        {
            "barcode": "171129537",
            "dpc": "03010646201",
            "name": "ជា ថាវ៉ាន់"
        },
        {
            "barcode": "171129538",
            "dpc": "03010608001",
            "name": "យិន ឆលីវណ្ណ"
        },
        {
            "barcode": "171129539",
            "dpc": "03010603201",
            "name": "សៀន សេន"
        },
        {
            "barcode": "171129540",
            "dpc": "03010603101",
            "name": "ហេង អៀន"
        },
        {
            "barcode": "171129541",
            "dpc": "03010611601",
            "name": "ជ័យ ម៉ៅ"
        },
        {
            "barcode": "171129542",
            "dpc": "03010611801",
            "name": "ផ្លុង  ឆៃ"
        },
        {
            "barcode": "171129543",
            "dpc": "03010611501",
            "name": "ភួង ផល្លា"
        },
        {
            "barcode": "171129544",
            "dpc": "03010611401",
            "name": "ផន  សឿន"
        },
        {
            "barcode": "171129545",
            "dpc": "03010611301",
            "name": "យក ហាក់"
        },
        {
            "barcode": "171129546",
            "dpc": "03010611101",
            "name": "សេង ឆៃ"
        },
        {
            "barcode": "171129547",
            "dpc": "03010611001",
            "name": "អ៊ុក សារិន"
        },
        {
            "barcode": "171129548",
            "dpc": "03010610901",
            "name": "រិន ហោ"
        },
        {
            "barcode": "171129549",
            "dpc": "03010610801",
            "name": "ភួង សម្បត្តិ"
        },
        {
            "barcode": "171129550",
            "dpc": "03010610301",
            "name": "ជិវ  គឹមសាន"
        },
        {
            "barcode": "171129551",
            "dpc": "03010610501",
            "name": "ឃួន ឃឿប"
        },
        {
            "barcode": "171129552",
            "dpc": "03010609801",
            "name": "ជុំ សំអឿន"
        },
        {
            "barcode": "171129553",
            "dpc": "03010608301",
            "name": "ជឹង ភ័ក្រត្រា"
        },
        {
            "barcode": "171129554",
            "dpc": "03010608201",
            "name": "លឹម ស៊ីថន"
        },
        {
            "barcode": "171129555",
            "dpc": "03010608101",
            "name": "ប៊ុន យាន"
        },
        {
            "barcode": "171129556",
            "dpc": "03010607901",
            "name": "ផាច់ ផូរ"
        },
        {
            "barcode": "171129557",
            "dpc": "03010607801",
            "name": "ជា ប៊ុនលៀង"
        },
        {
            "barcode": "171129558",
            "dpc": "03010607501",
            "name": "ប្រាក់ ឃុន"
        },
        {
            "barcode": "171129559",
            "dpc": "03010607301",
            "name": "ហាស់ ភីណា"
        },
        {
            "barcode": "171129560",
            "dpc": "03010605101",
            "name": "ជិន យ៉ុម"
        },
        {
            "barcode": "171129561",
            "dpc": "03010609001",
            "name": "ហៃ សីហា"
        },
        {
            "barcode": "171129562",
            "dpc": "03010609101",
            "name": "សួន ហ៊ាន"
        },
        {
            "barcode": "171129563",
            "dpc": "03010609401",
            "name": "ឈៀង សំអាត"
        },
        {
            "barcode": "171129564",
            "dpc": "03010609501",
            "name": "អូច  សុផល"
        },
        {
            "barcode": "171129565",
            "dpc": "03010612001",
            "name": "ឈៀង  ស្រេង"
        },
        {
            "barcode": "171129566",
            "dpc": "03010611901",
            "name": "ដៀប  វណ្ណនី"
        },
        {
            "barcode": "171129567",
            "dpc": "03010613101",
            "name": "ជា សម្បត្តិ"
        },
        {
            "barcode": "171129568",
            "dpc": "03010613001",
            "name": "គង់ ឈួយ"
        },
        {
            "barcode": "171129569",
            "dpc": "03010612901",
            "name": "ឈឿន សេរីវុឌ្ឍ"
        },
        {
            "barcode": "171129570",
            "dpc": "03010612801",
            "name": "ឃឹម ង៉ុយ"
        },
        {
            "barcode": "171129571",
            "dpc": "03010612701",
            "name": "ប៉ូយ  លាភ"
        },
        {
            "barcode": "171129572",
            "dpc": "03010612601",
            "name": "ងិន  សារឿន"
        },
        {
            "barcode": "171129573",
            "dpc": "03010612501",
            "name": "សៀង  សារ៉ាត់"
        },
        {
            "barcode": "171129574",
            "dpc": "03010612301",
            "name": "ប្រាក់ ហេង"
        },
        {
            "barcode": "171129575",
            "dpc": "03010612101",
            "name": "គឹម  ង៉ោ"
        },
        {
            "barcode": "171129576",
            "dpc": "03010612201",
            "name": "ប្រាក់  ដាវី"
        },
        {
            "barcode": "171129577",
            "dpc": "03010609601",
            "name": "ស៊ីន ស៊ីន"
        },
        {
            "barcode": "171129578",
            "dpc": "03010608901",
            "name": "ហួត គឹមលី"
        },
        {
            "barcode": "171129579",
            "dpc": "03010609201",
            "name": "សេក វណ្ណឌី"
        },
        {
            "barcode": "171129580",
            "dpc": "03010609301",
            "name": "អេង ង៉ោ"
        },
        {
            "barcode": "171129581",
            "dpc": "03010605201",
            "name": "យស់ សុខន"
        },
        {
            "barcode": "171129582",
            "dpc": "03010605301",
            "name": "ទូច ស៊ីផាន់"
        },
        {
            "barcode": "171129583",
            "dpc": "03010605401",
            "name": "ជិន យ៉េន"
        },
        {
            "barcode": "171129584",
            "dpc": "03010605701",
            "name": "ប៉ាវ  ប៊ុនរឿង"
        },
        {
            "barcode": "171129585",
            "dpc": "03010605801",
            "name": "ម៉ីត  ស៊ីម"
        },
        {
            "barcode": "171129586",
            "dpc": "03010605901",
            "name": "កា  ស៊ាន"
        },
        {
            "barcode": "171129587",
            "dpc": "03010613501",
            "name": "តាំ លី"
        },
        {
            "barcode": "171129588",
            "dpc": "03010613401",
            "name": "សាយ យី"
        },
        {
            "barcode": "171129589",
            "dpc": "03010613201",
            "name": "ហៀង គឹមចេង"
        },
        {
            "barcode": "171129590",
            "dpc": "03010614201",
            "name": "សយ ធឿន"
        },
        {
            "barcode": "171129591",
            "dpc": "03010614101",
            "name": "ជួប លឿ"
        },
        {
            "barcode": "171129592",
            "dpc": "03010613901",
            "name": "អ៊ុក លន់"
        },
        {
            "barcode": "171129593",
            "dpc": "03010613801",
            "name": "សុខ សំអឿន"
        },
        {
            "barcode": "171129594",
            "dpc": "03010613701",
            "name": "វ៉ន សុវណ្ណ"
        },
        {
            "barcode": "171129595",
            "dpc": "03010614001",
            "name": "សាំង ប៊ុនថេន"
        },
        {
            "barcode": "171129596",
            "dpc": "03010613601",
            "name": "ដូង សំលេង"
        },
        {
            "barcode": "171129597",
            "dpc": "03010606001",
            "name": "សេង  ណៃ"
        },
        {
            "barcode": "171129598",
            "dpc": "03010602901",
            "name": "ឯម ទីណា"
        },
        {
            "barcode": "171129599",
            "dpc": "03010602801",
            "name": "នូ វណ្ណៈ"
        },
        {
            "barcode": "171129600",
            "dpc": "03010602601",
            "name": "ទូច សាវី"
        },
        {
            "barcode": "171129601",
            "dpc": "03010602501",
            "name": "ម៉ម សុខាល័យ"
        },
        {
            "barcode": "171129602",
            "dpc": "03010602401",
            "name": "អរ រ៉ាន់"
        },
        {
            "barcode": "171129603",
            "dpc": "03010602201",
            "name": "គុយ សារៀន"
        },
        {
            "barcode": "171129604",
            "dpc": "03010602301",
            "name": "គុយ សារ៉េត"
        },
        {
            "barcode": "171129605",
            "dpc": "03010602101",
            "name": "ចាន់ យ៉ា"
        },
        {
            "barcode": "171129606",
            "dpc": "03010602001",
            "name": "ហ៊ុន ហៀន"
        },
        {
            "barcode": "171129607",
            "dpc": "03010601901",
            "name": "សៀក សាមឌី"
        },
        {
            "barcode": "171129608",
            "dpc": "03010601801",
            "name": "ជុំ មួន"
        },
        {
            "barcode": "171129609",
            "dpc": "03010601701",
            "name": "វ៉ា ផារិន"
        },
        {
            "barcode": "171129610",
            "dpc": "03010601501",
            "name": "ជួប សាប៉ុន"
        },
        {
            "barcode": "171129611",
            "dpc": "03010600601",
            "name": "ថុក កៀត"
        },
        {
            "barcode": "171129612",
            "dpc": "03010600201",
            "name": "សឺន  ដានី"
        },
        {
            "barcode": "171129613",
            "dpc": "03010600501",
            "name": "ផាន់ លក្ខិណា"
        },
        {
            "barcode": "171129614",
            "dpc": "03010600101",
            "name": "ឈួយ វង"
        },
        {
            "barcode": "171129615",
            "dpc": "03010601101",
            "name": "ហេង ឌីណា"
        },
        {
            "barcode": "171129616",
            "dpc": "03010600301",
            "name": "វៀង ជា"
        },
        {
            "barcode": "171129617",
            "dpc": "03010600801",
            "name": "ខឹម តាន់"
        },
        {
            "barcode": "171129618",
            "dpc": "03010601401",
            "name": "ប៉ោ លក្ខិណា"
        },
        {
            "barcode": "171129619",
            "dpc": "03010600901",
            "name": "ហួង ម៉ានី"
        },
        {
            "barcode": "171129620",
            "dpc": "03010601001",
            "name": "ឃួន យាន"
        },
        {
            "barcode": "171129621",
            "dpc": "03010601201",
            "name": "ថាប់ ជួយ"
        },
        {
            "barcode": "171129622",
            "dpc": "03010603001",
            "name": "ប៉ូ  យឿន"
        },
        {
            "barcode": "171129623",
            "dpc": "03010600401",
            "name": "ស៊ុន យ៉ន"
        },
        {
            "barcode": "171129624",
            "dpc": "03010601601",
            "name": "កឺ  ស៊ុន"
        },
        {
            "barcode": "171129625",
            "dpc": "03010603401",
            "name": "សី សាខន"
        },
        {
            "barcode": "171129626",
            "dpc": "03010603501",
            "name": "ឆេង ហាប់"
        },
        {
            "barcode": "171129627",
            "dpc": "03010603601",
            "name": "ម៉ក មឿន"
        },
        {
            "barcode": "171129628",
            "dpc": "03010603701",
            "name": "ដន បាន"
        },
        {
            "barcode": "171129629",
            "dpc": "03010603801",
            "name": "សំ ពៅ"
        },
        {
            "barcode": "171129630",
            "dpc": "03010603901",
            "name": "តូច សូភី"
        },
        {
            "barcode": "171129631",
            "dpc": "03010604001",
            "name": "វ៉ាន់ ដាលីន"
        },
        {
            "barcode": "171129632",
            "dpc": "03010604101",
            "name": "សើ សាម៉េត"
        },
        {
            "barcode": "171129633",
            "dpc": "03010604201",
            "name": "ហា ជា"
        },
        {
            "barcode": "171129634",
            "dpc": "03010604301",
            "name": "ជុំ សុឃីម"
        },
        {
            "barcode": "171129635",
            "dpc": "03010604501",
            "name": "រ៉ូត រើន"
        },
        {
            "barcode": "171129636",
            "dpc": "03010604901",
            "name": "នាង សុខា"
        },
        {
            "barcode": "171129637",
            "dpc": "03010605001",
            "name": "ពុធ ឆេង"
        },
        {
            "barcode": "171129638",
            "dpc": "03010610201",
            "name": "រិន  មុន្នីវណ្ណ"
        },
        {
            "barcode": "171129639",
            "dpc": "03010610401",
            "name": "ជិវ  គឹមសាន"
        },
        {
            "barcode": "171129640",
            "dpc": "03010610001",
            "name": "ញ៉ាន គឹមនឿន"
        },
        {
            "barcode": "171129641",
            "dpc": "03010609901",
            "name": "ភាជ សំពណ៌"
        },
        {
            "barcode": "171129642",
            "dpc": "03010610601",
            "name": "ម៉ា សារុំ"
        },
        {
            "barcode": "171129643",
            "dpc": "03010608701",
            "name": "ឆោម ស៊ីម"
        },
        {
            "barcode": "171129644",
            "dpc": "03010608801",
            "name": "ផល រ៉ុម"
        },
        {
            "barcode": "171129645",
            "dpc": "03010608601",
            "name": "ទេព ម៉េងសួ"
        },
        {
            "barcode": "171129646",
            "dpc": "03010608401",
            "name": "ម៉ន សាវុន"
        },
        {
            "barcode": "171129647",
            "dpc": "03010608501",
            "name": "ផុន ដារ៉ារដ្ឋ"
        },
        {
            "barcode": "171129648",
            "dpc": "03010607401",
            "name": "ឈឿន សោ"
        },
        {
            "barcode": "171129649",
            "dpc": "03010607201",
            "name": "វ៉ាយ  យ៉ឹង"
        },
        {
            "barcode": "171129650",
            "dpc": "03010641901",
            "name": "កង់  ចានី"
        },
        {
            "barcode": "171129651",
            "dpc": "03010642001",
            "name": "ស្រី  ចំរើន"
        },
        {
            "barcode": "171129652",
            "dpc": "03010642701",
            "name": "កាក់ សុម៉ាលី"
        },
        {
            "barcode": "171129653",
            "dpc": "03010641701",
            "name": "ទិត  ដា"
        },
        {
            "barcode": "171129654",
            "dpc": "03010641601",
            "name": "ផេង   សាលី"
        },
        {
            "barcode": "171129655",
            "dpc": "03010641501",
            "name": "អ៊ុន  ពៅស័កញ្ញា"
        },
        {
            "barcode": "171129656",
            "dpc": "03010642201",
            "name": "នាង  សារ៉ាត់"
        },
        {
            "barcode": "171129657",
            "dpc": "03010642101",
            "name": "អ៊ាន  ហាក់លី"
        },
        {
            "barcode": "171129658",
            "dpc": "03010640601",
            "name": "ធីម ហូរ"
        },
        {
            "barcode": "171129659",
            "dpc": "03010640701",
            "name": "វុធ សុផល"
        },
        {
            "barcode": "171129660",
            "dpc": "03010641001",
            "name": "ងួន ពៅចិន្តា"
        },
        {
            "barcode": "171129661",
            "dpc": "03010642801",
            "name": "ទូច ស្រីអូន"
        },
        {
            "barcode": "171129662",
            "dpc": "03010642401",
            "name": "សុខ យ៉ា"
        },
        {
            "barcode": "171129663",
            "dpc": "03010642601",
            "name": "ឌុក  ដារ៉ារិទ្ធ"
        },
        {
            "barcode": "171129664",
            "dpc": "03010643001",
            "name": "អៀង យ៉ានិត"
        },
        {
            "barcode": "171129665",
            "dpc": "03010642901",
            "name": "កាន ចោម"
        },
        {
            "barcode": "171129666",
            "dpc": "03010642301",
            "name": "ពេជ្រ ចន្ថា"
        },
        {
            "barcode": "171129667",
            "dpc": "03010641201",
            "name": "ឌា សឿម"
        },
        {
            "barcode": "171129668",
            "dpc": "03010638501",
            "name": "គឹម ហ៊ុន"
        },
        {
            "barcode": "171129669",
            "dpc": "03010638801",
            "name": "ព្រះវិហារជីវិតថ្មី"
        },
        {
            "barcode": "171129670",
            "dpc": "03010638901",
            "name": "ជេត  ណាត"
        },
        {
            "barcode": "171129671",
            "dpc": "03010639001",
            "name": "តាំង ឡៃ"
        },
        {
            "barcode": "171129672",
            "dpc": "03010637401",
            "name": "ឈួន  ចាន់ដាវី"
        },
        {
            "barcode": "171129673",
            "dpc": "03010638301",
            "name": "យាប់  មេត្តា"
        },
        {
            "barcode": "171129674",
            "dpc": "03010641401",
            "name": "ហែម  ចន្ធី"
        },
        {
            "barcode": "171129675",
            "dpc": "03010642501",
            "name": "ធៀម  នន"
        },
        {
            "barcode": "171129676",
            "dpc": "03010605501",
            "name": "អ៊ុន  សំអាត"
        },
        {
            "barcode": "171129677",
            "dpc": "03010611701",
            "name": "រីក  សុវណ្ណ"
        },
        {
            "barcode": "171129678",
            "dpc": "03010619501",
            "name": "ឡាំ  យាំង"
        },
        {
            "barcode": "171129679",
            "dpc": "03010622701",
            "name": "ណូ"
        },
        {
            "barcode": "171129680",
            "dpc": "03010628301",
            "name": "ប៊ុត  ទឺ"
        },
        {
            "barcode": "171129681",
            "dpc": "03010631201",
            "name": "វត្ត  បច្ឆា"
        },
        {
            "barcode": "171129682",
            "dpc": "03010631501",
            "name": "តុង  សុគុណ"
        },
        {
            "barcode": "171129683",
            "dpc": "03010631701",
            "name": "យូ  គឹមសេង"
        },
        {
            "barcode": "171129684",
            "dpc": "03010631901",
            "name": "គង់  សុលី"
        },
        {
            "barcode": "171129685",
            "dpc": "03010634001",
            "name": "កង  សុវណ្ណ"
        },
        {
            "barcode": "171129686",
            "dpc": "03010640801",
            "name": "ដាង  សុភា"
        },
        {
            "barcode": "171129687",
            "dpc": "03010640901",
            "name": "ម៉ី  សុផាន់ណារ៉ុង"
        },
        {
            "barcode": "171129688",
            "dpc": "03010647301",
            "name": "កេត ចាន់អូន"
        },
        {
            "barcode": "171129689",
            "dpc": "03010647401",
            "name": "ម៉ាង សុទ្ធ ២"
        },
        {
            "barcode": "171129690",
            "dpc": "03010647601",
            "name": "ប្រុក គឿន ២"
        },
        {
            "barcode": "171129691",
            "dpc": "03010647901",
            "name": "សូម សារ៉ាន់"
        },
        {
            "barcode": "171129692",
            "dpc": "03010647701",
            "name": "សាំង  ស៊ីណា"
        },
        {
            "barcode": "171129693",
            "dpc": "03010606501",
            "name": "សាត គឹមសាន្ត"
        },
        {
            "barcode": "171129694",
            "dpc": "03010606601",
            "name": "ទូច ស៊ីផាន់"
        },
        {
            "barcode": "171129695",
            "dpc": "03010606801",
            "name": "កែវ សេង"
        },
        {
            "barcode": "171129696",
            "dpc": "03010606901",
            "name": "លឹម សុភាព"
        },
        {
            "barcode": "171129697",
            "dpc": "03010607001",
            "name": "ធៀន ឡំ"
        },
        {
            "barcode": "171129698",
            "dpc": "03010646701",
            "name": "ពុល  សាង"
        },
        {
            "barcode": "171129699",
            "dpc": "03010646801",
            "name": "មួង ស៊ីផាន់"
        },
        {
            "barcode": "171129700",
            "dpc": "03010646901",
            "name": "ប៉ុក ប៊ុនធឿន"
        },
        {
            "barcode": "171129701",
            "dpc": "03010647001",
            "name": "អន សំអាត"
        },
        {
            "barcode": "171129702",
            "dpc": "03010647101",
            "name": "អ៊ូ សឿត"
        },
        {
            "barcode": "171129703",
            "dpc": "03010647201",
            "name": "សឿន ស៊ាត"
        },
        {
            "barcode": "171129704",
            "dpc": "03010606101",
            "name": "គឹម ម៉ារា"
        },
        {
            "barcode": "171129705",
            "dpc": "03010606201",
            "name": "ម៉ាច  មុយ"
        },
        {
            "barcode": "171129706",
            "dpc": "03010606401",
            "name": "អ៊ឹង ទឹត"
        },
        {
            "barcode": "171129707",
            "dpc": "03010604401",
            "name": "ដាន់  វុទ្ធី"
        },
        {
            "barcode": "171129708",
            "dpc": "03010604601",
            "name": "ថាញ់  យឿន"
        },
        {
            "barcode": "171129709",
            "dpc": "03010604701",
            "name": "ឡាំ   វ៉ាន់"
        },
        {
            "barcode": "171129710",
            "dpc": "03010604801",
            "name": "ណាំ  មុំ"
        },
        {
            "barcode": "171129711",
            "dpc": "03010607101",
            "name": "មណ្ឌលកុមារកំព្រា"
        },
        {
            "barcode": "171129712",
            "dpc": "03010648001",
            "name": "ផុន ស៊ីផាន"
        }
    ]
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
