let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171119551",
            "dpc": "03020842501",
            "name": "រ៉ើន ស៊ិនណារ៉ុង"
        },
        {
            "barcode": "171119552",
            "dpc": "03020842601",
            "name": "លី ឈៀងហោ"
        },
        {
            "barcode": "171119553",
            "dpc": "03020842701",
            "name": "ប៉ោ លី"
        },
        {
            "barcode": "171119554",
            "dpc": "03020842801",
            "name": "ឃុន ជឿន"
        },
        {
            "barcode": "171119555",
            "dpc": "03020842901",
            "name": "ខ្លួត ពិសិទ្ធ"
        },
        {
            "barcode": "171119556",
            "dpc": "03020800101",
            "name": "ជ័យ រិទ្ធី"
        },
        {
            "barcode": "171119557",
            "dpc": "03020843201",
            "name": "អ៊ុំ ប៊ុនធី"
        },
        {
            "barcode": "171119558",
            "dpc": "03020843301",
            "name": "ទួក ឌិន"
        },
        {
            "barcode": "171119559",
            "dpc": "03020800401",
            "name": "ស៊ុន សេន"
        },
        {
            "barcode": "171119560",
            "dpc": "03020843101",
            "name": "ម៉ា ចិន្តា"
        },
        {
            "barcode": "171119561",
            "dpc": "03020800201",
            "name": "ញឹម សារិន"
        },
        {
            "barcode": "171119562",
            "dpc": "03020800301",
            "name": "ម៉ិល សុខា"
        },
        {
            "barcode": "171119563",
            "dpc": "03020800501",
            "name": "បែន សំណាង"
        },
        {
            "barcode": "171119564",
            "dpc": "03020800601",
            "name": "អ៊ុក ថែ"
        },
        {
            "barcode": "171119565",
            "dpc": "03020800701",
            "name": "មឿន ភឿន"
        },
        {
            "barcode": "171119566",
            "dpc": "03020800801",
            "name": "ម៉ា សុខា"
        },
        {
            "barcode": "171119567",
            "dpc": "03020843401",
            "name": "កែវ វុទ្ធី"
        },
        {
            "barcode": "171119568",
            "dpc": "03020843501",
            "name": "ងី ផេង"
        },
        {
            "barcode": "171119569",
            "dpc": "03020843601",
            "name": "សុខ ថា"
        },
        {
            "barcode": "171119570",
            "dpc": "03020843701",
            "name": "អ៊ុក ធឹម"
        },
        {
            "barcode": "171119571",
            "dpc": "03020843801",
            "name": "គុយ ងី"
        },
        {
            "barcode": "171119572",
            "dpc": "03020843901",
            "name": "តាំង សុង"
        },
        {
            "barcode": "171119573",
            "dpc": "03020844001",
            "name": "អ៊ឹង ថន"
        },
        {
            "barcode": "171119574",
            "dpc": "03020844101",
            "name": "ប៊ុន ឡុង"
        },
        {
            "barcode": "171119575",
            "dpc": "03020844201",
            "name": "ឌិន ប្រង់"
        },
        {
            "barcode": "171119576",
            "dpc": "03020844301",
            "name": "រស់ ផល"
        },
        {
            "barcode": "171119577",
            "dpc": "03020844401",
            "name": "សួន ស៊ុនហាក់"
        },
        {
            "barcode": "171119578",
            "dpc": "03020844501",
            "name": "សេង ឆាង"
        },
        {
            "barcode": "171119579",
            "dpc": "03020844601",
            "name": "ហេង គីមហុង"
        },
        {
            "barcode": "171119580",
            "dpc": "03020844701",
            "name": "មណ្ឌលសុខភាព"
        },
        {
            "barcode": "171119581",
            "dpc": "03020844801",
            "name": "ជ័រ ឃីម"
        },
        {
            "barcode": "171119582",
            "dpc": "03020844901",
            "name": "រស់ ចំរើន"
        },
        {
            "barcode": "171119583",
            "dpc": "03020845001",
            "name": "សុខ ឡាវ"
        },
        {
            "barcode": "171119584",
            "dpc": "03020801201",
            "name": "ទឹម ហាប់"
        },
        {
            "barcode": "171119585",
            "dpc": "03020801301",
            "name": "ទឹម សុធិន"
        },
        {
            "barcode": "171119586",
            "dpc": "03020801001",
            "name": "ញឹក សុគន្ធ"
        },
        {
            "barcode": "171119587",
            "dpc": "03020800901",
            "name": "ប៊ុន សុង"
        },
        {
            "barcode": "171119588",
            "dpc": "03020801401",
            "name": "ឥន ញ៉ែត"
        },
        {
            "barcode": "171119589",
            "dpc": "03020801701",
            "name": "យឹម សុវណ្ណី"
        },
        {
            "barcode": "171119590",
            "dpc": "03020801501",
            "name": "ចាន់ ធី"
        },
        {
            "barcode": "171119591",
            "dpc": "03020801601",
            "name": "ឈៀង ថុង"
        },
        {
            "barcode": "171119592",
            "dpc": "03020801801",
            "name": "លឹម គីមអ៊ី"
        },
        {
            "barcode": "171119593",
            "dpc": "03020802001",
            "name": "នូវ រុន"
        },
        {
            "barcode": "171119594",
            "dpc": "03020802101",
            "name": "ឌុក វ៉ាន់ថា"
        },
        {
            "barcode": "171119595",
            "dpc": "03020802401",
            "name": "ពុធ ហេង"
        },
        {
            "barcode": "171119596",
            "dpc": "03020841301",
            "name": "ដុស សារ៉ាត់"
        },
        {
            "barcode": "171119597",
            "dpc": "03020841101",
            "name": "គុយ ម៉េង"
        },
        {
            "barcode": "171119598",
            "dpc": "03020841401",
            "name": "ឌុល សុភី"
        },
        {
            "barcode": "171119599",
            "dpc": "03020841201",
            "name": "យឿន ប៊ុនណារ៉ា"
        },
        {
            "barcode": "171119600",
            "dpc": "03020841501",
            "name": "ហេង វាសនា"
        },
        {
            "barcode": "171119601",
            "dpc": "03020841601",
            "name": "អ៊ារ សុភ័ក្រ"
        },
        {
            "barcode": "171119602",
            "dpc": "03020841701",
            "name": "វ៉ាន់ សាវើយ"
        },
        {
            "barcode": "171119603",
            "dpc": "03020841801",
            "name": "ហាក់ ហ៊ុយ"
        },
        {
            "barcode": "171119604",
            "dpc": "03020841901",
            "name": "ដុស វណ្ណា"
        },
        {
            "barcode": "171119605",
            "dpc": "03020842101",
            "name": "វ៉ាយ សារ ២"
        },
        {
            "barcode": "171119606",
            "dpc": "03020842201",
            "name": "ពេជ្រ ចំរើន"
        },
        {
            "barcode": "171119607",
            "dpc": "03020842301",
            "name": "ព្រំ សុខុម"
        },
        {
            "barcode": "171119608",
            "dpc": "03020842401",
            "name": "ប៊ុន សាវុធ"
        },
        {
            "barcode": "171119609",
            "dpc": "03020802301",
            "name": "ប៊ុន ប៉ាក់"
        },
        {
            "barcode": "171119610",
            "dpc": "03020802201",
            "name": "សេង លៀប"
        },
        {
            "barcode": "171119611",
            "dpc": "03020802501",
            "name": "នាក់ចាន់ ថន"
        },
        {
            "barcode": "171119612",
            "dpc": "03020802701",
            "name": "រ៉ឹម សុគន្ធ"
        },
        {
            "barcode": "171119613",
            "dpc": "03020802801",
            "name": "រឹម សារឿត"
        },
        {
            "barcode": "171119614",
            "dpc": "03020803001",
            "name": "ពៅ បូរិន"
        },
        {
            "barcode": "171119615",
            "dpc": "03020803101",
            "name": "រស់ ចំរើន"
        },
        {
            "barcode": "171119616",
            "dpc": "03020803201",
            "name": "ម៉ក់ ហន"
        },
        {
            "barcode": "171119617",
            "dpc": "03020803301",
            "name": "ឃ្លោក សំបូរ"
        },
        {
            "barcode": "171119618",
            "dpc": "03020803401",
            "name": "យ៉ាង សៀវសេង"
        },
        {
            "barcode": "171119619",
            "dpc": "03020803501",
            "name": "ស៊ុន សុភី"
        },
        {
            "barcode": "171119620",
            "dpc": "03020803601",
            "name": "ឈឹម វុត្ថា"
        },
        {
            "barcode": "171119621",
            "dpc": "03020803701",
            "name": "លាភ​ ឈន់"
        },
        {
            "barcode": "171119622",
            "dpc": "03020803801",
            "name": "ម៉ៅ ប៊ុនធឿន"
        },
        {
            "barcode": "171119623",
            "dpc": "03020840601",
            "name": "សែម សោភា"
        },
        {
            "barcode": "171119624",
            "dpc": "03020818901",
            "name": "នូ កង"
        },
        {
            "barcode": "171119625",
            "dpc": "03020817401",
            "name": "វិន សាំ"
        },
        {
            "barcode": "171119626",
            "dpc": "03020818101",
            "name": "ហម សីណា"
        },
        {
            "barcode": "171119627",
            "dpc": "03020836001",
            "name": "ឆូយ លាងគីម"
        },
        {
            "barcode": "171119628",
            "dpc": "03020836101",
            "name": "ហេង ហុង"
        },
        {
            "barcode": "171119629",
            "dpc": "03020836301",
            "name": "លីវ គៀត"
        },
        {
            "barcode": "171119630",
            "dpc": "03020836201",
            "name": "ជាង ពៅ"
        },
        {
            "barcode": "171119631",
            "dpc": "03020836401",
            "name": "សុក ទុយ"
        },
        {
            "barcode": "171119632",
            "dpc": "03020836501",
            "name": "សៀង តិច"
        },
        {
            "barcode": "171119633",
            "dpc": "03020836601",
            "name": "តាំង សារ"
        },
        {
            "barcode": "171119634",
            "dpc": "03020836901",
            "name": "ជូរ ហេង"
        },
        {
            "barcode": "171119635",
            "dpc": "03020837001",
            "name": "លី ស៊ីវចេង"
        },
        {
            "barcode": "171119636",
            "dpc": "03020837201",
            "name": "អៀម ពៅ"
        },
        {
            "barcode": "171119637",
            "dpc": "03020837501",
            "name": "ពេជ្រ ដារ៉ុង"
        },
        {
            "barcode": "171119638",
            "dpc": "03020837601",
            "name": "ជា ប៉ុង"
        },
        {
            "barcode": "171119639",
            "dpc": "03020837701",
            "name": "ញ៉ែម ពិសិទ្ធ"
        },
        {
            "barcode": "171119640",
            "dpc": "03020837801",
            "name": "ខ្លូត ណារ៉ុង"
        },
        {
            "barcode": "171119641",
            "dpc": "03020837901",
            "name": "សាន ថាន"
        },
        {
            "barcode": "171119642",
            "dpc": "03020838001",
            "name": "ម៉ែន សុធៃ"
        },
        {
            "barcode": "171119643",
            "dpc": "03020838101",
            "name": "កែវ ផៃសាន"
        },
        {
            "barcode": "171119644",
            "dpc": "03020838201",
            "name": "ញឹក សុវត្តិ"
        },
        {
            "barcode": "171119645",
            "dpc": "03020838301",
            "name": "ញឹក សុវណ្ណ"
        },
        {
            "barcode": "171119646",
            "dpc": "03020838501",
            "name": "ពៅ ពិសិទ្ធ"
        },
        {
            "barcode": "171119647",
            "dpc": "03020838601",
            "name": "ឈុន ខេង"
        },
        {
            "barcode": "171119648",
            "dpc": "03020838801",
            "name": "ភឹម គឹមលន់"
        },
        {
            "barcode": "171119649",
            "dpc": "03020837301",
            "name": "ចៅ គីមយ៉េន"
        },
        {
            "barcode": "171119650",
            "dpc": "03020837401",
            "name": "ទៀង រតនា"
        },
        {
            "barcode": "171119651",
            "dpc": "03020838901",
            "name": "គុយ ហ៊ី ១"
        },
        {
            "barcode": "171119652",
            "dpc": "03020839001",
            "name": "គុយ ហ៊ី ២"
        },
        {
            "barcode": "171119653",
            "dpc": "03020839601",
            "name": "ចាន ខេមរៈ"
        },
        {
            "barcode": "171119654",
            "dpc": "03020839501",
            "name": "ហេង លី"
        },
        {
            "barcode": "171119655",
            "dpc": "03020839401",
            "name": "ឡាយ គុណ"
        },
        {
            "barcode": "171119656",
            "dpc": "03020839301",
            "name": "ឡាច ហៀក"
        },
        {
            "barcode": "171119657",
            "dpc": "03020839101",
            "name": "សម សុខា"
        },
        {
            "barcode": "171119658",
            "dpc": "03020839701",
            "name": "ប្រាក់ ធី"
        },
        {
            "barcode": "171119659",
            "dpc": "03020839901",
            "name": "ពិន ចាន់ថន"
        },
        {
            "barcode": "171119660",
            "dpc": "03020840001",
            "name": "លន់ ញឹក"
        },
        {
            "barcode": "171119661",
            "dpc": "03020840101",
            "name": "ហ៊ុន ណៃ"
        },
        {
            "barcode": "171119662",
            "dpc": "03020840201",
            "name": "តាំង សុថា"
        },
        {
            "barcode": "171119663",
            "dpc": "03020840301",
            "name": "សួន សំណាង"
        },
        {
            "barcode": "171119664",
            "dpc": "03020841001",
            "name": "គឹម ដេត"
        },
        {
            "barcode": "171119665",
            "dpc": "03020840901",
            "name": "ង៉ោ ច្រុង"
        },
        {
            "barcode": "171119666",
            "dpc": "03020840801",
            "name": "ម៉េង លាង"
        },
        {
            "barcode": "171119667",
            "dpc": "03020840701",
            "name": "ឡាំ ហ៊ុល"
        },
        {
            "barcode": "171119668",
            "dpc": "03020840401",
            "name": "ហេង ថេងហៀង"
        },
        {
            "barcode": "171119669",
            "dpc": "03020803901",
            "name": "យឹម ឆេង"
        },
        {
            "barcode": "171119670",
            "dpc": "03020804201",
            "name": "រ៉ែ យ៉ា"
        },
        {
            "barcode": "171119671",
            "dpc": "03020804301",
            "name": "ណម បាន់នូ"
        },
        {
            "barcode": "171119672",
            "dpc": "03020804401",
            "name": "ជិន ធៀម"
        },
        {
            "barcode": "171119673",
            "dpc": "03020804501",
            "name": "លន់ ឈន"
        },
        {
            "barcode": "171119674",
            "dpc": "03020804001",
            "name": "ហន ណន"
        },
        {
            "barcode": "171119675",
            "dpc": "03020815501",
            "name": "កេង សុខម៉េង"
        },
        {
            "barcode": "171119676",
            "dpc": "03020804601",
            "name": "អ៊ឹង អ៊ាម"
        },
        {
            "barcode": "171119677",
            "dpc": "03020804701",
            "name": "អ៊ាម ទី"
        },
        {
            "barcode": "171119678",
            "dpc": "03020804801",
            "name": "អៀម ប៊ិន"
        },
        {
            "barcode": "171119679",
            "dpc": "03020804901",
            "name": "ប៊ុន ស្រេង"
        },
        {
            "barcode": "171119680",
            "dpc": "03020805001",
            "name": "ស៊ុន ផាន់ណា"
        },
        {
            "barcode": "171119681",
            "dpc": "03020805101",
            "name": "ទិត ឡា"
        },
        {
            "barcode": "171119682",
            "dpc": "03020805201",
            "name": "ជៀវ សានណាវី"
        },
        {
            "barcode": "171119683",
            "dpc": "03020805501",
            "name": "ចែ ទូច"
        },
        {
            "barcode": "171119684",
            "dpc": "03020806001",
            "name": "អ៊ឹម អ៊ីវ"
        },
        {
            "barcode": "171119685",
            "dpc": "03020805701",
            "name": "លុក ចន្ថា"
        },
        {
            "barcode": "171119686",
            "dpc": "03020805601",
            "name": "អ៊ឹម ហួរ"
        },
        {
            "barcode": "171119687",
            "dpc": "03020806101",
            "name": "ង៉ក់ ធីង"
        },
        {
            "barcode": "171119688",
            "dpc": "03020806201",
            "name": "អ៊ិម ហួត"
        },
        {
            "barcode": "171119689",
            "dpc": "03020806301",
            "name": "ណៃ ស៊ាន"
        },
        {
            "barcode": "171119690",
            "dpc": "03020806401",
            "name": "សេង ទុន"
        },
        {
            "barcode": "171119691",
            "dpc": "03020806501",
            "name": "សាញ់ សុង"
        },
        {
            "barcode": "171119692",
            "dpc": "03020806601",
            "name": "ហ៊ីង ណៃស៊ាន"
        },
        {
            "barcode": "171119693",
            "dpc": "03020806701",
            "name": "សាំង ហយ"
        },
        {
            "barcode": "171119694",
            "dpc": "03020806801",
            "name": "អ៊ឹម ថាវរី"
        },
        {
            "barcode": "171119695",
            "dpc": "03020806901",
            "name": "អៀត វុទ្ធី"
        },
        {
            "barcode": "171119696",
            "dpc": "03020807001",
            "name": "ហ៊ុន លក្ខិណា"
        },
        {
            "barcode": "171119697",
            "dpc": "03020807101",
            "name": "អោម សុថារី"
        },
        {
            "barcode": "171119698",
            "dpc": "03020807201",
            "name": "យឹម អៀនគីម"
        },
        {
            "barcode": "171119699",
            "dpc": "03020828101",
            "name": "សាយ ហុង"
        },
        {
            "barcode": "171119700",
            "dpc": "03020828001",
            "name": "ប៉ែន សាលី"
        },
        {
            "barcode": "171119701",
            "dpc": "03020829301",
            "name": "កូ គួយហួង"
        },
        {
            "barcode": "171119702",
            "dpc": "03020828201",
            "name": "សុខ សូត្រ"
        },
        {
            "barcode": "171119703",
            "dpc": "03020829201",
            "name": "ស៊ុន តឹក"
        },
        {
            "barcode": "171119704",
            "dpc": "03020829101",
            "name": "ហ៊ុន ហ៊ីម"
        },
        {
            "barcode": "171119705",
            "dpc": "03020829001",
            "name": "ក្លឹង នួន"
        },
        {
            "barcode": "171119706",
            "dpc": "03020828301",
            "name": "វ៉ៃ ប៊ិស"
        },
        {
            "barcode": "171119707",
            "dpc": "03020828401",
            "name": "សុខ ប៉ោយ"
        },
        {
            "barcode": "171119708",
            "dpc": "03020828501",
            "name": "វណ្ណ រតនា"
        },
        {
            "barcode": "171119709",
            "dpc": "03020828601",
            "name": "វឹង មុន្នី"
        },
        {
            "barcode": "171119710",
            "dpc": "03020828701",
            "name": "សុខ ចាន់រឿន"
        },
        {
            "barcode": "171119711",
            "dpc": "03020805801",
            "name": "សុខ ធារី"
        },
        {
            "barcode": "171119712",
            "dpc": "03020805901",
            "name": "លឹម អៀវណាំ ២"
        },
        {
            "barcode": "171119713",
            "dpc": "03020828801",
            "name": "ទិត្យ អ៊ឹង"
        },
        {
            "barcode": "171119714",
            "dpc": "03020836801",
            "name": "គឹម ឆាយ"
        },
        {
            "barcode": "171119715",
            "dpc": "03020836701",
            "name": "តាំង យី ៣"
        },
        {
            "barcode": "171119716",
            "dpc": "03020827701",
            "name": "ឡេង វួច"
        },
        {
            "barcode": "171119717",
            "dpc": "03020827801",
            "name": "នេត មុំ"
        },
        {
            "barcode": "171119718",
            "dpc": "03020827901",
            "name": "ចាន់ សោភា"
        },
        {
            "barcode": "171119719",
            "dpc": "03020807401",
            "name": "ប៉ាវ សាំងហេង"
        },
        {
            "barcode": "171119720",
            "dpc": "03020807501",
            "name": "សុខ សាមិត្ត"
        },
        {
            "barcode": "171119721",
            "dpc": "03020809101",
            "name": "ផន សុផាត"
        },
        {
            "barcode": "171119722",
            "dpc": "03020807801",
            "name": "គុណ ស្រុន"
        },
        {
            "barcode": "171119723",
            "dpc": "03020808001",
            "name": "សិត អេងផល"
        },
        {
            "barcode": "171119724",
            "dpc": "03020808101",
            "name": "លួន សុខនី"
        },
        {
            "barcode": "171119725",
            "dpc": "03020808201",
            "name": "សុន ទ្រី"
        },
        {
            "barcode": "171119726",
            "dpc": "03020808301",
            "name": "ហង់ ខន"
        },
        {
            "barcode": "171119727",
            "dpc": "03020808401",
            "name": "ជា ពៅ"
        },
        {
            "barcode": "171119728",
            "dpc": "03020807901",
            "name": "សៀង គង់ហេង"
        },
        {
            "barcode": "171119729",
            "dpc": "03020808501",
            "name": "ស៊ិន ឈុត"
        },
        {
            "barcode": "171119730",
            "dpc": "03020808601",
            "name": "ខឹម សេង"
        },
        {
            "barcode": "171119731",
            "dpc": "03020808701",
            "name": "វ៉ែន សាយ"
        },
        {
            "barcode": "171119732",
            "dpc": "03020808801",
            "name": "សួន ចន្ថា"
        },
        {
            "barcode": "171119733",
            "dpc": "03020808901",
            "name": "ព្រុំ សារឿន"
        },
        {
            "barcode": "171119734",
            "dpc": "03020809001",
            "name": "អាង ទូច"
        },
        {
            "barcode": "171119735",
            "dpc": "03020809201",
            "name": "ឈឹម យ៉ុង"
        },
        {
            "barcode": "171119736",
            "dpc": "03020809301",
            "name": "កាញ់ សូយ"
        },
        {
            "barcode": "171119737",
            "dpc": "03020809401",
            "name": "គង់ វណ្ណា"
        },
        {
            "barcode": "171119738",
            "dpc": "03020825601",
            "name": "គឹម ឡាង"
        },
        {
            "barcode": "171119739",
            "dpc": "03020825701",
            "name": "គឹម សារ៉ាន់"
        },
        {
            "barcode": "171119740",
            "dpc": "03020825801",
            "name": "ហាក់ ស៊ុនហេង"
        },
        {
            "barcode": "171119741",
            "dpc": "03020825901",
            "name": "ឃុន ងួន១"
        },
        {
            "barcode": "171119742",
            "dpc": "03020831301",
            "name": "ឃួន ងួន"
        },
        {
            "barcode": "171119743",
            "dpc": "03020826001",
            "name": "ជៀប ណារ៉ុង"
        },
        {
            "barcode": "171119744",
            "dpc": "03020826101",
            "name": "កាំង ហុក ២"
        },
        {
            "barcode": "171119745",
            "dpc": "03020831501",
            "name": "ទូច ញ៉ុល"
        },
        {
            "barcode": "171119746",
            "dpc": "03020826201",
            "name": "កុយ អៀង"
        },
        {
            "barcode": "171119747",
            "dpc": "03020826301",
            "name": "ងិន ចេង"
        },
        {
            "barcode": "171119748",
            "dpc": "03020826401",
            "name": "សៅ ទី"
        },
        {
            "barcode": "171119749",
            "dpc": "03020826501",
            "name": "លឿង ស្រីនិត"
        },
        {
            "barcode": "171119750",
            "dpc": "03020826601",
            "name": "ជុំ ពិទ័ក្ក"
        },
        {
            "barcode": "171119751",
            "dpc": "03020826701",
            "name": "កាំ ហុក ១"
        },
        {
            "barcode": "171119752",
            "dpc": "03020826801",
            "name": "លឹម ផល"
        },
        {
            "barcode": "171119753",
            "dpc": "03020826901",
            "name": "ណុប សាមិ"
        },
        {
            "barcode": "171119754",
            "dpc": "03020827001",
            "name": "ហ៊ុន យឿន"
        },
        {
            "barcode": "171119755",
            "dpc": "03020827101",
            "name": "ត្រិញ សុង"
        },
        {
            "barcode": "171119756",
            "dpc": "03020827301",
            "name": "ចាន់ សារឿន"
        },
        {
            "barcode": "171119757",
            "dpc": "03020827401",
            "name": "ឡោ ស្រេង"
        },
        {
            "barcode": "171119758",
            "dpc": "03020827501",
            "name": "ម៉ៅ ឃុន"
        },
        {
            "barcode": "171119759",
            "dpc": "03020829401",
            "name": "ម៉ឹន វិបុល"
        },
        {
            "barcode": "171119760",
            "dpc": "03020835901",
            "name": "ឡុង គីមហេង"
        },
        {
            "barcode": "171119761",
            "dpc": "03020835801",
            "name": "ជី ឆាយ"
        },
        {
            "barcode": "171119762",
            "dpc": "03020835701",
            "name": "ថន សឿម"
        },
        {
            "barcode": "171119763",
            "dpc": "03020835601",
            "name": "ហុង ហ៊ុលឡេង់"
        },
        {
            "barcode": "171119764",
            "dpc": "03020835501",
            "name": "ហួយ ខេង"
        },
        {
            "barcode": "171119765",
            "dpc": "03020835401",
            "name": "ង៉ូវ ថៃ"
        },
        {
            "barcode": "171119766",
            "dpc": "03020835301",
            "name": "សេង ប្រាង្គ"
        },
        {
            "barcode": "171119767",
            "dpc": "03020835201",
            "name": "សេង ផាត"
        },
        {
            "barcode": "171119768",
            "dpc": "03020835101",
            "name": "វិញ ហៃ"
        },
        {
            "barcode": "171119769",
            "dpc": "03020835001",
            "name": "សេដ្ឋ សាខា"
        },
        {
            "barcode": "171119770",
            "dpc": "03020834901",
            "name": "ស៊ីន ថា"
        },
        {
            "barcode": "171119771",
            "dpc": "03020834801",
            "name": "ឡៃ ឆេងវែង"
        },
        {
            "barcode": "171119772",
            "dpc": "03020834701",
            "name": "ផាន ទូច"
        },
        {
            "barcode": "171119773",
            "dpc": "03020834601",
            "name": "ង៉ូវ គីម"
        },
        {
            "barcode": "171119774",
            "dpc": "03020834501",
            "name": "ឈិត រ៉ែម"
        },
        {
            "barcode": "171119775",
            "dpc": "03020834401",
            "name": "យ៉ម ឆន"
        },
        {
            "barcode": "171119776",
            "dpc": "03020834201",
            "name": "អ៊ុក ផន"
        },
        {
            "barcode": "171119777",
            "dpc": "03020834301",
            "name": "ហាស់ ហ៊ន"
        },
        {
            "barcode": "171119778",
            "dpc": "03020834101",
            "name": "អ៊ុន សុខា"
        },
        {
            "barcode": "171119779",
            "dpc": "03020834001",
            "name": "ប៊ូ ប៉ិច"
        },
        {
            "barcode": "171119780",
            "dpc": "03020833901",
            "name": "ហេង ហាវ"
        },
        {
            "barcode": "171119781",
            "dpc": "03020833801",
            "name": "ហេង កង"
        },
        {
            "barcode": "171119782",
            "dpc": "03020833701",
            "name": "អ៊ុល ងឿប"
        },
        {
            "barcode": "171119783",
            "dpc": "03020833601",
            "name": "ជីប ណារ៉ុង"
        },
        {
            "barcode": "171119784",
            "dpc": "03020833501",
            "name": "កែវ នី"
        },
        {
            "barcode": "171119785",
            "dpc": "03020833401",
            "name": "ឈុត សោភ័ណ្ឌ"
        },
        {
            "barcode": "171119786",
            "dpc": "03020833301",
            "name": "សុខ ប៊ុនអៀង"
        },
        {
            "barcode": "171119787",
            "dpc": "03020833201",
            "name": "ហេង គង់"
        },
        {
            "barcode": "171119788",
            "dpc": "03020833101",
            "name": "អ៊ឹង សេង"
        },
        {
            "barcode": "171119789",
            "dpc": "03020833001",
            "name": "តេង ឈាង"
        },
        {
            "barcode": "171119790",
            "dpc": "03020832901",
            "name": "ដួង ដានី"
        },
        {
            "barcode": "171119791",
            "dpc": "03020832801",
            "name": "ខ្ចៅ សំកុល ១"
        },
        {
            "barcode": "171119792",
            "dpc": "03020832701",
            "name": "ហុង គា"
        },
        {
            "barcode": "171119793",
            "dpc": "03020832601",
            "name": "ប៊ុន ស្រេង"
        },
        {
            "barcode": "171119794",
            "dpc": "03020832501",
            "name": "តាំង ឈាងហួរ"
        },
        {
            "barcode": "171119795",
            "dpc": "03020832401",
            "name": "ម៉ុង ចាន់សារ៉េត"
        },
        {
            "barcode": "171119796",
            "dpc": "03020832201",
            "name": "ខាន់ ពៅ"
        },
        {
            "barcode": "171119797",
            "dpc": "03020832101",
            "name": "ខៀវ បូរ៉េត"
        },
        {
            "barcode": "171119798",
            "dpc": "03020832301",
            "name": "ខ្ចៅ សំកុល ២"
        },
        {
            "barcode": "171119799",
            "dpc": "03020832001",
            "name": "ដុស រីដេត"
        },
        {
            "barcode": "171119800",
            "dpc": "03020831901",
            "name": "ហែម អឿន"
        },
        {
            "barcode": "171119801",
            "dpc": "03020831801",
            "name": "សុខ ស៊ុយ"
        },
        {
            "barcode": "171119802",
            "dpc": "03020831201",
            "name": "លឹម គឹមឡាង"
        },
        {
            "barcode": "171119803",
            "dpc": "03020831101",
            "name": "អ៊ឹង ផិតទី"
        },
        {
            "barcode": "171119804",
            "dpc": "03020830901",
            "name": "ឈួន ឡេង"
        },
        {
            "barcode": "171119805",
            "dpc": "03020831001",
            "name": "លឿង ឆារ៉ា"
        },
        {
            "barcode": "171119806",
            "dpc": "03020830801",
            "name": "លី ឃួង"
        },
        {
            "barcode": "171119807",
            "dpc": "03020830701",
            "name": "សម ស៊ីណា"
        },
        {
            "barcode": "171119808",
            "dpc": "03020830601",
            "name": "យាន បូលី"
        },
        {
            "barcode": "171119809",
            "dpc": "03020830501",
            "name": "ស្រី នេ"
        },
        {
            "barcode": "171119810",
            "dpc": "03020830401",
            "name": "ប៉ែត សីហា"
        },
        {
            "barcode": "171119811",
            "dpc": "03020830301",
            "name": "ហ៊ិន គឹមហ៊តឌី"
        },
        {
            "barcode": "171119812",
            "dpc": "03020830201",
            "name": "សៀង ជៀកផេង"
        },
        {
            "barcode": "171119813",
            "dpc": "03020830101",
            "name": "ឆាយ ចាន់"
        },
        {
            "barcode": "171119814",
            "dpc": "03020829901",
            "name": "ញាណ សុផាត"
        },
        {
            "barcode": "171119815",
            "dpc": "03020829801",
            "name": "សុខ ធី"
        },
        {
            "barcode": "171119816",
            "dpc": "03020829701",
            "name": "ឈុន សុខ"
        },
        {
            "barcode": "171119817",
            "dpc": "03020829601",
            "name": "ជូ គង់"
        },
        {
            "barcode": "171119818",
            "dpc": "03020829501",
            "name": "អ៊ុក សុវណ្ណលី"
        },
        {
            "barcode": "171119819",
            "dpc": "03020813601",
            "name": "កែវ មនោ"
        },
        {
            "barcode": "171119820",
            "dpc": "03020846401",
            "name": "មួន ងិៈ"
        },
        {
            "barcode": "171119821",
            "dpc": "03020846501",
            "name": "ពេជ្រ ម៉ារី"
        },
        {
            "barcode": "171119822",
            "dpc": "03020846601",
            "name": "ឆាយ វ៉ាន់ឌី"
        },
        {
            "barcode": "171119823",
            "dpc": "03020846701",
            "name": "អោម ណាវី"
        },
        {
            "barcode": "171119824",
            "dpc": "03020846801",
            "name": "ញ៉េម ឈឿត"
        },
        {
            "barcode": "171119825",
            "dpc": "03020846901",
            "name": "សៀង ស៊ីណាត"
        },
        {
            "barcode": "171119826",
            "dpc": "03020847101",
            "name": "នែម វ៉ាន់"
        },
        {
            "barcode": "171119827",
            "dpc": "03020847201",
            "name": "ទឹម សារុំ"
        },
        {
            "barcode": "171119828",
            "dpc": "03020847301",
            "name": "ហម គឹមប៉ោ"
        },
        {
            "barcode": "171119829",
            "dpc": "03020847501",
            "name": "ទឹម វ៉ាន់រិទ្ធ"
        },
        {
            "barcode": "171119830",
            "dpc": "03020846201",
            "name": "សុខ លាង"
        },
        {
            "barcode": "171119831",
            "dpc": "03020846101",
            "name": "គុយ សត្យា"
        },
        {
            "barcode": "171119832",
            "dpc": "03020846001",
            "name": "សំ គង់"
        },
        {
            "barcode": "171119833",
            "dpc": "03020845301",
            "name": "នូ ឆវី"
        },
        {
            "barcode": "171119834",
            "dpc": "03020845201",
            "name": "នូ ឆាវ"
        },
        {
            "barcode": "171119835",
            "dpc": "03020847601",
            "name": "ឌឿម សាមុជ"
        },
        {
            "barcode": "171119836",
            "dpc": "03020847701",
            "name": "ណយ រ៉ាវុធ"
        },
        {
            "barcode": "171119837",
            "dpc": "03020847801",
            "name": "ដាំ ប៉ូលី"
        },
        {
            "barcode": "171119838",
            "dpc": "03020847901",
            "name": "គង់ សំអាត"
        },
        {
            "barcode": "171119839",
            "dpc": "03020817201",
            "name": "សេង សាវដា"
        },
        {
            "barcode": "171119840",
            "dpc": "03020817301",
            "name": "ប៊ុន សេងហ៊ាង"
        },
        {
            "barcode": "171119841",
            "dpc": "03020817501",
            "name": "គុយ ច្រិប"
        },
        {
            "barcode": "171119842",
            "dpc": "03020817101",
            "name": "ទេព តឿម"
        },
        {
            "barcode": "171119843",
            "dpc": "03020824501",
            "name": "សំ សារួម"
        },
        {
            "barcode": "171119844",
            "dpc": "03020816801",
            "name": "បៃ យាន"
        },
        {
            "barcode": "171119845",
            "dpc": "03020817701",
            "name": "ឡឹក សំបូរ"
        },
        {
            "barcode": "171119846",
            "dpc": "03020817801",
            "name": "ខ្លូត សំបូរ"
        },
        {
            "barcode": "171119847",
            "dpc": "03020817901",
            "name": "ប៉ិច ចិន្តា"
        },
        {
            "barcode": "171119848",
            "dpc": "03020818001",
            "name": "អ៊ី សាមិត្ត"
        },
        {
            "barcode": "171119849",
            "dpc": "03020818401",
            "name": "លាប ឈន់"
        },
        {
            "barcode": "171119850",
            "dpc": "03020815901",
            "name": "ហូវ សានី"
        },
        {
            "barcode": "171119851",
            "dpc": "03020816001",
            "name": "សេង វ៉ាន់លី"
        },
        {
            "barcode": "171119852",
            "dpc": "03020816101",
            "name": "សុខ សាន"
        },
        {
            "barcode": "171119853",
            "dpc": "03020816201",
            "name": "សុខ គង់"
        },
        {
            "barcode": "171119854",
            "dpc": "03020816301",
            "name": "ង៉ែត វិភូ (២)"
        },
        {
            "barcode": "171119855",
            "dpc": "03020818801",
            "name": "គល់ ឈុន"
        },
        {
            "barcode": "171119856",
            "dpc": "03020818601",
            "name": "ចាន់ សុខន"
        },
        {
            "barcode": "171119857",
            "dpc": "03020816401",
            "name": "អៀង ឆេង"
        },
        {
            "barcode": "171119858",
            "dpc": "03020816701",
            "name": "ខ្លូត សម្បត្តិ"
        },
        {
            "barcode": "171119859",
            "dpc": "03020816901",
            "name": "សុខ ឡម"
        },
        {
            "barcode": "171119860",
            "dpc": "03020818501",
            "name": "ឈុន លឿត"
        },
        {
            "barcode": "171119861",
            "dpc": "03020819001",
            "name": "នង សុផល"
        },
        {
            "barcode": "171119862",
            "dpc": "03020819201",
            "name": "តោ កុយហួង"
        },
        {
            "barcode": "171119863",
            "dpc": "03020819301",
            "name": "សូ សាវុធ"
        },
        {
            "barcode": "171119864",
            "dpc": "03020819601",
            "name": "ឃិន ពៅ"
        },
        {
            "barcode": "171119865",
            "dpc": "03020819701",
            "name": "ហេង សុភារុណ"
        },
        {
            "barcode": "171119866",
            "dpc": "03020819801",
            "name": "ឡោ ចិន្តា"
        },
        {
            "barcode": "171119867",
            "dpc": "03020819901",
            "name": "សយ គឹមសាន្ត"
        },
        {
            "barcode": "171119868",
            "dpc": "03020820201",
            "name": "ពុធ សំរិទ្ធ"
        },
        {
            "barcode": "171119869",
            "dpc": "03020820501",
            "name": "គុណ សម្ផស្ស"
        },
        {
            "barcode": "171119870",
            "dpc": "03020820601",
            "name": "ម៉ក សាលី"
        },
        {
            "barcode": "171119871",
            "dpc": "03020822001",
            "name": "គង់ គន្ធា"
        },
        {
            "barcode": "171119872",
            "dpc": "03020821101",
            "name": "ខៀវ ពៅ"
        },
        {
            "barcode": "171119873",
            "dpc": "03020821001",
            "name": "ឡោ សម្បត្តិ"
        },
        {
            "barcode": "171119874",
            "dpc": "03020820901",
            "name": "រស់ វ៉ាវី"
        },
        {
            "barcode": "171119875",
            "dpc": "03020820801",
            "name": "ទិត សារួន"
        },
        {
            "barcode": "171119876",
            "dpc": "03020820701",
            "name": "ហុល រិន"
        },
        {
            "barcode": "171119877",
            "dpc": "03020820401",
            "name": "ពៅ សត្យ"
        },
        {
            "barcode": "171119878",
            "dpc": "03020820301",
            "name": "ខឹម ចាន់"
        },
        {
            "barcode": "171119879",
            "dpc": "03020820101",
            "name": "វិន សាវេន"
        },
        {
            "barcode": "171119880",
            "dpc": "03020820001",
            "name": "សុខ សារ៉ាត់"
        },
        {
            "barcode": "171119881",
            "dpc": "03020819501",
            "name": "គឹម សុភុន"
        },
        {
            "barcode": "171119882",
            "dpc": "03020819401",
            "name": "នង ហ៊ាន"
        },
        {
            "barcode": "171119883",
            "dpc": "03020821201",
            "name": "កង សារ៉េន"
        },
        {
            "barcode": "171119884",
            "dpc": "03020821301",
            "name": "ពៅ វុទ្ធី"
        },
        {
            "barcode": "171119885",
            "dpc": "03020821401",
            "name": "ហ៊ីម លិញ"
        },
        {
            "barcode": "171119886",
            "dpc": "03020815301",
            "name": "សោ ជ្រឿន"
        },
        {
            "barcode": "171119887",
            "dpc": "03020821501",
            "name": "ម៉ម ណុល"
        },
        {
            "barcode": "171119888",
            "dpc": "03020821701",
            "name": "តាំង ចាំងហួយ"
        },
        {
            "barcode": "171119889",
            "dpc": "03020821601",
            "name": "ភួង ស៊ីម"
        },
        {
            "barcode": "171119890",
            "dpc": "03020821801",
            "name": "ហុក សេង"
        },
        {
            "barcode": "171119891",
            "dpc": "03020822101",
            "name": "យិន ឌី"
        },
        {
            "barcode": "171119892",
            "dpc": "03020822201",
            "name": "សេង ម៉េងសាម"
        },
        {
            "barcode": "171119893",
            "dpc": "03020845101",
            "name": "គឹម លន់"
        },
        {
            "barcode": "171119894",
            "dpc": "03020845401",
            "name": "នូ វ៉ារី"
        },
        {
            "barcode": "171119895",
            "dpc": "03020845901",
            "name": "លឹម ហាន"
        },
        {
            "barcode": "171119896",
            "dpc": "03020845801",
            "name": "មណ្ឌល កុម៉ាកំព្រា"
        },
        {
            "barcode": "171119897",
            "dpc": "03020845701",
            "name": "រៀន វីរៈ"
        },
        {
            "barcode": "171119898",
            "dpc": "03020845601",
            "name": "លុក ចន្ថា"
        },
        {
            "barcode": "171119899",
            "dpc": "03020845501",
            "name": "ខែត្រ សៀង"
        },
        {
            "barcode": "171119900",
            "dpc": "03020821901",
            "name": "ងួន គន"
        },
        {
            "barcode": "171119901",
            "dpc": "03020846301",
            "name": "សុខ សុផល"
        },
        {
            "barcode": "171119902",
            "dpc": "03020847001",
            "name": "ហ៊ុន សាលី"
        },
        {
            "barcode": "171119903",
            "dpc": "03020817601",
            "name": "ទុយ សុផល"
        },
        {
            "barcode": "171119904",
            "dpc": "03020824401",
            "name": "ញូង ផែន"
        },
        {
            "barcode": "171119905",
            "dpc": "03020824301",
            "name": "ម៉ែន ឆយ"
        },
        {
            "barcode": "171119906",
            "dpc": "03020824201",
            "name": "អៃ អឿន"
        },
        {
            "barcode": "171119907",
            "dpc": "03020824101",
            "name": "ជឹម ចិន្តា"
        },
        {
            "barcode": "171119908",
            "dpc": "03020824001",
            "name": "អ៊ី ខេង"
        },
        {
            "barcode": "171119909",
            "dpc": "03020823901",
            "name": "រ៉ែម សំណាង"
        },
        {
            "barcode": "171119910",
            "dpc": "03020823801",
            "name": "ឆាន់ ជី"
        },
        {
            "barcode": "171119911",
            "dpc": "03020823701",
            "name": "និន ផល្លា"
        },
        {
            "barcode": "171119912",
            "dpc": "03020823601",
            "name": "អ៊ឹង ឈួរឆាយ"
        },
        {
            "barcode": "171119913",
            "dpc": "03020823501",
            "name": "នូ ប៊ុនណា"
        },
        {
            "barcode": "171119914",
            "dpc": "03020823401",
            "name": "ម៉ៅ ប៊ន"
        },
        {
            "barcode": "171119915",
            "dpc": "03020823301",
            "name": "ព ពៅ"
        },
        {
            "barcode": "171119916",
            "dpc": "03020823201",
            "name": "កូវ ជីងប៊ុង"
        },
        {
            "barcode": "171119917",
            "dpc": "03020823101",
            "name": "ឆាយ លីន"
        },
        {
            "barcode": "171119918",
            "dpc": "03020823001",
            "name": "ឡឹក ចាន់រិទ្ធី"
        },
        {
            "barcode": "171119919",
            "dpc": "03020822901",
            "name": "អុក សេន"
        },
        {
            "barcode": "171119920",
            "dpc": "03020822801",
            "name": "ម៉ិល ណារិន"
        },
        {
            "barcode": "171119921",
            "dpc": "03020822701",
            "name": "ឆោម ឈឺយ"
        },
        {
            "barcode": "171119922",
            "dpc": "03020822501",
            "name": "ឃួន សុខុម"
        },
        {
            "barcode": "171119923",
            "dpc": "03020822401",
            "name": "ឌិត សាលួត"
        },
        {
            "barcode": "171119924",
            "dpc": "03020822301",
            "name": "ប៊ុន ឡុង"
        },
        {
            "barcode": "171119925",
            "dpc": "03020813801",
            "name": "គ្រី ទិត្យ"
        },
        {
            "barcode": "171119926",
            "dpc": "03020813701",
            "name": "ជិន សុភា"
        },
        {
            "barcode": "171119927",
            "dpc": "03020813501",
            "name": "រ៉ឹន ណារ៉ាន់"
        },
        {
            "barcode": "171119928",
            "dpc": "03020813401",
            "name": "យិន រឿម"
        },
        {
            "barcode": "171119929",
            "dpc": "03020813301",
            "name": "ម៉ាង សារុំ"
        },
        {
            "barcode": "171119930",
            "dpc": "03020813001",
            "name": "តោ ចិន្តា"
        },
        {
            "barcode": "171119931",
            "dpc": "03020812901",
            "name": "ពូ ពេក"
        },
        {
            "barcode": "171119932",
            "dpc": "03020812801",
            "name": "សុខ លី"
        },
        {
            "barcode": "171119933",
            "dpc": "03020812501",
            "name": "ជា ឃុន"
        },
        {
            "barcode": "171119934",
            "dpc": "03020825501",
            "name": "ឆាយ គឹមទឹង"
        },
        {
            "barcode": "171119935",
            "dpc": "03020825301",
            "name": "ដឿក ម៉ៅ"
        },
        {
            "barcode": "171119936",
            "dpc": "03020825201",
            "name": "ម៉ាញ ផាន"
        },
        {
            "barcode": "171119937",
            "dpc": "03020825101",
            "name": "អាង យ៉េង"
        },
        {
            "barcode": "171119938",
            "dpc": "03020824901",
            "name": "ហួត ឡាយ"
        },
        {
            "barcode": "171119939",
            "dpc": "03020824801",
            "name": "ឈិន វៃ"
        },
        {
            "barcode": "171119940",
            "dpc": "03020824701",
            "name": "យក់ ហ៊ុន"
        },
        {
            "barcode": "171119941",
            "dpc": "03020824601",
            "name": "ជាង ម៉ុង"
        },
        {
            "barcode": "171119942",
            "dpc": "03020812301",
            "name": "អ៊ឹង ឡេងហ៊ួត"
        },
        {
            "barcode": "171119943",
            "dpc": "03020812201",
            "name": "គឹម បូផៃ"
        },
        {
            "barcode": "171119944",
            "dpc": "03020812101",
            "name": "យឿន អឿន"
        },
        {
            "barcode": "171119945",
            "dpc": "03020811901",
            "name": "គឹម សុងវិចិត្រ"
        },
        {
            "barcode": "171119946",
            "dpc": "03020811801",
            "name": "គឹម បុត្តា"
        },
        {
            "barcode": "171119947",
            "dpc": "03020811701",
            "name": "លុយ រដ្ឋា"
        },
        {
            "barcode": "171119948",
            "dpc": "03020811601",
            "name": "វែង ថៃ"
        },
        {
            "barcode": "171119949",
            "dpc": "03020811501",
            "name": "អ៊ាង សុខា"
        },
        {
            "barcode": "171119950",
            "dpc": "03020811401",
            "name": "ពៅ រ៉េន"
        },
        {
            "barcode": "171119951",
            "dpc": "03020811301",
            "name": "ពេជ្រ សុខា"
        },
        {
            "barcode": "171119952",
            "dpc": "03020811201",
            "name": "ស៊ន ហ៊ុន"
        },
        {
            "barcode": "171119953",
            "dpc": "03020811101",
            "name": "ប៉ាវ ចាន់តារា"
        },
        {
            "barcode": "171119954",
            "dpc": "03020811001",
            "name": "អេង អ៊ាង"
        },
        {
            "barcode": "171119955",
            "dpc": "03020810901",
            "name": "ប៉ូ ទូច"
        },
        {
            "barcode": "171119956",
            "dpc": "03020810801",
            "name": "គូ កាម"
        },
        {
            "barcode": "171119957",
            "dpc": "03020810701",
            "name": "គឹម សេង"
        },
        {
            "barcode": "171119958",
            "dpc": "03020810301",
            "name": "អាត ច្រិប"
        },
        {
            "barcode": "171119959",
            "dpc": "03020810201",
            "name": "ប្រាក់ ឡុង"
        },
        {
            "barcode": "171119960",
            "dpc": "03020810101",
            "name": "ឈៀង ឡានី"
        },
        {
            "barcode": "171119961",
            "dpc": "03020810001",
            "name": "ពឹង ស៊ីម៉េង"
        },
        {
            "barcode": "171119962",
            "dpc": "03020809901",
            "name": "លី ឈុន"
        },
        {
            "barcode": "171119963",
            "dpc": "03020809801",
            "name": "យក់ តាំង"
        },
        {
            "barcode": "171119964",
            "dpc": "03020809701",
            "name": "លឹម ហាប់"
        },
        {
            "barcode": "171119965",
            "dpc": "03020809601",
            "name": "ចាប សុធី"
        },
        {
            "barcode": "171119966",
            "dpc": "03020809501",
            "name": "សេង ជា"
        },
        {
            "barcode": "171119967",
            "dpc": "03020815601",
            "name": "នៅ យ៉ារ័ត្ន"
        },
        {
            "barcode": "171119968",
            "dpc": "03020815401",
            "name": "ម៉ៅ ហ៊ុន"
        },
        {
            "barcode": "171119969",
            "dpc": "03020815201",
            "name": "អាត់ សឿន"
        },
        {
            "barcode": "171119970",
            "dpc": "03020815001",
            "name": "គឹម សុខសាន្ត"
        },
        {
            "barcode": "171119971",
            "dpc": "03020814901",
            "name": "អ៊ឹង សារ៉ាត់"
        },
        {
            "barcode": "171119972",
            "dpc": "03020814801",
            "name": "ហួយ ឡាន"
        },
        {
            "barcode": "171119973",
            "dpc": "03020814701",
            "name": "ហេវ វែង"
        },
        {
            "barcode": "171119974",
            "dpc": "03020814601",
            "name": "សុខ ប៊ូ"
        },
        {
            "barcode": "171119975",
            "dpc": "03020814501",
            "name": "លុក សំប៊ុន"
        },
        {
            "barcode": "171119976",
            "dpc": "03020814401",
            "name": "ទឹម ប៉ូល"
        },
        {
            "barcode": "171119977",
            "dpc": "03020814301",
            "name": "សេង ហ៊ីម"
        },
        {
            "barcode": "171119978",
            "dpc": "03020814001",
            "name": "ជា ដាំ"
        },
        {
            "barcode": "171119979",
            "dpc": "03020813901",
            "name": "អ៊ុន រឿន"
        },
        {
            "barcode": "171119980",
            "dpc": "03020813201",
            "name": "សោម យ៉ម"
        },
        {
            "barcode": "171119981",
            "dpc": "03020813101",
            "name": "ជៀវ ហ្វីលីប"
        },
        {
            "barcode": "171119982",
            "dpc": "03020812701",
            "name": "សុខ វុទ្ធី"
        },
        {
            "barcode": "171119983",
            "dpc": "03020812401",
            "name": "ជៀម ហ៊ាង"
        },
        {
            "barcode": "171119984",
            "dpc": "03020848001",
            "name": "ឌឿម សាមុជ"
        },
        {
            "barcode": "171122173",
            "dpc": "03020803701",
            "name": "លាភ​ ឈន់"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
