let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171121287",
            "dpc": "03020920901",
            "name": "សុខ នាង"
        },
        {
            "barcode": "171121288",
            "dpc": "03020921701",
            "name": "មឿន ឈឿត"
        },
        {
            "barcode": "171121289",
            "dpc": "03020921601",
            "name": "សុខ កប"
        },
        {
            "barcode": "171121290",
            "dpc": "03020921501",
            "name": "ឈួម សាវី ១"
        },
        {
            "barcode": "171121291",
            "dpc": "03020921401",
            "name": "កែវ វាសនា"
        },
        {
            "barcode": "171121292",
            "dpc": "03020921301",
            "name": "ពិន ប៊ុនថន"
        },
        {
            "barcode": "171121293",
            "dpc": "03020921201",
            "name": "ស៊ាន សុខណាល់"
        },
        {
            "barcode": "171121294",
            "dpc": "03020921101",
            "name": "អ៊ឹម រតនា"
        },
        {
            "barcode": "171121295",
            "dpc": "03020921001",
            "name": "ហួ  ហេង"
        },
        {
            "barcode": "171121296",
            "dpc": "03020919501",
            "name": "សា រឿន"
        },
        {
            "barcode": "171121297",
            "dpc": "03020919801",
            "name": "ជួង អាន"
        },
        {
            "barcode": "171121298",
            "dpc": "03020919701",
            "name": "ជ  គឹមហេង"
        },
        {
            "barcode": "171121299",
            "dpc": "03020919601",
            "name": "ជៀប សូរ"
        },
        {
            "barcode": "171121300",
            "dpc": "03020919901",
            "name": "ឡាយ សាយ"
        },
        {
            "barcode": "171121301",
            "dpc": "03020920001",
            "name": "យូ ហៀក"
        },
        {
            "barcode": "171121302",
            "dpc": "03020920101",
            "name": "គ្រី ឈួន"
        },
        {
            "barcode": "171121303",
            "dpc": "03020920201",
            "name": "ឆន លួត"
        },
        {
            "barcode": "171121304",
            "dpc": "03020920301",
            "name": "ឆន ឆាន"
        },
        {
            "barcode": "171121305",
            "dpc": "03020920401",
            "name": "ទ្រី លួត"
        },
        {
            "barcode": "171121306",
            "dpc": "03020920501",
            "name": "គឹម សុខាល័យ"
        },
        {
            "barcode": "171121307",
            "dpc": "03020920601",
            "name": "សឹង ពៅ"
        },
        {
            "barcode": "171121308",
            "dpc": "03020920701",
            "name": "គង់ ហុង"
        },
        {
            "barcode": "171121309",
            "dpc": "03020919301",
            "name": "រឿង តាន់"
        },
        {
            "barcode": "171121310",
            "dpc": "03020919201",
            "name": "កែវ ពិសិទ្ធ"
        },
        {
            "barcode": "171121311",
            "dpc": "03020919101",
            "name": "ម៉ាន់ លិញ"
        },
        {
            "barcode": "171121312",
            "dpc": "03020919001",
            "name": "ជួន រដ្ឋា"
        },
        {
            "barcode": "171121313",
            "dpc": "03020918801",
            "name": "គឹម គាង"
        },
        {
            "barcode": "171121314",
            "dpc": "03020918901",
            "name": "កឹម  ឌី"
        },
        {
            "barcode": "171121315",
            "dpc": "03020918601",
            "name": "សោម ឌឿន"
        },
        {
            "barcode": "171121316",
            "dpc": "03020917301",
            "name": "ម៉ៅ ធី"
        },
        {
            "barcode": "171121317",
            "dpc": "03020917201",
            "name": "ពិន ថាវី"
        },
        {
            "barcode": "171121318",
            "dpc": "03020917101",
            "name": "គង់ អន"
        },
        {
            "barcode": "171121319",
            "dpc": "03020917001",
            "name": "ម៉ឹង សុខុន"
        },
        {
            "barcode": "171121320",
            "dpc": "03020917601",
            "name": "ឈុំ ដេត"
        },
        {
            "barcode": "171121321",
            "dpc": "03020917701",
            "name": "ហៀក ស្រេង"
        },
        {
            "barcode": "171121322",
            "dpc": "03020917801",
            "name": "វ៉ា  ប៊ុនយឿត"
        },
        {
            "barcode": "171121323",
            "dpc": "03020917901",
            "name": "ហេង ហុកម៉េង"
        },
        {
            "barcode": "171121324",
            "dpc": "03020918001",
            "name": "យិន ហុង"
        },
        {
            "barcode": "171121325",
            "dpc": "03020918101",
            "name": "សុខ វែង"
        },
        {
            "barcode": "171121326",
            "dpc": "03020918201",
            "name": "លេ សុខ"
        },
        {
            "barcode": "171121327",
            "dpc": "03020918301",
            "name": "លឿង សុលីដា"
        },
        {
            "barcode": "171121328",
            "dpc": "03020918401",
            "name": "ស៊ិន និត្យាលីន"
        },
        {
            "barcode": "171121329",
            "dpc": "03020918501",
            "name": "សំ ឡាយ"
        },
        {
            "barcode": "171121330",
            "dpc": "03020917401",
            "name": "សុខ ឌី"
        },
        {
            "barcode": "171121331",
            "dpc": "03020917501",
            "name": "អ៊ុង សំអន"
        },
        {
            "barcode": "171121332",
            "dpc": "03020916901",
            "name": "យ៉ា សុផៃលីន"
        },
        {
            "barcode": "171121333",
            "dpc": "03020916801",
            "name": "ឌឹម  វី"
        },
        {
            "barcode": "171121334",
            "dpc": "03020916701",
            "name": "ធឹង វន"
        },
        {
            "barcode": "171121335",
            "dpc": "03020916601",
            "name": "មុ ភឿន"
        },
        {
            "barcode": "171121336",
            "dpc": "03020916501",
            "name": "ពុធ ចំរើន"
        },
        {
            "barcode": "171121337",
            "dpc": "03020916401",
            "name": "សុខ សុផាត"
        },
        {
            "barcode": "171121338",
            "dpc": "03020916301",
            "name": "គឹម ឡេង"
        },
        {
            "barcode": "171121339",
            "dpc": "03020915601",
            "name": "ហៀក ស្រេង ១"
        },
        {
            "barcode": "171121340",
            "dpc": "03020915701",
            "name": "ហៀក ស្រេង ២"
        },
        {
            "barcode": "171121341",
            "dpc": "03020915801",
            "name": "ហៀក ស្រេង ៣"
        },
        {
            "barcode": "171121342",
            "dpc": "03020915901",
            "name": "ហៀក ស្រេង ៤"
        },
        {
            "barcode": "171121343",
            "dpc": "03020915401",
            "name": "គឹម  វុទ្ធី"
        },
        {
            "barcode": "171121344",
            "dpc": "03020915301",
            "name": "ស្វាយ ចំរិទ្ធ"
        },
        {
            "barcode": "171121345",
            "dpc": "03020923001",
            "name": "ទូច ហេង"
        },
        {
            "barcode": "171121346",
            "dpc": "03020922901",
            "name": "គង់ គា"
        },
        {
            "barcode": "171121347",
            "dpc": "03020922801",
            "name": "តាំង ហាលឹម"
        },
        {
            "barcode": "171121348",
            "dpc": "03020931101",
            "name": "ម៉ែន  ម៉ាន"
        },
        {
            "barcode": "171121349",
            "dpc": "03020931701",
            "name": "ជុំ ចំរ៉ុង"
        },
        {
            "barcode": "171121350",
            "dpc": "03020932001",
            "name": "សា ម៉ន"
        },
        {
            "barcode": "171121351",
            "dpc": "03020932101",
            "name": "លី ស្រូន"
        },
        {
            "barcode": "171121352",
            "dpc": "03020932301",
            "name": "ភូ ផល្លី"
        },
        {
            "barcode": "171121353",
            "dpc": "03020932401",
            "name": "សឹង សារៀម"
        },
        {
            "barcode": "171121354",
            "dpc": "03020933401",
            "name": "សយ បូរ៉ា"
        },
        {
            "barcode": "171121355",
            "dpc": "03020933501",
            "name": "សយ ប៉ូលីន"
        },
        {
            "barcode": "171121356",
            "dpc": "03020933601",
            "name": "ពត សាវ៉ុង"
        },
        {
            "barcode": "171121357",
            "dpc": "03020932201",
            "name": "កាក់ សិលា"
        },
        {
            "barcode": "171121358",
            "dpc": "03020935401",
            "name": "នង វណ្ណៈ"
        },
        {
            "barcode": "171121359",
            "dpc": "03020935301",
            "name": "នង​ ស៊ីផាន់"
        },
        {
            "barcode": "171121360",
            "dpc": "03020935201",
            "name": "នង ប៊ុន ធឿន"
        },
        {
            "barcode": "171121361",
            "dpc": "03020935101",
            "name": "នន់ វណ្ណា"
        },
        {
            "barcode": "171121362",
            "dpc": "03020935001",
            "name": "អុំ  វណ្ណា"
        },
        {
            "barcode": "171121363",
            "dpc": "03020934801",
            "name": "គឹម អនោ"
        },
        {
            "barcode": "171121364",
            "dpc": "03020934701",
            "name": "ចាន់ យ៉េន"
        },
        {
            "barcode": "171121365",
            "dpc": "03020934501",
            "name": "មាស គឹមលន់"
        },
        {
            "barcode": "171121366",
            "dpc": "03020934401",
            "name": "ទ្រី ចំរ៉ុង"
        },
        {
            "barcode": "171121367",
            "dpc": "03020934201",
            "name": "ទូច សំអាង"
        },
        {
            "barcode": "171121368",
            "dpc": "03020934101",
            "name": "ទូច ដាវី"
        },
        {
            "barcode": "171121369",
            "dpc": "03020934001",
            "name": "ទូច សំអ៊ីន"
        },
        {
            "barcode": "171121370",
            "dpc": "03020933901",
            "name": "ឈួង រ៉ាវ៉ៃ"
        },
        {
            "barcode": "171121371",
            "dpc": "03020933801",
            "name": "សួន វណ្ណា"
        },
        {
            "barcode": "171121372",
            "dpc": "03020933701",
            "name": "ណុប ស៊ឹម"
        },
        {
            "barcode": "171121373",
            "dpc": "03020933301",
            "name": "លាង   ស៊ីវហេង"
        },
        {
            "barcode": "171121374",
            "dpc": "03020933001",
            "name": "ហេវ បាស៊ាន"
        },
        {
            "barcode": "171121375",
            "dpc": "03020932901",
            "name": "ហេង បេងឈុន"
        },
        {
            "barcode": "171121376",
            "dpc": "03020933201",
            "name": "ផាត ភីរុណ"
        },
        {
            "barcode": "171121377",
            "dpc": "03020932701",
            "name": "ឈុំ នារី"
        },
        {
            "barcode": "171121378",
            "dpc": "03020932601",
            "name": "លឹម ប៊ុនសឺ"
        },
        {
            "barcode": "171121379",
            "dpc": "03020932501",
            "name": "ទី វត្ថា"
        },
        {
            "barcode": "171121380",
            "dpc": "03020932801",
            "name": "ទេស អាណុង"
        },
        {
            "barcode": "171121381",
            "dpc": "03020937401",
            "name": "កៅ សួម"
        },
        {
            "barcode": "171121382",
            "dpc": "03020937301",
            "name": "លាយ សាវឿន"
        },
        {
            "barcode": "171121383",
            "dpc": "03020937201",
            "name": "តាំង សុផល"
        },
        {
            "barcode": "171121384",
            "dpc": "03020937101",
            "name": "ពៅ សាំង"
        },
        {
            "barcode": "171121385",
            "dpc": "03020937001",
            "name": "ជ័យ សែន"
        },
        {
            "barcode": "171121386",
            "dpc": "03020936901",
            "name": "ឈួង  ផាន់នី"
        },
        {
            "barcode": "171121387",
            "dpc": "03020936801",
            "name": "សេង សុភាព"
        },
        {
            "barcode": "171121388",
            "dpc": "03020936701",
            "name": "ឡុង សារុំ"
        },
        {
            "barcode": "171121389",
            "dpc": "03020936601",
            "name": "មាស បាន"
        },
        {
            "barcode": "171121390",
            "dpc": "03020936301",
            "name": "គឹម តាន់យ៉ា"
        },
        {
            "barcode": "171121391",
            "dpc": "03020936401",
            "name": "សោ វិចិត្រ"
        },
        {
            "barcode": "171121392",
            "dpc": "03020938301",
            "name": "អុំ  ណារិន"
        },
        {
            "barcode": "171121393",
            "dpc": "03020938201",
            "name": "ប៉ិល ដារ៉ា"
        },
        {
            "barcode": "171121394",
            "dpc": "03020938101",
            "name": "បុល  ដាវីត"
        },
        {
            "barcode": "171121395",
            "dpc": "03020938001",
            "name": "ប៉ិល ឆវិឌ្ឍន៍"
        },
        {
            "barcode": "171121396",
            "dpc": "03020937801",
            "name": "ហាស់ ស៊ីផាន់"
        },
        {
            "barcode": "171121397",
            "dpc": "03020937901",
            "name": "ចក់ ឆន"
        },
        {
            "barcode": "171121398",
            "dpc": "03020937701",
            "name": "ទឹម ភី"
        },
        {
            "barcode": "171121399",
            "dpc": "03020937501",
            "name": "ឆឺយ គឹមយ៉េន"
        },
        {
            "barcode": "171121400",
            "dpc": "03020935901",
            "name": "គឹម សុផានី"
        },
        {
            "barcode": "171121401",
            "dpc": "03020935801",
            "name": "មាស សារី"
        },
        {
            "barcode": "171121402",
            "dpc": "03020935601",
            "name": "ខុង មន្នី"
        },
        {
            "barcode": "171121403",
            "dpc": "03020935501",
            "name": "អូន សៀន"
        },
        {
            "barcode": "171121404",
            "dpc": "03020936201",
            "name": "គឹម គា"
        },
        {
            "barcode": "171121405",
            "dpc": "03020936101",
            "name": "គឹម ហេង"
        },
        {
            "barcode": "171121406",
            "dpc": "03020923301",
            "name": "ថេង សុជាតា"
        },
        {
            "barcode": "171121407",
            "dpc": "03020923401",
            "name": "អ៊ឹង ម៉េងលី"
        },
        {
            "barcode": "171121408",
            "dpc": "03020923501",
            "name": "វង្ស ដាវី"
        },
        {
            "barcode": "171121409",
            "dpc": "03020923601",
            "name": "តេង សោភ័ណ្ឌ"
        },
        {
            "barcode": "171121410",
            "dpc": "03020923701",
            "name": "ព្រុំ ប្រសិទ្ធ"
        },
        {
            "barcode": "171121411",
            "dpc": "03020923801",
            "name": "ស៊ី អ៊ីវ"
        },
        {
            "barcode": "171121412",
            "dpc": "03020923901",
            "name": "ជា សុខចេង"
        },
        {
            "barcode": "171121413",
            "dpc": "03020924001",
            "name": "ជា ពៅ"
        },
        {
            "barcode": "171121414",
            "dpc": "03020924601",
            "name": "អុំ ប៉េងសុង"
        },
        {
            "barcode": "171121415",
            "dpc": "03020925201",
            "name": "សោម សុផា"
        },
        {
            "barcode": "171121416",
            "dpc": "03020925401",
            "name": "ស៊ុន ហឿន"
        },
        {
            "barcode": "171121417",
            "dpc": "03020925501",
            "name": "ហែម រ៉ា"
        },
        {
            "barcode": "171121418",
            "dpc": "03020925601",
            "name": "នូ ផន"
        },
        {
            "barcode": "171121419",
            "dpc": "03020925701",
            "name": "ម៉េង ទី"
        },
        {
            "barcode": "171121420",
            "dpc": "03020925801",
            "name": "ម៉ៅ ស្រីកែវ"
        },
        {
            "barcode": "171121421",
            "dpc": "03020925901",
            "name": "សុខ សាលួត"
        },
        {
            "barcode": "171121422",
            "dpc": "03020926001",
            "name": "ចាន់ យ៉ា"
        },
        {
            "barcode": "171121423",
            "dpc": "03020926101",
            "name": "រស់ សាម៉ែន"
        },
        {
            "barcode": "171121424",
            "dpc": "03020926201",
            "name": "ជិន លាភ"
        },
        {
            "barcode": "171121425",
            "dpc": "03020926301",
            "name": "ស៊ុន បេ"
        },
        {
            "barcode": "171121426",
            "dpc": "03020926401",
            "name": "ម៉ាក់ ស៊ីណាត"
        },
        {
            "barcode": "171121427",
            "dpc": "03020926501",
            "name": "សេង ថេង"
        },
        {
            "barcode": "171121428",
            "dpc": "03020926601",
            "name": "យៀង នៅ"
        },
        {
            "barcode": "171121429",
            "dpc": "03020926701",
            "name": "ពេជ្រ ហេង"
        },
        {
            "barcode": "171121430",
            "dpc": "03020926801",
            "name": "កែវ សន"
        },
        {
            "barcode": "171121431",
            "dpc": "03020927001",
            "name": "ប៊ុន យ៉ារីន"
        },
        {
            "barcode": "171121432",
            "dpc": "03020926901",
            "name": "គុណ សារ៉ូ"
        },
        {
            "barcode": "171121433",
            "dpc": "03020927101",
            "name": "សាំង ភៅ"
        },
        {
            "barcode": "171121434",
            "dpc": "03020927201",
            "name": "លឹម យូហេង"
        },
        {
            "barcode": "171121435",
            "dpc": "03020927301",
            "name": "ង៉ុយ ស៊ីម"
        },
        {
            "barcode": "171121436",
            "dpc": "03020927501",
            "name": "សម ភារិន"
        },
        {
            "barcode": "171121437",
            "dpc": "03020927601",
            "name": "តោ ចាន់ថន"
        },
        {
            "barcode": "171121438",
            "dpc": "03020927701",
            "name": "លី ប៊ុនរៀន ១"
        },
        {
            "barcode": "171121439",
            "dpc": "03020927801",
            "name": "ហាន់ សុជិត"
        },
        {
            "barcode": "171121440",
            "dpc": "03020927901",
            "name": "លី ប៊ុនរឿន ២"
        },
        {
            "barcode": "171121441",
            "dpc": "03020928001",
            "name": "តោ ចាន់ថន ២"
        },
        {
            "barcode": "171121442",
            "dpc": "03020928101",
            "name": "ថោ សាន"
        },
        {
            "barcode": "171121443",
            "dpc": "03020928201",
            "name": "ចាន់ ឌឿន"
        },
        {
            "barcode": "171121444",
            "dpc": "03020928301",
            "name": "កូវ ជិញសៀង"
        },
        {
            "barcode": "171121445",
            "dpc": "03020928401",
            "name": "ភួង មេត្តា"
        },
        {
            "barcode": "171121446",
            "dpc": "03020928601",
            "name": "ពេជ្រ សាវរ៉ា"
        },
        {
            "barcode": "171121447",
            "dpc": "03020928701",
            "name": "ម៉ា ព្រៀន"
        },
        {
            "barcode": "171121448",
            "dpc": "03020928801",
            "name": "ហ៊ុន  ណៃ"
        },
        {
            "barcode": "171121449",
            "dpc": "03020928901",
            "name": "ម៉ៃ សាវ៉ាតឌី"
        },
        {
            "barcode": "171121450",
            "dpc": "03020929001",
            "name": "ប៉ៃ  ទ្រី"
        },
        {
            "barcode": "171121451",
            "dpc": "03020929101",
            "name": "មុត ឈាង"
        },
        {
            "barcode": "171121452",
            "dpc": "03020929301",
            "name": "ទៀង សូលីណា"
        },
        {
            "barcode": "171121453",
            "dpc": "03020929401",
            "name": "ខេង ម៉ាក់ខេន"
        },
        {
            "barcode": "171121454",
            "dpc": "03020929501",
            "name": "នាង អ៊ីវ៉ាត"
        },
        {
            "barcode": "171121455",
            "dpc": "03020929601",
            "name": "ឈឹម សិលា"
        },
        {
            "barcode": "171121456",
            "dpc": "03020929701",
            "name": "សោម សាវួច"
        },
        {
            "barcode": "171121457",
            "dpc": "03020924301",
            "name": "ផេង សុភី"
        },
        {
            "barcode": "171121458",
            "dpc": "03020924501",
            "name": "ដង  ខ្វិត"
        },
        {
            "barcode": "171121459",
            "dpc": "03020924701",
            "name": "លឹម ប៉ូលីន"
        },
        {
            "barcode": "171121460",
            "dpc": "03020924801",
            "name": "កង វណ្ណៈ"
        },
        {
            "barcode": "171121461",
            "dpc": "03020924901",
            "name": "ចាន់ វ៉ារ៉ាសៀន"
        },
        {
            "barcode": "171121462",
            "dpc": "03020925001",
            "name": "ចាន់ ម៉ូនីតា"
        },
        {
            "barcode": "171121463",
            "dpc": "03020925101",
            "name": "ផូ ចិន"
        },
        {
            "barcode": "171121464",
            "dpc": "03020941701",
            "name": "គន់ សារូ"
        },
        {
            "barcode": "171121465",
            "dpc": "03020941901",
            "name": "យ៉ង់ ប៉ូឡែន"
        },
        {
            "barcode": "171121466",
            "dpc": "03020942001",
            "name": "ជា គីម"
        },
        {
            "barcode": "171121467",
            "dpc": "03020942201",
            "name": "ផា ចន្ធូរ"
        },
        {
            "barcode": "171121468",
            "dpc": "03020942301",
            "name": "ខៀវ ស៊ី"
        },
        {
            "barcode": "171121469",
            "dpc": "03020942401",
            "name": "ឈុំ កែវ"
        },
        {
            "barcode": "171121470",
            "dpc": "03020942501",
            "name": "ទា ហ៊ុយ"
        },
        {
            "barcode": "171121471",
            "dpc": "03020939601",
            "name": "ងុវ៉ូ  ដៀប"
        },
        {
            "barcode": "171121472",
            "dpc": "03020939801",
            "name": "ហុក ចន្ទ្រា"
        },
        {
            "barcode": "171121473",
            "dpc": "03020939901",
            "name": "វ៉ាយ គល់"
        },
        {
            "barcode": "171121474",
            "dpc": "03020940301",
            "name": "យឹម សាវឿន"
        },
        {
            "barcode": "171121475",
            "dpc": "03020940601",
            "name": "មៀច សាម៉េត"
        },
        {
            "barcode": "171121476",
            "dpc": "03020940701",
            "name": "កែវ អ៊ឹម"
        },
        {
            "barcode": "171121477",
            "dpc": "03020940801",
            "name": "ព្រឿន ប្រសិទ្ធ"
        },
        {
            "barcode": "171121478",
            "dpc": "03020940901",
            "name": "អ៊ឹង ចាន់ធី"
        },
        {
            "barcode": "171121479",
            "dpc": "03020941001",
            "name": "ព្រឿង គៀវ"
        },
        {
            "barcode": "171121480",
            "dpc": "03020941101",
            "name": "អ៊ឹម ដាវី"
        },
        {
            "barcode": "171121481",
            "dpc": "03020940501",
            "name": "អ៊ឹម ដាញ៉ឹម"
        },
        {
            "barcode": "171121482",
            "dpc": "03020940401",
            "name": "ចាន់ មុំ"
        },
        {
            "barcode": "171121483",
            "dpc": "03020940101",
            "name": "ផាវ មុន្នី"
        },
        {
            "barcode": "171121484",
            "dpc": "03020940201",
            "name": "គី សែ"
        },
        {
            "barcode": "171121485",
            "dpc": "03020941301",
            "name": "រៀន ណារ៉ា"
        },
        {
            "barcode": "171121486",
            "dpc": "03020941401",
            "name": "កូវ ជិញសៀង"
        },
        {
            "barcode": "171121487",
            "dpc": "03020941601",
            "name": "យក់ ចំរើន"
        },
        {
            "barcode": "171121488",
            "dpc": "03020942801",
            "name": "ម៉ៅ រ័ត្នមុនី"
        },
        {
            "barcode": "171121489",
            "dpc": "03020942901",
            "name": "ទូច វណ្ណី"
        },
        {
            "barcode": "171121490",
            "dpc": "03020943001",
            "name": "គា សិលា"
        },
        {
            "barcode": "171121491",
            "dpc": "03020941801",
            "name": "កែវ គឹមសាន"
        },
        {
            "barcode": "171121492",
            "dpc": "03020939001",
            "name": "ចាន់ សុខឡេង"
        },
        {
            "barcode": "171121493",
            "dpc": "03020939201",
            "name": "ឃុន អ៊ូ"
        },
        {
            "barcode": "171121494",
            "dpc": "03020939301",
            "name": "ណី សំណា"
        },
        {
            "barcode": "171121495",
            "dpc": "03020939401",
            "name": "ង៉ូវ ហ៊ុយ"
        },
        {
            "barcode": "171121496",
            "dpc": "03020939501",
            "name": "ស ហាវ"
        },
        {
            "barcode": "171121497",
            "dpc": "03020942701",
            "name": "សែម សុខា"
        },
        {
            "barcode": "171121498",
            "dpc": "03020938701",
            "name": "វ៉ធ សុខុម"
        },
        {
            "barcode": "171121499",
            "dpc": "03020938401",
            "name": "អ៊ីវ ប៉ូឡូ"
        },
        {
            "barcode": "171121500",
            "dpc": "03020938501",
            "name": "អ៊ី ឆេង"
        },
        {
            "barcode": "171121501",
            "dpc": "03020938601",
            "name": "ញ៉ក់ ពីវ"
        },
        {
            "barcode": "171121502",
            "dpc": "03020938801",
            "name": "ប៉ុល កែវ"
        },
        {
            "barcode": "171121503",
            "dpc": "03020938901",
            "name": "គឹម កេង"
        },
        {
            "barcode": "171121504",
            "dpc": "03020945301",
            "name": "សាំង បូរ៉ា"
        },
        {
            "barcode": "171121505",
            "dpc": "03020945401",
            "name": "មឿង សារិទ្ធ"
        },
        {
            "barcode": "171121506",
            "dpc": "03020945501",
            "name": "ហេង សុវណ្ណ"
        },
        {
            "barcode": "171121507",
            "dpc": "03020945601",
            "name": "សុខ អេង"
        },
        {
            "barcode": "171121508",
            "dpc": "03020945701",
            "name": "អ៊ុន សំប៊ុន"
        },
        {
            "barcode": "171121509",
            "dpc": "03020945901",
            "name": "គឹម  ទ្រី"
        },
        {
            "barcode": "171121510",
            "dpc": "03020946001",
            "name": "សាន ថាវៀង"
        },
        {
            "barcode": "171121511",
            "dpc": "03020946101",
            "name": "វិន វន"
        },
        {
            "barcode": "171121512",
            "dpc": "03020946201",
            "name": "ស្រី សំណាង"
        },
        {
            "barcode": "171121513",
            "dpc": "03020946301",
            "name": "ម៉ុយ ដារ៉ាវុធ"
        },
        {
            "barcode": "171121514",
            "dpc": "03020946401",
            "name": "ទិព្វ ចន្ទវិបុល"
        },
        {
            "barcode": "171121515",
            "dpc": "03020946501",
            "name": "ភោគ វុទ្ធី"
        },
        {
            "barcode": "171121516",
            "dpc": "03020946601",
            "name": "ស៊ុន ចំរ៉ាត់ ១"
        },
        {
            "barcode": "171121517",
            "dpc": "03020946701",
            "name": "ស៊ុន ចំរ៉ាត់ ២"
        },
        {
            "barcode": "171121518",
            "dpc": "03020946801",
            "name": "នូ វណ្ណា"
        },
        {
            "barcode": "171121519",
            "dpc": "03020946901",
            "name": "សោម សុផា"
        },
        {
            "barcode": "171121520",
            "dpc": "03020947101",
            "name": "ស ម៉ារ៉ា"
        },
        {
            "barcode": "171121521",
            "dpc": "03020947201",
            "name": "តាំង ជៀវឡាយ"
        },
        {
            "barcode": "171121522",
            "dpc": "03020947301",
            "name": "អ៊ីវ ឈឿប"
        },
        {
            "barcode": "171121523",
            "dpc": "03020947401",
            "name": "លឹម ហ៊ាង ៥"
        },
        {
            "barcode": "171121524",
            "dpc": "03020947601",
            "name": "ពឹង ភាព"
        },
        {
            "barcode": "171121525",
            "dpc": "03020947701",
            "name": "គង់ ថៃឆេង"
        },
        {
            "barcode": "171121526",
            "dpc": "03020947801",
            "name": "លី មួយនី"
        },
        {
            "barcode": "171121527",
            "dpc": "03020947901",
            "name": "មៀច កន"
        },
        {
            "barcode": "171121528",
            "dpc": "03020943101",
            "name": "ម៉ែន សាម៉ុន ២"
        },
        {
            "barcode": "171121529",
            "dpc": "03020943301",
            "name": "ចាន់ ប៊ុនធី"
        },
        {
            "barcode": "171121530",
            "dpc": "03020943401",
            "name": "ណុប សុដេត"
        },
        {
            "barcode": "171121531",
            "dpc": "03020943501",
            "name": "ជៀវ  គឹមឈៀត"
        },
        {
            "barcode": "171121532",
            "dpc": "03020943601",
            "name": "ម៉ាញ់ កែវ"
        },
        {
            "barcode": "171121533",
            "dpc": "03020943701",
            "name": "ជាវ ស្រៀង"
        },
        {
            "barcode": "171121534",
            "dpc": "03020943801",
            "name": "អ៊ុយ ជិនណា"
        },
        {
            "barcode": "171121535",
            "dpc": "03020943901",
            "name": "អ៊ុន សំអូន"
        },
        {
            "barcode": "171121536",
            "dpc": "03020944001",
            "name": "អ៊ុន សំអាត"
        },
        {
            "barcode": "171121537",
            "dpc": "03020944101",
            "name": "សួន សុវណ្ណ"
        },
        {
            "barcode": "171121538",
            "dpc": "03020944201",
            "name": "ម៉ម ឡា"
        },
        {
            "barcode": "171121539",
            "dpc": "03020944301",
            "name": "ធន់ សេរី"
        },
        {
            "barcode": "171121540",
            "dpc": "03020944401",
            "name": "ជិន ហុង"
        },
        {
            "barcode": "171121541",
            "dpc": "03020944501",
            "name": "យិន ដាំ"
        },
        {
            "barcode": "171121542",
            "dpc": "03020944601",
            "name": "ខេង ឡាយ"
        },
        {
            "barcode": "171121543",
            "dpc": "03020944701",
            "name": "អ៊ឹម ហៃ"
        },
        {
            "barcode": "171121544",
            "dpc": "03020944801",
            "name": "ហៃ សុភាព"
        },
        {
            "barcode": "171121545",
            "dpc": "03020944901",
            "name": "ហម នី"
        },
        {
            "barcode": "171121546",
            "dpc": "03020945101",
            "name": "ទុយ ប៊ុនឈត"
        },
        {
            "barcode": "171121547",
            "dpc": "03020945201",
            "name": "សំ ប៊ុន"
        },
        {
            "barcode": "171121548",
            "dpc": "03020914201",
            "name": "វត្តលៀប"
        },
        {
            "barcode": "171121549",
            "dpc": "03020945001",
            "name": "សេង ថៃលី"
        },
        {
            "barcode": "171121550",
            "dpc": "03020941501",
            "name": "វ៉ាន់ វារី"
        },
        {
            "barcode": "171121551",
            "dpc": "03020939701",
            "name": "ហួយ ប៊ុនឡេង"
        },
        {
            "barcode": "171121552",
            "dpc": "03020906701",
            "name": "ចៅ  យិ"
        },
        {
            "barcode": "171121553",
            "dpc": "03020911601",
            "name": "សុច  សុផល"
        },
        {
            "barcode": "171121554",
            "dpc": "03020913301",
            "name": "ទ្រីញ  អាន"
        },
        {
            "barcode": "171121555",
            "dpc": "03020915501",
            "name": "ពេទ្យ  ផាវ៉ាន់"
        },
        {
            "barcode": "171121556",
            "dpc": "03020919401",
            "name": "ម៉ែន   តិច"
        },
        {
            "barcode": "171121557",
            "dpc": "03020921801",
            "name": "ឡុង   ដេត"
        },
        {
            "barcode": "171121558",
            "dpc": "03020921901",
            "name": "លឹម  ហ៊ួសាន"
        },
        {
            "barcode": "171121559",
            "dpc": "03020922001",
            "name": "សុខ   ប៊ុននី"
        },
        {
            "barcode": "171121560",
            "dpc": "03020922401",
            "name": "យឹម  ឈឿម"
        },
        {
            "barcode": "171121561",
            "dpc": "03020922501",
            "name": "ដាំ  សាម៉ី"
        },
        {
            "barcode": "171121562",
            "dpc": "03020922601",
            "name": "ទេស  ឈុំសាម៉ុន"
        },
        {
            "barcode": "171121563",
            "dpc": "03020922701",
            "name": "ហៀក  ស្រេង ៩"
        },
        {
            "barcode": "171121564",
            "dpc": "03020923101",
            "name": "ណាំ  ទីស៊ុនធួក"
        },
        {
            "barcode": "171121565",
            "dpc": "03020923201",
            "name": "ណាំ  ចាន់ថានី"
        },
        {
            "barcode": "171121566",
            "dpc": "03020924101",
            "name": "ធូ  ចឹក"
        },
        {
            "barcode": "171121567",
            "dpc": "03020924201",
            "name": "អួន  សុភី"
        },
        {
            "barcode": "171121568",
            "dpc": "03020929801",
            "name": "វ៉ាន់    អេង"
        },
        {
            "barcode": "171121569",
            "dpc": "03020929901",
            "name": "នួន   ផល្លី"
        },
        {
            "barcode": "171121570",
            "dpc": "03020930001",
            "name": "តាន់  គឹមស៊ាន"
        },
        {
            "barcode": "171121571",
            "dpc": "03020930101",
            "name": "អ៊ឹម  សារឿន"
        },
        {
            "barcode": "171121572",
            "dpc": "03020930201",
            "name": "ម៉ន  ម៉ុន"
        },
        {
            "barcode": "171121573",
            "dpc": "03020930301",
            "name": "ញ៉ែម  មឿន"
        },
        {
            "barcode": "171121574",
            "dpc": "03020930401",
            "name": "សៅ  ភីរិទ្ធ"
        },
        {
            "barcode": "171121575",
            "dpc": "03020930501",
            "name": "សៅ  ភីរុទ្ធ"
        },
        {
            "barcode": "171121576",
            "dpc": "03020930601",
            "name": "ហឿន  សំរិទ្ធិ"
        },
        {
            "barcode": "171121577",
            "dpc": "03020930701",
            "name": "តាំង  សេងហ៊ាង"
        },
        {
            "barcode": "171121578",
            "dpc": "03020930801",
            "name": "ធូ  សុជាតិ"
        },
        {
            "barcode": "171121579",
            "dpc": "03020930901",
            "name": "កាន  ហួ"
        },
        {
            "barcode": "171121580",
            "dpc": "03020931001",
            "name": "លាយ  សុភី"
        },
        {
            "barcode": "171121581",
            "dpc": "03020931201",
            "name": "ហួត  សុគុណ ២"
        },
        {
            "barcode": "171121582",
            "dpc": "03020931301",
            "name": "ខ្លង  សារិន"
        },
        {
            "barcode": "171121583",
            "dpc": "03020931401",
            "name": "វ៉ាន់  ថុល"
        },
        {
            "barcode": "171121584",
            "dpc": "03020931501",
            "name": "ចេង  ឡៃ"
        },
        {
            "barcode": "171121585",
            "dpc": "03020931601",
            "name": "សំ  សុន"
        },
        {
            "barcode": "171121586",
            "dpc": "03020931801",
            "name": "មុំ  ឌឹម"
        },
        {
            "barcode": "171121587",
            "dpc": "03020931901",
            "name": "ឌឹម  សំអាង"
        },
        {
            "barcode": "171121588",
            "dpc": "03020941201",
            "name": "ហាក់  ថាំង"
        },
        {
            "barcode": "171121589",
            "dpc": "03020922101",
            "name": "ងិន  សារ៉េត"
        },
        {
            "barcode": "171121590",
            "dpc": "03020922201",
            "name": "ហេង  រក្សា"
        },
        {
            "barcode": "171121591",
            "dpc": "03020922301",
            "name": "សាន  លាងគីម"
        },
        {
            "barcode": "171121592",
            "dpc": "03020909001",
            "name": "ប៊ី ទូច"
        },
        {
            "barcode": "171121593",
            "dpc": "03020909401",
            "name": "ហេង អូន"
        },
        {
            "barcode": "171121594",
            "dpc": "03020909501",
            "name": "សួរ ណាលី"
        },
        {
            "barcode": "171121595",
            "dpc": "03020909601",
            "name": "ច័ន្ទ ចៀន"
        },
        {
            "barcode": "171121596",
            "dpc": "03020909701",
            "name": "ទី ផាត"
        },
        {
            "barcode": "171121597",
            "dpc": "03020909801",
            "name": "ហេង សារ៉ាត់"
        },
        {
            "barcode": "171121598",
            "dpc": "03020909901",
            "name": "វង្ស សុក្រសារវ័ន្ត"
        },
        {
            "barcode": "171121599",
            "dpc": "03020910001",
            "name": "ជុំ អុល"
        },
        {
            "barcode": "171121600",
            "dpc": "03020910101",
            "name": "គង់ ផៃ"
        },
        {
            "barcode": "171121601",
            "dpc": "03020910301",
            "name": "យឹម  សំបូរ"
        },
        {
            "barcode": "171121602",
            "dpc": "03020907701",
            "name": "វេង  ហោ"
        },
        {
            "barcode": "171121603",
            "dpc": "03020907801",
            "name": "ថុង គឹមស៊ួរ"
        },
        {
            "barcode": "171121604",
            "dpc": "03020907901",
            "name": "វង្ស វឹង"
        },
        {
            "barcode": "171121605",
            "dpc": "03020908601",
            "name": "ឡេង ឃុនសុខផល្លី"
        },
        {
            "barcode": "171121606",
            "dpc": "03020908701",
            "name": "ឡយ ប៊ុនធឿន"
        },
        {
            "barcode": "171121607",
            "dpc": "03020908801",
            "name": "អេង ប៊ុនហេង"
        },
        {
            "barcode": "171121608",
            "dpc": "03020908901",
            "name": "វិញ រ៉ាឌី"
        },
        {
            "barcode": "171121609",
            "dpc": "03020909301",
            "name": "ឡាយ សុខខេង"
        },
        {
            "barcode": "171121610",
            "dpc": "03020908401",
            "name": "ជួង ខ្វា"
        },
        {
            "barcode": "171121611",
            "dpc": "03020908301",
            "name": "ថេង"
        },
        {
            "barcode": "171121612",
            "dpc": "03020908201",
            "name": "ឃុន សុឆី"
        },
        {
            "barcode": "171121613",
            "dpc": "03020908101",
            "name": "ចន សំណាង"
        },
        {
            "barcode": "171121614",
            "dpc": "03020908001",
            "name": "សុខ ចាន់"
        },
        {
            "barcode": "171121615",
            "dpc": "03020907601",
            "name": "សុខ សារ៉ាន់"
        },
        {
            "barcode": "171121616",
            "dpc": "03020907501",
            "name": "រស់ ឈន"
        },
        {
            "barcode": "171121617",
            "dpc": "03020907401",
            "name": "ហេង ចាន់ថា"
        },
        {
            "barcode": "171121618",
            "dpc": "03020907301",
            "name": "ព្រំ ធៀន"
        },
        {
            "barcode": "171121619",
            "dpc": "03020907201",
            "name": "គ្រី គឹមឈន"
        },
        {
            "barcode": "171121620",
            "dpc": "03020907101",
            "name": "រឿម សក់"
        },
        {
            "barcode": "171121621",
            "dpc": "03020907001",
            "name": "ចាន់ នី"
        },
        {
            "barcode": "171121622",
            "dpc": "03020906901",
            "name": "សាំង ស៊ីថា"
        },
        {
            "barcode": "171121623",
            "dpc": "03020906601",
            "name": "វិសុទ្ធ រដ្ឋា"
        },
        {
            "barcode": "171121624",
            "dpc": "03020906501",
            "name": "ចាន់ សូយ៉េត"
        },
        {
            "barcode": "171121625",
            "dpc": "03020905701",
            "name": "ញ៉ែម សឿន"
        },
        {
            "barcode": "171121626",
            "dpc": "03020905801",
            "name": "និត ស៊ីញ"
        },
        {
            "barcode": "171121627",
            "dpc": "03020905901",
            "name": "អ៊ុក វង្ស"
        },
        {
            "barcode": "171121628",
            "dpc": "03020906001",
            "name": "ខូវ ឈូក"
        },
        {
            "barcode": "171121629",
            "dpc": "03020906101",
            "name": "សៀង សុថង ១"
        },
        {
            "barcode": "171121630",
            "dpc": "03020906201",
            "name": "សៀង សុថង ២"
        },
        {
            "barcode": "171121631",
            "dpc": "03020906301",
            "name": "សៀង សុថង ៣"
        },
        {
            "barcode": "171121632",
            "dpc": "03020906401",
            "name": "អែល សយ"
        },
        {
            "barcode": "171121633",
            "dpc": "03020905201",
            "name": "អ៊ឹង ចាន់ថន"
        },
        {
            "barcode": "171121634",
            "dpc": "03020905301",
            "name": "ហឿន ឌឿ"
        },
        {
            "barcode": "171121635",
            "dpc": "03020905401",
            "name": "ធី គិន"
        },
        {
            "barcode": "171121636",
            "dpc": "03020905501",
            "name": "សូរ សុគុណ"
        },
        {
            "barcode": "171121637",
            "dpc": "03020905601",
            "name": "ឆាយ សារ៉េត ១"
        },
        {
            "barcode": "171121638",
            "dpc": "03020905001",
            "name": "ម៉ែន  ហួត"
        },
        {
            "barcode": "171121639",
            "dpc": "03020904601",
            "name": "គូ សុគន្ធាវី"
        },
        {
            "barcode": "171121640",
            "dpc": "03020904801",
            "name": "ស វុទ្ធី"
        },
        {
            "barcode": "171121641",
            "dpc": "03020904701",
            "name": "សៀវ គឹមថា"
        },
        {
            "barcode": "171121642",
            "dpc": "03020905101",
            "name": "សៀវ ចន្នី"
        },
        {
            "barcode": "171121643",
            "dpc": "03020904501",
            "name": "អឿ ឈឿត"
        },
        {
            "barcode": "171121644",
            "dpc": "03020904401",
            "name": "ហង់ ប៊ុនថន"
        },
        {
            "barcode": "171121645",
            "dpc": "03020904301",
            "name": "អ៊ុយ លីវ ៩"
        },
        {
            "barcode": "171121646",
            "dpc": "03020904201",
            "name": "អ៊ុយ លីវ ៨"
        },
        {
            "barcode": "171121647",
            "dpc": "03020904101",
            "name": "អ៊ុយ លីវ ៧"
        },
        {
            "barcode": "171121648",
            "dpc": "03020904001",
            "name": "អ៊ុយ លីវ  ៦"
        },
        {
            "barcode": "171121649",
            "dpc": "03020903801",
            "name": "អ៊ុយ លីវ ៤"
        },
        {
            "barcode": "171121650",
            "dpc": "03020903701",
            "name": "អ៊ុយ លីវ ៣"
        },
        {
            "barcode": "171121651",
            "dpc": "03020903601",
            "name": "អ៊ុយ លីវ ២"
        },
        {
            "barcode": "171121652",
            "dpc": "03020903501",
            "name": "អ៊ុយ លីវ ១"
        },
        {
            "barcode": "171121653",
            "dpc": "03020903401",
            "name": "តាន់ ម៉ាល័យ"
        },
        {
            "barcode": "171121654",
            "dpc": "03020903301",
            "name": "អេង សុវណ្ណី"
        },
        {
            "barcode": "171121655",
            "dpc": "03020903201",
            "name": "កៅ ឈួនណារ៉ា"
        },
        {
            "barcode": "171121656",
            "dpc": "03020903101",
            "name": "អ៊ឹម សុជិត"
        },
        {
            "barcode": "171121657",
            "dpc": "03020903001",
            "name": "ម៉ី សាវី"
        },
        {
            "barcode": "171121658",
            "dpc": "03020902901",
            "name": "អ៊ឹម ហឿន"
        },
        {
            "barcode": "171121659",
            "dpc": "03020902701",
            "name": "មាស គន្ធេង"
        },
        {
            "barcode": "171121660",
            "dpc": "03020902601",
            "name": "រស់ សុក្រិត"
        },
        {
            "barcode": "171121661",
            "dpc": "03020902501",
            "name": "អ៊ុង សាមី"
        },
        {
            "barcode": "171121662",
            "dpc": "03020902401",
            "name": "តន់ ប៊ុនរឿង"
        },
        {
            "barcode": "171121663",
            "dpc": "03020900101",
            "name": "លី  ឆយ"
        },
        {
            "barcode": "171121664",
            "dpc": "03020900401",
            "name": "សាលាហ្វឹកហ្វឺនភាសាអន្តរជាតិ"
        },
        {
            "barcode": "171121665",
            "dpc": "03020900301",
            "name": "ហឺ ដាវី"
        },
        {
            "barcode": "171121666",
            "dpc": "03020900501",
            "name": "អៀង សុភី"
        },
        {
            "barcode": "171121667",
            "dpc": "03020900701",
            "name": "សួន សំរិទ្ធ"
        },
        {
            "barcode": "171121668",
            "dpc": "03020900801",
            "name": "ហម រិទ្ធ"
        },
        {
            "barcode": "171121669",
            "dpc": "03020900901",
            "name": "ថុល សុធា"
        },
        {
            "barcode": "171121670",
            "dpc": "03020901001",
            "name": "លី ប៊ួយ"
        },
        {
            "barcode": "171121671",
            "dpc": "03020901101",
            "name": "តូច ស៊ុនណារ៉ា"
        },
        {
            "barcode": "171121672",
            "dpc": "03020901201",
            "name": "ហម មន្នី"
        },
        {
            "barcode": "171121673",
            "dpc": "03020901301",
            "name": "នួម  ឆៃរួម"
        },
        {
            "barcode": "171121674",
            "dpc": "03020901401",
            "name": "ម៉ក់ ផាន់ណា"
        },
        {
            "barcode": "171121675",
            "dpc": "03020901501",
            "name": "សុខ ស្រីមុំ"
        },
        {
            "barcode": "171121676",
            "dpc": "03020901601",
            "name": "ស្វាយ ថាវរិទ្ធ"
        },
        {
            "barcode": "171121677",
            "dpc": "03020901801",
            "name": "ជ័រ សុវណ្ណ"
        },
        {
            "barcode": "171121678",
            "dpc": "03020901901",
            "name": "គួយ តាំងអេង"
        },
        {
            "barcode": "171121679",
            "dpc": "03020902001",
            "name": "យិន យក់"
        },
        {
            "barcode": "171121680",
            "dpc": "03020901701",
            "name": "ពិន ស៊ីវត្ថា"
        },
        {
            "barcode": "171121681",
            "dpc": "03020902101",
            "name": "ជូរ ឆានហួត"
        },
        {
            "barcode": "171121682",
            "dpc": "03020902201",
            "name": "មុំ បុណ្យបូរិន"
        },
        {
            "barcode": "171121683",
            "dpc": "03020902301",
            "name": "ស៊ុន វ៉ាន់ណូ"
        },
        {
            "barcode": "171121684",
            "dpc": "03020910501",
            "name": "សុខ គឹមហៀក"
        },
        {
            "barcode": "171121685",
            "dpc": "03020910601",
            "name": "ម៉ុង ចាន់សារ៉េត"
        },
        {
            "barcode": "171121686",
            "dpc": "03020910701",
            "name": "សោម កញ្ញារ័ត្ន"
        },
        {
            "barcode": "171121687",
            "dpc": "03020910901",
            "name": "ឈាង សុវណ្ណា"
        },
        {
            "barcode": "171121688",
            "dpc": "03020911001",
            "name": "ហែម សិលា"
        },
        {
            "barcode": "171121689",
            "dpc": "03020911101",
            "name": "ហេង វែងឈៀង"
        },
        {
            "barcode": "171121690",
            "dpc": "03020911201",
            "name": "ប៉ាន់ នី"
        },
        {
            "barcode": "171121691",
            "dpc": "03020911301",
            "name": "ពៅ ស៊ាន"
        },
        {
            "barcode": "171121692",
            "dpc": "03020911401",
            "name": "លី ឆទិញ"
        },
        {
            "barcode": "171121693",
            "dpc": "03020911501",
            "name": "យិន កោ"
        },
        {
            "barcode": "171121694",
            "dpc": "03020911701",
            "name": "ចែង ឆុំ"
        },
        {
            "barcode": "171121695",
            "dpc": "03020911801",
            "name": "ឡុង ស្រី"
        },
        {
            "barcode": "171121696",
            "dpc": "03020911901",
            "name": "ណូ ប៊ុនធឿន"
        },
        {
            "barcode": "171121697",
            "dpc": "03020912001",
            "name": "ពៅ សុង"
        },
        {
            "barcode": "171121698",
            "dpc": "03020912101",
            "name": "អៀង គឹមថុល"
        },
        {
            "barcode": "171121699",
            "dpc": "03020912201",
            "name": "ចន  សំណាង"
        },
        {
            "barcode": "171121700",
            "dpc": "03020912301",
            "name": "ផល លាងហ៊ីម"
        },
        {
            "barcode": "171121701",
            "dpc": "03020912401",
            "name": "សេង ទៀង"
        },
        {
            "barcode": "171121702",
            "dpc": "03020912501",
            "name": "រ៉ុង ប៉ុក"
        },
        {
            "barcode": "171121703",
            "dpc": "03020912601",
            "name": "ឈឿង ឆន"
        },
        {
            "barcode": "171121704",
            "dpc": "03020912701",
            "name": "សារិ អឿន"
        },
        {
            "barcode": "171121705",
            "dpc": "03020912801",
            "name": "ចាន់ ពៅ"
        },
        {
            "barcode": "171121706",
            "dpc": "03020912901",
            "name": "ឆាយ សារ៉េត"
        },
        {
            "barcode": "171121707",
            "dpc": "03020913001",
            "name": "ហាស់ អសនី"
        },
        {
            "barcode": "171121708",
            "dpc": "03020913101",
            "name": "ឃុន ងួន(ថ្មី)"
        },
        {
            "barcode": "171121709",
            "dpc": "03020913201",
            "name": "ថោង បូរាណ"
        },
        {
            "barcode": "171121710",
            "dpc": "03020913401",
            "name": "ប៊ុន ដេត"
        },
        {
            "barcode": "171121711",
            "dpc": "03020913501",
            "name": "កែវ ហួត"
        },
        {
            "barcode": "171121712",
            "dpc": "03020913601",
            "name": "គា វណ្ណា"
        },
        {
            "barcode": "171121713",
            "dpc": "03020913701",
            "name": "សេង ហ៊ុយ"
        },
        {
            "barcode": "171121714",
            "dpc": "03020913801",
            "name": "សុខ ចាន់"
        },
        {
            "barcode": "171121715",
            "dpc": "03020913901",
            "name": "អ៊ិន ប្រាជ្ញ"
        },
        {
            "barcode": "171121716",
            "dpc": "03020914001",
            "name": "សុង ហុង (ចាស់)"
        },
        {
            "barcode": "171121717",
            "dpc": "03020914301",
            "name": "ដែង  រស្មី"
        },
        {
            "barcode": "171121718",
            "dpc": "03020914401",
            "name": "សុង ហុង (ថ្មី)"
        },
        {
            "barcode": "171121719",
            "dpc": "03020914501",
            "name": "យ៉ាំ ថោង"
        },
        {
            "barcode": "171121720",
            "dpc": "03020914601",
            "name": "ប៊ុន ហូហេង"
        },
        {
            "barcode": "171121721",
            "dpc": "03020914701",
            "name": "អ៊ឹង ប៊ុនហុង"
        },
        {
            "barcode": "171121722",
            "dpc": "03020914801",
            "name": "ដៀប ទ្រី"
        },
        {
            "barcode": "171121723",
            "dpc": "03020914901",
            "name": "វិទ្យាស្ថានវប្បធម៌បារាំង"
        },
        {
            "barcode": "171121724",
            "dpc": "03020915101",
            "name": "សុខ សុផាត ៣"
        },
        {
            "barcode": "171121725",
            "dpc": "03020915001",
            "name": "វែង ស្រ៊ុន ១"
        },
        {
            "barcode": "171121726",
            "dpc": "03020915201",
            "name": "វែង ស្រ៊ុន ៤"
        },
        {
            "barcode": "171121727",
            "dpc": "03020948001",
            "name": "ទា កង់"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
