let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171123881",
            "dpc": "03021020201",
            "name": "យាយ ឡាប"
        },
        {
            "barcode": "171123882",
            "dpc": "03021020401",
            "name": "អូន ប៊ុនថុល"
        },
        {
            "barcode": "171123883",
            "dpc": "03021020701",
            "name": "សុខ ចន្ធី"
        },
        {
            "barcode": "171123884",
            "dpc": "03021020601",
            "name": "ម៉ិល យួង"
        },
        {
            "barcode": "171123885",
            "dpc": "03021020801",
            "name": "ស៊ិន សំ"
        },
        {
            "barcode": "171123886",
            "dpc": "03021020901",
            "name": "មាស សិទ្ធិដារ៉ារិទ្ធ"
        },
        {
            "barcode": "171123887",
            "dpc": "03021021001",
            "name": "យូ ណារ៉ា"
        },
        {
            "barcode": "171123888",
            "dpc": "03021021101",
            "name": "វឿត ដារ៉ា"
        },
        {
            "barcode": "171123889",
            "dpc": "03021021201",
            "name": "សួស យឹង"
        },
        {
            "barcode": "171123890",
            "dpc": "03021021301",
            "name": "រី សារ៉ាន"
        },
        {
            "barcode": "171123891",
            "dpc": "03021021401",
            "name": "រួត ប៊ូន"
        },
        {
            "barcode": "171123892",
            "dpc": "03021021501",
            "name": "ស៊ិន សំបូ ១"
        },
        {
            "barcode": "171123893",
            "dpc": "03021021601",
            "name": "តៅ ទូច"
        },
        {
            "barcode": "171123894",
            "dpc": "03021021701",
            "name": "អ៊ឹម ចិន្ត្រា"
        },
        {
            "barcode": "171123895",
            "dpc": "03021021801",
            "name": "ឈុំ ឆាត"
        },
        {
            "barcode": "171123896",
            "dpc": "03021021901",
            "name": "សុខ នាង"
        },
        {
            "barcode": "171123897",
            "dpc": "03021022001",
            "name": "ស៊ិន សំប៊ួន ២"
        },
        {
            "barcode": "171123898",
            "dpc": "03021022101",
            "name": "ពេទ្យ និច"
        },
        {
            "barcode": "171123899",
            "dpc": "03021022201",
            "name": "ផាន់ សច្ចា"
        },
        {
            "barcode": "171123900",
            "dpc": "03021022301",
            "name": "ទ័រ វ៉ាន"
        },
        {
            "barcode": "171123901",
            "dpc": "03021022401",
            "name": "កុយ សារឿ"
        },
        {
            "barcode": "171123902",
            "dpc": "03021017201",
            "name": "ជួន ណារ៉េត"
        },
        {
            "barcode": "171123903",
            "dpc": "03021017301",
            "name": "គី រី"
        },
        {
            "barcode": "171123904",
            "dpc": "03021017401",
            "name": "ហង្ស ញ្ច៉ុក"
        },
        {
            "barcode": "171123905",
            "dpc": "03021017501",
            "name": "វ៉ាន់ សល់"
        },
        {
            "barcode": "171123906",
            "dpc": "03021017601",
            "name": "សាន នី"
        },
        {
            "barcode": "171123907",
            "dpc": "03021017701",
            "name": "នុត វទ្ធី"
        },
        {
            "barcode": "171123908",
            "dpc": "03021017801",
            "name": "ឯល សុម៉ាលីន"
        },
        {
            "barcode": "171123909",
            "dpc": "03021017901",
            "name": "សេង អ៊ុន"
        },
        {
            "barcode": "171123910",
            "dpc": "03021018001",
            "name": "ភី ភុំ"
        },
        {
            "barcode": "171123911",
            "dpc": "03021018101",
            "name": "ស៊ុន សុវន្តា"
        },
        {
            "barcode": "171123912",
            "dpc": "03021018201",
            "name": "សាម ម៉ាត់ស"
        },
        {
            "barcode": "171123913",
            "dpc": "03021018301",
            "name": "ណាន លីន"
        },
        {
            "barcode": "171123914",
            "dpc": "03021018401",
            "name": "ម៉េត នូរីយៈ"
        },
        {
            "barcode": "171123915",
            "dpc": "03021018501",
            "name": "ឡិប អះម៉ាត់"
        },
        {
            "barcode": "171123916",
            "dpc": "03021018601",
            "name": "ឯក ស៊ីនួន"
        },
        {
            "barcode": "171123917",
            "dpc": "03021018701",
            "name": "ម៉ាន ហាសាណាល់"
        },
        {
            "barcode": "171123918",
            "dpc": "03021018801",
            "name": "ចាន់ ចំណាន"
        },
        {
            "barcode": "171123919",
            "dpc": "03021018901",
            "name": "សេង សម្បត្តិ"
        },
        {
            "barcode": "171123920",
            "dpc": "03021019001",
            "name": "ម៉ាត់ យ៉ាន"
        },
        {
            "barcode": "171123921",
            "dpc": "03021019201",
            "name": "លី ឆេង"
        },
        {
            "barcode": "171123922",
            "dpc": "03021019301",
            "name": "ឡឹប រីណា"
        },
        {
            "barcode": "171123923",
            "dpc": "03021019401",
            "name": "អ៊ុន លីម"
        },
        {
            "barcode": "171123924",
            "dpc": "03021019501",
            "name": "សំរិត កាទ័រ"
        },
        {
            "barcode": "171123925",
            "dpc": "03021019601",
            "name": "មាស សាឡន"
        },
        {
            "barcode": "171123926",
            "dpc": "03021019701",
            "name": "លី សុវណ្ណ"
        },
        {
            "barcode": "171123927",
            "dpc": "03021019801",
            "name": "សួស សាវ៉ាត"
        },
        {
            "barcode": "171123928",
            "dpc": "03021020001",
            "name": "ឡាំ ប៊ុនកែវ"
        },
        {
            "barcode": "171123929",
            "dpc": "03021020101",
            "name": "ស៊ិន សុខ"
        },
        {
            "barcode": "171123930",
            "dpc": "03021022701",
            "name": "ជា ចាន់សាវុធ"
        },
        {
            "barcode": "171123931",
            "dpc": "03021022801",
            "name": "ស្មាន់ ហ្វាស់"
        },
        {
            "barcode": "171123932",
            "dpc": "03021022901",
            "name": "ស្មាន់ កាស់"
        },
        {
            "barcode": "171123933",
            "dpc": "03021023001",
            "name": "សោ ប៊ុនម៉ី"
        },
        {
            "barcode": "171123934",
            "dpc": "03021023101",
            "name": "សាន ឡឹក"
        },
        {
            "barcode": "171123935",
            "dpc": "03021023201",
            "name": "ស៊ាង ដំ"
        },
        {
            "barcode": "171123936",
            "dpc": "03021023301",
            "name": "បូ ស្រ៊ុយ"
        },
        {
            "barcode": "171123937",
            "dpc": "03021023401",
            "name": "ហាន ហ៊ួន"
        },
        {
            "barcode": "171123938",
            "dpc": "03021023601",
            "name": "អាត់ ចំរើន"
        },
        {
            "barcode": "171123939",
            "dpc": "03021023701",
            "name": "ផាន់ សាម៉ន"
        },
        {
            "barcode": "171123940",
            "dpc": "03021023801",
            "name": "ចំរើន សេរីវឌ្ឍន៍"
        },
        {
            "barcode": "171123941",
            "dpc": "03021023901",
            "name": "ស្វឺយ ប៊ុនរឿន"
        },
        {
            "barcode": "171123942",
            "dpc": "03021024001",
            "name": "សំរិត ហូល"
        },
        {
            "barcode": "171123943",
            "dpc": "03021024101",
            "name": "ប៉ិល សារុន"
        },
        {
            "barcode": "171123944",
            "dpc": "03021024201",
            "name": "គង់ ថា"
        },
        {
            "barcode": "171123945",
            "dpc": "03021024401",
            "name": "ឡាយ យ៉េប"
        },
        {
            "barcode": "171123946",
            "dpc": "03021024501",
            "name": "សេង លាងហេង"
        },
        {
            "barcode": "171123947",
            "dpc": "03021024601",
            "name": "វង្ស សុផា"
        },
        {
            "barcode": "171123948",
            "dpc": "03021024701",
            "name": "កែវ សមុទ្រ"
        },
        {
            "barcode": "171123949",
            "dpc": "03021024801",
            "name": "យឿន ចិនជូ"
        },
        {
            "barcode": "171123950",
            "dpc": "03021024901",
            "name": "យស់ សារ៉ាត់"
        },
        {
            "barcode": "171123951",
            "dpc": "03021025001",
            "name": "គា សឿន"
        },
        {
            "barcode": "171123952",
            "dpc": "03021025101",
            "name": "ជា សេង"
        },
        {
            "barcode": "171123953",
            "dpc": "03021025201",
            "name": "សៅ យ៉ុត"
        },
        {
            "barcode": "171123954",
            "dpc": "03021025301",
            "name": "ប៉ិល ហុង"
        },
        {
            "barcode": "171123955",
            "dpc": "03021025401",
            "name": "អ៊ុច សាវី"
        },
        {
            "barcode": "171123956",
            "dpc": "03021025501",
            "name": "យ៉ិន សូវៀត"
        },
        {
            "barcode": "171123957",
            "dpc": "03021025601",
            "name": "ប៉ុក វាសនា"
        },
        {
            "barcode": "171123958",
            "dpc": "03021025701",
            "name": "ពេជ្ររិន"
        },
        {
            "barcode": "171123959",
            "dpc": "03021038201",
            "name": "តាត កុសល់"
        },
        {
            "barcode": "171123960",
            "dpc": "03021038301",
            "name": "លី សុផានី"
        },
        {
            "barcode": "171123961",
            "dpc": "03021038401",
            "name": "ធូ ភី"
        },
        {
            "barcode": "171123962",
            "dpc": "03021038501",
            "name": "ចាន់ សារុំ"
        },
        {
            "barcode": "171123963",
            "dpc": "03021038601",
            "name": "ឡុង បូរី"
        },
        {
            "barcode": "171123964",
            "dpc": "03021038701",
            "name": "ញឹម  គន្ធា"
        },
        {
            "barcode": "171123965",
            "dpc": "03021038901",
            "name": "ឃឹម ហុក"
        },
        {
            "barcode": "171123966",
            "dpc": "03021039101",
            "name": "សំ គឹមជុយ"
        },
        {
            "barcode": "171123967",
            "dpc": "03021039201",
            "name": "រួន សឿន"
        },
        {
            "barcode": "171123968",
            "dpc": "03021039301",
            "name": "ដួង គន្ធា"
        },
        {
            "barcode": "171123969",
            "dpc": "03021039401",
            "name": "ឆេង សំអាត"
        },
        {
            "barcode": "171123970",
            "dpc": "03021039501",
            "name": "ទេព សារ៉ាត់"
        },
        {
            "barcode": "171123971",
            "dpc": "03021039901",
            "name": "ឌុក សូដា"
        },
        {
            "barcode": "171123972",
            "dpc": "03021040201",
            "name": "អៀង សុភី"
        },
        {
            "barcode": "171123973",
            "dpc": "03021040401",
            "name": "ភេក ជារៈ"
        },
        {
            "barcode": "171123974",
            "dpc": "03021040501",
            "name": "ទឹង សំបូរ"
        },
        {
            "barcode": "171123975",
            "dpc": "03021040701",
            "name": "អៀង យិត"
        },
        {
            "barcode": "171123976",
            "dpc": "03021040801",
            "name": "នៅ ដារីទ្ធ"
        },
        {
            "barcode": "171123977",
            "dpc": "03021040901",
            "name": "ទឹង អាង"
        },
        {
            "barcode": "171123978",
            "dpc": "03021041001",
            "name": "ឆន ហុង"
        },
        {
            "barcode": "171123979",
            "dpc": "03021041101",
            "name": "ទេស សារុន"
        },
        {
            "barcode": "171123980",
            "dpc": "03021041201",
            "name": "ញ៉ែម សុខចាន់"
        },
        {
            "barcode": "171123981",
            "dpc": "03021041401",
            "name": "សោម វណ្ណី"
        },
        {
            "barcode": "171123982",
            "dpc": "03021041501",
            "name": "ជិន បូរ៉ា"
        },
        {
            "barcode": "171123983",
            "dpc": "03021041601",
            "name": "ស្រី ឈឿន"
        },
        {
            "barcode": "171123984",
            "dpc": "03021041701",
            "name": "លេ តាល់"
        },
        {
            "barcode": "171123985",
            "dpc": "03021041801",
            "name": "កុយ សាម៉ន"
        },
        {
            "barcode": "171123986",
            "dpc": "03021041901",
            "name": "ហ៊ុន សាន"
        },
        {
            "barcode": "171123987",
            "dpc": "03021042001",
            "name": "ហុង សុខន"
        },
        {
            "barcode": "171123988",
            "dpc": "03021042101",
            "name": "កុយ គីម"
        },
        {
            "barcode": "171123989",
            "dpc": "03021042201",
            "name": "សាត សាលី"
        },
        {
            "barcode": "171123990",
            "dpc": "03021042301",
            "name": "ណាប់ ឈន"
        },
        {
            "barcode": "171123991",
            "dpc": "03021042401",
            "name": "ផាន់ វីរៈពង្ស"
        },
        {
            "barcode": "171123992",
            "dpc": "03021042501",
            "name": "វ៉ាន់ ស៊ឹមវ៉ា"
        },
        {
            "barcode": "171123993",
            "dpc": "03021042601",
            "name": "បាន នី"
        },
        {
            "barcode": "171123994",
            "dpc": "03021042701",
            "name": "កឹម  ធា"
        },
        {
            "barcode": "171123995",
            "dpc": "03021042801",
            "name": "ផាន់ ចាន់សេរី"
        },
        {
            "barcode": "171123996",
            "dpc": "03021042901",
            "name": "កិម  ឈឿន"
        },
        {
            "barcode": "171123997",
            "dpc": "03021043001",
            "name": "ខេង សុខុន"
        },
        {
            "barcode": "171123998",
            "dpc": "03021043101",
            "name": "ម៉ែន ហម"
        },
        {
            "barcode": "171123999",
            "dpc": "03021043201",
            "name": "ឈាង ង៉ែត"
        },
        {
            "barcode": "171124000",
            "dpc": "03021043301",
            "name": "ហ៊ុន សាន"
        },
        {
            "barcode": "171124001",
            "dpc": "03021043501",
            "name": "ឆន ប៊ុនឈឿន"
        },
        {
            "barcode": "171124002",
            "dpc": "03021043601",
            "name": "ថោ សាន"
        },
        {
            "barcode": "171124003",
            "dpc": "03021043701",
            "name": "រី សារ៉េត"
        },
        {
            "barcode": "171124004",
            "dpc": "03021043801",
            "name": "ជុំ សុខុន"
        },
        {
            "barcode": "171124005",
            "dpc": "03021044001",
            "name": "តំ  សុផល"
        },
        {
            "barcode": "171124006",
            "dpc": "03021047901",
            "name": "អ៊ុក ចាន់ម៉ាលី ២"
        },
        {
            "barcode": "171124007",
            "dpc": "03021047701",
            "name": "យិន សុទ្ធ"
        },
        {
            "barcode": "171124008",
            "dpc": "03021047601",
            "name": "ហេង រដ្ឋា"
        },
        {
            "barcode": "171124009",
            "dpc": "03021047301",
            "name": "ឡាច ម៉ាន់"
        },
        {
            "barcode": "171124010",
            "dpc": "03021047401",
            "name": "ឡោ វ៉ា"
        },
        {
            "barcode": "171124011",
            "dpc": "03021047201",
            "name": "ម៉ាន់ ឃៀង ២"
        },
        {
            "barcode": "171124012",
            "dpc": "03021047001",
            "name": "សេក សុន"
        },
        {
            "barcode": "171124013",
            "dpc": "03021046901",
            "name": "ម៉ាន់ ឃៀង ១"
        },
        {
            "barcode": "171124014",
            "dpc": "03021045201",
            "name": "អ៊ឹម ឈុន"
        },
        {
            "barcode": "171124015",
            "dpc": "03021045001",
            "name": "ផេង ទ្រូ"
        },
        {
            "barcode": "171124016",
            "dpc": "03021045101",
            "name": "ប៉ិច ឌឿន"
        },
        {
            "barcode": "171124017",
            "dpc": "03021044901",
            "name": "អ៊ុក ប៊ុនរ៉ាស៊ី"
        },
        {
            "barcode": "171124018",
            "dpc": "03021044501",
            "name": "គឹម លាង"
        },
        {
            "barcode": "171124019",
            "dpc": "03021044201",
            "name": "អៅ តុង"
        },
        {
            "barcode": "171124020",
            "dpc": "03021044101",
            "name": "ប៊ិន សាវ៉ាត់"
        },
        {
            "barcode": "171124021",
            "dpc": "03021046801",
            "name": "អ៊ិន ឆុន"
        },
        {
            "barcode": "171124022",
            "dpc": "03021046701",
            "name": "អាន រ៉េត"
        },
        {
            "barcode": "171124023",
            "dpc": "03021046501",
            "name": "វង្ស រ៉ាវី"
        },
        {
            "barcode": "171124024",
            "dpc": "03021046201",
            "name": "មាស សាឯម"
        },
        {
            "barcode": "171124025",
            "dpc": "03021046101",
            "name": "កៅ សេក"
        },
        {
            "barcode": "171124026",
            "dpc": "03021046001",
            "name": "ប៊ុន ណាន"
        },
        {
            "barcode": "171124027",
            "dpc": "03021045901",
            "name": "ថោង គឹមលាន"
        },
        {
            "barcode": "171124028",
            "dpc": "03021045801",
            "name": "គឺម   ចន្ថា"
        },
        {
            "barcode": "171124029",
            "dpc": "03021045701",
            "name": "ភោគ ថន"
        },
        {
            "barcode": "171124030",
            "dpc": "03021045601",
            "name": "សួស ប៉ិច"
        },
        {
            "barcode": "171124031",
            "dpc": "03021045501",
            "name": "កិម  ខាន"
        },
        {
            "barcode": "171124032",
            "dpc": "03021045401",
            "name": "សុខ ឈឿន"
        },
        {
            "barcode": "171124033",
            "dpc": "03021045301",
            "name": "ញ៉ា វុទ្ធី"
        },
        {
            "barcode": "171124034",
            "dpc": "03021046601",
            "name": "វ័រ សោភ័ណ្ឌ"
        },
        {
            "barcode": "171124035",
            "dpc": "03021025801",
            "name": "ឡាវ ថៃ"
        },
        {
            "barcode": "171124036",
            "dpc": "03021025901",
            "name": "អៀង សិលា"
        },
        {
            "barcode": "171124037",
            "dpc": "03021026001",
            "name": "សុខ សីរីវឌ្ឍនា"
        },
        {
            "barcode": "171124038",
            "dpc": "03021026301",
            "name": "វិន ស៊ាប"
        },
        {
            "barcode": "171124039",
            "dpc": "03021026401",
            "name": "តៅ លី"
        },
        {
            "barcode": "171124040",
            "dpc": "03021026501",
            "name": "ម៉ាត់ សុខគ្រី"
        },
        {
            "barcode": "171124041",
            "dpc": "03021026601",
            "name": "ឡឹម វ៉ាន់នី"
        },
        {
            "barcode": "171124042",
            "dpc": "03021026701",
            "name": "ម៉ៅ ឡង់"
        },
        {
            "barcode": "171124043",
            "dpc": "03021026801",
            "name": "អៀម សុធា"
        },
        {
            "barcode": "171124044",
            "dpc": "03021026901",
            "name": "ឡាយ រិទ្ធវង្ស"
        },
        {
            "barcode": "171124045",
            "dpc": "03021026201",
            "name": "ប៊ុត សារ៉េត"
        },
        {
            "barcode": "171124046",
            "dpc": "03021026101",
            "name": "មៀច ឈាន"
        },
        {
            "barcode": "171124047",
            "dpc": "03021027101",
            "name": "ឃួន ហួយលាង"
        },
        {
            "barcode": "171124048",
            "dpc": "03021027001",
            "name": "ចាន់ ថាវី"
        },
        {
            "barcode": "171124049",
            "dpc": "03021027201",
            "name": "កុង ស៊ីវ"
        },
        {
            "barcode": "171124050",
            "dpc": "03021027301",
            "name": "មៀវ សុងនី"
        },
        {
            "barcode": "171124051",
            "dpc": "03021027401",
            "name": "មៀវ គឹមហ៊ួរ"
        },
        {
            "barcode": "171124052",
            "dpc": "03021027701",
            "name": "គឹម ឃោ"
        },
        {
            "barcode": "171124053",
            "dpc": "03021027801",
            "name": "សុខ ហេង"
        },
        {
            "barcode": "171124054",
            "dpc": "03021027901",
            "name": "អ៊ុង ស៊ីថា"
        },
        {
            "barcode": "171124055",
            "dpc": "03021028001",
            "name": "ហូ រចនា"
        },
        {
            "barcode": "171124056",
            "dpc": "03021028101",
            "name": "វ៉ាន់ រីម"
        },
        {
            "barcode": "171124057",
            "dpc": "03021028201",
            "name": "ហៀម គ្រៃ"
        },
        {
            "barcode": "171124058",
            "dpc": "03021028301",
            "name": "អ៊ី ធិន"
        },
        {
            "barcode": "171124059",
            "dpc": "03021028501",
            "name": "មេត សាមីត"
        },
        {
            "barcode": "171124060",
            "dpc": "03021028601",
            "name": "គេវ ទៀង"
        },
        {
            "barcode": "171124061",
            "dpc": "03021028701",
            "name": "អាប់ ម៉ាប់"
        },
        {
            "barcode": "171124062",
            "dpc": "03021028801",
            "name": "អ៊ុយ ឈាន"
        },
        {
            "barcode": "171124063",
            "dpc": "03021028901",
            "name": "ជា ផូ"
        },
        {
            "barcode": "171124064",
            "dpc": "03021029001",
            "name": "លីវ ហ៊ួរ"
        },
        {
            "barcode": "171124065",
            "dpc": "03021029101",
            "name": "សាន លួន"
        },
        {
            "barcode": "171124066",
            "dpc": "03021029201",
            "name": "សួន ឃឿន"
        },
        {
            "barcode": "171124067",
            "dpc": "03021029301",
            "name": "សំ ឡេង"
        },
        {
            "barcode": "171124068",
            "dpc": "03021029401",
            "name": "លី សានផូ"
        },
        {
            "barcode": "171124069",
            "dpc": "03021019101",
            "name": "កៃ  សុខុម"
        },
        {
            "barcode": "171124070",
            "dpc": "03021023501",
            "name": "គង់ សុភ័ណ្ឌ"
        },
        {
            "barcode": "171124071",
            "dpc": "03021034801",
            "name": "អ៊ឹម ផាត់"
        },
        {
            "barcode": "171124072",
            "dpc": "03021034901",
            "name": "អឿន ប៊ុនថុល"
        },
        {
            "barcode": "171124073",
            "dpc": "03021044401",
            "name": "យុន   រ៉ាអ៊ូល"
        },
        {
            "barcode": "171124074",
            "dpc": "03021029601",
            "name": "អឿង  ជឿន"
        },
        {
            "barcode": "171124075",
            "dpc": "03021029501",
            "name": "អៀង សុកខន"
        },
        {
            "barcode": "171124076",
            "dpc": "03021029701",
            "name": "ពឹង ថៃហេង"
        },
        {
            "barcode": "171124077",
            "dpc": "03021029801",
            "name": "ពិន សាន"
        },
        {
            "barcode": "171124078",
            "dpc": "03021029901",
            "name": "ខោ វិរៈ"
        },
        {
            "barcode": "171124079",
            "dpc": "03021030001",
            "name": "សុខ ញ៉"
        },
        {
            "barcode": "171124080",
            "dpc": "03021030101",
            "name": "លឹម លី"
        },
        {
            "barcode": "171124081",
            "dpc": "03021030201",
            "name": "ម៉ាត់ ឯល"
        },
        {
            "barcode": "171124082",
            "dpc": "03021030301",
            "name": "មិន ណី"
        },
        {
            "barcode": "171124083",
            "dpc": "03021030401",
            "name": "ផាន់ អ៊ឹសេរី"
        },
        {
            "barcode": "171124084",
            "dpc": "03021030501",
            "name": "សឿន ស៊ីថា"
        },
        {
            "barcode": "171124085",
            "dpc": "03021030601",
            "name": "ព្រំ ភួង"
        },
        {
            "barcode": "171124086",
            "dpc": "03021030701",
            "name": "ហាំង ឡេង"
        },
        {
            "barcode": "171124087",
            "dpc": "03021030801",
            "name": "ចាន់ មៀន"
        },
        {
            "barcode": "171124088",
            "dpc": "03021030901",
            "name": "ម៉ក់ ឆៃរិទ្ធ"
        },
        {
            "barcode": "171124089",
            "dpc": "03021031101",
            "name": "យ៉ាំ វុទ្ធានី"
        },
        {
            "barcode": "171124090",
            "dpc": "03021031301",
            "name": "ចាន់ គឹមឡេង"
        },
        {
            "barcode": "171124091",
            "dpc": "03021031401",
            "name": "ហួត វ៉ាន់ថន"
        },
        {
            "barcode": "171124092",
            "dpc": "03021031601",
            "name": "កើង ភឿង"
        },
        {
            "barcode": "171124093",
            "dpc": "03021031801",
            "name": "ដួង សារឿន"
        },
        {
            "barcode": "171124094",
            "dpc": "03021032001",
            "name": "ម៉ៅ សាវ៉ាត"
        },
        {
            "barcode": "171124095",
            "dpc": "03021032101",
            "name": "ហុត សុភាព"
        },
        {
            "barcode": "171124096",
            "dpc": "03021032201",
            "name": "ជា សុខ"
        },
        {
            "barcode": "171124097",
            "dpc": "03021032301",
            "name": "ស៊ីម សាម៉ន"
        },
        {
            "barcode": "171124098",
            "dpc": "03021032401",
            "name": "ព្រំ វិបុល"
        },
        {
            "barcode": "171124099",
            "dpc": "03021032501",
            "name": "អ៊ុង ជឿន"
        },
        {
            "barcode": "171124100",
            "dpc": "03021031901",
            "name": "ទុយ ចិន្តា"
        },
        {
            "barcode": "171124101",
            "dpc": "03021032601",
            "name": "អ៊ុង សារុំ"
        },
        {
            "barcode": "171124102",
            "dpc": "03021032701",
            "name": "វ៉ាន់ ចាន់នី"
        },
        {
            "barcode": "171124103",
            "dpc": "03021033101",
            "name": "យាន  បូរិន"
        },
        {
            "barcode": "171124104",
            "dpc": "03021033201",
            "name": "ទួន ភាព"
        },
        {
            "barcode": "171124105",
            "dpc": "03021033401",
            "name": "ឆាយ សុភាព"
        },
        {
            "barcode": "171124106",
            "dpc": "03021033501",
            "name": "ចាន់ សារី"
        },
        {
            "barcode": "171124107",
            "dpc": "03021033601",
            "name": "សេង សៀន"
        },
        {
            "barcode": "171124108",
            "dpc": "03021033701",
            "name": "ហែម ផល្លី"
        },
        {
            "barcode": "171124109",
            "dpc": "03021033801",
            "name": "ឡោ ស៊ីណយ"
        },
        {
            "barcode": "171124110",
            "dpc": "03021033901",
            "name": "សែម សុំ"
        },
        {
            "barcode": "171124111",
            "dpc": "03021034001",
            "name": "ចាន់ ស្រីមុំ"
        },
        {
            "barcode": "171124112",
            "dpc": "03021034101",
            "name": "ឆាយ ស៊ីណា"
        },
        {
            "barcode": "171124113",
            "dpc": "03021034201",
            "name": "ពន សារឿន"
        },
        {
            "barcode": "171124114",
            "dpc": "03021034301",
            "name": "កែម វង្ស"
        },
        {
            "barcode": "171124115",
            "dpc": "03021034401",
            "name": "កើង ស៊ីណែត"
        },
        {
            "barcode": "171124116",
            "dpc": "03021034501",
            "name": "ព្រួញ វល័ក្ខ"
        },
        {
            "barcode": "171124117",
            "dpc": "03021034601",
            "name": "ទេស សុផាត"
        },
        {
            "barcode": "171124118",
            "dpc": "03021034701",
            "name": "ទូច សារ៉ន"
        },
        {
            "barcode": "171124119",
            "dpc": "03021035101",
            "name": "លឿង ធីលី"
        },
        {
            "barcode": "171124120",
            "dpc": "03021035201",
            "name": "អ៊ិត ឆម"
        },
        {
            "barcode": "171124121",
            "dpc": "03021035701",
            "name": "ដៀប កែវមុន្នី"
        },
        {
            "barcode": "171124122",
            "dpc": "03021035801",
            "name": "ដៀប ចិន្តា"
        },
        {
            "barcode": "171124123",
            "dpc": "03021035401",
            "name": "ផេង អេង"
        },
        {
            "barcode": "171124124",
            "dpc": "03021035501",
            "name": "គឹម ហេង"
        },
        {
            "barcode": "171124125",
            "dpc": "03021035601",
            "name": "សុង គា"
        },
        {
            "barcode": "171124126",
            "dpc": "03021035901",
            "name": "អេង ខេង"
        },
        {
            "barcode": "171124127",
            "dpc": "03021036001",
            "name": "ង៉ែត សុវណ្ណ"
        },
        {
            "barcode": "171124128",
            "dpc": "03021036101",
            "name": "លាង ហ៊ាង"
        },
        {
            "barcode": "171124129",
            "dpc": "03021037001",
            "name": "ឃិន សូរិយា"
        },
        {
            "barcode": "171124130",
            "dpc": "03021036901",
            "name": "សោម សុធា"
        },
        {
            "barcode": "171124131",
            "dpc": "03021036801",
            "name": "សោម សិទ្ធគុណ"
        },
        {
            "barcode": "171124132",
            "dpc": "03021036701",
            "name": "ស៊  គឹមហាក់"
        },
        {
            "barcode": "171124133",
            "dpc": "03021036501",
            "name": "មាស សារ៉េត"
        },
        {
            "barcode": "171124134",
            "dpc": "03021036401",
            "name": "សោម សុវត្តិ"
        },
        {
            "barcode": "171124135",
            "dpc": "03021036301",
            "name": "សោម អូន"
        },
        {
            "barcode": "171124136",
            "dpc": "03021036201",
            "name": "សុខ វង្ស"
        },
        {
            "barcode": "171124137",
            "dpc": "03021037201",
            "name": "គឿង ហុង ១"
        },
        {
            "barcode": "171124138",
            "dpc": "03021037301",
            "name": "គឿង ហុង ២"
        },
        {
            "barcode": "171124139",
            "dpc": "03021037401",
            "name": "ឈួន ឆៃលី"
        },
        {
            "barcode": "171124140",
            "dpc": "03021037501",
            "name": "លឹម ប៉ិច ២"
        },
        {
            "barcode": "171124141",
            "dpc": "03021037601",
            "name": "ឈាន ប៊ុនហាប់"
        },
        {
            "barcode": "171124142",
            "dpc": "03021037701",
            "name": "ឈាន ប៊ុនហ៊ីម"
        },
        {
            "barcode": "171124143",
            "dpc": "03021037801",
            "name": "ហូ ឡាវ"
        },
        {
            "barcode": "171124144",
            "dpc": "03021037901",
            "name": "ហេង ប៊ុនលឿត"
        },
        {
            "barcode": "171124145",
            "dpc": "03021038001",
            "name": "ខៀវ សំអុល"
        },
        {
            "barcode": "171124146",
            "dpc": "03021038101",
            "name": "លឹម គឹមសុង"
        },
        {
            "barcode": "171124147",
            "dpc": "03021000101",
            "name": "តាំង ពេជ្រ"
        },
        {
            "barcode": "171124148",
            "dpc": "03021000201",
            "name": "ហេង ឆៃវែង"
        },
        {
            "barcode": "171124149",
            "dpc": "03021000301",
            "name": "ឌួង វុទ្ធី"
        },
        {
            "barcode": "171124150",
            "dpc": "03021002701",
            "name": "ប៊ុន ងិន"
        },
        {
            "barcode": "171124151",
            "dpc": "03021002501",
            "name": "តាំង ប៊ុនហោរ"
        },
        {
            "barcode": "171124152",
            "dpc": "03021002801",
            "name": "កាំង ឡេង"
        },
        {
            "barcode": "171124153",
            "dpc": "03021003101",
            "name": "សី តាំងអោ"
        },
        {
            "barcode": "171124154",
            "dpc": "03021003201",
            "name": "យូ ម៉េង"
        },
        {
            "barcode": "171124155",
            "dpc": "03021003301",
            "name": "ឈូ គា"
        },
        {
            "barcode": "171124156",
            "dpc": "03021003401",
            "name": "ហេង ចេង"
        },
        {
            "barcode": "171124157",
            "dpc": "03021003501",
            "name": "វែង ឡាយ"
        },
        {
            "barcode": "171124158",
            "dpc": "03021003601",
            "name": "យូ ហុង"
        },
        {
            "barcode": "171124159",
            "dpc": "03021003701",
            "name": "គង់ ខេង"
        },
        {
            "barcode": "171124160",
            "dpc": "03021003901",
            "name": "ម៉ាន់ សុម៉ាលី"
        },
        {
            "barcode": "171124161",
            "dpc": "03021004001",
            "name": "ទន់ សុផល"
        },
        {
            "barcode": "171124162",
            "dpc": "03021004101",
            "name": "គឹម ណារី"
        },
        {
            "barcode": "171124163",
            "dpc": "03021004201",
            "name": "ជាតិ ប៉ែត"
        },
        {
            "barcode": "171124164",
            "dpc": "03021004301",
            "name": "សុខ ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171124165",
            "dpc": "03021004701",
            "name": "ពុយ សុជាតា"
        },
        {
            "barcode": "171124166",
            "dpc": "03021004801",
            "name": "សោម ឡេង"
        },
        {
            "barcode": "171124167",
            "dpc": "03021004901",
            "name": "ឡុង ហ៊ាង"
        },
        {
            "barcode": "171124168",
            "dpc": "03021005001",
            "name": "ឡុង ជីវ"
        },
        {
            "barcode": "171124169",
            "dpc": "03021005101",
            "name": "យិន កុឡាប"
        },
        {
            "barcode": "171124170",
            "dpc": "03021005201",
            "name": "សេក សារុន"
        },
        {
            "barcode": "171124171",
            "dpc": "03021005301",
            "name": "តា តោ"
        },
        {
            "barcode": "171124172",
            "dpc": "03021005501",
            "name": "យូ រ៉ានី"
        },
        {
            "barcode": "171124173",
            "dpc": "03021005601",
            "name": "អ៊ិត សាវុធ"
        },
        {
            "barcode": "171124174",
            "dpc": "03021005701",
            "name": "ឡោ ម៉េងគង"
        },
        {
            "barcode": "171124175",
            "dpc": "03021005801",
            "name": "ស៊ីវ តិច"
        },
        {
            "barcode": "171124176",
            "dpc": "03021001501",
            "name": "ស៊ីវ សារឿន"
        },
        {
            "barcode": "171124177",
            "dpc": "03021001301",
            "name": "ស្រេង ងួន"
        },
        {
            "barcode": "171124178",
            "dpc": "03021001701",
            "name": "យូ រ៉ាណេ"
        },
        {
            "barcode": "171124179",
            "dpc": "03021001801",
            "name": "ឃួន គង់"
        },
        {
            "barcode": "171124180",
            "dpc": "03021002101",
            "name": "អេង ធិន"
        },
        {
            "barcode": "171124181",
            "dpc": "03021002201",
            "name": "សាយ ពេក"
        },
        {
            "barcode": "171124182",
            "dpc": "03021002601",
            "name": "ធា លីម"
        },
        {
            "barcode": "171124183",
            "dpc": "03021002401",
            "name": "ហ្វង់ ឌ័រ"
        },
        {
            "barcode": "171124184",
            "dpc": "03021002001",
            "name": "ម៉ក់ មិត្ត"
        },
        {
            "barcode": "171124185",
            "dpc": "03021001901",
            "name": "អាង អេងសួរ"
        },
        {
            "barcode": "171124186",
            "dpc": "03021001601",
            "name": "ឈូ គា"
        },
        {
            "barcode": "171124187",
            "dpc": "03021001201",
            "name": "ស្រេង សៀន"
        },
        {
            "barcode": "171124188",
            "dpc": "03021001101",
            "name": "សេង ស៊្រុន"
        },
        {
            "barcode": "171124189",
            "dpc": "03021001001",
            "name": "សាយ ញឹប"
        },
        {
            "barcode": "171124190",
            "dpc": "03021000901",
            "name": "ឡុង ប៉េងសៀត"
        },
        {
            "barcode": "171124191",
            "dpc": "03021000801",
            "name": "សុខ សុជាតិ"
        },
        {
            "barcode": "171124192",
            "dpc": "03021000701",
            "name": "ប៉ិច ចាន់ធឿន"
        },
        {
            "barcode": "171124193",
            "dpc": "03021000501",
            "name": "បុត ផល្លី"
        },
        {
            "barcode": "171124194",
            "dpc": "03021000401",
            "name": "យិន  ស៊ុនណារី"
        },
        {
            "barcode": "171124195",
            "dpc": "03021005901",
            "name": "សៀក អូន"
        },
        {
            "barcode": "171124196",
            "dpc": "03021006001",
            "name": "ហេង ហៀង"
        },
        {
            "barcode": "171124197",
            "dpc": "03021006101",
            "name": "សុង ហេង"
        },
        {
            "barcode": "171124198",
            "dpc": "03021006201",
            "name": "អ៊ូច ចំណាន"
        },
        {
            "barcode": "171124199",
            "dpc": "03021006301",
            "name": "លឹម សៀង"
        },
        {
            "barcode": "171124200",
            "dpc": "03021006401",
            "name": "ប្រាក់ សារ៉ូ"
        },
        {
            "barcode": "171124201",
            "dpc": "03021006501",
            "name": "គឹម ចាន់លី"
        },
        {
            "barcode": "171124202",
            "dpc": "03021006601",
            "name": "តុង សារុន"
        },
        {
            "barcode": "171124203",
            "dpc": "03021006701",
            "name": "ងួន លី"
        },
        {
            "barcode": "171124204",
            "dpc": "03021006801",
            "name": "ហោ អ៊ូ"
        },
        {
            "barcode": "171124205",
            "dpc": "03021006901",
            "name": "អ៊ិត សុផល"
        },
        {
            "barcode": "171124206",
            "dpc": "03021007001",
            "name": "ឆែ អ៊ាប"
        },
        {
            "barcode": "171124207",
            "dpc": "03021007101",
            "name": "សេង ទៀង"
        },
        {
            "barcode": "171124208",
            "dpc": "03021007201",
            "name": "សេង ពីវ"
        },
        {
            "barcode": "171124209",
            "dpc": "03021007301",
            "name": "លី ហុង"
        },
        {
            "barcode": "171124210",
            "dpc": "03021007401",
            "name": "និន សានិត"
        },
        {
            "barcode": "171124211",
            "dpc": "03021007501",
            "name": "តោ គង់"
        },
        {
            "barcode": "171124212",
            "dpc": "03021007601",
            "name": "យ៉ុន ម៉ៅ"
        },
        {
            "barcode": "171124213",
            "dpc": "03021007701",
            "name": "រិន  ឡេង"
        },
        {
            "barcode": "171124214",
            "dpc": "03021007801",
            "name": "ជាតិ ហុង"
        },
        {
            "barcode": "171124215",
            "dpc": "03021007901",
            "name": "តាំង ទីគា"
        },
        {
            "barcode": "171124216",
            "dpc": "03021008001",
            "name": "គា ឆេង"
        },
        {
            "barcode": "171124217",
            "dpc": "03021008201",
            "name": "ផូ ផុន"
        },
        {
            "barcode": "171124218",
            "dpc": "03021008301",
            "name": "សុខ ទី"
        },
        {
            "barcode": "171124219",
            "dpc": "03021008401",
            "name": "វៀច ហ៊ុន"
        },
        {
            "barcode": "171124220",
            "dpc": "03021008501",
            "name": "អុំ វុន"
        },
        {
            "barcode": "171124221",
            "dpc": "03021008701",
            "name": "ខ្លូត សាង៉ែត"
        },
        {
            "barcode": "171124222",
            "dpc": "03021008801",
            "name": "ជិង វ៉ាន់ស៊ី"
        },
        {
            "barcode": "171124223",
            "dpc": "03021008901",
            "name": "កែវ ផៃរោត"
        },
        {
            "barcode": "171124224",
            "dpc": "03021009101",
            "name": "សយ វណ្ណី"
        },
        {
            "barcode": "171124225",
            "dpc": "03021009201",
            "name": "អ៊ុក ផល្លា"
        },
        {
            "barcode": "171124226",
            "dpc": "03021009301",
            "name": "វ៉ាន់ គីរី"
        },
        {
            "barcode": "171124227",
            "dpc": "03021009401",
            "name": "ហង្ស គាន"
        },
        {
            "barcode": "171124228",
            "dpc": "03021009501",
            "name": "សៅ ភីណា"
        },
        {
            "barcode": "171124229",
            "dpc": "03021009601",
            "name": "កោ ឈុនឡេង"
        },
        {
            "barcode": "171124230",
            "dpc": "03021009801",
            "name": "ឈុន សៀក"
        },
        {
            "barcode": "171124231",
            "dpc": "03021009901",
            "name": "ឡុង ឡាយ"
        },
        {
            "barcode": "171124232",
            "dpc": "03021010001",
            "name": "ប៊ិន ប៉ូច"
        },
        {
            "barcode": "171124233",
            "dpc": "03021010101",
            "name": "មូល សុភី"
        },
        {
            "barcode": "171124234",
            "dpc": "03021010201",
            "name": "សូរ ច័ន្ទសុគន្ធ"
        },
        {
            "barcode": "171124235",
            "dpc": "03021010301",
            "name": "ឆ វិកុល"
        },
        {
            "barcode": "171124236",
            "dpc": "03021010401",
            "name": "ហោ ហួយ"
        },
        {
            "barcode": "171124237",
            "dpc": "03021010501",
            "name": "អ៊ិន ណារ៉ុង"
        },
        {
            "barcode": "171124238",
            "dpc": "03021010601",
            "name": "ឆេង គឹមឆាយ"
        },
        {
            "barcode": "171124239",
            "dpc": "03021010701",
            "name": "ឡោ ឌី"
        },
        {
            "barcode": "171124240",
            "dpc": "03021010801",
            "name": "ឡោ ឌៀន"
        },
        {
            "barcode": "171124241",
            "dpc": "03021010901",
            "name": "ទួន ទ្រី"
        },
        {
            "barcode": "171124242",
            "dpc": "03021011001",
            "name": "ប៉ោ ឯម"
        },
        {
            "barcode": "171124243",
            "dpc": "03021011101",
            "name": "គឹម ពេញ"
        },
        {
            "barcode": "171124244",
            "dpc": "03021011201",
            "name": "អ៊ឹង រ៉ែកប៉ា"
        },
        {
            "barcode": "171124245",
            "dpc": "03021011301",
            "name": "សៀង ប៊ុនធី"
        },
        {
            "barcode": "171124246",
            "dpc": "03021011401",
            "name": "យក់ វណ្ណឆវី"
        },
        {
            "barcode": "171124247",
            "dpc": "03021011501",
            "name": "គង់ ឆេង"
        },
        {
            "barcode": "171124248",
            "dpc": "03021011601",
            "name": "តាំង ប៉ាក់ស្រេង"
        },
        {
            "barcode": "171124249",
            "dpc": "03021011701",
            "name": "ហែម លី"
        },
        {
            "barcode": "171124250",
            "dpc": "03021011801",
            "name": "ទិត្យ តែម"
        },
        {
            "barcode": "171124251",
            "dpc": "03021011901",
            "name": "លី ឡុង"
        },
        {
            "barcode": "171124252",
            "dpc": "03021012101",
            "name": "អ៊ឹង ម៉េងទី"
        },
        {
            "barcode": "171124253",
            "dpc": "03021012201",
            "name": "ឡាយ គីម"
        },
        {
            "barcode": "171124254",
            "dpc": "03021012301",
            "name": "តាំង ស៊ូងួន"
        },
        {
            "barcode": "171124255",
            "dpc": "03021012401",
            "name": "គឹម សេង"
        },
        {
            "barcode": "171124256",
            "dpc": "03021012501",
            "name": "យក់ វណ្ណឆវី ២"
        },
        {
            "barcode": "171124257",
            "dpc": "03021012601",
            "name": "ឡុង សាន"
        },
        {
            "barcode": "171124258",
            "dpc": "03021012701",
            "name": "សិទ្ធិ សារ៉ាយ"
        },
        {
            "barcode": "171124259",
            "dpc": "03021012801",
            "name": "ស៊ុន សិត"
        },
        {
            "barcode": "171124260",
            "dpc": "03021012901",
            "name": "ភា ភាព"
        },
        {
            "barcode": "171124261",
            "dpc": "03021013001",
            "name": "ថុង គឹមហេង"
        },
        {
            "barcode": "171124262",
            "dpc": "03021013101",
            "name": "សៅ សុខន"
        },
        {
            "barcode": "171124263",
            "dpc": "03021013201",
            "name": "ទុយ ផា"
        },
        {
            "barcode": "171124264",
            "dpc": "03021013301",
            "name": "វឿង សែម"
        },
        {
            "barcode": "171124265",
            "dpc": "03021013401",
            "name": "អ៊ុក មុនី"
        },
        {
            "barcode": "171124266",
            "dpc": "03021013501",
            "name": "អ៊ឹង ង៉ក់ហូរ"
        },
        {
            "barcode": "171124267",
            "dpc": "03021013601",
            "name": "ឆាយ ស៊ីណា"
        },
        {
            "barcode": "171124268",
            "dpc": "03021013701",
            "name": "ពេជ្រ ឡា"
        },
        {
            "barcode": "171124269",
            "dpc": "03021013801",
            "name": "យ៉ង ធី"
        },
        {
            "barcode": "171124270",
            "dpc": "03021013901",
            "name": "ជឹម គឹមសៀង"
        },
        {
            "barcode": "171124271",
            "dpc": "03021014001",
            "name": "ម៉ក់ សុថេប"
        },
        {
            "barcode": "171124272",
            "dpc": "03021014101",
            "name": "ឃួន វ៉ិច"
        },
        {
            "barcode": "171124273",
            "dpc": "03021014201",
            "name": "ហួត  ហ៊ន"
        },
        {
            "barcode": "171124274",
            "dpc": "03021014301",
            "name": "ស្រី ហ៊ុច"
        },
        {
            "barcode": "171124275",
            "dpc": "03021014401",
            "name": "ស៊ឹម សុវណ្ណ"
        },
        {
            "barcode": "171124276",
            "dpc": "03021014501",
            "name": "រឿប សាមឿត"
        },
        {
            "barcode": "171124277",
            "dpc": "03021014601",
            "name": "ឡុង ចន្ថា"
        },
        {
            "barcode": "171124278",
            "dpc": "03021014701",
            "name": "ហាំង យូរ"
        },
        {
            "barcode": "171124279",
            "dpc": "03021014801",
            "name": "ស្រី សាម៉េត"
        },
        {
            "barcode": "171124280",
            "dpc": "03021014901",
            "name": "សាវ រ៉ន"
        },
        {
            "barcode": "171124281",
            "dpc": "03021015001",
            "name": "គង់ សាន"
        },
        {
            "barcode": "171124282",
            "dpc": "03021015101",
            "name": "គុជ លី"
        },
        {
            "barcode": "171124283",
            "dpc": "03021015201",
            "name": "ឡាយ កុសល់"
        },
        {
            "barcode": "171124284",
            "dpc": "03021015301",
            "name": "ម៉ែន សូរ"
        },
        {
            "barcode": "171124285",
            "dpc": "03021015401",
            "name": "សាន់ សាម៉ន"
        },
        {
            "barcode": "171124286",
            "dpc": "03021015501",
            "name": "នូវ  កៀវ"
        },
        {
            "barcode": "171124287",
            "dpc": "03021015601",
            "name": "សេង ហុង"
        },
        {
            "barcode": "171124288",
            "dpc": "03021015701",
            "name": "ខាត់ សារ៉េត"
        },
        {
            "barcode": "171124289",
            "dpc": "03021015801",
            "name": "ឡេង វាសនា"
        },
        {
            "barcode": "171124290",
            "dpc": "03021015901",
            "name": "តាន់ អេង"
        },
        {
            "barcode": "171124291",
            "dpc": "03021016001",
            "name": "សេង ណាវី"
        },
        {
            "barcode": "171124292",
            "dpc": "03021016101",
            "name": "គង់ ពៅ"
        },
        {
            "barcode": "171124293",
            "dpc": "03021016201",
            "name": "គឹម លី"
        },
        {
            "barcode": "171124294",
            "dpc": "03021016301",
            "name": "មាស វ៉ាន់ណន"
        },
        {
            "barcode": "171124295",
            "dpc": "03021016401",
            "name": "ទូច គឹមហេង"
        },
        {
            "barcode": "171124296",
            "dpc": "03021016701",
            "name": "យឹម ភ័ណ្ឌ"
        },
        {
            "barcode": "171124297",
            "dpc": "03021016801",
            "name": "ជ័យ ភី"
        },
        {
            "barcode": "171124298",
            "dpc": "03021016901",
            "name": "ផេង ភើយ"
        },
        {
            "barcode": "171124299",
            "dpc": "03021017001",
            "name": "ឡោ ហៀង"
        },
        {
            "barcode": "171124300",
            "dpc": "03021035001",
            "name": "ផល   មី"
        },
        {
            "barcode": "171124301",
            "dpc": "03021035301",
            "name": "ងិន   សួម"
        },
        {
            "barcode": "171124302",
            "dpc": "03021043901",
            "name": "ប៊ុន  ស្រីម៉ៅ"
        },
        {
            "barcode": "171124303",
            "dpc": "03021044301",
            "name": "ជឿម  សេង"
        },
        {
            "barcode": "171124304",
            "dpc": "03021044601",
            "name": "ហ៊ិន  វ៉ាន់"
        },
        {
            "barcode": "171124305",
            "dpc": "03021044701",
            "name": "ចៅ  សម្បត្តិ"
        },
        {
            "barcode": "171124306",
            "dpc": "03021044801",
            "name": "ជុំ  រោយ"
        },
        {
            "barcode": "171124307",
            "dpc": "03021048001",
            "name": "ហេង លីណា"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
