let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171126030",
            "dpc": "03021109601",
            "name": "អ៊ុក ហ៊ន(ត្នោតជុំ)"
        },
        {
            "barcode": "171126031",
            "dpc": "03021143701",
            "name": "យ៉ិប គង់"
        },
        {
            "barcode": "171126032",
            "dpc": "03021137301",
            "name": "ម៉ាត់ ម៉ាន"
        },
        {
            "barcode": "171126033",
            "dpc": "03021109701",
            "name": "ឯល សាឡេះ"
        },
        {
            "barcode": "171126034",
            "dpc": "03021143301",
            "name": "ឃឹម សុជាតិ"
        },
        {
            "barcode": "171126035",
            "dpc": "03021109101",
            "name": "ហ៊ីម អាហ្ស៉ីប"
        },
        {
            "barcode": "171126036",
            "dpc": "03021114601",
            "name": "លី ប៊ុនលេខ"
        },
        {
            "barcode": "171126037",
            "dpc": "03021125101",
            "name": "វាំង បូរ៉ា"
        },
        {
            "barcode": "171126038",
            "dpc": "03021125201",
            "name": "វឿត ចាន់ធឿន"
        },
        {
            "barcode": "171126039",
            "dpc": "03021130101",
            "name": "ភឿង សុភ័ក្ត"
        },
        {
            "barcode": "171126040",
            "dpc": "03021143501",
            "name": "ហៃ ហេង"
        },
        {
            "barcode": "171126041",
            "dpc": "03021143601",
            "name": "សួន សារ៉ើន"
        },
        {
            "barcode": "171126042",
            "dpc": "03021109201",
            "name": "សូ រិហ្វីន"
        },
        {
            "barcode": "171126043",
            "dpc": "03021109301",
            "name": "សួន សុធា"
        },
        {
            "barcode": "171126044",
            "dpc": "03021119701",
            "name": "ទឹង ហាំងផូ"
        },
        {
            "barcode": "171126045",
            "dpc": "03021137501",
            "name": "ព្រំ លៀប"
        },
        {
            "barcode": "171126046",
            "dpc": "03021120001",
            "name": "ធាម ម៉េងហ្គុយ"
        },
        {
            "barcode": "171126047",
            "dpc": "03021137901",
            "name": "សួស កុសល់"
        },
        {
            "barcode": "171126048",
            "dpc": "03021138001",
            "name": "ជិន ជួប"
        },
        {
            "barcode": "171126049",
            "dpc": "03021107801",
            "name": "ឌុក ផល្លី"
        },
        {
            "barcode": "171126050",
            "dpc": "03021138101",
            "name": "ជួន ណារី"
        },
        {
            "barcode": "171126051",
            "dpc": "03021138401",
            "name": "សា ម៉ាត់ស"
        },
        {
            "barcode": "171126052",
            "dpc": "03021109401",
            "name": "ចៅ ធឿន"
        },
        {
            "barcode": "171126053",
            "dpc": "03021109501",
            "name": "ចៅ ថាន់"
        },
        {
            "barcode": "171126054",
            "dpc": "03021128001",
            "name": "គង់ សុភាព"
        },
        {
            "barcode": "171126055",
            "dpc": "03021112501",
            "name": "តន់ ប៊ុនរឿង"
        },
        {
            "barcode": "171126056",
            "dpc": "03021118201",
            "name": "មៀវ គីមហ៊ាន"
        },
        {
            "barcode": "171126057",
            "dpc": "03021137701",
            "name": "កែវ ធំប៉ា"
        },
        {
            "barcode": "171126058",
            "dpc": "03021120101",
            "name": "អ៊ុង សុជា"
        },
        {
            "barcode": "171126059",
            "dpc": "03021128101",
            "name": "វ៉ែន សុខូត"
        },
        {
            "barcode": "171126060",
            "dpc": "03021137601",
            "name": "ឆម វណ្ណា"
        },
        {
            "barcode": "171126061",
            "dpc": "03021124701",
            "name": "សែ ទ្រី"
        },
        {
            "barcode": "171126062",
            "dpc": "03021124801",
            "name": "អ៊ឹម សីហា"
        },
        {
            "barcode": "171126063",
            "dpc": "03021124901",
            "name": "សុខ សុផល ១"
        },
        {
            "barcode": "171126064",
            "dpc": "03021138301",
            "name": "តន់ ប៊ុនរឿន ១"
        },
        {
            "barcode": "171126065",
            "dpc": "03021138201",
            "name": "ហេង គង់"
        },
        {
            "barcode": "171126066",
            "dpc": "03021124401",
            "name": "សៅ ស៊ីដែត ២"
        },
        {
            "barcode": "171126067",
            "dpc": "03021124501",
            "name": "សៅ ស៊ីដែត ១"
        },
        {
            "barcode": "171126068",
            "dpc": "03021145101",
            "name": "ថោង គឹមលី"
        },
        {
            "barcode": "171126069",
            "dpc": "03021137801",
            "name": "មុំ គីរី"
        },
        {
            "barcode": "171126070",
            "dpc": "03021130801",
            "name": "ម៉ៃ ម៉ាន់"
        },
        {
            "barcode": "171126071",
            "dpc": "03021127501",
            "name": "តេង ព្រៀន"
        },
        {
            "barcode": "171126072",
            "dpc": "03021112001",
            "name": "ជា វឿន"
        },
        {
            "barcode": "171126073",
            "dpc": "03021122601",
            "name": "ឌុក ឆវ័ន្ត"
        },
        {
            "barcode": "171126074",
            "dpc": "03021139001",
            "name": "ទេព ឆវី"
        },
        {
            "barcode": "171126075",
            "dpc": "03021119601",
            "name": "យ៉ាំ ខី"
        },
        {
            "barcode": "171126076",
            "dpc": "03021105601",
            "name": "កែវ ពិជិត"
        },
        {
            "barcode": "171126077",
            "dpc": "03021138601",
            "name": "ហាន រ៉ាន់"
        },
        {
            "barcode": "171126078",
            "dpc": "03021131701",
            "name": "សេង ហ៊ាង"
        },
        {
            "barcode": "171126079",
            "dpc": "03021105701",
            "name": "សេង ឆៀត"
        },
        {
            "barcode": "171126080",
            "dpc": "03021105901",
            "name": "យឹម សារ៉ាក់"
        },
        {
            "barcode": "171126081",
            "dpc": "03021115901",
            "name": "យៀម ប្រង់"
        },
        {
            "barcode": "171126082",
            "dpc": "03021107601",
            "name": "ព្រឿង តុន"
        },
        {
            "barcode": "171126083",
            "dpc": "03021107701",
            "name": "មាស មាលគី"
        },
        {
            "barcode": "171126084",
            "dpc": "03021146101",
            "name": "មឿន សានី"
        },
        {
            "barcode": "171126085",
            "dpc": "03021136201",
            "name": "ឈុំ  វុធ"
        },
        {
            "barcode": "171126086",
            "dpc": "03021139301",
            "name": "ជា ដាវី"
        },
        {
            "barcode": "171126087",
            "dpc": "03021106101",
            "name": "ផ្លុង  គឹមថៃ"
        },
        {
            "barcode": "171126088",
            "dpc": "03021122501",
            "name": "ម៉ៅ ព្រីយ៉ា"
        },
        {
            "barcode": "171126089",
            "dpc": "03021139501",
            "name": "ឆម ឈឿប"
        },
        {
            "barcode": "171126090",
            "dpc": "03021106201",
            "name": "យុន យីម"
        },
        {
            "barcode": "171126091",
            "dpc": "03021107301",
            "name": "ងិន វ៉ារី"
        },
        {
            "barcode": "171126092",
            "dpc": "03021107401",
            "name": "ថាច់ សៅរ៍"
        },
        {
            "barcode": "171126093",
            "dpc": "03021106301",
            "name": "យីវ វណ្ណៈ"
        },
        {
            "barcode": "171126094",
            "dpc": "03021127701",
            "name": "អៀង យ៉ាន់ណា"
        },
        {
            "barcode": "171126095",
            "dpc": "03021127801",
            "name": "ពេញ ចិន្តា"
        },
        {
            "barcode": "171126096",
            "dpc": "03021139201",
            "name": "ដាំ  សាមី"
        },
        {
            "barcode": "171126097",
            "dpc": "03021145501",
            "name": "កែ សាម៉េត"
        },
        {
            "barcode": "171126098",
            "dpc": "03021125801",
            "name": "ម៉ា វុទ្ធី"
        },
        {
            "barcode": "171126099",
            "dpc": "03021111901",
            "name": "អេង ប៊ុនធឿន"
        },
        {
            "barcode": "171126100",
            "dpc": "03021126301",
            "name": "រ៉េត ដារិត"
        },
        {
            "barcode": "171126101",
            "dpc": "03021145901",
            "name": "សូ ទី"
        },
        {
            "barcode": "171126102",
            "dpc": "03021102401",
            "name": "វ៉ាយ សារ"
        },
        {
            "barcode": "171126103",
            "dpc": "03021102301",
            "name": "ទិត្យ  សាមឿន"
        },
        {
            "barcode": "171126104",
            "dpc": "03021125601",
            "name": "ហ៊ិន ហ៊ាង"
        },
        {
            "barcode": "171126105",
            "dpc": "03021134201",
            "name": "ផាត រ៉ា"
        },
        {
            "barcode": "171126106",
            "dpc": "03021117201",
            "name": "ង៉ែត សុវណ្ណ"
        },
        {
            "barcode": "171126107",
            "dpc": "03021108501",
            "name": "ផា  គឹមសុន្ទរ៍"
        },
        {
            "barcode": "171126108",
            "dpc": "03021135401",
            "name": "ឆេង ឆាង"
        },
        {
            "barcode": "171126109",
            "dpc": "03021108601",
            "name": "ឈួម សុខៈ"
        },
        {
            "barcode": "171126110",
            "dpc": "03021111801",
            "name": "ឆិម សុវណ្ណី"
        },
        {
            "barcode": "171126111",
            "dpc": "03021134101",
            "name": "ជុង ឆាយ"
        },
        {
            "barcode": "171126112",
            "dpc": "03021102501",
            "name": "ញឹប បូរ៉ា"
        },
        {
            "barcode": "171126113",
            "dpc": "03021110401",
            "name": "គីម  សារ៉ន"
        },
        {
            "barcode": "171126114",
            "dpc": "03021121701",
            "name": "ពៅ វិរៈ"
        },
        {
            "barcode": "171126115",
            "dpc": "03021111701",
            "name": "ឡម សុជាតិ"
        },
        {
            "barcode": "171126116",
            "dpc": "03021115501",
            "name": "ឡម លី"
        },
        {
            "barcode": "171126117",
            "dpc": "03021134401",
            "name": "ឈា សំណាង"
        },
        {
            "barcode": "171126118",
            "dpc": "03021105301",
            "name": "ហ៊ុន សាលី ២"
        },
        {
            "barcode": "171126119",
            "dpc": "03021105201",
            "name": "កៅ ជុន"
        },
        {
            "barcode": "171126120",
            "dpc": "03021105101",
            "name": "ប៊ី ទី"
        },
        {
            "barcode": "171126121",
            "dpc": "03021134801",
            "name": "ប្រេប សារឿន"
        },
        {
            "barcode": "171126122",
            "dpc": "03021130201",
            "name": "អេង ភីរុណ"
        },
        {
            "barcode": "171126123",
            "dpc": "03021144701",
            "name": "ចៅ ស៊ីនួន"
        },
        {
            "barcode": "171126124",
            "dpc": "03021120201",
            "name": "ស៊្រុន  សុទិដ្ឋ"
        },
        {
            "barcode": "171126125",
            "dpc": "03021134001",
            "name": "កែវ កុសល់"
        },
        {
            "barcode": "171126126",
            "dpc": "03021125901",
            "name": "សម សារិន"
        },
        {
            "barcode": "171126127",
            "dpc": "03021144601",
            "name": "ឡាយ គឹមស៊ុន"
        },
        {
            "barcode": "171126128",
            "dpc": "03021134601",
            "name": "ប៉ែន ភន"
        },
        {
            "barcode": "171126129",
            "dpc": "03021129701",
            "name": "អ៊ឹង ងួនហាក់"
        },
        {
            "barcode": "171126130",
            "dpc": "03021134501",
            "name": "មិន សាមិ"
        },
        {
            "barcode": "171126131",
            "dpc": "03021135101",
            "name": "អ៊ុយ សុធារី"
        },
        {
            "barcode": "171126132",
            "dpc": "03021130701",
            "name": "ម៉ៃ សាមៀត"
        },
        {
            "barcode": "171126133",
            "dpc": "03021107201",
            "name": "ឆម ឆវី"
        },
        {
            "barcode": "171126134",
            "dpc": "03021106501",
            "name": "ម៉ា សាមៀត"
        },
        {
            "barcode": "171126135",
            "dpc": "03021135201",
            "name": "ប៊ុន ចំរើន"
        },
        {
            "barcode": "171126136",
            "dpc": "03021135301",
            "name": "គឹម ឌី"
        },
        {
            "barcode": "171126137",
            "dpc": "03021125501",
            "name": "កាយ វណ្ណធី"
        },
        {
            "barcode": "171126138",
            "dpc": "03021106001",
            "name": "ប៊ុន រិទ្ធ"
        },
        {
            "barcode": "171126139",
            "dpc": "03021135801",
            "name": "ឌុក ប៉ោះ"
        },
        {
            "barcode": "171126140",
            "dpc": "03021100101",
            "name": "ពិន សុភា"
        },
        {
            "barcode": "171126141",
            "dpc": "03021119501",
            "name": "វុធ ថា"
        },
        {
            "barcode": "171126142",
            "dpc": "03021136001",
            "name": "ប៉ុក សារុំ"
        },
        {
            "barcode": "171126143",
            "dpc": "03021131201",
            "name": "ប៉ាន់ វិន"
        },
        {
            "barcode": "171126144",
            "dpc": "03021129401",
            "name": "ឡៅ ជូឆេង"
        },
        {
            "barcode": "171126145",
            "dpc": "03021133301",
            "name": "ឡោ គឹមហេង"
        },
        {
            "barcode": "171126146",
            "dpc": "03021146001",
            "name": "តាំង ទ្រី"
        },
        {
            "barcode": "171126147",
            "dpc": "03021102901",
            "name": "ចាន់ ម៉ាន់"
        },
        {
            "barcode": "171126148",
            "dpc": "03021108801",
            "name": "ស្រេង ម៉ៅ"
        },
        {
            "barcode": "171126149",
            "dpc": "03021133201",
            "name": "ប៊ី  កញ្ញា"
        },
        {
            "barcode": "171126150",
            "dpc": "03021135701",
            "name": "ភុក មួយ"
        },
        {
            "barcode": "171126151",
            "dpc": "03021116901",
            "name": "អៀន តិច"
        },
        {
            "barcode": "171126152",
            "dpc": "03021104901",
            "name": "អ៊ឹម នាង"
        },
        {
            "barcode": "171126153",
            "dpc": "03021133001",
            "name": "សយ លាវ"
        },
        {
            "barcode": "171126154",
            "dpc": "03021133101",
            "name": "ទី ជាប"
        },
        {
            "barcode": "171126155",
            "dpc": "03021103101",
            "name": "គឹម ប៊ុនធឿន ១"
        },
        {
            "barcode": "171126156",
            "dpc": "03021133601",
            "name": "ចាន់ វ៉េ"
        },
        {
            "barcode": "171126157",
            "dpc": "03021119401",
            "name": "ឆឺយ សារ៉េត"
        },
        {
            "barcode": "171126158",
            "dpc": "03021145301",
            "name": "ឡាយ សាំងថង"
        },
        {
            "barcode": "171126159",
            "dpc": "03021133401",
            "name": "លឹម ម៉េង"
        },
        {
            "barcode": "171126160",
            "dpc": "03021133501",
            "name": "ខ្មៅ សំកុល"
        },
        {
            "barcode": "171126161",
            "dpc": "03021130501",
            "name": "សុទ្ធ ថា"
        },
        {
            "barcode": "171126162",
            "dpc": "03021129501",
            "name": "យិន យក់"
        },
        {
            "barcode": "171126163",
            "dpc": "03021114801",
            "name": "ឃុន សេង"
        },
        {
            "barcode": "171126164",
            "dpc": "03021142901",
            "name": "ស៊ាន គឹមស្រូ"
        },
        {
            "barcode": "171126165",
            "dpc": "03021131301",
            "name": "ឆែម សុគន្ធ"
        },
        {
            "barcode": "171126166",
            "dpc": "03021129901",
            "name": "ជួន វើយ"
        },
        {
            "barcode": "171126167",
            "dpc": "03021143101",
            "name": "ឌី ទូច"
        },
        {
            "barcode": "171126168",
            "dpc": "03021146801",
            "name": "មុំ កែវ"
        },
        {
            "barcode": "171126169",
            "dpc": "03021138701",
            "name": "សាន សារិន"
        },
        {
            "barcode": "171126170",
            "dpc": "03021114501",
            "name": "សោម សម្បត្តិ"
        },
        {
            "barcode": "171126171",
            "dpc": "03021143001",
            "name": "សុខ សាវី"
        },
        {
            "barcode": "171126172",
            "dpc": "03021112401",
            "name": "សាលារៀនវត្តរំដួល"
        },
        {
            "barcode": "171126173",
            "dpc": "03021128501",
            "name": "ហេវ គឹមអេង"
        },
        {
            "barcode": "171126174",
            "dpc": "03021126001",
            "name": "សុង ហ៊ាង"
        },
        {
            "barcode": "171126175",
            "dpc": "03021145001",
            "name": "ម៉ូត ស្រីអិន"
        },
        {
            "barcode": "171126176",
            "dpc": "03021119801",
            "name": "ចាន់ សុផៃ"
        },
        {
            "barcode": "171126177",
            "dpc": "03021127901",
            "name": "ចាន់ ថា"
        },
        {
            "barcode": "171126178",
            "dpc": "03021120801",
            "name": "ឈា ចន្ធូ"
        },
        {
            "barcode": "171126179",
            "dpc": "03021139601",
            "name": "ទូច ខុនណា"
        },
        {
            "barcode": "171126180",
            "dpc": "03021115801",
            "name": "ម៉ឹង រ៉ាឌី"
        },
        {
            "barcode": "171126181",
            "dpc": "03021130901",
            "name": "យ៉ែម សំអូន"
        },
        {
            "barcode": "171126182",
            "dpc": "03021106901",
            "name": "អៀង សាខន"
        },
        {
            "barcode": "171126183",
            "dpc": "03021110701",
            "name": "ពៅ មៀន"
        },
        {
            "barcode": "171126184",
            "dpc": "03021145801",
            "name": "តាន់ ឈុនហុង"
        },
        {
            "barcode": "171126185",
            "dpc": "03021140701",
            "name": "ម៉ៅ ហែម"
        },
        {
            "barcode": "171126186",
            "dpc": "03021146701",
            "name": "គង់ សុវណ្ណ"
        },
        {
            "barcode": "171126187",
            "dpc": "03021107501",
            "name": "ង៉ែត សារ៉េត"
        },
        {
            "barcode": "171126188",
            "dpc": "03021131901",
            "name": "ដួង រជ្ជនី"
        },
        {
            "barcode": "171126189",
            "dpc": "03021140001",
            "name": "នូ សេង"
        },
        {
            "barcode": "171126190",
            "dpc": "03021140901",
            "name": "ម៉ា រ៉ី"
        },
        {
            "barcode": "171126191",
            "dpc": "03021126101",
            "name": "ជៀប ឆេងហ៊ួរ"
        },
        {
            "barcode": "171126192",
            "dpc": "03021140101",
            "name": "ស៊្រុន  ប៊ុនថន"
        },
        {
            "barcode": "171126193",
            "dpc": "03021140401",
            "name": "ទី រស្មី"
        },
        {
            "barcode": "171126194",
            "dpc": "03021144801",
            "name": "សោម មួន"
        },
        {
            "barcode": "171126195",
            "dpc": "03021140301",
            "name": "ចាន់ មុំ"
        },
        {
            "barcode": "171126196",
            "dpc": "03021144901",
            "name": "ផាង ថានី"
        },
        {
            "barcode": "171126197",
            "dpc": "03021140201",
            "name": "អ៊ីវ ប៉ូឡូ"
        },
        {
            "barcode": "171126198",
            "dpc": "03021140501",
            "name": "ផង់ សាវឿន"
        },
        {
            "barcode": "171126199",
            "dpc": "03021139901",
            "name": "យ៉ម រួន"
        },
        {
            "barcode": "171126200",
            "dpc": "03021123101",
            "name": "អឿង ម៉ារីនីត"
        },
        {
            "barcode": "171126201",
            "dpc": "03021109901",
            "name": "ម៉ៅ ១"
        },
        {
            "barcode": "171126202",
            "dpc": "03021126201",
            "name": "ខាន អៈម៉ាត់ ស្តង់១២"
        },
        {
            "barcode": "171126203",
            "dpc": "03021110001",
            "name": "សេន សម្បត្តិ"
        },
        {
            "barcode": "171126204",
            "dpc": "03021116101",
            "name": "ណាំ ផារ៉ាត់"
        },
        {
            "barcode": "171126205",
            "dpc": "03021116201",
            "name": "តូបលេខ ៤"
        },
        {
            "barcode": "171126206",
            "dpc": "03021110101",
            "name": "ឈឿន ស្រីពៅ"
        },
        {
            "barcode": "171126207",
            "dpc": "03021112301",
            "name": "វៀច សួរ"
        },
        {
            "barcode": "171126208",
            "dpc": "03021141801",
            "name": "តាំង ម៉ី"
        },
        {
            "barcode": "171126209",
            "dpc": "03021118101",
            "name": "សឹប ទីម៉ាស់"
        },
        {
            "barcode": "171126210",
            "dpc": "03021142401",
            "name": "ស្តង់លេខ ៥៩"
        },
        {
            "barcode": "171126211",
            "dpc": "03021142301",
            "name": "ស្តង់លេខ ៥៧"
        },
        {
            "barcode": "171126212",
            "dpc": "03021116401",
            "name": "អាំងគឹមហេងស្តង់ ៥៦"
        },
        {
            "barcode": "171126213",
            "dpc": "03021116301",
            "name": "ណា លី"
        },
        {
            "barcode": "171126214",
            "dpc": "03021110601",
            "name": "អឿង គន្ធា"
        },
        {
            "barcode": "171126215",
            "dpc": "03021110501",
            "name": "ទូច ម៉ៅ ៣"
        },
        {
            "barcode": "171126216",
            "dpc": "03021147901",
            "name": "ខ្លូត សារៀន"
        },
        {
            "barcode": "171126217",
            "dpc": "03021147801",
            "name": "ជីវ គក់ចក់"
        },
        {
            "barcode": "171126218",
            "dpc": "03021140601",
            "name": "ហេង សមដារ៉ា"
        },
        {
            "barcode": "171126219",
            "dpc": "03021126401",
            "name": "តូបលេខ ២៤"
        },
        {
            "barcode": "171126220",
            "dpc": "03021110301",
            "name": "ម៉ៅ ២ ស្តង់លេខ ២៥"
        },
        {
            "barcode": "171126221",
            "dpc": "03021142001",
            "name": "ស្តង់លេខ ៣០"
        },
        {
            "barcode": "171126222",
            "dpc": "03021114701",
            "name": "អ៊ាន ធីដាឡែន"
        },
        {
            "barcode": "171126223",
            "dpc": "03021142501",
            "name": "ស្តង់លេខ ៣១"
        },
        {
            "barcode": "171126224",
            "dpc": "03021123201",
            "name": "យិន ពិសិទ្ធស្តង់លេខ ៣២"
        },
        {
            "barcode": "171126225",
            "dpc": "03021141001",
            "name": "មាស ពិសិទ្ធ"
        },
        {
            "barcode": "171126226",
            "dpc": "03021112701",
            "name": "ប៉ុក ប៊ុនធឿន"
        },
        {
            "barcode": "171126227",
            "dpc": "03021102101",
            "name": "សេង សុខា"
        },
        {
            "barcode": "171126228",
            "dpc": "03021141601",
            "name": "ឈឿម រ៉ា"
        },
        {
            "barcode": "171126229",
            "dpc": "03021128801",
            "name": "ស្លេះ សារុំ"
        },
        {
            "barcode": "171126230",
            "dpc": "03021141501",
            "name": "អ៊ឹង ប៉ុនថេន"
        },
        {
            "barcode": "171126231",
            "dpc": "03021141401",
            "name": "សុខ សុផល"
        },
        {
            "barcode": "171126232",
            "dpc": "03021141301",
            "name": "ណៃ សុខន"
        },
        {
            "barcode": "171126233",
            "dpc": "03021141201",
            "name": "ផែន សុផាន់ណា"
        },
        {
            "barcode": "171126234",
            "dpc": "03021141101",
            "name": "ហុង លីណា"
        },
        {
            "barcode": "171126235",
            "dpc": "03021106801",
            "name": "សាលារៀនវត្តលៀប"
        },
        {
            "barcode": "171126236",
            "dpc": "03021146601",
            "name": "ឡុង សារុំ"
        },
        {
            "barcode": "171126237",
            "dpc": "03021114901",
            "name": "គឹម យីន"
        },
        {
            "barcode": "171126238",
            "dpc": "03021141901",
            "name": "ទី សុខុន"
        },
        {
            "barcode": "171126239",
            "dpc": "03021114301",
            "name": "ទួន ស្រីមុំ"
        },
        {
            "barcode": "171126240",
            "dpc": "03021122101",
            "name": "មាស សាម៉ន"
        },
        {
            "barcode": "171126241",
            "dpc": "03021146901",
            "name": "តាន់ វ៉ៃ"
        },
        {
            "barcode": "171126242",
            "dpc": "03021127101",
            "name": "ផៃ សាម៉ា"
        },
        {
            "barcode": "171126243",
            "dpc": "03021127601",
            "name": "អ៊ុច គីមឡាយ"
        },
        {
            "barcode": "171126244",
            "dpc": "03021127401",
            "name": "ផ្លាង  ឆន"
        },
        {
            "barcode": "171126245",
            "dpc": "03021114401",
            "name": "ចាន់ ដាវី"
        },
        {
            "barcode": "171126246",
            "dpc": "03021112201",
            "name": "ជា ង៉ា"
        },
        {
            "barcode": "171126247",
            "dpc": "03021112101",
            "name": "សុខ សេង"
        },
        {
            "barcode": "171126248",
            "dpc": "03021127301",
            "name": "ឆើត សេង ថៃ"
        },
        {
            "barcode": "171126249",
            "dpc": "03021127201",
            "name": "សេង វុទ្ធី"
        },
        {
            "barcode": "171126250",
            "dpc": "03021127001",
            "name": "តុន វី"
        },
        {
            "barcode": "171126251",
            "dpc": "03021102001",
            "name": "សា ម៉ុន"
        },
        {
            "barcode": "171126252",
            "dpc": "03021101901",
            "name": "ព្រំ ទី"
        },
        {
            "barcode": "171126253",
            "dpc": "03021122801",
            "name": "ឈួន វាសនា"
        },
        {
            "barcode": "171126254",
            "dpc": "03021123601",
            "name": "ហាំម ប៊ុនរឿន"
        },
        {
            "barcode": "171126255",
            "dpc": "03021129601",
            "name": "អន ប៊ុនសៀន"
        },
        {
            "barcode": "171126256",
            "dpc": "03021145401",
            "name": "ឡុង ឃាង"
        },
        {
            "barcode": "171126257",
            "dpc": "03021118501",
            "name": "ឡាយ ភូយ"
        },
        {
            "barcode": "171126258",
            "dpc": "03021131801",
            "name": "ឈ គឹមឡេង"
        },
        {
            "barcode": "171126259",
            "dpc": "03021122701",
            "name": "ប៊ូ ឡេង"
        },
        {
            "barcode": "171126260",
            "dpc": "03021142701",
            "name": "ហឺ វង្ស"
        },
        {
            "barcode": "171126261",
            "dpc": "03021129201",
            "name": "សូ វន"
        },
        {
            "barcode": "171126262",
            "dpc": "03021130001",
            "name": "ជា ជិនណារី"
        },
        {
            "barcode": "171126263",
            "dpc": "03021128301",
            "name": "លាភ សុជាតិ"
        },
        {
            "barcode": "171126264",
            "dpc": "03021120701",
            "name": "ឡាយ សេងគាន"
        },
        {
            "barcode": "171126265",
            "dpc": "03021142801",
            "name": "ធី ហួយ"
        },
        {
            "barcode": "171126266",
            "dpc": "03021125401",
            "name": "ម៉ក់ ចាន់ចន"
        },
        {
            "barcode": "171126267",
            "dpc": "03021102701",
            "name": "ហ៊ឹម នូវ"
        },
        {
            "barcode": "171126268",
            "dpc": "03021111201",
            "name": "ឡោ សាឡៅ"
        },
        {
            "barcode": "171126269",
            "dpc": "03021104401",
            "name": "វ៉ាយ  សារ ២"
        },
        {
            "barcode": "171126270",
            "dpc": "03021108901",
            "name": "ជន សឿប"
        },
        {
            "barcode": "171126271",
            "dpc": "03021123001",
            "name": "ទួន  វណ្ណា"
        },
        {
            "barcode": "171126272",
            "dpc": "03021131001",
            "name": "ឡុង រចនា"
        },
        {
            "barcode": "171126273",
            "dpc": "03021136401",
            "name": "ដាំ សារឿត"
        },
        {
            "barcode": "171126274",
            "dpc": "03021113501",
            "name": "ពេញ រ៉ាន់"
        },
        {
            "barcode": "171126275",
            "dpc": "03021113601",
            "name": "វិន ថុល"
        },
        {
            "barcode": "171126276",
            "dpc": "03021113701",
            "name": "ជុន គឹមអាន"
        },
        {
            "barcode": "171126277",
            "dpc": "03021114001",
            "name": "ពៅ ភី"
        },
        {
            "barcode": "171126278",
            "dpc": "03021146501",
            "name": "ជុន ហាន"
        },
        {
            "barcode": "171126279",
            "dpc": "03021103001",
            "name": "សេក លាត"
        },
        {
            "barcode": "171126280",
            "dpc": "03021135501",
            "name": "ធៀម សុង"
        },
        {
            "barcode": "171126281",
            "dpc": "03021117101",
            "name": "ឈន លុច"
        },
        {
            "barcode": "171126282",
            "dpc": "03021119301",
            "name": "ស៊ិន ប៊ុនថា"
        },
        {
            "barcode": "171126283",
            "dpc": "03021102601",
            "name": "ស៊ុន ណាវី"
        },
        {
            "barcode": "171126284",
            "dpc": "03021133701",
            "name": "ប៉ាវ សាំងហេង"
        },
        {
            "barcode": "171126285",
            "dpc": "03021104801",
            "name": "អ៊ួន សេងហួត"
        },
        {
            "barcode": "171126286",
            "dpc": "03021108401",
            "name": "ហេង សារ៉ាត់"
        },
        {
            "barcode": "171126287",
            "dpc": "03021120401",
            "name": "ចេង ឈន"
        },
        {
            "barcode": "171126288",
            "dpc": "03021135001",
            "name": "សុទ្ធ រីន"
        },
        {
            "barcode": "171126289",
            "dpc": "03021107001",
            "name": "សេង ហ៊ឺយ"
        },
        {
            "barcode": "171126290",
            "dpc": "03021113901",
            "name": "ជុក ចាន់"
        },
        {
            "barcode": "171126291",
            "dpc": "03021136101",
            "name": "ម៉ុយ ដារ៉ាវុធ"
        },
        {
            "barcode": "171126292",
            "dpc": "03021120501",
            "name": "សំ សុខា"
        },
        {
            "barcode": "171126293",
            "dpc": "03021133901",
            "name": "ហេវ បាន ស៊ាន"
        },
        {
            "barcode": "171126294",
            "dpc": "03021113801",
            "name": "យៀម សាគឿន"
        },
        {
            "barcode": "171126295",
            "dpc": "03021144501",
            "name": "ពៅ សោភ័ណ្ឌ"
        },
        {
            "barcode": "171126296",
            "dpc": "03021113401",
            "name": "ញាណ សំណាង"
        },
        {
            "barcode": "171126297",
            "dpc": "03021113301",
            "name": "ប៊ុន ហឿត"
        },
        {
            "barcode": "171126298",
            "dpc": "03021129301",
            "name": "ហេង វិបុល"
        },
        {
            "barcode": "171126299",
            "dpc": "03021133801",
            "name": "លឹម សារុន"
        },
        {
            "barcode": "171126300",
            "dpc": "03021136501",
            "name": "ម៉ែន សម្បត្តិ"
        },
        {
            "barcode": "171126301",
            "dpc": "03021135901",
            "name": "យី ហាន"
        },
        {
            "barcode": "171126302",
            "dpc": "03021117701",
            "name": "សឺ   ឃុយ"
        },
        {
            "barcode": "171126303",
            "dpc": "03021117601",
            "name": "សូ ណាវណ្ណី"
        },
        {
            "barcode": "171126304",
            "dpc": "03021117801",
            "name": "វ៉ាង ចាន់រិទ្ធ"
        },
        {
            "barcode": "171126305",
            "dpc": "03021117501",
            "name": "ជិត សៀក"
        },
        {
            "barcode": "171126306",
            "dpc": "03021117401",
            "name": "រិន ខាតណា"
        },
        {
            "barcode": "171126307",
            "dpc": "03021144201",
            "name": "ជិន ហាប់"
        },
        {
            "barcode": "171126308",
            "dpc": "03021144301",
            "name": "ខៀវ សំណាង​ ១"
        },
        {
            "barcode": "171126309",
            "dpc": "03021144401",
            "name": "ខៀវ សំណាង ២"
        },
        {
            "barcode": "171126310",
            "dpc": "03021134901",
            "name": "អ៊ឹម ម៉ារ៉ាឌី"
        },
        {
            "barcode": "171126311",
            "dpc": "03021103501",
            "name": "ឯម  រ៉េន"
        },
        {
            "barcode": "171126312",
            "dpc": "03021104701",
            "name": "អ៊ុន   ដានី"
        },
        {
            "barcode": "171126313",
            "dpc": "03021105801",
            "name": "ឃូ  ឈាត"
        },
        {
            "barcode": "171126314",
            "dpc": "03021107901",
            "name": "ស៊ីម  គន្ធា"
        },
        {
            "barcode": "171126315",
            "dpc": "03021108701",
            "name": "ឈិត  អេង"
        },
        {
            "barcode": "171126316",
            "dpc": "03021109801",
            "name": "តន់  ប៊ុនរឿន ២"
        },
        {
            "barcode": "171126317",
            "dpc": "03021110801",
            "name": "ស៊ិន  សៅ"
        },
        {
            "barcode": "171126318",
            "dpc": "03021112601",
            "name": "សំ  ហេង"
        },
        {
            "barcode": "171126319",
            "dpc": "03021112901",
            "name": "នី (តូប ១៧ )"
        },
        {
            "barcode": "171126320",
            "dpc": "03021114201",
            "name": "ឃុន  វុទ្ធី"
        },
        {
            "barcode": "171126321",
            "dpc": "03021115701",
            "name": "ចាន់  សុខហ៊ាង"
        },
        {
            "barcode": "171126322",
            "dpc": "03021116701",
            "name": "ហេង  សុធា"
        },
        {
            "barcode": "171126323",
            "dpc": "03021117001",
            "name": "ឡាយ  ហួត"
        },
        {
            "barcode": "171126324",
            "dpc": "03021118601",
            "name": "តឹក  វាសនា"
        },
        {
            "barcode": "171126325",
            "dpc": "03021118701",
            "name": "សោម  សុផាត"
        },
        {
            "barcode": "171126326",
            "dpc": "03021119901",
            "name": "រៀម  រដ្ឋា"
        },
        {
            "barcode": "171126327",
            "dpc": "03021120901",
            "name": "សុខ  សំនៀង"
        },
        {
            "barcode": "171126328",
            "dpc": "03021121001",
            "name": "អ៊ឺង  គឹមលី"
        },
        {
            "barcode": "171126329",
            "dpc": "03021121101",
            "name": "តាំង  សុផល"
        },
        {
            "barcode": "171126330",
            "dpc": "03021123501",
            "name": "ស៊ាង  សាន"
        },
        {
            "barcode": "171126331",
            "dpc": "03021124301",
            "name": "ឈុំ   វុធ"
        },
        {
            "barcode": "171126332",
            "dpc": "03021126501",
            "name": "ភូ  ពុយ"
        },
        {
            "barcode": "171126333",
            "dpc": "03021128401",
            "name": "ព្រំ  សុខា"
        },
        {
            "barcode": "171126334",
            "dpc": "03021129101",
            "name": "ណាំ  សុខហេង"
        },
        {
            "barcode": "171126335",
            "dpc": "03021130301",
            "name": "អោក  ឈាត"
        },
        {
            "barcode": "171126336",
            "dpc": "03021131601",
            "name": "ម៉ា  សាត"
        },
        {
            "barcode": "171126337",
            "dpc": "03021132001",
            "name": "ពឹង ចាំងហ៊ុយ"
        },
        {
            "barcode": "171126338",
            "dpc": "03021134301",
            "name": "ឈុន  ឆាន់"
        },
        {
            "barcode": "171126339",
            "dpc": "03021136301",
            "name": "វ៉ន  ថា"
        },
        {
            "barcode": "171126340",
            "dpc": "03021137101",
            "name": "លួង  ឆែម"
        },
        {
            "barcode": "171126341",
            "dpc": "03021137201",
            "name": "គង់  ចំរើន"
        },
        {
            "barcode": "171126342",
            "dpc": "03021137401",
            "name": "ធួក  សារិន"
        },
        {
            "barcode": "171126343",
            "dpc": "03021138801",
            "name": "ឯម  សុរាជ្យ"
        },
        {
            "barcode": "171126344",
            "dpc": "03021138901",
            "name": "ឌី  ភិន"
        },
        {
            "barcode": "171126345",
            "dpc": "03021139401",
            "name": "គឹម  សុផល"
        },
        {
            "barcode": "171126346",
            "dpc": "03021139701",
            "name": "នូ  សារ៉េត"
        },
        {
            "barcode": "171126347",
            "dpc": "03021139801",
            "name": "ហាន  សុជិត"
        },
        {
            "barcode": "171126348",
            "dpc": "03021140801",
            "name": "ឃុន  ហ៊ួរ"
        },
        {
            "barcode": "171126349",
            "dpc": "03021142201",
            "name": "ស្តង់លេខ ៥៤"
        },
        {
            "barcode": "171126350",
            "dpc": "03021143201",
            "name": "ស៊ាន​ តិម៉ា"
        },
        {
            "barcode": "171126351",
            "dpc": "03021143401",
            "name": "សួស  សាវ៉ាត"
        },
        {
            "barcode": "171126352",
            "dpc": "03021143801",
            "name": "ទិត្យ  ប៊ុនតូ"
        },
        {
            "barcode": "171126353",
            "dpc": "03021143901",
            "name": "ឡោះ  ទួតស៊ីណា"
        },
        {
            "barcode": "171126354",
            "dpc": "03021144001",
            "name": "ឯល  អៃនី"
        },
        {
            "barcode": "171126355",
            "dpc": "03021145201",
            "name": "យក់  ប៊ុនណា"
        },
        {
            "barcode": "171126356",
            "dpc": "03021146401",
            "name": "យ៉ិ  សុផាន់"
        },
        {
            "barcode": "171126357",
            "dpc": "03021147701",
            "name": "គង់  សារ៉ុម"
        },
        {
            "barcode": "171126358",
            "dpc": "03021121201",
            "name": "សំ  ចន្ថា"
        },
        {
            "barcode": "171126359",
            "dpc": "03021119001",
            "name": "សុខ  ចាន់ថុយ"
        },
        {
            "barcode": "171126360",
            "dpc": "03021147601",
            "name": "ហ៊ិន វុទ្ធី"
        },
        {
            "barcode": "171126361",
            "dpc": "03021147001",
            "name": "ស៊ិម សំណាង"
        },
        {
            "barcode": "171126362",
            "dpc": "03021132101",
            "name": "អ៊ុំ វណ្ណា"
        },
        {
            "barcode": "171126363",
            "dpc": "03021124101",
            "name": "នូ បូរ៉ា"
        },
        {
            "barcode": "171126364",
            "dpc": "03021121501",
            "name": "ម៉ៅ អ៊ុច"
        },
        {
            "barcode": "171126365",
            "dpc": "03021121401",
            "name": "ឃឹម ទៀង"
        },
        {
            "barcode": "171126366",
            "dpc": "03021119201",
            "name": "ស៊ាង  នាម"
        },
        {
            "barcode": "171126367",
            "dpc": "03021119101",
            "name": "តូន  ភាព"
        },
        {
            "barcode": "171126368",
            "dpc": "03021111001",
            "name": "យ៉ែម យ៉ន"
        },
        {
            "barcode": "171126369",
            "dpc": "03021108201",
            "name": "មៀច សាមិត្ត"
        },
        {
            "barcode": "171126370",
            "dpc": "03021105401",
            "name": "ម៉ក់ បូណា"
        },
        {
            "barcode": "171126371",
            "dpc": "03021103401",
            "name": "ប៊ិន ផាន"
        },
        {
            "barcode": "171126372",
            "dpc": "03021120601",
            "name": "យោក សារឿន"
        },
        {
            "barcode": "171126373",
            "dpc": "03021132501",
            "name": "ស្រី ច័ន្ទលី"
        },
        {
            "barcode": "171126374",
            "dpc": "03021132401",
            "name": "រុន រតនា"
        },
        {
            "barcode": "171126375",
            "dpc": "03021132301",
            "name": "អ៊ុក ជា"
        },
        {
            "barcode": "171126376",
            "dpc": "03021132201",
            "name": "ពន្លវិជ្ជាកុមារកំព្រា"
        },
        {
            "barcode": "171126377",
            "dpc": "03021130401",
            "name": "ហុង ហឿន"
        },
        {
            "barcode": "171126378",
            "dpc": "03021126801",
            "name": "ម៉ន នី"
        },
        {
            "barcode": "171126379",
            "dpc": "03021126701",
            "name": "សុគន្ធ សុធា"
        },
        {
            "barcode": "171126380",
            "dpc": "03021103701",
            "name": "ភឿង   ឡាង"
        },
        {
            "barcode": "171126381",
            "dpc": "03021147501",
            "name": "ចាន់ លាងសុន"
        },
        {
            "barcode": "171126382",
            "dpc": "03021123801",
            "name": "យ៉ែម យ៉ន"
        },
        {
            "barcode": "171126383",
            "dpc": "03021121601",
            "name": "ហ៊ាង រ៉ាវី"
        },
        {
            "barcode": "171126384",
            "dpc": "03021104101",
            "name": "ទាវ កៅ (២)"
        },
        {
            "barcode": "171126385",
            "dpc": "03021104001",
            "name": "ទាវ កៅ(១)"
        },
        {
            "barcode": "171126386",
            "dpc": "03021104301",
            "name": "ផាត រតនា"
        },
        {
            "barcode": "171126387",
            "dpc": "03021147301",
            "name": "សង់ ស៊ុនលាង"
        },
        {
            "barcode": "171126388",
            "dpc": "03021146301",
            "name": "កែវ សារឿន"
        },
        {
            "barcode": "171126389",
            "dpc": "03021145701",
            "name": "តាំង ហេង"
        },
        {
            "barcode": "171126390",
            "dpc": "03021126901",
            "name": "មិត្ត វុទ្ធា"
        },
        {
            "barcode": "171126391",
            "dpc": "03021124201",
            "name": "ជា អុំ"
        },
        {
            "barcode": "171126392",
            "dpc": "03021103901",
            "name": "ឈឿន ម៉ៅ"
        },
        {
            "barcode": "171126393",
            "dpc": "03021103801",
            "name": "មិត្ត សាវី"
        },
        {
            "barcode": "171126394",
            "dpc": "03021124601",
            "name": "យ៉ាំ  ក្លឹង"
        },
        {
            "barcode": "171126395",
            "dpc": "03021120301",
            "name": "គា  សេងហ៊ន"
        },
        {
            "barcode": "171126396",
            "dpc": "03021115001",
            "name": "ឈួម  ប៊ុនសឿត"
        },
        {
            "barcode": "171126397",
            "dpc": "03021113001",
            "name": "ឆឺយ  សារ៉ាត់"
        },
        {
            "barcode": "171126398",
            "dpc": "03021106401",
            "name": "ភាជ  ចាន់សុឆរីដា"
        },
        {
            "barcode": "171126399",
            "dpc": "03021115401",
            "name": "អុង ណារ៉ន"
        },
        {
            "barcode": "171126400",
            "dpc": "03021147401",
            "name": "ចាន់ ហ៊ាង"
        },
        {
            "barcode": "171126401",
            "dpc": "03021132901",
            "name": "គិត  ឆេងលី"
        },
        {
            "barcode": "171126402",
            "dpc": "03021132701",
            "name": "ឯម កែវ"
        },
        {
            "barcode": "171126403",
            "dpc": "03021132601",
            "name": "រ៉ាត់ ស៊ីថា"
        },
        {
            "barcode": "171126404",
            "dpc": "03021123401",
            "name": "ឡៃ ហូវ"
        },
        {
            "barcode": "171126405",
            "dpc": "03021121801",
            "name": "សេង វិសិទ្ធិ"
        },
        {
            "barcode": "171126406",
            "dpc": "03021115101",
            "name": "សុខ ធី"
        },
        {
            "barcode": "171126407",
            "dpc": "03021111501",
            "name": "ឡូ ចេង"
        },
        {
            "barcode": "171126408",
            "dpc": "03021108101",
            "name": "ឡុង ណៃស៊ីម"
        },
        {
            "barcode": "171126409",
            "dpc": "03021108001",
            "name": "ឡុង ប៊ុនហេង"
        },
        {
            "barcode": "171126410",
            "dpc": "03021103201",
            "name": "គឹម​ ប៊ុនធឿន ២"
        },
        {
            "barcode": "171126411",
            "dpc": "03021147201",
            "name": "ង៉ែត  សាលីន"
        },
        {
            "barcode": "171126412",
            "dpc": "03021132801",
            "name": "ឈុំ  ស៊ីនាង"
        },
        {
            "barcode": "171126413",
            "dpc": "03021128701",
            "name": "ហែម សារឿន"
        },
        {
            "barcode": "171126414",
            "dpc": "03021122901",
            "name": "ទូច  គង់"
        },
        {
            "barcode": "171126415",
            "dpc": "03021121901",
            "name": "ជឿន ស្រីពៅ"
        },
        {
            "barcode": "171126416",
            "dpc": "03021118401",
            "name": "ឃុន  ហូយ"
        },
        {
            "barcode": "171126417",
            "dpc": "03021118301",
            "name": "ង៉ែត កន"
        },
        {
            "barcode": "171126418",
            "dpc": "03021115301",
            "name": "លី ហ៊"
        },
        {
            "barcode": "171126419",
            "dpc": "03021115201",
            "name": "ឈឿន សុភាព"
        },
        {
            "barcode": "171126420",
            "dpc": "03021113201",
            "name": "សុខ  មេត្តា"
        },
        {
            "barcode": "171126421",
            "dpc": "03021111401",
            "name": "សុខ  ហៀក"
        },
        {
            "barcode": "171126422",
            "dpc": "03021111301",
            "name": "ហៀង ធារ៉ា"
        },
        {
            "barcode": "171126423",
            "dpc": "03021103301",
            "name": "ម៉ៅ ធីតា"
        },
        {
            "barcode": "171126424",
            "dpc": "03021102801",
            "name": "អ៊ី គី"
        },
        {
            "barcode": "171126425",
            "dpc": "03021111601",
            "name": "បួន សុធី"
        },
        {
            "barcode": "171126426",
            "dpc": "03021105501",
            "name": "ឯម  ផល"
        },
        {
            "barcode": "171126427",
            "dpc": "03021118801",
            "name": "លី  ស៊ីណាត"
        },
        {
            "barcode": "171126428",
            "dpc": "03021118901",
            "name": "អ៊ាប   ស៊ីផុន"
        },
        {
            "barcode": "171126429",
            "dpc": "03021121301",
            "name": "សេង  ហៃ"
        },
        {
            "barcode": "171126430",
            "dpc": "03021123901",
            "name": "ថន  ដារ៉ា"
        },
        {
            "barcode": "171126431",
            "dpc": "03021124001",
            "name": "ទូច  សុខា"
        },
        {
            "barcode": "171126432",
            "dpc": "03021129001",
            "name": "អ៊ុំ   យឿន"
        },
        {
            "barcode": "171126433",
            "dpc": "03021129801",
            "name": "តឹង  ហុង"
        },
        {
            "barcode": "171126434",
            "dpc": "03021128601",
            "name": "ប៊ុយ នាង"
        },
        {
            "barcode": "171126435",
            "dpc": "03021136601",
            "name": "ឈុន ណាវី"
        },
        {
            "barcode": "171126436",
            "dpc": "03021118001",
            "name": "គុយ សុខ"
        },
        {
            "barcode": "171126437",
            "dpc": "03021128901",
            "name": "ឱ វ៉ាន់ស័ក្ក"
        },
        {
            "barcode": "171126438",
            "dpc": "03021122401",
            "name": "ពៅ សុង"
        },
        {
            "barcode": "171126439",
            "dpc": "03021128201",
            "name": "ឆាយ ម៉ាទីណាល់"
        },
        {
            "barcode": "171126440",
            "dpc": "03021105001",
            "name": "ឃុន ម៉េងហ៊ាង"
        },
        {
            "barcode": "171126441",
            "dpc": "03021104601",
            "name": "គៀង ស៊ន"
        },
        {
            "barcode": "171126442",
            "dpc": "03021117901",
            "name": "សេង សុទិន"
        },
        {
            "barcode": "171126443",
            "dpc": "03021122201",
            "name": "សេង សុភិន"
        },
        {
            "barcode": "171126444",
            "dpc": "03021137001",
            "name": "ឡុង សុខា"
        },
        {
            "barcode": "171126445",
            "dpc": "03021136901",
            "name": "សុខ សាមឿន"
        },
        {
            "barcode": "171126446",
            "dpc": "03021106701",
            "name": "សេក សាគុណ"
        },
        {
            "barcode": "171126447",
            "dpc": "03021104501",
            "name": "លឹម ឈុនស្រេង"
        },
        {
            "barcode": "171126448",
            "dpc": "03021131501",
            "name": "ជីង  ហ៊ួ"
        },
        {
            "barcode": "171126449",
            "dpc": "03021107101",
            "name": "ខេង ច័ន្ទណា"
        },
        {
            "barcode": "171126450",
            "dpc": "03021131101",
            "name": "ពិន ទី"
        },
        {
            "barcode": "171126451",
            "dpc": "03021136701",
            "name": "ស៊ឹម យុទ្ធាសារ"
        },
        {
            "barcode": "171126452",
            "dpc": "03021101001",
            "name": "អួង ម៉ានី"
        },
        {
            "barcode": "171126453",
            "dpc": "03021101201",
            "name": "សៅ ថាច"
        },
        {
            "barcode": "171126454",
            "dpc": "03021101301",
            "name": "ផ្លុង បញ្ញារដ្ឋា"
        },
        {
            "barcode": "171126455",
            "dpc": "03021101401",
            "name": "វ៉ា សារុន"
        },
        {
            "barcode": "171126456",
            "dpc": "03021101501",
            "name": "ក្រៃ ថារ៉ា"
        },
        {
            "barcode": "171126457",
            "dpc": "03021101601",
            "name": "ប៊ូ គីម"
        },
        {
            "barcode": "171126458",
            "dpc": "03021101701",
            "name": "លាង ធាវី"
        },
        {
            "barcode": "171126459",
            "dpc": "03021136801",
            "name": "ជុំ កូយ"
        },
        {
            "barcode": "171126460",
            "dpc": "03021100901",
            "name": "មណ្ឌលសុខភាពស្វាយប៉ោ"
        },
        {
            "barcode": "171126461",
            "dpc": "03021100801",
            "name": "ណុប ហាវ"
        },
        {
            "barcode": "171126462",
            "dpc": "03021100201",
            "name": "គឹម សារុន"
        },
        {
            "barcode": "171126463",
            "dpc": "03021100301",
            "name": "រី ដែត"
        },
        {
            "barcode": "171126464",
            "dpc": "03021100401",
            "name": "នូ យ៉ាន"
        },
        {
            "barcode": "171126465",
            "dpc": "03021100601",
            "name": "ប៉ិច ទី"
        },
        {
            "barcode": "171126466",
            "dpc": "03021100501",
            "name": "អ៊ុង គឹមស៊ុន"
        },
        {
            "barcode": "171126467",
            "dpc": "03021148001",
            "name": "នេត នន់"
        }
    ]
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
