let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171117063",
            "dpc": "03031207301",
            "name": "សៀង សៀក ខេង"
        },
        {
            "barcode": "171117064",
            "dpc": "03031245801",
            "name": "ឃី យ៉ា"
        },
        {
            "barcode": "171117065",
            "dpc": "03031245701",
            "name": "ជ គាង"
        },
        {
            "barcode": "171117066",
            "dpc": "03031245601",
            "name": "ឆាយ ម៉េងហ៊ាង"
        },
        {
            "barcode": "171117067",
            "dpc": "03031245501",
            "name": "ម៉េង ជូ"
        },
        {
            "barcode": "171117068",
            "dpc": "03031245401",
            "name": "អ៊ូច ដានី"
        },
        {
            "barcode": "171117069",
            "dpc": "03031245301",
            "name": "គឹម រដ្ឋា"
        },
        {
            "barcode": "171117070",
            "dpc": "03031238601",
            "name": "អ៊ុក ទូច"
        },
        {
            "barcode": "171117071",
            "dpc": "03031245101",
            "name": "ឈុន សុរិយា"
        },
        {
            "barcode": "171117072",
            "dpc": "03031245001",
            "name": "ចាន់ ប៊ុនលឿម"
        },
        {
            "barcode": "171117073",
            "dpc": "03031244901",
            "name": "អ៊ុក ផាន់ណាក់"
        },
        {
            "barcode": "171117074",
            "dpc": "03031244801",
            "name": "រៀន ឌ័រ"
        },
        {
            "barcode": "171117075",
            "dpc": "03031244601",
            "name": "អ៊ុង ឃុន"
        },
        {
            "barcode": "171117076",
            "dpc": "03031244701",
            "name": "ហេង ឡាង"
        },
        {
            "barcode": "171117077",
            "dpc": "03031244001",
            "name": "ចេត ហ៊ួរ"
        },
        {
            "barcode": "171117078",
            "dpc": "03031242601",
            "name": "ទ្រី គឹមទៀង"
        },
        {
            "barcode": "171117079",
            "dpc": "03031242701",
            "name": "ប៊ិន ពៅ"
        },
        {
            "barcode": "171117080",
            "dpc": "03031243001",
            "name": "លឹម លី"
        },
        {
            "barcode": "171117081",
            "dpc": "03031243101",
            "name": "ហាង  សំណាង"
        },
        {
            "barcode": "171117082",
            "dpc": "03031244101",
            "name": "រុន រ៉ឹយ"
        },
        {
            "barcode": "171117083",
            "dpc": "03031244201",
            "name": "ឡុង ណាគ្រី"
        },
        {
            "barcode": "171117084",
            "dpc": "03031244301",
            "name": "ស សារ៉ាបូពាន៍"
        },
        {
            "barcode": "171117085",
            "dpc": "03031244401",
            "name": "អ៊ុយ វណ្ណា"
        },
        {
            "barcode": "171117087",
            "dpc": "03031243301",
            "name": "យន សម្បត្តិ"
        },
        {
            "barcode": "171117088",
            "dpc": "03031243401",
            "name": "សុខ សុធារិទ្ធ"
        },
        {
            "barcode": "171117089",
            "dpc": "03031243501",
            "name": "កេន ម៉ៅ"
        },
        {
            "barcode": "171117090",
            "dpc": "03031243601",
            "name": "ឌុច សុម៉ាលី"
        },
        {
            "barcode": "171117091",
            "dpc": "03031243701",
            "name": "យន ស៊ីន"
        },
        {
            "barcode": "171117092",
            "dpc": "03031220001",
            "name": "គង់ វុត្ថា"
        },
        {
            "barcode": "171117094",
            "dpc": "03031243901",
            "name": "ប្រាក់ លីវណ្ណៈ"
        },
        {
            "barcode": "171117096",
            "dpc": "03031242901",
            "name": "សំ​ វឹង"
        },
        {
            "barcode": "171117097",
            "dpc": "03031242801",
            "name": "ផៃ ធឿន"
        },
        {
            "barcode": "171117098",
            "dpc": "03031222301",
            "name": "សួ សុផារ៉ាប់"
        },
        {
            "barcode": "171117099",
            "dpc": "03031242501",
            "name": "ទេព សា"
        },
        {
            "barcode": "171117100",
            "dpc": "03031242401",
            "name": "ទេព ស៊ីម"
        },
        {
            "barcode": "171117101",
            "dpc": "03031242301",
            "name": "ស៊ូ ខឿត"
        },
        {
            "barcode": "171117102",
            "dpc": "03031242201",
            "name": "ឈីវ កិរិយា"
        },
        {
            "barcode": "171117103",
            "dpc": "03031242101",
            "name": "ឃុន សុភាព"
        },
        {
            "barcode": "171117104",
            "dpc": "03031242001",
            "name": "ហោ ជា"
        },
        {
            "barcode": "171117105",
            "dpc": "03031241901",
            "name": "អ្នក ម៉ាង"
        },
        {
            "barcode": "171117106",
            "dpc": "03031241801",
            "name": "លី ហ៊ាង (ឈិម សារុំ)"
        },
        {
            "barcode": "171117107",
            "dpc": "03031241701",
            "name": "ណង អឿន"
        },
        {
            "barcode": "171117108",
            "dpc": "03031241601",
            "name": "អ៊ឹវ សារិកាកែវ"
        },
        {
            "barcode": "171117109",
            "dpc": "03031241501",
            "name": "សុខ ហេង"
        },
        {
            "barcode": "171117110",
            "dpc": "03031241401",
            "name": "ឌុច រី"
        },
        {
            "barcode": "171117111",
            "dpc": "03031241301",
            "name": "ណាត គង់"
        },
        {
            "barcode": "171117113",
            "dpc": "03031241101",
            "name": "សុខ នី"
        },
        {
            "barcode": "171117114",
            "dpc": "03031241001",
            "name": "សុខ ធី"
        },
        {
            "barcode": "171117115",
            "dpc": "03031240901",
            "name": "ប៉ិន សុខុន"
        },
        {
            "barcode": "171117116",
            "dpc": "03031240801",
            "name": "សុខ ស៊ីវន"
        },
        {
            "barcode": "171117117",
            "dpc": "03031240701",
            "name": "មិន ញឹម"
        },
        {
            "barcode": "171117118",
            "dpc": "03031240601",
            "name": "ផៃ គង់"
        },
        {
            "barcode": "171117119",
            "dpc": "03031240501",
            "name": "ឈុយ ឡឹម"
        },
        {
            "barcode": "171117120",
            "dpc": "03031240401",
            "name": "អឿន ប្រុស"
        },
        {
            "barcode": "171117121",
            "dpc": "03031240301",
            "name": "នុត ធូក"
        },
        {
            "barcode": "171117122",
            "dpc": "03031240201",
            "name": "អៀង វិន"
        },
        {
            "barcode": "171117123",
            "dpc": "03031240101",
            "name": "វង្ស ឈុតនី"
        },
        {
            "barcode": "171117124",
            "dpc": "03031240001",
            "name": "សេង ទូច"
        },
        {
            "barcode": "171117126",
            "dpc": "03031239801",
            "name": "ឈួន ង៉ូវ"
        },
        {
            "barcode": "171117127",
            "dpc": "03031239701",
            "name": "ថាច់  ចិន្តា"
        },
        {
            "barcode": "171117128",
            "dpc": "03031239601",
            "name": "រី សុខា"
        },
        {
            "barcode": "171117129",
            "dpc": "03031247201",
            "name": "ជុន ផាត"
        },
        {
            "barcode": "171117130",
            "dpc": "03031247101",
            "name": "អុំ សុភី"
        },
        {
            "barcode": "171117131",
            "dpc": "03031247001",
            "name": "ស៊ី នួន"
        },
        {
            "barcode": "171117132",
            "dpc": "03031246901",
            "name": "ប៉ាវ មុនយីន"
        },
        {
            "barcode": "171117133",
            "dpc": "03031246801",
            "name": "លឹម គឹមស្រេង"
        },
        {
            "barcode": "171117134",
            "dpc": "03031246701",
            "name": "វ៉ាន់ ណារី"
        },
        {
            "barcode": "171117135",
            "dpc": "03031246601",
            "name": "គិវ ល័យ"
        },
        {
            "barcode": "171117136",
            "dpc": "03031246401",
            "name": "គិម សឿន"
        },
        {
            "barcode": "171117137",
            "dpc": "03031246301",
            "name": "ពិន ខាន"
        },
        {
            "barcode": "171117138",
            "dpc": "03031246201",
            "name": "គឹម ហួយ"
        },
        {
            "barcode": "171117139",
            "dpc": "03031246101",
            "name": "ពិន ម៉ុក"
        },
        {
            "barcode": "171117142",
            "dpc": "03031239501",
            "name": "លឹម ឆាយ"
        },
        {
            "barcode": "171117143",
            "dpc": "03031239401",
            "name": "ថៃ គង់"
        },
        {
            "barcode": "171117144",
            "dpc": "03031239301",
            "name": "លឹម   ឈន"
        },
        {
            "barcode": "171117145",
            "dpc": "03031239201",
            "name": "ឡោ ខៃ"
        },
        {
            "barcode": "171117146",
            "dpc": "03031239101",
            "name": "លន់ ត្រៃ"
        },
        {
            "barcode": "171117147",
            "dpc": "03031239001",
            "name": "ប៊ិន អូន"
        },
        {
            "barcode": "171117148",
            "dpc": "03031238901",
            "name": "បួន គឹមស្រឿង"
        },
        {
            "barcode": "171117150",
            "dpc": "03031238701",
            "name": "ប៊ុន ចាន់មុនី"
        },
        {
            "barcode": "171117151",
            "dpc": "03031238501",
            "name": "ហោ អៀង"
        },
        {
            "barcode": "171117152",
            "dpc": "03031238401",
            "name": "ប៊ី ណាលីន"
        },
        {
            "barcode": "171117153",
            "dpc": "03031238301",
            "name": "ប៊ិន អឿន"
        },
        {
            "barcode": "171117154",
            "dpc": "03031238201",
            "name": "ចាន់ ស៊ន"
        },
        {
            "barcode": "171117155",
            "dpc": "03031238101",
            "name": "ហៃ តុង"
        },
        {
            "barcode": "171117156",
            "dpc": "03031238001",
            "name": "ស៊ិន សំរេច"
        },
        {
            "barcode": "171117157",
            "dpc": "03031237901",
            "name": "ចាន់ សំអោ"
        },
        {
            "barcode": "171117158",
            "dpc": "03031237801",
            "name": "ផាវ ប៊ុនតឹក"
        },
        {
            "barcode": "171117159",
            "dpc": "03031237701",
            "name": "កែវ អន"
        },
        {
            "barcode": "171117160",
            "dpc": "03031237601",
            "name": "រី សុខា"
        },
        {
            "barcode": "171117161",
            "dpc": "03031237501",
            "name": "គាវ ណយ"
        },
        {
            "barcode": "171117162",
            "dpc": "03031237401",
            "name": "អ៊ឹ ហ៊ុយ"
        },
        {
            "barcode": "171117163",
            "dpc": "03031237301",
            "name": "សៅ សឿន"
        },
        {
            "barcode": "171117164",
            "dpc": "03031237201",
            "name": "ថេន សារឿន"
        },
        {
            "barcode": "171117165",
            "dpc": "03031237101",
            "name": "មួយ ឡេង"
        },
        {
            "barcode": "171117166",
            "dpc": "03031237001",
            "name": "ស៊ិ ស៊ីវ"
        },
        {
            "barcode": "171117167",
            "dpc": "03031236901",
            "name": "គឹម រដ្ឋា"
        },
        {
            "barcode": "171117168",
            "dpc": "03031211801",
            "name": "នី សារ៉ា"
        },
        {
            "barcode": "171117169",
            "dpc": "03031236801",
            "name": "ម៉ឹក សូនី"
        },
        {
            "barcode": "171117171",
            "dpc": "03031236601",
            "name": "គួច ហាវ"
        },
        {
            "barcode": "171117172",
            "dpc": "03031236501",
            "name": "ប៊ុន គង់"
        },
        {
            "barcode": "171117173",
            "dpc": "03031236401",
            "name": "លន់ ស៊ីម"
        },
        {
            "barcode": "171117174",
            "dpc": "03031236301",
            "name": "កែវ ភូមិន្ទ"
        },
        {
            "barcode": "171117175",
            "dpc": "03031236201",
            "name": "ចឹក គា"
        },
        {
            "barcode": "171117176",
            "dpc": "03031236101",
            "name": "ទាវ យ៉ាន់"
        },
        {
            "barcode": "171117177",
            "dpc": "03031236001",
            "name": "លី ឡេង"
        },
        {
            "barcode": "171117178",
            "dpc": "03031235901",
            "name": "ចាន់ ថុល"
        },
        {
            "barcode": "171117179",
            "dpc": "03031235801",
            "name": "សឿម កែវ"
        },
        {
            "barcode": "171117180",
            "dpc": "03031235701",
            "name": "វ៉ាន់  បូយ៉ា"
        },
        {
            "barcode": "171117181",
            "dpc": "03031226501",
            "name": "ខេង  ស្រីទូច"
        },
        {
            "barcode": "171117182",
            "dpc": "03031225901",
            "name": "ស៊ឹម  សុផល"
        },
        {
            "barcode": "171117183",
            "dpc": "03031225701",
            "name": "ស៊ីវ  ជុយ"
        },
        {
            "barcode": "171117184",
            "dpc": "03031225601",
            "name": "សេង  គឹមឈុន"
        },
        {
            "barcode": "171117185",
            "dpc": "03031225501",
            "name": "មៀច  សុមន៍"
        },
        {
            "barcode": "171117186",
            "dpc": "03031225401",
            "name": "ស៊ូ  អៀ"
        },
        {
            "barcode": "171117187",
            "dpc": "03031225301",
            "name": "គី  គង់"
        },
        {
            "barcode": "171117189",
            "dpc": "03031225101",
            "name": "ចេស  សាវុធ"
        },
        {
            "barcode": "171117190",
            "dpc": "03031225001",
            "name": "យ៉ាន  ហួត ២"
        },
        {
            "barcode": "171117191",
            "dpc": "03031224901",
            "name": "យ៉ាន  ហួត ១"
        },
        {
            "barcode": "171117192",
            "dpc": "03031224801",
            "name": "គុយ  សុខ"
        },
        {
            "barcode": "171117193",
            "dpc": "03031224701",
            "name": "តាំង  សាន់"
        },
        {
            "barcode": "171117194",
            "dpc": "03031224601",
            "name": "លឹម  សារ៉ម"
        },
        {
            "barcode": "171117195",
            "dpc": "03031224501",
            "name": "សេង  យ៉ុន"
        },
        {
            "barcode": "171117196",
            "dpc": "03031224401",
            "name": "ជូ  ម៉ាត់លី"
        },
        {
            "barcode": "171117197",
            "dpc": "03031224301",
            "name": "គង់  ឈុន"
        },
        {
            "barcode": "171117198",
            "dpc": "03031224201",
            "name": "ស្មាន់  ប៉ិច"
        },
        {
            "barcode": "171117199",
            "dpc": "03031224101",
            "name": "ចាន់  គឹមហ៊ាង"
        },
        {
            "barcode": "171117200",
            "dpc": "03031224001",
            "name": "ងិន  យឹម"
        },
        {
            "barcode": "171117201",
            "dpc": "03031223901",
            "name": "ហែម  សាវ៉ាត"
        },
        {
            "barcode": "171117202",
            "dpc": "03031223801",
            "name": "លីវ  សុខា"
        },
        {
            "barcode": "171117203",
            "dpc": "03031223701",
            "name": "គង់  ផៃ"
        },
        {
            "barcode": "171117205",
            "dpc": "03031223401",
            "name": "សណ្នាគារខេមរា ១"
        },
        {
            "barcode": "171117206",
            "dpc": "03031223301",
            "name": "សៀង  ស៊ុតថង"
        },
        {
            "barcode": "171117207",
            "dpc": "03031223201",
            "name": "ឃុន  ហេង"
        },
        {
            "barcode": "171117208",
            "dpc": "03031223101",
            "name": "ថាច់  ជួន"
        },
        {
            "barcode": "171117209",
            "dpc": "03031223001",
            "name": "ម៉ៅ  សុផល"
        },
        {
            "barcode": "171117210",
            "dpc": "03031222901",
            "name": "ធុយ  ជួប"
        },
        {
            "barcode": "171117211",
            "dpc": "03031222801",
            "name": "ឯក  ជិវ័ន ២"
        },
        {
            "barcode": "171117212",
            "dpc": "03031222601",
            "name": "ទេព   ហ៊ាន"
        },
        {
            "barcode": "171117213",
            "dpc": "03031222501",
            "name": "សុស  ឈូក"
        },
        {
            "barcode": "171117214",
            "dpc": "03031222401",
            "name": "ស  បេងទូ"
        },
        {
            "barcode": "171117215",
            "dpc": "03031222201",
            "name": "ណៃ  គឹមស៊ុន"
        },
        {
            "barcode": "171117216",
            "dpc": "03031222101",
            "name": "ហុក  ឃន"
        },
        {
            "barcode": "171117217",
            "dpc": "03031222001",
            "name": "ចៅ  សូវង្ស"
        },
        {
            "barcode": "171117218",
            "dpc": "03031221201",
            "name": "ង៉ោ  សុធី"
        },
        {
            "barcode": "171117219",
            "dpc": "03031221101",
            "name": "ឌុច   សៀង"
        },
        {
            "barcode": "171117220",
            "dpc": "03031221001",
            "name": "ហាក់  ស្រី"
        },
        {
            "barcode": "171117221",
            "dpc": "03031220901",
            "name": "ទេព  ហ៊ឹម"
        },
        {
            "barcode": "171117222",
            "dpc": "03031220801",
            "name": "អេង  សាវឿន ២"
        },
        {
            "barcode": "171117223",
            "dpc": "03031220701",
            "name": "អេង  សាវឿន"
        },
        {
            "barcode": "171117224",
            "dpc": "03031220601",
            "name": "ឈិន  យាន"
        },
        {
            "barcode": "171117225",
            "dpc": "03031220501",
            "name": "ឃុន  ស៊ាង"
        },
        {
            "barcode": "171117226",
            "dpc": "03031223601",
            "name": "វង្ស  ផាន់"
        },
        {
            "barcode": "171117227",
            "dpc": "03031200201",
            "name": "ឌុច ចំរ៉ាត់"
        },
        {
            "barcode": "171117228",
            "dpc": "03031200301",
            "name": "ឡេង លីម"
        },
        {
            "barcode": "171117229",
            "dpc": "03031200401",
            "name": "ឯម ស៊ីថុល"
        },
        {
            "barcode": "171117230",
            "dpc": "03031200501",
            "name": "មាស ស៊ីណាត"
        },
        {
            "barcode": "171117231",
            "dpc": "03031200601",
            "name": "សុខ មឿន"
        },
        {
            "barcode": "171117232",
            "dpc": "03031200701",
            "name": "ភូ សុផល"
        },
        {
            "barcode": "171117233",
            "dpc": "03031200801",
            "name": "សួន ជន"
        },
        {
            "barcode": "171117234",
            "dpc": "03031200901",
            "name": "នូ ម៉េង"
        },
        {
            "barcode": "171117235",
            "dpc": "03031201001",
            "name": "តែ ពៅចិន្តា"
        },
        {
            "barcode": "171117236",
            "dpc": "03031201101",
            "name": "តុក សួរ"
        },
        {
            "barcode": "171117237",
            "dpc": "03031201201",
            "name": "សោម សាឃឿង"
        },
        {
            "barcode": "171117238",
            "dpc": "03031201301",
            "name": "ខួច សុផល"
        },
        {
            "barcode": "171117239",
            "dpc": "03031201401",
            "name": "លឹម ហួត"
        },
        {
            "barcode": "171117240",
            "dpc": "03031201501",
            "name": "ទឹម វណ្ណា"
        },
        {
            "barcode": "171117241",
            "dpc": "03031201601",
            "name": "អែម  ហ៊ន"
        },
        {
            "barcode": "171117242",
            "dpc": "03031201701",
            "name": "ជូ ធានហួត"
        },
        {
            "barcode": "171117243",
            "dpc": "03031201801",
            "name": "ខៀវ សារ៉ូ"
        },
        {
            "barcode": "171117244",
            "dpc": "03031201901",
            "name": "ហ៊ុយ គឹមសេម"
        },
        {
            "barcode": "171117245",
            "dpc": "03031202001",
            "name": "ទារ៍ សារ៉ាត់"
        },
        {
            "barcode": "171117247",
            "dpc": "03031202201",
            "name": "ទឹម ជូនេត្រ្ត"
        },
        {
            "barcode": "171117248",
            "dpc": "03031202301",
            "name": "សុខ ហេង"
        },
        {
            "barcode": "171117249",
            "dpc": "03031202401",
            "name": "ឆេង ហួត"
        },
        {
            "barcode": "171117250",
            "dpc": "03031202501",
            "name": "នូ ស៊ីធឿន"
        },
        {
            "barcode": "171117251",
            "dpc": "03031202601",
            "name": "ជា គឹមហង់"
        },
        {
            "barcode": "171117252",
            "dpc": "03031202701",
            "name": "យិន សុខេន"
        },
        {
            "barcode": "171117253",
            "dpc": "03031202801",
            "name": "សេង ហួរ"
        },
        {
            "barcode": "171117254",
            "dpc": "03031202901",
            "name": "ចៅ ឈឹមភីរម្យ"
        },
        {
            "barcode": "171117255",
            "dpc": "03031203001",
            "name": "ព្រំ ដាយ"
        },
        {
            "barcode": "171117256",
            "dpc": "03031203101",
            "name": "ម៉ឹន សារី"
        },
        {
            "barcode": "171117257",
            "dpc": "03031203201",
            "name": "ប៉ាន់ ផង់"
        },
        {
            "barcode": "171117258",
            "dpc": "03031203301",
            "name": "ជា គីញឈួង"
        },
        {
            "barcode": "171117259",
            "dpc": "03031203401",
            "name": "ជា វ៉ៃ"
        },
        {
            "barcode": "171117261",
            "dpc": "03031203601",
            "name": "ប៉ែន  នាង"
        },
        {
            "barcode": "171117262",
            "dpc": "03031203701",
            "name": "ឆាន   សូ"
        },
        {
            "barcode": "171117263",
            "dpc": "03031203801",
            "name": "ឈិន   ង៉ាម"
        },
        {
            "barcode": "171117264",
            "dpc": "03031203901",
            "name": "ចាន់  ប្រម"
        },
        {
            "barcode": "171117265",
            "dpc": "03031204001",
            "name": "គឹម  សាយ"
        },
        {
            "barcode": "171117266",
            "dpc": "03031204101",
            "name": "គុណ  ភាព"
        },
        {
            "barcode": "171117267",
            "dpc": "03031204201",
            "name": "ឡេង  រ័ត្ន"
        },
        {
            "barcode": "171117268",
            "dpc": "03031204301",
            "name": "មៀន  សុផល"
        },
        {
            "barcode": "171117269",
            "dpc": "03031204401",
            "name": "មាស   ធន"
        },
        {
            "barcode": "171117270",
            "dpc": "03031204501",
            "name": "ឱក  ឈៀក"
        },
        {
            "barcode": "171117271",
            "dpc": "03031204601",
            "name": "គួយ  គឹមស៊ន"
        },
        {
            "barcode": "171117272",
            "dpc": "03031204701",
            "name": "ជុំ  សំណាង"
        },
        {
            "barcode": "171117274",
            "dpc": "03031205101",
            "name": "សុខ  ឡាវ"
        },
        {
            "barcode": "171117275",
            "dpc": "03031205201",
            "name": "អ៊ុក   ហេង"
        },
        {
            "barcode": "171117276",
            "dpc": "03031205301",
            "name": "សយ  សារិក"
        },
        {
            "barcode": "171117277",
            "dpc": "03031205401",
            "name": "ទុចូ  ម៉ៅ"
        },
        {
            "barcode": "171117278",
            "dpc": "03031205601",
            "name": "ប៊ីន  សារ៉ន"
        },
        {
            "barcode": "171117279",
            "dpc": "03031205501",
            "name": "ប៉េង  តាំងហៃ"
        },
        {
            "barcode": "171117280",
            "dpc": "03031205701",
            "name": "ម៉ី  សុវណ្ណ"
        },
        {
            "barcode": "171117281",
            "dpc": "03031205801",
            "name": "ប៉ាន់  វណ្ណះ"
        },
        {
            "barcode": "171117282",
            "dpc": "03031205901",
            "name": "ប៉ិញ ច័ន្ទឧត្តម"
        },
        {
            "barcode": "171117283",
            "dpc": "03031206001",
            "name": "ឆន  ហួត"
        },
        {
            "barcode": "171117284",
            "dpc": "03031206101",
            "name": "យឹម  មាន"
        },
        {
            "barcode": "171117285",
            "dpc": "03031206201",
            "name": "ជូ  ម៉ាឡែន"
        },
        {
            "barcode": "171117286",
            "dpc": "03031206301",
            "name": "ណៃ  គឹមវ៉ិត"
        },
        {
            "barcode": "171117287",
            "dpc": "03031206401",
            "name": "សុខ  ឡាវ"
        },
        {
            "barcode": "171117288",
            "dpc": "03031206501",
            "name": "សេង  សុភាព"
        },
        {
            "barcode": "171117289",
            "dpc": "03031206601",
            "name": "សាន  គឹម  ស៊ត"
        },
        {
            "barcode": "171117291",
            "dpc": "03031206801",
            "name": "គង់  ឈឿន"
        },
        {
            "barcode": "171117292",
            "dpc": "03031206901",
            "name": "អង្កការ ស៊ី.អ.អែស"
        },
        {
            "barcode": "171117293",
            "dpc": "03031207001",
            "name": "ភោគ  សារ័ត្ន"
        },
        {
            "barcode": "171117294",
            "dpc": "03031207101",
            "name": "គុយ  វិចិត្រ"
        },
        {
            "barcode": "171117295",
            "dpc": "03031207201",
            "name": "គុយ  ម៉េង"
        },
        {
            "barcode": "171117296",
            "dpc": "03031207401",
            "name": "ជា  គឹមឈួង ១"
        },
        {
            "barcode": "171117298",
            "dpc": "03031207701",
            "name": "គី  សេរី"
        },
        {
            "barcode": "171117299",
            "dpc": "03031207801",
            "name": "ទិត  សុខ"
        },
        {
            "barcode": "171117300",
            "dpc": "03031207901",
            "name": "លី  ហួរ"
        },
        {
            "barcode": "171117301",
            "dpc": "03031208001",
            "name": "ហេង  ភួន"
        },
        {
            "barcode": "171117302",
            "dpc": "03031208101",
            "name": "វ៉ាន់  ញ៉ាញ់"
        },
        {
            "barcode": "171117303",
            "dpc": "03031208201",
            "name": "តែ   សុផាន់ណា"
        },
        {
            "barcode": "171117304",
            "dpc": "03031208301",
            "name": "ឈុន ចិន្តា"
        },
        {
            "barcode": "171117305",
            "dpc": "03031208401",
            "name": "អ៊ឹង  សេង"
        },
        {
            "barcode": "171117306",
            "dpc": "03031208501",
            "name": "ស៊ុយ  លីម"
        },
        {
            "barcode": "171117307",
            "dpc": "03031208601",
            "name": "ស្រី  សឹង"
        },
        {
            "barcode": "171117308",
            "dpc": "03031208701",
            "name": "ឌី  យ៉ុន"
        },
        {
            "barcode": "171117309",
            "dpc": "03031208801",
            "name": "លឹម  សុខគី"
        },
        {
            "barcode": "171117310",
            "dpc": "03031208901",
            "name": "ទេព  សាកន"
        },
        {
            "barcode": "171117312",
            "dpc": "03031209101",
            "name": "លី  ណាំ"
        },
        {
            "barcode": "171117313",
            "dpc": "03031209201",
            "name": "រស់  សុខុម"
        },
        {
            "barcode": "171117314",
            "dpc": "03031209301",
            "name": "ឆាង  ហេង"
        },
        {
            "barcode": "171117315",
            "dpc": "03031209401",
            "name": "រស់ សុផុន"
        },
        {
            "barcode": "171117316",
            "dpc": "03031209501",
            "name": "អាំឡង់  ឌី"
        },
        {
            "barcode": "171117317",
            "dpc": "03031209601",
            "name": "ខ្លូត  រិទ្ធ"
        },
        {
            "barcode": "171117318",
            "dpc": "03031209701",
            "name": "ញឹម ហុង"
        },
        {
            "barcode": "171117319",
            "dpc": "03031209801",
            "name": "អ៊ឹង  សេងទិន"
        },
        {
            "barcode": "171117320",
            "dpc": "03031209901",
            "name": "ម៉ូវ  សម្បត្តិ"
        },
        {
            "barcode": "171117321",
            "dpc": "03031210001",
            "name": "តូម  អូន"
        },
        {
            "barcode": "171117322",
            "dpc": "03031210101",
            "name": "សា  កញ្ញា"
        },
        {
            "barcode": "171117323",
            "dpc": "03031210201",
            "name": "ខេង  សុខឡាយ"
        },
        {
            "barcode": "171117324",
            "dpc": "03031210301",
            "name": "ប្រាក់  ថុង"
        },
        {
            "barcode": "171117325",
            "dpc": "03031210401",
            "name": "គ្រុយ  មុយហ្គិច"
        },
        {
            "barcode": "171117326",
            "dpc": "03031210501",
            "name": "ច្រាយ  ប៊ុន"
        },
        {
            "barcode": "171117327",
            "dpc": "03031210601",
            "name": "ង៉ែត  តុន"
        },
        {
            "barcode": "171117328",
            "dpc": "03031210701",
            "name": "សំ  លីង"
        },
        {
            "barcode": "171117329",
            "dpc": "03031210801",
            "name": "សាន  គឹមស៊ត"
        },
        {
            "barcode": "171117330",
            "dpc": "03031210901",
            "name": "តុក គឹមស៊្រុន"
        },
        {
            "barcode": "171117331",
            "dpc": "03031211001",
            "name": "លន់   សំប៊ី"
        },
        {
            "barcode": "171117332",
            "dpc": "03031211101",
            "name": "ស៊ឹម  សល្យ"
        },
        {
            "barcode": "171117333",
            "dpc": "03031211201",
            "name": "ជា  សាបឿន"
        },
        {
            "barcode": "171117334",
            "dpc": "03031211301",
            "name": "យូរ  ចន្ថា"
        },
        {
            "barcode": "171117335",
            "dpc": "03031211401",
            "name": "ស្មី  រដ្ឋា"
        },
        {
            "barcode": "171117336",
            "dpc": "03031211501",
            "name": "អ៊ុក  វណ្ណា"
        },
        {
            "barcode": "171117337",
            "dpc": "03031211601",
            "name": "ពិន  ណារ៉េត"
        },
        {
            "barcode": "171117338",
            "dpc": "03031211701",
            "name": "សៅ  តាប់"
        },
        {
            "barcode": "171117340",
            "dpc": "03031214101",
            "name": "ជា សារិន"
        },
        {
            "barcode": "171117341",
            "dpc": "03031214201",
            "name": "កែវ សេងលន់"
        },
        {
            "barcode": "171117342",
            "dpc": "03031214301",
            "name": "អន ថាវរិទ្ធ"
        },
        {
            "barcode": "171117344",
            "dpc": "03031214501",
            "name": "វង្ស ឃុតឈឿង"
        },
        {
            "barcode": "171117345",
            "dpc": "03031214601",
            "name": "សេង ហ៊ាង"
        },
        {
            "barcode": "171117346",
            "dpc": "03031214701",
            "name": "សេង សៀហៃ ១"
        },
        {
            "barcode": "171117347",
            "dpc": "03031214801",
            "name": "សេង សៀហៃ ២"
        },
        {
            "barcode": "171117348",
            "dpc": "03031214901",
            "name": "មាស សាម៉ុន"
        },
        {
            "barcode": "171117349",
            "dpc": "03031215001",
            "name": "ខៀវ សេងលី"
        },
        {
            "barcode": "171117350",
            "dpc": "03031215101",
            "name": "កែវ សេងលន់"
        },
        {
            "barcode": "171117351",
            "dpc": "03031215201",
            "name": "ជំនឿ សិច្ចរ៉ា ១"
        },
        {
            "barcode": "171117352",
            "dpc": "03031215301",
            "name": "ជំនឿ សិច្ចរ៉ា ២"
        },
        {
            "barcode": "171117353",
            "dpc": "03031215401",
            "name": "ថាច់ សែ"
        },
        {
            "barcode": "171117354",
            "dpc": "03031215501",
            "name": "ឌឹម វីរោចន៍"
        },
        {
            "barcode": "171117355",
            "dpc": "03031215601",
            "name": "ពុំ សារិក"
        },
        {
            "barcode": "171117356",
            "dpc": "03031215701",
            "name": "ឈឹម គ្រីហ្វុង"
        },
        {
            "barcode": "171117357",
            "dpc": "03031215801",
            "name": "តេង ហេង"
        },
        {
            "barcode": "171117358",
            "dpc": "03031215901",
            "name": "អ៊ុក គឹមទី"
        },
        {
            "barcode": "171117359",
            "dpc": "03031216001",
            "name": "កណ្តៀង ជឿន"
        },
        {
            "barcode": "171117360",
            "dpc": "03031216101",
            "name": "ព្រំ ធៀន"
        },
        {
            "barcode": "171117361",
            "dpc": "03031216201",
            "name": "លឹម ហ៊ុន"
        },
        {
            "barcode": "171117362",
            "dpc": "03031216301",
            "name": "អ៊ឹម លាភ"
        },
        {
            "barcode": "171117363",
            "dpc": "03031216401",
            "name": "វង្ស គឹមហ៊ាង"
        },
        {
            "barcode": "171117364",
            "dpc": "03031216501",
            "name": "អ៊ិន ញឹម"
        },
        {
            "barcode": "171117365",
            "dpc": "03031216701",
            "name": "សួន  សារុន"
        },
        {
            "barcode": "171117366",
            "dpc": "03031216801",
            "name": "សៀង  ហ៊ាង"
        },
        {
            "barcode": "171117367",
            "dpc": "03031216901",
            "name": "ឯល  វ៉ាន់"
        },
        {
            "barcode": "171117368",
            "dpc": "03031217001",
            "name": "គី  ទិត"
        },
        {
            "barcode": "171117369",
            "dpc": "03031217101",
            "name": "អុំ  វណ្ណះ"
        },
        {
            "barcode": "171117370",
            "dpc": "03031217201",
            "name": "ឆេង  ទ្រី"
        },
        {
            "barcode": "171117371",
            "dpc": "03031217301",
            "name": "សុខ  ប៊ុនដារា"
        },
        {
            "barcode": "171117372",
            "dpc": "03031217401",
            "name": "ជូ អ៊ឹម"
        },
        {
            "barcode": "171117373",
            "dpc": "03031217501",
            "name": "ថូយ ទ្រី"
        },
        {
            "barcode": "171117374",
            "dpc": "03031217601",
            "name": "ខៀវ ភីរុណ"
        },
        {
            "barcode": "171117375",
            "dpc": "03031217701",
            "name": "តន់ សាវ៉េត"
        },
        {
            "barcode": "171117377",
            "dpc": "03031217901",
            "name": "ឃៀន ខឿម"
        },
        {
            "barcode": "171117378",
            "dpc": "03031218001",
            "name": "ម៉ែន ទីន"
        },
        {
            "barcode": "171117379",
            "dpc": "03031218101",
            "name": "គឹម ទុយ"
        },
        {
            "barcode": "171117380",
            "dpc": "03031218201",
            "name": "ម៉ៅ សាម៉េត"
        },
        {
            "barcode": "171117381",
            "dpc": "03031218301",
            "name": "ប៊ុន ប៊ុនធឿន"
        },
        {
            "barcode": "171117382",
            "dpc": "03031218401",
            "name": "រៀន វីវៈ"
        },
        {
            "barcode": "171117383",
            "dpc": "03031218501",
            "name": "ជំនឿ សិច្ចរ៉ា"
        },
        {
            "barcode": "171117384",
            "dpc": "03031218601",
            "name": "ឡា ឡាប"
        },
        {
            "barcode": "171117385",
            "dpc": "03031218701",
            "name": "ឈឿង សារ៉ាត់"
        },
        {
            "barcode": "171117386",
            "dpc": "03031218801",
            "name": "អ៊ុំ ខេមរា"
        },
        {
            "barcode": "171117387",
            "dpc": "03031218901",
            "name": "សេង សុភរា"
        },
        {
            "barcode": "171117388",
            "dpc": "03031219001",
            "name": "លន់ ម៉ាណែត"
        },
        {
            "barcode": "171117389",
            "dpc": "03031219101",
            "name": "ទិត្យ ឈៀង"
        },
        {
            "barcode": "171117390",
            "dpc": "03031219201",
            "name": "ជឹម សុខឡាយ"
        },
        {
            "barcode": "171117391",
            "dpc": "03031219301",
            "name": "គង់ ស្រីនាង"
        },
        {
            "barcode": "171117392",
            "dpc": "03031216601",
            "name": "ជូន រិទ្ធី"
        },
        {
            "barcode": "171117393",
            "dpc": "03031219401",
            "name": "មាស ឡូញ ២"
        },
        {
            "barcode": "171117394",
            "dpc": "03031219501",
            "name": "សួស សុខ"
        },
        {
            "barcode": "171117395",
            "dpc": "03031219601",
            "name": "សាក់ ចំរើន"
        },
        {
            "barcode": "171117396",
            "dpc": "03031219701",
            "name": "មាស ឡូញ ១"
        },
        {
            "barcode": "171117397",
            "dpc": "03031219801",
            "name": "ហ៊ិន ពេញ"
        },
        {
            "barcode": "171117398",
            "dpc": "03031219901",
            "name": "ឃឿម គឹមហោ"
        },
        {
            "barcode": "171117399",
            "dpc": "03031231701",
            "name": "ប៉ែន ពិរោះ"
        },
        {
            "barcode": "171117400",
            "dpc": "03031204901",
            "name": "កេតុ សឿ"
        },
        {
            "barcode": "171117401",
            "dpc": "03031247901",
            "name": "សៅ សោភ័ណ្ឌ"
        },
        {
            "barcode": "171117402",
            "dpc": "03031247801",
            "name": "គឹម បឹង"
        },
        {
            "barcode": "171117404",
            "dpc": "03031247601",
            "name": "សួន សុខេង"
        },
        {
            "barcode": "171117405",
            "dpc": "03031247501",
            "name": "អ៊ុក ចិប"
        },
        {
            "barcode": "171117406",
            "dpc": "03031247401",
            "name": "ង៉ែត បុប្ផាចាន់"
        },
        {
            "barcode": "171117407",
            "dpc": "03031247301",
            "name": "អ៊ុក បូរ៉ា"
        },
        {
            "barcode": "171117408",
            "dpc": "03031226601",
            "name": "ផល ម៉ុន"
        },
        {
            "barcode": "171117409",
            "dpc": "03031226701",
            "name": "មួង ស៊ុនហេង ១"
        },
        {
            "barcode": "171117410",
            "dpc": "03031226801",
            "name": "រឿន សោភ័ណ្ឌ"
        },
        {
            "barcode": "171117411",
            "dpc": "03031226901",
            "name": "គុយ សុខ"
        },
        {
            "barcode": "171117412",
            "dpc": "03031227001",
            "name": "ដួង សុខសារិន"
        },
        {
            "barcode": "171117413",
            "dpc": "03031227101",
            "name": "ម៉ា រ៉ុន"
        },
        {
            "barcode": "171117414",
            "dpc": "03031227201",
            "name": "សុខ ឈឿន"
        },
        {
            "barcode": "171117415",
            "dpc": "03031227301",
            "name": "អាត់ ខែម"
        },
        {
            "barcode": "171117416",
            "dpc": "03031227401",
            "name": "លឹម សុខវ៉ាន់"
        },
        {
            "barcode": "171117417",
            "dpc": "03031227501",
            "name": "យ៉ាត គឹមលិន"
        },
        {
            "barcode": "171117418",
            "dpc": "03031227601",
            "name": "ញ៉ុញ សាណុំ"
        },
        {
            "barcode": "171117420",
            "dpc": "03031227801",
            "name": "មឿន ឆ័យ"
        },
        {
            "barcode": "171117421",
            "dpc": "03031245201",
            "name": "គង់ សាន"
        },
        {
            "barcode": "171117422",
            "dpc": "03031227901",
            "name": "ភុំ វ៉ារ៉ែន"
        },
        {
            "barcode": "171117423",
            "dpc": "03031228001",
            "name": "ជួង ខ្វា"
        },
        {
            "barcode": "171117424",
            "dpc": "03031228101",
            "name": "គឹម លាង"
        },
        {
            "barcode": "171117425",
            "dpc": "03031228201",
            "name": "ពិន ជុំ"
        },
        {
            "barcode": "171117426",
            "dpc": "03031228301",
            "name": "យ៉ត ឆាត់"
        },
        {
            "barcode": "171117428",
            "dpc": "03031228501",
            "name": "វ៉ន ឈុនលី"
        },
        {
            "barcode": "171117429",
            "dpc": "03031228601",
            "name": "ហ៊ី ឈុន"
        },
        {
            "barcode": "171117430",
            "dpc": "03031228701",
            "name": "ហេង ពៅ"
        },
        {
            "barcode": "171117431",
            "dpc": "03031228801",
            "name": "ឡោ យក់ លន់"
        },
        {
            "barcode": "171117432",
            "dpc": "03031228901",
            "name": "តេង លឹម"
        },
        {
            "barcode": "171117433",
            "dpc": "03031229001",
            "name": "មួង ស៊ុនហេង ២"
        },
        {
            "barcode": "171117435",
            "dpc": "03031230701",
            "name": "សុខ ឡាវ"
        },
        {
            "barcode": "171117436",
            "dpc": "03031230601",
            "name": "សេង កុសល់"
        },
        {
            "barcode": "171117437",
            "dpc": "03031230501",
            "name": "សោ គឹមសាន"
        },
        {
            "barcode": "171117438",
            "dpc": "03031230401",
            "name": "មឹក ហួយ"
        },
        {
            "barcode": "171117439",
            "dpc": "03031230301",
            "name": "រី ដេត"
        },
        {
            "barcode": "171117440",
            "dpc": "03031230201",
            "name": "អ៊ុក ចាប"
        },
        {
            "barcode": "171117441",
            "dpc": "03031230101",
            "name": "ម៉ោញ សារ៉ាត់"
        },
        {
            "barcode": "171117442",
            "dpc": "03031230001",
            "name": "វ៉ាន់ ម៉ានី"
        },
        {
            "barcode": "171117444",
            "dpc": "03031229801",
            "name": "ហួយ កុសល់"
        },
        {
            "barcode": "171117445",
            "dpc": "03031229701",
            "name": "ជៀវ វន"
        },
        {
            "barcode": "171117446",
            "dpc": "03031229601",
            "name": "ដាំ​ ស្វាង"
        },
        {
            "barcode": "171117447",
            "dpc": "03031229501",
            "name": "ឌី ញ៉ុន"
        },
        {
            "barcode": "171117450",
            "dpc": "03031229201",
            "name": "សយ សុផល"
        },
        {
            "barcode": "171117451",
            "dpc": "03031232601",
            "name": "តាំង ស៊ុនហួរ"
        },
        {
            "barcode": "171117452",
            "dpc": "03031232501",
            "name": "ខៀវ ស៊ន"
        },
        {
            "barcode": "171117453",
            "dpc": "03031232401",
            "name": "លី គឹមសាន"
        },
        {
            "barcode": "171117454",
            "dpc": "03031232301",
            "name": "ឃុត សាអុំ"
        },
        {
            "barcode": "171117456",
            "dpc": "03031232101",
            "name": "គឹម សារ៉ន"
        },
        {
            "barcode": "171117457",
            "dpc": "03031232001",
            "name": "ឈួន គឹមឈន"
        },
        {
            "barcode": "171117458",
            "dpc": "03031231901",
            "name": "យប់ វង់"
        },
        {
            "barcode": "171117459",
            "dpc": "03031231801",
            "name": "អាន ថាវី"
        },
        {
            "barcode": "171117460",
            "dpc": "03031231601",
            "name": "កង យេត"
        },
        {
            "barcode": "171117461",
            "dpc": "03031231501",
            "name": "ណៃ គឹមសុន"
        },
        {
            "barcode": "171117462",
            "dpc": "03031231401",
            "name": "រាជ ថេត"
        },
        {
            "barcode": "171117463",
            "dpc": "03031231301",
            "name": "ជូរ សុខហេង"
        },
        {
            "barcode": "171117464",
            "dpc": "03031231201",
            "name": "តាន់ សុខា"
        },
        {
            "barcode": "171117465",
            "dpc": "03031231101",
            "name": "ខ្លួត បឿន"
        },
        {
            "barcode": "171117466",
            "dpc": "03031231001",
            "name": "តោ ជុន"
        },
        {
            "barcode": "171117467",
            "dpc": "03031230901",
            "name": "ឌួង សំអុល"
        },
        {
            "barcode": "171117468",
            "dpc": "03031230801",
            "name": "ពុធ សំអាន"
        },
        {
            "barcode": "171117469",
            "dpc": "03031213801",
            "name": "សៀង សុវឌ្ឍនា ៣"
        },
        {
            "barcode": "171117470",
            "dpc": "03031213901",
            "name": "សៀ ស៊ិន"
        },
        {
            "barcode": "171117471",
            "dpc": "03031213701",
            "name": "សៀង សុវឌ្ឍនា ២"
        },
        {
            "barcode": "171117472",
            "dpc": "03031213601",
            "name": "សៀង សុវឌ្ឍនា ១"
        },
        {
            "barcode": "171117473",
            "dpc": "03031213501",
            "name": "ជូ ផល្លា"
        },
        {
            "barcode": "171117474",
            "dpc": "03031213401",
            "name": "យក់ ហ៊ុន"
        },
        {
            "barcode": "171117475",
            "dpc": "03031213301",
            "name": "យាំ យ៉េត ២"
        },
        {
            "barcode": "171117476",
            "dpc": "03031213201",
            "name": "យាំ យ៉េត ១"
        },
        {
            "barcode": "171117477",
            "dpc": "03031213101",
            "name": "អៀម ម៉េងគង់"
        },
        {
            "barcode": "171117478",
            "dpc": "03031213001",
            "name": "សយ ស្រ៊ុន"
        },
        {
            "barcode": "171117479",
            "dpc": "03031212901",
            "name": "សេង ហឹយ"
        },
        {
            "barcode": "171117480",
            "dpc": "03031212801",
            "name": "ហ៊ីន ភួងណារី"
        },
        {
            "barcode": "171117481",
            "dpc": "03031212701",
            "name": "ចាន់ ផារិន"
        },
        {
            "barcode": "171117482",
            "dpc": "03031212601",
            "name": "អ៊ុំ ចិត្រ"
        },
        {
            "barcode": "171117483",
            "dpc": "03031212501",
            "name": "ភោគ រស្មី"
        },
        {
            "barcode": "171117484",
            "dpc": "03031212401",
            "name": "ទេស កៅ"
        },
        {
            "barcode": "171117485",
            "dpc": "03031212301",
            "name": "ជុំ ស៊ីថា"
        },
        {
            "barcode": "171117486",
            "dpc": "03031212201",
            "name": "ឌឿ សង្វាវ៉ាន"
        },
        {
            "barcode": "171117487",
            "dpc": "03031212101",
            "name": "រួម រុន"
        },
        {
            "barcode": "171117488",
            "dpc": "03031235501",
            "name": "វិញ យ៉េន"
        },
        {
            "barcode": "171117489",
            "dpc": "03031235601",
            "name": "ហុង ងួន"
        },
        {
            "barcode": "171117490",
            "dpc": "03031235401",
            "name": "ឡុង វ៉ាន់នី"
        },
        {
            "barcode": "171117491",
            "dpc": "03031235301",
            "name": "សំ វីឡុង"
        },
        {
            "barcode": "171117492",
            "dpc": "03031234301",
            "name": "ទូច មុំ"
        },
        {
            "barcode": "171117493",
            "dpc": "03031234201",
            "name": "ភោគ ឡឹក"
        },
        {
            "barcode": "171117494",
            "dpc": "03031234101",
            "name": "សេង គុណ"
        },
        {
            "barcode": "171117495",
            "dpc": "03031234001",
            "name": "និល ប៊ុនណ្ណា"
        },
        {
            "barcode": "171117496",
            "dpc": "03031233901",
            "name": "ហុក សុខា"
        },
        {
            "barcode": "171117498",
            "dpc": "03031233701",
            "name": "លាង ស្រេង"
        },
        {
            "barcode": "171117499",
            "dpc": "03031234601",
            "name": "ហែម ទុំ"
        },
        {
            "barcode": "171117500",
            "dpc": "03031234701",
            "name": "ស៊ឹម វ៉ាន់"
        },
        {
            "barcode": "171117501",
            "dpc": "03031234801",
            "name": "លី សារុំ"
        },
        {
            "barcode": "171117502",
            "dpc": "03031234901",
            "name": "សេន សារឿន"
        },
        {
            "barcode": "171117503",
            "dpc": "03031235001",
            "name": "ជា សម្បត្តិ"
        },
        {
            "barcode": "171117504",
            "dpc": "03031235101",
            "name": "កង ណារីន"
        },
        {
            "barcode": "171117505",
            "dpc": "03031235201",
            "name": "នៃ ច័ន្ទថន"
        },
        {
            "barcode": "171117506",
            "dpc": "03031233601",
            "name": "លន់ ឡៃមិញ"
        },
        {
            "barcode": "171117507",
            "dpc": "03031233501",
            "name": "ច័ន្ទ សុឋាន"
        },
        {
            "barcode": "171117508",
            "dpc": "03031233401",
            "name": "ពេជ្រ បុប្ផា"
        },
        {
            "barcode": "171117509",
            "dpc": "03031233301",
            "name": "រស់ ឃ្លោក"
        },
        {
            "barcode": "171117510",
            "dpc": "03031233201",
            "name": "ម៉ៅ ផល្លា"
        },
        {
            "barcode": "171117511",
            "dpc": "03031233101",
            "name": "ទុយ ប៊ុនរ៉ាត់"
        },
        {
            "barcode": "171117512",
            "dpc": "03031232901",
            "name": "ថន នី"
        },
        {
            "barcode": "171117513",
            "dpc": "03031232801",
            "name": "លាវ សុជាតិ"
        },
        {
            "barcode": "171117514",
            "dpc": "03031211901",
            "name": "ឃឹម សារ៉ន"
        },
        {
            "barcode": "171117515",
            "dpc": "03031232701",
            "name": "សេង ភី"
        },
        {
            "barcode": "171117516",
            "dpc": "03031200101",
            "name": "ព្រាប   វន"
        },
        {
            "barcode": "171117517",
            "dpc": "03031205001",
            "name": "ខៀវ  សំបូរ"
        },
        {
            "barcode": "171117519",
            "dpc": "03031212001",
            "name": "គណៈបក្សប្រជាជន"
        },
        {
            "barcode": "171117520",
            "dpc": "03031220101",
            "name": "ចៅ  ហ្វឹង (៥៥៥ )"
        },
        {
            "barcode": "171117521",
            "dpc": "03031220201",
            "name": "ពេជ្រ  ណាឡុង"
        },
        {
            "barcode": "171117522",
            "dpc": "03031220301",
            "name": "ឡុង  ប៊ុនហេង"
        },
        {
            "barcode": "171117523",
            "dpc": "03031220401",
            "name": "គឹម  ស៊្រុន"
        },
        {
            "barcode": "171117524",
            "dpc": "03031222701",
            "name": "ឯក  ជិវ័ន ១"
        },
        {
            "barcode": "171117525",
            "dpc": "03031226301",
            "name": "បែន  ភួង"
        },
        {
            "barcode": "171117526",
            "dpc": "03031233001",
            "name": "ឡាច  ប៊ុនថាច"
        },
        {
            "barcode": "171117528",
            "dpc": "03031234501",
            "name": "ផាត់  មុំ"
        },
        {
            "barcode": "171117529",
            "dpc": "03031246501",
            "name": "ឡុង  វ៉ាន់រ៉ា"
        },
        {
            "barcode": "171117530",
            "dpc": "03031221301",
            "name": "តូច  ស៊ិនណារ៉ា"
        },
        {
            "barcode": "171117532",
            "dpc": "03031221501",
            "name": "ណុប  សាមិ"
        },
        {
            "barcode": "171117533",
            "dpc": "03031221601",
            "name": "ឡាយ  គឹមហៀក"
        },
        {
            "barcode": "171117534",
            "dpc": "03031221701",
            "name": "យូ  គង់"
        },
        {
            "barcode": "171117535",
            "dpc": "03031221801",
            "name": "ផាត់  តុង"
        },
        {
            "barcode": "171117536",
            "dpc": "03031221901",
            "name": "លឿង  ប៊ួយ"
        },
        {
            "barcode": "171117537",
            "dpc": "03031225801",
            "name": "យោង  យិន"
        },
        {
            "barcode": "171117538",
            "dpc": "03031226001",
            "name": "ពឹង  គឹមហួរ"
        },
        {
            "barcode": "171117539",
            "dpc": "03031226101",
            "name": "យ៉ាន់  លឿម"
        },
        {
            "barcode": "171117540",
            "dpc": "03031226201",
            "name": "ថង  សៀង"
        },
        {
            "barcode": "171117541",
            "dpc": "03031226401",
            "name": "ចៅ  វៃឈូ"
        },
        {
            "barcode": "171117542",
            "dpc": "03031248001",
            "name": "រឿន ខុន"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
