let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171119985",
            "dpc": "03031305801",
            "name": "សាន សុផល"
        },
        {
            "barcode": "171119986",
            "dpc": "03031305901",
            "name": "សុខ រ៉ុង"
        },
        {
            "barcode": "171119987",
            "dpc": "03031306001",
            "name": "ឡាំ ធៀន ១"
        },
        {
            "barcode": "171119988",
            "dpc": "03031306101",
            "name": "ឡាំ ធៀន ២"
        },
        {
            "barcode": "171119989",
            "dpc": "03031306201",
            "name": "អៀង សុគន្ធ"
        },
        {
            "barcode": "171119990",
            "dpc": "03031306401",
            "name": "ម៉េង អ៊ីវ"
        },
        {
            "barcode": "171119991",
            "dpc": "03031306501",
            "name": "កុលាប កណិកា"
        },
        {
            "barcode": "171119992",
            "dpc": "03031306601",
            "name": "ហួត ទុយ"
        },
        {
            "barcode": "171119993",
            "dpc": "03031306701",
            "name": "គង់ ឌី"
        },
        {
            "barcode": "171119994",
            "dpc": "03031306801",
            "name": "សោម សារិទ្ធ"
        },
        {
            "barcode": "171119995",
            "dpc": "03031306901",
            "name": "ដាញ់ ធឹង"
        },
        {
            "barcode": "171119996",
            "dpc": "03031307001",
            "name": "សោម សុន"
        },
        {
            "barcode": "171119997",
            "dpc": "03031307101",
            "name": "អ៊ុក ម៉ៅ"
        },
        {
            "barcode": "171119998",
            "dpc": "03031307201",
            "name": "សិច ផល្លី"
        },
        {
            "barcode": "171119999",
            "dpc": "03031307301",
            "name": "គឹម រ៉ា"
        },
        {
            "barcode": "171120000",
            "dpc": "03031307401",
            "name": "ឈុន ហេង"
        },
        {
            "barcode": "171120001",
            "dpc": "03031307501",
            "name": "ហ៊ិន ចំរើន"
        },
        {
            "barcode": "171120002",
            "dpc": "03031307601",
            "name": "ងិន យីម"
        },
        {
            "barcode": "171120003",
            "dpc": "03031307701",
            "name": "យក់ អឿ"
        },
        {
            "barcode": "171120004",
            "dpc": "03031307801",
            "name": "អ៊ុច សុន"
        },
        {
            "barcode": "171120005",
            "dpc": "03031307901",
            "name": "ហ៊ាង ម៉េង"
        },
        {
            "barcode": "171120006",
            "dpc": "03031308001",
            "name": "សាន សុផល"
        },
        {
            "barcode": "171120007",
            "dpc": "03031308101",
            "name": "ចៅ កី"
        },
        {
            "barcode": "171120008",
            "dpc": "03031308201",
            "name": "សោ ភីនី"
        },
        {
            "barcode": "171120009",
            "dpc": "03031308301",
            "name": "ម៉េង វណ្ណារី"
        },
        {
            "barcode": "171120010",
            "dpc": "03031308401",
            "name": "ហេង ប៊ន"
        },
        {
            "barcode": "171120011",
            "dpc": "03031308501",
            "name": "តាំង ជុងខេង"
        },
        {
            "barcode": "171120012",
            "dpc": "03031308601",
            "name": "នង ស៊ុំ"
        },
        {
            "barcode": "171120013",
            "dpc": "03031308701",
            "name": "ធួន សាយ"
        },
        {
            "barcode": "171120014",
            "dpc": "03031308801",
            "name": "ណាំ ផេង"
        },
        {
            "barcode": "171120015",
            "dpc": "03031308901",
            "name": "លេង សាវុធ"
        },
        {
            "barcode": "171120016",
            "dpc": "03031309001",
            "name": "ឆាយ សារ៉េត"
        },
        {
            "barcode": "171120017",
            "dpc": "03031309101",
            "name": "ហុង ជ្រិន"
        },
        {
            "barcode": "171120018",
            "dpc": "03031309201",
            "name": "តែ ម៉ូវិធូន"
        },
        {
            "barcode": "171120019",
            "dpc": "03031309301",
            "name": "អៀង ហ៊ាង"
        },
        {
            "barcode": "171120020",
            "dpc": "03031309401",
            "name": "គឹម សឹង"
        },
        {
            "barcode": "171120021",
            "dpc": "03031309501",
            "name": "ជា សុផល"
        },
        {
            "barcode": "171120022",
            "dpc": "03031309601",
            "name": "ឈួន ហុង"
        },
        {
            "barcode": "171120023",
            "dpc": "03031309701",
            "name": "ជីវ ជា"
        },
        {
            "barcode": "171120024",
            "dpc": "03031309801",
            "name": "ហេង ជុង"
        },
        {
            "barcode": "171120025",
            "dpc": "03031309901",
            "name": "ឡៅ ឆាយទ្រី ១"
        },
        {
            "barcode": "171120026",
            "dpc": "03031310001",
            "name": "ឡៅ ឆាយទ្រី ២"
        },
        {
            "barcode": "171120027",
            "dpc": "03031310101",
            "name": "ចាន់ ទី"
        },
        {
            "barcode": "171120028",
            "dpc": "03031310201",
            "name": "ជី សារ៉េត"
        },
        {
            "barcode": "171120029",
            "dpc": "03031310301",
            "name": "វឹង ឡុង"
        },
        {
            "barcode": "171120030",
            "dpc": "03031310401",
            "name": "ម៉ុន មីកា"
        },
        {
            "barcode": "171120031",
            "dpc": "03031310501",
            "name": "ហួន ហ៊ន"
        },
        {
            "barcode": "171120032",
            "dpc": "03031310601",
            "name": "អ៊ឹង ងួន"
        },
        {
            "barcode": "171120033",
            "dpc": "03031310701",
            "name": "រី រឿន"
        },
        {
            "barcode": "171120034",
            "dpc": "03031310801",
            "name": "គង់ វុត្ថា"
        },
        {
            "barcode": "171120035",
            "dpc": "03031311001",
            "name": "ជាប លាង"
        },
        {
            "barcode": "171120036",
            "dpc": "03031311101",
            "name": "យូ គឹមជូ"
        },
        {
            "barcode": "171120037",
            "dpc": "03031311201",
            "name": "ចាន់ គឹមហ៊ាង"
        },
        {
            "barcode": "171120038",
            "dpc": "03031311301",
            "name": "យ៉ម ចំរើន"
        },
        {
            "barcode": "171120039",
            "dpc": "03031311401",
            "name": "ម៉ម ម៉ាច"
        },
        {
            "barcode": "171120040",
            "dpc": "03031311501",
            "name": "គឹម ឡេង"
        },
        {
            "barcode": "171120041",
            "dpc": "03031311601",
            "name": "ជា ពិសិដ្ឋ"
        },
        {
            "barcode": "171120042",
            "dpc": "03031311701",
            "name": "ម៉ង់ ស្វាយគីរី"
        },
        {
            "barcode": "171120043",
            "dpc": "03031311801",
            "name": "គី គឹមហឿង ១"
        },
        {
            "barcode": "171120044",
            "dpc": "03031311901",
            "name": "គី គឹមហឿង ២"
        },
        {
            "barcode": "171120045",
            "dpc": "03031300101",
            "name": "ភូ ស៊ន់"
        },
        {
            "barcode": "171120046",
            "dpc": "03031300201",
            "name": "ឡុង សុខា"
        },
        {
            "barcode": "171120047",
            "dpc": "03031300301",
            "name": "ស៊ឹម វណ្ណៈ"
        },
        {
            "barcode": "171120048",
            "dpc": "03031300501",
            "name": "ពៅ ជ្រុន"
        },
        {
            "barcode": "171120049",
            "dpc": "03031300601",
            "name": "ជា ផេង"
        },
        {
            "barcode": "171120050",
            "dpc": "03031300701",
            "name": "លី ឡាង"
        },
        {
            "barcode": "171120051",
            "dpc": "03031300801",
            "name": "នូ សុខុន"
        },
        {
            "barcode": "171120052",
            "dpc": "03031301201",
            "name": "នក់ ហ្វួយ"
        },
        {
            "barcode": "171120053",
            "dpc": "03031300901",
            "name": "នង ប៊ុនធឿន"
        },
        {
            "barcode": "171120054",
            "dpc": "03031301001",
            "name": "អ៊ូច សុផៃ"
        },
        {
            "barcode": "171120055",
            "dpc": "03031301101",
            "name": "សូ ប៉ូឃន"
        },
        {
            "barcode": "171120056",
            "dpc": "03031301401",
            "name": "កែវ កាមីន"
        },
        {
            "barcode": "171120057",
            "dpc": "03031301501",
            "name": "គី ងួន"
        },
        {
            "barcode": "171120058",
            "dpc": "03031301601",
            "name": "តែ ម៉េងសួរ"
        },
        {
            "barcode": "171120059",
            "dpc": "03031301701",
            "name": "ភូ ប៉ូយ"
        },
        {
            "barcode": "171120060",
            "dpc": "03031301801",
            "name": "តាន់ កុសល"
        },
        {
            "barcode": "171120061",
            "dpc": "03031301901",
            "name": "ហេង យ៉ាត"
        },
        {
            "barcode": "171120062",
            "dpc": "03031302001",
            "name": "តាំង លីងួន"
        },
        {
            "barcode": "171120063",
            "dpc": "03031302101",
            "name": "កែវ នីម"
        },
        {
            "barcode": "171120064",
            "dpc": "03031302201",
            "name": "ពេជ្រ អៀម"
        },
        {
            "barcode": "171120065",
            "dpc": "03031302301",
            "name": "យូ សាង"
        },
        {
            "barcode": "171120066",
            "dpc": "03031302401",
            "name": "លាវ សុខម៉េង"
        },
        {
            "barcode": "171120067",
            "dpc": "03031302501",
            "name": "ចៅ កាំឈិញ"
        },
        {
            "barcode": "171120068",
            "dpc": "03031302601",
            "name": "នី ចំរើន"
        },
        {
            "barcode": "171120069",
            "dpc": "03031302701",
            "name": "ហ៊ុន វិបុល"
        },
        {
            "barcode": "171120070",
            "dpc": "03031302801",
            "name": "ខៀវ ចៃ"
        },
        {
            "barcode": "171120071",
            "dpc": "03031302901",
            "name": "លី ម៉េង"
        },
        {
            "barcode": "171120072",
            "dpc": "03031303001",
            "name": "អោម ផេង"
        },
        {
            "barcode": "171120073",
            "dpc": "03031303101",
            "name": "លក់ គ្រី"
        },
        {
            "barcode": "171120074",
            "dpc": "03031303201",
            "name": "តាំង ឈុន"
        },
        {
            "barcode": "171120075",
            "dpc": "03031303301",
            "name": "ម៉ក់ ហុង"
        },
        {
            "barcode": "171120076",
            "dpc": "03031303401",
            "name": "សៅ សោន"
        },
        {
            "barcode": "171120077",
            "dpc": "03031303501",
            "name": "ព្រំ ឡាក់"
        },
        {
            "barcode": "171120078",
            "dpc": "03031303801",
            "name": "ឡុច តង"
        },
        {
            "barcode": "171120079",
            "dpc": "03031303901",
            "name": "គឹម វ៉ាន់"
        },
        {
            "barcode": "171120080",
            "dpc": "03031304001",
            "name": "ខ្ចៅ ទូច"
        },
        {
            "barcode": "171120081",
            "dpc": "03031304101",
            "name": "ជឹម ជឿន"
        },
        {
            "barcode": "171120082",
            "dpc": "03031304201",
            "name": "យ៉ាន់ សារឿន"
        },
        {
            "barcode": "171120083",
            "dpc": "03031304301",
            "name": "អ៊ឹម យិន"
        },
        {
            "barcode": "171120084",
            "dpc": "03031304401",
            "name": "ដួង លី"
        },
        {
            "barcode": "171120085",
            "dpc": "03031304501",
            "name": "ទីម យេត"
        },
        {
            "barcode": "171120086",
            "dpc": "03031304601",
            "name": "ឈឹម សួរ"
        },
        {
            "barcode": "171120087",
            "dpc": "03031304701",
            "name": "សេង សុន"
        },
        {
            "barcode": "171120088",
            "dpc": "03031304801",
            "name": "សាន់ ហាក់"
        },
        {
            "barcode": "171120089",
            "dpc": "03031304901",
            "name": "គង់ កុសល"
        },
        {
            "barcode": "171120090",
            "dpc": "03031305001",
            "name": "ពុន សែ"
        },
        {
            "barcode": "171120091",
            "dpc": "03031305201",
            "name": "សាន ផល្លីន"
        },
        {
            "barcode": "171120092",
            "dpc": "03031305301",
            "name": "គឹម អេង"
        },
        {
            "barcode": "171120093",
            "dpc": "03031305501",
            "name": "ឡុង ខេន"
        },
        {
            "barcode": "171120094",
            "dpc": "03031305601",
            "name": "សក់ ចន្ទ្រាវុធ"
        },
        {
            "barcode": "171120095",
            "dpc": "03031305701",
            "name": "តូច  សារិន"
        },
        {
            "barcode": "171120096",
            "dpc": "03031326201",
            "name": "ទេព  បេងសួរ"
        },
        {
            "barcode": "171120097",
            "dpc": "03031326001",
            "name": "ម៉េង  លាង"
        },
        {
            "barcode": "171120098",
            "dpc": "03031325901",
            "name": "អ៊ុយ  គង់"
        },
        {
            "barcode": "171120099",
            "dpc": "03031325701",
            "name": "យស់  បាន"
        },
        {
            "barcode": "171120100",
            "dpc": "03031325601",
            "name": "អ៊ុយ  ជុំ"
        },
        {
            "barcode": "171120101",
            "dpc": "03031325501",
            "name": "អ៊ឹម  កោវិត"
        },
        {
            "barcode": "171120102",
            "dpc": "03031325401",
            "name": "អួង  ខេង"
        },
        {
            "barcode": "171120103",
            "dpc": "03031325301",
            "name": "ហុក  ឈួន"
        },
        {
            "barcode": "171120104",
            "dpc": "03031325201",
            "name": "កែវ  ប៉ក់"
        },
        {
            "barcode": "171120105",
            "dpc": "03031325101",
            "name": "អេង  ង៉ោ"
        },
        {
            "barcode": "171120106",
            "dpc": "03031325001",
            "name": "នូ  ហានី"
        },
        {
            "barcode": "171120107",
            "dpc": "03031324901",
            "name": "ឆាយ  ទូច"
        },
        {
            "barcode": "171120108",
            "dpc": "03031324801",
            "name": "ឆា  ស៊ីសុវត្ថា"
        },
        {
            "barcode": "171120109",
            "dpc": "03031324701",
            "name": "ស៊ុន   ប៊ុនឡេង"
        },
        {
            "barcode": "171120110",
            "dpc": "03031324601",
            "name": "ឡោ  សារឹម"
        },
        {
            "barcode": "171120111",
            "dpc": "03031330901",
            "name": "សោ  គឹមកូយ"
        },
        {
            "barcode": "171120112",
            "dpc": "03031330801",
            "name": "ហ៊ុល  សុមុន្នី"
        },
        {
            "barcode": "171120113",
            "dpc": "03031330701",
            "name": "មាស  ប៊ុនថេន"
        },
        {
            "barcode": "171120114",
            "dpc": "03031330601",
            "name": "ហា  សេង"
        },
        {
            "barcode": "171120115",
            "dpc": "03031330401",
            "name": "លី  គឹមលាង"
        },
        {
            "barcode": "171120116",
            "dpc": "03031330301",
            "name": "ធម្ម  សុផា"
        },
        {
            "barcode": "171120117",
            "dpc": "03031330201",
            "name": "ឡុង  គឹមតេង"
        },
        {
            "barcode": "171120118",
            "dpc": "03031330101",
            "name": "ម៉ឺន  យ៉ាន"
        },
        {
            "barcode": "171120119",
            "dpc": "03031330001",
            "name": "ថោង  ប៊ុនធឿន"
        },
        {
            "barcode": "171120120",
            "dpc": "03031329901",
            "name": "ឌិត  យ៉ាន់"
        },
        {
            "barcode": "171120121",
            "dpc": "03031329801",
            "name": "អ៊ុង  នុត"
        },
        {
            "barcode": "171120122",
            "dpc": "03031329701",
            "name": "អ៊ឹម  នាង"
        },
        {
            "barcode": "171120123",
            "dpc": "03031329601",
            "name": "មាស  លី"
        },
        {
            "barcode": "171120124",
            "dpc": "03031329501",
            "name": "ទេព  ណាត្យ"
        },
        {
            "barcode": "171120125",
            "dpc": "03031329401",
            "name": "លឹម  គឹមភាព"
        },
        {
            "barcode": "171120126",
            "dpc": "03031329301",
            "name": "យូ  សាម៉េត ១"
        },
        {
            "barcode": "171120127",
            "dpc": "03031323901",
            "name": "ជា  ហេង"
        },
        {
            "barcode": "171120128",
            "dpc": "03031329001",
            "name": "តេង  ច័ន្ទថុល"
        },
        {
            "barcode": "171120129",
            "dpc": "03031326501",
            "name": "ព្រឹម  សាលី"
        },
        {
            "barcode": "171120130",
            "dpc": "03031346601",
            "name": "ពិន  ប៊ុនហ៊ត"
        },
        {
            "barcode": "171120131",
            "dpc": "03031346701",
            "name": "ឈាង  គី"
        },
        {
            "barcode": "171120132",
            "dpc": "03031346801",
            "name": "អួង   សន"
        },
        {
            "barcode": "171120133",
            "dpc": "03031346901",
            "name": "កែវ  មនោ"
        },
        {
            "barcode": "171120134",
            "dpc": "03031347001",
            "name": "តោ  ពិសិដ្ឋ"
        },
        {
            "barcode": "171120135",
            "dpc": "03031347101",
            "name": "កៅ  សុខន"
        },
        {
            "barcode": "171120136",
            "dpc": "03031347201",
            "name": "វិហារអ្នកតាចិន"
        },
        {
            "barcode": "171120137",
            "dpc": "03031347301",
            "name": "ម៉ៃ  ហ៊ាង"
        },
        {
            "barcode": "171120138",
            "dpc": "03031347401",
            "name": "យឹម  ហ៊ីង"
        },
        {
            "barcode": "171120139",
            "dpc": "03031347501",
            "name": "សុខ  គៀត"
        },
        {
            "barcode": "171120140",
            "dpc": "03031347601",
            "name": "ហ៊ីម  ស៊ីស"
        },
        {
            "barcode": "171120141",
            "dpc": "03031347701",
            "name": "ធឹក  សាធឿន"
        },
        {
            "barcode": "171120142",
            "dpc": "03031347801",
            "name": "ជូ  គឹមរិន"
        },
        {
            "barcode": "171120143",
            "dpc": "03031347901",
            "name": "ឈុន  ស្រេង"
        },
        {
            "barcode": "171120144",
            "dpc": "03031344101",
            "name": "ឈឿម  សុវណ្ណ"
        },
        {
            "barcode": "171120145",
            "dpc": "03031344301",
            "name": "អុំ   លឿម"
        },
        {
            "barcode": "171120146",
            "dpc": "03031344601",
            "name": "យឺន  ម៉ិ"
        },
        {
            "barcode": "171120147",
            "dpc": "03031344701",
            "name": "ម៉ៃ  ហ៊ាង"
        },
        {
            "barcode": "171120148",
            "dpc": "03031344801",
            "name": "តោ  ហួត"
        },
        {
            "barcode": "171120149",
            "dpc": "03031344901",
            "name": "អេង  ចាន់ម៉ាន់"
        },
        {
            "barcode": "171120150",
            "dpc": "03031345001",
            "name": "តោ  ភិសិដ្ឋ"
        },
        {
            "barcode": "171120151",
            "dpc": "03031345101",
            "name": "យូ  គង់"
        },
        {
            "barcode": "171120152",
            "dpc": "03031345301",
            "name": "អ៊ិត  តាន់"
        },
        {
            "barcode": "171120153",
            "dpc": "03031345401",
            "name": "សុខ  ជា"
        },
        {
            "barcode": "171120154",
            "dpc": "03031345501",
            "name": "ហ៊ឹម  សារ៉េត"
        },
        {
            "barcode": "171120155",
            "dpc": "03031345601",
            "name": "ស៊ុត  ថាយ"
        },
        {
            "barcode": "171120156",
            "dpc": "03031345801",
            "name": "នូ  នេតត្រា"
        },
        {
            "barcode": "171120157",
            "dpc": "03031345901",
            "name": "យី  សារ៉ូ"
        },
        {
            "barcode": "171120158",
            "dpc": "03031346001",
            "name": "ជូង  ពីង"
        },
        {
            "barcode": "171120159",
            "dpc": "03031346101",
            "name": "ចាន់  បឿម"
        },
        {
            "barcode": "171120160",
            "dpc": "03031346201",
            "name": "ម៉េង  លាង"
        },
        {
            "barcode": "171120161",
            "dpc": "03031346301",
            "name": "សុខ  អេង"
        },
        {
            "barcode": "171120162",
            "dpc": "03031346401",
            "name": "ពន់  ឃីម"
        },
        {
            "barcode": "171120163",
            "dpc": "03031346501",
            "name": "កែវ  វីរៈ"
        },
        {
            "barcode": "171120164",
            "dpc": "03031326701",
            "name": "សុច  សារុំ"
        },
        {
            "barcode": "171120165",
            "dpc": "03031326801",
            "name": "អួង  ខេង"
        },
        {
            "barcode": "171120166",
            "dpc": "03031326901",
            "name": "សោម  សាឃឿង"
        },
        {
            "barcode": "171120167",
            "dpc": "03031327001",
            "name": "លេង  ហួរ"
        },
        {
            "barcode": "171120168",
            "dpc": "03031327101",
            "name": "មាស  សុវណ្ណ"
        },
        {
            "barcode": "171120169",
            "dpc": "03031327201",
            "name": "សុខ ធី"
        },
        {
            "barcode": "171120170",
            "dpc": "03031327301",
            "name": "សុខ  ធា"
        },
        {
            "barcode": "171120171",
            "dpc": "03031327401",
            "name": "សឹង  ជឺ"
        },
        {
            "barcode": "171120172",
            "dpc": "03031327501",
            "name": "ហេង  លាង"
        },
        {
            "barcode": "171120173",
            "dpc": "03031327601",
            "name": "ព្រឹម   សាលី"
        },
        {
            "barcode": "171120174",
            "dpc": "03031327701",
            "name": "ម៉េង  វុទ្ធា"
        },
        {
            "barcode": "171120175",
            "dpc": "03031328001",
            "name": "ជុក  គឹមហាប់"
        },
        {
            "barcode": "171120176",
            "dpc": "03031328101",
            "name": "ឈឺន  លឿប"
        },
        {
            "barcode": "171120177",
            "dpc": "03031328301",
            "name": "សេង  ផូ"
        },
        {
            "barcode": "171120178",
            "dpc": "03031328401",
            "name": "អួល  រ័ត្ន"
        },
        {
            "barcode": "171120179",
            "dpc": "03031328501",
            "name": "សាត  សុធាន"
        },
        {
            "barcode": "171120180",
            "dpc": "03031328601",
            "name": "ចាន់  ថា"
        },
        {
            "barcode": "171120181",
            "dpc": "03031328701",
            "name": "ស៊ឹម  វ៉ាត់"
        },
        {
            "barcode": "171120182",
            "dpc": "03031328801",
            "name": "ដួង  កក់"
        },
        {
            "barcode": "171120183",
            "dpc": "03031328901",
            "name": "វណ្ណ  សុមាលី"
        },
        {
            "barcode": "171120184",
            "dpc": "03031312701",
            "name": "ណៃ  ស៊្រុន"
        },
        {
            "barcode": "171120185",
            "dpc": "03031312801",
            "name": "ហេង  សុខា"
        },
        {
            "barcode": "171120186",
            "dpc": "03031312901",
            "name": "ហេង  លីម"
        },
        {
            "barcode": "171120187",
            "dpc": "03031313001",
            "name": "អឿន  សំអាត"
        },
        {
            "barcode": "171120188",
            "dpc": "03031313101",
            "name": "សៅ  ទី"
        },
        {
            "barcode": "171120189",
            "dpc": "03031313201",
            "name": "ស្វាយ សុឃីម"
        },
        {
            "barcode": "171120190",
            "dpc": "03031313301",
            "name": "តាន់  តេង"
        },
        {
            "barcode": "171120191",
            "dpc": "03031313401",
            "name": "ជូ  គង់"
        },
        {
            "barcode": "171120192",
            "dpc": "03031313501",
            "name": "ឈួន  សារ៉ាត់"
        },
        {
            "barcode": "171120193",
            "dpc": "03031313601",
            "name": "អ៊ី  ចាន់នឿន"
        },
        {
            "barcode": "171120194",
            "dpc": "03031313701",
            "name": "អ៊ុយ  គង់"
        },
        {
            "barcode": "171120195",
            "dpc": "03031313801",
            "name": "សេង  ហ៊ួរ ២"
        },
        {
            "barcode": "171120196",
            "dpc": "03031313901",
            "name": "កែវ  សុខជា"
        },
        {
            "barcode": "171120197",
            "dpc": "03031314001",
            "name": "ប៊ី សួ"
        },
        {
            "barcode": "171120198",
            "dpc": "03031314201",
            "name": "សេង  ហួរ"
        },
        {
            "barcode": "171120199",
            "dpc": "03031314301",
            "name": "គឹម  សារឿន"
        },
        {
            "barcode": "171120200",
            "dpc": "03031314401",
            "name": "អឿ  សៀង"
        },
        {
            "barcode": "171120201",
            "dpc": "03031314501",
            "name": "គា  ហេង"
        },
        {
            "barcode": "171120202",
            "dpc": "03031314601",
            "name": "ប៉ោ  ស៊ីណា"
        },
        {
            "barcode": "171120203",
            "dpc": "03031314701",
            "name": "ង៉ែត  គី"
        },
        {
            "barcode": "171120204",
            "dpc": "03031314901",
            "name": "លឹម  ដារ៉ា"
        },
        {
            "barcode": "171120205",
            "dpc": "03031315001",
            "name": "មុំ   ហ៊ាង"
        },
        {
            "barcode": "171120206",
            "dpc": "03031315101",
            "name": "ទី  សាន"
        },
        {
            "barcode": "171120207",
            "dpc": "03031315201",
            "name": "ប៉ុញ  ឧត្តម"
        },
        {
            "barcode": "171120208",
            "dpc": "03031315301",
            "name": "ភួយ  លាងចេង"
        },
        {
            "barcode": "171120209",
            "dpc": "03031315401",
            "name": "គុជ  ជរ"
        },
        {
            "barcode": "171120210",
            "dpc": "03031315501",
            "name": "ឈឹម  សុវណ្ណ"
        },
        {
            "barcode": "171120211",
            "dpc": "03031315601",
            "name": "ភឿក  រ៉ានី"
        },
        {
            "barcode": "171120212",
            "dpc": "03031315701",
            "name": "ឈួន  សុផល"
        },
        {
            "barcode": "171120213",
            "dpc": "03031315801",
            "name": "សុខ  ពុធ"
        },
        {
            "barcode": "171120214",
            "dpc": "03031315901",
            "name": "អៀង  ស៊ីណា"
        },
        {
            "barcode": "171120215",
            "dpc": "03031316001",
            "name": "អៀង  សុភាព"
        },
        {
            "barcode": "171120216",
            "dpc": "03031316101",
            "name": "ឆាយ  រ៉ង"
        },
        {
            "barcode": "171120217",
            "dpc": "03031316201",
            "name": "ណាម  កេតរ៉ា"
        },
        {
            "barcode": "171120218",
            "dpc": "03031316301",
            "name": "ថុត  ប៊ុនឈិន"
        },
        {
            "barcode": "171120219",
            "dpc": "03031316401",
            "name": "លឹម  ចាន់ថន"
        },
        {
            "barcode": "171120220",
            "dpc": "03031316501",
            "name": "ហឿង  ឈុន"
        },
        {
            "barcode": "171120221",
            "dpc": "03031316601",
            "name": "ភួង  ចំរើន"
        },
        {
            "barcode": "171120222",
            "dpc": "03031316701",
            "name": "ងួន  ឆាយ"
        },
        {
            "barcode": "171120223",
            "dpc": "03031316801",
            "name": "កៅ  ហួរ"
        },
        {
            "barcode": "171120224",
            "dpc": "03031316901",
            "name": "អ៊ុយ  លីវ"
        },
        {
            "barcode": "171120225",
            "dpc": "03031317001",
            "name": "ជូ  ចំរើន"
        },
        {
            "barcode": "171120226",
            "dpc": "03031317101",
            "name": "ប៊ូ  កិត្យា"
        },
        {
            "barcode": "171120227",
            "dpc": "03031317201",
            "name": "យូ  ទីនី"
        },
        {
            "barcode": "171120228",
            "dpc": "03031317301",
            "name": "ញឹម  ម៉ែន"
        },
        {
            "barcode": "171120229",
            "dpc": "03031317401",
            "name": "ឆូយ  សុគន្ធ"
        },
        {
            "barcode": "171120230",
            "dpc": "03031317501",
            "name": "ង៉ា  ឃីម"
        },
        {
            "barcode": "171120231",
            "dpc": "03031317601",
            "name": "អួង  ម៉ានី ១"
        },
        {
            "barcode": "171120232",
            "dpc": "03031317701",
            "name": "សេង  រតនៈ"
        },
        {
            "barcode": "171120233",
            "dpc": "03031317801",
            "name": "សែម សុខា"
        },
        {
            "barcode": "171120234",
            "dpc": "03031317901",
            "name": "ម៉ៅ  រ័ត្នមុនី"
        },
        {
            "barcode": "171120235",
            "dpc": "03031318001",
            "name": "លាស់   ថេត"
        },
        {
            "barcode": "171120236",
            "dpc": "03031318101",
            "name": "ចាន់  ដាវឹង"
        },
        {
            "barcode": "171120237",
            "dpc": "03031318201",
            "name": "ផាត់  សុខលាង ១"
        },
        {
            "barcode": "171120238",
            "dpc": "03031318301",
            "name": "ផាត់  សុខលាង​​ ២"
        },
        {
            "barcode": "171120239",
            "dpc": "03031318501",
            "name": "ហឿង  ណៃឈុន"
        },
        {
            "barcode": "171120240",
            "dpc": "03031318601",
            "name": "អឿ  គឹមហឿង"
        },
        {
            "barcode": "171120241",
            "dpc": "03031318701",
            "name": "យឹម  សំបូ"
        },
        {
            "barcode": "171120242",
            "dpc": "03031318901",
            "name": "រស់  សុផាត"
        },
        {
            "barcode": "171120243",
            "dpc": "03031319001",
            "name": "ហេង  លីម"
        },
        {
            "barcode": "171120244",
            "dpc": "03031312401",
            "name": "ឌួង  គឹមស៊ន"
        },
        {
            "barcode": "171120245",
            "dpc": "03031322801",
            "name": "អ៊ឹម  ឈួម"
        },
        {
            "barcode": "171120246",
            "dpc": "03031322701",
            "name": "ស  ស៊ីវន"
        },
        {
            "barcode": "171120247",
            "dpc": "03031322601",
            "name": "បួន  គឹមហាវ"
        },
        {
            "barcode": "171120248",
            "dpc": "03031322501",
            "name": "ជួន  ប៊ុនធុល"
        },
        {
            "barcode": "171120249",
            "dpc": "03031322401",
            "name": "គង់  សារិន"
        },
        {
            "barcode": "171120250",
            "dpc": "03031322301",
            "name": "លី  ជា"
        },
        {
            "barcode": "171120251",
            "dpc": "03031322101",
            "name": "បែន  ផន"
        },
        {
            "barcode": "171120252",
            "dpc": "03031322001",
            "name": "ឃឹម  សាមិត"
        },
        {
            "barcode": "171120253",
            "dpc": "03031321901",
            "name": "តន់  ប៊ុនរឿន"
        },
        {
            "barcode": "171120254",
            "dpc": "03031321801",
            "name": "នួន  តុន"
        },
        {
            "barcode": "171120255",
            "dpc": "03031321701",
            "name": "តាន់  អ៊ីវន"
        },
        {
            "barcode": "171120256",
            "dpc": "03031321601",
            "name": "លឹម  ឡាយ"
        },
        {
            "barcode": "171120257",
            "dpc": "03031321501",
            "name": "អ៊ូច  សុផៃ"
        },
        {
            "barcode": "171120258",
            "dpc": "03031321401",
            "name": "កៅ  អេង"
        },
        {
            "barcode": "171120259",
            "dpc": "03031321301",
            "name": "ហាក់  សោភ័ណ"
        },
        {
            "barcode": "171120260",
            "dpc": "03031321201",
            "name": "គង់  ឡេង"
        },
        {
            "barcode": "171120261",
            "dpc": "03031321101",
            "name": "លឹម  គឹមស៊ា"
        },
        {
            "barcode": "171120262",
            "dpc": "03031321001",
            "name": "វឿត  សុវណ្ណ"
        },
        {
            "barcode": "171120263",
            "dpc": "03031320901",
            "name": "អោម  សាវេត"
        },
        {
            "barcode": "171120264",
            "dpc": "03031320801",
            "name": "ប៉ាវ  ឈុនលីម"
        },
        {
            "barcode": "171120265",
            "dpc": "03031320601",
            "name": "ឡុង  គឹមឆេង"
        },
        {
            "barcode": "171120266",
            "dpc": "03031320401",
            "name": "លី  សោភ័ណ"
        },
        {
            "barcode": "171120267",
            "dpc": "03031320301",
            "name": "សៅ  ដារ៉ានិមិត្ត"
        },
        {
            "barcode": "171120268",
            "dpc": "03031320201",
            "name": "ឡៅ  ជាងគី"
        },
        {
            "barcode": "171120269",
            "dpc": "03031320101",
            "name": "សក់  មី"
        },
        {
            "barcode": "171120270",
            "dpc": "03031320001",
            "name": "ពិន  កុសល"
        },
        {
            "barcode": "171120271",
            "dpc": "03031319901",
            "name": "ដុះ  វណ្ណរស្មី"
        },
        {
            "barcode": "171120272",
            "dpc": "03031319801",
            "name": "នូ  សុខុម"
        },
        {
            "barcode": "171120273",
            "dpc": "03031319701",
            "name": "ប៉ែន  ហុងហា"
        },
        {
            "barcode": "171120274",
            "dpc": "03031324401",
            "name": "យ៉ាន  បូផៃ"
        },
        {
            "barcode": "171120275",
            "dpc": "03031324301",
            "name": "ពិន  សំផុន"
        },
        {
            "barcode": "171120276",
            "dpc": "03031324201",
            "name": "មាស  សាន"
        },
        {
            "barcode": "171120277",
            "dpc": "03031324101",
            "name": "ប៊ុត  គឹមស៊ាន"
        },
        {
            "barcode": "171120278",
            "dpc": "03031324001",
            "name": "ឡុង  សេង"
        },
        {
            "barcode": "171120279",
            "dpc": "03031323801",
            "name": "ចាន់  សេរីឆុង"
        },
        {
            "barcode": "171120280",
            "dpc": "03031323701",
            "name": "ហែម   គឹមហូ"
        },
        {
            "barcode": "171120281",
            "dpc": "03031323601",
            "name": "ជេ  រៀន"
        },
        {
            "barcode": "171120282",
            "dpc": "03031323501",
            "name": "ប៉េង  សុខឃីម"
        },
        {
            "barcode": "171120283",
            "dpc": "03031323401",
            "name": "ផូង  ឌិញ"
        },
        {
            "barcode": "171120284",
            "dpc": "03031323301",
            "name": "សោម   សំអុន"
        },
        {
            "barcode": "171120285",
            "dpc": "03031323201",
            "name": "អ៊ឹង  ឡា"
        },
        {
            "barcode": "171120286",
            "dpc": "03031323101",
            "name": "ទេន   ភឹម"
        },
        {
            "barcode": "171120287",
            "dpc": "03031323001",
            "name": "ស  ណារ៉យ"
        },
        {
            "barcode": "171120288",
            "dpc": "03031322901",
            "name": "ស្រី  អឿន"
        },
        {
            "barcode": "171120289",
            "dpc": "03031331601",
            "name": "ទៀង  ចិន្តា"
        },
        {
            "barcode": "171120290",
            "dpc": "03031331801",
            "name": "ទេព  គឹមហេង"
        },
        {
            "barcode": "171120291",
            "dpc": "03031331901",
            "name": "ទុយ  វុត្ថា"
        },
        {
            "barcode": "171120292",
            "dpc": "03031332001",
            "name": "សុខ  ស៊ីវ"
        },
        {
            "barcode": "171120293",
            "dpc": "03031332101",
            "name": "មាស  ប៊ុនធឿន"
        },
        {
            "barcode": "171120294",
            "dpc": "03031332201",
            "name": "សេក  សំបូរ"
        },
        {
            "barcode": "171120295",
            "dpc": "03031332301",
            "name": "ប៉ាន់  សៀក"
        },
        {
            "barcode": "171120296",
            "dpc": "03031332401",
            "name": "យូ  ណារ៉ុង"
        },
        {
            "barcode": "171120297",
            "dpc": "03031332501",
            "name": "អ៊ុក  ចាយ"
        },
        {
            "barcode": "171120298",
            "dpc": "03031332601",
            "name": "ពុត  ជួប"
        },
        {
            "barcode": "171120299",
            "dpc": "03031332801",
            "name": "នី  សុភាព"
        },
        {
            "barcode": "171120300",
            "dpc": "03031332901",
            "name": "អៀង  ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171120301",
            "dpc": "03031333001",
            "name": "អ៊ិត ផល្លា"
        },
        {
            "barcode": "171120302",
            "dpc": "03031333101",
            "name": "ប៉ា    ហាក់"
        },
        {
            "barcode": "171120303",
            "dpc": "03031333201",
            "name": "នុយ  ចំរ៉ុង"
        },
        {
            "barcode": "171120304",
            "dpc": "03031333401",
            "name": "ចៅ  គឹមយ៉ាត"
        },
        {
            "barcode": "171120305",
            "dpc": "03031333501",
            "name": "សោ  គឹមហៀក"
        },
        {
            "barcode": "171120306",
            "dpc": "03031333601",
            "name": "ប្លុង  សាវឿន"
        },
        {
            "barcode": "171120307",
            "dpc": "03031333701",
            "name": "ជីវ  យ៉ា"
        },
        {
            "barcode": "171120308",
            "dpc": "03031333801",
            "name": "ភោគ  កិច្ច"
        },
        {
            "barcode": "171120309",
            "dpc": "03031333901",
            "name": "រុណ  រាសី"
        },
        {
            "barcode": "171120310",
            "dpc": "03031334001",
            "name": "ម៉ង់  សំអាល់"
        },
        {
            "barcode": "171120311",
            "dpc": "03031334101",
            "name": "រឿង  ណារ៉ុង"
        },
        {
            "barcode": "171120312",
            "dpc": "03031334201",
            "name": "សោ ថងឌី"
        },
        {
            "barcode": "171120313",
            "dpc": "03031334301",
            "name": "សុខ  សេង"
        },
        {
            "barcode": "171120314",
            "dpc": "03031334401",
            "name": "ស៊ិន  នឿប"
        },
        {
            "barcode": "171120315",
            "dpc": "03031334501",
            "name": "តាំង  លីហ៊ុន"
        },
        {
            "barcode": "171120316",
            "dpc": "03031334601",
            "name": "យ៉ែម  សាវឿត"
        },
        {
            "barcode": "171120317",
            "dpc": "03031331101",
            "name": "ម៉ា  គឹមជន"
        },
        {
            "barcode": "171120318",
            "dpc": "03031331001",
            "name": "យ៉ែម  សាវឿត"
        },
        {
            "barcode": "171120319",
            "dpc": "03031331501",
            "name": "ក្លិន  ឌី"
        },
        {
            "barcode": "171120320",
            "dpc": "03031331401",
            "name": "ថុង  មួយហុង"
        },
        {
            "barcode": "171120321",
            "dpc": "03031331301",
            "name": "សុខ  គឹមហាន"
        },
        {
            "barcode": "171120322",
            "dpc": "03031331201",
            "name": "ឡូ  ប៊ុនប៉ា"
        },
        {
            "barcode": "171120323",
            "dpc": "03031343801",
            "name": "ទុង  ភីរម្យ"
        },
        {
            "barcode": "171120324",
            "dpc": "03031343901",
            "name": "ឌុក  ឆាយ"
        },
        {
            "barcode": "171120325",
            "dpc": "03031344001",
            "name": "នង  គឹមស៊្រុន"
        },
        {
            "barcode": "171120326",
            "dpc": "03031343701",
            "name": "ទេព  សុវណ្ណ"
        },
        {
            "barcode": "171120327",
            "dpc": "03031343601",
            "name": "ប៊ូ   វុនណាវុឌ្ឍ"
        },
        {
            "barcode": "171120328",
            "dpc": "03031343501",
            "name": "ឌួង  ភក្តី"
        },
        {
            "barcode": "171120329",
            "dpc": "03031343401",
            "name": "ញាន   ផន"
        },
        {
            "barcode": "171120330",
            "dpc": "03031343301",
            "name": "យ៉ាន់  បូផៃ"
        },
        {
            "barcode": "171120331",
            "dpc": "03031343101",
            "name": "ម៉ម  ថងឌី"
        },
        {
            "barcode": "171120332",
            "dpc": "03031342801",
            "name": "សុន  សុគន្ធវ៉ារី"
        },
        {
            "barcode": "171120333",
            "dpc": "03031342701",
            "name": "ទេព  គឹមហេង"
        },
        {
            "barcode": "171120334",
            "dpc": "03031342601",
            "name": "ឌុច   ចំរ៉ាត់"
        },
        {
            "barcode": "171120335",
            "dpc": "03031342501",
            "name": "ឈឹម  ឆន"
        },
        {
            "barcode": "171120336",
            "dpc": "03031342401",
            "name": "ឈុន  ឡាយ"
        },
        {
            "barcode": "171120337",
            "dpc": "03031342301",
            "name": "សេង  ម៉េង"
        },
        {
            "barcode": "171120338",
            "dpc": "03031342201",
            "name": "ទុយ   នៅ"
        },
        {
            "barcode": "171120339",
            "dpc": "03031342101",
            "name": "មាស   ម៉ៅ"
        },
        {
            "barcode": "171120340",
            "dpc": "03031339301",
            "name": "លុម សួន"
        },
        {
            "barcode": "171120341",
            "dpc": "03031339201",
            "name": "ឡឹក ហាយ"
        },
        {
            "barcode": "171120342",
            "dpc": "03031340001",
            "name": "នង មាសរិទ្ធ"
        },
        {
            "barcode": "171120343",
            "dpc": "03031341301",
            "name": "ប៉ុក សាហ៊ុំ"
        },
        {
            "barcode": "171120344",
            "dpc": "03031341201",
            "name": "សេង ចន្ថា"
        },
        {
            "barcode": "171120345",
            "dpc": "03031341101",
            "name": "សៅ សារុន"
        },
        {
            "barcode": "171120346",
            "dpc": "03031341001",
            "name": "អ៊ិន សុខា"
        },
        {
            "barcode": "171120347",
            "dpc": "03031340901",
            "name": "ហែម សែម"
        },
        {
            "barcode": "171120348",
            "dpc": "03031340801",
            "name": "រ័ត្ន សូរិយា"
        },
        {
            "barcode": "171120349",
            "dpc": "03031340701",
            "name": "ឡៅ ប៉ានហាង"
        },
        {
            "barcode": "171120350",
            "dpc": "03031340601",
            "name": "ង៉ា ជួង"
        },
        {
            "barcode": "171120351",
            "dpc": "03031340501",
            "name": "ភឿក គឹមលី"
        },
        {
            "barcode": "171120352",
            "dpc": "03031340401",
            "name": "យាំ យ៉ាន់"
        },
        {
            "barcode": "171120353",
            "dpc": "03031340301",
            "name": "ភឹម ផល្លា"
        },
        {
            "barcode": "171120354",
            "dpc": "03031340201",
            "name": "អាន សេរីវុធ"
        },
        {
            "barcode": "171120355",
            "dpc": "03031340101",
            "name": "ប៉ុក ច័ន្ទបូរី"
        },
        {
            "barcode": "171120356",
            "dpc": "03031339901",
            "name": "សួស សាវុន"
        },
        {
            "barcode": "171120357",
            "dpc": "03031339401",
            "name": "ពៅ សារឿន"
        },
        {
            "barcode": "171120358",
            "dpc": "03031339501",
            "name": "វ៉ឹក រ៉ាន់"
        },
        {
            "barcode": "171120359",
            "dpc": "03031339601",
            "name": "តាន់ តូរ៉េ"
        },
        {
            "barcode": "171120360",
            "dpc": "03031339101",
            "name": "ញ៉ែម សានិត"
        },
        {
            "barcode": "171120361",
            "dpc": "03031338901",
            "name": "ហុក ហ៊ាត"
        },
        {
            "barcode": "171120362",
            "dpc": "03031339001",
            "name": "សូ ផេងគុណ"
        },
        {
            "barcode": "171120363",
            "dpc": "03031338801",
            "name": "ជា ហុង"
        },
        {
            "barcode": "171120364",
            "dpc": "03031338701",
            "name": "ផាន់ យី"
        },
        {
            "barcode": "171120365",
            "dpc": "03031338601",
            "name": "សាន សុផល"
        },
        {
            "barcode": "171120366",
            "dpc": "03031338501",
            "name": "យិន នូ"
        },
        {
            "barcode": "171120367",
            "dpc": "03031338401",
            "name": "ចៅ​ ចាន់"
        },
        {
            "barcode": "171120368",
            "dpc": "03031338201",
            "name": "ឃួន កុមារី"
        },
        {
            "barcode": "171120369",
            "dpc": "03031338001",
            "name": "វង្ស វីរៈ"
        },
        {
            "barcode": "171120370",
            "dpc": "03031337801",
            "name": "ពួន ភិរម្យ"
        },
        {
            "barcode": "171120371",
            "dpc": "03031337601",
            "name": "សុខ ឈឿន"
        },
        {
            "barcode": "171120372",
            "dpc": "03031337501",
            "name": "ធូ សុគុន"
        },
        {
            "barcode": "171120373",
            "dpc": "03031337401",
            "name": "ហួយ សុង ហេង"
        },
        {
            "barcode": "171120374",
            "dpc": "03031337201",
            "name": "មៀច សំបូរ"
        },
        {
            "barcode": "171120375",
            "dpc": "03031337101",
            "name": "អ៊ុក សំអាន"
        },
        {
            "barcode": "171120376",
            "dpc": "03031337001",
            "name": "សន វិចិតសេរី"
        },
        {
            "barcode": "171120377",
            "dpc": "03031336901",
            "name": "ជេត សំណាង"
        },
        {
            "barcode": "171120378",
            "dpc": "03031336801",
            "name": "ទូច រិទ្ធី"
        },
        {
            "barcode": "171120379",
            "dpc": "03031336701",
            "name": "កែវ សំអាត"
        },
        {
            "barcode": "171120380",
            "dpc": "03031336601",
            "name": "ញ៉ែម វណ្ណា"
        },
        {
            "barcode": "171120381",
            "dpc": "03031336501",
            "name": "គង់ វីរៈ"
        },
        {
            "barcode": "171120382",
            "dpc": "03031336401",
            "name": "កាន់ ណារិន"
        },
        {
            "barcode": "171120383",
            "dpc": "03031336301",
            "name": "កែវ សំអាង"
        },
        {
            "barcode": "171120384",
            "dpc": "03031336201",
            "name": "លី ជា"
        },
        {
            "barcode": "171120385",
            "dpc": "03031336101",
            "name": "គង់ ឆោម"
        },
        {
            "barcode": "171120386",
            "dpc": "03031336001",
            "name": "ភុំ ឆេន"
        },
        {
            "barcode": "171120387",
            "dpc": "03031335901",
            "name": "ប្រាក់ សុខែម"
        },
        {
            "barcode": "171120388",
            "dpc": "03031335801",
            "name": "ជុំ ចៅស៊ីវ៉ាន់"
        },
        {
            "barcode": "171120389",
            "dpc": "03031335701",
            "name": "ហុក សារ៉េត"
        },
        {
            "barcode": "171120390",
            "dpc": "03031335601",
            "name": "ព្រឹម សាលី"
        },
        {
            "barcode": "171120391",
            "dpc": "03031335501",
            "name": "ចុង ស៊ីន"
        },
        {
            "barcode": "171120392",
            "dpc": "03031335301",
            "name": "ស៊ិន សិត"
        },
        {
            "barcode": "171120393",
            "dpc": "03031335201",
            "name": "ជា ប៉"
        },
        {
            "barcode": "171120394",
            "dpc": "03031335101",
            "name": "ចែម សែត"
        },
        {
            "barcode": "171120395",
            "dpc": "03031335001",
            "name": "ហង់ផាន់ស៊ី"
        },
        {
            "barcode": "171120396",
            "dpc": "03031334901",
            "name": "ឈុន លីម"
        },
        {
            "barcode": "171120397",
            "dpc": "03031334801",
            "name": "គង់ ណាំ(លក់បាយ)"
        },
        {
            "barcode": "171120398",
            "dpc": "03031334701",
            "name": "លឹម ឡាយ(លក់បាយ)"
        },
        {
            "barcode": "171120399",
            "dpc": "03031312001",
            "name": "រស់  ហឿន"
        },
        {
            "barcode": "171120400",
            "dpc": "03031312201",
            "name": "ញឹម  ញ៉ាន"
        },
        {
            "barcode": "171120401",
            "dpc": "03031319101",
            "name": "ម៉ោង  សំបូ"
        },
        {
            "barcode": "171120402",
            "dpc": "03031319201",
            "name": "បែន សំបូរ"
        },
        {
            "barcode": "171120403",
            "dpc": "03031319301",
            "name": "កៅ  គង់"
        },
        {
            "barcode": "171120404",
            "dpc": "03031319401",
            "name": "ត្រឹង  ច័ន្ទបូរី"
        },
        {
            "barcode": "171120405",
            "dpc": "03031319501",
            "name": "សឿន  ប៊ុនឡេង"
        },
        {
            "barcode": "171120406",
            "dpc": "03031319601",
            "name": "សុខ  សាលីន"
        },
        {
            "barcode": "171120407",
            "dpc": "03031329101",
            "name": "ឈៀង  ថុល"
        },
        {
            "barcode": "171120408",
            "dpc": "03031337301",
            "name": "តោ  ពិសិដ្ឋ"
        },
        {
            "barcode": "171120409",
            "dpc": "03031339701",
            "name": "អាង  ឈួង (បេឡាសំចៃ )"
        },
        {
            "barcode": "171120410",
            "dpc": "03031341401",
            "name": "សោម  សាឃីម"
        },
        {
            "barcode": "171120411",
            "dpc": "03031341701",
            "name": "ម៉ៅ   ស៊ីថា"
        },
        {
            "barcode": "171120412",
            "dpc": "03031341801",
            "name": "លឹម  អូវ"
        },
        {
            "barcode": "171120413",
            "dpc": "03031341901",
            "name": "ម៉ៅ  មឿង"
        },
        {
            "barcode": "171120414",
            "dpc": "03031342001",
            "name": "ជេដ្ឋា   សោភ័ណ្ណរ៉ា"
        },
        {
            "barcode": "171120415",
            "dpc": "03031348001",
            "name": "គ្រុយ វាសនា"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
