let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171120845",
            "dpc": "03031400101",
            "name": "អៀ ស្រ៊ុន ១"
        },
        {
            "barcode": "171120846",
            "dpc": "03031400201",
            "name": "អៀ ស្រ៊ុន ២"
        },
        {
            "barcode": "171120847",
            "dpc": "03031400301",
            "name": "ជា ប៊ុនរ័ត្ន"
        },
        {
            "barcode": "171120848",
            "dpc": "03031400401",
            "name": "ពិន ទី"
        },
        {
            "barcode": "171120849",
            "dpc": "03031400501",
            "name": "អូ អិមស៊ី ១"
        },
        {
            "barcode": "171120850",
            "dpc": "03031400601",
            "name": "អូ អិមស៊ី ២"
        },
        {
            "barcode": "171120851",
            "dpc": "03031400701",
            "name": "ម៉ៅ សុខលី ១"
        },
        {
            "barcode": "171120852",
            "dpc": "03031400801",
            "name": "វៀង  សុម៉ាន់ ១"
        },
        {
            "barcode": "171120853",
            "dpc": "03031400901",
            "name": "វៀង  សុម៉ាន់២"
        },
        {
            "barcode": "171120854",
            "dpc": "03031401001",
            "name": "រ៉េន រស់"
        },
        {
            "barcode": "171120855",
            "dpc": "03031401301",
            "name": "គឹម វ៉ាន់"
        },
        {
            "barcode": "171120856",
            "dpc": "03031401201",
            "name": "ម៉ៅ សុខលី ២"
        },
        {
            "barcode": "171120857",
            "dpc": "03031401101",
            "name": "សៀង ណាវី ១"
        },
        {
            "barcode": "171120858",
            "dpc": "03031401401",
            "name": "ឃុន ម៉េង"
        },
        {
            "barcode": "171120859",
            "dpc": "03031401501",
            "name": "សុខ ឃីម"
        },
        {
            "barcode": "171120860",
            "dpc": "03031401601",
            "name": "តាំង ប៊ុនអៀង"
        },
        {
            "barcode": "171120861",
            "dpc": "03031401701",
            "name": "ឡុង ខួយ"
        },
        {
            "barcode": "171120862",
            "dpc": "03031401801",
            "name": "តេង  ឈៀង"
        },
        {
            "barcode": "171120863",
            "dpc": "03031401901",
            "name": "អ៊ឹង វែង"
        },
        {
            "barcode": "171120864",
            "dpc": "03031402001",
            "name": "វ៉ា សុកអែល"
        },
        {
            "barcode": "171120865",
            "dpc": "03031402101",
            "name": "សំ ប៊ុនហ៊ិន"
        },
        {
            "barcode": "171120866",
            "dpc": "03031402201",
            "name": "គឹម ហាំង ២"
        },
        {
            "barcode": "171120867",
            "dpc": "03031402301",
            "name": "សឿម វណ្ណា"
        },
        {
            "barcode": "171120868",
            "dpc": "03031402401",
            "name": "យូ ចាន់ទី"
        },
        {
            "barcode": "171120869",
            "dpc": "03031402501",
            "name": "លី ហុង"
        },
        {
            "barcode": "171120870",
            "dpc": "03031402701",
            "name": "តាំង ឈុន"
        },
        {
            "barcode": "171120871",
            "dpc": "03031402801",
            "name": "ធី អ៊ីម"
        },
        {
            "barcode": "171120872",
            "dpc": "03031402901",
            "name": "គឹម  ជីវ"
        },
        {
            "barcode": "171120873",
            "dpc": "03031403001",
            "name": "តាំង ផេងហ៊ី"
        },
        {
            "barcode": "171120874",
            "dpc": "03031403101",
            "name": "ស៊ុន សុផា ១"
        },
        {
            "barcode": "171120875",
            "dpc": "03031403201",
            "name": "រ៉ុង ប៉ុក"
        },
        {
            "barcode": "171120876",
            "dpc": "03031409001",
            "name": "សំ  ចាន់រិទ្ធ"
        },
        {
            "barcode": "171120877",
            "dpc": "03031403301",
            "name": "ឡុង ប៊ុនថេង"
        },
        {
            "barcode": "171120878",
            "dpc": "03031403401",
            "name": "ចាន់ ម៉ាន់"
        },
        {
            "barcode": "171120879",
            "dpc": "03031403501",
            "name": "ស៊ា ឈាងហេង"
        },
        {
            "barcode": "171120880",
            "dpc": "03031403601",
            "name": "វៀង ហេន"
        },
        {
            "barcode": "171120881",
            "dpc": "03031406301",
            "name": "អេង  លី"
        },
        {
            "barcode": "171120882",
            "dpc": "03031406401",
            "name": "ឃុន  ហាក់ស្រេង"
        },
        {
            "barcode": "171120883",
            "dpc": "03031406501",
            "name": "គង់  ទី"
        },
        {
            "barcode": "171120884",
            "dpc": "03031406601",
            "name": "ឃុន  ហាក់ស្រេង"
        },
        {
            "barcode": "171120885",
            "dpc": "03031406701",
            "name": "ទូច  សុខនី"
        },
        {
            "barcode": "171120886",
            "dpc": "03031406801",
            "name": "ម៉ៅ  តេង"
        },
        {
            "barcode": "171120887",
            "dpc": "03031406901",
            "name": "ម៉ាញ ផាត"
        },
        {
            "barcode": "171120888",
            "dpc": "03031407001",
            "name": "ទឺ   ម៉ារ៉ាឌី"
        },
        {
            "barcode": "171120889",
            "dpc": "03031411501",
            "name": "ជុំ  រិន"
        },
        {
            "barcode": "171120890",
            "dpc": "03031422901",
            "name": "ប៉ូ  ប៊ុនថន"
        },
        {
            "barcode": "171120891",
            "dpc": "03031405501",
            "name": "គឹម ហាំង"
        },
        {
            "barcode": "171120892",
            "dpc": "03031405701",
            "name": "កែវ វណ្ណា"
        },
        {
            "barcode": "171120893",
            "dpc": "03031405801",
            "name": "ថៃ សេង"
        },
        {
            "barcode": "171120894",
            "dpc": "03031405901",
            "name": "ប៊ុន វែង"
        },
        {
            "barcode": "171120895",
            "dpc": "03031406001",
            "name": "លី ឃាង"
        },
        {
            "barcode": "171120896",
            "dpc": "03031406101",
            "name": "នាង ម៉េងលាង"
        },
        {
            "barcode": "171120897",
            "dpc": "03031406201",
            "name": "ងិន  ចេង"
        },
        {
            "barcode": "171120898",
            "dpc": "03031404801",
            "name": "ហុក រ៉ាវុធ"
        },
        {
            "barcode": "171120899",
            "dpc": "03031404901",
            "name": "ហម ស៊ិនទៀង"
        },
        {
            "barcode": "171120900",
            "dpc": "03031405001",
            "name": "លេង ឈឺន"
        },
        {
            "barcode": "171120901",
            "dpc": "03031405101",
            "name": "សៀង ជៀងផេង"
        },
        {
            "barcode": "171120902",
            "dpc": "03031405201",
            "name": "អ៊ឹម ថុង"
        },
        {
            "barcode": "171120903",
            "dpc": "03031405301",
            "name": "ហៀ មី"
        },
        {
            "barcode": "171120904",
            "dpc": "03031411401",
            "name": "ឌុក  សាវើន"
        },
        {
            "barcode": "171120905",
            "dpc": "03031411301",
            "name": "ម៉ាន់  ជួយ"
        },
        {
            "barcode": "171120906",
            "dpc": "03031411201",
            "name": "គាំ  ប៊ីន"
        },
        {
            "barcode": "171120907",
            "dpc": "03031404101",
            "name": "តាំង ឈុន ១"
        },
        {
            "barcode": "171120908",
            "dpc": "03031404201",
            "name": "តាំង ឈុន ២"
        },
        {
            "barcode": "171120909",
            "dpc": "03031404401",
            "name": "តាំង ឈុន ៤"
        },
        {
            "barcode": "171120910",
            "dpc": "03031404501",
            "name": "តាំង ឈុន ៥"
        },
        {
            "barcode": "171120911",
            "dpc": "03031404601",
            "name": "តាំង ឈុន ៦"
        },
        {
            "barcode": "171120912",
            "dpc": "03031404701",
            "name": "តាំង ឈុន ៧"
        },
        {
            "barcode": "171120913",
            "dpc": "03031410301",
            "name": "យិន  សួរ"
        },
        {
            "barcode": "171120914",
            "dpc": "03031410201",
            "name": "ហ៊  ចាន់ថា"
        },
        {
            "barcode": "171120915",
            "dpc": "03031410101",
            "name": "ហុក  កុសល"
        },
        {
            "barcode": "171120916",
            "dpc": "03031410001",
            "name": "តាំង កាំង ៣"
        },
        {
            "barcode": "171120917",
            "dpc": "03031409801",
            "name": "តាំង  កាំង ១"
        },
        {
            "barcode": "171120918",
            "dpc": "03031410901",
            "name": "ហៃ  ណារ៉េត"
        },
        {
            "barcode": "171120919",
            "dpc": "03031410801",
            "name": "សរ  ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171120920",
            "dpc": "03031410701",
            "name": "អ៊ុច   សុថា"
        },
        {
            "barcode": "171120921",
            "dpc": "03031410601",
            "name": "ធុច  រ៉ា"
        },
        {
            "barcode": "171120922",
            "dpc": "03031410401",
            "name": "លី   ប៊ុនហេង"
        },
        {
            "barcode": "171120923",
            "dpc": "03031411101",
            "name": "អ៊ី  ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171120924",
            "dpc": "03031408601",
            "name": "តាំង  បាក់ស្រេង"
        },
        {
            "barcode": "171120925",
            "dpc": "03031408501",
            "name": "លាង  ហាវ"
        },
        {
            "barcode": "171120926",
            "dpc": "03031408401",
            "name": "រ៉ុន  រ៉នី"
        },
        {
            "barcode": "171120927",
            "dpc": "03031408201",
            "name": "ចៅ  កំហ្វាន់"
        },
        {
            "barcode": "171120928",
            "dpc": "03031408301",
            "name": "តាំង  កាំង"
        },
        {
            "barcode": "171120929",
            "dpc": "03031408101",
            "name": "ស  កាន"
        },
        {
            "barcode": "171120930",
            "dpc": "03031408001",
            "name": "លឹម  តុង"
        },
        {
            "barcode": "171120931",
            "dpc": "03031409701",
            "name": "ស៊ូ  អារ៉ាហ្វាត"
        },
        {
            "barcode": "171120932",
            "dpc": "03031409601",
            "name": "ឯល  ការីម"
        },
        {
            "barcode": "171120933",
            "dpc": "03031409401",
            "name": "ស៊ុន  សុផា"
        },
        {
            "barcode": "171120934",
            "dpc": "03031409301",
            "name": "ថៃ  និមល"
        },
        {
            "barcode": "171120935",
            "dpc": "03031409201",
            "name": "សំ  ហា"
        },
        {
            "barcode": "171120936",
            "dpc": "03031409101",
            "name": "នៅ  រ៉ាដេត"
        },
        {
            "barcode": "171120937",
            "dpc": "03031408801",
            "name": "សេង  ស្រីពេជ្រ"
        },
        {
            "barcode": "171120938",
            "dpc": "03031403701",
            "name": "ពឹង គឹមផេង"
        },
        {
            "barcode": "171120939",
            "dpc": "03031403801",
            "name": "អេង ឋារ័ត្ន"
        },
        {
            "barcode": "171120940",
            "dpc": "03031403901",
            "name": "ស៊ូ វ៉ាន់ធី"
        },
        {
            "barcode": "171120941",
            "dpc": "03031404001",
            "name": "យិន ចិត្រា"
        },
        {
            "barcode": "171120942",
            "dpc": "03031407901",
            "name": "តាំង  គៀងបុង"
        },
        {
            "barcode": "171120943",
            "dpc": "03031407801",
            "name": "ណា  រ៉េត"
        },
        {
            "barcode": "171120944",
            "dpc": "03031407601",
            "name": "ហេង  ឈុនផេង ១"
        },
        {
            "barcode": "171120945",
            "dpc": "03031407501",
            "name": "ជា  ស៊ឺ"
        },
        {
            "barcode": "171120946",
            "dpc": "03031407401",
            "name": "ហ៊ឺ  សេង"
        },
        {
            "barcode": "171120947",
            "dpc": "03031407301",
            "name": "យស់  ពៅ"
        },
        {
            "barcode": "171120948",
            "dpc": "03031408901",
            "name": "លឺន  សារ៉ា"
        },
        {
            "barcode": "171120949",
            "dpc": "03031411801",
            "name": "ស៊ីវ  ហក់"
        },
        {
            "barcode": "171120950",
            "dpc": "03031411701",
            "name": "ថោង  ឡាយស្រេង"
        },
        {
            "barcode": "171120951",
            "dpc": "03031411601",
            "name": "ហ៊ុយ  ស៊ីម ២"
        },
        {
            "barcode": "171120952",
            "dpc": "03031411901",
            "name": "សៀង   គៀង ២"
        },
        {
            "barcode": "171120953",
            "dpc": "03031412001",
            "name": "ឈីវ   គី ២"
        },
        {
            "barcode": "171120954",
            "dpc": "03031412101",
            "name": "ប៊ុន  រ៉ាស៊ី"
        },
        {
            "barcode": "171120955",
            "dpc": "03031412201",
            "name": "អ៊ុយ  ស៊ីម"
        },
        {
            "barcode": "171120956",
            "dpc": "03031412301",
            "name": "ធីវ  ណារិន"
        },
        {
            "barcode": "171120957",
            "dpc": "03031412501",
            "name": "អន  ភិរម្យ"
        },
        {
            "barcode": "171120958",
            "dpc": "03031412601",
            "name": "យ៉ាំ  ឃួង"
        },
        {
            "barcode": "171120959",
            "dpc": "03031412701",
            "name": "ឌុក  ឆាយ"
        },
        {
            "barcode": "171120960",
            "dpc": "03031412801",
            "name": "ស៊ិក  សុរ័ត្នន៍"
        },
        {
            "barcode": "171120961",
            "dpc": "03031412901",
            "name": "ពិន  សាវឿន"
        },
        {
            "barcode": "171120962",
            "dpc": "03031413001",
            "name": "ចាំង  គីមឹអ៊ាង"
        },
        {
            "barcode": "171120963",
            "dpc": "03031413201",
            "name": "យិន  វុនហាន ១"
        },
        {
            "barcode": "171120964",
            "dpc": "03031413301",
            "name": "ស៊្រុន"
        },
        {
            "barcode": "171120965",
            "dpc": "03031413401",
            "name": "ហៃ  សុភ័ក្រ"
        },
        {
            "barcode": "171120966",
            "dpc": "03031413501",
            "name": "គឹម  ហេង"
        },
        {
            "barcode": "171120967",
            "dpc": "03031413601",
            "name": "ឌុក  ឆវេត"
        },
        {
            "barcode": "171120968",
            "dpc": "03031413701",
            "name": "ប្រាក់  សារីម"
        },
        {
            "barcode": "171120969",
            "dpc": "03031413801",
            "name": "សេក  សុគន្ធ"
        },
        {
            "barcode": "171120970",
            "dpc": "03031413901",
            "name": "នីវ  ណារិន"
        },
        {
            "barcode": "171120971",
            "dpc": "03031414001",
            "name": "ផែ  ណាំជីវ"
        },
        {
            "barcode": "171120972",
            "dpc": "03031414201",
            "name": "យិន  វុនហាន ២"
        },
        {
            "barcode": "171120973",
            "dpc": "03031414301",
            "name": "ហេង  រ៉ា"
        },
        {
            "barcode": "171120974",
            "dpc": "03031414401",
            "name": "ឆាន់  ភុយ"
        },
        {
            "barcode": "171120975",
            "dpc": "03031414501",
            "name": "ម៉ៅ  សុខលី ៣"
        },
        {
            "barcode": "171120976",
            "dpc": "03031414601",
            "name": "ស៊ីន  ឃុន ១"
        },
        {
            "barcode": "171120977",
            "dpc": "03031414701",
            "name": "ស៊ីន ឃុន ១"
        },
        {
            "barcode": "171120978",
            "dpc": "03031414801",
            "name": "សូ  ឌឿន"
        },
        {
            "barcode": "171120979",
            "dpc": "03031414901",
            "name": "តាំង  បាក់ស្រេង"
        },
        {
            "barcode": "171120980",
            "dpc": "03031415001",
            "name": "តាំង បាក់ស្រេង ១"
        },
        {
            "barcode": "171120981",
            "dpc": "03031415101",
            "name": "គុយ  ម៉េង ២"
        },
        {
            "barcode": "171120982",
            "dpc": "03031415201",
            "name": "តាំង  កាំង ១"
        },
        {
            "barcode": "171120983",
            "dpc": "03031415301",
            "name": "តាំង កាំង ២"
        },
        {
            "barcode": "171120984",
            "dpc": "03031415401",
            "name": "តាំង កាំង លក់បារី"
        },
        {
            "barcode": "171120985",
            "dpc": "03031415501",
            "name": "អ៊ុក  សារ៉េត"
        },
        {
            "barcode": "171120986",
            "dpc": "03031415601",
            "name": "ឈីវ  កិរិយា"
        },
        {
            "barcode": "171120987",
            "dpc": "03031415701",
            "name": "លឹម  ហួរ ១"
        },
        {
            "barcode": "171120988",
            "dpc": "03031415801",
            "name": "លឹម ហួរ ១"
        },
        {
            "barcode": "171120989",
            "dpc": "03031415901",
            "name": "ជឺ  ឈៀង"
        },
        {
            "barcode": "171120990",
            "dpc": "03031416001",
            "name": "សៅ  រិន"
        },
        {
            "barcode": "171120991",
            "dpc": "03031416101",
            "name": "អ៊ឹម  សុថូល"
        },
        {
            "barcode": "171120992",
            "dpc": "03031416201",
            "name": "ហេង (លក់មាស )"
        },
        {
            "barcode": "171120993",
            "dpc": "03031416301",
            "name": "លី  វ៉ាន់នី"
        },
        {
            "barcode": "171120994",
            "dpc": "03031416401",
            "name": "លូ  ហៀង"
        },
        {
            "barcode": "171120995",
            "dpc": "03031416501",
            "name": "ហាំង  ឆែ"
        },
        {
            "barcode": "171120996",
            "dpc": "03031416601",
            "name": "ថុង  ម៉េង ២"
        },
        {
            "barcode": "171120997",
            "dpc": "03031416801",
            "name": "តាំង  ប៊ូ"
        },
        {
            "barcode": "171120998",
            "dpc": "03031416701",
            "name": "លាង  ហាក់"
        },
        {
            "barcode": "171120999",
            "dpc": "03031416901",
            "name": "លី   មាន (លក់អង្ករ)"
        },
        {
            "barcode": "171121000",
            "dpc": "03031417001",
            "name": "លឹម  ឃុន"
        },
        {
            "barcode": "171121001",
            "dpc": "03031417101",
            "name": "លី  មាន ( លី  ស្រី)"
        },
        {
            "barcode": "171121002",
            "dpc": "03031417201",
            "name": "លី លុយ"
        },
        {
            "barcode": "171121003",
            "dpc": "03031417301",
            "name": "ថុង  ម៉ី"
        },
        {
            "barcode": "171121004",
            "dpc": "03031417401",
            "name": "សុខ  គង់"
        },
        {
            "barcode": "171121005",
            "dpc": "03031417501",
            "name": "អ៊ុក  ឃុន"
        },
        {
            "barcode": "171121006",
            "dpc": "03031417601",
            "name": "ពឹង  ឆាយគៀង"
        },
        {
            "barcode": "171121007",
            "dpc": "03031417701",
            "name": "ឈៀង  សុវណ្ណា"
        },
        {
            "barcode": "171121008",
            "dpc": "03031417801",
            "name": "អ៊ឹង  នីតា"
        },
        {
            "barcode": "171121009",
            "dpc": "03031417901",
            "name": "ពេជ្រ  ថុល"
        },
        {
            "barcode": "171121010",
            "dpc": "03031418001",
            "name": "ឃឹម  ឡេង"
        },
        {
            "barcode": "171121011",
            "dpc": "03031418101",
            "name": "ជួន  ណារិទ្ធ"
        },
        {
            "barcode": "171121012",
            "dpc": "03031418201",
            "name": "ឌិន  ប៊ុណ្ណា"
        },
        {
            "barcode": "171121013",
            "dpc": "03031418301",
            "name": "តាំង  ឈុន ២"
        },
        {
            "barcode": "171121014",
            "dpc": "03031418401",
            "name": "តាំង  ឈុន ៧"
        },
        {
            "barcode": "171121015",
            "dpc": "03031418501",
            "name": "គង់  សុភា"
        },
        {
            "barcode": "171121016",
            "dpc": "03031418601",
            "name": "យាយ  កែវ"
        },
        {
            "barcode": "171121017",
            "dpc": "03031418701",
            "name": "ប៊ុន  សួរ"
        },
        {
            "barcode": "171121018",
            "dpc": "03031418801",
            "name": "ពូ  ពេជ្រ"
        },
        {
            "barcode": "171121019",
            "dpc": "03031422801",
            "name": "ទួន  ភាព"
        },
        {
            "barcode": "171121020",
            "dpc": "03031418901",
            "name": "អ៊ឹង  ប៊ីហាប់"
        },
        {
            "barcode": "171121021",
            "dpc": "03031419001",
            "name": "ឃូ  ប៉ាវ"
        },
        {
            "barcode": "171121022",
            "dpc": "03031419101",
            "name": "ណយ  សាន់"
        },
        {
            "barcode": "171121023",
            "dpc": "03031419201",
            "name": "សា  វ៉ាន់"
        },
        {
            "barcode": "171121024",
            "dpc": "03031419301",
            "name": "សុក  ឡាយ"
        },
        {
            "barcode": "171121025",
            "dpc": "03031419401",
            "name": "គឹម  ទី"
        },
        {
            "barcode": "171121026",
            "dpc": "03031419501",
            "name": "លៀង  គឹមឡី"
        },
        {
            "barcode": "171121027",
            "dpc": "03031419601",
            "name": "កាំង សៀក"
        },
        {
            "barcode": "171121028",
            "dpc": "03031419701",
            "name": "ពឹង  លីវ"
        },
        {
            "barcode": "171121029",
            "dpc": "03031419801",
            "name": "ស៊ាន  សាវឿន"
        },
        {
            "barcode": "171121030",
            "dpc": "03031419901",
            "name": "គុជ  កល្យា"
        },
        {
            "barcode": "171121031",
            "dpc": "03031420001",
            "name": "លឹម  ជា"
        },
        {
            "barcode": "171121032",
            "dpc": "03031420101",
            "name": "កាំង  លី"
        },
        {
            "barcode": "171121033",
            "dpc": "03031420201",
            "name": "ឈួន  ប៉ា"
        },
        {
            "barcode": "171121034",
            "dpc": "03031420301",
            "name": "ហម សំបូរ"
        },
        {
            "barcode": "171121035",
            "dpc": "03031420401",
            "name": "ជុត  វ៉ារ៉ុង"
        },
        {
            "barcode": "171121036",
            "dpc": "03031420501",
            "name": "លឹម  ឃុន"
        },
        {
            "barcode": "171121037",
            "dpc": "03031420701",
            "name": "ព្រំ  ណូ"
        },
        {
            "barcode": "171121038",
            "dpc": "03031420801",
            "name": "តោ  សាលីន"
        },
        {
            "barcode": "171121039",
            "dpc": "03031420901",
            "name": "តាំង ឈុន ៥"
        },
        {
            "barcode": "171121040",
            "dpc": "03031421001",
            "name": "តាង  ឈុន (លក់មាស)"
        },
        {
            "barcode": "171121041",
            "dpc": "03031421101",
            "name": "ភោគ  សុភី"
        },
        {
            "barcode": "171121042",
            "dpc": "03031421301",
            "name": "ចាន់  ហេង"
        },
        {
            "barcode": "171121043",
            "dpc": "03031421401",
            "name": "តាំង ឈុន១"
        },
        {
            "barcode": "171121044",
            "dpc": "03031421501",
            "name": "សេង  ហៃ"
        },
        {
            "barcode": "171121045",
            "dpc": "03031421601",
            "name": "សេង  រ៉ាស៊ីន"
        },
        {
            "barcode": "171121046",
            "dpc": "03031421701",
            "name": "ទ្រី  ថា"
        },
        {
            "barcode": "171121047",
            "dpc": "03031421801",
            "name": "យឹម  វ៉ិត ១"
        },
        {
            "barcode": "171121048",
            "dpc": "03031421901",
            "name": "យឹម  វ៉ិត ២"
        },
        {
            "barcode": "171121049",
            "dpc": "03031422001",
            "name": "ជូរ  គង់"
        },
        {
            "barcode": "171121050",
            "dpc": "03031422101",
            "name": "លី វែង"
        },
        {
            "barcode": "171121051",
            "dpc": "03031422401",
            "name": "តាំង  ស៊ឹមហុង"
        },
        {
            "barcode": "171121052",
            "dpc": "03031422501",
            "name": "ឈី  គី ១"
        },
        {
            "barcode": "171121053",
            "dpc": "03031422601",
            "name": "កែវ  ចំរើន"
        },
        {
            "barcode": "171121054",
            "dpc": "03031422701",
            "name": "ឈ  គង់ទី"
        },
        {
            "barcode": "171121055",
            "dpc": "03031426801",
            "name": "ង៉ែត គី"
        },
        {
            "barcode": "171121056",
            "dpc": "03031426901",
            "name": "ខូវ ស៊ាងហុង"
        },
        {
            "barcode": "171121057",
            "dpc": "03031427001",
            "name": "អ៊ុក ចឹក"
        },
        {
            "barcode": "171121058",
            "dpc": "03031427101",
            "name": "ខេង ធីតា"
        },
        {
            "barcode": "171121059",
            "dpc": "03031427201",
            "name": "ឃុត ចន្ថា"
        },
        {
            "barcode": "171121060",
            "dpc": "03031427401",
            "name": "សម ស៊ុននី"
        },
        {
            "barcode": "171121061",
            "dpc": "03031427501",
            "name": "ទ្រឿង រដ្ឋរិទ្ធី"
        },
        {
            "barcode": "171121062",
            "dpc": "03031427601",
            "name": "អ៊ុក វង្ស ១"
        },
        {
            "barcode": "171121063",
            "dpc": "03031427701",
            "name": "អ៊ុក វង្ស ២"
        },
        {
            "barcode": "171121064",
            "dpc": "03031427801",
            "name": "អ៊ុក វង្ស ៣"
        },
        {
            "barcode": "171121065",
            "dpc": "03031427901",
            "name": "អ៊ុក វង្ស ៤"
        },
        {
            "barcode": "171121066",
            "dpc": "03031428001",
            "name": "ថាំង សុវណ្ណ"
        },
        {
            "barcode": "171121067",
            "dpc": "03031428101",
            "name": "ហេង ទុយ"
        },
        {
            "barcode": "171121068",
            "dpc": "03031428201",
            "name": "សួង ហេង"
        },
        {
            "barcode": "171121069",
            "dpc": "03031428401",
            "name": "ជាង មុយ"
        },
        {
            "barcode": "171121070",
            "dpc": "03031428501",
            "name": "ស៊ឹម សារ៉ាត់ ១"
        },
        {
            "barcode": "171121071",
            "dpc": "03031428601",
            "name": "នក់ ហ្វួយ"
        },
        {
            "barcode": "171121072",
            "dpc": "03031428701",
            "name": "ង៉ែត វិភូ ១"
        },
        {
            "barcode": "171121073",
            "dpc": "03031428801",
            "name": "ស៊ឹម សារ៉ាត់ ២"
        },
        {
            "barcode": "171121074",
            "dpc": "03031428901",
            "name": "អ៊ុន ផល្លា"
        },
        {
            "barcode": "171121075",
            "dpc": "03031432701",
            "name": "ឯក ស៊ីនាង"
        },
        {
            "barcode": "171121076",
            "dpc": "03031429001",
            "name": "ទុយ សុខុន ១"
        },
        {
            "barcode": "171121077",
            "dpc": "03031429101",
            "name": "ទុយ សុខុន ២"
        },
        {
            "barcode": "171121078",
            "dpc": "03031429201",
            "name": "ជា ចាន់ខន ១"
        },
        {
            "barcode": "171121079",
            "dpc": "03031429301",
            "name": "អ៊ុក ព្រំ"
        },
        {
            "barcode": "171121080",
            "dpc": "03031429401",
            "name": "ជា ចាន់ខន ២"
        },
        {
            "barcode": "171121081",
            "dpc": "03031429501",
            "name": "យ៉ង់ ផាន"
        },
        {
            "barcode": "171121082",
            "dpc": "03031429601",
            "name": "ទេព សារ៉ាត់"
        },
        {
            "barcode": "171121083",
            "dpc": "03031429701",
            "name": "ទួន ស៊ុនលី"
        },
        {
            "barcode": "171121084",
            "dpc": "03031426001",
            "name": "ទូ ថាំង ១"
        },
        {
            "barcode": "171121085",
            "dpc": "03031426101",
            "name": "ទូ ថាំង ២"
        },
        {
            "barcode": "171121086",
            "dpc": "03031426201",
            "name": "ភួយ សណារ័ត្ន"
        },
        {
            "barcode": "171121087",
            "dpc": "03031426301",
            "name": "ជុំ ចាន់ដារិទ្ធ"
        },
        {
            "barcode": "171121088",
            "dpc": "03031426401",
            "name": "សូ សុគុណ"
        },
        {
            "barcode": "171121089",
            "dpc": "03031426501",
            "name": "អេង សាមួយ"
        },
        {
            "barcode": "171121090",
            "dpc": "03031426601",
            "name": "គឹម សាភិន"
        },
        {
            "barcode": "171121091",
            "dpc": "03031426701",
            "name": "ម៉ៅ ឆវឿង"
        },
        {
            "barcode": "171121092",
            "dpc": "03031425901",
            "name": "ជា ម៉ៅ"
        },
        {
            "barcode": "171121093",
            "dpc": "03031425801",
            "name": "ប៉ែន ឆាលី"
        },
        {
            "barcode": "171121094",
            "dpc": "03031425701",
            "name": "សុខ សារ៉េត"
        },
        {
            "barcode": "171121095",
            "dpc": "03031425601",
            "name": "នីវ ណារិន"
        },
        {
            "barcode": "171121096",
            "dpc": "03031425501",
            "name": "ជា ឆវិល័យ"
        },
        {
            "barcode": "171121097",
            "dpc": "03031425401",
            "name": "ឡឹម សារិន"
        },
        {
            "barcode": "171121098",
            "dpc": "03031433401",
            "name": "ឌួង សាក់"
        },
        {
            "barcode": "171121099",
            "dpc": "03031433301",
            "name": "សួន សុខុម"
        },
        {
            "barcode": "171121100",
            "dpc": "03031433201",
            "name": "ហេង កង"
        },
        {
            "barcode": "171121101",
            "dpc": "03031433101",
            "name": "ប៊ុន គង់"
        },
        {
            "barcode": "171121102",
            "dpc": "03031433001",
            "name": "លី ជា"
        },
        {
            "barcode": "171121103",
            "dpc": "03031432901",
            "name": "សាយ សុខខេង"
        },
        {
            "barcode": "171121104",
            "dpc": "03031432501",
            "name": "ឃុន មុំ"
        },
        {
            "barcode": "171121105",
            "dpc": "03031432401",
            "name": "ឃុន ឃីម"
        },
        {
            "barcode": "171121106",
            "dpc": "03031432201",
            "name": "កោ គឹមហៃ"
        },
        {
            "barcode": "171121107",
            "dpc": "03031432101",
            "name": "ឈរ ជាណាំង"
        },
        {
            "barcode": "171121108",
            "dpc": "03031432001",
            "name": "សេក សុគន្ធ"
        },
        {
            "barcode": "171121109",
            "dpc": "03031431901",
            "name": "ផាន់ សុភាព"
        },
        {
            "barcode": "171121110",
            "dpc": "03031430101",
            "name": "ឆុង ឈឿត"
        },
        {
            "barcode": "171121111",
            "dpc": "03031430001",
            "name": "ណុប ងិន"
        },
        {
            "barcode": "171121112",
            "dpc": "03031429901",
            "name": "សោ សុទ្ធធឿន"
        },
        {
            "barcode": "171121113",
            "dpc": "03031429801",
            "name": "ការិ.សុខាភិបាលស្រុក"
        },
        {
            "barcode": "171121114",
            "dpc": "03031430201",
            "name": "ង៉ូវ លីផេង"
        },
        {
            "barcode": "171121115",
            "dpc": "03031430301",
            "name": "ចេ ចៀក"
        },
        {
            "barcode": "171121116",
            "dpc": "03031430401",
            "name": "នង ឃាង"
        },
        {
            "barcode": "171121117",
            "dpc": "03031430501",
            "name": "ស៊ុំ   ផន"
        },
        {
            "barcode": "171121118",
            "dpc": "03031430601",
            "name": "ឈួ សុធា"
        },
        {
            "barcode": "171121119",
            "dpc": "03031430701",
            "name": "លន់ ស៊ីន"
        },
        {
            "barcode": "171121120",
            "dpc": "03031430801",
            "name": "គឹម ហួតហេង"
        },
        {
            "barcode": "171121121",
            "dpc": "03031430901",
            "name": "ឈុយ លី"
        },
        {
            "barcode": "171121122",
            "dpc": "03031431001",
            "name": "ខែក សៀង"
        },
        {
            "barcode": "171121123",
            "dpc": "03031431501",
            "name": "ធៀន ណុង"
        },
        {
            "barcode": "171121124",
            "dpc": "03031431701",
            "name": "ជាង លាប"
        },
        {
            "barcode": "171121125",
            "dpc": "03031431301",
            "name": "តាន់ អ៊ីម"
        },
        {
            "barcode": "171121126",
            "dpc": "03031431101",
            "name": "អេង ឌាំង"
        },
        {
            "barcode": "171121127",
            "dpc": "03031431801",
            "name": "លី ឆង៉ូវ"
        },
        {
            "barcode": "171121128",
            "dpc": "03031407101",
            "name": "ជា ពៅ"
        },
        {
            "barcode": "171121129",
            "dpc": "03031440001",
            "name": "ជូ​ ផេង"
        },
        {
            "barcode": "171121130",
            "dpc": "03031439701",
            "name": "គង់  ស៊ីណា"
        },
        {
            "barcode": "171121131",
            "dpc": "03031439601",
            "name": "ធាម  ជឹង"
        },
        {
            "barcode": "171121132",
            "dpc": "03031439501",
            "name": "សេង  សុរ័ត្ន"
        },
        {
            "barcode": "171121133",
            "dpc": "03031439401",
            "name": "គ្រិន  ញ៉ុង"
        },
        {
            "barcode": "171121134",
            "dpc": "03031439201",
            "name": "ងូវ  សៀង"
        },
        {
            "barcode": "171121135",
            "dpc": "03031439001",
            "name": "លេង  ហុង"
        },
        {
            "barcode": "171121136",
            "dpc": "03031438801",
            "name": "ជុំ  សុណ្ណារិទ្ធ ២"
        },
        {
            "barcode": "171121137",
            "dpc": "03031425301",
            "name": "ខូវ លាងម៉េង"
        },
        {
            "barcode": "171121138",
            "dpc": "03031425201",
            "name": "គឹម រិន"
        },
        {
            "barcode": "171121139",
            "dpc": "03031425101",
            "name": "សៀវ ច័ន្ទមនោរម្យ"
        },
        {
            "barcode": "171121140",
            "dpc": "03031425001",
            "name": "ឡុង ស្រ៊ុន"
        },
        {
            "barcode": "171121141",
            "dpc": "03031424901",
            "name": "សៀវ បូផេង"
        },
        {
            "barcode": "171121142",
            "dpc": "03031424801",
            "name": "គិន យុន"
        },
        {
            "barcode": "171121143",
            "dpc": "03031424701",
            "name": "ចាន់ សុន"
        },
        {
            "barcode": "171121144",
            "dpc": "03031424601",
            "name": "ស៊ិន សោភា"
        },
        {
            "barcode": "171121145",
            "dpc": "03031424501",
            "name": "លឹម គឹមអ៊ី"
        },
        {
            "barcode": "171121146",
            "dpc": "03031424401",
            "name": "ម៉ី  សំណាង"
        },
        {
            "barcode": "171121147",
            "dpc": "03031424201",
            "name": "យឿន យៀន"
        },
        {
            "barcode": "171121148",
            "dpc": "03031424101",
            "name": "ជិម ឡាវស្រ៊ុន"
        },
        {
            "barcode": "171121149",
            "dpc": "03031423901",
            "name": "តាំង ហេង"
        },
        {
            "barcode": "171121150",
            "dpc": "03031423801",
            "name": "ម៉ម សេសាន"
        },
        {
            "barcode": "171121151",
            "dpc": "03031423701",
            "name": "វឿង ប៊ុតរេត"
        },
        {
            "barcode": "171121152",
            "dpc": "03031423601",
            "name": "ទារ សារ៉ាត់"
        },
        {
            "barcode": "171121153",
            "dpc": "03031423501",
            "name": "ហួត សំណាង"
        },
        {
            "barcode": "171121154",
            "dpc": "03031423401",
            "name": "ជួញ សឆៃ"
        },
        {
            "barcode": "171121155",
            "dpc": "03031423301",
            "name": "ឯល សយ"
        },
        {
            "barcode": "171121156",
            "dpc": "03031423201",
            "name": "ព្រំ វណ្ណា"
        },
        {
            "barcode": "171121157",
            "dpc": "03031423101",
            "name": "ស៊ីវ សារឿន"
        },
        {
            "barcode": "171121158",
            "dpc": "03031423001",
            "name": "គុយ ម៉េង"
        },
        {
            "barcode": "171121159",
            "dpc": "03031438001",
            "name": "ផល មី"
        },
        {
            "barcode": "171121160",
            "dpc": "03031437901",
            "name": "តាត នី"
        },
        {
            "barcode": "171121161",
            "dpc": "03031437801",
            "name": "អិ សូញ"
        },
        {
            "barcode": "171121162",
            "dpc": "03031437701",
            "name": "ព្រំ សេរី"
        },
        {
            "barcode": "171121163",
            "dpc": "03031437601",
            "name": "លឹម ប៉េងឃីម"
        },
        {
            "barcode": "171121164",
            "dpc": "03031437501",
            "name": "ហាក់ ឡេង"
        },
        {
            "barcode": "171121165",
            "dpc": "03031437401",
            "name": "អៀ គឹមហ៊ុន១"
        },
        {
            "barcode": "171121166",
            "dpc": "03031437301",
            "name": "ឈួរ គី"
        },
        {
            "barcode": "171121167",
            "dpc": "03031437201",
            "name": "អ៊ឹម ផូ"
        },
        {
            "barcode": "171121168",
            "dpc": "03031437101",
            "name": "និន ណុន"
        },
        {
            "barcode": "171121169",
            "dpc": "03031437001",
            "name": "អ៊ឹង គង់"
        },
        {
            "barcode": "171121170",
            "dpc": "03031436901",
            "name": "រុន រ៉ានី"
        },
        {
            "barcode": "171121171",
            "dpc": "03031436801",
            "name": "ជាង គឿ"
        },
        {
            "barcode": "171121172",
            "dpc": "03031436601",
            "name": "ងួន តូ"
        },
        {
            "barcode": "171121173",
            "dpc": "03031436501",
            "name": "ទាវ កៅ"
        },
        {
            "barcode": "171121174",
            "dpc": "03031436401",
            "name": "ង៉ោ ឆេង"
        },
        {
            "barcode": "171121175",
            "dpc": "03031436301",
            "name": "គូ ស៊ីថា"
        },
        {
            "barcode": "171121176",
            "dpc": "03031436201",
            "name": "តុង សេង"
        },
        {
            "barcode": "171121177",
            "dpc": "03031436101",
            "name": "សុខ ឡេង"
        },
        {
            "barcode": "171121178",
            "dpc": "03031436001",
            "name": "សរ ប៊ុនរិទ្ធិ"
        },
        {
            "barcode": "171121179",
            "dpc": "03031434301",
            "name": "លីវ ធារ៉ា"
        },
        {
            "barcode": "171121180",
            "dpc": "03031434501",
            "name": "វ៉ែន សំបូរ"
        },
        {
            "barcode": "171121181",
            "dpc": "03031434601",
            "name": "គិត យិង"
        },
        {
            "barcode": "171121182",
            "dpc": "03031434801",
            "name": "ប៊ី បុប្ផា"
        },
        {
            "barcode": "171121183",
            "dpc": "03031434901",
            "name": "គង់ ណាំ"
        },
        {
            "barcode": "171121184",
            "dpc": "03031435001",
            "name": "ប៉ែន ណារិទ្ធ"
        },
        {
            "barcode": "171121185",
            "dpc": "03031435101",
            "name": "ចេង ប៊ុនឡុង"
        },
        {
            "barcode": "171121186",
            "dpc": "03031435201",
            "name": "ហៀង ឆោមណា"
        },
        {
            "barcode": "171121187",
            "dpc": "03031435301",
            "name": "លឹម សុខ"
        },
        {
            "barcode": "171121188",
            "dpc": "03031435501",
            "name": "សំ វ៉ាន់នី"
        },
        {
            "barcode": "171121189",
            "dpc": "03031435601",
            "name": "ទាវ កៅ"
        },
        {
            "barcode": "171121190",
            "dpc": "03031435701",
            "name": "អ៊ឺង អៀងហេង"
        },
        {
            "barcode": "171121191",
            "dpc": "03031435801",
            "name": "ចាន់ ហុង"
        },
        {
            "barcode": "171121192",
            "dpc": "03031435901",
            "name": "ទិត្យ បូប"
        },
        {
            "barcode": "171121193",
            "dpc": "03031434201",
            "name": "ស ណាំ"
        },
        {
            "barcode": "171121194",
            "dpc": "03031434101",
            "name": "ហ៊ុំ សុខា ២"
        },
        {
            "barcode": "171121195",
            "dpc": "03031434001",
            "name": "ខូវ ផល្លី"
        },
        {
            "barcode": "171121196",
            "dpc": "03031433901",
            "name": "ហ៊ុំ សុខា ១"
        },
        {
            "barcode": "171121197",
            "dpc": "03031433801",
            "name": "ឡាយ វ៉ាន់"
        },
        {
            "barcode": "171121198",
            "dpc": "03031433701",
            "name": "នេត ថន"
        },
        {
            "barcode": "171121199",
            "dpc": "03031433601",
            "name": "ពេជ្រ  ខាន់"
        },
        {
            "barcode": "171121200",
            "dpc": "03031440101",
            "name": "អ៊ុក ព្រំ"
        },
        {
            "barcode": "171121201",
            "dpc": "03031440201",
            "name": "វត្តពិភិទ្ធារាម (ខាងលិច)"
        },
        {
            "barcode": "171121202",
            "dpc": "03031440301",
            "name": "វត្តពិភិទ្ធារាម (ខាងកើត)"
        },
        {
            "barcode": "171121203",
            "dpc": "03031446301",
            "name": "ប៉ុក សុទ្ធា"
        },
        {
            "barcode": "171121204",
            "dpc": "03031432601",
            "name": "គង់ ប៊ុនលី"
        },
        {
            "barcode": "171121205",
            "dpc": "03031441401",
            "name": "លក់ គ្រី"
        },
        {
            "barcode": "171121206",
            "dpc": "03031441701",
            "name": "ប៉ែន ហាប់"
        },
        {
            "barcode": "171121207",
            "dpc": "03031441801",
            "name": "ឈ្នាង សុង"
        },
        {
            "barcode": "171121208",
            "dpc": "03031441901",
            "name": "ព្រំ មាំងគីម"
        },
        {
            "barcode": "171121209",
            "dpc": "03031442001",
            "name": "ប៉ែន កិ"
        },
        {
            "barcode": "171121210",
            "dpc": "03031442201",
            "name": "ជិត ជុំ"
        },
        {
            "barcode": "171121211",
            "dpc": "03031442301",
            "name": "បេង លន់"
        },
        {
            "barcode": "171121212",
            "dpc": "03031442401",
            "name": "ហ៊ុន វិបុល"
        },
        {
            "barcode": "171121213",
            "dpc": "03031442501",
            "name": "ឆាយ យួម"
        },
        {
            "barcode": "171121214",
            "dpc": "03031442601",
            "name": "ម៉ៅ ហុក"
        },
        {
            "barcode": "171121215",
            "dpc": "03031442701",
            "name": "តុក សុងសួរ"
        },
        {
            "barcode": "171121216",
            "dpc": "03031442801",
            "name": "បណ្តូល សំណាង"
        },
        {
            "barcode": "171121217",
            "dpc": "03031442901",
            "name": "ឈិនស៊ី"
        },
        {
            "barcode": "171121218",
            "dpc": "03031443001",
            "name": "ឯល សារ៉ាត់"
        },
        {
            "barcode": "171121219",
            "dpc": "03031443101",
            "name": "ញឹក ប៊ុនឈុប"
        },
        {
            "barcode": "171121220",
            "dpc": "03031443201",
            "name": "អ៊ន សុផានី"
        },
        {
            "barcode": "171121221",
            "dpc": "03031443401",
            "name": "យ៉ាំ យី"
        },
        {
            "barcode": "171121222",
            "dpc": "03031443501",
            "name": "អៀ ឈុន"
        },
        {
            "barcode": "171121223",
            "dpc": "03031443601",
            "name": "ណាំ ទុំ"
        },
        {
            "barcode": "171121224",
            "dpc": "03031443701",
            "name": "អ៊ុល វិបុល"
        },
        {
            "barcode": "171121225",
            "dpc": "03031443901",
            "name": "ងួន ចរិយា"
        },
        {
            "barcode": "171121226",
            "dpc": "03031444001",
            "name": "ចាប សុភី"
        },
        {
            "barcode": "171121227",
            "dpc": "03031444101",
            "name": "ម៉ន សាម៉ៃ"
        },
        {
            "barcode": "171121228",
            "dpc": "03031444201",
            "name": "អ៊ុំ រ៉ូន"
        },
        {
            "barcode": "171121229",
            "dpc": "03031444301",
            "name": "សែ សារ៉ាន់"
        },
        {
            "barcode": "171121230",
            "dpc": "03031444401",
            "name": "ប៉ឹង រ៉ុន"
        },
        {
            "barcode": "171121231",
            "dpc": "03031444601",
            "name": "តាត ស៊ាង"
        },
        {
            "barcode": "171121232",
            "dpc": "03031444701",
            "name": "ម៉ក់ ណុល"
        },
        {
            "barcode": "171121233",
            "dpc": "03031444801",
            "name": "ទ្រី ទុយ"
        },
        {
            "barcode": "171121234",
            "dpc": "03031444901",
            "name": "អៀង សាមេត"
        },
        {
            "barcode": "171121235",
            "dpc": "03031445001",
            "name": "ស៊ុយ អេង"
        },
        {
            "barcode": "171121236",
            "dpc": "03031445101",
            "name": "ជួន ប៊ុន"
        },
        {
            "barcode": "171121237",
            "dpc": "03031445201",
            "name": "អ៊ុយ លន់"
        },
        {
            "barcode": "171121238",
            "dpc": "03031445301",
            "name": "ឈួន ហួត"
        },
        {
            "barcode": "171121239",
            "dpc": "03031445401",
            "name": "ពេជ្រ លឹមអ៊ី"
        },
        {
            "barcode": "171121240",
            "dpc": "03031445501",
            "name": "សេង ស៊ីម"
        },
        {
            "barcode": "171121241",
            "dpc": "03031445601",
            "name": "គីង ចាន់ឡាយ"
        },
        {
            "barcode": "171121242",
            "dpc": "03031445701",
            "name": "ឃីម គឹមលាង"
        },
        {
            "barcode": "171121243",
            "dpc": "03031445801",
            "name": "កឺ សិនឡុង"
        },
        {
            "barcode": "171121244",
            "dpc": "03031445901",
            "name": "ឈឹម ឆុំ"
        },
        {
            "barcode": "171121245",
            "dpc": "03031446001",
            "name": "ហេង ឈាន"
        },
        {
            "barcode": "171121246",
            "dpc": "03031446101",
            "name": "ស្រៀង ទ្រី"
        },
        {
            "barcode": "171121247",
            "dpc": "03031446401",
            "name": "ចៅ ម៉ាន់"
        },
        {
            "barcode": "171121248",
            "dpc": "03031446501",
            "name": "ចៅ កង"
        },
        {
            "barcode": "171121249",
            "dpc": "03031446601",
            "name": "ហួយ ម៉េង"
        },
        {
            "barcode": "171121250",
            "dpc": "03031446901",
            "name": "នូ សារ"
        },
        {
            "barcode": "171121251",
            "dpc": "03031447001",
            "name": "ចែត្រ ថៃ"
        },
        {
            "barcode": "171121252",
            "dpc": "03031447101",
            "name": "ឆេង ឡុង"
        },
        {
            "barcode": "171121253",
            "dpc": "03031447201",
            "name": "ពាំង វែង"
        },
        {
            "barcode": "171121254",
            "dpc": "03031447301",
            "name": "ស៊ឹម ណា"
        },
        {
            "barcode": "171121255",
            "dpc": "03031447401",
            "name": "ជា ឆូយ"
        },
        {
            "barcode": "171121256",
            "dpc": "03031447501",
            "name": "លុយ ម៉េងណាំង"
        },
        {
            "barcode": "171121257",
            "dpc": "03031440401",
            "name": "សៀង លីម"
        },
        {
            "barcode": "171121258",
            "dpc": "03031440601",
            "name": "សេង យក់រ៉ា"
        },
        {
            "barcode": "171121259",
            "dpc": "03031440701",
            "name": "ឈួន ហួត"
        },
        {
            "barcode": "171121260",
            "dpc": "03031440801",
            "name": "សេង ម៉ាង"
        },
        {
            "barcode": "171121261",
            "dpc": "03031440901",
            "name": "ណៃ វណ្ណៈ"
        },
        {
            "barcode": "171121262",
            "dpc": "03031441001",
            "name": "ជា ហួរ"
        },
        {
            "barcode": "171121263",
            "dpc": "03031441201",
            "name": "ជី ខេង"
        },
        {
            "barcode": "171121264",
            "dpc": "03031441301",
            "name": "កឹម  កាង"
        },
        {
            "barcode": "171121265",
            "dpc": "03031447601",
            "name": "ឡេង ស៊ូឡាង"
        },
        {
            "barcode": "171121266",
            "dpc": "03031447701",
            "name": "នន់ សុគន្ធ"
        },
        {
            "barcode": "171121267",
            "dpc": "03031447801",
            "name": "ចាន់ សូយ៉េត"
        },
        {
            "barcode": "171121268",
            "dpc": "03031447901",
            "name": "គឹម ស៊ុនរិទ្ធី"
        },
        {
            "barcode": "171121269",
            "dpc": "03031402601",
            "name": "ចាន់  ហួត"
        },
        {
            "barcode": "171121270",
            "dpc": "03031407201",
            "name": "យឹម  ចិត្រា"
        },
        {
            "barcode": "171121271",
            "dpc": "03031408701",
            "name": "ហេង  សុខមុនី"
        },
        {
            "barcode": "171121272",
            "dpc": "03031409501",
            "name": "ហាស់  ស៊ីផាន់"
        },
        {
            "barcode": "171121273",
            "dpc": "03031431201",
            "name": "អ៊ឹង  អេង"
        },
        {
            "barcode": "171121274",
            "dpc": "03031431401",
            "name": "អ៊ឹង  អេង"
        },
        {
            "barcode": "171121275",
            "dpc": "03031432301",
            "name": "ដូ  គង់"
        },
        {
            "barcode": "171121276",
            "dpc": "03031433501",
            "name": "ឡុង  នី"
        },
        {
            "barcode": "171121277",
            "dpc": "03031438201",
            "name": "យិន  ប៊ុនឡុង"
        },
        {
            "barcode": "171121278",
            "dpc": "03031438301",
            "name": "ម៉ក់  ស៊ន"
        },
        {
            "barcode": "171121279",
            "dpc": "03031438401",
            "name": "ព្រំ  ចំរើន"
        },
        {
            "barcode": "171121280",
            "dpc": "03031438501",
            "name": "សុខ  លន់"
        },
        {
            "barcode": "171121281",
            "dpc": "03031438601",
            "name": "អ៊ឹង  វ៉ា"
        },
        {
            "barcode": "171121282",
            "dpc": "03031438901",
            "name": "លី  ស៊ុនហ"
        },
        {
            "barcode": "171121283",
            "dpc": "03031443301",
            "name": "សុខ  ចាន់"
        },
        {
            "barcode": "171121284",
            "dpc": "03031422301",
            "name": "លី  យូ"
        },
        {
            "barcode": "171121285",
            "dpc": "03031439801",
            "name": "សេង  ប្រាង"
        },
        {
            "barcode": "171121286",
            "dpc": "03031448001",
            "name": "គង់ លៀប"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
