let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171123004",
            "dpc": "03031507801",
            "name": "នូ  វេត"
        },
        {
            "barcode": "171123005",
            "dpc": "03031507701",
            "name": "សុខ  ឃាង"
        },
        {
            "barcode": "171123006",
            "dpc": "03031507601",
            "name": "អី  លី"
        },
        {
            "barcode": "171123007",
            "dpc": "03031507501",
            "name": "ហេង  គឹមនី"
        },
        {
            "barcode": "171123008",
            "dpc": "03031507401",
            "name": "ឱក គឹមចាន់"
        },
        {
            "barcode": "171123009",
            "dpc": "03031507301",
            "name": "ជិន  មឿន"
        },
        {
            "barcode": "171123010",
            "dpc": "03031507101",
            "name": "អូរ ម៉េងអ៊ារ"
        },
        {
            "barcode": "171123011",
            "dpc": "03031507001",
            "name": "ជួន  ម៉ាច"
        },
        {
            "barcode": "171123012",
            "dpc": "03031506801",
            "name": "ប៉ែន  ធី"
        },
        {
            "barcode": "171123013",
            "dpc": "03031506701",
            "name": "កឺ  ប៊ុនឡុង"
        },
        {
            "barcode": "171123014",
            "dpc": "03031506601",
            "name": "ផល  លីនាង"
        },
        {
            "barcode": "171123015",
            "dpc": "03031506501",
            "name": "សុខ  ណាវី"
        },
        {
            "barcode": "171123016",
            "dpc": "03031506401",
            "name": "ម៉ៅ  ទូច"
        },
        {
            "barcode": "171123017",
            "dpc": "03031506301",
            "name": "ជុន  ភក្តី"
        },
        {
            "barcode": "171123018",
            "dpc": "03031506201",
            "name": "សេង  ឡុង"
        },
        {
            "barcode": "171123019",
            "dpc": "03031506101",
            "name": "ជឹម  សុម៉ាលី"
        },
        {
            "barcode": "171123020",
            "dpc": "03031506001",
            "name": "អ៊ូ  វណ្ណា"
        },
        {
            "barcode": "171123021",
            "dpc": "03031505901",
            "name": "សេង ចាន់ដាវុធ"
        },
        {
            "barcode": "171123022",
            "dpc": "03031505801",
            "name": "សេង  ហ៊ាង"
        },
        {
            "barcode": "171123023",
            "dpc": "03031505701",
            "name": "ភុក  ជា"
        },
        {
            "barcode": "171123024",
            "dpc": "03031505601",
            "name": "ឡាំ  ហ៊ុល"
        },
        {
            "barcode": "171123025",
            "dpc": "03031505501",
            "name": "យ៉ង់  មាឌី"
        },
        {
            "barcode": "171123026",
            "dpc": "03031505401",
            "name": "ប៊ុន អេង"
        },
        {
            "barcode": "171123027",
            "dpc": "03031505301",
            "name": "ម៉េង  ពៅ"
        },
        {
            "barcode": "171123028",
            "dpc": "03031505201",
            "name": "ពឹង  ប៉ុក"
        },
        {
            "barcode": "171123029",
            "dpc": "03031505101",
            "name": "គឹម  ហ៊ាង"
        },
        {
            "barcode": "171123030",
            "dpc": "03031505001",
            "name": "អ៊ិន  ឡា ២"
        },
        {
            "barcode": "171123031",
            "dpc": "03031504901",
            "name": "ប៉ោ លីម"
        },
        {
            "barcode": "171123032",
            "dpc": "03031504801",
            "name": "ប៉ា  ដារា"
        },
        {
            "barcode": "171123033",
            "dpc": "03031504701",
            "name": "អ៊ូ  វណ្ណី"
        },
        {
            "barcode": "171123034",
            "dpc": "03031504601",
            "name": "យ៉ាង  អ៊ីអិញ"
        },
        {
            "barcode": "171123035",
            "dpc": "03031504501",
            "name": "ទឹម  ដន"
        },
        {
            "barcode": "171123036",
            "dpc": "03031504401",
            "name": "អៃ  ហ្គ្រិច"
        },
        {
            "barcode": "171123037",
            "dpc": "03031504201",
            "name": "ថោង  កញ្ញា"
        },
        {
            "barcode": "171123038",
            "dpc": "03031504101",
            "name": "ចាន់  ណាវី"
        },
        {
            "barcode": "171123039",
            "dpc": "03031504001",
            "name": "ឆេង  ស៊ីវ"
        },
        {
            "barcode": "171123040",
            "dpc": "03031503901",
            "name": "សុខ  សារិន"
        },
        {
            "barcode": "171123041",
            "dpc": "03031545401",
            "name": "ប៉ាន់ ង៉ែត"
        },
        {
            "barcode": "171123042",
            "dpc": "03031545301",
            "name": "ហឿន  ធួក"
        },
        {
            "barcode": "171123043",
            "dpc": "03031545201",
            "name": "ទ្រីញ ភាវ"
        },
        {
            "barcode": "171123044",
            "dpc": "03031545101",
            "name": "ម៉ុយ សេង"
        },
        {
            "barcode": "171123045",
            "dpc": "03031544901",
            "name": "ឃី ប៉ោឆាយ"
        },
        {
            "barcode": "171123046",
            "dpc": "03031544801",
            "name": "ធូ ញ៉េប"
        },
        {
            "barcode": "171123047",
            "dpc": "03031544701",
            "name": "សុខ វែង"
        },
        {
            "barcode": "171123048",
            "dpc": "03031544601",
            "name": "សាយ រក្សា"
        },
        {
            "barcode": "171123049",
            "dpc": "03031544501",
            "name": "សុភី វណ្ណី"
        },
        {
            "barcode": "171123050",
            "dpc": "03031544401",
            "name": "ប៉ោ សុភាព"
        },
        {
            "barcode": "171123051",
            "dpc": "03031544301",
            "name": "ឃុន ហេង"
        },
        {
            "barcode": "171123052",
            "dpc": "03031544201",
            "name": "ឃន ភារម្យ"
        },
        {
            "barcode": "171123053",
            "dpc": "03031544101",
            "name": "អ៊ុំ សារ៉ានាថ"
        },
        {
            "barcode": "171123054",
            "dpc": "03031544001",
            "name": "តាំង ប៊ុនណា"
        },
        {
            "barcode": "171123055",
            "dpc": "03031543901",
            "name": "ចាយ គា"
        },
        {
            "barcode": "171123056",
            "dpc": "03031543801",
            "name": "ឆាន់ ប៊ន"
        },
        {
            "barcode": "171123057",
            "dpc": "03031543701",
            "name": "ថាត់  យ៉ាងតាំ"
        },
        {
            "barcode": "171123058",
            "dpc": "03031543601",
            "name": "គឹម គាង"
        },
        {
            "barcode": "171123059",
            "dpc": "03031543501",
            "name": "ណៃ ផេង"
        },
        {
            "barcode": "171123060",
            "dpc": "03031543401",
            "name": "វង្ស កាំហ"
        },
        {
            "barcode": "171123061",
            "dpc": "03031543301",
            "name": "ម៉ូវ ប៊ូ"
        },
        {
            "barcode": "171123062",
            "dpc": "03031543201",
            "name": "ពិន ប៊ូ"
        },
        {
            "barcode": "171123063",
            "dpc": "03031543101",
            "name": "ប៉ោ ចន្ថា"
        },
        {
            "barcode": "171123064",
            "dpc": "03031543001",
            "name": "ជា សុផល"
        },
        {
            "barcode": "171123065",
            "dpc": "03031542901",
            "name": "ឌី ប៊ុនហ៊ាន"
        },
        {
            "barcode": "171123066",
            "dpc": "03031542801",
            "name": "សោរ ហួន"
        },
        {
            "barcode": "171123067",
            "dpc": "03031542701",
            "name": "អ៊ូច ចាន់រី"
        },
        {
            "barcode": "171123068",
            "dpc": "03031542601",
            "name": "ខឹម ហឿន"
        },
        {
            "barcode": "171123069",
            "dpc": "03031542501",
            "name": "ខឹម ទូច"
        },
        {
            "barcode": "171123070",
            "dpc": "03031542401",
            "name": "ឆន ឈឿង"
        },
        {
            "barcode": "171123071",
            "dpc": "03031542301",
            "name": "ភឹម គន"
        },
        {
            "barcode": "171123072",
            "dpc": "03031542201",
            "name": "ថេង ស្រូយ"
        },
        {
            "barcode": "171123073",
            "dpc": "03031542101",
            "name": "អ៊ឹង ឃាង"
        },
        {
            "barcode": "171123074",
            "dpc": "03031542001",
            "name": "សាន់ ហៃ"
        },
        {
            "barcode": "171123075",
            "dpc": "03031541901",
            "name": "ហ៊ុន បួយ"
        },
        {
            "barcode": "171123076",
            "dpc": "03031541801",
            "name": "ទាវ សៀម៉ី"
        },
        {
            "barcode": "171123077",
            "dpc": "03031541701",
            "name": "អ៊ុយ រី"
        },
        {
            "barcode": "171123078",
            "dpc": "03031541601",
            "name": "គី រី"
        },
        {
            "barcode": "171123079",
            "dpc": "03031541301",
            "name": "ហូយ ឡាំង"
        },
        {
            "barcode": "171123080",
            "dpc": "03031541201",
            "name": "ម៉ៅ ឆាយ"
        },
        {
            "barcode": "171123081",
            "dpc": "03031541101",
            "name": "លី ប៉ូទៀង"
        },
        {
            "barcode": "171123082",
            "dpc": "03031540901",
            "name": "សេង ហ៊ាង"
        },
        {
            "barcode": "171123083",
            "dpc": "03031540801",
            "name": "ទ្រី ហាក់"
        },
        {
            "barcode": "171123084",
            "dpc": "03031540701",
            "name": "តាន់ លួង"
        },
        {
            "barcode": "171123085",
            "dpc": "03031540601",
            "name": "យុក សឿង"
        },
        {
            "barcode": "171123086",
            "dpc": "03031540401",
            "name": "តាន់ សាន់"
        },
        {
            "barcode": "171123087",
            "dpc": "03031540201",
            "name": "ទេស សុខុនវិនី"
        },
        {
            "barcode": "171123088",
            "dpc": "03031540101",
            "name": "កែវ សំអាត"
        },
        {
            "barcode": "171123089",
            "dpc": "03031540001",
            "name": "សួន ពោយ"
        },
        {
            "barcode": "171123090",
            "dpc": "03031547901",
            "name": "កាយ ចាន់ថន"
        },
        {
            "barcode": "171123091",
            "dpc": "03031547801",
            "name": "អ៊ឹម សូថាយ"
        },
        {
            "barcode": "171123092",
            "dpc": "03031547701",
            "name": "ញ៉េប គឹមឈឿង"
        },
        {
            "barcode": "171123093",
            "dpc": "03031547601",
            "name": "កង សេត"
        },
        {
            "barcode": "171123094",
            "dpc": "03031547501",
            "name": "ឈ ជិត"
        },
        {
            "barcode": "171123095",
            "dpc": "03031547401",
            "name": "ជឹម សេង"
        },
        {
            "barcode": "171123096",
            "dpc": "03031547301",
            "name": "តាំង នី"
        },
        {
            "barcode": "171123097",
            "dpc": "03031547201",
            "name": "តាំង ទទី"
        },
        {
            "barcode": "171123098",
            "dpc": "03031547101",
            "name": "ម៉ាន់ ប៊ុន"
        },
        {
            "barcode": "171123099",
            "dpc": "03031547001",
            "name": "លី ស៊ុនហ"
        },
        {
            "barcode": "171123100",
            "dpc": "03031546901",
            "name": "យ៉ាង ស៊ីវសេង ១"
        },
        {
            "barcode": "171123101",
            "dpc": "03031546801",
            "name": "ជា សម្ភស្ស"
        },
        {
            "barcode": "171123102",
            "dpc": "03031546701",
            "name": "សា ម៉ូរ៉ាក់"
        },
        {
            "barcode": "171123103",
            "dpc": "03031546601",
            "name": "អ៊ូច សាត់"
        },
        {
            "barcode": "171123104",
            "dpc": "03031546501",
            "name": "ង៉ែត គិម"
        },
        {
            "barcode": "171123105",
            "dpc": "03031546401",
            "name": "ផាន់ សុវណ្ណរិទ្ធ"
        },
        {
            "barcode": "171123106",
            "dpc": "03031546301",
            "name": "ខឹម ហឿន"
        },
        {
            "barcode": "171123107",
            "dpc": "03031546201",
            "name": "យី គឹមអាង"
        },
        {
            "barcode": "171123108",
            "dpc": "03031546101",
            "name": "ឈាវ ងិត"
        },
        {
            "barcode": "171123109",
            "dpc": "03031546001",
            "name": "នុត ថុន"
        },
        {
            "barcode": "171123110",
            "dpc": "03031545901",
            "name": "ហ៊ុយ តុង"
        },
        {
            "barcode": "171123111",
            "dpc": "03031545801",
            "name": "វណ្ណ សុផេន"
        },
        {
            "barcode": "171123112",
            "dpc": "03031545701",
            "name": "ទូច វ៉ាន់"
        },
        {
            "barcode": "171123113",
            "dpc": "03031545601",
            "name": "សុខ គុជ"
        },
        {
            "barcode": "171123114",
            "dpc": "03031545501",
            "name": "លី ហាក់"
        },
        {
            "barcode": "171123115",
            "dpc": "03031507901",
            "name": "ង៉ូវ គា"
        },
        {
            "barcode": "171123116",
            "dpc": "03031508001",
            "name": "សិទ្ធ ងួនហាក់"
        },
        {
            "barcode": "171123117",
            "dpc": "03031508101",
            "name": "ខៀវ ងួនឡេង"
        },
        {
            "barcode": "171123118",
            "dpc": "03031508201",
            "name": "អ៊ឹង អេង"
        },
        {
            "barcode": "171123119",
            "dpc": "03031508301",
            "name": "ស ឌឿ"
        },
        {
            "barcode": "171123120",
            "dpc": "03031508401",
            "name": "ម៉ាច ប៊ុនហ៊ាញ"
        },
        {
            "barcode": "171123121",
            "dpc": "03031508501",
            "name": "ម៉េង លាភ"
        },
        {
            "barcode": "171123122",
            "dpc": "03031508601",
            "name": "នាង ង៉ា"
        },
        {
            "barcode": "171123123",
            "dpc": "03031508701",
            "name": "ចាន់ សារេត"
        },
        {
            "barcode": "171123124",
            "dpc": "03031508801",
            "name": "ងឹម ពៅ"
        },
        {
            "barcode": "171123125",
            "dpc": "03031508901",
            "name": "ឡាវ ស៊ីវលី"
        },
        {
            "barcode": "171123126",
            "dpc": "03031509201",
            "name": "សោម ឌួង"
        },
        {
            "barcode": "171123127",
            "dpc": "03031509001",
            "name": "សុខ ហាយ"
        },
        {
            "barcode": "171123128",
            "dpc": "03031509301",
            "name": "សំរិត វិចិត្រ"
        },
        {
            "barcode": "171123129",
            "dpc": "03031517101",
            "name": "ម៉ៅ  នាង"
        },
        {
            "barcode": "171123130",
            "dpc": "03031509401",
            "name": "ចាន់ មុំ"
        },
        {
            "barcode": "171123131",
            "dpc": "03031509501",
            "name": "ធិ សុខុម"
        },
        {
            "barcode": "171123132",
            "dpc": "03031509601",
            "name": "សេង សម្បត្តិ"
        },
        {
            "barcode": "171123133",
            "dpc": "03031509701",
            "name": "ថាច់ ចាន់ថន"
        },
        {
            "barcode": "171123134",
            "dpc": "03031509901",
            "name": "ចាន់ ហ៊ាន"
        },
        {
            "barcode": "171123135",
            "dpc": "03031510001",
            "name": "យឹម ហូរ"
        },
        {
            "barcode": "171123136",
            "dpc": "03031510101",
            "name": "ជា សុខណា"
        },
        {
            "barcode": "171123137",
            "dpc": "03031510201",
            "name": "យឹម សារុំ"
        },
        {
            "barcode": "171123138",
            "dpc": "03031510301",
            "name": "លឹម ហាក់"
        },
        {
            "barcode": "171123139",
            "dpc": "03031510401",
            "name": "អាង ទី"
        },
        {
            "barcode": "171123140",
            "dpc": "03031510501",
            "name": "កៅ ណារិទ្ធ"
        },
        {
            "barcode": "171123141",
            "dpc": "03031510701",
            "name": "តាំង ហៀង"
        },
        {
            "barcode": "171123142",
            "dpc": "03031510801",
            "name": "ចាន់ លាង"
        },
        {
            "barcode": "171123143",
            "dpc": "03031510901",
            "name": "ឆេង ហ៊ាង"
        },
        {
            "barcode": "171123144",
            "dpc": "03031511001",
            "name": "ពេជ្រ តិចស៊្រុន"
        },
        {
            "barcode": "171123145",
            "dpc": "03031511101",
            "name": "ទេព ប៊ុនតុង"
        },
        {
            "barcode": "171123146",
            "dpc": "03031511301",
            "name": "លឹម ហ៊ត"
        },
        {
            "barcode": "171123147",
            "dpc": "03031511401",
            "name": "គុយ ទ្រី"
        },
        {
            "barcode": "171123148",
            "dpc": "03031511501",
            "name": "ប៉ុល សារី"
        },
        {
            "barcode": "171123149",
            "dpc": "03031511601",
            "name": "ស៊ីវ  គង់"
        },
        {
            "barcode": "171123150",
            "dpc": "03031511201",
            "name": "ចេង ហួន"
        },
        {
            "barcode": "171123151",
            "dpc": "03031511701",
            "name": "គង់ នី"
        },
        {
            "barcode": "171123152",
            "dpc": "03031511901",
            "name": "ថៃ បាក់លីវ"
        },
        {
            "barcode": "171123153",
            "dpc": "03031512001",
            "name": "សួន សាយ"
        },
        {
            "barcode": "171123154",
            "dpc": "03031512101",
            "name": "មិន សុខខេង"
        },
        {
            "barcode": "171123155",
            "dpc": "03031512301",
            "name": "សាន់  ឃាង"
        },
        {
            "barcode": "171123156",
            "dpc": "03031512401",
            "name": "សុខ ហូ"
        },
        {
            "barcode": "171123157",
            "dpc": "03031512501",
            "name": "គី សៀកហួរ"
        },
        {
            "barcode": "171123158",
            "dpc": "03031512601",
            "name": "ចាន់ ហ៊ាញ"
        },
        {
            "barcode": "171123159",
            "dpc": "03031512701",
            "name": "ញ៉ែម ហឿន"
        },
        {
            "barcode": "171123160",
            "dpc": "03031512801",
            "name": "ប៊ុន សេង"
        },
        {
            "barcode": "171123161",
            "dpc": "03031512901",
            "name": "ពត សុត"
        },
        {
            "barcode": "171123162",
            "dpc": "03031513001",
            "name": "ឆាន់ ហាក់"
        },
        {
            "barcode": "171123163",
            "dpc": "03031513101",
            "name": "ឆាន់ ឈឿង"
        },
        {
            "barcode": "171123164",
            "dpc": "03031513201",
            "name": "សុខ លី"
        },
        {
            "barcode": "171123165",
            "dpc": "03031513301",
            "name": "គង់ សុខម៉េង"
        },
        {
            "barcode": "171123166",
            "dpc": "03031513401",
            "name": "តាំង រុនឌី"
        },
        {
            "barcode": "171123167",
            "dpc": "03031513501",
            "name": "អៀរ ហៀង"
        },
        {
            "barcode": "171123168",
            "dpc": "03031513601",
            "name": "ទេព រិទ្ធី"
        },
        {
            "barcode": "171123169",
            "dpc": "03031513701",
            "name": "ហោ ឃាង"
        },
        {
            "barcode": "171123170",
            "dpc": "03031513801",
            "name": "វ៉ាន់ ថូង"
        },
        {
            "barcode": "171123171",
            "dpc": "03031513901",
            "name": "ស៊ឹម វ៉ាត់"
        },
        {
            "barcode": "171123172",
            "dpc": "03031514001",
            "name": "វ៉ាត ធា"
        },
        {
            "barcode": "171123173",
            "dpc": "03031514101",
            "name": "លី ពិសិដ្ឋ"
        },
        {
            "barcode": "171123174",
            "dpc": "03031514201",
            "name": "អ៊ុត មួយ"
        },
        {
            "barcode": "171123175",
            "dpc": "03031514301",
            "name": "សោម រ៉ានី"
        },
        {
            "barcode": "171123176",
            "dpc": "03031514401",
            "name": "យ៉ាន់ សំអូន"
        },
        {
            "barcode": "171123177",
            "dpc": "03031514501",
            "name": "តាន់ គឹមសុន"
        },
        {
            "barcode": "171123178",
            "dpc": "03031514601",
            "name": "ម៉ៅ ខេន"
        },
        {
            "barcode": "171123179",
            "dpc": "03031514801",
            "name": "សុខ ឃឿន"
        },
        {
            "barcode": "171123180",
            "dpc": "03031514701",
            "name": "ឃាន សំណាង"
        },
        {
            "barcode": "171123181",
            "dpc": "03031514901",
            "name": "អ៊ុន ឈឿន"
        },
        {
            "barcode": "171123182",
            "dpc": "03031515001",
            "name": "សេ ស៊ីឡាដា"
        },
        {
            "barcode": "171123183",
            "dpc": "03031515201",
            "name": "ឃី សុផា ២"
        },
        {
            "barcode": "171123184",
            "dpc": "03031515301",
            "name": "ទិត្យ រ៉ា"
        },
        {
            "barcode": "171123185",
            "dpc": "03031515401",
            "name": "អ៊ឹង ឡឹមហ៊ី"
        },
        {
            "barcode": "171123186",
            "dpc": "03031515501",
            "name": "គា សាម៉ន"
        },
        {
            "barcode": "171123187",
            "dpc": "03031515601",
            "name": "សុវណ្ណ សាវ៉ាន់រ៉ាន់"
        },
        {
            "barcode": "171123188",
            "dpc": "03031515701",
            "name": "ទ្រី សាមិត្ត"
        },
        {
            "barcode": "171123189",
            "dpc": "03031516001",
            "name": "ម៉េង ចាន់ថន"
        },
        {
            "barcode": "171123190",
            "dpc": "03031515901",
            "name": "ដែង សាវឿត"
        },
        {
            "barcode": "171123191",
            "dpc": "03031515801",
            "name": "ឡុង សារ៉េត"
        },
        {
            "barcode": "171123192",
            "dpc": "03031516101",
            "name": "អ៊ិត គឹមស្រ៊ុន"
        },
        {
            "barcode": "171123193",
            "dpc": "03031516201",
            "name": "យស សុខមាន"
        },
        {
            "barcode": "171123194",
            "dpc": "03031516301",
            "name": "ស្វាយ  ភីរម្យ"
        },
        {
            "barcode": "171123195",
            "dpc": "03031516401",
            "name": "វ៉ែន ទូច"
        },
        {
            "barcode": "171123196",
            "dpc": "03031516501",
            "name": "វ៉ឹង វុទ្ធី"
        },
        {
            "barcode": "171123197",
            "dpc": "03031516601",
            "name": "ណាល់ ជិនណា"
        },
        {
            "barcode": "171123198",
            "dpc": "03031516701",
            "name": "ពុធ គ្រឿន"
        },
        {
            "barcode": "171123199",
            "dpc": "03031516801",
            "name": "ហៀង លីវ"
        },
        {
            "barcode": "171123200",
            "dpc": "03031516901",
            "name": "សោម ផានី"
        },
        {
            "barcode": "171123201",
            "dpc": "03031517001",
            "name": "តេង សុខា"
        },
        {
            "barcode": "171123202",
            "dpc": "03031517201",
            "name": "អ៊ាម ស៊"
        },
        {
            "barcode": "171123203",
            "dpc": "03031517301",
            "name": "តែង ស៊ីវអេង"
        },
        {
            "barcode": "171123204",
            "dpc": "03031517401",
            "name": "ឈន ហ៊ុន"
        },
        {
            "barcode": "171123205",
            "dpc": "03031517501",
            "name": "នង ឃីម"
        },
        {
            "barcode": "171123206",
            "dpc": "03031517601",
            "name": "លិញ ម៉ាលីស"
        },
        {
            "barcode": "171123207",
            "dpc": "03031517701",
            "name": "លិញ ទៀន"
        },
        {
            "barcode": "171123208",
            "dpc": "03031517801",
            "name": "ស៊ុយ លី"
        },
        {
            "barcode": "171123209",
            "dpc": "03031517901",
            "name": "ប៉ាន ធានី"
        },
        {
            "barcode": "171123210",
            "dpc": "03031518001",
            "name": "ថន ប៊ុនធឿន"
        },
        {
            "barcode": "171123211",
            "dpc": "03031518101",
            "name": "គឹម អេង"
        },
        {
            "barcode": "171123212",
            "dpc": "03031518201",
            "name": "ឆេង សខហៀង"
        },
        {
            "barcode": "171123213",
            "dpc": "03031518301",
            "name": "ថែម លី"
        },
        {
            "barcode": "171123214",
            "dpc": "03031518401",
            "name": "ចាប ប៊ុតគឹមលីស"
        },
        {
            "barcode": "171123215",
            "dpc": "03031518501",
            "name": "ម៉ៅ ប៊ុនធៀន"
        },
        {
            "barcode": "171123216",
            "dpc": "03031518601",
            "name": "លី ម៉េង"
        },
        {
            "barcode": "171123217",
            "dpc": "03031539901",
            "name": "ឡៃ ហ៊ាង"
        },
        {
            "barcode": "171123218",
            "dpc": "03031539801",
            "name": "អ៊ុន សាលី"
        },
        {
            "barcode": "171123219",
            "dpc": "03031539701",
            "name": "ឡៅ ជី"
        },
        {
            "barcode": "171123220",
            "dpc": "03031539601",
            "name": "តា លាង"
        },
        {
            "barcode": "171123221",
            "dpc": "03031539501",
            "name": "ញឹក សុធី"
        },
        {
            "barcode": "171123222",
            "dpc": "03031539401",
            "name": "ហូ ប៉ុក"
        },
        {
            "barcode": "171123223",
            "dpc": "03031539301",
            "name": "ង៉ោ ជឹងឈុន"
        },
        {
            "barcode": "171123224",
            "dpc": "03031539001",
            "name": "អ៊ឹង ឡៃហុក"
        },
        {
            "barcode": "171123225",
            "dpc": "03031538901",
            "name": "ប៉ោ ស៊ីមឡី"
        },
        {
            "barcode": "171123226",
            "dpc": "03031538801",
            "name": "ប្រាក់ គឹមឡាយ"
        },
        {
            "barcode": "171123227",
            "dpc": "03031538701",
            "name": "ឱ  សុថ"
        },
        {
            "barcode": "171123228",
            "dpc": "03031538601",
            "name": "ថោង សុខា"
        },
        {
            "barcode": "171123229",
            "dpc": "03031538501",
            "name": "ប្រាក់ ស៊ីម"
        },
        {
            "barcode": "171123230",
            "dpc": "03031538401",
            "name": "ជា ចាន់"
        },
        {
            "barcode": "171123231",
            "dpc": "03031538301",
            "name": "ឈុន ហាក់"
        },
        {
            "barcode": "171123232",
            "dpc": "03031538201",
            "name": "សាន កុសល"
        },
        {
            "barcode": "171123233",
            "dpc": "03031538101",
            "name": "វ៉ាន់  វុត្ថា"
        },
        {
            "barcode": "171123234",
            "dpc": "03031538001",
            "name": "តាំង  យ៉ាវ"
        },
        {
            "barcode": "171123235",
            "dpc": "03031537901",
            "name": "ឌី កេង"
        },
        {
            "barcode": "171123236",
            "dpc": "03031537701",
            "name": "ជា អ៊ុល"
        },
        {
            "barcode": "171123237",
            "dpc": "03031536401",
            "name": "មិន ហៃ"
        },
        {
            "barcode": "171123238",
            "dpc": "03031536301",
            "name": "សោ ម៉េងហ៊ាង"
        },
        {
            "barcode": "171123239",
            "dpc": "03031536201",
            "name": "សុខ លី"
        },
        {
            "barcode": "171123240",
            "dpc": "03031536101",
            "name": "ស៊ុន ជឿន"
        },
        {
            "barcode": "171123241",
            "dpc": "03031536001",
            "name": "ស៊ូ ចក់"
        },
        {
            "barcode": "171123242",
            "dpc": "03031535901",
            "name": "ខ្លូត ហ៊ុយហេង"
        },
        {
            "barcode": "171123243",
            "dpc": "03031535801",
            "name": "គួច ហៃ"
        },
        {
            "barcode": "171123244",
            "dpc": "03031535701",
            "name": "ហេង ប៊ុនផាន"
        },
        {
            "barcode": "171123245",
            "dpc": "03031535601",
            "name": "តាំង គី"
        },
        {
            "barcode": "171123246",
            "dpc": "03031535501",
            "name": "គឹម ឡា"
        },
        {
            "barcode": "171123247",
            "dpc": "03031535401",
            "name": "អ៊ុច អាំង"
        },
        {
            "barcode": "171123248",
            "dpc": "03031535301",
            "name": "ម៉ម ពន្លក ១"
        },
        {
            "barcode": "171123249",
            "dpc": "03031535201",
            "name": "គាំ ពៅ"
        },
        {
            "barcode": "171123250",
            "dpc": "03031535101",
            "name": "ចែវ គឹមវ៉ា"
        },
        {
            "barcode": "171123251",
            "dpc": "03031535001",
            "name": "ព្រឿម សាវឿត"
        },
        {
            "barcode": "171123252",
            "dpc": "03031534901",
            "name": "ចាន់ មុំ"
        },
        {
            "barcode": "171123253",
            "dpc": "03031534801",
            "name": "ប្រាង្គ តាយ"
        },
        {
            "barcode": "171123254",
            "dpc": "03031534701",
            "name": "ទន់ សារុន"
        },
        {
            "barcode": "171123255",
            "dpc": "03031534601",
            "name": "កង នី"
        },
        {
            "barcode": "171123256",
            "dpc": "03031534501",
            "name": "អ៊ុក វណ្ណា"
        },
        {
            "barcode": "171123257",
            "dpc": "03031534401",
            "name": "ប៉ិច គឹមស៊"
        },
        {
            "barcode": "171123258",
            "dpc": "03031534301",
            "name": "ជុក ឡុង"
        },
        {
            "barcode": "171123259",
            "dpc": "03031534101",
            "name": "អ៊ុន ហ្សាលី"
        },
        {
            "barcode": "171123260",
            "dpc": "03031534001",
            "name": "លី ហូយ"
        },
        {
            "barcode": "171123261",
            "dpc": "03031533901",
            "name": "ឃី ណារិន"
        },
        {
            "barcode": "171123262",
            "dpc": "03031533801",
            "name": "គុយ ហួត"
        },
        {
            "barcode": "171123263",
            "dpc": "03031533701",
            "name": "ខូវ ហ៊ុយប៉ិ"
        },
        {
            "barcode": "171123264",
            "dpc": "03031533601",
            "name": "ថាច់ បូរិន"
        },
        {
            "barcode": "171123265",
            "dpc": "03031533501",
            "name": "អ៊ឹង ឡៃហ៊ត"
        },
        {
            "barcode": "171123266",
            "dpc": "03031533401",
            "name": "អ៊ុន ចំរើន"
        },
        {
            "barcode": "171123267",
            "dpc": "03031533301",
            "name": "ញិល ស៊ន"
        },
        {
            "barcode": "171123268",
            "dpc": "03031533201",
            "name": "លន់ អេង"
        },
        {
            "barcode": "171123269",
            "dpc": "03031533101",
            "name": "ធូ ហៃ"
        },
        {
            "barcode": "171123270",
            "dpc": "03031533001",
            "name": "តុង លីហួរ"
        },
        {
            "barcode": "171123271",
            "dpc": "03031532901",
            "name": "ជុំ រតនា"
        },
        {
            "barcode": "171123272",
            "dpc": "03031532801",
            "name": "គង់ សំណាង"
        },
        {
            "barcode": "171123273",
            "dpc": "03031532701",
            "name": "វ៉ែន ទិត្យ"
        },
        {
            "barcode": "171123274",
            "dpc": "03031537101",
            "name": "សឿន លី"
        },
        {
            "barcode": "171123275",
            "dpc": "03031537001",
            "name": "លឹម ហួន"
        },
        {
            "barcode": "171123276",
            "dpc": "03031536901",
            "name": "ភឿន ណូក"
        },
        {
            "barcode": "171123277",
            "dpc": "03031536801",
            "name": "អ៊ុក វណ្ណា"
        },
        {
            "barcode": "171123278",
            "dpc": "03031536501",
            "name": "លី សុង"
        },
        {
            "barcode": "171123279",
            "dpc": "03031536601",
            "name": "កែវ ប៊ុនឆន"
        },
        {
            "barcode": "171123280",
            "dpc": "03031536701",
            "name": "លី សាំងអូន"
        },
        {
            "barcode": "171123281",
            "dpc": "03031537601",
            "name": "លី សម្បត្តិ"
        },
        {
            "barcode": "171123282",
            "dpc": "03031537501",
            "name": "ជង់ ធឿង"
        },
        {
            "barcode": "171123283",
            "dpc": "03031532201",
            "name": "ស៊ុយ ពៅ"
        },
        {
            "barcode": "171123284",
            "dpc": "03031537401",
            "name": "ឃិន សាន"
        },
        {
            "barcode": "171123285",
            "dpc": "03031537301",
            "name": "ឃិន ជូ"
        },
        {
            "barcode": "171123286",
            "dpc": "03031537201",
            "name": "ប៊ុន ឈីញ"
        },
        {
            "barcode": "171123287",
            "dpc": "03031532601",
            "name": "អិត ផល្លី"
        },
        {
            "barcode": "171123288",
            "dpc": "03031532501",
            "name": "យី សាបាន"
        },
        {
            "barcode": "171123289",
            "dpc": "03031532401",
            "name": "ឆាន់ ភុយ"
        },
        {
            "barcode": "171123290",
            "dpc": "03031532301",
            "name": "សេង អ៊ន"
        },
        {
            "barcode": "171123291",
            "dpc": "03031532101",
            "name": "សៀម ទៀង"
        },
        {
            "barcode": "171123292",
            "dpc": "03031532001",
            "name": "ជុំ គឹមអុ"
        },
        {
            "barcode": "171123293",
            "dpc": "03031531901",
            "name": "អ៊ឹង ម៉ែង"
        },
        {
            "barcode": "171123294",
            "dpc": "03031531701",
            "name": "សម សុវណ្ណ"
        },
        {
            "barcode": "171123295",
            "dpc": "03031531501",
            "name": "ឡាយ ស៊"
        },
        {
            "barcode": "171123296",
            "dpc": "03031531401",
            "name": "អោក អៀង"
        },
        {
            "barcode": "171123297",
            "dpc": "03031531301",
            "name": "អ៊ួច យ៉ន"
        },
        {
            "barcode": "171123298",
            "dpc": "03031527201",
            "name": "ម៉េង លាង"
        },
        {
            "barcode": "171123299",
            "dpc": "03031527301",
            "name": "សេង វណ្ណី"
        },
        {
            "barcode": "171123300",
            "dpc": "03031527401",
            "name": "លី ម៉េងហ៊ី"
        },
        {
            "barcode": "171123301",
            "dpc": "03031527501",
            "name": "កែវ លី"
        },
        {
            "barcode": "171123302",
            "dpc": "03031527601",
            "name": "ប៉ៅ ណៃ"
        },
        {
            "barcode": "171123303",
            "dpc": "03031527701",
            "name": "ឆេ សាន"
        },
        {
            "barcode": "171123304",
            "dpc": "03031527801",
            "name": "អេង លី ១"
        },
        {
            "barcode": "171123305",
            "dpc": "03031527901",
            "name": "ជន យ៉ម"
        },
        {
            "barcode": "171123306",
            "dpc": "03031528001",
            "name": "តែ ហន"
        },
        {
            "barcode": "171123307",
            "dpc": "03031528101",
            "name": "ពៅ វ៉ាន់ថា"
        },
        {
            "barcode": "171123308",
            "dpc": "03031528201",
            "name": "លឹម គឹមសាន"
        },
        {
            "barcode": "171123309",
            "dpc": "03031528301",
            "name": "អេង លី ២"
        },
        {
            "barcode": "171123310",
            "dpc": "03031528401",
            "name": "ពិន សង្គមឧត្តម"
        },
        {
            "barcode": "171123311",
            "dpc": "03031528501",
            "name": "ស៊ីវ ឃួងប៉ោ"
        },
        {
            "barcode": "171123312",
            "dpc": "03031528601",
            "name": "ចៅ មួយ"
        },
        {
            "barcode": "171123313",
            "dpc": "03031528701",
            "name": "ព្រុំ រដ្ឋា"
        },
        {
            "barcode": "171123314",
            "dpc": "03031528801",
            "name": "ដាញ់ អេងប៊ុនវ៉ាន់"
        },
        {
            "barcode": "171123315",
            "dpc": "03031528901",
            "name": "សេង លៀប"
        },
        {
            "barcode": "171123316",
            "dpc": "03031529001",
            "name": "ទេព ថាវី"
        },
        {
            "barcode": "171123317",
            "dpc": "03031529101",
            "name": "តែ ឡាង"
        },
        {
            "barcode": "171123318",
            "dpc": "03031529201",
            "name": "អែល ស្រ៊ុន"
        },
        {
            "barcode": "171123319",
            "dpc": "03031529301",
            "name": "យូ  សំអុល"
        },
        {
            "barcode": "171123320",
            "dpc": "03031529601",
            "name": "តែម  វុន"
        },
        {
            "barcode": "171123321",
            "dpc": "03031529701",
            "name": "សាន ស៊ីម៉ៃ"
        },
        {
            "barcode": "171123322",
            "dpc": "03031529901",
            "name": "ចាប ទៀង"
        },
        {
            "barcode": "171123323",
            "dpc": "03031530001",
            "name": "ទាវ តុប"
        },
        {
            "barcode": "171123324",
            "dpc": "03031530101",
            "name": "លី ហួយ"
        },
        {
            "barcode": "171123325",
            "dpc": "03031530201",
            "name": "យឿម ថេង"
        },
        {
            "barcode": "171123326",
            "dpc": "03031530301",
            "name": "តាំង លីម"
        },
        {
            "barcode": "171123327",
            "dpc": "03031530401",
            "name": "ជុំ ធុនណា"
        },
        {
            "barcode": "171123328",
            "dpc": "03031530501",
            "name": "ផន គឹមកែវ"
        },
        {
            "barcode": "171123329",
            "dpc": "03031530601",
            "name": "សេង ថា"
        },
        {
            "barcode": "171123330",
            "dpc": "03031530801",
            "name": "ហុង  ជីហៃ"
        },
        {
            "barcode": "171123331",
            "dpc": "03031530701",
            "name": "គង់ យឿត"
        },
        {
            "barcode": "171123332",
            "dpc": "03031530901",
            "name": "ជុំ ពិទាក់"
        },
        {
            "barcode": "171123333",
            "dpc": "03031531001",
            "name": "ខាត់ ប៊ុនទៀង"
        },
        {
            "barcode": "171123334",
            "dpc": "03031531201",
            "name": "ភោគ  រិទ្ធា"
        },
        {
            "barcode": "171123335",
            "dpc": "03031531101",
            "name": "សាលាបឋមសិក្សា ទួលតាឯក"
        },
        {
            "barcode": "171123336",
            "dpc": "03031525401",
            "name": "សឹម ហៃ"
        },
        {
            "barcode": "171123337",
            "dpc": "03031525501",
            "name": "លី ឃឿង"
        },
        {
            "barcode": "171123338",
            "dpc": "03031525601",
            "name": "ម៉េង ឆវី"
        },
        {
            "barcode": "171123339",
            "dpc": "03031518701",
            "name": "អ៊ុំ កុលរ៉េណែល"
        },
        {
            "barcode": "171123340",
            "dpc": "03031518801",
            "name": "អូច សម្បត្តិ"
        },
        {
            "barcode": "171123341",
            "dpc": "03031518901",
            "name": "ភូ ជុំតា"
        },
        {
            "barcode": "171123342",
            "dpc": "03031519001",
            "name": "ប៊ុន ណាក់"
        },
        {
            "barcode": "171123343",
            "dpc": "03031519101",
            "name": "ជុំ សៅហីណែត"
        },
        {
            "barcode": "171123344",
            "dpc": "03031519201",
            "name": "អោក ប៊ុនធឿន"
        },
        {
            "barcode": "171123345",
            "dpc": "03031519301",
            "name": "ទឹម បំរ៉ុង"
        },
        {
            "barcode": "171123346",
            "dpc": "03031519401",
            "name": "ឈឹម ប៊ុនឆន"
        },
        {
            "barcode": "171123347",
            "dpc": "03031519501",
            "name": "ធុង សាខន"
        },
        {
            "barcode": "171123348",
            "dpc": "03031519601",
            "name": "ឥន រ៉ាលីន"
        },
        {
            "barcode": "171123349",
            "dpc": "03031519701",
            "name": "កែវ សំអាន"
        },
        {
            "barcode": "171123350",
            "dpc": "03031519801",
            "name": "ដួង ភឿប"
        },
        {
            "barcode": "171123351",
            "dpc": "03031519901",
            "name": "កេត ចន្ទូ"
        },
        {
            "barcode": "171123352",
            "dpc": "03031520001",
            "name": "ស៊ុន ដារ៉ា"
        },
        {
            "barcode": "171123353",
            "dpc": "03031520101",
            "name": "កែម ចាន់ថុល"
        },
        {
            "barcode": "171123354",
            "dpc": "03031520201",
            "name": "នង ភីនាម"
        },
        {
            "barcode": "171123355",
            "dpc": "03031520601",
            "name": "ម៉ក់ ចំរើន"
        },
        {
            "barcode": "171123356",
            "dpc": "03031520701",
            "name": "សាន់ ឆប"
        },
        {
            "barcode": "171123357",
            "dpc": "03031520801",
            "name": "ឡុច លឿត"
        },
        {
            "barcode": "171123358",
            "dpc": "03031520901",
            "name": "ឈុត ណារ៉ុត"
        },
        {
            "barcode": "171123359",
            "dpc": "03031521001",
            "name": "ជា សាវឿន"
        },
        {
            "barcode": "171123360",
            "dpc": "03031521101",
            "name": "ហេង ស៊ីហា"
        },
        {
            "barcode": "171123361",
            "dpc": "03031521201",
            "name": "សែន សុភាព"
        },
        {
            "barcode": "171123362",
            "dpc": "03031526301",
            "name": "អ៊ុន សាខន"
        },
        {
            "barcode": "171123363",
            "dpc": "03031526401",
            "name": "មាស ឡុង"
        },
        {
            "barcode": "171123364",
            "dpc": "03031527101",
            "name": "ទុំ សុធាន"
        },
        {
            "barcode": "171123365",
            "dpc": "03031527001",
            "name": "នាង ស៊ីណា"
        },
        {
            "barcode": "171123366",
            "dpc": "03031526901",
            "name": "ញ៉ែម រ៉ែន"
        },
        {
            "barcode": "171123367",
            "dpc": "03031526701",
            "name": "វន ហ៊ីម"
        },
        {
            "barcode": "171123368",
            "dpc": "03031526801",
            "name": "យ៉ាត យឿន"
        },
        {
            "barcode": "171123369",
            "dpc": "03031526501",
            "name": "នុត ស្រីស្រស់"
        },
        {
            "barcode": "171123370",
            "dpc": "03031526601",
            "name": "ជន គឹមគ្រី"
        },
        {
            "barcode": "171123371",
            "dpc": "03031525901",
            "name": "ប៊ិន ថាវ"
        },
        {
            "barcode": "171123372",
            "dpc": "03031522101",
            "name": "សុខ ណារិទ្ធ"
        },
        {
            "barcode": "171123373",
            "dpc": "03031522001",
            "name": "គិត សុខូ"
        },
        {
            "barcode": "171123374",
            "dpc": "03031522201",
            "name": "កែវ សុភាព"
        },
        {
            "barcode": "171123375",
            "dpc": "03031522301",
            "name": "ចាន់ ហោល"
        },
        {
            "barcode": "171123376",
            "dpc": "03031522401",
            "name": "សៀវ តៀវ"
        },
        {
            "barcode": "171123377",
            "dpc": "03031522601",
            "name": "យូ ដេត"
        },
        {
            "barcode": "171123378",
            "dpc": "03031522801",
            "name": "កែវ ពិសិដ្ឋ"
        },
        {
            "barcode": "171123379",
            "dpc": "03031522701",
            "name": "លឹម ស៊ីណាត"
        },
        {
            "barcode": "171123380",
            "dpc": "03031522901",
            "name": "ដេត សាឃុន"
        },
        {
            "barcode": "171123381",
            "dpc": "03031523101",
            "name": "ឈឹម នូ"
        },
        {
            "barcode": "171123382",
            "dpc": "03031523201",
            "name": "ម៉ែន រដ្ឋា"
        },
        {
            "barcode": "171123383",
            "dpc": "03031523301",
            "name": "ញ៉ែម ប៊ុនសេង"
        },
        {
            "barcode": "171123384",
            "dpc": "03031523401",
            "name": "ថំ ហួរ"
        },
        {
            "barcode": "171123385",
            "dpc": "03031523501",
            "name": "គុជ ផាន់"
        },
        {
            "barcode": "171123386",
            "dpc": "03031523601",
            "name": "តែ ស៊ីណា"
        },
        {
            "barcode": "171123387",
            "dpc": "03031523801",
            "name": "តាំង ហួង"
        },
        {
            "barcode": "171123388",
            "dpc": "03031523901",
            "name": "ញិប សាវឿន"
        },
        {
            "barcode": "171123389",
            "dpc": "03031524001",
            "name": "ហេង វើន"
        },
        {
            "barcode": "171123390",
            "dpc": "03031524101",
            "name": "គង់ ចេង"
        },
        {
            "barcode": "171123391",
            "dpc": "03031524201",
            "name": "ចាន់ ហ៊ង"
        },
        {
            "barcode": "171123392",
            "dpc": "03031524301",
            "name": "ទេស ចន្ថា"
        },
        {
            "barcode": "171123393",
            "dpc": "03031524401",
            "name": "ប៉ែន តារា"
        },
        {
            "barcode": "171123394",
            "dpc": "03031524501",
            "name": "តេង ប៉ាន់"
        },
        {
            "barcode": "171123395",
            "dpc": "03031524601",
            "name": "ចិន មុំ"
        },
        {
            "barcode": "171123396",
            "dpc": "03031524701",
            "name": "លេខ វន"
        },
        {
            "barcode": "171123397",
            "dpc": "03031524801",
            "name": "មាស រិទ្ធ"
        },
        {
            "barcode": "171123398",
            "dpc": "03031524901",
            "name": "ម៉ាក ទន"
        },
        {
            "barcode": "171123399",
            "dpc": "03031525001",
            "name": "ថេ ដារ៉ា"
        },
        {
            "barcode": "171123400",
            "dpc": "03031525101",
            "name": "ចាន់ វណ្ណាលឿម"
        },
        {
            "barcode": "171123401",
            "dpc": "03031525201",
            "name": "ឡៃ គឹមឡេង"
        },
        {
            "barcode": "171123402",
            "dpc": "03031523001",
            "name": "អ៊ឹម សំអន"
        },
        {
            "barcode": "171123403",
            "dpc": "03031509101",
            "name": "ឡាប  អេង"
        },
        {
            "barcode": "171123404",
            "dpc": "03031521301",
            "name": "លី  ហ៊ាន"
        },
        {
            "barcode": "171123405",
            "dpc": "03031521401",
            "name": "ប៉ុក  ឈិត"
        },
        {
            "barcode": "171123406",
            "dpc": "03031521501",
            "name": "ឡុង  កឹមនី"
        },
        {
            "barcode": "171123407",
            "dpc": "03031521601",
            "name": "ម៉ី  វុន"
        },
        {
            "barcode": "171123408",
            "dpc": "03031521701",
            "name": "កំរិត  អូន"
        },
        {
            "barcode": "171123409",
            "dpc": "03031521801",
            "name": "ទេស  ហ៊ាញ"
        },
        {
            "barcode": "171123410",
            "dpc": "03031521901",
            "name": "ងួន  សុទ្ធី"
        },
        {
            "barcode": "171123411",
            "dpc": "03031525301",
            "name": "ប្រាក់  គឹមឡាយ"
        },
        {
            "barcode": "171123412",
            "dpc": "03031525801",
            "name": "រស  សុខុម"
        },
        {
            "barcode": "171123413",
            "dpc": "03031526001",
            "name": "ឌុច  យ៉េន"
        },
        {
            "barcode": "171123414",
            "dpc": "03031526201",
            "name": "សូត្រ  សុខសាន"
        },
        {
            "barcode": "171123415",
            "dpc": "03031529401",
            "name": "អ៊ឹម  វណ្ណី"
        },
        {
            "barcode": "171123416",
            "dpc": "03031529501",
            "name": "រ៉ម  សុវណ្ណ"
        },
        {
            "barcode": "171123417",
            "dpc": "03031531601",
            "name": "តាន់  សុខរ័ត្ន"
        },
        {
            "barcode": "171123418",
            "dpc": "03031540301",
            "name": "ទួន  ភឿន"
        },
        {
            "barcode": "171123419",
            "dpc": "03031540501",
            "name": "ជូរ  គង់"
        },
        {
            "barcode": "171123420",
            "dpc": "03031541001",
            "name": "ធៀម  ទ្រី"
        },
        {
            "barcode": "171123421",
            "dpc": "03031545001",
            "name": "នៅ  សែ"
        },
        {
            "barcode": "171123422",
            "dpc": "03031500101",
            "name": "ហេង គឹមនី"
        },
        {
            "barcode": "171123423",
            "dpc": "03031500201",
            "name": "សុខ ចាន់"
        },
        {
            "barcode": "171123424",
            "dpc": "03031500301",
            "name": "ស៊ឹម ម៉ារ៉ា"
        },
        {
            "barcode": "171123425",
            "dpc": "03031500401",
            "name": "សុង ហ៊ុងស៊ុយ"
        },
        {
            "barcode": "171123426",
            "dpc": "03031500501",
            "name": "ឡាយ កៅ"
        },
        {
            "barcode": "171123427",
            "dpc": "03031500601",
            "name": "ណាំ ហៃ"
        },
        {
            "barcode": "171123428",
            "dpc": "03031500701",
            "name": "លឹម ឈុនងៀង"
        },
        {
            "barcode": "171123429",
            "dpc": "03031500801",
            "name": "តែង តេង"
        },
        {
            "barcode": "171123430",
            "dpc": "03031500901",
            "name": "តាំង គុយម៉េង"
        },
        {
            "barcode": "171123431",
            "dpc": "03031501001",
            "name": "ម៉ម ណារេត"
        },
        {
            "barcode": "171123432",
            "dpc": "03031501501",
            "name": "ហួយ ចន្ធី"
        },
        {
            "barcode": "171123433",
            "dpc": "03031501401",
            "name": "តាំង កាំង ៣"
        },
        {
            "barcode": "171123434",
            "dpc": "03031501301",
            "name": "តាំង កាំង ២"
        },
        {
            "barcode": "171123435",
            "dpc": "03031501101",
            "name": "ប៉ាន់ យូសែ"
        },
        {
            "barcode": "171123436",
            "dpc": "03031501601",
            "name": "តាំង ម៉េងអាន"
        },
        {
            "barcode": "171123437",
            "dpc": "03031501701",
            "name": "ព្រាប សុខជា"
        },
        {
            "barcode": "171123438",
            "dpc": "03031501801",
            "name": "ឈុន  ចិន្តា"
        },
        {
            "barcode": "171123439",
            "dpc": "03031501901",
            "name": "ជូ  ហ្វឹង"
        },
        {
            "barcode": "171123440",
            "dpc": "03031502101",
            "name": "ហួត  អួង"
        },
        {
            "barcode": "171123441",
            "dpc": "03031502201",
            "name": "ណាំ  ទីវ"
        },
        {
            "barcode": "171123442",
            "dpc": "03031502301",
            "name": "សេង ចាន់ដាវុធ"
        },
        {
            "barcode": "171123443",
            "dpc": "03031502401",
            "name": "អ៊ិន  ឡា ១"
        },
        {
            "barcode": "171123444",
            "dpc": "03031502001",
            "name": "កុក  ឆេង ១"
        },
        {
            "barcode": "171123445",
            "dpc": "03031502501",
            "name": "យី  តុង"
        },
        {
            "barcode": "171123446",
            "dpc": "03031502601",
            "name": "ហេង ហុកលី"
        },
        {
            "barcode": "171123447",
            "dpc": "03031502701",
            "name": "អ៊ឹម  ឡុង"
        },
        {
            "barcode": "171123448",
            "dpc": "03031502801",
            "name": "ពេជ្រ  គឿន"
        },
        {
            "barcode": "171123449",
            "dpc": "03031502901",
            "name": "ទួន  សុខម៉េង"
        },
        {
            "barcode": "171123450",
            "dpc": "03031503101",
            "name": "កេង  សុខហេង"
        },
        {
            "barcode": "171123451",
            "dpc": "03031503201",
            "name": "ចែ  ទ្រី"
        },
        {
            "barcode": "171123452",
            "dpc": "03031503301",
            "name": "ខា  ជូ"
        },
        {
            "barcode": "171123453",
            "dpc": "03031503401",
            "name": "អៀង  ប៊ុនហៀង"
        },
        {
            "barcode": "171123454",
            "dpc": "03031503501",
            "name": "ប៉ា  ប៉េងលី"
        },
        {
            "barcode": "171123455",
            "dpc": "03031503601",
            "name": "អ៊ឹង  អេង"
        },
        {
            "barcode": "171123456",
            "dpc": "03031503701",
            "name": "សុខ  ណាល់"
        },
        {
            "barcode": "171123457",
            "dpc": "03031503801",
            "name": "ប៉េង  សុផល"
        },
        {
            "barcode": "171123458",
            "dpc": "03031504301",
            "name": "សុខ  ទ្រី"
        },
        {
            "barcode": "171123459",
            "dpc": "03031548001",
            "name": "ឆាយ គីមសាន"
        },
        {
            "barcode": "171131528",
            "dpc": "03031529201",
            "name": "អែល ស្រ៊ុន"
        },
        {
            "barcode": "171131529",
            "dpc": "03031531701",
            "name": "សម សុវណ្ណ"
        },
        {
            "barcode": "171131530",
            "dpc": "03031531501",
            "name": "ឡាយ ស៊"
        },
        {
            "barcode": "171131531",
            "dpc": "03031531401",
            "name": "អោក អៀង"
        },
        {
            "barcode": "171131532",
            "dpc": "03031531301",
            "name": "អ៊ួច យ៉ន"
        },
        {
            "barcode": "171131533",
            "dpc": "03031529101",
            "name": "តែ ឡាង"
        },
        {
            "barcode": "171131534",
            "dpc": "03031529301",
            "name": "យូ  សំអុល"
        },
        {
            "barcode": "171131535",
            "dpc": "03031529601",
            "name": "តែម  វុន"
        },
        {
            "barcode": "171131536",
            "dpc": "03031529701",
            "name": "សាន ស៊ីម៉ៃ"
        },
        {
            "barcode": "171131537",
            "dpc": "03031529901",
            "name": "ចាប ទៀង"
        },
        {
            "barcode": "171131538",
            "dpc": "03031530001",
            "name": "ទាវ តុប"
        },
        {
            "barcode": "171131539",
            "dpc": "03031530101",
            "name": "លី ហួយ"
        },
        {
            "barcode": "171131540",
            "dpc": "03031530201",
            "name": "យឿម ថេង"
        },
        {
            "barcode": "171131541",
            "dpc": "03031530301",
            "name": "តាំង លីម"
        },
        {
            "barcode": "171131542",
            "dpc": "03031530401",
            "name": "ជុំ ធុនណា"
        },
        {
            "barcode": "171131543",
            "dpc": "03031530501",
            "name": "ផន គឹមកែវ"
        },
        {
            "barcode": "171131544",
            "dpc": "03031530601",
            "name": "សេង ថា"
        },
        {
            "barcode": "171131545",
            "dpc": "03031530801",
            "name": "ហុង  ជីហៃ"
        },
        {
            "barcode": "171131546",
            "dpc": "03031530701",
            "name": "គង់ យឿត"
        },
        {
            "barcode": "171131547",
            "dpc": "03031530901",
            "name": "ជុំ ពិទាក់"
        },
        {
            "barcode": "171131548",
            "dpc": "03031531001",
            "name": "ខាត់ ប៊ុនទៀង"
        },
        {
            "barcode": "171131549",
            "dpc": "03031531201",
            "name": "ភោគ  រិទ្ធា"
        },
        {
            "barcode": "171131550",
            "dpc": "03031531101",
            "name": "សាលាបឋមសិក្សា ទួលតាឯក"
        },
        {
            "barcode": "171131551",
            "dpc": "03031529401",
            "name": "អ៊ឹម  វណ្ណី"
        },
        {
            "barcode": "171131552",
            "dpc": "03031529501",
            "name": "រ៉ម  សុវណ្ណ"
        },
        {
            "barcode": "171131553",
            "dpc": "03031531601",
            "name": "តាន់  សុខរ័ត្ន"
        },
        {
            "barcode": "171131554",
            "dpc": "03031533501",
            "name": "អ៊ឹង ឡៃហ៊ត"
        },
        {
            "barcode": "171131555",
            "dpc": "03031533401",
            "name": "អ៊ុន ចំរើន"
        },
        {
            "barcode": "171131556",
            "dpc": "03031533301",
            "name": "ញិល ស៊ន"
        },
        {
            "barcode": "171131557",
            "dpc": "03031533201",
            "name": "លន់ អេង"
        },
        {
            "barcode": "171131558",
            "dpc": "03031533101",
            "name": "ធូ ហៃ"
        },
        {
            "barcode": "171131559",
            "dpc": "03031533001",
            "name": "តុង លីហួរ"
        },
        {
            "barcode": "171131560",
            "dpc": "03031532901",
            "name": "ជុំ រតនា"
        },
        {
            "barcode": "171131561",
            "dpc": "03031532801",
            "name": "គង់ សំណាង"
        },
        {
            "barcode": "171131562",
            "dpc": "03031532701",
            "name": "វ៉ែន ទិត្យ"
        },
        {
            "barcode": "171131563",
            "dpc": "03031532201",
            "name": "ស៊ុយ ពៅ"
        },
        {
            "barcode": "171131564",
            "dpc": "03031532601",
            "name": "អិត ផល្លី"
        },
        {
            "barcode": "171131565",
            "dpc": "03031532501",
            "name": "យី សាបាន"
        },
        {
            "barcode": "171131566",
            "dpc": "03031532401",
            "name": "ឆាន់ ភុយ"
        },
        {
            "barcode": "171131567",
            "dpc": "03031532301",
            "name": "សេង អ៊ន"
        },
        {
            "barcode": "171131568",
            "dpc": "03031532101",
            "name": "សៀម ទៀង"
        },
        {
            "barcode": "171131569",
            "dpc": "03031532001",
            "name": "ជុំ គឹមអុ"
        },
        {
            "barcode": "171131570",
            "dpc": "03031531901",
            "name": "អ៊ឹង ម៉ែង"
        },
        {
            "barcode": "171131571",
            "dpc": "03031536201",
            "name": "សុខ លី"
        },
        {
            "barcode": "171131572",
            "dpc": "03031536101",
            "name": "ស៊ុន ជឿន"
        },
        {
            "barcode": "171131573",
            "dpc": "03031536001",
            "name": "ស៊ូ ចក់"
        },
        {
            "barcode": "171131574",
            "dpc": "03031535901",
            "name": "ខ្លូត ហ៊ុយហេង"
        },
        {
            "barcode": "171131575",
            "dpc": "03031535801",
            "name": "គួច ហៃ"
        },
        {
            "barcode": "171131576",
            "dpc": "03031535701",
            "name": "ហេង ប៊ុនផាន"
        },
        {
            "barcode": "171131577",
            "dpc": "03031535601",
            "name": "តាំង គី"
        },
        {
            "barcode": "171131578",
            "dpc": "03031535501",
            "name": "គឹម ឡា"
        },
        {
            "barcode": "171131579",
            "dpc": "03031535401",
            "name": "អ៊ុច អាំង"
        },
        {
            "barcode": "171131580",
            "dpc": "03031535301",
            "name": "ម៉ម ពន្លក ១"
        },
        {
            "barcode": "171131581",
            "dpc": "03031535201",
            "name": "គាំ ពៅ"
        },
        {
            "barcode": "171131582",
            "dpc": "03031535101",
            "name": "ចែវ គឹមវ៉ា"
        },
        {
            "barcode": "171131583",
            "dpc": "03031535001",
            "name": "ព្រឿម សាវឿត"
        },
        {
            "barcode": "171131584",
            "dpc": "03031534901",
            "name": "ចាន់ មុំ"
        },
        {
            "barcode": "171131585",
            "dpc": "03031534801",
            "name": "ប្រាង្គ តាយ"
        },
        {
            "barcode": "171131586",
            "dpc": "03031534701",
            "name": "ទន់ សារុន"
        },
        {
            "barcode": "171131587",
            "dpc": "03031534601",
            "name": "កង នី"
        },
        {
            "barcode": "171131588",
            "dpc": "03031534501",
            "name": "អ៊ុក វណ្ណា"
        },
        {
            "barcode": "171131589",
            "dpc": "03031534401",
            "name": "ប៉ិច គឹមស៊"
        },
        {
            "barcode": "171131590",
            "dpc": "03031534301",
            "name": "ជុក ឡុង"
        },
        {
            "barcode": "171131591",
            "dpc": "03031534101",
            "name": "អ៊ុន ហ្សាលី"
        },
        {
            "barcode": "171131592",
            "dpc": "03031534001",
            "name": "លី ហូយ"
        },
        {
            "barcode": "171131593",
            "dpc": "03031533901",
            "name": "ឃី ណារិន"
        },
        {
            "barcode": "171131594",
            "dpc": "03031533801",
            "name": "គុយ ហួត"
        },
        {
            "barcode": "171131595",
            "dpc": "03031533701",
            "name": "ខូវ ហ៊ុយប៉ិ"
        },
        {
            "barcode": "171131596",
            "dpc": "03031533601",
            "name": "ថាច់ បូរិន"
        },
        {
            "barcode": "171131597",
            "dpc": "03031538601",
            "name": "ថោង សុខា"
        },
        {
            "barcode": "171131598",
            "dpc": "03031538501",
            "name": "ប្រាក់ ស៊ីម"
        },
        {
            "barcode": "171131599",
            "dpc": "03031538401",
            "name": "ជា ចាន់"
        },
        {
            "barcode": "171131600",
            "dpc": "03031538301",
            "name": "ឈុន ហាក់"
        },
        {
            "barcode": "171131601",
            "dpc": "03031538201",
            "name": "សាន កុសល"
        },
        {
            "barcode": "171131602",
            "dpc": "03031538101",
            "name": "វ៉ាន់  វុត្ថា"
        },
        {
            "barcode": "171131603",
            "dpc": "03031538001",
            "name": "តាំង  យ៉ាវ"
        },
        {
            "barcode": "171131604",
            "dpc": "03031537901",
            "name": "ឌី កេង"
        },
        {
            "barcode": "171131605",
            "dpc": "03031537701",
            "name": "ជា អ៊ុល"
        },
        {
            "barcode": "171131606",
            "dpc": "03031536401",
            "name": "មិន ហៃ"
        },
        {
            "barcode": "171131607",
            "dpc": "03031536301",
            "name": "សោ ម៉េងហ៊ាង"
        },
        {
            "barcode": "171131608",
            "dpc": "03031537101",
            "name": "សឿន លី"
        },
        {
            "barcode": "171131609",
            "dpc": "03031537001",
            "name": "លឹម ហួន"
        },
        {
            "barcode": "171131610",
            "dpc": "03031536901",
            "name": "ភឿន ណូក"
        },
        {
            "barcode": "171131611",
            "dpc": "03031536801",
            "name": "អ៊ុក វណ្ណា"
        },
        {
            "barcode": "171131612",
            "dpc": "03031536501",
            "name": "លី សុង"
        },
        {
            "barcode": "171131613",
            "dpc": "03031536601",
            "name": "កែវ ប៊ុនឆន"
        },
        {
            "barcode": "171131614",
            "dpc": "03031536701",
            "name": "លី សាំងអូន"
        },
        {
            "barcode": "171131615",
            "dpc": "03031537601",
            "name": "លី សម្បត្តិ"
        },
        {
            "barcode": "171131616",
            "dpc": "03031537501",
            "name": "ជង់ ធឿង"
        },
        {
            "barcode": "171131617",
            "dpc": "03031537401",
            "name": "ឃិន សាន"
        },
        {
            "barcode": "171131618",
            "dpc": "03031537301",
            "name": "ឃិន ជូ"
        },
        {
            "barcode": "171131619",
            "dpc": "03031537201",
            "name": "ប៊ុន ឈីញ"
        },
        {
            "barcode": "171131620",
            "dpc": "03031541301",
            "name": "ហូយ ឡាំង"
        },
        {
            "barcode": "171131621",
            "dpc": "03031541201",
            "name": "ម៉ៅ ឆាយ"
        },
        {
            "barcode": "171131622",
            "dpc": "03031541101",
            "name": "លី ប៉ូទៀង"
        },
        {
            "barcode": "171131623",
            "dpc": "03031540901",
            "name": "សេង ហ៊ាង"
        },
        {
            "barcode": "171131624",
            "dpc": "03031540801",
            "name": "ទ្រី ហាក់"
        },
        {
            "barcode": "171131625",
            "dpc": "03031540701",
            "name": "តាន់ លួង"
        },
        {
            "barcode": "171131626",
            "dpc": "03031540601",
            "name": "យុក សឿង"
        },
        {
            "barcode": "171131627",
            "dpc": "03031540401",
            "name": "តាន់ សាន់"
        },
        {
            "barcode": "171131628",
            "dpc": "03031540201",
            "name": "ទេស សុខុនវិនី"
        },
        {
            "barcode": "171131629",
            "dpc": "03031540101",
            "name": "កែវ សំអាត"
        },
        {
            "barcode": "171131630",
            "dpc": "03031540001",
            "name": "សួន ពោយ"
        },
        {
            "barcode": "171131631",
            "dpc": "03031539901",
            "name": "ឡៃ ហ៊ាង"
        },
        {
            "barcode": "171131632",
            "dpc": "03031539801",
            "name": "អ៊ុន សាលី"
        },
        {
            "barcode": "171131633",
            "dpc": "03031539701",
            "name": "ឡៅ ជី"
        },
        {
            "barcode": "171131634",
            "dpc": "03031539601",
            "name": "តា លាង"
        },
        {
            "barcode": "171131635",
            "dpc": "03031539501",
            "name": "ញឹក សុធី"
        },
        {
            "barcode": "171131636",
            "dpc": "03031539401",
            "name": "ហូ ប៉ុក"
        },
        {
            "barcode": "171131637",
            "dpc": "03031539301",
            "name": "ង៉ោ ជឹងឈុន"
        },
        {
            "barcode": "171131638",
            "dpc": "03031539001",
            "name": "អ៊ឹង ឡៃហុក"
        },
        {
            "barcode": "171131639",
            "dpc": "03031538901",
            "name": "ប៉ោ ស៊ីមឡី"
        },
        {
            "barcode": "171131640",
            "dpc": "03031538801",
            "name": "ប្រាក់ គឹមឡាយ"
        },
        {
            "barcode": "171131641",
            "dpc": "03031538701",
            "name": "ឱ  សុថ"
        },
        {
            "barcode": "171131642",
            "dpc": "03031540301",
            "name": "ទួន  ភឿន"
        },
        {
            "barcode": "171131643",
            "dpc": "03031540501",
            "name": "ជូរ  គង់"
        },
        {
            "barcode": "171131644",
            "dpc": "03031541001",
            "name": "ធៀម  ទ្រី"
        },
        {
            "barcode": "171132062",
            "dpc": "03031544301",
            "name": "ឃុន ហេង"
        },
        {
            "barcode": "171132063",
            "dpc": "03031544201",
            "name": "ឃន ភារម្យ"
        },
        {
            "barcode": "171132064",
            "dpc": "03031544101",
            "name": "អ៊ុំ សារ៉ានាថ"
        },
        {
            "barcode": "171132065",
            "dpc": "03031544001",
            "name": "តាំង ប៊ុនណា"
        },
        {
            "barcode": "171132066",
            "dpc": "03031543901",
            "name": "ចាយ គា"
        },
        {
            "barcode": "171132067",
            "dpc": "03031543801",
            "name": "ឆាន់ ប៊ន"
        },
        {
            "barcode": "171132068",
            "dpc": "03031543701",
            "name": "ថាត់  យ៉ាងតាំ"
        },
        {
            "barcode": "171132069",
            "dpc": "03031543601",
            "name": "គឹម គាង"
        },
        {
            "barcode": "171132070",
            "dpc": "03031543501",
            "name": "ណៃ ផេង"
        },
        {
            "barcode": "171132071",
            "dpc": "03031543401",
            "name": "វង្ស កាំហ"
        },
        {
            "barcode": "171132072",
            "dpc": "03031543301",
            "name": "ម៉ូវ ប៊ូ"
        },
        {
            "barcode": "171132073",
            "dpc": "03031543201",
            "name": "ពិន ប៊ូ"
        },
        {
            "barcode": "171132074",
            "dpc": "03031543101",
            "name": "ប៉ោ ចន្ថា"
        },
        {
            "barcode": "171132075",
            "dpc": "03031543001",
            "name": "ជា សុផល"
        },
        {
            "barcode": "171132076",
            "dpc": "03031542901",
            "name": "ឌី ប៊ុនហ៊ាន"
        },
        {
            "barcode": "171132077",
            "dpc": "03031542801",
            "name": "សោរ ហួន"
        },
        {
            "barcode": "171132078",
            "dpc": "03031542701",
            "name": "អ៊ូច ចាន់រី"
        },
        {
            "barcode": "171132079",
            "dpc": "03031542601",
            "name": "ខឹម ហឿន"
        },
        {
            "barcode": "171132080",
            "dpc": "03031542501",
            "name": "ខឹម ទូច"
        },
        {
            "barcode": "171132081",
            "dpc": "03031542401",
            "name": "ឆន ឈឿង"
        },
        {
            "barcode": "171132082",
            "dpc": "03031542301",
            "name": "ភឹម គន"
        },
        {
            "barcode": "171132083",
            "dpc": "03031542201",
            "name": "ថេង ស្រូយ"
        },
        {
            "barcode": "171132084",
            "dpc": "03031542101",
            "name": "អ៊ឹង ឃាង"
        },
        {
            "barcode": "171132085",
            "dpc": "03031542001",
            "name": "សាន់ ហៃ"
        },
        {
            "barcode": "171132086",
            "dpc": "03031541901",
            "name": "ហ៊ុន បួយ"
        },
        {
            "barcode": "171132087",
            "dpc": "03031541801",
            "name": "ទាវ សៀម៉ី"
        },
        {
            "barcode": "171132088",
            "dpc": "03031541701",
            "name": "អ៊ុយ រី"
        },
        {
            "barcode": "171132089",
            "dpc": "03031541601",
            "name": "គី រី"
        },
        {
            "barcode": "171132090",
            "dpc": "03031545401",
            "name": "ប៉ាន់ ង៉ែត"
        },
        {
            "barcode": "171132091",
            "dpc": "03031545301",
            "name": "ហឿន  ធួក"
        },
        {
            "barcode": "171132092",
            "dpc": "03031545201",
            "name": "ទ្រីញ ភាវ"
        },
        {
            "barcode": "171132093",
            "dpc": "03031545101",
            "name": "ម៉ុយ សេង"
        },
        {
            "barcode": "171132094",
            "dpc": "03031544901",
            "name": "ឃី ប៉ោឆាយ"
        },
        {
            "barcode": "171132095",
            "dpc": "03031544801",
            "name": "ធូ ញ៉េប"
        },
        {
            "barcode": "171132096",
            "dpc": "03031544701",
            "name": "សុខ វែង"
        },
        {
            "barcode": "171132097",
            "dpc": "03031544601",
            "name": "សាយ រក្សា"
        },
        {
            "barcode": "171132098",
            "dpc": "03031544501",
            "name": "សុភី វណ្ណី"
        },
        {
            "barcode": "171132099",
            "dpc": "03031544401",
            "name": "ប៉ោ សុភាព"
        },
        {
            "barcode": "171132100",
            "dpc": "03031546701",
            "name": "សា ម៉ូរ៉ាក់"
        },
        {
            "barcode": "171132101",
            "dpc": "03031546601",
            "name": "អ៊ូច សាត់"
        },
        {
            "barcode": "171132102",
            "dpc": "03031546501",
            "name": "ង៉ែត គិម"
        },
        {
            "barcode": "171132103",
            "dpc": "03031546401",
            "name": "ផាន់ សុវណ្ណរិទ្ធ"
        },
        {
            "barcode": "171132104",
            "dpc": "03031546301",
            "name": "ខឹម ហឿន"
        },
        {
            "barcode": "171132105",
            "dpc": "03031546201",
            "name": "យី គឹមអាង"
        },
        {
            "barcode": "171132106",
            "dpc": "03031546101",
            "name": "ឈាវ ងិត"
        },
        {
            "barcode": "171132107",
            "dpc": "03031546001",
            "name": "នុត ថុន"
        },
        {
            "barcode": "171132108",
            "dpc": "03031545901",
            "name": "ហ៊ុយ តុង"
        },
        {
            "barcode": "171132109",
            "dpc": "03031545801",
            "name": "វណ្ណ សុផេន"
        },
        {
            "barcode": "171132110",
            "dpc": "03031545701",
            "name": "ទូច វ៉ាន់"
        },
        {
            "barcode": "171132111",
            "dpc": "03031545601",
            "name": "សុខ គុជ"
        },
        {
            "barcode": "171132112",
            "dpc": "03031545501",
            "name": "លី ហាក់"
        },
        {
            "barcode": "171132113",
            "dpc": "03031545001",
            "name": "នៅ  សែ"
        },
        {
            "barcode": "171132114",
            "dpc": "03031547901",
            "name": "កាយ ចាន់ថន"
        },
        {
            "barcode": "171132115",
            "dpc": "03031547801",
            "name": "អ៊ឹម សូថាយ"
        },
        {
            "barcode": "171132116",
            "dpc": "03031547701",
            "name": "ញ៉េប គឹមឈឿង"
        },
        {
            "barcode": "171132117",
            "dpc": "03031547601",
            "name": "កង សេត"
        },
        {
            "barcode": "171132118",
            "dpc": "03031547501",
            "name": "ឈ ជិត"
        },
        {
            "barcode": "171132119",
            "dpc": "03031547401",
            "name": "ជឹម សេង"
        },
        {
            "barcode": "171132120",
            "dpc": "03031547301",
            "name": "តាំង នី"
        },
        {
            "barcode": "171132121",
            "dpc": "03031547201",
            "name": "តាំង ទទី"
        },
        {
            "barcode": "171132122",
            "dpc": "03031547101",
            "name": "ម៉ាន់ ប៊ុន"
        },
        {
            "barcode": "171132123",
            "dpc": "03031547001",
            "name": "លី ស៊ុនហ"
        },
        {
            "barcode": "171132124",
            "dpc": "03031546901",
            "name": "យ៉ាង ស៊ីវសេង ១"
        },
        {
            "barcode": "171132125",
            "dpc": "03031546801",
            "name": "ជា សម្ភស្ស"
        },
        {
            "barcode": "171132126",
            "dpc": "03031548001",
            "name": "ឆាយ គីមសាន"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
