let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171126468",
            "dpc": "03031633401",
            "name": "អ៊ឹង ង៉ា"
        },
        {
            "barcode": "171126469",
            "dpc": "03031633301",
            "name": "អ៊ឹង ស៊ីវ"
        },
        {
            "barcode": "171126470",
            "dpc": "03031633201",
            "name": "គឹម សារ៉ាន់"
        },
        {
            "barcode": "171126471",
            "dpc": "03031633101",
            "name": "ម៉ៅ សុធា"
        },
        {
            "barcode": "171126472",
            "dpc": "03031632901",
            "name": "សែម ដារ៉ា"
        },
        {
            "barcode": "171126473",
            "dpc": "03031632801",
            "name": "សុខ ជា"
        },
        {
            "barcode": "171126474",
            "dpc": "03031632701",
            "name": "ជួប លីម"
        },
        {
            "barcode": "171126475",
            "dpc": "03031632601",
            "name": "គឹម សោភា"
        },
        {
            "barcode": "171126476",
            "dpc": "03031631501",
            "name": "ហុង ឆេង"
        },
        {
            "barcode": "171126477",
            "dpc": "03031631401",
            "name": "ជា សុផល"
        },
        {
            "barcode": "171126478",
            "dpc": "03031631301",
            "name": "គឹម ម៉ៅ"
        },
        {
            "barcode": "171126479",
            "dpc": "03031631201",
            "name": "សុខ សារិន"
        },
        {
            "barcode": "171126480",
            "dpc": "03031631101",
            "name": "ស៊ឹម បូរាណ"
        },
        {
            "barcode": "171126481",
            "dpc": "03031631001",
            "name": "ហ៊ី សុគន្ធ"
        },
        {
            "barcode": "171126482",
            "dpc": "03031628501",
            "name": "ឆេត យន់"
        },
        {
            "barcode": "171126483",
            "dpc": "03031628301",
            "name": "សេង សាន"
        },
        {
            "barcode": "171126484",
            "dpc": "03031628201",
            "name": "កែវ សាវី"
        },
        {
            "barcode": "171126485",
            "dpc": "03031628101",
            "name": "នូ វេត"
        },
        {
            "barcode": "171126486",
            "dpc": "03031627901",
            "name": "ជា ភ័ណ្ឌ"
        },
        {
            "barcode": "171126487",
            "dpc": "03031627801",
            "name": "គាត ម៉ាប់"
        },
        {
            "barcode": "171126488",
            "dpc": "03031627601",
            "name": "អោក ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171126489",
            "dpc": "03031627501",
            "name": "កេង ហ៊ាង"
        },
        {
            "barcode": "171126490",
            "dpc": "03031627401",
            "name": "ប៉ាវ ម៉ៅ"
        },
        {
            "barcode": "171126491",
            "dpc": "03031627301",
            "name": "យិន កាំហូយ"
        },
        {
            "barcode": "171126492",
            "dpc": "03031627201",
            "name": "យិញ ហាក់មួយ"
        },
        {
            "barcode": "171126493",
            "dpc": "03031627101",
            "name": "សេង ដាយ"
        },
        {
            "barcode": "171126494",
            "dpc": "03031627001",
            "name": "ជាង ឃីម"
        },
        {
            "barcode": "171126495",
            "dpc": "03031626901",
            "name": "នៅ ស៊្រុន"
        },
        {
            "barcode": "171126496",
            "dpc": "03031626801",
            "name": "ជា ប្រេម"
        },
        {
            "barcode": "171126497",
            "dpc": "03031626701",
            "name": "កេ ហឿក"
        },
        {
            "barcode": "171126498",
            "dpc": "03031626601",
            "name": "ទី មេសា"
        },
        {
            "barcode": "171126499",
            "dpc": "03031626501",
            "name": "ឈ ទី"
        },
        {
            "barcode": "171126500",
            "dpc": "03031634201",
            "name": "ពៅ សុខា"
        },
        {
            "barcode": "171126501",
            "dpc": "03031634101",
            "name": "ជា ភី"
        },
        {
            "barcode": "171126502",
            "dpc": "03031634001",
            "name": "លាង គ្រី"
        },
        {
            "barcode": "171126503",
            "dpc": "03031633901",
            "name": "អ៊ូច ពាន"
        },
        {
            "barcode": "171126504",
            "dpc": "03031633801",
            "name": "លឹម ខេងសែ"
        },
        {
            "barcode": "171126505",
            "dpc": "03031633701",
            "name": "ជា ប្រេម"
        },
        {
            "barcode": "171126506",
            "dpc": "03031633601",
            "name": "ឈុន ឡេង"
        },
        {
            "barcode": "171126507",
            "dpc": "03031633501",
            "name": "លីន វណ្ណា"
        },
        {
            "barcode": "171126508",
            "dpc": "03031632501",
            "name": "ហេម ហាវ"
        },
        {
            "barcode": "171126509",
            "dpc": "03031632401",
            "name": "សំ សារ៉ន"
        },
        {
            "barcode": "171126510",
            "dpc": "03031632301",
            "name": "សេង ម៉ាប់"
        },
        {
            "barcode": "171126511",
            "dpc": "03031632201",
            "name": "អៀង ស៊ុំ"
        },
        {
            "barcode": "171126512",
            "dpc": "03031632101",
            "name": "គង់ ម៉ា"
        },
        {
            "barcode": "171126513",
            "dpc": "03031632001",
            "name": "ហង្ស វណ្ណដា"
        },
        {
            "barcode": "171126514",
            "dpc": "03031631901",
            "name": "សន ធាង"
        },
        {
            "barcode": "171126515",
            "dpc": "03031631801",
            "name": "វី សាវន"
        },
        {
            "barcode": "171126516",
            "dpc": "03031631701",
            "name": "ហ៊ែល ឆៃលាង"
        },
        {
            "barcode": "171126517",
            "dpc": "03031631601",
            "name": "រិទ្ធ គ្រឹស្នា"
        },
        {
            "barcode": "171126518",
            "dpc": "03031630801",
            "name": "អ៊ូ ជា"
        },
        {
            "barcode": "171126519",
            "dpc": "03031630701",
            "name": "ហេង រិទ្ធី"
        },
        {
            "barcode": "171126520",
            "dpc": "03031630601",
            "name": "ឆាយ ប៊ុនឈាន"
        },
        {
            "barcode": "171126521",
            "dpc": "03031630501",
            "name": "ហេង កៀន"
        },
        {
            "barcode": "171126522",
            "dpc": "03031630401",
            "name": "ញ៉ែម សាមគ្គី"
        },
        {
            "barcode": "171126523",
            "dpc": "03031630301",
            "name": "ញ៉ែម សឿន"
        },
        {
            "barcode": "171126524",
            "dpc": "03031630201",
            "name": "ឃឿន សុខាំ"
        },
        {
            "barcode": "171126525",
            "dpc": "03031630101",
            "name": "សុខ រុនពិសិទ្ធ"
        },
        {
            "barcode": "171126526",
            "dpc": "03031630001",
            "name": "ស  គា"
        },
        {
            "barcode": "171126527",
            "dpc": "03031629901",
            "name": "ហង្ស សាវ៉ាត់"
        },
        {
            "barcode": "171126528",
            "dpc": "03031629801",
            "name": "ធឿន ហៃ"
        },
        {
            "barcode": "171126529",
            "dpc": "03031629701",
            "name": "កួច លីបួយ"
        },
        {
            "barcode": "171126530",
            "dpc": "03031629601",
            "name": "ឡុង ហួត"
        },
        {
            "barcode": "171126531",
            "dpc": "03031629401",
            "name": "យឹម កួយ"
        },
        {
            "barcode": "171126532",
            "dpc": "03031629101",
            "name": "ប៊ូ ដែ"
        },
        {
            "barcode": "171126533",
            "dpc": "03031629001",
            "name": "សេង ដាយ"
        },
        {
            "barcode": "171126534",
            "dpc": "03031628801",
            "name": "ភី ផាន"
        },
        {
            "barcode": "171126535",
            "dpc": "03031628701",
            "name": "សេង ហុង"
        },
        {
            "barcode": "171126536",
            "dpc": "03031628601",
            "name": "ស៊ុន ស៊"
        },
        {
            "barcode": "171126537",
            "dpc": "03031626401",
            "name": "ជិន សូឡី"
        },
        {
            "barcode": "171126538",
            "dpc": "03031626301",
            "name": "អ៊ឹង កៀត"
        },
        {
            "barcode": "171126539",
            "dpc": "03031626201",
            "name": "ងួន សុខហេង"
        },
        {
            "barcode": "171126540",
            "dpc": "03031626101",
            "name": "ប៊ី ទី"
        },
        {
            "barcode": "171126541",
            "dpc": "03031626001",
            "name": "កៅ  គឹមហៃ"
        },
        {
            "barcode": "171126542",
            "dpc": "03031625901",
            "name": "ប៊ី សួរ"
        },
        {
            "barcode": "171126543",
            "dpc": "03031625801",
            "name": "ហេង ផេង"
        },
        {
            "barcode": "171126544",
            "dpc": "03031625701",
            "name": "សេង ទ្រូ"
        },
        {
            "barcode": "171126545",
            "dpc": "03031625601",
            "name": "សេង អៀង"
        },
        {
            "barcode": "171126546",
            "dpc": "03031625501",
            "name": "គង់ ទី"
        },
        {
            "barcode": "171126547",
            "dpc": "03031625401",
            "name": "សែ ហួត"
        },
        {
            "barcode": "171126548",
            "dpc": "03031625301",
            "name": "នូវ  រ៉ាដេត"
        },
        {
            "barcode": "171126549",
            "dpc": "03031625201",
            "name": "ឌុល សម្បត្តិ"
        },
        {
            "barcode": "171126550",
            "dpc": "03031625101",
            "name": "ទួន សុខជា"
        },
        {
            "barcode": "171126551",
            "dpc": "03031625001",
            "name": "លាង ហាវ"
        },
        {
            "barcode": "171126552",
            "dpc": "03031624801",
            "name": "ហ៊ ចាន់ធី"
        },
        {
            "barcode": "171126553",
            "dpc": "03031624701",
            "name": "ឃុត ឃន"
        },
        {
            "barcode": "171126554",
            "dpc": "03031624601",
            "name": "ពេជ្រ សារី"
        },
        {
            "barcode": "171126555",
            "dpc": "03031624501",
            "name": "ជា ខេង"
        },
        {
            "barcode": "171126556",
            "dpc": "03031624401",
            "name": "អ៊ា សាង"
        },
        {
            "barcode": "171126557",
            "dpc": "03031624301",
            "name": "គួច សេងទី"
        },
        {
            "barcode": "171126558",
            "dpc": "03031624201",
            "name": "ពឹង គឹមស៊ា"
        },
        {
            "barcode": "171126559",
            "dpc": "03031624101",
            "name": "ពឹង ឈួន"
        },
        {
            "barcode": "171126560",
            "dpc": "03031624001",
            "name": "ឈឿត សាន់"
        },
        {
            "barcode": "171126561",
            "dpc": "03031623901",
            "name": "ម៉ឺន វិបុល"
        },
        {
            "barcode": "171126562",
            "dpc": "03031623801",
            "name": "ស៊ា លឹមទ្រី"
        },
        {
            "barcode": "171126563",
            "dpc": "03031623701",
            "name": "ឆៃ អ៊នជី"
        },
        {
            "barcode": "171126564",
            "dpc": "03031623601",
            "name": "យូ សុខផេង"
        },
        {
            "barcode": "171126565",
            "dpc": "03031623501",
            "name": "សេង ហ៊ីម"
        },
        {
            "barcode": "171126566",
            "dpc": "03031623401",
            "name": "ជ័យ សែន"
        },
        {
            "barcode": "171126567",
            "dpc": "03031623301",
            "name": "អ៊ឹង ថន"
        },
        {
            "barcode": "171126568",
            "dpc": "03031623201",
            "name": "ទាវ ភឿន"
        },
        {
            "barcode": "171126569",
            "dpc": "03031623101",
            "name": "បាន ងួន"
        },
        {
            "barcode": "171126570",
            "dpc": "03031623001",
            "name": "សំ ប៊ន"
        },
        {
            "barcode": "171126571",
            "dpc": "03031622901",
            "name": "ភោគ សុខន"
        },
        {
            "barcode": "171126572",
            "dpc": "03031622701",
            "name": "ពត  សុគន្ធី"
        },
        {
            "barcode": "171126573",
            "dpc": "03031622601",
            "name": "លុច យឿន"
        },
        {
            "barcode": "171126574",
            "dpc": "03031622501",
            "name": "ទុំ ថន"
        },
        {
            "barcode": "171126575",
            "dpc": "03031622401",
            "name": "ពៅ ង៉ុច"
        },
        {
            "barcode": "171126576",
            "dpc": "03031622301",
            "name": "កូវ អូន"
        },
        {
            "barcode": "171126577",
            "dpc": "03031622201",
            "name": "ហួន ទី"
        },
        {
            "barcode": "171126578",
            "dpc": "03031622001",
            "name": "សុខ សុថាវី"
        },
        {
            "barcode": "171126579",
            "dpc": "03031621901",
            "name": "អ៊ុំ សុខា"
        },
        {
            "barcode": "171126580",
            "dpc": "03031621801",
            "name": "ភោគ ប៊ុននី"
        },
        {
            "barcode": "171126581",
            "dpc": "03031621701",
            "name": "គិញ ធឿន"
        },
        {
            "barcode": "171126582",
            "dpc": "03031621601",
            "name": "ចែ  សួន"
        },
        {
            "barcode": "171126583",
            "dpc": "03031621501",
            "name": "សំ រិទ្ធី"
        },
        {
            "barcode": "171126584",
            "dpc": "03031621401",
            "name": "អ៊ង  បូ"
        },
        {
            "barcode": "171126585",
            "dpc": "03031621301",
            "name": "អ៊ុម សារឿន"
        },
        {
            "barcode": "171126586",
            "dpc": "03031621201",
            "name": "ហូ ទិត្យ"
        },
        {
            "barcode": "171126587",
            "dpc": "03031621101",
            "name": "ឌី ឈុន"
        },
        {
            "barcode": "171126588",
            "dpc": "03031621001",
            "name": "អ៊ឹង សេង"
        },
        {
            "barcode": "171126589",
            "dpc": "03031620901",
            "name": "ថូ ថៅ"
        },
        {
            "barcode": "171126590",
            "dpc": "03031620801",
            "name": "ហម ហ៊ន"
        },
        {
            "barcode": "171126591",
            "dpc": "03031620701",
            "name": "សុខ ជូ"
        },
        {
            "barcode": "171126592",
            "dpc": "03031620601",
            "name": "លី នីម"
        },
        {
            "barcode": "171126593",
            "dpc": "03031620501",
            "name": "សេង ម៉ៅ"
        },
        {
            "barcode": "171126594",
            "dpc": "03031620401",
            "name": "អ៊ឹង ម៉េងហ៊ាង"
        },
        {
            "barcode": "171126595",
            "dpc": "03031620301",
            "name": "តាំង ប៉ាក់គុណ"
        },
        {
            "barcode": "171126596",
            "dpc": "03031620201",
            "name": "សុខ វិត"
        },
        {
            "barcode": "171126597",
            "dpc": "03031620101",
            "name": "ជា ឆាយបូ"
        },
        {
            "barcode": "171126598",
            "dpc": "03031619901",
            "name": "ស្វាយ សេង"
        },
        {
            "barcode": "171126599",
            "dpc": "03031619801",
            "name": "ជា កុច"
        },
        {
            "barcode": "171126600",
            "dpc": "03031619701",
            "name": "ហូរ ម៉ាប់"
        },
        {
            "barcode": "171126601",
            "dpc": "03031619601",
            "name": "រឿន សារី"
        },
        {
            "barcode": "171126602",
            "dpc": "03031619501",
            "name": "នូ ម៉េង"
        },
        {
            "barcode": "171126603",
            "dpc": "03031619401",
            "name": "ឈិត អែម"
        },
        {
            "barcode": "171126604",
            "dpc": "03031619301",
            "name": "ឯម ប៊ុនណា"
        },
        {
            "barcode": "171126605",
            "dpc": "03031619201",
            "name": "ឈុំ នៃ"
        },
        {
            "barcode": "171126606",
            "dpc": "03031619101",
            "name": "យឹក គង់"
        },
        {
            "barcode": "171126607",
            "dpc": "03031619001",
            "name": "សៀង ហៃ"
        },
        {
            "barcode": "171126608",
            "dpc": "03031618901",
            "name": "ចៅ ថូវ"
        },
        {
            "barcode": "171126609",
            "dpc": "03031618801",
            "name": "ថៃ ហុង"
        },
        {
            "barcode": "171126610",
            "dpc": "03031618701",
            "name": "អ៊ាប់ ជឺម៉ាន់"
        },
        {
            "barcode": "171126611",
            "dpc": "03031618601",
            "name": "សុខ ប៊ុនហុង"
        },
        {
            "barcode": "171126612",
            "dpc": "03031618501",
            "name": "ហ៊ឹម ឡុង"
        },
        {
            "barcode": "171126613",
            "dpc": "03031618401",
            "name": "ឌៀប ហ្គិចឡាង"
        },
        {
            "barcode": "171126614",
            "dpc": "03031618301",
            "name": "នៅ​ ចាន់"
        },
        {
            "barcode": "171126615",
            "dpc": "03031618201",
            "name": "អ៊ុង ខន"
        },
        {
            "barcode": "171126616",
            "dpc": "03031618101",
            "name": "យ៉ាន់ សារ៉ាន់"
        },
        {
            "barcode": "171126617",
            "dpc": "03031618001",
            "name": "ជិន ពៅ"
        },
        {
            "barcode": "171126618",
            "dpc": "03031617901",
            "name": "ផ្លុង សុភាព"
        },
        {
            "barcode": "171126619",
            "dpc": "03031617701",
            "name": "អ៊ូ ដារា"
        },
        {
            "barcode": "171126620",
            "dpc": "03031617601",
            "name": "ទី គឹមសួរ"
        },
        {
            "barcode": "171126621",
            "dpc": "03031617501",
            "name": "កុង ជី"
        },
        {
            "barcode": "171126622",
            "dpc": "03031617401",
            "name": "សាលាឃុំ អូរចារ"
        },
        {
            "barcode": "171126623",
            "dpc": "03031617301",
            "name": "សេង យក់លី"
        },
        {
            "barcode": "171126624",
            "dpc": "03031607201",
            "name": "កែវ ថន"
        },
        {
            "barcode": "171126625",
            "dpc": "03031607001",
            "name": "វង់ ប៊ុនថា"
        },
        {
            "barcode": "171126626",
            "dpc": "03031606701",
            "name": "អ៊ុច តុន"
        },
        {
            "barcode": "171126627",
            "dpc": "03031606601",
            "name": "ចុន សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171126628",
            "dpc": "03031606501",
            "name": "ខឹម កុសល"
        },
        {
            "barcode": "171126629",
            "dpc": "03031606401",
            "name": "អេង រួន"
        },
        {
            "barcode": "171126630",
            "dpc": "03031606301",
            "name": "ឃឹម វណ្ណៈ"
        },
        {
            "barcode": "171126631",
            "dpc": "03031606201",
            "name": "មិត្ត ធឿង"
        },
        {
            "barcode": "171126632",
            "dpc": "03031606101",
            "name": "ទូច ជន"
        },
        {
            "barcode": "171126633",
            "dpc": "03031606001",
            "name": "ឌិត ញិប"
        },
        {
            "barcode": "171126634",
            "dpc": "03031605901",
            "name": "ធួក ឡំ"
        },
        {
            "barcode": "171126635",
            "dpc": "03031605801",
            "name": "ឈឹម សែត"
        },
        {
            "barcode": "171126636",
            "dpc": "03031605701",
            "name": "ភាជ ធឿម"
        },
        {
            "barcode": "171126637",
            "dpc": "03031605601",
            "name": "ម៉ៅ សារុន"
        },
        {
            "barcode": "171126638",
            "dpc": "03031605501",
            "name": "ព្រាប និមល"
        },
        {
            "barcode": "171126639",
            "dpc": "03031605401",
            "name": "គឹម ណារ៉ុង"
        },
        {
            "barcode": "171126640",
            "dpc": "03031605301",
            "name": "ចំរើន វង្ស"
        },
        {
            "barcode": "171126641",
            "dpc": "03031605201",
            "name": "គឹម សែន"
        },
        {
            "barcode": "171126642",
            "dpc": "03031605101",
            "name": "ស៊ុន ធី"
        },
        {
            "barcode": "171126643",
            "dpc": "03031605001",
            "name": "សុំ សុខា"
        },
        {
            "barcode": "171126644",
            "dpc": "03031604901",
            "name": "រឿន រឿត"
        },
        {
            "barcode": "171126645",
            "dpc": "03031604701",
            "name": "សោម កឹម"
        },
        {
            "barcode": "171126646",
            "dpc": "03031604601",
            "name": "គុណ ប្រិម"
        },
        {
            "barcode": "171126647",
            "dpc": "03031604501",
            "name": "កង សឿន"
        },
        {
            "barcode": "171126648",
            "dpc": "03031604401",
            "name": "ប៉ោ ឡុង"
        },
        {
            "barcode": "171126649",
            "dpc": "03031604201",
            "name": "ធឿន សាវឿន"
        },
        {
            "barcode": "171126650",
            "dpc": "03031604101",
            "name": "មុត សុភី"
        },
        {
            "barcode": "171126651",
            "dpc": "03031604001",
            "name": "វែង ស្រេង"
        },
        {
            "barcode": "171126652",
            "dpc": "03031603901",
            "name": "ហួរ សួរ"
        },
        {
            "barcode": "171126653",
            "dpc": "03031603801",
            "name": "ហយ ហ៊ុន"
        },
        {
            "barcode": "171126654",
            "dpc": "03031603701",
            "name": "មាស​សាវេន"
        },
        {
            "barcode": "171126655",
            "dpc": "03031603601",
            "name": "សឿង វ៉ាន់នី"
        },
        {
            "barcode": "171126656",
            "dpc": "03031601701",
            "name": "រស់ វាសនា"
        },
        {
            "barcode": "171126657",
            "dpc": "03031601601",
            "name": "វឿន ស៊ីវឿត"
        },
        {
            "barcode": "171126658",
            "dpc": "03031601501",
            "name": "ជា ពន្លាក់"
        },
        {
            "barcode": "171126659",
            "dpc": "03031601401",
            "name": "ស៊ុន ប៊ុនឡេង"
        },
        {
            "barcode": "171126660",
            "dpc": "03031601301",
            "name": "ជឹម សារ៉ាត់"
        },
        {
            "barcode": "171126661",
            "dpc": "03031601201",
            "name": "សោម ណារ័ត្ន"
        },
        {
            "barcode": "171126662",
            "dpc": "03031601001",
            "name": "ថៃ សុធារ៉ា"
        },
        {
            "barcode": "171126663",
            "dpc": "03031600901",
            "name": "ចាន់ ថុល"
        },
        {
            "barcode": "171126664",
            "dpc": "03031600801",
            "name": "ឡាយ ប៊ុននេត"
        },
        {
            "barcode": "171126665",
            "dpc": "03031600701",
            "name": "ជួប អេង"
        },
        {
            "barcode": "171126666",
            "dpc": "03031600601",
            "name": "ចាន់ ណារិន"
        },
        {
            "barcode": "171126667",
            "dpc": "03031600501",
            "name": "ហាវ វ៉ាន់"
        },
        {
            "barcode": "171126668",
            "dpc": "03031600401",
            "name": "ស្តើង យ៉េន"
        },
        {
            "barcode": "171126669",
            "dpc": "03031600301",
            "name": "ចេត វិត ១"
        },
        {
            "barcode": "171126670",
            "dpc": "03031600201",
            "name": "សូ  ចាន់ហេង"
        },
        {
            "barcode": "171126671",
            "dpc": "03031600101",
            "name": "ផន លន់"
        },
        {
            "barcode": "171126672",
            "dpc": "03031607301",
            "name": "តា ទិញជ្រូក"
        },
        {
            "barcode": "171126673",
            "dpc": "03031603501",
            "name": "អ៊ឹង ចាន់សុន"
        },
        {
            "barcode": "171126674",
            "dpc": "03031603401",
            "name": "សេង សុម៉ាលី"
        },
        {
            "barcode": "171126675",
            "dpc": "03031603301",
            "name": "ចេត វិត"
        },
        {
            "barcode": "171126676",
            "dpc": "03031603201",
            "name": "ជឹម ផេង"
        },
        {
            "barcode": "171126677",
            "dpc": "03031603101",
            "name": "អន យ៉ុត"
        },
        {
            "barcode": "171126678",
            "dpc": "03031603001",
            "name": "ឈឹម សុគន្ធា"
        },
        {
            "barcode": "171126679",
            "dpc": "03031602901",
            "name": "លីស សុផាន់ណារ៉ា"
        },
        {
            "barcode": "171126680",
            "dpc": "03031602801",
            "name": "ជូន កក្កដា"
        },
        {
            "barcode": "171126681",
            "dpc": "03031602701",
            "name": "មឿង រិន"
        },
        {
            "barcode": "171126682",
            "dpc": "03031602601",
            "name": "យាំ យ៉ាន់"
        },
        {
            "barcode": "171126683",
            "dpc": "03031602401",
            "name": "អ៊ិន ឡា"
        },
        {
            "barcode": "171126684",
            "dpc": "03031602301",
            "name": "សារិ វិសុទ្ធ"
        },
        {
            "barcode": "171126685",
            "dpc": "03031602201",
            "name": "ចាន់ ពៅ"
        },
        {
            "barcode": "171126686",
            "dpc": "03031602101",
            "name": "ហ៊ុយ សុភ័ក្រ្ត"
        },
        {
            "barcode": "171126687",
            "dpc": "03031602001",
            "name": "ចាន់ ជា"
        },
        {
            "barcode": "171126688",
            "dpc": "03031601901",
            "name": "តាំង ធូយិន"
        },
        {
            "barcode": "171126689",
            "dpc": "03031601801",
            "name": "អៃ ត្រៃលក្ខណ៍"
        },
        {
            "barcode": "171126690",
            "dpc": "03031601101",
            "name": "អេង ស្រីអៀង"
        },
        {
            "barcode": "171126691",
            "dpc": "03031615901",
            "name": "សុខ ហ៊ាង"
        },
        {
            "barcode": "171126692",
            "dpc": "03031615801",
            "name": "យាយ អង"
        },
        {
            "barcode": "171126693",
            "dpc": "03031615601",
            "name": "ឆេង ទី"
        },
        {
            "barcode": "171126694",
            "dpc": "03031615501",
            "name": "គ្រួច អ៊ិត"
        },
        {
            "barcode": "171126695",
            "dpc": "03031615401",
            "name": "ហង្ស ចន្តី"
        },
        {
            "barcode": "171126696",
            "dpc": "03031615301",
            "name": "ចែ ណារី"
        },
        {
            "barcode": "171126697",
            "dpc": "03031615201",
            "name": "ឌុល សំផាន"
        },
        {
            "barcode": "171126698",
            "dpc": "03031615101",
            "name": "ថង គឹមកែវ"
        },
        {
            "barcode": "171126699",
            "dpc": "03031614601",
            "name": "ហង់ វណ្ណា"
        },
        {
            "barcode": "171126700",
            "dpc": "03031614901",
            "name": "ឈិន គឹមស៊ាន"
        },
        {
            "barcode": "171126701",
            "dpc": "03031614801",
            "name": "ហែម ថ្លៃថ្លា"
        },
        {
            "barcode": "171126702",
            "dpc": "03031614701",
            "name": "ឈួន សាវន្ត"
        },
        {
            "barcode": "171126703",
            "dpc": "03031614501",
            "name": "ហាក់ វ៉ាន់នី"
        },
        {
            "barcode": "171126704",
            "dpc": "03031614401",
            "name": "ម៉ុក ស៊ីន"
        },
        {
            "barcode": "171126705",
            "dpc": "03031613001",
            "name": "តាន់ វុទ្ធី"
        },
        {
            "barcode": "171126706",
            "dpc": "03031613101",
            "name": "ជា សាមាន"
        },
        {
            "barcode": "171126707",
            "dpc": "03031613201",
            "name": "តាន់ លី"
        },
        {
            "barcode": "171126708",
            "dpc": "03031613301",
            "name": "ទិន ប៊ុនធិន"
        },
        {
            "barcode": "171126709",
            "dpc": "03031613401",
            "name": "ស នឿន"
        },
        {
            "barcode": "171126710",
            "dpc": "03031613501",
            "name": "កប ប្រសើរ"
        },
        {
            "barcode": "171126711",
            "dpc": "03031614101",
            "name": "ប៉ាវ ស៊ីវឡេង"
        },
        {
            "barcode": "171126712",
            "dpc": "03031616101",
            "name": "ផុន សារ៉ាន់"
        },
        {
            "barcode": "171126713",
            "dpc": "03031616901",
            "name": "ស៊ន ស៊ាន"
        },
        {
            "barcode": "171126714",
            "dpc": "03031617101",
            "name": "មាន សុវណ្ណា"
        },
        {
            "barcode": "171126715",
            "dpc": "03031617001",
            "name": "យូ ចាន់ថន"
        },
        {
            "barcode": "171126716",
            "dpc": "03031616801",
            "name": "ថន ចាន់ថា"
        },
        {
            "barcode": "171126717",
            "dpc": "03031616001",
            "name": "សុខ សំអុល"
        },
        {
            "barcode": "171126718",
            "dpc": "03031616201",
            "name": "ចេត ថុល"
        },
        {
            "barcode": "171126719",
            "dpc": "03031616301",
            "name": "ប៉ែន សុខហ៊ាង"
        },
        {
            "barcode": "171126720",
            "dpc": "03031616401",
            "name": "ម៉ី ហឿន"
        },
        {
            "barcode": "171126721",
            "dpc": "03031616501",
            "name": "គង់ រៀន"
        },
        {
            "barcode": "171126722",
            "dpc": "03031616601",
            "name": "ញាណ ប៉ុក"
        },
        {
            "barcode": "171126723",
            "dpc": "03031616701",
            "name": "សុខ ប៊ុនសុង"
        },
        {
            "barcode": "171126724",
            "dpc": "03031615701",
            "name": "តេង យ៉ាន"
        },
        {
            "barcode": "171126725",
            "dpc": "03031612701",
            "name": "ឡុង ឌាល"
        },
        {
            "barcode": "171126726",
            "dpc": "03031612601",
            "name": "ចែត រស្មី"
        },
        {
            "barcode": "171126727",
            "dpc": "03031612501",
            "name": "ពេជ្រ ដារ៉ារិទ្ធ"
        },
        {
            "barcode": "171126728",
            "dpc": "03031612401",
            "name": "អោក គុណ"
        },
        {
            "barcode": "171126729",
            "dpc": "03031612301",
            "name": "ស៊ិន ស៊ីវន"
        },
        {
            "barcode": "171126730",
            "dpc": "03031612101",
            "name": "ហម សាម៉េត"
        },
        {
            "barcode": "171126731",
            "dpc": "03031612201",
            "name": "សាំង អ៊ា"
        },
        {
            "barcode": "171126732",
            "dpc": "03031608601",
            "name": "សាលារៀនអូរតាគាំ១"
        },
        {
            "barcode": "171126733",
            "dpc": "03031608501",
            "name": "តូម ផល្លា"
        },
        {
            "barcode": "171126734",
            "dpc": "03031608401",
            "name": "ព្រាប ពុធសានឿន"
        },
        {
            "barcode": "171126735",
            "dpc": "03031608201",
            "name": "សេក រី"
        },
        {
            "barcode": "171126736",
            "dpc": "03031608301",
            "name": "អ៊ុច សុនាង"
        },
        {
            "barcode": "171126737",
            "dpc": "03031608001",
            "name": "យុត ស្វិនី"
        },
        {
            "barcode": "171126738",
            "dpc": "03031607801",
            "name": "អ៊ុច សុន"
        },
        {
            "barcode": "171126739",
            "dpc": "03031607901",
            "name": "បាន ស្រីតូច"
        },
        {
            "barcode": "171126740",
            "dpc": "03031607701",
            "name": "សេង ធី"
        },
        {
            "barcode": "171126741",
            "dpc": "03031607601",
            "name": "ឆាយ ចាន់ណារ័ត្ន"
        },
        {
            "barcode": "171126742",
            "dpc": "03031607501",
            "name": "យាយ នូង"
        },
        {
            "barcode": "171126743",
            "dpc": "03031607401",
            "name": "ប៉ែន ចាន់ថន"
        },
        {
            "barcode": "171126744",
            "dpc": "03031611401",
            "name": "ហាវ កញ្ញា"
        },
        {
            "barcode": "171126745",
            "dpc": "03031611501",
            "name": "អឿន សុភាព"
        },
        {
            "barcode": "171126746",
            "dpc": "03031611601",
            "name": "វណ្ណ សុជាតិ"
        },
        {
            "barcode": "171126747",
            "dpc": "03031611301",
            "name": "ខ្លូត សាឯម"
        },
        {
            "barcode": "171126748",
            "dpc": "03031611701",
            "name": "ហួន ជួត"
        },
        {
            "barcode": "171126749",
            "dpc": "03031612001",
            "name": "ប្រាក់ ស៊ីថា"
        },
        {
            "barcode": "171126750",
            "dpc": "03031611901",
            "name": "ដាំ  ឈិន"
        },
        {
            "barcode": "171126751",
            "dpc": "03031611801",
            "name": "រឿន រ៉ាក់"
        },
        {
            "barcode": "171126752",
            "dpc": "03031612901",
            "name": "រិន វាសនា"
        },
        {
            "barcode": "171126753",
            "dpc": "03031613901",
            "name": "សៅ សារេត"
        },
        {
            "barcode": "171126754",
            "dpc": "03031614001",
            "name": "ហេង សុភាព"
        },
        {
            "barcode": "171126755",
            "dpc": "03031613801",
            "name": "មាស ឆុំ"
        },
        {
            "barcode": "171126756",
            "dpc": "03031613701",
            "name": "លន់ ប៊ុនលុយ"
        },
        {
            "barcode": "171126757",
            "dpc": "03031613601",
            "name": "ថុល វណ្ណារ៉ូ"
        },
        {
            "barcode": "171126758",
            "dpc": "03031614201",
            "name": "ឡុង  ឈួយ"
        },
        {
            "barcode": "171126759",
            "dpc": "03031614301",
            "name": "ឡុង ឈឿន"
        },
        {
            "barcode": "171126760",
            "dpc": "03031611201",
            "name": "មៀច សុធា"
        },
        {
            "barcode": "171126761",
            "dpc": "03031611101",
            "name": "ភឿក សារ៉ាត់"
        },
        {
            "barcode": "171126762",
            "dpc": "03031611001",
            "name": "ឈឹម ឆិល"
        },
        {
            "barcode": "171126763",
            "dpc": "03031610901",
            "name": "ម៉ែន សុខន"
        },
        {
            "barcode": "171126764",
            "dpc": "03031610401",
            "name": "សូ សុទ្ធ"
        },
        {
            "barcode": "171126765",
            "dpc": "03031610301",
            "name": "ណែម សុវណ្ណ"
        },
        {
            "barcode": "171126766",
            "dpc": "03031610201",
            "name": "ស្រី ផល្លី"
        },
        {
            "barcode": "171126767",
            "dpc": "03031610101",
            "name": "រស់ ផល្លា"
        },
        {
            "barcode": "171126768",
            "dpc": "03031609701",
            "name": "សី សាវឿន"
        },
        {
            "barcode": "171126769",
            "dpc": "03031609801",
            "name": "ឡុញ សំណាង"
        },
        {
            "barcode": "171126770",
            "dpc": "03031609901",
            "name": "សួស នឹង"
        },
        {
            "barcode": "171126771",
            "dpc": "03031610001",
            "name": "ពៅ វ៉ាន់ពុន"
        },
        {
            "barcode": "171126772",
            "dpc": "03031609501",
            "name": "ចូត ជឿម"
        },
        {
            "barcode": "171126773",
            "dpc": "03031609401",
            "name": "ម៉េង ចាន់ថន"
        },
        {
            "barcode": "171126774",
            "dpc": "03031609101",
            "name": "អេប សំអាត"
        },
        {
            "barcode": "171126775",
            "dpc": "03031609001",
            "name": "រស់ សុភ័ណ្ឌ"
        },
        {
            "barcode": "171126776",
            "dpc": "03031608901",
            "name": "ហង្ស ផល្លា"
        },
        {
            "barcode": "171126777",
            "dpc": "03031608801",
            "name": "សេង សួរ"
        },
        {
            "barcode": "171126778",
            "dpc": "03031608701",
            "name": "តេង វុត្ថា"
        },
        {
            "barcode": "171126779",
            "dpc": "03031609201",
            "name": "គឹម យ៉ុង"
        },
        {
            "barcode": "171126780",
            "dpc": "03031610701",
            "name": "ឈឹម កូយ"
        },
        {
            "barcode": "171126781",
            "dpc": "03031610601",
            "name": "ឈឹម ប្រេស"
        },
        {
            "barcode": "171126782",
            "dpc": "03031606901",
            "name": "ជា សុផល"
        },
        {
            "barcode": "171126783",
            "dpc": "03031609301",
            "name": "គង់  សាវឿន"
        },
        {
            "barcode": "171126784",
            "dpc": "03031609601",
            "name": "ហ៊ឹង  សំបូរ"
        },
        {
            "barcode": "171126785",
            "dpc": "03031610801",
            "name": "សាត  យ៉ុម"
        },
        {
            "barcode": "171126786",
            "dpc": "03031612801",
            "name": "ជ័យ  ប៊ុនថន"
        },
        {
            "barcode": "171126787",
            "dpc": "03031615001",
            "name": "គី  ម៉េងទុយ"
        },
        {
            "barcode": "171126788",
            "dpc": "03031617201",
            "name": "សុខ  អេង"
        },
        {
            "barcode": "171126789",
            "dpc": "03031622801",
            "name": "អ៊ាន  សុផល"
        },
        {
            "barcode": "171126790",
            "dpc": "03031628901",
            "name": "ហាក់  ប៊ុនជា"
        },
        {
            "barcode": "171126791",
            "dpc": "03031630901",
            "name": "ប៉ោ  ថន"
        },
        {
            "barcode": "171126792",
            "dpc": "03031633001",
            "name": "គឹម  សាន"
        },
        {
            "barcode": "171126793",
            "dpc": "03031635401",
            "name": "ហៃ  ហ្គិច"
        },
        {
            "barcode": "171126794",
            "dpc": "03031635601",
            "name": "សេង  គង់"
        },
        {
            "barcode": "171126795",
            "dpc": "03031635701",
            "name": "សឿន  ថាំង"
        },
        {
            "barcode": "171126796",
            "dpc": "03031635801",
            "name": "ញិល  វណ្ណះ"
        },
        {
            "barcode": "171126797",
            "dpc": "03031635901",
            "name": "ជា  សេង"
        },
        {
            "barcode": "171126798",
            "dpc": "03031634601",
            "name": "ឈៀង  ឡុង"
        },
        {
            "barcode": "171126799",
            "dpc": "03031634701",
            "name": "កែវ  សានិត"
        },
        {
            "barcode": "171126800",
            "dpc": "03031634901",
            "name": "យាំ  ឃួង"
        },
        {
            "barcode": "171126801",
            "dpc": "03031634801",
            "name": "ញ៉ែម  សុវណ្ណ"
        },
        {
            "barcode": "171126802",
            "dpc": "03031635001",
            "name": "ជូរ  ចាន់រិទ្ធ"
        },
        {
            "barcode": "171126803",
            "dpc": "03031635101",
            "name": "ហាក់  ឡាយ"
        },
        {
            "barcode": "171126804",
            "dpc": "03031635301",
            "name": "អាង  សៀក ២"
        },
        {
            "barcode": "171126805",
            "dpc": "03031646101",
            "name": "អ៊ុំ ខុន"
        },
        {
            "barcode": "171126806",
            "dpc": "03031645901",
            "name": "ហាស់ អសនី"
        },
        {
            "barcode": "171126807",
            "dpc": "03031646201",
            "name": "ប៉ោ លី"
        },
        {
            "barcode": "171126808",
            "dpc": "03031646301",
            "name": "ស៊ុយ ចិន្តា"
        },
        {
            "barcode": "171126809",
            "dpc": "03031646001",
            "name": "ប៊ុន នៅ"
        },
        {
            "barcode": "171126810",
            "dpc": "03031645701",
            "name": "ពៅ ដារា"
        },
        {
            "barcode": "171126811",
            "dpc": "03031646501",
            "name": "ខេង ទី"
        },
        {
            "barcode": "171126812",
            "dpc": "03031646401",
            "name": "ប៊ី បុប្ផា"
        },
        {
            "barcode": "171126813",
            "dpc": "03031646601",
            "name": "មូល ផល្លា"
        },
        {
            "barcode": "171126814",
            "dpc": "03031646701",
            "name": "ជា បុប្ផា"
        },
        {
            "barcode": "171126815",
            "dpc": "03031646801",
            "name": "ម៉ែន ណម"
        },
        {
            "barcode": "171126816",
            "dpc": "03031647801",
            "name": "តូ វណ្ណា"
        },
        {
            "barcode": "171126817",
            "dpc": "03031647401",
            "name": "លី ម៉េង(ថ្មី)"
        },
        {
            "barcode": "171126818",
            "dpc": "03031647601",
            "name": "កេង ហួត"
        },
        {
            "barcode": "171126819",
            "dpc": "03031647701",
            "name": "ហ៊ុយ ថាណាវី"
        },
        {
            "barcode": "171126820",
            "dpc": "03031640201",
            "name": "វ៉ែន  ទីន"
        },
        {
            "barcode": "171126821",
            "dpc": "03031640301",
            "name": "មឿន   ម៉ន"
        },
        {
            "barcode": "171126822",
            "dpc": "03031640401",
            "name": "ណៃ  ព្រីឆា"
        },
        {
            "barcode": "171126823",
            "dpc": "03031640601",
            "name": "សូ  ឌឿន"
        },
        {
            "barcode": "171126824",
            "dpc": "03031640801",
            "name": "យិន  មន្នី"
        },
        {
            "barcode": "171126825",
            "dpc": "03031640901",
            "name": "នួន  សារេត"
        },
        {
            "barcode": "171126826",
            "dpc": "03031641001",
            "name": "ឈឿប  តៅ"
        },
        {
            "barcode": "171126827",
            "dpc": "03031641101",
            "name": "ឈឿត  មករា"
        },
        {
            "barcode": "171126828",
            "dpc": "03031641201",
            "name": "គង់  សៀន"
        },
        {
            "barcode": "171126829",
            "dpc": "03031641301",
            "name": "កេង  សុវណ្ណ"
        },
        {
            "barcode": "171126830",
            "dpc": "03031641401",
            "name": "ពុធ  ម៉េង"
        },
        {
            "barcode": "171126831",
            "dpc": "03031640701",
            "name": "សូត្រ  ណាំង"
        },
        {
            "barcode": "171126832",
            "dpc": "03031641501",
            "name": "អ៊ុក  អូន"
        },
        {
            "barcode": "171126833",
            "dpc": "03031641601",
            "name": "បាន   សុខវី"
        },
        {
            "barcode": "171126834",
            "dpc": "03031641701",
            "name": "ឆៃ  លី"
        },
        {
            "barcode": "171126835",
            "dpc": "03031641801",
            "name": "ម៉ម  រតនា"
        },
        {
            "barcode": "171126836",
            "dpc": "03031641901",
            "name": "ទាវ  វុទ្ធី (ក្រោយ)"
        },
        {
            "barcode": "171126837",
            "dpc": "03031642001",
            "name": "ណុប  អេង"
        },
        {
            "barcode": "171126838",
            "dpc": "03031642101",
            "name": "ហេង  ណៃ"
        },
        {
            "barcode": "171126839",
            "dpc": "03031642201",
            "name": "ទាវ វុទ្ធី (មុខ)"
        },
        {
            "barcode": "171126840",
            "dpc": "03031642301",
            "name": "តោ  កុយហួង"
        },
        {
            "barcode": "171126841",
            "dpc": "03031642401",
            "name": "ជួប  សុភី"
        },
        {
            "barcode": "171126842",
            "dpc": "03031642501",
            "name": "រឿន  ឡោ"
        },
        {
            "barcode": "171126843",
            "dpc": "03031642601",
            "name": "យិន  វុនហាន"
        },
        {
            "barcode": "171126844",
            "dpc": "03031642701",
            "name": "ហេង  ជួង"
        },
        {
            "barcode": "171126845",
            "dpc": "03031642801",
            "name": "សៅ  រតនា"
        },
        {
            "barcode": "171126846",
            "dpc": "03031642901",
            "name": "ខូវ  សៀងហុង"
        },
        {
            "barcode": "171126847",
            "dpc": "03031643001",
            "name": "ជីវ  ម៉េង"
        },
        {
            "barcode": "171126848",
            "dpc": "03031643101",
            "name": "ឡុង  ប៊ុនលី"
        },
        {
            "barcode": "171126849",
            "dpc": "03031643201",
            "name": "គង់  សាមិត្ត"
        },
        {
            "barcode": "171126850",
            "dpc": "03031643301",
            "name": "ហេង  គាង"
        },
        {
            "barcode": "171126851",
            "dpc": "03031643401",
            "name": "ផ្លុង  មករា"
        },
        {
            "barcode": "171126852",
            "dpc": "03031643501",
            "name": "សោម  សុខា"
        },
        {
            "barcode": "171126853",
            "dpc": "03031643601",
            "name": "លោក  តា"
        },
        {
            "barcode": "171126854",
            "dpc": "03031643701",
            "name": "ខូវ  ស្រេង"
        },
        {
            "barcode": "171126855",
            "dpc": "03031643801",
            "name": "ខូវ  ផល្លី"
        },
        {
            "barcode": "171126856",
            "dpc": "03031643901",
            "name": "សៀវ  ឡាយហូយ"
        },
        {
            "barcode": "171126857",
            "dpc": "03031644001",
            "name": "យិន  ពីសី"
        },
        {
            "barcode": "171126858",
            "dpc": "03031644101",
            "name": "នៅ  សាមិត្ត"
        },
        {
            "barcode": "171126859",
            "dpc": "03031644201",
            "name": "ផេង  សារុន"
        },
        {
            "barcode": "171126860",
            "dpc": "03031644401",
            "name": "លឹម  វង្ស"
        },
        {
            "barcode": "171126861",
            "dpc": "03031644501",
            "name": "នួន  ឆាន"
        },
        {
            "barcode": "171126862",
            "dpc": "03031644601",
            "name": "ចាន់  ធា"
        },
        {
            "barcode": "171126863",
            "dpc": "03031644701",
            "name": "ង៉ូវ  សៀង"
        },
        {
            "barcode": "171126864",
            "dpc": "03031644901",
            "name": "មាស  សារី"
        },
        {
            "barcode": "171126865",
            "dpc": "03031645001",
            "name": "ង៉ែត ណែម"
        },
        {
            "barcode": "171126866",
            "dpc": "03031645101",
            "name": "ស៊ីម  ម៉េងស្រេង"
        },
        {
            "barcode": "171126867",
            "dpc": "03031645201",
            "name": "ម៉ៅ  សៀម"
        },
        {
            "barcode": "171126868",
            "dpc": "03031645301",
            "name": "ជុំ   នី"
        },
        {
            "barcode": "171126869",
            "dpc": "03031645501",
            "name": "តៀង  ថាញ់"
        },
        {
            "barcode": "171126870",
            "dpc": "03031645401",
            "name": "ជា ជុំ"
        },
        {
            "barcode": "171126871",
            "dpc": "03031645801",
            "name": "ឃួន  រ៉ាវុធ"
        },
        {
            "barcode": "171126872",
            "dpc": "03031636501",
            "name": "ឈួម ប៉ាន"
        },
        {
            "barcode": "171126873",
            "dpc": "03031636601",
            "name": "ទ្រី ម៉ុង ១"
        },
        {
            "barcode": "171126874",
            "dpc": "03031636701",
            "name": "ទ្រី ម៉ុង ២"
        },
        {
            "barcode": "171126875",
            "dpc": "03031636801",
            "name": "អ៊ីវ លាភ"
        },
        {
            "barcode": "171126876",
            "dpc": "03031636901",
            "name": "ស៊ឹម យុទ្ធាសារ"
        },
        {
            "barcode": "171126877",
            "dpc": "03031637001",
            "name": "លី ហាក់ហាន់"
        },
        {
            "barcode": "171126878",
            "dpc": "03031637101",
            "name": "គឹម សារិទ្ធ"
        },
        {
            "barcode": "171126879",
            "dpc": "03031637301",
            "name": "តាន់ វុតថា"
        },
        {
            "barcode": "171126880",
            "dpc": "03031637401",
            "name": "សេង ម៉ាង ៣"
        },
        {
            "barcode": "171126881",
            "dpc": "03031637501",
            "name": "សឹន សំរេច"
        },
        {
            "barcode": "171126882",
            "dpc": "03031637601",
            "name": "សួស ផូរ"
        },
        {
            "barcode": "171126883",
            "dpc": "03031637901",
            "name": "ទឹម យូនេត្រ"
        },
        {
            "barcode": "171126884",
            "dpc": "03031637701",
            "name": "ប្រាក់ សុកិទ"
        },
        {
            "barcode": "171126885",
            "dpc": "03031637801",
            "name": "អេ សារ៉ុម"
        },
        {
            "barcode": "171126886",
            "dpc": "03031638101",
            "name": "សោម សុន"
        },
        {
            "barcode": "171126887",
            "dpc": "03031638201",
            "name": "ហ៊ីង បូរ"
        },
        {
            "barcode": "171126888",
            "dpc": "03031638301",
            "name": "អៀ មួយគា"
        },
        {
            "barcode": "171126889",
            "dpc": "03031638401",
            "name": "យឹម វឌ្ឍនា"
        },
        {
            "barcode": "171126890",
            "dpc": "03031638501",
            "name": "ហុង លីហួរ"
        },
        {
            "barcode": "171126891",
            "dpc": "03031638601",
            "name": "លឹម សៀង"
        },
        {
            "barcode": "171126892",
            "dpc": "03031638701",
            "name": "អ៊ុក វណ្ណា"
        },
        {
            "barcode": "171126893",
            "dpc": "03031638801",
            "name": "តេវ វន្ថា"
        },
        {
            "barcode": "171126894",
            "dpc": "03031638901",
            "name": "លី វេងថៃ"
        },
        {
            "barcode": "171126895",
            "dpc": "03031639001",
            "name": "កុក ហួរ"
        },
        {
            "barcode": "171126896",
            "dpc": "03031639101",
            "name": "ឈុន ហ៊ត"
        },
        {
            "barcode": "171126897",
            "dpc": "03031639201",
            "name": "លី មាន"
        },
        {
            "barcode": "171126898",
            "dpc": "03031639301",
            "name": "ស៊ុត សុផល"
        },
        {
            "barcode": "171126899",
            "dpc": "03031639701",
            "name": "ឆាន់ ហុង"
        },
        {
            "barcode": "171126900",
            "dpc": "03031639801",
            "name": "អ៊ុក វុទ្ធី"
        },
        {
            "barcode": "171126901",
            "dpc": "03031639601",
            "name": "ស៊ុំ សំនៀង"
        },
        {
            "barcode": "171126902",
            "dpc": "03031639501",
            "name": "សេក ម៉ូលី"
        },
        {
            "barcode": "171126903",
            "dpc": "03031639401",
            "name": "យិន ភិច"
        },
        {
            "barcode": "171126904",
            "dpc": "03031647901",
            "name": "អ៊ុយ ង៉ក់"
        },
        {
            "barcode": "171126905",
            "dpc": "03031646901",
            "name": "នាង សល"
        },
        {
            "barcode": "171126906",
            "dpc": "03031638001",
            "name": "ញ៉ែម គង់"
        },
        {
            "barcode": "171126907",
            "dpc": "03031636401",
            "name": "ឡាយ កៅ"
        },
        {
            "barcode": "171126908",
            "dpc": "03031636301",
            "name": "ប៉ច សុវណ្ណ"
        },
        {
            "barcode": "171126909",
            "dpc": "03031636201",
            "name": "អ៊ឹង ឡៃហុក"
        },
        {
            "barcode": "171126910",
            "dpc": "03031636001",
            "name": "តាំង សុខជូ"
        },
        {
            "barcode": "171126911",
            "dpc": "03031635201",
            "name": "អាង សៀក ១"
        },
        {
            "barcode": "171126912",
            "dpc": "03031634301",
            "name": "ងួន  ហ៊ួរ"
        },
        {
            "barcode": "171126913",
            "dpc": "03031634401",
            "name": "សាញ់  ញឹម"
        },
        {
            "barcode": "171126914",
            "dpc": "03031634501",
            "name": "ងួន  ហួត"
        },
        {
            "barcode": "171126915",
            "dpc": "03031635501",
            "name": "ម៉ូវ  ហោ"
        },
        {
            "barcode": "171126916",
            "dpc": "03031639901",
            "name": "ជូ  សែ"
        },
        {
            "barcode": "171126917",
            "dpc": "03031640001",
            "name": "មេន  ពិសិទ្ធ"
        },
        {
            "barcode": "171126918",
            "dpc": "03031640101",
            "name": "សេង  ម៉េង"
        },
        {
            "barcode": "171126919",
            "dpc": "03031640501",
            "name": "រឿន  ផល្លី"
        },
        {
            "barcode": "171126920",
            "dpc": "03031644801",
            "name": "ហឿន  ទិត្យ"
        },
        {
            "barcode": "171126921",
            "dpc": "03031648001",
            "name": "ញ៉ែម ហ៊ាន"
        }
    ]
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
