let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
[
  {
    "barcode": "171127972",
    "dpc": "03031747001",
    "name": "អ៊ឹង ឡៃហុក"
  },
  {
    "barcode": "171127973",
    "dpc": "03031746701",
    "name": "ស៊ិន វ៉ាត"
  },
  {
    "barcode": "171127974",
    "dpc": "03031745801",
    "name": "សំ គីម"
  },
  {
    "barcode": "171127975",
    "dpc": "03031747501",
    "name": "ហេង ណែត"
  },
  {
    "barcode": "171127976",
    "dpc": "03031746101",
    "name": "ពុត ពៅ"
  },
  {
    "barcode": "171127977",
    "dpc": "03031746001",
    "name": "ប៉ែន សុគន្ធី"
  },
  {
    "barcode": "171127978",
    "dpc": "03031729801",
    "name": "ទែន ជំនិត"
  },
  {
    "barcode": "171127979",
    "dpc": "03031729701",
    "name": "គង់ ឆាយ (ខាងក្រៅ)"
  },
  {
    "barcode": "171127980",
    "dpc": "03031729601",
    "name": "គង់ ឆាយ (ខាងក្នុង)"
  },
  {
    "barcode": "171127981",
    "dpc": "03031729501",
    "name": "ប៊ុន ចាន់នី"
  },
  {
    "barcode": "171127982",
    "dpc": "03031729401",
    "name": "ស៊ិង យឿង"
  },
  {
    "barcode": "171127983",
    "dpc": "03031729301",
    "name": "សេក ឃីម"
  },
  {
    "barcode": "171127984",
    "dpc": "03031729201",
    "name": "គឹម ស៊្រុន"
  },
  {
    "barcode": "171127985",
    "dpc": "03031729101",
    "name": "មាស កាន"
  },
  {
    "barcode": "171127986",
    "dpc": "03031729001",
    "name": "ហេង ស៊ីថន"
  },
  {
    "barcode": "171127987",
    "dpc": "03031730001",
    "name": "បឹង ឡោម"
  },
  {
    "barcode": "171127988",
    "dpc": "03031728901",
    "name": "អ៊ឹម សូត្រ"
  },
  {
    "barcode": "171127989",
    "dpc": "03031730301",
    "name": "ញ៉ញ់ ជល"
  },
  {
    "barcode": "171127990",
    "dpc": "03031728801",
    "name": "នង ឃីម"
  },
  {
    "barcode": "171127991",
    "dpc": "03031728701",
    "name": "លិញ ម្លិៈ"
  },
  {
    "barcode": "171127992",
    "dpc": "03031728601",
    "name": "សុខ សុម៉ាលី"
  },
  {
    "barcode": "171127993",
    "dpc": "03031731701",
    "name": "អ៊ុំ សុខម៉េត"
  },
  {
    "barcode": "171127994",
    "dpc": "03031731801",
    "name": "ញ៉ែម យឿប"
  },
  {
    "barcode": "171127995",
    "dpc": "03031731901",
    "name": "វរ សានិត"
  },
  {
    "barcode": "171127996",
    "dpc": "03031730401",
    "name": "ម៉ៅ សុភាព"
  },
  {
    "barcode": "171127997",
    "dpc": "03031730601",
    "name": "ហេង ជីឃាង"
  },
  {
    "barcode": "171127998",
    "dpc": "03031730501",
    "name": "អ៊ុក ស៊ីផាន់"
  },
  {
    "barcode": "171127999",
    "dpc": "03031730701",
    "name": "សូ សុង"
  },
  {
    "barcode": "171128000",
    "dpc": "03031730801",
    "name": "គុយ វង"
  },
  {
    "barcode": "171128001",
    "dpc": "03031730901",
    "name": "ចក់ ចរិយា"
  },
  {
    "barcode": "171128002",
    "dpc": "03031731001",
    "name": "អ៊ីវ សម្បត្តិ"
  },
  {
    "barcode": "171128003",
    "dpc": "03031731101",
    "name": "សែន ចាន់ដារ៉ា"
  },
  {
    "barcode": "171128004",
    "dpc": "03031731201",
    "name": "ស៊ិន ស៊ីថន"
  },
  {
    "barcode": "171128005",
    "dpc": "03031731301",
    "name": "ញ៉ែម សុផើន"
  },
  {
    "barcode": "171128006",
    "dpc": "03031731401",
    "name": "ទាវ អោម"
  },
  {
    "barcode": "171128007",
    "dpc": "03031731501",
    "name": "សុខ ជុំ"
  },
  {
    "barcode": "171128008",
    "dpc": "03031729901",
    "name": "ញ៉ែម ឡី"
  },
  {
    "barcode": "171128009",
    "dpc": "03031728501",
    "name": "អ៊ិត តាន់"
  },
  {
    "barcode": "171128010",
    "dpc": "03031735701",
    "name": "រឿន មករា"
  },
  {
    "barcode": "171128011",
    "dpc": "03031730201",
    "name": "យន់ ថា"
  },
  {
    "barcode": "171128012",
    "dpc": "03031728301",
    "name": "កែវ វុត្ថា"
  },
  {
    "barcode": "171128013",
    "dpc": "03031728201",
    "name": "ជា ត្រឹក"
  },
  {
    "barcode": "171128014",
    "dpc": "03031728101",
    "name": "ញឹក ថន"
  },
  {
    "barcode": "171128015",
    "dpc": "03031727901",
    "name": "ជា ណៃ"
  },
  {
    "barcode": "171128016",
    "dpc": "03031727801",
    "name": "យ៉ត ប៊ុនវឿត"
  },
  {
    "barcode": "171128017",
    "dpc": "03031727701",
    "name": "ស៊ា សុគន្ធ"
  },
  {
    "barcode": "171128018",
    "dpc": "03031727601",
    "name": "ខៀវ វិន"
  },
  {
    "barcode": "171128019",
    "dpc": "03031727501",
    "name": "រុំ សឿត"
  },
  {
    "barcode": "171128020",
    "dpc": "03031727401",
    "name": "ហ៊ុន សាវុឌ្ឍ"
  },
  {
    "barcode": "171128021",
    "dpc": "03031727301",
    "name": "ជា ទ្រី"
  },
  {
    "barcode": "171128022",
    "dpc": "03031727201",
    "name": "លី ហួត"
  },
  {
    "barcode": "171128023",
    "dpc": "03031727101",
    "name": "ស៊ូ ស៊ានយន"
  },
  {
    "barcode": "171128024",
    "dpc": "03031727001",
    "name": "លីវ ស៊ុនលាង"
  },
  {
    "barcode": "171128025",
    "dpc": "03031726901",
    "name": "អ៊ុំ រ៉ុន"
  },
  {
    "barcode": "171128026",
    "dpc": "03031726801",
    "name": "យឹម ភក្តី"
  },
  {
    "barcode": "171128027",
    "dpc": "03031726701",
    "name": "ម៉ៅ ម៉ាលី"
  },
  {
    "barcode": "171128028",
    "dpc": "03031726601",
    "name": "គឹម រតនៈ"
  },
  {
    "barcode": "171128029",
    "dpc": "03031726501",
    "name": "សែម សំ"
  },
  {
    "barcode": "171128030",
    "dpc": "03031726401",
    "name": "ឃួន ស៊ីថា"
  },
  {
    "barcode": "171128031",
    "dpc": "03031726301",
    "name": "ប៉ែន ទូច"
  },
  {
    "barcode": "171128032",
    "dpc": "03031726201",
    "name": "លី សុខហ៊ុយ"
  },
  {
    "barcode": "171128033",
    "dpc": "03031726101",
    "name": "ប៉ោ ស៊ីណា"
  },
  {
    "barcode": "171128034",
    "dpc": "03031726001",
    "name": "វង្ស ហួត"
  },
  {
    "barcode": "171128035",
    "dpc": "03031725801",
    "name": "ឌុក ធារី"
  },
  {
    "barcode": "171128036",
    "dpc": "03031725901",
    "name": "សុខ អៀម"
  },
  {
    "barcode": "171128037",
    "dpc": "03031725701",
    "name": "យីន គឹមតឹង"
  },
  {
    "barcode": "171128038",
    "dpc": "03031725601",
    "name": "យូ វណ្ណៈ"
  },
  {
    "barcode": "171128039",
    "dpc": "03031725501",
    "name": "សឹង នី"
  },
  {
    "barcode": "171128040",
    "dpc": "03031725401",
    "name": "សុវណ្ណ វឿន"
  },
  {
    "barcode": "171128041",
    "dpc": "03031725301",
    "name": "ចាន់ កុសល់"
  },
  {
    "barcode": "171128042",
    "dpc": "03031725201",
    "name": "គឹម ឡុង"
  },
  {
    "barcode": "171128043",
    "dpc": "03031725101",
    "name": "គឹម លាង"
  },
  {
    "barcode": "171128044",
    "dpc": "03031725001",
    "name": "ថាច់ សាមិត"
  },
  {
    "barcode": "171128045",
    "dpc": "03031724901",
    "name": "ធឹម សុគន្ធ"
  },
  {
    "barcode": "171128046",
    "dpc": "03031724801",
    "name": "គឹម គិមអេង"
  },
  {
    "barcode": "171128047",
    "dpc": "03031724701",
    "name": "ផេង ភន"
  },
  {
    "barcode": "171128048",
    "dpc": "03031724601",
    "name": "ថាច់ ម៉ឹង"
  },
  {
    "barcode": "171128049",
    "dpc": "03031724501",
    "name": "ឆេង សម្បត្តិ"
  },
  {
    "barcode": "171128050",
    "dpc": "03031724401",
    "name": "ហុន ឃុនឆឺត"
  },
  {
    "barcode": "171128051",
    "dpc": "03031724301",
    "name": "ប៊ុត អៀម"
  },
  {
    "barcode": "171128052",
    "dpc": "03031724201",
    "name": "លីវ គឹមឆេង"
  },
  {
    "barcode": "171128053",
    "dpc": "03031724101",
    "name": "អ៊ិត ទៀង"
  },
  {
    "barcode": "171128054",
    "dpc": "03031724001",
    "name": "ហម សៀកឡាយ"
  },
  {
    "barcode": "171128055",
    "dpc": "03031723901",
    "name": "ប៉ូ សម្បត្តិ"
  },
  {
    "barcode": "171128056",
    "dpc": "03031745701",
    "name": "ចៅ សាន់ទី"
  },
  {
    "barcode": "171128057",
    "dpc": "03031746301",
    "name": "ឡូញ ឈៀង"
  },
  {
    "barcode": "171128058",
    "dpc": "03031746501",
    "name": "ឡុង ឌាល"
  },
  {
    "barcode": "171128059",
    "dpc": "03031746401",
    "name": "វ៉ា ភ្សេម"
  },
  {
    "barcode": "171128060",
    "dpc": "03031747701",
    "name": "សាំង យូហេង"
  },
  {
    "barcode": "171128061",
    "dpc": "03031747801",
    "name": "ឯក សារុំ"
  },
  {
    "barcode": "171128062",
    "dpc": "03031747601",
    "name": "ភេន  សុភា"
  },
  {
    "barcode": "171128063",
    "dpc": "03031746801",
    "name": "ហេង សំអាត"
  },
  {
    "barcode": "171128064",
    "dpc": "03031746901",
    "name": "អនុវិទ្យាល័យ ទួលតាឯក"
  },
  {
    "barcode": "171128065",
    "dpc": "03031747401",
    "name": "សាន ពលៈ"
  },
  {
    "barcode": "171128066",
    "dpc": "03031747101",
    "name": "គាម ងនលី"
  },
  {
    "barcode": "171128067",
    "dpc": "03031747301",
    "name": "ម៉ម រ័ត្នមុនី"
  },
  {
    "barcode": "171128068",
    "dpc": "03031747201",
    "name": "ដាញ់ សារី"
  },
  {
    "barcode": "171128069",
    "dpc": "03031745601",
    "name": "ប៊ុន ធឿម"
  },
  {
    "barcode": "171128070",
    "dpc": "03031745901",
    "name": "ហាក់ ស៊្រុន"
  },
  {
    "barcode": "171128071",
    "dpc": "03031747901",
    "name": "ជូ ហឹង"
  },
  {
    "barcode": "171128072",
    "dpc": "03031746201",
    "name": "យឿន  ស្រីសាប"
  },
  {
    "barcode": "171128073",
    "dpc": "03031715401",
    "name": "ស្រី អូន"
  },
  {
    "barcode": "171128074",
    "dpc": "03031742201",
    "name": "ទេព  ប៊ុនលី"
  },
  {
    "barcode": "171128075",
    "dpc": "03031742401",
    "name": "សាង  ភីន"
  },
  {
    "barcode": "171128076",
    "dpc": "03031741201",
    "name": "លឹម  គង់"
  },
  {
    "barcode": "171128077",
    "dpc": "03031742701",
    "name": "ធួន  រ៉ាវុធ"
  },
  {
    "barcode": "171128078",
    "dpc": "03031742601",
    "name": "ឈួយ  វណ្ណៈ"
  },
  {
    "barcode": "171128079",
    "dpc": "03031745101",
    "name": "ហាក់ ឡាយ ២"
  },
  {
    "barcode": "171128080",
    "dpc": "03031742301",
    "name": "យន់ សុគន្ធ"
  },
  {
    "barcode": "171128081",
    "dpc": "03031740601",
    "name": "ទួត   សំអាង"
  },
  {
    "barcode": "171128082",
    "dpc": "03031741701",
    "name": "គុយ  ម៉េង"
  },
  {
    "barcode": "171128083",
    "dpc": "03031741601",
    "name": "ឈុំ ឈុត"
  },
  {
    "barcode": "171128084",
    "dpc": "03031739801",
    "name": "ខាន់ ម៉ាណេ"
  },
  {
    "barcode": "171128085",
    "dpc": "03031735801",
    "name": "វ៉ាន់ ស៊ឹមវ៉ា"
  },
  {
    "barcode": "171128086",
    "dpc": "03031735901",
    "name": "អ៊ឹម បណ្ឌិត"
  },
  {
    "barcode": "171128087",
    "dpc": "03031736001",
    "name": "ហួត អៀងតុង"
  },
  {
    "barcode": "171128088",
    "dpc": "03031736101",
    "name": "តាន់ គឹមឡុង"
  },
  {
    "barcode": "171128089",
    "dpc": "03031736201",
    "name": "ហ៊ឹម យ៉ាន"
  },
  {
    "barcode": "171128090",
    "dpc": "03031736301",
    "name": "ជា នី"
  },
  {
    "barcode": "171128091",
    "dpc": "03031736401",
    "name": "ហ៊ឹម មហាម៉ាត់"
  },
  {
    "barcode": "171128092",
    "dpc": "03031736501",
    "name": "ចឹក  ម៉ៅ"
  },
  {
    "barcode": "171128093",
    "dpc": "03031736601",
    "name": "គង់ ចាន់ណា"
  },
  {
    "barcode": "171128094",
    "dpc": "03031736701",
    "name": "លឹម ហេង"
  },
  {
    "barcode": "171128095",
    "dpc": "03031736801",
    "name": "អឿន សំអាត"
  },
  {
    "barcode": "171128096",
    "dpc": "03031737001",
    "name": "ហេង លីម"
  },
  {
    "barcode": "171128097",
    "dpc": "03031737101",
    "name": "វង្ស វុទ្ធី"
  },
  {
    "barcode": "171128098",
    "dpc": "03031737201",
    "name": "ចេង ប៊ុនណាត"
  },
  {
    "barcode": "171128099",
    "dpc": "03031737501",
    "name": "ចាន់ សុភាព"
  },
  {
    "barcode": "171128100",
    "dpc": "03031737401",
    "name": "សុខ ប៊ុនដារ៉ា ២"
  },
  {
    "barcode": "171128101",
    "dpc": "03031737301",
    "name": "ហាន ធីតា"
  },
  {
    "barcode": "171128102",
    "dpc": "03031737601",
    "name": "ជា ដាវុធ"
  },
  {
    "barcode": "171128103",
    "dpc": "03031737701",
    "name": "ហេង រិទ្ធី"
  },
  {
    "barcode": "171128104",
    "dpc": "03031738601",
    "name": "ហុក រ៉ាវុធ"
  },
  {
    "barcode": "171128105",
    "dpc": "03031738501",
    "name": "ហេង រិទ្ធី"
  },
  {
    "barcode": "171128106",
    "dpc": "03031738801",
    "name": "អឿន សំអាត"
  },
  {
    "barcode": "171128107",
    "dpc": "03031738701",
    "name": "ព្រំ សុផល"
  },
  {
    "barcode": "171128108",
    "dpc": "03031738901",
    "name": "ឈៀង ឈុន"
  },
  {
    "barcode": "171128109",
    "dpc": "03031740201",
    "name": "សាយ ស៊ីណា"
  },
  {
    "barcode": "171128110",
    "dpc": "03031739001",
    "name": "ជា ហ្សីម"
  },
  {
    "barcode": "171128111",
    "dpc": "03031740401",
    "name": "កូវ ហុងឃៀង"
  },
  {
    "barcode": "171128112",
    "dpc": "03031739601",
    "name": "យាំកាយីសាយមិន"
  },
  {
    "barcode": "171128113",
    "dpc": "03031739701",
    "name": "លឹម គុយហេង"
  },
  {
    "barcode": "171128114",
    "dpc": "03031739501",
    "name": "ផេង សុខុម"
  },
  {
    "barcode": "171128115",
    "dpc": "03031739201",
    "name": "ស៊ិន សុគន្ធា"
  },
  {
    "barcode": "171128116",
    "dpc": "03031740301",
    "name": "សុខ ភាព"
  },
  {
    "barcode": "171128117",
    "dpc": "03031739901",
    "name": "ហ៊ត តាំងវែង"
  },
  {
    "barcode": "171128118",
    "dpc": "03031740101",
    "name": "ឡាច សុភាព"
  },
  {
    "barcode": "171128119",
    "dpc": "03031739301",
    "name": "សយ បូរ៉ា"
  },
  {
    "barcode": "171128120",
    "dpc": "03031739401",
    "name": "ប៉េង ស៊ីប៉ូ"
  },
  {
    "barcode": "171128121",
    "dpc": "03031737801",
    "name": "ជូ ចាន់សុភ័ក្រ្ត ១"
  },
  {
    "barcode": "171128122",
    "dpc": "03031737901",
    "name": "ជូ ចាន់សុភ័ក្រ្ត ២"
  },
  {
    "barcode": "171128123",
    "dpc": "03031738001",
    "name": "ជា តាំង"
  },
  {
    "barcode": "171128124",
    "dpc": "03031738101",
    "name": "គិន ឆាន"
  },
  {
    "barcode": "171128125",
    "dpc": "03031738201",
    "name": "អឿន គុណភិរម្យ"
  },
  {
    "barcode": "171128126",
    "dpc": "03031738301",
    "name": "ស៊ឹម ហ្វូល"
  },
  {
    "barcode": "171128127",
    "dpc": "03031738401",
    "name": "ស៊ាន ផា"
  },
  {
    "barcode": "171128128",
    "dpc": "03031740001",
    "name": "តាន់ មុំ"
  },
  {
    "barcode": "171128129",
    "dpc": "03031744901",
    "name": "ចាយ ពណ្ណរី"
  },
  {
    "barcode": "171128130",
    "dpc": "03031744401",
    "name": "ធៀម  ប៊ុនធឿន"
  },
  {
    "barcode": "171128131",
    "dpc": "03031744501",
    "name": "រតនៈ ចាន់សេរី"
  },
  {
    "barcode": "171128132",
    "dpc": "03031745301",
    "name": "យន់ ប៊ុនរី"
  },
  {
    "barcode": "171128133",
    "dpc": "03031735501",
    "name": "ឈាង វីរៈ"
  },
  {
    "barcode": "171128134",
    "dpc": "03031735601",
    "name": "ខួច ស៊ុនហេង"
  },
  {
    "barcode": "171128135",
    "dpc": "03031745401",
    "name": "យូ ឆាយ"
  },
  {
    "barcode": "171128136",
    "dpc": "03031705301",
    "name": "សុខ តាំង"
  },
  {
    "barcode": "171128137",
    "dpc": "03031743401",
    "name": "ចៅ សុវណ្ណ"
  },
  {
    "barcode": "171128138",
    "dpc": "03031705001",
    "name": "មៀច ផេង ២"
  },
  {
    "barcode": "171128139",
    "dpc": "03031704901",
    "name": "មៀច ផេង ១"
  },
  {
    "barcode": "171128140",
    "dpc": "03031704701",
    "name": "សួន សុគន្ធ"
  },
  {
    "barcode": "171128141",
    "dpc": "03031704601",
    "name": "ជា ហ៊ុយ"
  },
  {
    "barcode": "171128142",
    "dpc": "03031704501",
    "name": "ហេង កង"
  },
  {
    "barcode": "171128143",
    "dpc": "03031704401",
    "name": "ប៉ឹង ឈុននី"
  },
  {
    "barcode": "171128144",
    "dpc": "03031704301",
    "name": "ប៉ឹង ខី"
  },
  {
    "barcode": "171128145",
    "dpc": "03031704201",
    "name": "ស៊ា សុផល២"
  },
  {
    "barcode": "171128146",
    "dpc": "03031704101",
    "name": "មុំ ក្រាត"
  },
  {
    "barcode": "171128147",
    "dpc": "03031704001",
    "name": "តាន់ សុជិត ២"
  },
  {
    "barcode": "171128148",
    "dpc": "03031703901",
    "name": "សៀង ណាវី"
  },
  {
    "barcode": "171128149",
    "dpc": "03031703801",
    "name": "ទាវ ជូឡុង"
  },
  {
    "barcode": "171128150",
    "dpc": "03031703701",
    "name": "ស៊ា សុផល ១"
  },
  {
    "barcode": "171128151",
    "dpc": "03031703601",
    "name": "ដួង រតនា"
  },
  {
    "barcode": "171128152",
    "dpc": "03031703501",
    "name": "ហួត តាំង"
  },
  {
    "barcode": "171128153",
    "dpc": "03031745501",
    "name": "ព្រំ សុផាន"
  },
  {
    "barcode": "171128154",
    "dpc": "03031703401",
    "name": "ម៉ៅ ឃីន"
  },
  {
    "barcode": "171128155",
    "dpc": "03031703201",
    "name": "ចេង  សុលីន"
  },
  {
    "barcode": "171128156",
    "dpc": "03031703101",
    "name": "តាន់ សុជិត ១"
  },
  {
    "barcode": "171128157",
    "dpc": "03031702801",
    "name": "ស៊ុន ប៊ុនស៊"
  },
  {
    "barcode": "171128158",
    "dpc": "03031703001",
    "name": "លី ហាក់"
  },
  {
    "barcode": "171128159",
    "dpc": "03031702901",
    "name": "កែ ទី"
  },
  {
    "barcode": "171128160",
    "dpc": "03031707601",
    "name": "មុំ ភា"
  },
  {
    "barcode": "171128161",
    "dpc": "03031707701",
    "name": "អែម ដារី"
  },
  {
    "barcode": "171128162",
    "dpc": "03031707801",
    "name": "កែវ ចាន់ណាវុធ"
  },
  {
    "barcode": "171128163",
    "dpc": "03031744201",
    "name": "នួន នារី"
  },
  {
    "barcode": "171128164",
    "dpc": "03031708001",
    "name": "ជុំ ណារេត"
  },
  {
    "barcode": "171128165",
    "dpc": "03031708101",
    "name": "សាំង ចិត្រា"
  },
  {
    "barcode": "171128166",
    "dpc": "03031708201",
    "name": "ឡុង សឿនអេន"
  },
  {
    "barcode": "171128167",
    "dpc": "03031708301",
    "name": "ជិន សាន់"
  },
  {
    "barcode": "171128168",
    "dpc": "03031708401",
    "name": "ឈឿប តៅ"
  },
  {
    "barcode": "171128169",
    "dpc": "03031708501",
    "name": "ជា សាន់"
  },
  {
    "barcode": "171128170",
    "dpc": "03031708601",
    "name": "ឯម សារិន"
  },
  {
    "barcode": "171128171",
    "dpc": "03031708701",
    "name": "យិន ម៉ាន់"
  },
  {
    "barcode": "171128172",
    "dpc": "03031709001",
    "name": "សុខ តាំង"
  },
  {
    "barcode": "171128173",
    "dpc": "03031700101",
    "name": "ផ្លុង វុឌ្ឍី"
  },
  {
    "barcode": "171128174",
    "dpc": "03031700201",
    "name": "គី សុខហួរ"
  },
  {
    "barcode": "171128175",
    "dpc": "03031700301",
    "name": "ប៊ូ គឹមឈាន"
  },
  {
    "barcode": "171128176",
    "dpc": "03031700401",
    "name": "ជា វ៉ាន់លួង"
  },
  {
    "barcode": "171128177",
    "dpc": "03031700501",
    "name": "ចឹក គង់"
  },
  {
    "barcode": "171128178",
    "dpc": "03031700601",
    "name": "រាជ វណ្ណារិទ្ធ"
  },
  {
    "barcode": "171128179",
    "dpc": "03031700701",
    "name": "ប៉ាន់ ប៊ុនរឿន"
  },
  {
    "barcode": "171128180",
    "dpc": "03031700901",
    "name": "សិត លុច"
  },
  {
    "barcode": "171128181",
    "dpc": "03031701001",
    "name": "សុគន្ធា រី"
  },
  {
    "barcode": "171128182",
    "dpc": "03031701101",
    "name": "លឹម​ ថាវ ១"
  },
  {
    "barcode": "171128183",
    "dpc": "03031701201",
    "name": "ឡុង សុភាព"
  },
  {
    "barcode": "171128184",
    "dpc": "03031701301",
    "name": "លឹម ថាវ ២"
  },
  {
    "barcode": "171128185",
    "dpc": "03031701401",
    "name": "ពៅ សុវណ្ណារី"
  },
  {
    "barcode": "171128186",
    "dpc": "03031701501",
    "name": "ម៉ាក់ ហ៊ាង"
  },
  {
    "barcode": "171128187",
    "dpc": "03031701601",
    "name": "សាន ខ"
  },
  {
    "barcode": "171128188",
    "dpc": "03031701701",
    "name": "ជា មន្ថា"
  },
  {
    "barcode": "171128189",
    "dpc": "03031701801",
    "name": "ឯម កន្យា"
  },
  {
    "barcode": "171128190",
    "dpc": "03031701901",
    "name": "សូផា រិន"
  },
  {
    "barcode": "171128191",
    "dpc": "03031702001",
    "name": "យាំ ខី"
  },
  {
    "barcode": "171128192",
    "dpc": "03031702101",
    "name": "ងួន ប៊ុនអឿន"
  },
  {
    "barcode": "171128193",
    "dpc": "03031702201",
    "name": "ឡេង ហេង"
  },
  {
    "barcode": "171128194",
    "dpc": "03031702301",
    "name": "ស៊ា យេង"
  },
  {
    "barcode": "171128195",
    "dpc": "03031702401",
    "name": "អែម ញើញ"
  },
  {
    "barcode": "171128196",
    "dpc": "03031702501",
    "name": "ដាញ់ ធឹង"
  },
  {
    "barcode": "171128197",
    "dpc": "03031702601",
    "name": "តាំង ទ្រី"
  },
  {
    "barcode": "171128198",
    "dpc": "03031741501",
    "name": "ចាន់ សូវង្ស"
  },
  {
    "barcode": "171128199",
    "dpc": "03031741401",
    "name": "ឈុន ឈន"
  },
  {
    "barcode": "171128200",
    "dpc": "03031742001",
    "name": "ឡៅ ទី"
  },
  {
    "barcode": "171128201",
    "dpc": "03031733201",
    "name": "វែង ហោ"
  },
  {
    "barcode": "171128202",
    "dpc": "03031733101",
    "name": "នង ទ្រី"
  },
  {
    "barcode": "171128203",
    "dpc": "03031733001",
    "name": "សុខ សុផាត ៣"
  },
  {
    "barcode": "171128204",
    "dpc": "03031732901",
    "name": "ប្លុង ថា"
  },
  {
    "barcode": "171128205",
    "dpc": "03031732801",
    "name": "សាន ថាវន"
  },
  {
    "barcode": "171128206",
    "dpc": "03031732701",
    "name": "ម៉ែន សម្បត្តិ"
  },
  {
    "barcode": "171128207",
    "dpc": "03031732601",
    "name": "ស៊ឹម ង៉ោ"
  },
  {
    "barcode": "171128208",
    "dpc": "03031732501",
    "name": "គង់ គឿន"
  },
  {
    "barcode": "171128209",
    "dpc": "03031732401",
    "name": "នៅ ស៊ីថន"
  },
  {
    "barcode": "171128210",
    "dpc": "03031732301",
    "name": "ស៊ា ប៊ុនឃុន"
  },
  {
    "barcode": "171128211",
    "dpc": "03031732201",
    "name": "សុង សួ"
  },
  {
    "barcode": "171128212",
    "dpc": "03031732101",
    "name": "សូរ ឈិន"
  },
  {
    "barcode": "171128213",
    "dpc": "03031741301",
    "name": "ជិន តាប់"
  },
  {
    "barcode": "171128214",
    "dpc": "03031733401",
    "name": "លី តុហួរ"
  },
  {
    "barcode": "171128215",
    "dpc": "03031733501",
    "name": "ហ៊ុយ តោ"
  },
  {
    "barcode": "171128216",
    "dpc": "03031733601",
    "name": "មុយ ចាត"
  },
  {
    "barcode": "171128217",
    "dpc": "03031733701",
    "name": "ឡេង ប៊ុនឆន"
  },
  {
    "barcode": "171128218",
    "dpc": "03031733801",
    "name": "សុខ សេង"
  },
  {
    "barcode": "171128219",
    "dpc": "03031733901",
    "name": "ឆង សាវឌី"
  },
  {
    "barcode": "171128220",
    "dpc": "03031734101",
    "name": "អ៊ុក គង់"
  },
  {
    "barcode": "171128221",
    "dpc": "03031734201",
    "name": "ហ៊ាង ណែម"
  },
  {
    "barcode": "171128222",
    "dpc": "03031734301",
    "name": "ជា  កន្និកា ២"
  },
  {
    "barcode": "171128223",
    "dpc": "03031734401",
    "name": "អៀម សាខន"
  },
  {
    "barcode": "171128224",
    "dpc": "03031734501",
    "name": "កាត់ គឹមឡេង"
  },
  {
    "barcode": "171128225",
    "dpc": "03031734601",
    "name": "ឯម វរិទ្ធ"
  },
  {
    "barcode": "171128226",
    "dpc": "03031734701",
    "name": "បាន ណារិន"
  },
  {
    "barcode": "171128227",
    "dpc": "03031734801",
    "name": "សូ  លី"
  },
  {
    "barcode": "171128228",
    "dpc": "03031734901",
    "name": "ហោ គឹមសឿង"
  },
  {
    "barcode": "171128229",
    "dpc": "03031735001",
    "name": "កាយ ប៊ុនធី"
  },
  {
    "barcode": "171128230",
    "dpc": "03031735101",
    "name": "យ៉ាន់ បូផៃ"
  },
  {
    "barcode": "171128231",
    "dpc": "03031706001",
    "name": "ជា ប៊ន"
  },
  {
    "barcode": "171128232",
    "dpc": "03031706801",
    "name": "ឃឿត សុទ្ធាវី"
  },
  {
    "barcode": "171128233",
    "dpc": "03031744101",
    "name": "ជា វណ្ណី"
  },
  {
    "barcode": "171128234",
    "dpc": "03031707201",
    "name": "ម៉ៅ ស៊ុយ"
  },
  {
    "barcode": "171128235",
    "dpc": "03031707301",
    "name": "ទេព គន្ធ"
  },
  {
    "barcode": "171128236",
    "dpc": "03031707401",
    "name": "យី ឆន ១"
  },
  {
    "barcode": "171128237",
    "dpc": "03031707501",
    "name": "យី ឆន ២"
  },
  {
    "barcode": "171128238",
    "dpc": "03031744301",
    "name": "វ៉ា សំមុន្នី"
  },
  {
    "barcode": "171128239",
    "dpc": "03031705701",
    "name": "ឆាំង សុផាត"
  },
  {
    "barcode": "171128240",
    "dpc": "03031705801",
    "name": "អ៊ុយ ទិ"
  },
  {
    "barcode": "171128241",
    "dpc": "03031705901",
    "name": "ដួង សំ"
  },
  {
    "barcode": "171128242",
    "dpc": "03031711201",
    "name": "កាយ គន្ធជីវ"
  },
  {
    "barcode": "171128243",
    "dpc": "03031711001",
    "name": "តាន់ ម៉ាល័យ"
  },
  {
    "barcode": "171128244",
    "dpc": "03031710801",
    "name": "ជី ឃី"
  },
  {
    "barcode": "171128245",
    "dpc": "03031710701",
    "name": "នូ នារី"
  },
  {
    "barcode": "171128246",
    "dpc": "03031710601",
    "name": "ពាង គឹមសៀង"
  },
  {
    "barcode": "171128247",
    "dpc": "03031710501",
    "name": "ឡេង ដារ៉ា"
  },
  {
    "barcode": "171128248",
    "dpc": "03031710401",
    "name": "ទ្រីវ ទី"
  },
  {
    "barcode": "171128249",
    "dpc": "03031710301",
    "name": "ឈិន សាលី"
  },
  {
    "barcode": "171128250",
    "dpc": "03031710201",
    "name": "ថាម ផេង"
  },
  {
    "barcode": "171128251",
    "dpc": "03031710101",
    "name": "ហ៊ិន ឆេងវ័ន"
  },
  {
    "barcode": "171128252",
    "dpc": "03031710001",
    "name": "ជុំ ចំរើន"
  },
  {
    "barcode": "171128253",
    "dpc": "03031709901",
    "name": "សេង ហុក"
  },
  {
    "barcode": "171128254",
    "dpc": "03031709801",
    "name": "រិន សុផាត"
  },
  {
    "barcode": "171128255",
    "dpc": "03031709701",
    "name": "នង គឹមស៊ុន"
  },
  {
    "barcode": "171128256",
    "dpc": "03031709601",
    "name": "យូវ វិចិត្រ"
  },
  {
    "barcode": "171128257",
    "dpc": "03031709501",
    "name": "គង វុទ្ធី"
  },
  {
    "barcode": "171128258",
    "dpc": "03031709401",
    "name": "ជុំ រ៉យ"
  },
  {
    "barcode": "171128259",
    "dpc": "03031709301",
    "name": "ផាន់ សំអុល"
  },
  {
    "barcode": "171128260",
    "dpc": "03031709201",
    "name": "ម៉េង ណាត"
  },
  {
    "barcode": "171128261",
    "dpc": "03031709101",
    "name": "កេតុ សឿ"
  },
  {
    "barcode": "171128262",
    "dpc": "03031708901",
    "name": "គាត ឃី"
  },
  {
    "barcode": "171128263",
    "dpc": "03031708801",
    "name": "ថោង សុផល"
  },
  {
    "barcode": "171128264",
    "dpc": "03031706901",
    "name": "សូ សំអាន"
  },
  {
    "barcode": "171128265",
    "dpc": "03031707001",
    "name": "ស៊ុន ណារ៉ាធិបតី"
  },
  {
    "barcode": "171128266",
    "dpc": "03031707101",
    "name": "សូ សំអាន ២"
  },
  {
    "barcode": "171128267",
    "dpc": "03031706701",
    "name": "សួន សុវណ្ណរ៉ា"
  },
  {
    "barcode": "171128268",
    "dpc": "03031706601",
    "name": "ប៉ែន សេរី"
  },
  {
    "barcode": "171128269",
    "dpc": "03031706301",
    "name": "ខៀវ សំណាង ២"
  },
  {
    "barcode": "171128270",
    "dpc": "03031713101",
    "name": "កែវ ព្រំ"
  },
  {
    "barcode": "171128271",
    "dpc": "03031713001",
    "name": "រិះ វណ្ណា"
  },
  {
    "barcode": "171128272",
    "dpc": "03031712901",
    "name": "ជា ដាវុធ"
  },
  {
    "barcode": "171128273",
    "dpc": "03031712801",
    "name": "ជុក ម៉េងគង់ ៣"
  },
  {
    "barcode": "171128274",
    "dpc": "03031712701",
    "name": "ជុក ម៉េងគង់ ៣"
  },
  {
    "barcode": "171128275",
    "dpc": "03031712601",
    "name": "ជុក ម៉េងគង់ ៣"
  },
  {
    "barcode": "171128276",
    "dpc": "03031712501",
    "name": "លឹម ស្រ៊ុន"
  },
  {
    "barcode": "171128277",
    "dpc": "03031712401",
    "name": "សៅ ទេពសត្ថា"
  },
  {
    "barcode": "171128278",
    "dpc": "03031712301",
    "name": "ទូច ឆាង"
  },
  {
    "barcode": "171128279",
    "dpc": "03031712201",
    "name": "ឈិន សារិន"
  },
  {
    "barcode": "171128280",
    "dpc": "03031712101",
    "name": "យូ ស៊ីម"
  },
  {
    "barcode": "171128281",
    "dpc": "03031712001",
    "name": "ប្រាក់ ស៊ីម៉េតថា"
  },
  {
    "barcode": "171128282",
    "dpc": "03031711901",
    "name": "ធា ស៊ីវត្ថា"
  },
  {
    "barcode": "171128283",
    "dpc": "03031711801",
    "name": "ឈឹម ជិនណារី"
  },
  {
    "barcode": "171128284",
    "dpc": "03031711701",
    "name": "មឹក តារា"
  },
  {
    "barcode": "171128285",
    "dpc": "03031711601",
    "name": "សាន់ សំអាត"
  },
  {
    "barcode": "171128286",
    "dpc": "03031711501",
    "name": "សេង គឹមចេង"
  },
  {
    "barcode": "171128287",
    "dpc": "03031711401",
    "name": "សៀង ជឿន"
  },
  {
    "barcode": "171128288",
    "dpc": "03031711301",
    "name": "រៀល ថែម"
  },
  {
    "barcode": "171128289",
    "dpc": "03031705101",
    "name": "ណាំ សុវណ្ណ"
  },
  {
    "barcode": "171128290",
    "dpc": "03031743101",
    "name": "បែន ផន"
  },
  {
    "barcode": "171128291",
    "dpc": "03031744001",
    "name": "ជា ម៉ូល្លិកា"
  },
  {
    "barcode": "171128292",
    "dpc": "03031735201",
    "name": "សួន សាវឿន"
  },
  {
    "barcode": "171128293",
    "dpc": "03031735301",
    "name": "លឹម គឹមលី"
  },
  {
    "barcode": "171128294",
    "dpc": "03031745201",
    "name": "លឹម ស្រេង"
  },
  {
    "barcode": "171128295",
    "dpc": "03031745001",
    "name": "ចាន់ ប៊ុនទី"
  },
  {
    "barcode": "171128296",
    "dpc": "03031744801",
    "name": "ប៉ែន សំអូន"
  },
  {
    "barcode": "171128297",
    "dpc": "03031713701",
    "name": "កាយ  កិត្យា"
  },
  {
    "barcode": "171128298",
    "dpc": "03031715301",
    "name": "បាន់  សារុំ"
  },
  {
    "barcode": "171128299",
    "dpc": "03031715201",
    "name": "រិន  រ៉ា"
  },
  {
    "barcode": "171128300",
    "dpc": "03031715101",
    "name": "រស់  ជីវី"
  },
  {
    "barcode": "171128301",
    "dpc": "03031714901",
    "name": "អ៊ីម  ខៃ"
  },
  {
    "barcode": "171128302",
    "dpc": "03031714801",
    "name": "អែម  ញើង"
  },
  {
    "barcode": "171128303",
    "dpc": "03031714201",
    "name": "បាន់  លៀប"
  },
  {
    "barcode": "171128304",
    "dpc": "03031714101",
    "name": "លីវ    យាវ"
  },
  {
    "barcode": "171128305",
    "dpc": "03031714001",
    "name": "ហេង  ស៊ីម"
  },
  {
    "barcode": "171128306",
    "dpc": "03031713901",
    "name": "យក់  អឿ ២"
  },
  {
    "barcode": "171128307",
    "dpc": "03031705601",
    "name": "ផែន  វ៉ាន់ឌី"
  },
  {
    "barcode": "171128308",
    "dpc": "03031705501",
    "name": "គុយ  សំអាង"
  },
  {
    "barcode": "171128309",
    "dpc": "03031714301",
    "name": "ពុធ  សឿង"
  },
  {
    "barcode": "171128310",
    "dpc": "03031714401",
    "name": "គឹម  រ៉ា"
  },
  {
    "barcode": "171128311",
    "dpc": "03031719701",
    "name": "ចៅអធិការវត្តដំរីស"
  },
  {
    "barcode": "171128312",
    "dpc": "03031719601",
    "name": "ជាម  ច័ន្ទសោភ័ណ្ឌ"
  },
  {
    "barcode": "171128313",
    "dpc": "03031719401",
    "name": "ស៊ឹង  សៀន"
  },
  {
    "barcode": "171128314",
    "dpc": "03031719301",
    "name": "ទេព  រី"
  },
  {
    "barcode": "171128315",
    "dpc": "03031719201",
    "name": "សុខ  តុលា"
  },
  {
    "barcode": "171128316",
    "dpc": "03031716601",
    "name": "អេង  លី ២"
  },
  {
    "barcode": "171128317",
    "dpc": "03031716701",
    "name": "ភេ  សុខា"
  },
  {
    "barcode": "171128318",
    "dpc": "03031716801",
    "name": "លឹម បញ្ញា"
  },
  {
    "barcode": "171128319",
    "dpc": "03031716401",
    "name": "អេង  លី ១"
  },
  {
    "barcode": "171128320",
    "dpc": "03031716301",
    "name": "ហ៊ាង  គឹមលាភ"
  },
  {
    "barcode": "171128321",
    "dpc": "03031716201",
    "name": "អឿ  ឃឿត"
  },
  {
    "barcode": "171128322",
    "dpc": "03031716101",
    "name": "ស៊ុន  ធឿន"
  },
  {
    "barcode": "171128323",
    "dpc": "03031715801",
    "name": "ម៉េង  ណារី"
  },
  {
    "barcode": "171128324",
    "dpc": "03031715601",
    "name": "ជា  វឿន"
  },
  {
    "barcode": "171128325",
    "dpc": "03031715501",
    "name": "តែ  វុទ្ធី"
  },
  {
    "barcode": "171128326",
    "dpc": "03031743801",
    "name": "អៀម  សុខហឿន"
  },
  {
    "barcode": "171128327",
    "dpc": "03031743701",
    "name": "គ្រី  ចំរើន"
  },
  {
    "barcode": "171128328",
    "dpc": "03031717801",
    "name": "ម៉ាន់  កែវ"
  },
  {
    "barcode": "171128329",
    "dpc": "03031717701",
    "name": "ឯល  សារ៉ាត់"
  },
  {
    "barcode": "171128330",
    "dpc": "03031717601",
    "name": "ប៉ិន  ឆុំ"
  },
  {
    "barcode": "171128331",
    "dpc": "03031717501",
    "name": "វែន  លី"
  },
  {
    "barcode": "171128332",
    "dpc": "03031717401",
    "name": "ចាន់  សូវង្ស"
  },
  {
    "barcode": "171128333",
    "dpc": "03031717301",
    "name": "យីវ  ពៅ"
  },
  {
    "barcode": "171128334",
    "dpc": "03031717201",
    "name": "ស៊ិន  សំប៊ូន"
  },
  {
    "barcode": "171128335",
    "dpc": "03031717001",
    "name": "សំ  ណារិន"
  },
  {
    "barcode": "171128336",
    "dpc": "03031717101",
    "name": "ពុធ  កយ ២"
  },
  {
    "barcode": "171128337",
    "dpc": "03031716901",
    "name": "សោម  ហ៊ុន"
  },
  {
    "barcode": "171128338",
    "dpc": "03031717901",
    "name": "អ៊ឹម  ហៃ"
  },
  {
    "barcode": "171128339",
    "dpc": "03031718001",
    "name": "មៀច  សុមន៍"
  },
  {
    "barcode": "171128340",
    "dpc": "03031718101",
    "name": "ផាន់  ស៊ុនបុប្ផា"
  },
  {
    "barcode": "171128341",
    "dpc": "03031718201",
    "name": "លឹម  ឈុនទៀង"
  },
  {
    "barcode": "171128342",
    "dpc": "03031718301",
    "name": "មន្ទីរពត៌មានខេត្ត"
  },
  {
    "barcode": "171128343",
    "dpc": "03031718401",
    "name": "នូវ  យូណា"
  },
  {
    "barcode": "171128344",
    "dpc": "03031718501",
    "name": "ហួន  ហៀង"
  },
  {
    "barcode": "171128345",
    "dpc": "03031718601",
    "name": "គួច  រ៉ុង"
  },
  {
    "barcode": "171128346",
    "dpc": "03031743501",
    "name": "ញ៉យ  សួង"
  },
  {
    "barcode": "171128347",
    "dpc": "03031743601",
    "name": "ឃឹម ដាវ៉ាន់"
  },
  {
    "barcode": "171128348",
    "dpc": "03031721701",
    "name": "រស់ ចាន់ថា"
  },
  {
    "barcode": "171128349",
    "dpc": "03031721901",
    "name": "សុខ គឹមសាន"
  },
  {
    "barcode": "171128350",
    "dpc": "03031720301",
    "name": "ហេង ឆាត"
  },
  {
    "barcode": "171128351",
    "dpc": "03031719901",
    "name": "ឆេង សុវណ្ណ"
  },
  {
    "barcode": "171128352",
    "dpc": "03031720001",
    "name": "វត្តដំរីស (កុដិលោកតា)"
  },
  {
    "barcode": "171128353",
    "dpc": "03031719801",
    "name": "វត្តដំរីស (សាលាឆាន់)"
  },
  {
    "barcode": "171128354",
    "dpc": "03031720101",
    "name": "វត្តដំរីស (ខាងត្បូង)"
  },
  {
    "barcode": "171128355",
    "dpc": "03031720201",
    "name": "វត្តដំរីស (កុដិដូនជី)"
  },
  {
    "barcode": "171128356",
    "dpc": "03031720401",
    "name": "ហួន ប៊ុនហាន (វត្តដំរីស)"
  },
  {
    "barcode": "171128357",
    "dpc": "03031721801",
    "name": "សឹន សាន់"
  },
  {
    "barcode": "171128358",
    "dpc": "03031721601",
    "name": "សៅ ម៉ៃ"
  },
  {
    "barcode": "171128359",
    "dpc": "03031721501",
    "name": "គឹម យ៉យ"
  },
  {
    "barcode": "171128360",
    "dpc": "03031721401",
    "name": "មាឃ វៃនី"
  },
  {
    "barcode": "171128361",
    "dpc": "03031721301",
    "name": "ភូ ពេជាដា"
  },
  {
    "barcode": "171128362",
    "dpc": "03031722101",
    "name": "សា  វ៉ាត់រ៉ាន់"
  },
  {
    "barcode": "171128363",
    "dpc": "03031721201",
    "name": "ហោ វុទ្ធី"
  },
  {
    "barcode": "171128364",
    "dpc": "03031721101",
    "name": "ម៉ែន ណន"
  },
  {
    "barcode": "171128365",
    "dpc": "03031721001",
    "name": "ម៉ាច គឹមឆាយ"
  },
  {
    "barcode": "171128366",
    "dpc": "03031720901",
    "name": "ជ្រុន ណារិន"
  },
  {
    "barcode": "171128367",
    "dpc": "03031720801",
    "name": "រស់ សាអ៊ីន"
  },
  {
    "barcode": "171128368",
    "dpc": "03031720601",
    "name": "ប្រាក់ បូរាណ"
  },
  {
    "barcode": "171128369",
    "dpc": "03031705201",
    "name": "ផ្លុង វ៉ៃ"
  },
  {
    "barcode": "171128370",
    "dpc": "03031720501",
    "name": "ម៉េង ហ៊ាង"
  },
  {
    "barcode": "171128371",
    "dpc": "03031722301",
    "name": "ហង្ស ម៉ាឡានី"
  },
  {
    "barcode": "171128372",
    "dpc": "03031722501",
    "name": "ហេង ជួង"
  },
  {
    "barcode": "171128373",
    "dpc": "03031722601",
    "name": "ខូវ យូឡុង"
  },
  {
    "barcode": "171128374",
    "dpc": "03031722701",
    "name": "ស៊្រុន   ហុង"
  },
  {
    "barcode": "171128375",
    "dpc": "03031722801",
    "name": "ចិន គឹមទូច"
  },
  {
    "barcode": "171128376",
    "dpc": "03031722901",
    "name": "ជាង សុខុម"
  },
  {
    "barcode": "171128377",
    "dpc": "03031723001",
    "name": "ប៊ុត ទឺ"
  },
  {
    "barcode": "171128378",
    "dpc": "03031723101",
    "name": "ព្រំ ស៊ន់"
  },
  {
    "barcode": "171128379",
    "dpc": "03031723201",
    "name": "កែវ សារុន"
  },
  {
    "barcode": "171128380",
    "dpc": "03031723301",
    "name": "គឹម ស្រេង"
  },
  {
    "barcode": "171128381",
    "dpc": "03031723401",
    "name": "ព្រំ ណូ"
  },
  {
    "barcode": "171128382",
    "dpc": "03031723501",
    "name": "លៀម តាំ"
  },
  {
    "barcode": "171128383",
    "dpc": "03031723601",
    "name": "ស៊ង ធី"
  },
  {
    "barcode": "171128384",
    "dpc": "03031723701",
    "name": "ទន់ ប៊ុនលី"
  },
  {
    "barcode": "171128385",
    "dpc": "03031723801",
    "name": "ខាត់ ថន"
  },
  {
    "barcode": "171128386",
    "dpc": "03031703301",
    "name": "លី  សុគុណ"
  },
  {
    "barcode": "171128387",
    "dpc": "03031705401",
    "name": "សេង  មឿន"
  },
  {
    "barcode": "171128388",
    "dpc": "03031713201",
    "name": "គង់  ស៊ីអេង"
  },
  {
    "barcode": "171128389",
    "dpc": "03031713301",
    "name": "អ៊ុក  កែវដាណា"
  },
  {
    "barcode": "171128390",
    "dpc": "03031713401",
    "name": "ហ៊ុន  ហ៊ាប"
  },
  {
    "barcode": "171128391",
    "dpc": "03031713501",
    "name": "ស៊ឹន  ណាវុធ"
  },
  {
    "barcode": "171128392",
    "dpc": "03031713601",
    "name": "អ៊ឹម  ចាន់រី"
  },
  {
    "barcode": "171128393",
    "dpc": "03031713801",
    "name": "យក់  អឿ ១"
  },
  {
    "barcode": "171128394",
    "dpc": "03031715701",
    "name": "ពុធ  កយ"
  },
  {
    "barcode": "171128395",
    "dpc": "03031715901",
    "name": "ម៉ម  សុភាព ១"
  },
  {
    "barcode": "171128396",
    "dpc": "03031716001",
    "name": "ម៉ម  សុភាព ២"
  },
  {
    "barcode": "171128397",
    "dpc": "03031716501",
    "name": "លី  កៅ"
  },
  {
    "barcode": "171128398",
    "dpc": "03031718701",
    "name": "សូ  សុវត្ថិ"
  },
  {
    "barcode": "171128399",
    "dpc": "03031718801",
    "name": "សោម  សុខា"
  },
  {
    "barcode": "171128400",
    "dpc": "03031719001",
    "name": "ចេង  សាវិត"
  },
  {
    "barcode": "171128401",
    "dpc": "03031719101",
    "name": "គី  រស្មី"
  },
  {
    "barcode": "171128402",
    "dpc": "03031722001",
    "name": "គង់  ឆេងលី"
  },
  {
    "barcode": "171128403",
    "dpc": "03031722201",
    "name": "បាន  ហួត"
  },
  {
    "barcode": "171128404",
    "dpc": "03031722401",
    "name": "ចាត សំបូរ"
  },
  {
    "barcode": "171128405",
    "dpc": "03031728001",
    "name": "ជ័យ  វឌ្ឍនា"
  },
  {
    "barcode": "171128406",
    "dpc": "03031732001",
    "name": "លឹម  អេង"
  },
  {
    "barcode": "171128407",
    "dpc": "03031735401",
    "name": "យ៉ាន់  គឹមនី"
  },
  {
    "barcode": "171128408",
    "dpc": "03031740701",
    "name": "តាំង  គឹមអ៊ាម"
  },
  {
    "barcode": "171128409",
    "dpc": "03031740801",
    "name": "យ៉ាំ  ស៊ីងហ៊"
  },
  {
    "barcode": "171128410",
    "dpc": "03031740901",
    "name": "ទុយ  វីន"
  },
  {
    "barcode": "171128411",
    "dpc": "03031741001",
    "name": "តាំង  ឈុន ៨"
  },
  {
    "barcode": "171128412",
    "dpc": "03031741101",
    "name": "ហោ  ផល្លា"
  },
  {
    "barcode": "171128413",
    "dpc": "03031741801",
    "name": "កាំង ប៊ុនអេង"
  },
  {
    "barcode": "171128414",
    "dpc": "03031741901",
    "name": "តាន់  គឹមហ៊រ"
  },
  {
    "barcode": "171128415",
    "dpc": "03031742101",
    "name": "តាន់  អេង"
  },
  {
    "barcode": "171128416",
    "dpc": "03031742501",
    "name": "លឹម  ហួត"
  },
  {
    "barcode": "171128417",
    "dpc": "03031742801",
    "name": "យូ  ម៉ៅ"
  },
  {
    "barcode": "171128418",
    "dpc": "03031743001",
    "name": "នង  លីនណា"
  },
  {
    "barcode": "171128419",
    "dpc": "03031743301",
    "name": "ម៉ៅ  សុខុម"
  },
  {
    "barcode": "171128420",
    "dpc": "03031743901",
    "name": "អាត  សាវី"
  },
  {
    "barcode": "171128421",
    "dpc": "03031744601",
    "name": "នៅ  ម៉ាលី"
  },
  {
    "barcode": "171128422",
    "dpc": "03031744701",
    "name": "ហេង  ណេង"
  },
  {
    "barcode": "171128423",
    "dpc": "03031746601",
    "name": "ខៀវ  ខុន"
  },
  {
    "barcode": "171128424",
    "dpc": "03031715001",
    "name": "នៅ  ញិន"
  },
  {
    "barcode": "171128425",
    "dpc": "03031748001",
    "name": "គង់ វឆ័យ"
  }
];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
