let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171118403",
            "dpc": "03041812501",
            "name": "ហែម សុខខី"
        },
        {
            "barcode": "171118404",
            "dpc": "03041812401",
            "name": "សួន នឿត"
        },
        {
            "barcode": "171118405",
            "dpc": "03041812301",
            "name": "ហេង ម៉ៅ"
        },
        {
            "barcode": "171118406",
            "dpc": "03041812201",
            "name": "សុខ សុខា"
        },
        {
            "barcode": "171118407",
            "dpc": "03041812101",
            "name": "អ៊ិន សាឡូត"
        },
        {
            "barcode": "171118408",
            "dpc": "03041812801",
            "name": "អ៊ុក  ឆេង"
        },
        {
            "barcode": "171118409",
            "dpc": "03041813201",
            "name": "ឥន ហេង"
        },
        {
            "barcode": "171118410",
            "dpc": "03041813301",
            "name": "ហេង ប៊ុនវ៉ាត់"
        },
        {
            "barcode": "171118411",
            "dpc": "03041813401",
            "name": "សុខ វិរៈ"
        },
        {
            "barcode": "171118412",
            "dpc": "03041813501",
            "name": "ឥន ឡេង"
        },
        {
            "barcode": "171118413",
            "dpc": "03041813701",
            "name": "ជា សាវី"
        },
        {
            "barcode": "171118414",
            "dpc": "03041813801",
            "name": "ធុន អឿន"
        },
        {
            "barcode": "171118415",
            "dpc": "03041813901",
            "name": "សុខ ឡេង"
        },
        {
            "barcode": "171118416",
            "dpc": "03041814001",
            "name": "ថោង ពិសិទ្ធ"
        },
        {
            "barcode": "171118417",
            "dpc": "03041814101",
            "name": "សុខ ណេង"
        },
        {
            "barcode": "171118418",
            "dpc": "03041814201",
            "name": "សុខ ឡេង"
        },
        {
            "barcode": "171118419",
            "dpc": "03041814301",
            "name": "ឃិម  សូរីយា"
        },
        {
            "barcode": "171118420",
            "dpc": "03041814401",
            "name": "គួច  សាវី"
        },
        {
            "barcode": "171118421",
            "dpc": "03041814501",
            "name": "មាស ពែវ"
        },
        {
            "barcode": "171118422",
            "dpc": "03041814601",
            "name": "ឆាយ ឡាប"
        },
        {
            "barcode": "171118423",
            "dpc": "03041814701",
            "name": "អ៊ុំ ស្រី"
        },
        {
            "barcode": "171118424",
            "dpc": "03041814801",
            "name": "អ៊ុំ សាំង"
        },
        {
            "barcode": "171118425",
            "dpc": "03041814901",
            "name": "ទឹម ថា"
        },
        {
            "barcode": "171118426",
            "dpc": "03041810001",
            "name": "លឹម សុធា"
        },
        {
            "barcode": "171118427",
            "dpc": "03041815001",
            "name": "ជា សំអាត"
        },
        {
            "barcode": "171118428",
            "dpc": "03041815101",
            "name": "អេង ម៉ុន"
        },
        {
            "barcode": "171118429",
            "dpc": "03041815201",
            "name": "ញ៉ែម ខេន"
        },
        {
            "barcode": "171118430",
            "dpc": "03041815301",
            "name": "ធឿម ស៊ីមុត"
        },
        {
            "barcode": "171118431",
            "dpc": "03041815401",
            "name": "ជី សូហា"
        },
        {
            "barcode": "171118432",
            "dpc": "03041815501",
            "name": "ស៊ុន  ថាវ"
        },
        {
            "barcode": "171118433",
            "dpc": "03041815601",
            "name": "សោម  សូណែត"
        },
        {
            "barcode": "171118434",
            "dpc": "03041815701",
            "name": "ឌី ស៊ីម"
        },
        {
            "barcode": "171118435",
            "dpc": "03041815801",
            "name": "ថោង មុំ"
        },
        {
            "barcode": "171118436",
            "dpc": "03041815901",
            "name": "លិន ណាវី"
        },
        {
            "barcode": "171118437",
            "dpc": "03041816001",
            "name": "ស៊ុយ ពិសិដ្ឋ"
        },
        {
            "barcode": "171118438",
            "dpc": "03041816101",
            "name": "ស៊ិន ញិប"
        },
        {
            "barcode": "171118439",
            "dpc": "03041816201",
            "name": "ស៊ិន បូរ៉ាន់"
        },
        {
            "barcode": "171118440",
            "dpc": "03041816301",
            "name": "សុខ ជា"
        },
        {
            "barcode": "171118441",
            "dpc": "03041816401",
            "name": "សេង សុភី"
        },
        {
            "barcode": "171118442",
            "dpc": "03041816501",
            "name": "ឃួយ  គឹមទ្រី"
        },
        {
            "barcode": "171118443",
            "dpc": "03041816601",
            "name": "អ៊ិន សុខា"
        },
        {
            "barcode": "171118444",
            "dpc": "03041816701",
            "name": "ខ្លូត មី"
        },
        {
            "barcode": "171118445",
            "dpc": "03041816801",
            "name": "ហ៊ីង សៀក"
        },
        {
            "barcode": "171118446",
            "dpc": "03041816901",
            "name": "ម៉ាច គឹមឆាយ"
        },
        {
            "barcode": "171118447",
            "dpc": "03041817001",
            "name": "យូ សាន"
        },
        {
            "barcode": "171118448",
            "dpc": "03041817101",
            "name": "សយ  សារឿន"
        },
        {
            "barcode": "171118449",
            "dpc": "03041817201",
            "name": "ហ្វាន់ ទី"
        },
        {
            "barcode": "171118450",
            "dpc": "03041828301",
            "name": "ផាត់ នី"
        },
        {
            "barcode": "171118451",
            "dpc": "03041828401",
            "name": "ហួត  វី"
        },
        {
            "barcode": "171118452",
            "dpc": "03041828501",
            "name": "សួន សំអាត"
        },
        {
            "barcode": "171118453",
            "dpc": "03041828801",
            "name": "លី ងួន"
        },
        {
            "barcode": "171118454",
            "dpc": "03041811901",
            "name": "ពេក តារ៉ា"
        },
        {
            "barcode": "171118455",
            "dpc": "03041811401",
            "name": "សោ សារី"
        },
        {
            "barcode": "171118456",
            "dpc": "03041811701",
            "name": "អ៊ុយ ដារីន"
        },
        {
            "barcode": "171118457",
            "dpc": "03041827401",
            "name": "សោម ថន"
        },
        {
            "barcode": "171118458",
            "dpc": "03041811601",
            "name": "មាស រ៉ាស៊ីន"
        },
        {
            "barcode": "171118459",
            "dpc": "03041811501",
            "name": "ចាប ដារីណេត"
        },
        {
            "barcode": "171118460",
            "dpc": "03041811301",
            "name": "សោម ជូ"
        },
        {
            "barcode": "171118461",
            "dpc": "03041811201",
            "name": "សោម សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171118462",
            "dpc": "03041811101",
            "name": "ទូច កុសល"
        },
        {
            "barcode": "171118463",
            "dpc": "03041811001",
            "name": "សុខ ណែម"
        },
        {
            "barcode": "171118464",
            "dpc": "03041810901",
            "name": "ហួត លាងស៊ីម"
        },
        {
            "barcode": "171118465",
            "dpc": "03041810801",
            "name": "ហាក់ សំផុន"
        },
        {
            "barcode": "171118466",
            "dpc": "03041810701",
            "name": "សែ បូរ"
        },
        {
            "barcode": "171118467",
            "dpc": "03041810601",
            "name": "នង   វុត្ថា"
        },
        {
            "barcode": "171118468",
            "dpc": "03041810501",
            "name": "ឃុត សារ៉ុម"
        },
        {
            "barcode": "171118469",
            "dpc": "03041810401",
            "name": "តឹក គឹមឡុង"
        },
        {
            "barcode": "171118470",
            "dpc": "03041810301",
            "name": "សែង ចិន្តា"
        },
        {
            "barcode": "171118471",
            "dpc": "03041810201",
            "name": "រស់ ជីវ័ន្ត"
        },
        {
            "barcode": "171118472",
            "dpc": "03041809701",
            "name": "លក  សួរ"
        },
        {
            "barcode": "171118473",
            "dpc": "03041807201",
            "name": "កៅ ស៊ីឡេង"
        },
        {
            "barcode": "171118474",
            "dpc": "03041807301",
            "name": "ហេង អេង"
        },
        {
            "barcode": "171118475",
            "dpc": "03041807401",
            "name": "ឃួន ឱសថ"
        },
        {
            "barcode": "171118476",
            "dpc": "03041807501",
            "name": "សេក ទូច"
        },
        {
            "barcode": "171118477",
            "dpc": "03041807601",
            "name": "ចាន់ កណ្ណិកា"
        },
        {
            "barcode": "171118478",
            "dpc": "03041807701",
            "name": "លី ម៉េង"
        },
        {
            "barcode": "171118479",
            "dpc": "03041807801",
            "name": "យូ ជីឃាង"
        },
        {
            "barcode": "171118480",
            "dpc": "03041807901",
            "name": "សួន សុផល"
        },
        {
            "barcode": "171118481",
            "dpc": "03041808001",
            "name": "ម៉ុន  ម៉ុត"
        },
        {
            "barcode": "171118482",
            "dpc": "03041808101",
            "name": "កឺ សែត"
        },
        {
            "barcode": "171118483",
            "dpc": "03041808201",
            "name": "ជាន  ឡូញ"
        },
        {
            "barcode": "171118484",
            "dpc": "03041808301",
            "name": "រឿន វណ្ណស៊ី"
        },
        {
            "barcode": "171118485",
            "dpc": "03041808401",
            "name": "សិន  ញ៉ា"
        },
        {
            "barcode": "171118486",
            "dpc": "03041808501",
            "name": "យូ សាន ១"
        },
        {
            "barcode": "171118487",
            "dpc": "03041808601",
            "name": "យាន  ពៅ"
        },
        {
            "barcode": "171118488",
            "dpc": "03041808701",
            "name": "ធូ ហួត"
        },
        {
            "barcode": "171118489",
            "dpc": "03041808801",
            "name": "ព្រុំ ប៊ុត"
        },
        {
            "barcode": "171118490",
            "dpc": "03041808901",
            "name": "លុក មន្នី"
        },
        {
            "barcode": "171118491",
            "dpc": "03041809001",
            "name": "ស៊ីម សារិន"
        },
        {
            "barcode": "171118492",
            "dpc": "03041809101",
            "name": "ប៉ិច ឆាតសារិ"
        },
        {
            "barcode": "171118493",
            "dpc": "03041809201",
            "name": "យូ ឆេង"
        },
        {
            "barcode": "171118494",
            "dpc": "03041809301",
            "name": "ម៉ៅ ណារិទ្ធិ"
        },
        {
            "barcode": "171118495",
            "dpc": "03041809501",
            "name": "ខែក ស៊ីធឿន"
        },
        {
            "barcode": "171118496",
            "dpc": "03041809601",
            "name": "ឡេង សំអាត"
        },
        {
            "barcode": "171118497",
            "dpc": "03041810101",
            "name": "ច័ន្ទ   មន្នី"
        },
        {
            "barcode": "171118498",
            "dpc": "03041809901",
            "name": "សូនី រស្មី"
        },
        {
            "barcode": "171118499",
            "dpc": "03041846101",
            "name": "យឹង  ហឿប"
        },
        {
            "barcode": "171118500",
            "dpc": "03041846201",
            "name": "វ៉ាន់ ករ"
        },
        {
            "barcode": "171118501",
            "dpc": "03041846301",
            "name": "ម៉ម ណារ៉េត"
        },
        {
            "barcode": "171118502",
            "dpc": "03041846401",
            "name": "អ៊ិត សំប៊ុន"
        },
        {
            "barcode": "171118503",
            "dpc": "03041846501",
            "name": "នៅ  បូរិន"
        },
        {
            "barcode": "171118504",
            "dpc": "03041846601",
            "name": "ណុប សោភ័ណ្ឌ"
        },
        {
            "barcode": "171118505",
            "dpc": "03041846701",
            "name": "ជួន  ហុង"
        },
        {
            "barcode": "171118506",
            "dpc": "03041846801",
            "name": "អ៊ិត សំបូរ"
        },
        {
            "barcode": "171118507",
            "dpc": "03041846901",
            "name": "អៃ អ៊ី"
        },
        {
            "barcode": "171118508",
            "dpc": "03041847101",
            "name": "ម៉ែន កល្យាណ"
        },
        {
            "barcode": "171118509",
            "dpc": "03041847201",
            "name": "អយ ស៊ឹងអង"
        },
        {
            "barcode": "171118510",
            "dpc": "03041847301",
            "name": "ទូច ហាក់"
        },
        {
            "barcode": "171118511",
            "dpc": "03041847401",
            "name": "ផន ផល្លា"
        },
        {
            "barcode": "171118512",
            "dpc": "03041847501",
            "name": "ម៉ក់ ទូច"
        },
        {
            "barcode": "171118513",
            "dpc": "03041847701",
            "name": "យង់  តាវ"
        },
        {
            "barcode": "171118514",
            "dpc": "03041847801",
            "name": "ឡុង សុឃីម"
        },
        {
            "barcode": "171118515",
            "dpc": "03041847901",
            "name": "អ៊ុច សុផាត"
        },
        {
            "barcode": "171118516",
            "dpc": "03041838501",
            "name": "ហេង សៅយ៉ាត"
        },
        {
            "barcode": "171118517",
            "dpc": "03041838601",
            "name": "ចិន សាវ៉ាន"
        },
        {
            "barcode": "171118518",
            "dpc": "03041838701",
            "name": "សាំង ធី"
        },
        {
            "barcode": "171118519",
            "dpc": "03041838801",
            "name": "ឡាយ ណារី"
        },
        {
            "barcode": "171118520",
            "dpc": "03041838901",
            "name": "គង់ តាប"
        },
        {
            "barcode": "171118521",
            "dpc": "03041839001",
            "name": "ហុក ចាន់ថុល"
        },
        {
            "barcode": "171118522",
            "dpc": "03041839101",
            "name": "ស៊្រុន សុទិដ្ឋ"
        },
        {
            "barcode": "171118523",
            "dpc": "03041839201",
            "name": "យូ ហេងស្រេង"
        },
        {
            "barcode": "171118524",
            "dpc": "03041839301",
            "name": "ឡេង ហន"
        },
        {
            "barcode": "171118525",
            "dpc": "03041839401",
            "name": "អ៊ូ សុដារិទ្ធ"
        },
        {
            "barcode": "171118526",
            "dpc": "03041839501",
            "name": "ហ៊ីង ឡាង"
        },
        {
            "barcode": "171118527",
            "dpc": "03041839601",
            "name": "ទង ស៊្រី"
        },
        {
            "barcode": "171118528",
            "dpc": "03041839701",
            "name": "តុង ម៉ៅ"
        },
        {
            "barcode": "171118529",
            "dpc": "03041839901",
            "name": "លី វិចិត្រ"
        },
        {
            "barcode": "171118530",
            "dpc": "03041840001",
            "name": "ស  សុរិទ្ធ"
        },
        {
            "barcode": "171118531",
            "dpc": "03041840101",
            "name": "យស ពៅ"
        },
        {
            "barcode": "171118532",
            "dpc": "03041840301",
            "name": "រិន រួម"
        },
        {
            "barcode": "171118533",
            "dpc": "03041840401",
            "name": "រ៉ាន់ ដារី"
        },
        {
            "barcode": "171118534",
            "dpc": "03041840501",
            "name": "រ៉ាន់ ម៉ៅ"
        },
        {
            "barcode": "171118535",
            "dpc": "03041840601",
            "name": "ជា ម៉ារីយ៉ាន"
        },
        {
            "barcode": "171118536",
            "dpc": "03041840701",
            "name": "អៀវ  តេង"
        },
        {
            "barcode": "171118537",
            "dpc": "03041840801",
            "name": "ឡេង វិសាល"
        },
        {
            "barcode": "171118538",
            "dpc": "03041840901",
            "name": "ហុល  វ៉ាន់ណារូ"
        },
        {
            "barcode": "171118539",
            "dpc": "03041841001",
            "name": "ឈួន គឹមលៀន"
        },
        {
            "barcode": "171118540",
            "dpc": "03041841201",
            "name": "ប្រាក់ កេះ"
        },
        {
            "barcode": "171118541",
            "dpc": "03041841301",
            "name": "លី ប៊ុន"
        },
        {
            "barcode": "171118542",
            "dpc": "03041841401",
            "name": "កែវ ចន្ថា"
        },
        {
            "barcode": "171118543",
            "dpc": "03041841501",
            "name": "ជ័យ ធីដា"
        },
        {
            "barcode": "171118544",
            "dpc": "03041841601",
            "name": "អេង ផល្លា"
        },
        {
            "barcode": "171118545",
            "dpc": "03041841701",
            "name": "អ៊ិន ថៃលី"
        },
        {
            "barcode": "171118546",
            "dpc": "03041841801",
            "name": "ងូវ  ឈាង"
        },
        {
            "barcode": "171118547",
            "dpc": "03041841901",
            "name": "ស្វាយ ពៅ"
        },
        {
            "barcode": "171118548",
            "dpc": "03041842001",
            "name": "លឹម ជៀន"
        },
        {
            "barcode": "171118549",
            "dpc": "03041842101",
            "name": "ស៊ូ  ដាក់"
        },
        {
            "barcode": "171118550",
            "dpc": "03041841101",
            "name": "ណុប ចាន់ជីនា"
        },
        {
            "barcode": "171118551",
            "dpc": "03041842201",
            "name": "អេ សារុំ"
        },
        {
            "barcode": "171118552",
            "dpc": "03041842301",
            "name": "អ៊ូ សៀក"
        },
        {
            "barcode": "171118553",
            "dpc": "03041842401",
            "name": "ឈុំ ពុធ"
        },
        {
            "barcode": "171118554",
            "dpc": "03041842501",
            "name": "ណុប តុល"
        },
        {
            "barcode": "171118555",
            "dpc": "03041842701",
            "name": "លន់ ឡូន"
        },
        {
            "barcode": "171118556",
            "dpc": "03041842801",
            "name": "ស្រី ប៊ុនធឿន"
        },
        {
            "barcode": "171118557",
            "dpc": "03041842901",
            "name": "ម៉ែន បូរី"
        },
        {
            "barcode": "171118558",
            "dpc": "03041843001",
            "name": "សូ មុន្នី"
        },
        {
            "barcode": "171118559",
            "dpc": "03041843201",
            "name": "មិន សាអែម"
        },
        {
            "barcode": "171118560",
            "dpc": "03041843301",
            "name": "ស៊ិន សុផល"
        },
        {
            "barcode": "171118561",
            "dpc": "03041843401",
            "name": "ឆាន់ ណារ័ត្ន"
        },
        {
            "barcode": "171118562",
            "dpc": "03041843501",
            "name": "ប៉ែន សារ៉ាត់"
        },
        {
            "barcode": "171118563",
            "dpc": "03041843601",
            "name": "ផន ថន"
        },
        {
            "barcode": "171118564",
            "dpc": "03041843701",
            "name": "ឡូវ ហុង"
        },
        {
            "barcode": "171118565",
            "dpc": "03041843801",
            "name": "សាំង ស៊ីវន"
        },
        {
            "barcode": "171118566",
            "dpc": "03041843901",
            "name": "នេត ផល្លី"
        },
        {
            "barcode": "171118567",
            "dpc": "03041844101",
            "name": "ជា ចំរើន"
        },
        {
            "barcode": "171118568",
            "dpc": "03041844201",
            "name": "ឈុន សម្ភស្ស"
        },
        {
            "barcode": "171118569",
            "dpc": "03041844301",
            "name": "ឈុន ចំរើន"
        },
        {
            "barcode": "171118570",
            "dpc": "03041844401",
            "name": "ង៉ែត សាវុធ"
        },
        {
            "barcode": "171118571",
            "dpc": "03041844501",
            "name": "ទឹម សាម៉ី"
        },
        {
            "barcode": "171118572",
            "dpc": "03041844601",
            "name": "សេង ប៊ុនហេង"
        },
        {
            "barcode": "171118573",
            "dpc": "03041844701",
            "name": "សុខ ប៉ុន"
        },
        {
            "barcode": "171118574",
            "dpc": "03041844801",
            "name": "អ៊ុក លី"
        },
        {
            "barcode": "171118575",
            "dpc": "03041844901",
            "name": "វូច ស្រេង"
        },
        {
            "barcode": "171118576",
            "dpc": "03041845001",
            "name": "ណុប ម៉ៅ"
        },
        {
            "barcode": "171118577",
            "dpc": "03041845101",
            "name": "សូយ ប៊ុនហឿន"
        },
        {
            "barcode": "171118578",
            "dpc": "03041845401",
            "name": "អោ ថុង"
        },
        {
            "barcode": "171118579",
            "dpc": "03041845501",
            "name": "អ៊ុំ ធឿន"
        },
        {
            "barcode": "171118580",
            "dpc": "03041845601",
            "name": "ឡូត សឿត"
        },
        {
            "barcode": "171118581",
            "dpc": "03041845701",
            "name": "កែវ សុខា"
        },
        {
            "barcode": "171118582",
            "dpc": "03041845801",
            "name": "ពៅ ប៊ុនថុន"
        },
        {
            "barcode": "171118583",
            "dpc": "03041845901",
            "name": "ឆន  ប៊ុនថន"
        },
        {
            "barcode": "171118584",
            "dpc": "03041828701",
            "name": "ស៊ុយ  ជុក"
        },
        {
            "barcode": "171118585",
            "dpc": "03041829701",
            "name": "អ៊ូ  ដាវី"
        },
        {
            "barcode": "171118586",
            "dpc": "03041838401",
            "name": "ឆាន់   សុជាតិ"
        },
        {
            "barcode": "171118587",
            "dpc": "03041844001",
            "name": "ម៉ែន  ស៊ី"
        },
        {
            "barcode": "171118588",
            "dpc": "03041845301",
            "name": "ទិត  វ៉ាន"
        },
        {
            "barcode": "171118589",
            "dpc": "03041846001",
            "name": "ជ័យ  សារិទ្ធ"
        },
        {
            "barcode": "171118590",
            "dpc": "03041801601",
            "name": "ហម ញង"
        },
        {
            "barcode": "171118591",
            "dpc": "03041801501",
            "name": "សំ  សុខ"
        },
        {
            "barcode": "171118592",
            "dpc": "03041801401",
            "name": "ហូ ឡាយ"
        },
        {
            "barcode": "171118593",
            "dpc": "03041800101",
            "name": "គឹម  សំបូរ"
        },
        {
            "barcode": "171118594",
            "dpc": "03041800201",
            "name": "មាស សាយ"
        },
        {
            "barcode": "171118595",
            "dpc": "03041800301",
            "name": "ឃុត អារឌី"
        },
        {
            "barcode": "171118596",
            "dpc": "03041800401",
            "name": "ទូរគមនាគមន៍"
        },
        {
            "barcode": "171118597",
            "dpc": "03041800501",
            "name": "ក្រុមហ៊ុនម៉ូបីតែល"
        },
        {
            "barcode": "171118598",
            "dpc": "03041800601",
            "name": "កាំមីតែល"
        },
        {
            "barcode": "171118599",
            "dpc": "03041800801",
            "name": "អាត់ សាវ៉ន"
        },
        {
            "barcode": "171118600",
            "dpc": "03041800901",
            "name": "ម៉ែន ញ៉ល"
        },
        {
            "barcode": "171118601",
            "dpc": "03041801001",
            "name": "សុខ សារ៉ូ"
        },
        {
            "barcode": "171118602",
            "dpc": "03041801101",
            "name": "លាង  ថុល ១"
        },
        {
            "barcode": "171118603",
            "dpc": "03041801201",
            "name": "រស់ សាអ៊ីន"
        },
        {
            "barcode": "171118604",
            "dpc": "03041801701",
            "name": "សន សុខ១"
        },
        {
            "barcode": "171118605",
            "dpc": "03041801801",
            "name": "សន សុខ២"
        },
        {
            "barcode": "171118606",
            "dpc": "03041801901",
            "name": "វ៉ែន ហុក"
        },
        {
            "barcode": "171118607",
            "dpc": "03041802001",
            "name": "អែត ហ្វូត ៣"
        },
        {
            "barcode": "171118608",
            "dpc": "03041802301",
            "name": "លី សេងសៀង"
        },
        {
            "barcode": "171118609",
            "dpc": "03041802401",
            "name": "លឹម ស៊ុយសុវត្ថា"
        },
        {
            "barcode": "171118610",
            "dpc": "03041802501",
            "name": "អៀម ធាម"
        },
        {
            "barcode": "171118611",
            "dpc": "03041803001",
            "name": "ស៊ាង មួយ"
        },
        {
            "barcode": "171118612",
            "dpc": "03041803101",
            "name": "ធួន រ៉ាវុធ"
        },
        {
            "barcode": "171118613",
            "dpc": "03041803401",
            "name": "ណុប សាមិ"
        },
        {
            "barcode": "171118614",
            "dpc": "03041803501",
            "name": "កែវ ធី ៧៣"
        },
        {
            "barcode": "171118615",
            "dpc": "03041803601",
            "name": "គង់ សុខម៉េង"
        },
        {
            "barcode": "171118616",
            "dpc": "03041803701",
            "name": "គឹម គា"
        },
        {
            "barcode": "171118617",
            "dpc": "03041803801",
            "name": "ភួង សាវុធ"
        },
        {
            "barcode": "171118618",
            "dpc": "03041803901",
            "name": "តុក គឹមសួរ"
        },
        {
            "barcode": "171118619",
            "dpc": "03041804001",
            "name": "សាយ ហាក់ស្រ៊ុន"
        },
        {
            "barcode": "171118620",
            "dpc": "03041804101",
            "name": "ហ៊ុត សុភាព"
        },
        {
            "barcode": "171118621",
            "dpc": "03041804201",
            "name": "ជា ផល"
        },
        {
            "barcode": "171118622",
            "dpc": "03041804501",
            "name": "ហេង ចាន់ថានី"
        },
        {
            "barcode": "171118623",
            "dpc": "03041804801",
            "name": "យ៉ាំ ឃួង"
        },
        {
            "barcode": "171118624",
            "dpc": "03041805801",
            "name": "សុខ ចាន់មន្នី"
        },
        {
            "barcode": "171118625",
            "dpc": "03041805501",
            "name": "ព្រំ ណូ"
        },
        {
            "barcode": "171118626",
            "dpc": "03041805601",
            "name": "ទួន សុផល"
        },
        {
            "barcode": "171118627",
            "dpc": "03041804701",
            "name": "ចៅ យីថង"
        },
        {
            "barcode": "171118628",
            "dpc": "03041805901",
            "name": "ស៊ាន ផា"
        },
        {
            "barcode": "171118629",
            "dpc": "03041806001",
            "name": "កែវ សំណាង"
        },
        {
            "barcode": "171118630",
            "dpc": "03041806101",
            "name": "ឡុង ចន្ថា"
        },
        {
            "barcode": "171118631",
            "dpc": "03041806501",
            "name": "ខា ហេង"
        },
        {
            "barcode": "171118632",
            "dpc": "03041806901",
            "name": "ជី ឃីម"
        },
        {
            "barcode": "171118633",
            "dpc": "03041807001",
            "name": "យឹម វណ្ណថន"
        },
        {
            "barcode": "171118634",
            "dpc": "03041806801",
            "name": "ជិន ហ៊ាង"
        },
        {
            "barcode": "171118635",
            "dpc": "03041806601",
            "name": "សុខ លន់"
        },
        {
            "barcode": "171118636",
            "dpc": "03041806401",
            "name": "ហ្វាន់ ទី"
        },
        {
            "barcode": "171118637",
            "dpc": "03041806201",
            "name": "យឹន  វឹង"
        },
        {
            "barcode": "171118638",
            "dpc": "03041805701",
            "name": "សាម ប៊ុនធឿន"
        },
        {
            "barcode": "171118639",
            "dpc": "03041805401",
            "name": "សៅ អ៊ុល"
        },
        {
            "barcode": "171118640",
            "dpc": "03041805001",
            "name": "យាំ វ៉ិត"
        },
        {
            "barcode": "171118641",
            "dpc": "03041804601",
            "name": "កៅ អៀងឡាយ"
        },
        {
            "barcode": "171118642",
            "dpc": "03041804401",
            "name": "តុប សារុន"
        },
        {
            "barcode": "171118643",
            "dpc": "03041804301",
            "name": "កេតុ សឿ"
        },
        {
            "barcode": "171118644",
            "dpc": "03041817301",
            "name": "ឱ  ព្រឿង"
        },
        {
            "barcode": "171118645",
            "dpc": "03041817401",
            "name": "ប្រាក់ សាលឿត"
        },
        {
            "barcode": "171118646",
            "dpc": "03041818001",
            "name": "បេង លន់"
        },
        {
            "barcode": "171118647",
            "dpc": "03041818101",
            "name": "សុខ គឹមអេង"
        },
        {
            "barcode": "171118648",
            "dpc": "03041818201",
            "name": "សាំង អ៊ាង"
        },
        {
            "barcode": "171118649",
            "dpc": "03041818601",
            "name": "អ៊ូច សាឡូន"
        },
        {
            "barcode": "171118650",
            "dpc": "03041818501",
            "name": "ទិត ផល្លី"
        },
        {
            "barcode": "171118651",
            "dpc": "03041818401",
            "name": "ម៉ី យានឈុន"
        },
        {
            "barcode": "171118652",
            "dpc": "03041818301",
            "name": "ឡុង ម្លិះ"
        },
        {
            "barcode": "171118653",
            "dpc": "03041817901",
            "name": "គង់ វុត្ថា"
        },
        {
            "barcode": "171118654",
            "dpc": "03041817601",
            "name": "កង សារ៉េន"
        },
        {
            "barcode": "171118655",
            "dpc": "03041817501",
            "name": "សាយ ចំរើន"
        },
        {
            "barcode": "171118656",
            "dpc": "03041818701",
            "name": "ឈុន ង៉ោ"
        },
        {
            "barcode": "171118657",
            "dpc": "03041818801",
            "name": "ហួ  សុផា"
        },
        {
            "barcode": "171118658",
            "dpc": "03041819001",
            "name": "រស់ សុទ្ធ"
        },
        {
            "barcode": "171118659",
            "dpc": "03041819101",
            "name": "កាន់ សុគន្ធ"
        },
        {
            "barcode": "171118660",
            "dpc": "03041819201",
            "name": "ហ៊ីម ហេង"
        },
        {
            "barcode": "171118661",
            "dpc": "03041819301",
            "name": "ប៉ាល់ ពៅ"
        },
        {
            "barcode": "171118662",
            "dpc": "03041819401",
            "name": "សុខ គន្ធី ២"
        },
        {
            "barcode": "171118663",
            "dpc": "03041819501",
            "name": "មុំវិសិទ្ធ"
        },
        {
            "barcode": "171118664",
            "dpc": "03041819701",
            "name": "ឆឺន ផាន"
        },
        {
            "barcode": "171118665",
            "dpc": "03041819901",
            "name": "ពេទ្យ ភាព"
        },
        {
            "barcode": "171118666",
            "dpc": "03041820001",
            "name": "កេះ ប៊ុនអើយ ១"
        },
        {
            "barcode": "171118667",
            "dpc": "03041820101",
            "name": "ម៉ុត សាវិវណ្ណា"
        },
        {
            "barcode": "171118668",
            "dpc": "03041820301",
            "name": "ប៊ុន អើយកេះ"
        },
        {
            "barcode": "171118669",
            "dpc": "03041820501",
            "name": "ធី ១"
        },
        {
            "barcode": "171118670",
            "dpc": "03041820601",
            "name": "ធី ២"
        },
        {
            "barcode": "171118671",
            "dpc": "03041820801",
            "name": "ចៅ យឿត"
        },
        {
            "barcode": "171118672",
            "dpc": "03041821001",
            "name": "ផាន់ វិបុល"
        },
        {
            "barcode": "171118673",
            "dpc": "03041821101",
            "name": "កេះ សោភ័ណ្ឌ ១"
        },
        {
            "barcode": "171118674",
            "dpc": "03041821201",
            "name": "កេស សលផល"
        },
        {
            "barcode": "171118675",
            "dpc": "03041821401",
            "name": "តូច លក្ខិណា"
        },
        {
            "barcode": "171118676",
            "dpc": "03041802701",
            "name": "ញឹក សុផាណារ៉ាក់"
        },
        {
            "barcode": "171118677",
            "dpc": "03041821501",
            "name": "ព្រះវិហារចិន"
        },
        {
            "barcode": "171118678",
            "dpc": "03041821601",
            "name": "យង់   ទីណូ"
        },
        {
            "barcode": "171118679",
            "dpc": "03041821701",
            "name": "ផេង សារុំ"
        },
        {
            "barcode": "171118680",
            "dpc": "03041821801",
            "name": "ម៉ៅ សាវី"
        },
        {
            "barcode": "171118681",
            "dpc": "03041821901",
            "name": "ហោ ហៀប"
        },
        {
            "barcode": "171118682",
            "dpc": "03041822001",
            "name": "ជួន  ហុង"
        },
        {
            "barcode": "171118683",
            "dpc": "03041822101",
            "name": "តឹក ប៊ុនឡុង"
        },
        {
            "barcode": "171118684",
            "dpc": "03041822201",
            "name": "យាំ យ៉េត ១"
        },
        {
            "barcode": "171118685",
            "dpc": "03041828201",
            "name": "ហ៊ាន ហ៊ឺម ២"
        },
        {
            "barcode": "171118686",
            "dpc": "03041822401",
            "name": "អ៊ឹង សុន្ធា"
        },
        {
            "barcode": "171118687",
            "dpc": "03041822501",
            "name": "សុខ ណាគ្រី"
        },
        {
            "barcode": "171118688",
            "dpc": "03041822601",
            "name": "មាឃ ម៉ារិន"
        },
        {
            "barcode": "171118689",
            "dpc": "03041822701",
            "name": "លឹម សេងអៀង"
        },
        {
            "barcode": "171118690",
            "dpc": "03041822801",
            "name": "ហ៊ាន ប៊ុនធឿម"
        },
        {
            "barcode": "171118691",
            "dpc": "03041822901",
            "name": "ឃុត ចាន់ដារ៉ា"
        },
        {
            "barcode": "171118692",
            "dpc": "03041823001",
            "name": "ទៀវ សឿម"
        },
        {
            "barcode": "171118693",
            "dpc": "03041823101",
            "name": "អ៊ុក រ៉េត"
        },
        {
            "barcode": "171118694",
            "dpc": "03041823201",
            "name": "គុយ  ថុល"
        },
        {
            "barcode": "171118695",
            "dpc": "03041823301",
            "name": "ដន លន់ ១"
        },
        {
            "barcode": "171118696",
            "dpc": "03041823501",
            "name": "វ៉ាន់ វីរៈ"
        },
        {
            "barcode": "171118697",
            "dpc": "03041823601",
            "name": "វង្ស វ៉ាន់ណាវី"
        },
        {
            "barcode": "171118698",
            "dpc": "03041823701",
            "name": "ភោគ ភាព"
        },
        {
            "barcode": "171118699",
            "dpc": "03041823801",
            "name": "ខៀវ រ៉ាហ្វី ២"
        },
        {
            "barcode": "171118700",
            "dpc": "03041823901",
            "name": "សុខ គង់ ១"
        },
        {
            "barcode": "171118701",
            "dpc": "03041824001",
            "name": "អ៊ិន តាំ"
        },
        {
            "barcode": "171118702",
            "dpc": "03041824101",
            "name": "វិហារជិការអិល"
        },
        {
            "barcode": "171118703",
            "dpc": "03041824201",
            "name": "ស៊ឹម ណាលី"
        },
        {
            "barcode": "171118704",
            "dpc": "03041824301",
            "name": "លី ប៊ុនហេង"
        },
        {
            "barcode": "171118705",
            "dpc": "03041824401",
            "name": "សុខ គង់ ២"
        },
        {
            "barcode": "171118706",
            "dpc": "03041824501",
            "name": "ខៀវ រ៉ាហ្វី"
        },
        {
            "barcode": "171118707",
            "dpc": "03041824601",
            "name": "ម៉ី ពៅ"
        },
        {
            "barcode": "171118708",
            "dpc": "03041824701",
            "name": "ចាប ធូ"
        },
        {
            "barcode": "171118709",
            "dpc": "03041824801",
            "name": "ចាន់ ឬទ្ធី"
        },
        {
            "barcode": "171118710",
            "dpc": "03041824901",
            "name": "យឹន  រឿប"
        },
        {
            "barcode": "171118711",
            "dpc": "03041825001",
            "name": "ចាន់ សុធី"
        },
        {
            "barcode": "171118712",
            "dpc": "03041825101",
            "name": "សួន សិលា"
        },
        {
            "barcode": "171118713",
            "dpc": "03041825301",
            "name": "ខៀវ ប៊ុនរឿប"
        },
        {
            "barcode": "171118714",
            "dpc": "03041825401",
            "name": "ហ៊ុយ វិចិត្រ"
        },
        {
            "barcode": "171118715",
            "dpc": "03041825501",
            "name": "គុជ ស៊ីណា"
        },
        {
            "barcode": "171118716",
            "dpc": "03041825601",
            "name": "ឡុង សារឿន"
        },
        {
            "barcode": "171118717",
            "dpc": "03041825701",
            "name": "ឆាំ រ័ត្នជិគារ"
        },
        {
            "barcode": "171118718",
            "dpc": "03041825801",
            "name": "វ៉ាត វ៉ាន់ឆែ"
        },
        {
            "barcode": "171118719",
            "dpc": "03041825901",
            "name": "ទូច សុម៉ាលី"
        },
        {
            "barcode": "171118720",
            "dpc": "03041826001",
            "name": "ហម ភីរ៉ាត់"
        },
        {
            "barcode": "171118721",
            "dpc": "03041826101",
            "name": "ឃឹម ទិព្វមុនី"
        },
        {
            "barcode": "171118722",
            "dpc": "03041826201",
            "name": "ឆូយចំរើន"
        },
        {
            "barcode": "171118723",
            "dpc": "03041826301",
            "name": "ក្រិទ្ធ រិន"
        },
        {
            "barcode": "171118724",
            "dpc": "03041826501",
            "name": "យឺន វាសនា"
        },
        {
            "barcode": "171118725",
            "dpc": "03041826601",
            "name": "អ៊ី អ៊ារ"
        },
        {
            "barcode": "171118726",
            "dpc": "03041826701",
            "name": "តឹប  ហូវ"
        },
        {
            "barcode": "171118727",
            "dpc": "03041826801",
            "name": "ទៀង គឹមហេង"
        },
        {
            "barcode": "171118728",
            "dpc": "03041826901",
            "name": "អ៊ីវ រតនា"
        },
        {
            "barcode": "171118729",
            "dpc": "03041827001",
            "name": "ប៊ូ ប៊ុនណាត"
        },
        {
            "barcode": "171118730",
            "dpc": "03041806701",
            "name": "ម៉ោញ សារ៉ាត់"
        },
        {
            "barcode": "171118731",
            "dpc": "03041827101",
            "name": "ហូយ  ចាន់ឌី"
        },
        {
            "barcode": "171118732",
            "dpc": "03041827201",
            "name": "យ៉ាង វ៉ាន់ហេង"
        },
        {
            "barcode": "171118733",
            "dpc": "03041827301",
            "name": "ច័ន្ទ  ស៊ីឡា"
        },
        {
            "barcode": "171118734",
            "dpc": "03041829201",
            "name": "រ៉ែ សានិតា"
        },
        {
            "barcode": "171118735",
            "dpc": "03041827501",
            "name": "សួន រិទ្ធី"
        },
        {
            "barcode": "171118736",
            "dpc": "03041827601",
            "name": "លន់ ប៊ុនឡេង"
        },
        {
            "barcode": "171118737",
            "dpc": "03041827701",
            "name": "សួន  គឿន"
        },
        {
            "barcode": "171118738",
            "dpc": "03041827901",
            "name": "គ្រាល សុភាព"
        },
        {
            "barcode": "171118739",
            "dpc": "03041828901",
            "name": "រស់ ហឿន"
        },
        {
            "barcode": "171118740",
            "dpc": "03041829001",
            "name": "ម៉ែន សុវណ្ណ"
        },
        {
            "barcode": "171118741",
            "dpc": "03041829101",
            "name": "ជិត សុខា"
        },
        {
            "barcode": "171118742",
            "dpc": "03041829401",
            "name": "ឆាយ សុធា"
        },
        {
            "barcode": "171118743",
            "dpc": "03041829601",
            "name": "យៀម សុផាត"
        },
        {
            "barcode": "171118744",
            "dpc": "03041829801",
            "name": "ផា រឿន"
        },
        {
            "barcode": "171118745",
            "dpc": "03041829901",
            "name": "គូ សុងលី"
        },
        {
            "barcode": "171118746",
            "dpc": "03041830001",
            "name": "ម៉ៅ មឿង"
        },
        {
            "barcode": "171118747",
            "dpc": "03041830901",
            "name": "ស៊ីន ឃន ២"
        },
        {
            "barcode": "171118748",
            "dpc": "03041830701",
            "name": "តាម វៃ"
        },
        {
            "barcode": "171118749",
            "dpc": "03041830801",
            "name": "ជា សារិន"
        },
        {
            "barcode": "171118750",
            "dpc": "03041830501",
            "name": "សុង ឈុនលី"
        },
        {
            "barcode": "171118751",
            "dpc": "03041830601",
            "name": "ជា វិឆ្ឆ័យ"
        },
        {
            "barcode": "171118752",
            "dpc": "03041837201",
            "name": "ហ្វីលីពីនបាហាយ"
        },
        {
            "barcode": "171118753",
            "dpc": "03041830401",
            "name": "ញ៉ែម រ៉ានី"
        },
        {
            "barcode": "171118754",
            "dpc": "03041830201",
            "name": "សែម សុគន្ធា"
        },
        {
            "barcode": "171118755",
            "dpc": "03041830101",
            "name": "ម៉ុង ហោ"
        },
        {
            "barcode": "171118756",
            "dpc": "03041838301",
            "name": "ជុំ ពោ"
        },
        {
            "barcode": "171118757",
            "dpc": "03041838201",
            "name": "អ៊ឹង ឡាយហ៊ក"
        },
        {
            "barcode": "171118758",
            "dpc": "03041838101",
            "name": "សាប់ គឹមឆម"
        },
        {
            "barcode": "171118759",
            "dpc": "03041838001",
            "name": "ខឹម  សាមុត៉ុ"
        },
        {
            "barcode": "171118760",
            "dpc": "03041837901",
            "name": "ស៊ុន សុវណ្ណ"
        },
        {
            "barcode": "171118761",
            "dpc": "03041802101",
            "name": "លឹម ប៊ុនហេង"
        },
        {
            "barcode": "171118762",
            "dpc": "03041836901",
            "name": "សេង សុខា"
        },
        {
            "barcode": "171118763",
            "dpc": "03041837001",
            "name": "សេង សុវត្ថិឌី"
        },
        {
            "barcode": "171118764",
            "dpc": "03041802601",
            "name": "ឡែន សំអាត"
        },
        {
            "barcode": "171118765",
            "dpc": "03041837101",
            "name": "ម៉ិល សុផល"
        },
        {
            "barcode": "171118766",
            "dpc": "03041837301",
            "name": "សួន សាវិញ"
        },
        {
            "barcode": "171118767",
            "dpc": "03041837401",
            "name": "សោម មុន្នីរ័ត្ន"
        },
        {
            "barcode": "171118768",
            "dpc": "03041837601",
            "name": "អៀម ដានី"
        },
        {
            "barcode": "171118769",
            "dpc": "03041837701",
            "name": "គង់ សំភ័ស្ស"
        },
        {
            "barcode": "171118770",
            "dpc": "03041837801",
            "name": "អ៊ុំ សុខា"
        },
        {
            "barcode": "171118771",
            "dpc": "03041836801",
            "name": "ធឹង គឹមហេង១"
        },
        {
            "barcode": "171118772",
            "dpc": "03041836601",
            "name": "នាង រដ្ឋា"
        },
        {
            "barcode": "171118773",
            "dpc": "03041836501",
            "name": "អ៊ុក គឹម"
        },
        {
            "barcode": "171118774",
            "dpc": "03041836301",
            "name": "ឌី ថារី"
        },
        {
            "barcode": "171118775",
            "dpc": "03041836201",
            "name": "កែវ នីម"
        },
        {
            "barcode": "171118776",
            "dpc": "03041836101",
            "name": "អ៊ីវ កុលស្ស"
        },
        {
            "barcode": "171118777",
            "dpc": "03041836001",
            "name": "សុខ គឹមសួរ"
        },
        {
            "barcode": "171118778",
            "dpc": "03041835901",
            "name": "អ៊ុក ចន្ថា"
        },
        {
            "barcode": "171118779",
            "dpc": "03041835801",
            "name": "ឃុត អ៊ឹង"
        },
        {
            "barcode": "171118780",
            "dpc": "03041835701",
            "name": "ស៊ឹម ប៊ុនធឿន"
        },
        {
            "barcode": "171118781",
            "dpc": "03041835501",
            "name": "ជា  វណ្ណារិទ្ធ"
        },
        {
            "barcode": "171118782",
            "dpc": "03041835401",
            "name": "លឿង សុឃីម"
        },
        {
            "barcode": "171118783",
            "dpc": "03041835301",
            "name": "អ៊ុក វាសនា"
        },
        {
            "barcode": "171118784",
            "dpc": "03041835201",
            "name": "ប្រាក់ យូ"
        },
        {
            "barcode": "171118785",
            "dpc": "03041835101",
            "name": "គឹម វណ្ណឌី"
        },
        {
            "barcode": "171118786",
            "dpc": "03041835001",
            "name": "អ៊ឹម សុខឿន"
        },
        {
            "barcode": "171118787",
            "dpc": "03041834901",
            "name": "លឿង សុវណ្ណា"
        },
        {
            "barcode": "171118788",
            "dpc": "03041834801",
            "name": "ម៉ៅ មើរ"
        },
        {
            "barcode": "171118789",
            "dpc": "03041834701",
            "name": "អ៊ុត ណែ"
        },
        {
            "barcode": "171118790",
            "dpc": "03041834601",
            "name": "ស៊ុន គឹមថៃ"
        },
        {
            "barcode": "171118791",
            "dpc": "03041834501",
            "name": "ធាង  ណុង"
        },
        {
            "barcode": "171118792",
            "dpc": "03041834401",
            "name": "វ៉ាន់ ប៊ុនធៀប"
        },
        {
            "barcode": "171118793",
            "dpc": "03041834301",
            "name": "សាន ហឿម"
        },
        {
            "barcode": "171118794",
            "dpc": "03041834201",
            "name": "លាង សំអ៊ុល"
        },
        {
            "barcode": "171118795",
            "dpc": "03041834101",
            "name": "តឹង អៀង"
        },
        {
            "barcode": "171118796",
            "dpc": "03041833901",
            "name": "ស៊ុំ លឹម"
        },
        {
            "barcode": "171118797",
            "dpc": "03041833701",
            "name": "ហ៊ាង ថុង"
        },
        {
            "barcode": "171118798",
            "dpc": "03041833601",
            "name": "ស៊ាង ហ៊ួត"
        },
        {
            "barcode": "171118799",
            "dpc": "03041833501",
            "name": "កាក់ សុខា"
        },
        {
            "barcode": "171118800",
            "dpc": "03041833401",
            "name": "ខាវ ហួត"
        },
        {
            "barcode": "171118801",
            "dpc": "03041833301",
            "name": "អ៊ុក ឃ្នួច ២"
        },
        {
            "barcode": "171118802",
            "dpc": "03041833201",
            "name": "អ៊ុក ឃ្នួច ១"
        },
        {
            "barcode": "171118803",
            "dpc": "03041833101",
            "name": "ម៉ុច សុម៉ាល័យ"
        },
        {
            "barcode": "171118804",
            "dpc": "03041833001",
            "name": "នៅ បុល"
        },
        {
            "barcode": "171118805",
            "dpc": "03041832901",
            "name": "ខាំ ឈៀង"
        },
        {
            "barcode": "171118806",
            "dpc": "03041832801",
            "name": "ផុន ប្រុស"
        },
        {
            "barcode": "171118807",
            "dpc": "03041832601",
            "name": "ទៀង មុនីរដ្ឋា"
        },
        {
            "barcode": "171118808",
            "dpc": "03041832501",
            "name": "ដុះ ឈួម"
        },
        {
            "barcode": "171118809",
            "dpc": "03041831901",
            "name": "លឹម សុខម៉េង"
        },
        {
            "barcode": "171118810",
            "dpc": "03041832001",
            "name": "ហួន សារ៉ាយ"
        },
        {
            "barcode": "171118811",
            "dpc": "03041832201",
            "name": "លឿង ណាវី"
        },
        {
            "barcode": "171118812",
            "dpc": "03041832301",
            "name": "ប៉ាង វុទ្ធី"
        },
        {
            "barcode": "171118813",
            "dpc": "03041832401",
            "name": "សឿរ សុខុម"
        },
        {
            "barcode": "171118814",
            "dpc": "03041825201",
            "name": "សុខ ចំរើន"
        },
        {
            "barcode": "171118815",
            "dpc": "03041831801",
            "name": "លឿង លៀង"
        },
        {
            "barcode": "171118816",
            "dpc": "03041831701",
            "name": "ដន លន់"
        },
        {
            "barcode": "171118817",
            "dpc": "03041831601",
            "name": "ព្រីង បញ្ញារិទ្ធ"
        },
        {
            "barcode": "171118818",
            "dpc": "03041831501",
            "name": "ទូច សេន"
        },
        {
            "barcode": "171118819",
            "dpc": "03041831401",
            "name": "ឆិវ សុខឡេង"
        },
        {
            "barcode": "171118820",
            "dpc": "03041831301",
            "name": "ផែ ប៊ុនឡុង"
        },
        {
            "barcode": "171118821",
            "dpc": "03041831201",
            "name": "ជី ខេង"
        },
        {
            "barcode": "171118822",
            "dpc": "03041831101",
            "name": "ប្រាក់ សាលឿត"
        },
        {
            "barcode": "171118823",
            "dpc": "03041831001",
            "name": "ម៉ម នាង"
        },
        {
            "barcode": "171118824",
            "dpc": "03041802901",
            "name": "ជូ  តឹក"
        },
        {
            "barcode": "171118825",
            "dpc": "03041804901",
            "name": "លឹម  តុង"
        },
        {
            "barcode": "171118826",
            "dpc": "03041805201",
            "name": "ប៊ូ  លាង"
        },
        {
            "barcode": "171118827",
            "dpc": "03041805301",
            "name": "ប៊ូ   ណាវី"
        },
        {
            "barcode": "171118828",
            "dpc": "03041811801",
            "name": "រឿន  រ៉េត"
        },
        {
            "barcode": "171118829",
            "dpc": "03041812001",
            "name": "អ៊ុន  គីជន"
        },
        {
            "barcode": "171118830",
            "dpc": "03041828001",
            "name": "រត្ន  សារ៉ែម"
        },
        {
            "barcode": "171118831",
            "dpc": "03041848001",
            "name": "ស៊ុន សូ"
        }
    ]
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
