let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171119104",
            "dpc": "03041902401",
            "name": "ទូច រៀម"
        },
        {
            "barcode": "171119105",
            "dpc": "03041902501",
            "name": "កែវ ផលរដ្ឋ"
        },
        {
            "barcode": "171119106",
            "dpc": "03041913401",
            "name": "ហោល វ៉ាន"
        },
        {
            "barcode": "171119107",
            "dpc": "03041913501",
            "name": "ជួង គឹមសាន"
        },
        {
            "barcode": "171119108",
            "dpc": "03041913601",
            "name": "ជិន ចាន់"
        },
        {
            "barcode": "171119109",
            "dpc": "03041913701",
            "name": "សែម ធួន"
        },
        {
            "barcode": "171119110",
            "dpc": "03041913801",
            "name": "លាង ឆេង"
        },
        {
            "barcode": "171119111",
            "dpc": "03041913901",
            "name": "អៃ  អ៊ី"
        },
        {
            "barcode": "171119112",
            "dpc": "03041914001",
            "name": "ចាន់ នីស្សា"
        },
        {
            "barcode": "171119113",
            "dpc": "03041914101",
            "name": "សុខ ឌួង"
        },
        {
            "barcode": "171119114",
            "dpc": "03041914201",
            "name": "ឡៃ ហ៊ាង"
        },
        {
            "barcode": "171119115",
            "dpc": "03041914301",
            "name": "ហុក ហេង"
        },
        {
            "barcode": "171119116",
            "dpc": "03041914401",
            "name": "ជិន សារិន"
        },
        {
            "barcode": "171119117",
            "dpc": "03041914601",
            "name": "ដៀប គាំ"
        },
        {
            "barcode": "171119118",
            "dpc": "03041914701",
            "name": "តាន់ គឹមស្រូ"
        },
        {
            "barcode": "171119119",
            "dpc": "03041914801",
            "name": "ស៊ីវ ខេង"
        },
        {
            "barcode": "171119120",
            "dpc": "03041914901",
            "name": "ហែន ឆាំ"
        },
        {
            "barcode": "171119121",
            "dpc": "03041915001",
            "name": "កែ ឃាន"
        },
        {
            "barcode": "171119122",
            "dpc": "03041915101",
            "name": "ប្រាក់ ថាវី"
        },
        {
            "barcode": "171119123",
            "dpc": "03041915201",
            "name": "កែ ឆេន"
        },
        {
            "barcode": "171119124",
            "dpc": "03041915301",
            "name": "ម៉ូ ភឿត"
        },
        {
            "barcode": "171119125",
            "dpc": "03041915401",
            "name": "អៀម គុយ"
        },
        {
            "barcode": "171119126",
            "dpc": "03041915501",
            "name": "ហ៊ីង ចាន់ថន"
        },
        {
            "barcode": "171119127",
            "dpc": "03041915601",
            "name": "ភិន សុផាត"
        },
        {
            "barcode": "171119128",
            "dpc": "03041915701",
            "name": "អ៊ុច ភិន"
        },
        {
            "barcode": "171119129",
            "dpc": "03041915801",
            "name": "អ៊ុច សុភី"
        },
        {
            "barcode": "171119130",
            "dpc": "03041915901",
            "name": "អ៊ុក សារ៉េត"
        },
        {
            "barcode": "171119131",
            "dpc": "03041916001",
            "name": "ស៊ុន បូរី"
        },
        {
            "barcode": "171119132",
            "dpc": "03041916101",
            "name": "សេក ចាន់រស្មី"
        },
        {
            "barcode": "171119133",
            "dpc": "03041916201",
            "name": "ជ័យ ពីន"
        },
        {
            "barcode": "171119134",
            "dpc": "03041916301",
            "name": "ណុប គុំ"
        },
        {
            "barcode": "171119135",
            "dpc": "03041916401",
            "name": "ពៅ ឈឿន"
        },
        {
            "barcode": "171119136",
            "dpc": "03041916501",
            "name": "ពៅ វណ្ណា"
        },
        {
            "barcode": "171119137",
            "dpc": "03041916601",
            "name": "តឹក គឹមសន"
        },
        {
            "barcode": "171119138",
            "dpc": "03041916701",
            "name": "តឹក ស៊ីវអេង"
        },
        {
            "barcode": "171119139",
            "dpc": "03041916801",
            "name": "វឿត ចាន់ណា"
        },
        {
            "barcode": "171119140",
            "dpc": "03041916901",
            "name": "លិញ ផាន"
        },
        {
            "barcode": "171119141",
            "dpc": "03041917101",
            "name": "ម៉ូត វោយហូរ"
        },
        {
            "barcode": "171119142",
            "dpc": "03041917001",
            "name": "ជឹង គឹមសុន"
        },
        {
            "barcode": "171119143",
            "dpc": "03041917201",
            "name": "ជឹង ញ៉េន"
        },
        {
            "barcode": "171119144",
            "dpc": "03041917301",
            "name": "អេន សាខន"
        },
        {
            "barcode": "171119145",
            "dpc": "03041917401",
            "name": "វឿន វ័ន្ត"
        },
        {
            "barcode": "171119146",
            "dpc": "03041917501",
            "name": "ទិត យ៉ុម"
        },
        {
            "barcode": "171119147",
            "dpc": "03041917601",
            "name": "សេក សុផុន"
        },
        {
            "barcode": "171119148",
            "dpc": "03041917701",
            "name": "តិប សុមន្នី"
        },
        {
            "barcode": "171119149",
            "dpc": "03041917901",
            "name": "ទូច គង់"
        },
        {
            "barcode": "171119150",
            "dpc": "03041918101",
            "name": "វង  ស្រីទូច"
        },
        {
            "barcode": "171119151",
            "dpc": "03041918001",
            "name": "ទូច សឿង"
        },
        {
            "barcode": "171119152",
            "dpc": "03041918201",
            "name": "សេន វន"
        },
        {
            "barcode": "171119153",
            "dpc": "03041918301",
            "name": "សុខ នាង"
        },
        {
            "barcode": "171119154",
            "dpc": "03041918401",
            "name": "យិប សុគន្ធ"
        },
        {
            "barcode": "171119155",
            "dpc": "03041918501",
            "name": "ឆោម ប៊ុនធី"
        },
        {
            "barcode": "171119156",
            "dpc": "03041918601",
            "name": "ចាន់ មណ្ឌល"
        },
        {
            "barcode": "171119157",
            "dpc": "03041918701",
            "name": "ស៊ុំំ គឹមយ៉េង"
        },
        {
            "barcode": "171119158",
            "dpc": "03041918801",
            "name": "ម៉េង វែង"
        },
        {
            "barcode": "171119159",
            "dpc": "03041918901",
            "name": "ញ៉ែម កេត"
        },
        {
            "barcode": "171119160",
            "dpc": "03041919001",
            "name": "ស៊ីវ ខេន"
        },
        {
            "barcode": "171119161",
            "dpc": "03041919101",
            "name": "កែវ ស"
        },
        {
            "barcode": "171119162",
            "dpc": "03041919201",
            "name": "ស៊ូ ថន"
        },
        {
            "barcode": "171119163",
            "dpc": "03041919301",
            "name": "គុយ ចាន់ផេង"
        },
        {
            "barcode": "171119164",
            "dpc": "03041919401",
            "name": "តាំង ឆេងហ៊ាង"
        },
        {
            "barcode": "171119165",
            "dpc": "03041919501",
            "name": "ហឿង វណ្ណដេត"
        },
        {
            "barcode": "171119166",
            "dpc": "03041919601",
            "name": "អ៊ឹង សំបូរ"
        },
        {
            "barcode": "171119167",
            "dpc": "03041919701",
            "name": "កែវ ប៊ុននី"
        },
        {
            "barcode": "171119168",
            "dpc": "03041919801",
            "name": "ព្រឿន ស្រីរដ្ឋ"
        },
        {
            "barcode": "171119169",
            "dpc": "03041919901",
            "name": "ព្រីង   ចំរើន"
        },
        {
            "barcode": "171119170",
            "dpc": "03041920001",
            "name": "ទុង   រ៉ាដូ"
        },
        {
            "barcode": "171119171",
            "dpc": "03041920101",
            "name": "ម៉ិល ណេង"
        },
        {
            "barcode": "171119172",
            "dpc": "03041920201",
            "name": "ម៉ៅ សុផាត"
        },
        {
            "barcode": "171119173",
            "dpc": "03041920301",
            "name": "សៅ ស៊ីថា"
        },
        {
            "barcode": "171119174",
            "dpc": "03041920401",
            "name": "សំ ស៊ីណាត"
        },
        {
            "barcode": "171119175",
            "dpc": "03041920501",
            "name": "ហែម សាន"
        },
        {
            "barcode": "171119176",
            "dpc": "03041920701",
            "name": "អោក សុវណ្ណ"
        },
        {
            "barcode": "171119177",
            "dpc": "03041920801",
            "name": "សូ ម៉ន"
        },
        {
            "barcode": "171119178",
            "dpc": "03041920901",
            "name": "មាន ធន"
        },
        {
            "barcode": "171119179",
            "dpc": "03041921001",
            "name": "ដេន តាំង"
        },
        {
            "barcode": "171119180",
            "dpc": "03041921101",
            "name": "នៅ ស៊ីថា"
        },
        {
            "barcode": "171119181",
            "dpc": "03041921201",
            "name": "រុន  ថែល"
        },
        {
            "barcode": "171119182",
            "dpc": "03041921301",
            "name": "សូ សៀក"
        },
        {
            "barcode": "171119183",
            "dpc": "03041921401",
            "name": "កៅ សុខលី"
        },
        {
            "barcode": "171119184",
            "dpc": "03041921501",
            "name": "អ៊ឹម សារឿន"
        },
        {
            "barcode": "171119185",
            "dpc": "03041921601",
            "name": "ឡៃ ស៊ីណាត"
        },
        {
            "barcode": "171119186",
            "dpc": "03041921701",
            "name": "ព្រាប សុជាតា"
        },
        {
            "barcode": "171119187",
            "dpc": "03041921801",
            "name": "ងន់ ប៊ុន"
        },
        {
            "barcode": "171119188",
            "dpc": "03041921901",
            "name": "ឈឺន ឆូយ"
        },
        {
            "barcode": "171119189",
            "dpc": "03041922001",
            "name": "សេង ហៀប"
        },
        {
            "barcode": "171119190",
            "dpc": "03041922101",
            "name": "ម៉ឺន សុខុន"
        },
        {
            "barcode": "171119191",
            "dpc": "03041922201",
            "name": "នូ សាម៉ុន"
        },
        {
            "barcode": "171119192",
            "dpc": "03041922301",
            "name": "ប៉ោ គឹមវិទ្ធ"
        },
        {
            "barcode": "171119193",
            "dpc": "03041922401",
            "name": "គឹម យៀក"
        },
        {
            "barcode": "171119194",
            "dpc": "03041922501",
            "name": "គឹម ជៀន"
        },
        {
            "barcode": "171119195",
            "dpc": "03041922601",
            "name": "ទី គឹមអៀង"
        },
        {
            "barcode": "171119196",
            "dpc": "03041922701",
            "name": "ឡេង វិសាល"
        },
        {
            "barcode": "171119197",
            "dpc": "03041922901",
            "name": "សន មុន្នី"
        },
        {
            "barcode": "171119198",
            "dpc": "03041923001",
            "name": "គឹម សួរ"
        },
        {
            "barcode": "171119199",
            "dpc": "03041923101",
            "name": "ឈឹម  ឡែន"
        },
        {
            "barcode": "171119200",
            "dpc": "03041923201",
            "name": "ជុន ស៊ីថា"
        },
        {
            "barcode": "171119201",
            "dpc": "03041923301",
            "name": "កៅ ហៃ"
        },
        {
            "barcode": "171119202",
            "dpc": "03041923401",
            "name": "ណុប ស្រីនាង"
        },
        {
            "barcode": "171119203",
            "dpc": "03041923501",
            "name": "នៅ សារឿត"
        },
        {
            "barcode": "171119204",
            "dpc": "03041923601",
            "name": "ឯម ហេង"
        },
        {
            "barcode": "171119205",
            "dpc": "03041923901",
            "name": "ឯក ធឿង"
        },
        {
            "barcode": "171119206",
            "dpc": "03041924001",
            "name": "មាឃខ ណារិន"
        },
        {
            "barcode": "171119207",
            "dpc": "03041924101",
            "name": "ហម  សុភា"
        },
        {
            "barcode": "171119208",
            "dpc": "03041924201",
            "name": "ទុយ វឺ"
        },
        {
            "barcode": "171119209",
            "dpc": "03041924301",
            "name": "រស់ រិទ្ធ"
        },
        {
            "barcode": "171119210",
            "dpc": "03041924401",
            "name": "សេង គង់"
        },
        {
            "barcode": "171119211",
            "dpc": "03041924501",
            "name": "គឹម សុខា"
        },
        {
            "barcode": "171119212",
            "dpc": "03041924601",
            "name": "ធូ សារិន"
        },
        {
            "barcode": "171119213",
            "dpc": "03041924701",
            "name": "កែវ ប៊ុនឈឿន"
        },
        {
            "barcode": "171119214",
            "dpc": "03041924801",
            "name": "ផេង ផល្លី"
        },
        {
            "barcode": "171119215",
            "dpc": "03041900101",
            "name": "ជិន នៅ"
        },
        {
            "barcode": "171119216",
            "dpc": "03041900201",
            "name": "រស់ សំអាត"
        },
        {
            "barcode": "171119217",
            "dpc": "03041902701",
            "name": "មុំ សាមឌី"
        },
        {
            "barcode": "171119218",
            "dpc": "03041902801",
            "name": "ស៊ុម លឹម"
        },
        {
            "barcode": "171119219",
            "dpc": "03041902901",
            "name": "ស៊ុម ឡេង"
        },
        {
            "barcode": "171119220",
            "dpc": "03041903101",
            "name": "គង់ ស្រគៀល"
        },
        {
            "barcode": "171119221",
            "dpc": "03041903401",
            "name": "ភឿ គឹមលី"
        },
        {
            "barcode": "171119222",
            "dpc": "03041903501",
            "name": "ប៉ែន ទូច"
        },
        {
            "barcode": "171119223",
            "dpc": "03041903601",
            "name": "ហែម ធុយ"
        },
        {
            "barcode": "171119224",
            "dpc": "03041903701",
            "name": "ពេជ្រ សុធា"
        },
        {
            "barcode": "171119225",
            "dpc": "03041903801",
            "name": "ខាត់ សុខ"
        },
        {
            "barcode": "171119226",
            "dpc": "03041903901",
            "name": "ស៊ិន ចាន់ពៅរ៉ូហ្សិត"
        },
        {
            "barcode": "171119227",
            "dpc": "03041904001",
            "name": "ឃុន សារ៉ាឌី"
        },
        {
            "barcode": "171119228",
            "dpc": "03041904101",
            "name": "ហ៊ុយ ហ៊ាង"
        },
        {
            "barcode": "171119229",
            "dpc": "03041904201",
            "name": "តាំង ពិសី"
        },
        {
            "barcode": "171119230",
            "dpc": "03041904301",
            "name": "ប៊ុន លី"
        },
        {
            "barcode": "171119231",
            "dpc": "03041904401",
            "name": "មុំ ហាក់"
        },
        {
            "barcode": "171119232",
            "dpc": "03041904501",
            "name": "អង់ រ៉ែម"
        },
        {
            "barcode": "171119233",
            "dpc": "03041904701",
            "name": "ឯម  សារុំ"
        },
        {
            "barcode": "171119234",
            "dpc": "03041904801",
            "name": "នៅ ម៉ុន"
        },
        {
            "barcode": "171119235",
            "dpc": "03041904901",
            "name": "ឯម សាវ៉ាត"
        },
        {
            "barcode": "171119236",
            "dpc": "03041905001",
            "name": "ចឹក សុខេង"
        },
        {
            "barcode": "171119237",
            "dpc": "03041905101",
            "name": "ណូ ណូត"
        },
        {
            "barcode": "171119238",
            "dpc": "03041905201",
            "name": "កែវ ផេង"
        },
        {
            "barcode": "171119239",
            "dpc": "03041905301",
            "name": "ហ៊ឹម គឹមលី"
        },
        {
            "barcode": "171119240",
            "dpc": "03041905401",
            "name": "សាយ រិទ្ធី"
        },
        {
            "barcode": "171119241",
            "dpc": "03041905601",
            "name": "នុត ហ៊ាង"
        },
        {
            "barcode": "171119242",
            "dpc": "03041905701",
            "name": "អ៊ូច សុផាណាន"
        },
        {
            "barcode": "171119243",
            "dpc": "03041905801",
            "name": "ផាន សុភា"
        },
        {
            "barcode": "171119244",
            "dpc": "03041905901",
            "name": "ស៊ឹម សុឃន"
        },
        {
            "barcode": "171119245",
            "dpc": "03041906001",
            "name": "ពេជ្រ សុវណ្ណ"
        },
        {
            "barcode": "171119246",
            "dpc": "03041906101",
            "name": "ឆេង ណុល"
        },
        {
            "barcode": "171119247",
            "dpc": "03041904601",
            "name": "ខន អៀក"
        },
        {
            "barcode": "171119248",
            "dpc": "03041906201",
            "name": "សុខ ចាន់រ៉ា"
        },
        {
            "barcode": "171119249",
            "dpc": "03041906301",
            "name": "ឆេង មុំ"
        },
        {
            "barcode": "171119250",
            "dpc": "03041906401",
            "name": "សុខ ចាន់"
        },
        {
            "barcode": "171119251",
            "dpc": "03041906501",
            "name": "ម៉ង ប៉ោហ៊ុយ"
        },
        {
            "barcode": "171119252",
            "dpc": "03041906601",
            "name": "ទូច យ៉ាន"
        },
        {
            "barcode": "171119253",
            "dpc": "03041906701",
            "name": "លឹម ទាពីវ"
        },
        {
            "barcode": "171119254",
            "dpc": "03041906901",
            "name": "ជុន សុខា"
        },
        {
            "barcode": "171119255",
            "dpc": "03041907001",
            "name": "សោម រិទ្ធ"
        },
        {
            "barcode": "171119256",
            "dpc": "03041907101",
            "name": "យ៉ាន សៀន"
        },
        {
            "barcode": "171119257",
            "dpc": "03041907201",
            "name": "គី ភនចាយ"
        },
        {
            "barcode": "171119258",
            "dpc": "03041907301",
            "name": "ឃុត សំអឿន"
        },
        {
            "barcode": "171119259",
            "dpc": "03041907401",
            "name": "យឹម សែ"
        },
        {
            "barcode": "171119260",
            "dpc": "03041907501",
            "name": "អ៊ឹង កូយ"
        },
        {
            "barcode": "171119261",
            "dpc": "03041907601",
            "name": "សោម សុវណ្ណ"
        },
        {
            "barcode": "171119262",
            "dpc": "03041907701",
            "name": "សាលា ឃុំទួលតាឯក"
        },
        {
            "barcode": "171119263",
            "dpc": "03041907801",
            "name": "អ៊ឹង ចេងគ្រី"
        },
        {
            "barcode": "171119264",
            "dpc": "03041907901",
            "name": "ពា កយ"
        },
        {
            "barcode": "171119265",
            "dpc": "03041908001",
            "name": "ហុក កុសល"
        },
        {
            "barcode": "171119266",
            "dpc": "03041908101",
            "name": "ពៅ ហេឡែន"
        },
        {
            "barcode": "171119267",
            "dpc": "03041908201",
            "name": "គឹម ហួង"
        },
        {
            "barcode": "171119268",
            "dpc": "03041908301",
            "name": "ង៉ែត សារ៉ន"
        },
        {
            "barcode": "171119269",
            "dpc": "03041908401",
            "name": "គៀង សុគន្ធារី"
        },
        {
            "barcode": "171119270",
            "dpc": "03041908501",
            "name": "ហុក វុទ្ធី"
        },
        {
            "barcode": "171119271",
            "dpc": "03041908601",
            "name": "ម៉ិន  ស៊ិមអេង"
        },
        {
            "barcode": "171119272",
            "dpc": "03041908801",
            "name": "អ៊ឹង គួយ"
        },
        {
            "barcode": "171119273",
            "dpc": "03041908901",
            "name": "ហាក់  ស្រី"
        },
        {
            "barcode": "171119274",
            "dpc": "03041909101",
            "name": "សុខ លឹមហាក់"
        },
        {
            "barcode": "171119275",
            "dpc": "03041909201",
            "name": "ម៉ៅ ផាន់"
        },
        {
            "barcode": "171119276",
            "dpc": "03041909401",
            "name": "ហុក ឈុនឡេង"
        },
        {
            "barcode": "171119277",
            "dpc": "03041909501",
            "name": "ឡោ អ៊ូ"
        },
        {
            "barcode": "171119278",
            "dpc": "03041909601",
            "name": "ចាប កុយ"
        },
        {
            "barcode": "171119279",
            "dpc": "03041909701",
            "name": "អោម សារឿយ"
        },
        {
            "barcode": "171119280",
            "dpc": "03041909801",
            "name": "ថោង គឹមស្រូ"
        },
        {
            "barcode": "171119281",
            "dpc": "03041910001",
            "name": "វឿន វិន"
        },
        {
            "barcode": "171119282",
            "dpc": "03041910101",
            "name": "អ៊ឹម ទ្រី"
        },
        {
            "barcode": "171119283",
            "dpc": "03041910201",
            "name": "ហង់ ម៉ាឡានី"
        },
        {
            "barcode": "171119284",
            "dpc": "03041910301",
            "name": "ងិន គឹមលាន"
        },
        {
            "barcode": "171119285",
            "dpc": "03041910401",
            "name": "ហ៊ិន មុំ"
        },
        {
            "barcode": "171119286",
            "dpc": "03041910501",
            "name": "ប៉ែន ហ៊ុច"
        },
        {
            "barcode": "171119287",
            "dpc": "03041910601",
            "name": "វឿត លឿម"
        },
        {
            "barcode": "171119288",
            "dpc": "03041910701",
            "name": "ជៀម បូរ៉េន"
        },
        {
            "barcode": "171119289",
            "dpc": "03041910801",
            "name": "ថូ ធី"
        },
        {
            "barcode": "171119290",
            "dpc": "03041910901",
            "name": "ងួន ខុន"
        },
        {
            "barcode": "171119291",
            "dpc": "03041911001",
            "name": "ឈឹម សុម៉ាលី"
        },
        {
            "barcode": "171119292",
            "dpc": "03041911101",
            "name": "ឯម ចន្ថា"
        },
        {
            "barcode": "171119293",
            "dpc": "03041911201",
            "name": "ស៊ិន សម្បត្តិ"
        },
        {
            "barcode": "171119294",
            "dpc": "03041911301",
            "name": "សេង វ៉ាន់នឿន"
        },
        {
            "barcode": "171119295",
            "dpc": "03041911401",
            "name": "គង់ យ៉ានី"
        },
        {
            "barcode": "171119296",
            "dpc": "03041911501",
            "name": "ឡុង នាង"
        },
        {
            "barcode": "171119297",
            "dpc": "03041911601",
            "name": "កៅ សារ៉ុន"
        },
        {
            "barcode": "171119298",
            "dpc": "03041911701",
            "name": "ឡុង ប៊ុនថា"
        },
        {
            "barcode": "171119299",
            "dpc": "03041911801",
            "name": "ឆោម ប៊ុនធី"
        },
        {
            "barcode": "171119300",
            "dpc": "03041911901",
            "name": "តោ ទៀប"
        },
        {
            "barcode": "171119301",
            "dpc": "03041912001",
            "name": "កៅ ចាត"
        },
        {
            "barcode": "171119302",
            "dpc": "03041912201",
            "name": "ប៊ូ ហាំង"
        },
        {
            "barcode": "171119303",
            "dpc": "03041912301",
            "name": "ផាន់ ហៃ"
        },
        {
            "barcode": "171119304",
            "dpc": "03041912401",
            "name": "ភួយ  លាងអ៊ី"
        },
        {
            "barcode": "171119305",
            "dpc": "03041912501",
            "name": "គល់ ប្រឹម"
        },
        {
            "barcode": "171119306",
            "dpc": "03041912601",
            "name": "ភូ ចាយ"
        },
        {
            "barcode": "171119307",
            "dpc": "03041912701",
            "name": "ចាន់ ធី"
        },
        {
            "barcode": "171119308",
            "dpc": "03041912801",
            "name": "ឈាន ស៊ីណា"
        },
        {
            "barcode": "171119309",
            "dpc": "03041912901",
            "name": "ចាន់ អូន"
        },
        {
            "barcode": "171119310",
            "dpc": "03041913001",
            "name": "សេក តូ"
        },
        {
            "barcode": "171119311",
            "dpc": "03041913101",
            "name": "ខុន ដា"
        },
        {
            "barcode": "171119312",
            "dpc": "03041913201",
            "name": "ខុន សាឃឿត"
        },
        {
            "barcode": "171119313",
            "dpc": "03041913301",
            "name": "ខុន និមល"
        },
        {
            "barcode": "171119314",
            "dpc": "03041935001",
            "name": "សូ វ៉ែ"
        },
        {
            "barcode": "171119315",
            "dpc": "03041935101",
            "name": "សូ គឹមរឿត"
        },
        {
            "barcode": "171119316",
            "dpc": "03041935201",
            "name": "គី ជីវ័ន្ត"
        },
        {
            "barcode": "171119317",
            "dpc": "03041935301",
            "name": "ជិន សាខន"
        },
        {
            "barcode": "171119318",
            "dpc": "03041935401",
            "name": "ភោគ កែវ"
        },
        {
            "barcode": "171119319",
            "dpc": "03041935601",
            "name": "មាស សុភាព"
        },
        {
            "barcode": "171119320",
            "dpc": "03041935801",
            "name": "កើត ម៉ូលី"
        },
        {
            "barcode": "171119321",
            "dpc": "03041935901",
            "name": "ហ៊ុន សារួន"
        },
        {
            "barcode": "171119322",
            "dpc": "03041936201",
            "name": "ចេង ចន្ធ"
        },
        {
            "barcode": "171119323",
            "dpc": "03041936001",
            "name": "ពៅ សុភាព"
        },
        {
            "barcode": "171119324",
            "dpc": "03041936101",
            "name": "ស៊ឺន ប៊ុនថា"
        },
        {
            "barcode": "171119325",
            "dpc": "03041936301",
            "name": "ម៉ៅ សារួន"
        },
        {
            "barcode": "171119326",
            "dpc": "03041936401",
            "name": "កែវ សារឿន"
        },
        {
            "barcode": "171119327",
            "dpc": "03041936501",
            "name": "កែវ យឿង"
        },
        {
            "barcode": "171119328",
            "dpc": "03041936601",
            "name": "ប្រាក់ សុខា"
        },
        {
            "barcode": "171119329",
            "dpc": "03041936701",
            "name": "ប៉ាត់  សំណាង"
        },
        {
            "barcode": "171119330",
            "dpc": "03041936801",
            "name": "ជិន ហេង"
        },
        {
            "barcode": "171119331",
            "dpc": "03041936901",
            "name": "អៀម គៀង"
        },
        {
            "barcode": "171119332",
            "dpc": "03041937001",
            "name": "អ៊ឹម សារិន"
        },
        {
            "barcode": "171119333",
            "dpc": "03041937101",
            "name": "ម៉ៅ វ៉ា"
        },
        {
            "barcode": "171119334",
            "dpc": "03041937201",
            "name": "យ៉ាត ឌិន"
        },
        {
            "barcode": "171119335",
            "dpc": "03041937301",
            "name": "នួន ណារុំ"
        },
        {
            "barcode": "171119336",
            "dpc": "03041937401",
            "name": "សំរិត ឆន"
        },
        {
            "barcode": "171119337",
            "dpc": "03041937501",
            "name": "ប៉ាល់ ណាំ"
        },
        {
            "barcode": "171119338",
            "dpc": "03041937601",
            "name": "ស្កាន  សំបូរ"
        },
        {
            "barcode": "171119339",
            "dpc": "03041937701",
            "name": "អ៊ី ចាន់"
        },
        {
            "barcode": "171119340",
            "dpc": "03041937801",
            "name": "ឡៃ ស៊ាន"
        },
        {
            "barcode": "171119341",
            "dpc": "03041937901",
            "name": "កែម គាន"
        },
        {
            "barcode": "171119342",
            "dpc": "03041938001",
            "name": "អ៊ឹម វ៉ាន់ថា"
        },
        {
            "barcode": "171119343",
            "dpc": "03041938101",
            "name": "ទួន  រិទ្ធ"
        },
        {
            "barcode": "171119344",
            "dpc": "03041938201",
            "name": "លី ហួរ"
        },
        {
            "barcode": "171119345",
            "dpc": "03041938401",
            "name": "ង៉ាន សារ៉េត"
        },
        {
            "barcode": "171119346",
            "dpc": "03041938501",
            "name": "សួម  ឆាយ"
        },
        {
            "barcode": "171119347",
            "dpc": "03041938601",
            "name": "ស៊ុំ ភ័ណ្ឌ"
        },
        {
            "barcode": "171119348",
            "dpc": "03041938701",
            "name": "លន់ គឹមលី"
        },
        {
            "barcode": "171119349",
            "dpc": "03041938801",
            "name": "ក្តិប ជុំនិត"
        },
        {
            "barcode": "171119350",
            "dpc": "03041939001",
            "name": "ប៉ែន សារ៉ាត់"
        },
        {
            "barcode": "171119351",
            "dpc": "03041939101",
            "name": "នួន លឿប"
        },
        {
            "barcode": "171119352",
            "dpc": "03041939801",
            "name": "អេង ប៊ុនហេង"
        },
        {
            "barcode": "171119353",
            "dpc": "03041939301",
            "name": "វឿត ហឿម"
        },
        {
            "barcode": "171119354",
            "dpc": "03041939201",
            "name": "ជុំ ហាច"
        },
        {
            "barcode": "171119355",
            "dpc": "03041939401",
            "name": "ទីម  ហ៊ុច"
        },
        {
            "barcode": "171119356",
            "dpc": "03041939601",
            "name": "ផន កែវ"
        },
        {
            "barcode": "171119357",
            "dpc": "03041939501",
            "name": "គិម សឿន"
        },
        {
            "barcode": "171119358",
            "dpc": "03041939901",
            "name": "ទុយ គង់"
        },
        {
            "barcode": "171119359",
            "dpc": "03041940001",
            "name": "ស៊ុយ អេង"
        },
        {
            "barcode": "171119360",
            "dpc": "03041940201",
            "name": "ជា បុប្ផា"
        },
        {
            "barcode": "171119361",
            "dpc": "03041940301",
            "name": "យ៉ាត ស្រីមុំ"
        },
        {
            "barcode": "171119362",
            "dpc": "03041940401",
            "name": "ឡាយ យាន"
        },
        {
            "barcode": "171119363",
            "dpc": "03041940501",
            "name": "ឯម សារ៉ុម"
        },
        {
            "barcode": "171119364",
            "dpc": "03041940601",
            "name": "គឹម ស្រីម៉ៅ"
        },
        {
            "barcode": "171119365",
            "dpc": "03041940701",
            "name": "ទា សុម៉ាលី"
        },
        {
            "barcode": "171119366",
            "dpc": "03041940801",
            "name": "ម៉ី ណន"
        },
        {
            "barcode": "171119367",
            "dpc": "03041940901",
            "name": "ផន សុវណ្ណ"
        },
        {
            "barcode": "171119368",
            "dpc": "03041941101",
            "name": "អ៊ុក ពន្លឺ"
        },
        {
            "barcode": "171119369",
            "dpc": "03041941201",
            "name": "គុយ ព្រឿង"
        },
        {
            "barcode": "171119370",
            "dpc": "03041941301",
            "name": "គាត ហង្ស"
        },
        {
            "barcode": "171119371",
            "dpc": "03041941401",
            "name": "យឹង សំអុន"
        },
        {
            "barcode": "171119372",
            "dpc": "03041941501",
            "name": "សេង គឹមសួ"
        },
        {
            "barcode": "171119373",
            "dpc": "03041941601",
            "name": "ម៉េង អាន"
        },
        {
            "barcode": "171119374",
            "dpc": "03041941701",
            "name": "សុង ស៊ានហ៊ូ"
        },
        {
            "barcode": "171119375",
            "dpc": "03041941801",
            "name": "មៀច បូរ៉ា"
        },
        {
            "barcode": "171119376",
            "dpc": "03041941901",
            "name": "ចៅ ម៉េងសេង"
        },
        {
            "barcode": "171119377",
            "dpc": "03041942001",
            "name": "សេង ស្រីពៅ"
        },
        {
            "barcode": "171119378",
            "dpc": "03041942101",
            "name": "យិន ធិរ៉ាក់"
        },
        {
            "barcode": "171119379",
            "dpc": "03041942201",
            "name": "ម៉ៅ សេង"
        },
        {
            "barcode": "171119380",
            "dpc": "03041939701",
            "name": "សួន ស្រីមុំ"
        },
        {
            "barcode": "171119381",
            "dpc": "03041945701",
            "name": "ផ្លុង ផល្លា"
        },
        {
            "barcode": "171119382",
            "dpc": "03041926801",
            "name": "ជៀម សេរី"
        },
        {
            "barcode": "171119383",
            "dpc": "03041926901",
            "name": "សន ជេស"
        },
        {
            "barcode": "171119384",
            "dpc": "03041927001",
            "name": "ហួត សំណាង"
        },
        {
            "barcode": "171119385",
            "dpc": "03041926701",
            "name": "អៀង ចាន់"
        },
        {
            "barcode": "171119386",
            "dpc": "03041926601",
            "name": "សាន អឿម"
        },
        {
            "barcode": "171119387",
            "dpc": "03041926401",
            "name": "ប៉ែន សន"
        },
        {
            "barcode": "171119388",
            "dpc": "03041926301",
            "name": "ជា វិន"
        },
        {
            "barcode": "171119389",
            "dpc": "03041926201",
            "name": "ខេង ឡាយ"
        },
        {
            "barcode": "171119390",
            "dpc": "03041926101",
            "name": "ជា ពុទ្ធី"
        },
        {
            "barcode": "171119391",
            "dpc": "03041926001",
            "name": "ងូវ   ទៀប"
        },
        {
            "barcode": "171119392",
            "dpc": "03041925901",
            "name": "ជី វុទ្ធី"
        },
        {
            "barcode": "171119393",
            "dpc": "03041925801",
            "name": "ប៉ោ ស៊ឹមឡី"
        },
        {
            "barcode": "171119394",
            "dpc": "03041925701",
            "name": "គឹម ចរិយា"
        },
        {
            "barcode": "171119395",
            "dpc": "03041925601",
            "name": "រ៉ន វិរិន"
        },
        {
            "barcode": "171119396",
            "dpc": "03041925501",
            "name": "មុំ សាមឌី"
        },
        {
            "barcode": "171119397",
            "dpc": "03041925401",
            "name": "សៀង ទ្រី"
        },
        {
            "barcode": "171119398",
            "dpc": "03041925301",
            "name": "យ៉ក់   ខ្វៃ"
        },
        {
            "barcode": "171119399",
            "dpc": "03041925201",
            "name": "តាំង នី"
        },
        {
            "barcode": "171119400",
            "dpc": "03041925101",
            "name": "ឡេង វិញ"
        },
        {
            "barcode": "171119401",
            "dpc": "03041925001",
            "name": "នៅ រ៉ុង"
        },
        {
            "barcode": "171119402",
            "dpc": "03041924901",
            "name": "ឈឹម សារ៉េត"
        },
        {
            "barcode": "171119403",
            "dpc": "03041934901",
            "name": "ជា ម៉េងយូ"
        },
        {
            "barcode": "171119404",
            "dpc": "03041934801",
            "name": "បេង ហួន"
        },
        {
            "barcode": "171119405",
            "dpc": "03041934701",
            "name": "ម៉ង់ វុទ្ធី"
        },
        {
            "barcode": "171119406",
            "dpc": "03041934601",
            "name": "ម៉ង់ វិរ៉ា"
        },
        {
            "barcode": "171119407",
            "dpc": "03041934501",
            "name": "ញឹក ប៊ុនឈៀត"
        },
        {
            "barcode": "171119408",
            "dpc": "03041934301",
            "name": "ហូង  ខាត់យិង"
        },
        {
            "barcode": "171119409",
            "dpc": "03041934201",
            "name": "ប៊ុត សំអែល"
        },
        {
            "barcode": "171119410",
            "dpc": "03041934101",
            "name": "ធិញ ឆាន់"
        },
        {
            "barcode": "171119411",
            "dpc": "03041934001",
            "name": "លឿង ម៉ឹង"
        },
        {
            "barcode": "171119412",
            "dpc": "03041933901",
            "name": "ផ្លុង សាយ"
        },
        {
            "barcode": "171119413",
            "dpc": "03041933801",
            "name": "មុំ សោភ័ណ្ឌ"
        },
        {
            "barcode": "171119414",
            "dpc": "03041933701",
            "name": "ហ៊ាង ហ៊ត"
        },
        {
            "barcode": "171119415",
            "dpc": "03041933601",
            "name": "កើត មនោរក្ស"
        },
        {
            "barcode": "171119416",
            "dpc": "03041933501",
            "name": "មណ្ឌលសុខភាពទួលតាឯក"
        },
        {
            "barcode": "171119417",
            "dpc": "03041933401",
            "name": "ញ៉ែម សារ៉េម"
        },
        {
            "barcode": "171119418",
            "dpc": "03041933301",
            "name": "តាន់ សុភាព"
        },
        {
            "barcode": "171119419",
            "dpc": "03041933101",
            "name": "ខាត់ ភឿន"
        },
        {
            "barcode": "171119420",
            "dpc": "03041933001",
            "name": "ពៅ ប៊ុនហាក់"
        },
        {
            "barcode": "171119421",
            "dpc": "03041932901",
            "name": "ជូ ស៊ីម"
        },
        {
            "barcode": "171119422",
            "dpc": "03041932801",
            "name": "អ៊ិត អ៊ុត"
        },
        {
            "barcode": "171119423",
            "dpc": "03041932701",
            "name": "ភុំ ហុង"
        },
        {
            "barcode": "171119424",
            "dpc": "03041932601",
            "name": "ភួង ម៉ាប់"
        },
        {
            "barcode": "171119425",
            "dpc": "03041932501",
            "name": "អ៊ិត គឹមស្រ៊ុន"
        },
        {
            "barcode": "171119426",
            "dpc": "03041932401",
            "name": "ស្រី ស៊ុន"
        },
        {
            "barcode": "171119427",
            "dpc": "03041932201",
            "name": "អ៊ិន វណ្ណៈ"
        },
        {
            "barcode": "171119428",
            "dpc": "03041932301",
            "name": "ណាវ សុខា"
        },
        {
            "barcode": "171119429",
            "dpc": "03041932101",
            "name": "សាម ភិត"
        },
        {
            "barcode": "171119430",
            "dpc": "03041932001",
            "name": "សេង អូន"
        },
        {
            "barcode": "171119431",
            "dpc": "03041931901",
            "name": "ឡេង វិសាល២"
        },
        {
            "barcode": "171119432",
            "dpc": "03041931801",
            "name": "ប៊ុន ម៉ា"
        },
        {
            "barcode": "171119433",
            "dpc": "03041931701",
            "name": "ហ៊ុយ គឹមថេត"
        },
        {
            "barcode": "171119434",
            "dpc": "03041931601",
            "name": "គឹម ជា"
        },
        {
            "barcode": "171119435",
            "dpc": "03041931501",
            "name": "សាយ ណន"
        },
        {
            "barcode": "171119436",
            "dpc": "03041931401",
            "name": "សុ ខា"
        },
        {
            "barcode": "171119437",
            "dpc": "03041931301",
            "name": "សរ សុរិទ្ធ"
        },
        {
            "barcode": "171119438",
            "dpc": "03041931201",
            "name": "សាយ ញ៉ុន"
        },
        {
            "barcode": "171119439",
            "dpc": "03041931101",
            "name": "កេញ វ៉ឿន"
        },
        {
            "barcode": "171119440",
            "dpc": "03041931001",
            "name": "សាលាបឋមសិក្សាអូរ ២"
        },
        {
            "barcode": "171119441",
            "dpc": "03041914501",
            "name": "យឺន សំពៅ"
        },
        {
            "barcode": "171119442",
            "dpc": "03041930801",
            "name": "ភឿន ពៅ"
        },
        {
            "barcode": "171119443",
            "dpc": "03041930901",
            "name": "គាំ ឌៀប"
        },
        {
            "barcode": "171119444",
            "dpc": "03041930701",
            "name": "គង់ ស៊ីឡា"
        },
        {
            "barcode": "171119445",
            "dpc": "03041930001",
            "name": "ឆេង ពៅ"
        },
        {
            "barcode": "171119446",
            "dpc": "03041930401",
            "name": "ប៉ឹង  រ៉េត"
        },
        {
            "barcode": "171119447",
            "dpc": "03041930301",
            "name": "ជា ម៉ាលី"
        },
        {
            "barcode": "171119448",
            "dpc": "03041930101",
            "name": "គី ចន្ធូ"
        },
        {
            "barcode": "171119449",
            "dpc": "03041929901",
            "name": "ប៉ុល សារឿន"
        },
        {
            "barcode": "171119450",
            "dpc": "03041929601",
            "name": "ប៉ុយ ធៀន ១"
        },
        {
            "barcode": "171119451",
            "dpc": "03041929501",
            "name": "ជុំ ជីវ័ន្ត"
        },
        {
            "barcode": "171119452",
            "dpc": "03041929301",
            "name": "សំអាង សត្យា"
        },
        {
            "barcode": "171119453",
            "dpc": "03041929201",
            "name": "ម៉ុក ឌីណា"
        },
        {
            "barcode": "171119454",
            "dpc": "03041929101",
            "name": "អាត ម៉ៅ"
        },
        {
            "barcode": "171119455",
            "dpc": "03041929001",
            "name": "ឡេង វិសុទ្ធ"
        },
        {
            "barcode": "171119456",
            "dpc": "03041928901",
            "name": "អ៊ុន ប៊ុនថា"
        },
        {
            "barcode": "171119457",
            "dpc": "03041928801",
            "name": "ហឿន សារ៉ាត់"
        },
        {
            "barcode": "171119458",
            "dpc": "03041928701",
            "name": "អ៊ុយ បូរី"
        },
        {
            "barcode": "171119459",
            "dpc": "03041928601",
            "name": "សាញ ណយ"
        },
        {
            "barcode": "171119460",
            "dpc": "03041928501",
            "name": "ហុយ  គឹមថង"
        },
        {
            "barcode": "171119461",
            "dpc": "03041928401",
            "name": "ផេង ដានី"
        },
        {
            "barcode": "171119462",
            "dpc": "03041928201",
            "name": "នា  គ្រី"
        },
        {
            "barcode": "171119463",
            "dpc": "03041928101",
            "name": "កែវ ឈុន"
        },
        {
            "barcode": "171119464",
            "dpc": "03041928001",
            "name": "ប៉ែន សាមុត"
        },
        {
            "barcode": "171119465",
            "dpc": "03041927901",
            "name": "ជា គឹម"
        },
        {
            "barcode": "171119466",
            "dpc": "03041927801",
            "name": "ជា សំបូរ"
        },
        {
            "barcode": "171119467",
            "dpc": "03041927701",
            "name": "កែ ស៊ីណូ"
        },
        {
            "barcode": "171119468",
            "dpc": "03041927601",
            "name": "ដៀប ប៊ន"
        },
        {
            "barcode": "171119469",
            "dpc": "03041927501",
            "name": "ចាំង យូរិន"
        },
        {
            "barcode": "171119470",
            "dpc": "03041927301",
            "name": "ភឿន ភិន"
        },
        {
            "barcode": "171119471",
            "dpc": "03041927201",
            "name": "តាន់ ហ៊ាង"
        },
        {
            "barcode": "171119472",
            "dpc": "03041927101",
            "name": "ហេង វ៉ាន់នី"
        },
        {
            "barcode": "171119473",
            "dpc": "03041930201",
            "name": "ឡាំ អ៊ាប"
        },
        {
            "barcode": "171119474",
            "dpc": "03041945501",
            "name": "ភ័ណ្ឌ កែវវិចិត្រ"
        },
        {
            "barcode": "171119475",
            "dpc": "03041945001",
            "name": "ស៊ិន សេន"
        },
        {
            "barcode": "171119476",
            "dpc": "03041945601",
            "name": "ស៊ ចន្ធូ"
        },
        {
            "barcode": "171119477",
            "dpc": "03041945201",
            "name": "គង់ សំអាន"
        },
        {
            "barcode": "171119478",
            "dpc": "03041945101",
            "name": "ឌី ម៉ា"
        },
        {
            "barcode": "171119479",
            "dpc": "03041945801",
            "name": "ចាន់ សេរី"
        },
        {
            "barcode": "171119480",
            "dpc": "03041945901",
            "name": "នូច  យ៉ា"
        },
        {
            "barcode": "171119481",
            "dpc": "03041946001",
            "name": "ង៉ែត សុផល"
        },
        {
            "barcode": "171119482",
            "dpc": "03041946101",
            "name": "មុំ យាន់"
        },
        {
            "barcode": "171119483",
            "dpc": "03041946301",
            "name": "ប៉ាត់ ថន"
        },
        {
            "barcode": "171119484",
            "dpc": "03041946401",
            "name": "ចាប សៀន"
        },
        {
            "barcode": "171119485",
            "dpc": "03041946501",
            "name": "ផ្លេក ពិសិទ្ធ"
        },
        {
            "barcode": "171119486",
            "dpc": "03041946601",
            "name": "ប៉ាត់ ថុល"
        },
        {
            "barcode": "171119487",
            "dpc": "03041946701",
            "name": "ផូ ផាន់ណារិទ្ធ"
        },
        {
            "barcode": "171119488",
            "dpc": "03041946801",
            "name": "ហែម ស្រស់"
        },
        {
            "barcode": "171119489",
            "dpc": "03041946901",
            "name": "ច្រាច់ មុំ"
        },
        {
            "barcode": "171119490",
            "dpc": "03041947001",
            "name": "ប៉ក់  ម៉េង"
        },
        {
            "barcode": "171119491",
            "dpc": "03041947101",
            "name": "គឹម ស៊ីវ"
        },
        {
            "barcode": "171119492",
            "dpc": "03041947201",
            "name": "គង់ សុខលាង"
        },
        {
            "barcode": "171119493",
            "dpc": "03041947301",
            "name": "ពិន  សំបូ"
        },
        {
            "barcode": "171119494",
            "dpc": "03041947401",
            "name": "សេង សុវ​ណ្ណ"
        },
        {
            "barcode": "171119495",
            "dpc": "03041947501",
            "name": "ប៉ង សុខា"
        },
        {
            "barcode": "171119496",
            "dpc": "03041947601",
            "name": "ឈួន ទូច"
        },
        {
            "barcode": "171119497",
            "dpc": "03041947701",
            "name": "គឹម សេត"
        },
        {
            "barcode": "171119498",
            "dpc": "03041947801",
            "name": "តាត ឃោសរ៉ាត់"
        },
        {
            "barcode": "171119499",
            "dpc": "03041947901",
            "name": "អៀង សុខុម"
        },
        {
            "barcode": "171119500",
            "dpc": "03041900701",
            "name": "ប្រាក់  ឌឿន"
        },
        {
            "barcode": "171119501",
            "dpc": "03041902301",
            "name": "ប៊ុន  ឡេង"
        },
        {
            "barcode": "171119502",
            "dpc": "03041902601",
            "name": "ជួន  រឿត"
        },
        {
            "barcode": "171119503",
            "dpc": "03041903001",
            "name": "គង់  សារឿន"
        },
        {
            "barcode": "171119504",
            "dpc": "03041929701",
            "name": "អ៊ុង  ង៉ាន់"
        },
        {
            "barcode": "171119505",
            "dpc": "03041929801",
            "name": "ប៉ុយ  ធៀន  ២"
        },
        {
            "barcode": "171119506",
            "dpc": "03041930501",
            "name": "ឈឹម  ឌឿម"
        },
        {
            "barcode": "171119507",
            "dpc": "03041942301",
            "name": "ឆែម  រដ្ឋា"
        },
        {
            "barcode": "171119508",
            "dpc": "03041942401",
            "name": "វ៉ាន់   វិចិត្រ ១"
        },
        {
            "barcode": "171119509",
            "dpc": "03041942501",
            "name": "នុយ  ប៊ុនជួយ"
        },
        {
            "barcode": "171119510",
            "dpc": "03041942601",
            "name": "ឈុក   ចាន់សុផា"
        },
        {
            "barcode": "171119511",
            "dpc": "03041942701",
            "name": "ជឿម  វិច្ចិកា"
        },
        {
            "barcode": "171119512",
            "dpc": "03041942801",
            "name": "ជន  អឿន"
        },
        {
            "barcode": "171119513",
            "dpc": "03041942901",
            "name": "តែ  ពៅចិន្តា"
        },
        {
            "barcode": "171119514",
            "dpc": "03041943001",
            "name": "តូច  ពិសិទ្ធ"
        },
        {
            "barcode": "171119515",
            "dpc": "03041943101",
            "name": "អ៊ុច  សារឹម"
        },
        {
            "barcode": "171119516",
            "dpc": "03041943201",
            "name": "ជូ  ជិវ័ន"
        },
        {
            "barcode": "171119517",
            "dpc": "03041943301",
            "name": "ភុំ  ជិនណារ៉ា"
        },
        {
            "barcode": "171119518",
            "dpc": "03041943401",
            "name": "កង  ហាវ"
        },
        {
            "barcode": "171119519",
            "dpc": "03041943501",
            "name": "ស្រស់  ចំរើន"
        },
        {
            "barcode": "171119520",
            "dpc": "03041943601",
            "name": "ថុក  ប៊ុនធី"
        },
        {
            "barcode": "171119521",
            "dpc": "03041943701",
            "name": "គឹម  ស្រីពៅ"
        },
        {
            "barcode": "171119522",
            "dpc": "03041943801",
            "name": "ប៉េង  អាន"
        },
        {
            "barcode": "171119523",
            "dpc": "03041944001",
            "name": "ហុង  នាង"
        },
        {
            "barcode": "171119524",
            "dpc": "03041944101",
            "name": "សេង  ចាង"
        },
        {
            "barcode": "171119525",
            "dpc": "03041944201",
            "name": "សាំង  ឈិនហ៊ួ"
        },
        {
            "barcode": "171119526",
            "dpc": "03041944301",
            "name": "សឺន  សឿប"
        },
        {
            "barcode": "171119527",
            "dpc": "03041944401",
            "name": "ហម  សៀកឡាយ"
        },
        {
            "barcode": "171119528",
            "dpc": "03041944501",
            "name": "យ៉ាន់  ពេជ្រ"
        },
        {
            "barcode": "171119529",
            "dpc": "03041944601",
            "name": "ស៊ូ  ស៊ី"
        },
        {
            "barcode": "171119530",
            "dpc": "03041944701",
            "name": "រុន  ខុងណែត"
        },
        {
            "barcode": "171119531",
            "dpc": "03041944801",
            "name": "យ៉ាំ  ហុង"
        },
        {
            "barcode": "171119532",
            "dpc": "03041944901",
            "name": "ស៊ូន  នី"
        },
        {
            "barcode": "171119533",
            "dpc": "03041945401",
            "name": "ថ្លែង  ហូ"
        },
        {
            "barcode": "171119534",
            "dpc": "03041946201",
            "name": "ឡុង  សំអឿន"
        },
        {
            "barcode": "171119535",
            "dpc": "03041901801",
            "name": "ថែត សុធា"
        },
        {
            "barcode": "171119536",
            "dpc": "03041901701",
            "name": "ឈឹម ចន្ថា"
        },
        {
            "barcode": "171119537",
            "dpc": "03041901601",
            "name": "កើត​ យុថា"
        },
        {
            "barcode": "171119538",
            "dpc": "03041901501",
            "name": "ទុយ ចាន់រតនះ"
        },
        {
            "barcode": "171119539",
            "dpc": "03041901401",
            "name": "យួម រ៉ាមី"
        },
        {
            "barcode": "171119540",
            "dpc": "03041900501",
            "name": "ស្វាយ ចាន់តារ៉ា"
        },
        {
            "barcode": "171119541",
            "dpc": "03041900401",
            "name": "ស្វាយ ចាន់ថា"
        },
        {
            "barcode": "171119542",
            "dpc": "03041900801",
            "name": "សាត សារ៉េត"
        },
        {
            "barcode": "171119543",
            "dpc": "03041901201",
            "name": "ស្វាយ ផល្លី"
        },
        {
            "barcode": "171119544",
            "dpc": "03041901301",
            "name": "សឿម ស្រី"
        },
        {
            "barcode": "171119545",
            "dpc": "03041900301",
            "name": "សាលាឃុំស្វាយប៉ោ"
        },
        {
            "barcode": "171119546",
            "dpc": "03041901901",
            "name": "យស់ សុគន្ធារិន្ទ"
        },
        {
            "barcode": "171119547",
            "dpc": "03041902001",
            "name": "ណុប  អេង"
        },
        {
            "barcode": "171119548",
            "dpc": "03041929401",
            "name": "ទូច  ផល្លី"
        },
        {
            "barcode": "171119549",
            "dpc": "03041902101",
            "name": "លឿង វិបុល"
        },
        {
            "barcode": "171119550",
            "dpc": "03041948001",
            "name": "សេង សាំងហុន"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
