let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171122174",
            "dpc": "03042000101",
            "name": "លឿង រំចេក"
        },
        {
            "barcode": "171122175",
            "dpc": "03042000301",
            "name": "ជួប សុខុម"
        },
        {
            "barcode": "171122176",
            "dpc": "03042000501",
            "name": "លី ភក្តី"
        },
        {
            "barcode": "171122177",
            "dpc": "03042000401",
            "name": "អាហារដ្ឋានស្តាហ្វូត"
        },
        {
            "barcode": "171122178",
            "dpc": "03042000601",
            "name": "ផាត់ ណារុន"
        },
        {
            "barcode": "171122179",
            "dpc": "03042000701",
            "name": "ហូរ ភូរិន្ទ"
        },
        {
            "barcode": "171122180",
            "dpc": "03042000801",
            "name": "ឡុង សូផន"
        },
        {
            "barcode": "171122181",
            "dpc": "03042001001",
            "name": "ឈឹម ឌឹម"
        },
        {
            "barcode": "171122182",
            "dpc": "03042001101",
            "name": "ប៉ែន សារិន្ទ"
        },
        {
            "barcode": "171122183",
            "dpc": "03042001201",
            "name": "ជិម ជំនិត"
        },
        {
            "barcode": "171122184",
            "dpc": "03042001301",
            "name": "ញ៉ែត ចយ"
        },
        {
            "barcode": "171122185",
            "dpc": "03042001401",
            "name": "ឈុគ ចន្ថា"
        },
        {
            "barcode": "171122186",
            "dpc": "03042001501",
            "name": "សេង លក្ខិណា"
        },
        {
            "barcode": "171122187",
            "dpc": "03042001601",
            "name": "សូរ ទូន"
        },
        {
            "barcode": "171122188",
            "dpc": "03042001701",
            "name": "អោគ គុណ"
        },
        {
            "barcode": "171122189",
            "dpc": "03042001801",
            "name": "លី សំបឿន"
        },
        {
            "barcode": "171122190",
            "dpc": "03042001901",
            "name": "យូ សារឿន"
        },
        {
            "barcode": "171122191",
            "dpc": "03042002001",
            "name": "សៀង ណារិទ្ធ"
        },
        {
            "barcode": "171122192",
            "dpc": "03042002101",
            "name": "ឈួង វណ្ណា"
        },
        {
            "barcode": "171122193",
            "dpc": "03042002401",
            "name": "ហុង គឹមលាង"
        },
        {
            "barcode": "171122194",
            "dpc": "03042002501",
            "name": "គង់ ពេជ្រ"
        },
        {
            "barcode": "171122195",
            "dpc": "03042002601",
            "name": "ឡម ស៊ីនឿន"
        },
        {
            "barcode": "171122196",
            "dpc": "03042002701",
            "name": "សុខ សារ៉ុម"
        },
        {
            "barcode": "171122197",
            "dpc": "03042002801",
            "name": "ជា ចាន់ត្រា"
        },
        {
            "barcode": "171122198",
            "dpc": "03042002901",
            "name": "សុខ ផល្លី"
        },
        {
            "barcode": "171122199",
            "dpc": "03042003001",
            "name": "រិទ្ធ គឹមឡាង"
        },
        {
            "barcode": "171122200",
            "dpc": "03042023901",
            "name": "ឆេង សុភាព"
        },
        {
            "barcode": "171122201",
            "dpc": "03042024001",
            "name": "ឆេង សេងហាក់"
        },
        {
            "barcode": "171122202",
            "dpc": "03042024201",
            "name": "ហែម ក្យូ"
        },
        {
            "barcode": "171122203",
            "dpc": "03042024301",
            "name": "សាន់ ខា"
        },
        {
            "barcode": "171122204",
            "dpc": "03042024501",
            "name": "ណៃ ព្រីឆា"
        },
        {
            "barcode": "171122205",
            "dpc": "03042024601",
            "name": "នី សាវ៉ាត់"
        },
        {
            "barcode": "171122206",
            "dpc": "03042024701",
            "name": "អៀប រឿប"
        },
        {
            "barcode": "171122207",
            "dpc": "03042024801",
            "name": "សួន សាវ៉េត"
        },
        {
            "barcode": "171122208",
            "dpc": "03042024901",
            "name": "ជៀម ទុំ"
        },
        {
            "barcode": "171122209",
            "dpc": "03042025101",
            "name": "សាក់ លីន"
        },
        {
            "barcode": "171122210",
            "dpc": "03042025201",
            "name": "ទន់ យឿន"
        },
        {
            "barcode": "171122211",
            "dpc": "03042025301",
            "name": "ឆាយ ឆេង"
        },
        {
            "barcode": "171122212",
            "dpc": "03042025401",
            "name": "ស៊ូ ឃោ"
        },
        {
            "barcode": "171122213",
            "dpc": "03042025501",
            "name": "អ៊ឹម ស្រីមុំ"
        },
        {
            "barcode": "171122214",
            "dpc": "03042025601",
            "name": "អ៊ុំ អែម"
        },
        {
            "barcode": "171122215",
            "dpc": "03042025701",
            "name": "យិន  ថារី"
        },
        {
            "barcode": "171122216",
            "dpc": "03042025801",
            "name": "យង់ សាំងគីនី"
        },
        {
            "barcode": "171122217",
            "dpc": "03042025901",
            "name": "គង់ សុភ័ក្ត"
        },
        {
            "barcode": "171122218",
            "dpc": "03042026001",
            "name": "ឡត សារ៉េត"
        },
        {
            "barcode": "171122219",
            "dpc": "03042026101",
            "name": "ម៉ី សៅ"
        },
        {
            "barcode": "171122220",
            "dpc": "03042026201",
            "name": "សុខ ផុន"
        },
        {
            "barcode": "171122221",
            "dpc": "03042026301",
            "name": "ផេង រ៉ា"
        },
        {
            "barcode": "171122222",
            "dpc": "03042026401",
            "name": "អ៊ុំ ប៉េងសុង"
        },
        {
            "barcode": "171122223",
            "dpc": "03042026501",
            "name": "ប៉ាល់ ហូរ"
        },
        {
            "barcode": "171122224",
            "dpc": "03042026601",
            "name": "សាំង ណារិន"
        },
        {
            "barcode": "171122225",
            "dpc": "03042026701",
            "name": "ឆេង ឈួន"
        },
        {
            "barcode": "171122226",
            "dpc": "03042026801",
            "name": "យ៉ែម សិរីវត្ត"
        },
        {
            "barcode": "171122227",
            "dpc": "03042026901",
            "name": "ពេជ្រ វណ្ណី"
        },
        {
            "barcode": "171122228",
            "dpc": "03042027001",
            "name": "ជា សុខា"
        },
        {
            "barcode": "171122229",
            "dpc": "03042027101",
            "name": "វង្ស ខាន់"
        },
        {
            "barcode": "171122230",
            "dpc": "03042027201",
            "name": "ឡាយ ហ៊ុំ"
        },
        {
            "barcode": "171122231",
            "dpc": "03042027301",
            "name": "ហម ហ៊ន"
        },
        {
            "barcode": "171122232",
            "dpc": "03042027401",
            "name": "ជូ ចាន់រិទ្ធ"
        },
        {
            "barcode": "171122233",
            "dpc": "03042027501",
            "name": "ស៊ុន ណារ៉េត"
        },
        {
            "barcode": "171122234",
            "dpc": "03042027601",
            "name": "តាំង ជាទ្រី"
        },
        {
            "barcode": "171122235",
            "dpc": "03042027701",
            "name": "ពិន សុវណ្ណ"
        },
        {
            "barcode": "171122236",
            "dpc": "03042027801",
            "name": "អ៊ិន សែម"
        },
        {
            "barcode": "171122237",
            "dpc": "03042027901",
            "name": "សោម សុផល"
        },
        {
            "barcode": "171122238",
            "dpc": "03042028001",
            "name": "មៀន បូ"
        },
        {
            "barcode": "171122239",
            "dpc": "03042028101",
            "name": "គឹម ពន្លក"
        },
        {
            "barcode": "171122240",
            "dpc": "03042028201",
            "name": "សួស សុភ័ក្រ"
        },
        {
            "barcode": "171122241",
            "dpc": "03042028301",
            "name": "ក្រូច ថែន"
        },
        {
            "barcode": "171122242",
            "dpc": "03042028501",
            "name": "ជា លី"
        },
        {
            "barcode": "171122243",
            "dpc": "03042028601",
            "name": "ស៊ឹម ឆេង"
        },
        {
            "barcode": "171122244",
            "dpc": "03042028701",
            "name": "ឆេង ហឿន"
        },
        {
            "barcode": "171122245",
            "dpc": "03042028801",
            "name": "ឈួន គឹមហេង"
        },
        {
            "barcode": "171122246",
            "dpc": "03042004201",
            "name": "ឌុំ ធារ៉ាក់"
        },
        {
            "barcode": "171122247",
            "dpc": "03042004301",
            "name": "ប៊ុត ឆាយ"
        },
        {
            "barcode": "171122248",
            "dpc": "03042004401",
            "name": "ខេង សេដ្ឋា"
        },
        {
            "barcode": "171122249",
            "dpc": "03042008701",
            "name": "ឆាន់ ឌី ១"
        },
        {
            "barcode": "171122250",
            "dpc": "03042008801",
            "name": "លឹម ដារ៉ុង"
        },
        {
            "barcode": "171122251",
            "dpc": "03042008901",
            "name": "ស៊ុន ថេង"
        },
        {
            "barcode": "171122252",
            "dpc": "03042009001",
            "name": "កេង ស្សី"
        },
        {
            "barcode": "171122253",
            "dpc": "03042009501",
            "name": "លាង សារ៉េន"
        },
        {
            "barcode": "171122254",
            "dpc": "03042009801",
            "name": "ជុង ឈី"
        },
        {
            "barcode": "171122255",
            "dpc": "03042010001",
            "name": "សោម កាឌុល"
        },
        {
            "barcode": "171122256",
            "dpc": "03042010201",
            "name": "កែវ ស៊ុន (មុខ)"
        },
        {
            "barcode": "171122257",
            "dpc": "03042010301",
            "name": "កែវ ស៊ុន (លើ)"
        },
        {
            "barcode": "171122258",
            "dpc": "03042010401",
            "name": "ហុក កុសល់"
        },
        {
            "barcode": "171122259",
            "dpc": "03042010501",
            "name": "សេង ហួត"
        },
        {
            "barcode": "171122260",
            "dpc": "03042010601",
            "name": "សៀង សង់ឯម"
        },
        {
            "barcode": "171122261",
            "dpc": "03042010701",
            "name": "ស៊ិន ស៊ីណាន"
        },
        {
            "barcode": "171122262",
            "dpc": "03042010801",
            "name": "គឹម វែង"
        },
        {
            "barcode": "171122263",
            "dpc": "03042010901",
            "name": "អ៊ុក ប្រុក"
        },
        {
            "barcode": "171122264",
            "dpc": "03042011201",
            "name": "សៀង ឯមវិសាលរ៉ាស៊ី"
        },
        {
            "barcode": "171122265",
            "dpc": "03042006301",
            "name": "ឆាន់ ឌី៧"
        },
        {
            "barcode": "171122266",
            "dpc": "03042006401",
            "name": "អ៊ឹង នី"
        },
        {
            "barcode": "171122267",
            "dpc": "03042006501",
            "name": "ឡែក  តង"
        },
        {
            "barcode": "171122268",
            "dpc": "03042006601",
            "name": "គង់ ឌឺ"
        },
        {
            "barcode": "171122269",
            "dpc": "03042006801",
            "name": "ស្រេង ខុន"
        },
        {
            "barcode": "171122270",
            "dpc": "03042006901",
            "name": "លន់ ស្រូយ"
        },
        {
            "barcode": "171122271",
            "dpc": "03042007001",
            "name": "ស៊ុង  ឌីណា"
        },
        {
            "barcode": "171122272",
            "dpc": "03042007101",
            "name": "តុប សៀរ"
        },
        {
            "barcode": "171122273",
            "dpc": "03042007201",
            "name": "ម៉ែន សួរ"
        },
        {
            "barcode": "171122274",
            "dpc": "03042007301",
            "name": "ខាន់ សាវុធ"
        },
        {
            "barcode": "171122275",
            "dpc": "03042007601",
            "name": "ម៉ុន ម៉ុត"
        },
        {
            "barcode": "171122276",
            "dpc": "03042007701",
            "name": "ឆាន់ ឌី ៥"
        },
        {
            "barcode": "171122277",
            "dpc": "03042007801",
            "name": "អ៊ូច ឃ៊ីម"
        },
        {
            "barcode": "171122278",
            "dpc": "03042008101",
            "name": "ឆៃ  ឆិល"
        },
        {
            "barcode": "171122279",
            "dpc": "03042008001",
            "name": "អ៊ូ ចិន"
        },
        {
            "barcode": "171122280",
            "dpc": "03042007901",
            "name": "ឈឿម សុខា"
        },
        {
            "barcode": "171122281",
            "dpc": "03042008301",
            "name": "ជឹម  ធាវី"
        },
        {
            "barcode": "171122282",
            "dpc": "03042008201",
            "name": "ឆាន់ ឌី ២"
        },
        {
            "barcode": "171122283",
            "dpc": "03042008601",
            "name": "ស៊ុម តក់"
        },
        {
            "barcode": "171122284",
            "dpc": "03042008501",
            "name": "លាង សារ៉េន ២"
        },
        {
            "barcode": "171122285",
            "dpc": "03042008401",
            "name": "បេន សាវុធ"
        },
        {
            "barcode": "171122286",
            "dpc": "03042007401",
            "name": "មៀច បាន"
        },
        {
            "barcode": "171122287",
            "dpc": "03042006201",
            "name": "ម៉ែន ឃុន"
        },
        {
            "barcode": "171122288",
            "dpc": "03042006101",
            "name": "ប្រាក់ យឺន"
        },
        {
            "barcode": "171122289",
            "dpc": "03042003101",
            "name": "ដាញ់ ស៊ឹម"
        },
        {
            "barcode": "171122290",
            "dpc": "03042003301",
            "name": "ឆាន់ ជួយ"
        },
        {
            "barcode": "171122291",
            "dpc": "03042003401",
            "name": "ភូ គឹមហ៊ុន"
        },
        {
            "barcode": "171122292",
            "dpc": "03042003501",
            "name": "ទៀង សារ៉ន"
        },
        {
            "barcode": "171122293",
            "dpc": "03042003601",
            "name": "សុក កែន"
        },
        {
            "barcode": "171122294",
            "dpc": "03042003701",
            "name": "ប៊ុន ម៉េង"
        },
        {
            "barcode": "171122295",
            "dpc": "03042003801",
            "name": "អ៊ិន សាម៉ុន"
        },
        {
            "barcode": "171122296",
            "dpc": "03042003901",
            "name": "គុជ នាង"
        },
        {
            "barcode": "171122297",
            "dpc": "03042004001",
            "name": "ជឹម ភើយ"
        },
        {
            "barcode": "171122298",
            "dpc": "03042004101",
            "name": "ជីវ ដឿន"
        },
        {
            "barcode": "171122299",
            "dpc": "03042006001",
            "name": "ដែង  មករា"
        },
        {
            "barcode": "171122300",
            "dpc": "03042005901",
            "name": "អ៊ុយ ហោ"
        },
        {
            "barcode": "171122301",
            "dpc": "03042005801",
            "name": "សរ សាវន"
        },
        {
            "barcode": "171122302",
            "dpc": "03042005701",
            "name": "អ៊ាប ម៉េងឡេង"
        },
        {
            "barcode": "171122303",
            "dpc": "03042005501",
            "name": "ថេត លឿត"
        },
        {
            "barcode": "171122304",
            "dpc": "03042005401",
            "name": "កែវ សាវី"
        },
        {
            "barcode": "171122305",
            "dpc": "03042005201",
            "name": "ហួរ  ឆុង"
        },
        {
            "barcode": "171122306",
            "dpc": "03042005101",
            "name": "ហាក់ ឆៃលាង"
        },
        {
            "barcode": "171122307",
            "dpc": "03042005001",
            "name": "តែ លី"
        },
        {
            "barcode": "171122308",
            "dpc": "03042004901",
            "name": "ប៊ុន ថុង"
        },
        {
            "barcode": "171122309",
            "dpc": "03042004801",
            "name": "ឆុង ឆៃលី"
        },
        {
            "barcode": "171122310",
            "dpc": "03042004701",
            "name": "ង៉ូវ ហួយ"
        },
        {
            "barcode": "171122311",
            "dpc": "03042004601",
            "name": "ឆោម រី"
        },
        {
            "barcode": "171122312",
            "dpc": "03042004501",
            "name": "ផន វណ្ណថា"
        },
        {
            "barcode": "171122313",
            "dpc": "03042011701",
            "name": "វឹង ហាំង ២"
        },
        {
            "barcode": "171122314",
            "dpc": "03042011501",
            "name": "ស៊្រុន  គីមហុង"
        },
        {
            "barcode": "171122315",
            "dpc": "03042011401",
            "name": "ឈឹម ណារ៉ុង"
        },
        {
            "barcode": "171122316",
            "dpc": "03042012501",
            "name": "ប៊ូ គង់"
        },
        {
            "barcode": "171122317",
            "dpc": "03042012301",
            "name": "ប៉ែន ណាច"
        },
        {
            "barcode": "171122318",
            "dpc": "03042012201",
            "name": "ស៊ាង ហួត"
        },
        {
            "barcode": "171122319",
            "dpc": "03042012101",
            "name": "អ៊ុក ស៊ុន"
        },
        {
            "barcode": "171122320",
            "dpc": "03042012001",
            "name": "គឹម ធីសោភ័ណ្ឌ"
        },
        {
            "barcode": "171122321",
            "dpc": "03042011901",
            "name": "ជឹម ដារ៉ារដ្ឋ"
        },
        {
            "barcode": "171122322",
            "dpc": "03042011801",
            "name": "សឹង ថន"
        },
        {
            "barcode": "171122323",
            "dpc": "03042012801",
            "name": "ឡេង សេងណា"
        },
        {
            "barcode": "171122324",
            "dpc": "03042012701",
            "name": "សេរី ចរិយា"
        },
        {
            "barcode": "171122325",
            "dpc": "03042012901",
            "name": "លី ស្រីពៅ"
        },
        {
            "barcode": "171122326",
            "dpc": "03042013001",
            "name": "សាត តារា"
        },
        {
            "barcode": "171122327",
            "dpc": "03042013101",
            "name": "ប៉ិច សុខចាន់"
        },
        {
            "barcode": "171122328",
            "dpc": "03042013301",
            "name": "រស់ វិសិទ្ធ"
        },
        {
            "barcode": "171122329",
            "dpc": "03042013401",
            "name": "ប្រាក់ សំបូរ"
        },
        {
            "barcode": "171122330",
            "dpc": "03042013501",
            "name": "យិន ស៊ីណា"
        },
        {
            "barcode": "171122331",
            "dpc": "03042013601",
            "name": "ភេទ សុផុន"
        },
        {
            "barcode": "171122332",
            "dpc": "03042013701",
            "name": "សាយ ផាត"
        },
        {
            "barcode": "171122333",
            "dpc": "03042013801",
            "name": "តុង គឹមជាង"
        },
        {
            "barcode": "171122334",
            "dpc": "03042013901",
            "name": "នង សារុន"
        },
        {
            "barcode": "171122335",
            "dpc": "03042014001",
            "name": "ជឹម សុខា"
        },
        {
            "barcode": "171122336",
            "dpc": "03042014101",
            "name": "តុល សុផាត"
        },
        {
            "barcode": "171122337",
            "dpc": "03042014201",
            "name": "ធឹង គឹមហេង"
        },
        {
            "barcode": "171122338",
            "dpc": "03042014301",
            "name": "ជា ហ៊ាន"
        },
        {
            "barcode": "171122339",
            "dpc": "03042014401",
            "name": "ជា វ៉ាសាយ"
        },
        {
            "barcode": "171122340",
            "dpc": "03042014501",
            "name": "សៅ សំអុល"
        },
        {
            "barcode": "171122341",
            "dpc": "03042014601",
            "name": "ជា ស្រីទូច"
        },
        {
            "barcode": "171122342",
            "dpc": "03042014701",
            "name": "អ៊ុក សំអ៊ុន"
        },
        {
            "barcode": "171122343",
            "dpc": "03042014801",
            "name": "សុខ ប៊ុនធឿន"
        },
        {
            "barcode": "171122344",
            "dpc": "03042014901",
            "name": "ឡាច សំអាន"
        },
        {
            "barcode": "171122345",
            "dpc": "03042015001",
            "name": "ឡេង ខាន់"
        },
        {
            "barcode": "171122346",
            "dpc": "03042015101",
            "name": "រ៉ាត់ ថាវី"
        },
        {
            "barcode": "171122347",
            "dpc": "03042015201",
            "name": "អ៊ីវ ថន"
        },
        {
            "barcode": "171122348",
            "dpc": "03042015401",
            "name": "ទ្រី សុង"
        },
        {
            "barcode": "171122349",
            "dpc": "03042033201",
            "name": "ភូ សារឿន"
        },
        {
            "barcode": "171122350",
            "dpc": "03042033301",
            "name": "ប៉ាច សុគុណ្ណា"
        },
        {
            "barcode": "171122351",
            "dpc": "03042033401",
            "name": "នួន ណែម"
        },
        {
            "barcode": "171122352",
            "dpc": "03042015501",
            "name": "កុមារកំព្រារ"
        },
        {
            "barcode": "171122353",
            "dpc": "03042035501",
            "name": "យស់ រតនា"
        },
        {
            "barcode": "171122354",
            "dpc": "03042035601",
            "name": "លីអើរ៉ុនស៊ីថាន់"
        },
        {
            "barcode": "171122355",
            "dpc": "03042019801",
            "name": "ស្សី សាង"
        },
        {
            "barcode": "171122356",
            "dpc": "03042019901",
            "name": "ចេង សុខគាង"
        },
        {
            "barcode": "171122357",
            "dpc": "03042020001",
            "name": "យឹម សុខា"
        },
        {
            "barcode": "171122358",
            "dpc": "03042020101",
            "name": "អ៊ុក ណង"
        },
        {
            "barcode": "171122359",
            "dpc": "03042020201",
            "name": "អៀក កៀវ"
        },
        {
            "barcode": "171122360",
            "dpc": "03042020301",
            "name": "សៀង គឹមយី"
        },
        {
            "barcode": "171122361",
            "dpc": "03042020401",
            "name": "លឿង ស៊ីធួន"
        },
        {
            "barcode": "171122362",
            "dpc": "03042020701",
            "name": "ជីវ  ដឿន ២"
        },
        {
            "barcode": "171122363",
            "dpc": "03042019001",
            "name": "អ៊ិត សុប៉ុញ"
        },
        {
            "barcode": "171122364",
            "dpc": "03042020801",
            "name": "ជា រស់"
        },
        {
            "barcode": "171122365",
            "dpc": "03042020901",
            "name": "ថៃ  ហេង"
        },
        {
            "barcode": "171122366",
            "dpc": "03042021001",
            "name": "ថាត សារ៉េត"
        },
        {
            "barcode": "171122367",
            "dpc": "03042021201",
            "name": "ចឹក ខឹម"
        },
        {
            "barcode": "171122368",
            "dpc": "03042021301",
            "name": "គឹម វុធ"
        },
        {
            "barcode": "171122369",
            "dpc": "03042021401",
            "name": "យស់ សោភា"
        },
        {
            "barcode": "171122370",
            "dpc": "03042021501",
            "name": "ឌួង សុខុន"
        },
        {
            "barcode": "171122371",
            "dpc": "03042021601",
            "name": "សាញ់ ហួយ"
        },
        {
            "barcode": "171122372",
            "dpc": "03042021701",
            "name": "ប៉ាន់ ផល្លា"
        },
        {
            "barcode": "171122373",
            "dpc": "03042021901",
            "name": "ប៉ែន វណ្ណា"
        },
        {
            "barcode": "171122374",
            "dpc": "03042022001",
            "name": "សេង សុខា"
        },
        {
            "barcode": "171122375",
            "dpc": "03042022101",
            "name": "វ៉ាត់ សុវណ្ណ"
        },
        {
            "barcode": "171122376",
            "dpc": "03042011101",
            "name": "ឈិន ឆេត"
        },
        {
            "barcode": "171122377",
            "dpc": "03042022201",
            "name": "សៀង ហេង"
        },
        {
            "barcode": "171122378",
            "dpc": "03042022301",
            "name": "ហួត លុយ"
        },
        {
            "barcode": "171122379",
            "dpc": "03042022401",
            "name": "ស៊ូ សារិន"
        },
        {
            "barcode": "171122380",
            "dpc": "03042022501",
            "name": "ចក់ ពេជ្រ"
        },
        {
            "barcode": "171122381",
            "dpc": "03042022601",
            "name": "សំ ផល្លី"
        },
        {
            "barcode": "171122382",
            "dpc": "03042022701",
            "name": "មឿន មាន"
        },
        {
            "barcode": "171122383",
            "dpc": "03042022801",
            "name": "សូ សយ"
        },
        {
            "barcode": "171122384",
            "dpc": "03042022901",
            "name": "ជា ចំរ៉ុង"
        },
        {
            "barcode": "171122385",
            "dpc": "03042023001",
            "name": "កែវ សំ"
        },
        {
            "barcode": "171122386",
            "dpc": "03042023101",
            "name": "យូ សេងហ៊ាង"
        },
        {
            "barcode": "171122387",
            "dpc": "03042023201",
            "name": "ប៊ុន ធឿន"
        },
        {
            "barcode": "171122388",
            "dpc": "03042023301",
            "name": "ប៉ែន ឡឹង"
        },
        {
            "barcode": "171122389",
            "dpc": "03042023401",
            "name": "សោម សុមាលី"
        },
        {
            "barcode": "171122390",
            "dpc": "03042023501",
            "name": "សួង រ៉ា"
        },
        {
            "barcode": "171122391",
            "dpc": "03042023601",
            "name": "ញ៉ែម វណ្ឌី"
        },
        {
            "barcode": "171122392",
            "dpc": "03042023701",
            "name": "វ៉ាន់ សុធាវី"
        },
        {
            "barcode": "171122393",
            "dpc": "03042023801",
            "name": "សោម សោភា"
        },
        {
            "barcode": "171122394",
            "dpc": "03042012401",
            "name": "សុខ  សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171122395",
            "dpc": "03042015301",
            "name": "គឹម  ណាវី"
        },
        {
            "barcode": "171122396",
            "dpc": "03042015701",
            "name": "ស្រី  ស៊្ររ"
        },
        {
            "barcode": "171122397",
            "dpc": "03042015801",
            "name": "ជុំ  សុភាព"
        },
        {
            "barcode": "171122398",
            "dpc": "03042015901",
            "name": "ថាប់  ធឿន"
        },
        {
            "barcode": "171122399",
            "dpc": "03042016001",
            "name": "មិន  ថាវី"
        },
        {
            "barcode": "171122400",
            "dpc": "03042016101",
            "name": "អ៊ុំ  សុធិញ"
        },
        {
            "barcode": "171122401",
            "dpc": "03042016201",
            "name": "កែវ  សុផន"
        },
        {
            "barcode": "171122402",
            "dpc": "03042016301",
            "name": "ម៉ម  សារឿន"
        },
        {
            "barcode": "171122403",
            "dpc": "03042016401",
            "name": "ឈិត  ថា"
        },
        {
            "barcode": "171122404",
            "dpc": "03042016501",
            "name": "សំ  សុខុម"
        },
        {
            "barcode": "171122405",
            "dpc": "03042016601",
            "name": "ជា  ចាន់ដា"
        },
        {
            "barcode": "171122406",
            "dpc": "03042016701",
            "name": "ហួត  លីឆេង"
        },
        {
            "barcode": "171122407",
            "dpc": "03042016801",
            "name": "នាង  វណ្ណះ"
        },
        {
            "barcode": "171122408",
            "dpc": "03042016901",
            "name": "សេង  ផន"
        },
        {
            "barcode": "171122409",
            "dpc": "03042017001",
            "name": "ហឿន  ឌីន"
        },
        {
            "barcode": "171122410",
            "dpc": "03042017101",
            "name": "ឡ  គឹមលន់"
        },
        {
            "barcode": "171122411",
            "dpc": "03042017201",
            "name": "ជាម  តេង"
        },
        {
            "barcode": "171122412",
            "dpc": "03042017401",
            "name": "អ៊ឹង  ផល្គុន"
        },
        {
            "barcode": "171122413",
            "dpc": "03042017601",
            "name": "ឌី  សុវណ្ណ"
        },
        {
            "barcode": "171122414",
            "dpc": "03042017701",
            "name": "ម៉ាង  គឹមស៊ាន"
        },
        {
            "barcode": "171122415",
            "dpc": "03042017901",
            "name": "ប៊ុន  មុំ"
        },
        {
            "barcode": "171122416",
            "dpc": "03042018001",
            "name": "ឈិន  សំណាង"
        },
        {
            "barcode": "171122417",
            "dpc": "03042018101",
            "name": "តឹក  សំណាក់ ១"
        },
        {
            "barcode": "171122418",
            "dpc": "03042018201",
            "name": "តឹក  សំណាក់ ២"
        },
        {
            "barcode": "171122419",
            "dpc": "03042018301",
            "name": "ហាក់   លាន"
        },
        {
            "barcode": "171122420",
            "dpc": "03042018401",
            "name": "ឃី  យ៉ា"
        },
        {
            "barcode": "171122421",
            "dpc": "03042018501",
            "name": "ងួន  លាង"
        },
        {
            "barcode": "171122422",
            "dpc": "03042018601",
            "name": "តិច  ជ្រិន"
        },
        {
            "barcode": "171122423",
            "dpc": "03042018701",
            "name": "ហែម  ប៉ាច"
        },
        {
            "barcode": "171122424",
            "dpc": "03042018801",
            "name": "ងិន  សំអុន"
        },
        {
            "barcode": "171122425",
            "dpc": "03042019101",
            "name": "ហេង  រតនា"
        },
        {
            "barcode": "171122426",
            "dpc": "03042019201",
            "name": "ខៀវ  តារា"
        },
        {
            "barcode": "171122427",
            "dpc": "03042019401",
            "name": "ប៊ិច  ប៊ុនធឿន"
        },
        {
            "barcode": "171122428",
            "dpc": "03042019501",
            "name": "វ៉ាត  វីរៈ"
        },
        {
            "barcode": "171122429",
            "dpc": "03042019701",
            "name": "សេក  ឆក"
        },
        {
            "barcode": "171122430",
            "dpc": "03042028901",
            "name": "ឆោម  ឆូយ"
        },
        {
            "barcode": "171122431",
            "dpc": "03042029001",
            "name": "រ៉ែម  ណេង"
        },
        {
            "barcode": "171122432",
            "dpc": "03042029101",
            "name": "ឆោម  ឆាត់"
        },
        {
            "barcode": "171122433",
            "dpc": "03042029201",
            "name": "ខ្លូត  ចំរ៉ាត់"
        },
        {
            "barcode": "171122434",
            "dpc": "03042029301",
            "name": "ចក់  សុន"
        },
        {
            "barcode": "171122435",
            "dpc": "03042029401",
            "name": "លឹម  សុផល"
        },
        {
            "barcode": "171122436",
            "dpc": "03042029501",
            "name": "ព្រុំ  សំអាង"
        },
        {
            "barcode": "171122437",
            "dpc": "03042029601",
            "name": "ព្រុំ  រាសី"
        },
        {
            "barcode": "171122438",
            "dpc": "03042029701",
            "name": "ជឿន  ដេត"
        },
        {
            "barcode": "171122439",
            "dpc": "03042029801",
            "name": "ហែម  អឿន"
        },
        {
            "barcode": "171122440",
            "dpc": "03042029901",
            "name": "ផេង  ឡូញ"
        },
        {
            "barcode": "171122441",
            "dpc": "03042030001",
            "name": "សួស  សុភ័ក្រ ២"
        },
        {
            "barcode": "171122442",
            "dpc": "03042030101",
            "name": "កាន់  ណារ៉េត"
        },
        {
            "barcode": "171122443",
            "dpc": "03042030201",
            "name": "ព្រំ  គឹមឆេង"
        },
        {
            "barcode": "171122444",
            "dpc": "03042030301",
            "name": "សួន  តាំង"
        },
        {
            "barcode": "171122445",
            "dpc": "03042030401",
            "name": "ឡៅ  សុខា"
        },
        {
            "barcode": "171122446",
            "dpc": "03042030501",
            "name": "ឃុត  សំផុន"
        },
        {
            "barcode": "171122447",
            "dpc": "03042030601",
            "name": "ចែម  សារិទ្ធ"
        },
        {
            "barcode": "171122448",
            "dpc": "03042030701",
            "name": "សំ  ភារុំ"
        },
        {
            "barcode": "171122449",
            "dpc": "03042030801",
            "name": "ឆន  ឈៀង"
        },
        {
            "barcode": "171122450",
            "dpc": "03042030901",
            "name": "គង់  គា"
        },
        {
            "barcode": "171122451",
            "dpc": "03042031001",
            "name": "សូ  សុគន្ធា"
        },
        {
            "barcode": "171122452",
            "dpc": "03042031101",
            "name": "វណ្ណ  មឿន"
        },
        {
            "barcode": "171122453",
            "dpc": "03042031201",
            "name": "អ៊ុក  តែម"
        },
        {
            "barcode": "171122454",
            "dpc": "03042031301",
            "name": "ឈឹម  យ៉េង"
        },
        {
            "barcode": "171122455",
            "dpc": "03042031401",
            "name": "ទិត្យ  យង់"
        },
        {
            "barcode": "171122456",
            "dpc": "03042031501",
            "name": "ឌុក  ពូល"
        },
        {
            "barcode": "171122457",
            "dpc": "03042031601",
            "name": "ឡត  សារ៉េត"
        },
        {
            "barcode": "171122458",
            "dpc": "03042031701",
            "name": "អ៊ុង  សុផល"
        },
        {
            "barcode": "171122459",
            "dpc": "03042031801",
            "name": "សឿន  ស៊ីម"
        },
        {
            "barcode": "171122460",
            "dpc": "03042032001",
            "name": "ភេម   សុខុម"
        },
        {
            "barcode": "171122461",
            "dpc": "03042032101",
            "name": "ភេម  រឿត"
        },
        {
            "barcode": "171122462",
            "dpc": "03042032201",
            "name": "លិស  ពិសិទ្ធ"
        },
        {
            "barcode": "171122463",
            "dpc": "03042032301",
            "name": "អ៊ុំ  សាម៉េត ២"
        },
        {
            "barcode": "171122464",
            "dpc": "03042032401",
            "name": "ញ៉ែម  កញ្ញា"
        },
        {
            "barcode": "171122465",
            "dpc": "03042032501",
            "name": "អ៊ុក  ចាន់ថុល"
        },
        {
            "barcode": "171122466",
            "dpc": "03042032701",
            "name": "គង់  សេរីវុធ"
        },
        {
            "barcode": "171122467",
            "dpc": "03042032801",
            "name": "តា   ឈួម"
        },
        {
            "barcode": "171122468",
            "dpc": "03042032901",
            "name": "អ៊ុក  ផាវណ្ណី"
        },
        {
            "barcode": "171122469",
            "dpc": "03042033001",
            "name": "ចៅ  ហាវ"
        },
        {
            "barcode": "171122470",
            "dpc": "03042033101",
            "name": "រស់   វិន"
        },
        {
            "barcode": "171122471",
            "dpc": "03042033501",
            "name": "ចាន់  សុខ"
        },
        {
            "barcode": "171122472",
            "dpc": "03042033601",
            "name": "កាន់  វិបុល"
        },
        {
            "barcode": "171122473",
            "dpc": "03042033701",
            "name": "អ៊ាង  លក្ខិណា"
        },
        {
            "barcode": "171122474",
            "dpc": "03042033801",
            "name": "អ៊ាង  ហេង"
        },
        {
            "barcode": "171122475",
            "dpc": "03042033901",
            "name": "ឆៃ  សុវណ្ណ"
        },
        {
            "barcode": "171122476",
            "dpc": "03042034001",
            "name": "យស  សារិទ្ធ"
        },
        {
            "barcode": "171122477",
            "dpc": "03042034101",
            "name": "សាំង  សាគួន"
        },
        {
            "barcode": "171122478",
            "dpc": "03042034201",
            "name": "មាស  នី"
        },
        {
            "barcode": "171122479",
            "dpc": "03042034301",
            "name": "សុខ  ណាលីន"
        },
        {
            "barcode": "171122480",
            "dpc": "03042034401",
            "name": "ញឹក  យឿង"
        },
        {
            "barcode": "171122481",
            "dpc": "03042034501",
            "name": "សាន  ឧស្សា"
        },
        {
            "barcode": "171122482",
            "dpc": "03042034701",
            "name": "ត្រេង  វុទ្ធី"
        },
        {
            "barcode": "171122483",
            "dpc": "03042034801",
            "name": "សេក សម្បត្តិ"
        },
        {
            "barcode": "171122484",
            "dpc": "03042034901",
            "name": "ប៊ុន  ថើន"
        },
        {
            "barcode": "171122485",
            "dpc": "03042035101",
            "name": "ថាន់  រដ្ឋា"
        },
        {
            "barcode": "171122486",
            "dpc": "03042035201",
            "name": "គា  សឺន"
        },
        {
            "barcode": "171122487",
            "dpc": "03042035301",
            "name": "សំរិទ្ធ  សីលា"
        },
        {
            "barcode": "171122488",
            "dpc": "03042035401",
            "name": "ជា  សាង"
        },
        {
            "barcode": "171122489",
            "dpc": "03042035701",
            "name": "ម៉េត  សុខុម"
        },
        {
            "barcode": "171122490",
            "dpc": "03042036001",
            "name": "ប៉ក់  សុងរិទ្ធិ"
        },
        {
            "barcode": "171122491",
            "dpc": "03042036101",
            "name": "ព្រហ្ម  ប៊ុនណាវី"
        },
        {
            "barcode": "171122492",
            "dpc": "03042036301",
            "name": "កែវ  ចាន់ផល"
        },
        {
            "barcode": "171122493",
            "dpc": "03042036401",
            "name": "គិញ  សារុន"
        },
        {
            "barcode": "171122494",
            "dpc": "03042036501",
            "name": "ហម  អារុន"
        },
        {
            "barcode": "171122495",
            "dpc": "03042036601",
            "name": "ង៉ែត  ពិសិទ្ធ"
        },
        {
            "barcode": "171122496",
            "dpc": "03042036801",
            "name": "ជី  សុខហ៊ាង"
        },
        {
            "barcode": "171122497",
            "dpc": "03042036901",
            "name": "ឃឹម  ផេង"
        },
        {
            "barcode": "171122498",
            "dpc": "03042037001",
            "name": "ងួន  ភី"
        },
        {
            "barcode": "171122499",
            "dpc": "03042037101",
            "name": "លួង  នាង"
        },
        {
            "barcode": "171122500",
            "dpc": "03042037201",
            "name": "ខឹម  ជីម"
        },
        {
            "barcode": "171122501",
            "dpc": "03042037301",
            "name": "ហូ  យកលីន"
        },
        {
            "barcode": "171122502",
            "dpc": "03042037501",
            "name": "ទិន  សុផល"
        },
        {
            "barcode": "171122503",
            "dpc": "03042038301",
            "name": "គឹម   ទៀង"
        },
        {
            "barcode": "171122504",
            "dpc": "03042043001",
            "name": "ឡាត  សាវេត"
        },
        {
            "barcode": "171122505",
            "dpc": "03042047701",
            "name": "ម៉ៅ  សុផុន"
        },
        {
            "barcode": "171122506",
            "dpc": "03042028401",
            "name": "ធិន  ធួន"
        },
        {
            "barcode": "171122507",
            "dpc": "03042037701",
            "name": "វត្តកណ្តឹង"
        },
        {
            "barcode": "171122508",
            "dpc": "03042037801",
            "name": "អ៊ឹងចេង"
        },
        {
            "barcode": "171122509",
            "dpc": "03042037901",
            "name": "ខឿន ភាន់"
        },
        {
            "barcode": "171122510",
            "dpc": "03042038001",
            "name": "ឈិត ឆាយ"
        },
        {
            "barcode": "171122511",
            "dpc": "03042038101",
            "name": "ពេទ្យ ឈៀង"
        },
        {
            "barcode": "171122512",
            "dpc": "03042038401",
            "name": "គុល គុណ"
        },
        {
            "barcode": "171122513",
            "dpc": "03042038501",
            "name": "អៀង ធី"
        },
        {
            "barcode": "171122514",
            "dpc": "03042038601",
            "name": "ហុង ហៃ"
        },
        {
            "barcode": "171122515",
            "dpc": "03042039001",
            "name": "សៅ ឈុំ"
        },
        {
            "barcode": "171122516",
            "dpc": "03042039101",
            "name": "ម៉ៃ ម៉ារិទ្ធ"
        },
        {
            "barcode": "171122517",
            "dpc": "03042039401",
            "name": "អ៊ិត ដារ៉ា"
        },
        {
            "barcode": "171122518",
            "dpc": "03042039201",
            "name": "ម៉ិល  សាម៉េត"
        },
        {
            "barcode": "171122519",
            "dpc": "03042039301",
            "name": "លឹម  ណុន"
        },
        {
            "barcode": "171122520",
            "dpc": "03042038701",
            "name": "យិន យៀន"
        },
        {
            "barcode": "171122521",
            "dpc": "03042040001",
            "name": "សំបូរ ផូ"
        },
        {
            "barcode": "171122522",
            "dpc": "03042040101",
            "name": "សួស សុគន្ធី"
        },
        {
            "barcode": "171122523",
            "dpc": "03042040301",
            "name": "ថាច់ ធី"
        },
        {
            "barcode": "171122524",
            "dpc": "03042040401",
            "name": "ទឹម ស្សី"
        },
        {
            "barcode": "171122525",
            "dpc": "03042040601",
            "name": "សឺន សានសម្បត្តិ"
        },
        {
            "barcode": "171122526",
            "dpc": "03042040701",
            "name": "ពៅ វណ្ណៈ"
        },
        {
            "barcode": "171122527",
            "dpc": "03042040801",
            "name": "ថោង វិចិត្រ"
        },
        {
            "barcode": "171122528",
            "dpc": "03042040901",
            "name": "យស សុផាត"
        },
        {
            "barcode": "171122529",
            "dpc": "03042041101",
            "name": "ថាច់ លី"
        },
        {
            "barcode": "171122530",
            "dpc": "03042045401",
            "name": "ឈឹម សុវណ្ណ"
        },
        {
            "barcode": "171122531",
            "dpc": "03042045501",
            "name": "ហោ សំប៊ុន"
        },
        {
            "barcode": "171122532",
            "dpc": "03042045601",
            "name": "លុច គឿន"
        },
        {
            "barcode": "171122533",
            "dpc": "03042045801",
            "name": "ជ័យ ធីតា"
        },
        {
            "barcode": "171122534",
            "dpc": "03042045901",
            "name": "រិត កប"
        },
        {
            "barcode": "171122535",
            "dpc": "03042046001",
            "name": "ណុប ផាស៊ី"
        },
        {
            "barcode": "171122536",
            "dpc": "03042046101",
            "name": "សាញ់ សុភាព"
        },
        {
            "barcode": "171122537",
            "dpc": "03042045701",
            "name": "ឯម ស៊ា"
        },
        {
            "barcode": "171122538",
            "dpc": "03042046201",
            "name": "គង់ ដាវី"
        },
        {
            "barcode": "171122539",
            "dpc": "03042046301",
            "name": "ហៃ គឹមឈួន"
        },
        {
            "barcode": "171122540",
            "dpc": "03042046401",
            "name": "យ៉ែម ចាន់តារ៉ា"
        },
        {
            "barcode": "171122541",
            "dpc": "03042039901",
            "name": "ឆោម ឆុង"
        },
        {
            "barcode": "171122542",
            "dpc": "03042039701",
            "name": "គឹម សុផល"
        },
        {
            "barcode": "171122543",
            "dpc": "03042046501",
            "name": "សំ សុដារ៉ា"
        },
        {
            "barcode": "171122544",
            "dpc": "03042046601",
            "name": "ឃុន ភី"
        },
        {
            "barcode": "171122545",
            "dpc": "03042046801",
            "name": "អៀម សំអាត"
        },
        {
            "barcode": "171122546",
            "dpc": "03042047001",
            "name": "អ៊ឹង ឈៀង"
        },
        {
            "barcode": "171122547",
            "dpc": "03042047101",
            "name": "បាន ប៉េងលី"
        },
        {
            "barcode": "171122548",
            "dpc": "03042047201",
            "name": "អ៊ួន រ៉ុត"
        },
        {
            "barcode": "171122549",
            "dpc": "03042047301",
            "name": "អ៊ុត រ៉ុន"
        },
        {
            "barcode": "171122550",
            "dpc": "03042047401",
            "name": "ហៃ ប៊ុនឈួ"
        },
        {
            "barcode": "171122551",
            "dpc": "03042047501",
            "name": "ស៊ូ ណាវី"
        },
        {
            "barcode": "171122552",
            "dpc": "03042042001",
            "name": "សេង សុធាវី"
        },
        {
            "barcode": "171122553",
            "dpc": "03042042101",
            "name": "ងី ឆេងអៀង"
        },
        {
            "barcode": "171122554",
            "dpc": "03042042201",
            "name": "តូ ឈុនវៀង"
        },
        {
            "barcode": "171122555",
            "dpc": "03042042301",
            "name": "ព្រំ ហ៊ន"
        },
        {
            "barcode": "171122556",
            "dpc": "03042042401",
            "name": "អេង សាវ៉ាត"
        },
        {
            "barcode": "171122557",
            "dpc": "03042042501",
            "name": "អ៊ឹង ហូវ"
        },
        {
            "barcode": "171122558",
            "dpc": "03042042601",
            "name": "យ៉ា វីរៈ"
        },
        {
            "barcode": "171122559",
            "dpc": "03042042701",
            "name": "ឆែម រ៉ូ"
        },
        {
            "barcode": "171122560",
            "dpc": "03042042801",
            "name": "យ៉ន យ៉ង់"
        },
        {
            "barcode": "171122561",
            "dpc": "03042042901",
            "name": "ហ៊ួយ ស៊ុនថន"
        },
        {
            "barcode": "171122562",
            "dpc": "03042043101",
            "name": "អ៊ុក ដារ៉ា"
        },
        {
            "barcode": "171122563",
            "dpc": "03042044501",
            "name": "ប៉ូ យៀត"
        },
        {
            "barcode": "171122564",
            "dpc": "03042044601",
            "name": "ម៉ក់  រ៉ាត់"
        },
        {
            "barcode": "171122565",
            "dpc": "03042044701",
            "name": "គុយ អោក"
        },
        {
            "barcode": "171122566",
            "dpc": "03042044801",
            "name": "សាន ហឿន"
        },
        {
            "barcode": "171122567",
            "dpc": "03042044901",
            "name": "ប៊ុន រឿង"
        },
        {
            "barcode": "171122568",
            "dpc": "03042044401",
            "name": "ជុំ រៀប"
        },
        {
            "barcode": "171122569",
            "dpc": "03042044301",
            "name": "ណាំ សុរឿង"
        },
        {
            "barcode": "171122570",
            "dpc": "03042044201",
            "name": "អន សុខាវី"
        },
        {
            "barcode": "171122571",
            "dpc": "03042044101",
            "name": "អន ចរិយា"
        },
        {
            "barcode": "171122572",
            "dpc": "03042044001",
            "name": "ហោ គឹមហួន"
        },
        {
            "barcode": "171122573",
            "dpc": "03042043901",
            "name": "មាឃ ឆវីវណ្ណ"
        },
        {
            "barcode": "171122574",
            "dpc": "03042043801",
            "name": "ឌុច ចំរើន"
        },
        {
            "barcode": "171122575",
            "dpc": "03042043601",
            "name": "អឿង សុគន្ធ"
        },
        {
            "barcode": "171122576",
            "dpc": "03042043701",
            "name": "សយ សុវណ្ណ"
        },
        {
            "barcode": "171122577",
            "dpc": "03042043501",
            "name": "អឿង ថាវី"
        },
        {
            "barcode": "171122578",
            "dpc": "03042043401",
            "name": "ជា រួន"
        },
        {
            "barcode": "171122579",
            "dpc": "03042043301",
            "name": "អៀប គុយហួត"
        },
        {
            "barcode": "171122580",
            "dpc": "03042043201",
            "name": "សៀ ទៀង"
        },
        {
            "barcode": "171122581",
            "dpc": "03042041901",
            "name": "វត្តគរ"
        },
        {
            "barcode": "171122582",
            "dpc": "03042041801",
            "name": "សាលាបឋមសិក្សាវត្តគរ"
        },
        {
            "barcode": "171122583",
            "dpc": "03042041701",
            "name": "អ៊ូរ គឹមហុក"
        },
        {
            "barcode": "171122584",
            "dpc": "03042041601",
            "name": "ផេង ធឿន"
        },
        {
            "barcode": "171122585",
            "dpc": "03042041501",
            "name": "ឌី ពៀច"
        },
        {
            "barcode": "171122586",
            "dpc": "03042041401",
            "name": "ឈឿន ទី"
        },
        {
            "barcode": "171122587",
            "dpc": "03042041301",
            "name": "ពៅ សាវើយ"
        },
        {
            "barcode": "171122588",
            "dpc": "03042041201",
            "name": "ស៊ា លីវ"
        },
        {
            "barcode": "171122589",
            "dpc": "03042045001",
            "name": "អៀក ប៊ុនកើន"
        },
        {
            "barcode": "171122590",
            "dpc": "03042045101",
            "name": "ថោង ដានាប២"
        },
        {
            "barcode": "171122591",
            "dpc": "03042045201",
            "name": "ថោង ដានាប១"
        },
        {
            "barcode": "171122592",
            "dpc": "03042046901",
            "name": "ឡោ ណងហេង"
        },
        {
            "barcode": "171122593",
            "dpc": "03042046701",
            "name": "យៀង ឃិត"
        },
        {
            "barcode": "171122594",
            "dpc": "03042047801",
            "name": "ប៉ក់ ម៉ៅ"
        },
        {
            "barcode": "171122595",
            "dpc": "03042047901",
            "name": "ជួន វ៉ាន់លី"
        },
        {
            "barcode": "171122596",
            "dpc": "03042048001",
            "name": "យុគន្ធរ្ធ សំបូរ១"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
