let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171125162",
            "dpc": "03042103801",
            "name": "ស៊ូ ម៉ារីយ៉ាន"
        },
        {
            "barcode": "171125163",
            "dpc": "03042104201",
            "name": "ទូត យើ"
        },
        {
            "barcode": "171125164",
            "dpc": "03042104301",
            "name": "ម៉ាន់ ម៉ាត់"
        },
        {
            "barcode": "171125165",
            "dpc": "03042104401",
            "name": "ស៊ូ ដាគីន"
        },
        {
            "barcode": "171125166",
            "dpc": "03042104501",
            "name": "យ៉ា ហ្វាហ្ស៊ី"
        },
        {
            "barcode": "171125167",
            "dpc": "03042104601",
            "name": "ម៉ាន សារី"
        },
        {
            "barcode": "171125168",
            "dpc": "03042104701",
            "name": "សុ សារ៉ស់"
        },
        {
            "barcode": "171125169",
            "dpc": "03042104801",
            "name": "ម៉ាត់ ប៉ាត់ទ្រី"
        },
        {
            "barcode": "171125170",
            "dpc": "03042105501",
            "name": "រិទ្ធ វណ្ណនី"
        },
        {
            "barcode": "171125171",
            "dpc": "03042105701",
            "name": "នាក់ រ៉ា"
        },
        {
            "barcode": "171125172",
            "dpc": "03042105801",
            "name": "ណុះ រី"
        },
        {
            "barcode": "171125173",
            "dpc": "03042106901",
            "name": "ស៊ូ កើ"
        },
        {
            "barcode": "171125174",
            "dpc": "03042107001",
            "name": "ទា ហ៊ីអ៊ី"
        },
        {
            "barcode": "171125175",
            "dpc": "03042107101",
            "name": "ទា ខលិក"
        },
        {
            "barcode": "171125176",
            "dpc": "03042107201",
            "name": "អួម សីលា"
        },
        {
            "barcode": "171125177",
            "dpc": "03042107301",
            "name": "ហ៊ីម ម៉ាស់"
        },
        {
            "barcode": "171125178",
            "dpc": "03042107401",
            "name": "ភិន ទន់"
        },
        {
            "barcode": "171125179",
            "dpc": "03042107501",
            "name": "ម៉ាត់ ខរី"
        },
        {
            "barcode": "171125180",
            "dpc": "03042108001",
            "name": "សាន គឹមសាត"
        },
        {
            "barcode": "171125181",
            "dpc": "03042119701",
            "name": "ម៉ាន ខាន"
        },
        {
            "barcode": "171125182",
            "dpc": "03042119901",
            "name": "ម៉ន អាត"
        },
        {
            "barcode": "171125183",
            "dpc": "03042120001",
            "name": "យ៉ា គីម"
        },
        {
            "barcode": "171125184",
            "dpc": "03042120101",
            "name": "ម៉ាត់ ស្រីលីន"
        },
        {
            "barcode": "171125185",
            "dpc": "03042120301",
            "name": "ម៉ាន ផាន់ណារ៉ា"
        },
        {
            "barcode": "171125186",
            "dpc": "03042120201",
            "name": "ម៉ាន រដ្ឋា"
        },
        {
            "barcode": "171125187",
            "dpc": "03042121701",
            "name": "ម៉ាន កុសល់"
        },
        {
            "barcode": "171125188",
            "dpc": "03042120701",
            "name": "សុះ អាំងទីណាស់"
        },
        {
            "barcode": "171125189",
            "dpc": "03042120501",
            "name": "ម៉ុង់ សាន្ត"
        },
        {
            "barcode": "171125190",
            "dpc": "03042120601",
            "name": "ធៀន លី"
        },
        {
            "barcode": "171125191",
            "dpc": "03042119501",
            "name": "ស្មេះ គ្រីយ៉ា"
        },
        {
            "barcode": "171125192",
            "dpc": "03042119401",
            "name": "ណាល់ សំណាង"
        },
        {
            "barcode": "171125193",
            "dpc": "03042119301",
            "name": "យិន ឈឹង"
        },
        {
            "barcode": "171125194",
            "dpc": "03042119201",
            "name": "លី ណាស់"
        },
        {
            "barcode": "171125195",
            "dpc": "03042118901",
            "name": "ទិត្យ ថាវី"
        },
        {
            "barcode": "171125196",
            "dpc": "03042118401",
            "name": "ឡុង សុគន្ធារី"
        },
        {
            "barcode": "171125197",
            "dpc": "03042118201",
            "name": "ឈិន ស"
        },
        {
            "barcode": "171125198",
            "dpc": "03042118301",
            "name": "អ៊ុន ចិន្តា"
        },
        {
            "barcode": "171125199",
            "dpc": "03042118101",
            "name": "ទិន ផល្លា"
        },
        {
            "barcode": "171125200",
            "dpc": "03042118001",
            "name": "ស៊ុន សុខា"
        },
        {
            "barcode": "171125201",
            "dpc": "03042117601",
            "name": "វិន សេន"
        },
        {
            "barcode": "171125202",
            "dpc": "03042117501",
            "name": "ឈុំ យ៉ាន"
        },
        {
            "barcode": "171125203",
            "dpc": "03042117401",
            "name": "ឈុំ ទូច"
        },
        {
            "barcode": "171125204",
            "dpc": "03042116801",
            "name": "ចាន់ វិចិត្រ"
        },
        {
            "barcode": "171125205",
            "dpc": "03042116701",
            "name": "ស៊ុន សុរីយ៉ា"
        },
        {
            "barcode": "171125206",
            "dpc": "03042116501",
            "name": "ម៉ាត់ រីម"
        },
        {
            "barcode": "171125207",
            "dpc": "03042116001",
            "name": "ឱ សេរី"
        },
        {
            "barcode": "171125208",
            "dpc": "03042116201",
            "name": "យូ រ៉ាហ្វាត់"
        },
        {
            "barcode": "171125209",
            "dpc": "03042116101",
            "name": "ឡិប វណ្ណរូ"
        },
        {
            "barcode": "171125210",
            "dpc": "03042116301",
            "name": "ម៉ាត់ រើ"
        },
        {
            "barcode": "171125211",
            "dpc": "03042116401",
            "name": "គង់ ម៉ារី"
        },
        {
            "barcode": "171125212",
            "dpc": "03042116901",
            "name": "សួន ដា"
        },
        {
            "barcode": "171125213",
            "dpc": "03042117101",
            "name": "ឆង់ ថាន"
        },
        {
            "barcode": "171125214",
            "dpc": "03042117301",
            "name": "ម៉ែន សុភ័ក្ត្រ"
        },
        {
            "barcode": "171125215",
            "dpc": "03042117201",
            "name": "ប្រាក់ គឹមលាង"
        },
        {
            "barcode": "171125216",
            "dpc": "03042117001",
            "name": "ស៊ុន ម៉ាយ៉ាសិទ្ធ"
        },
        {
            "barcode": "171125217",
            "dpc": "03042117701",
            "name": "ខ្លូត ចន្តា"
        },
        {
            "barcode": "171125218",
            "dpc": "03042117901",
            "name": "យឹម នៅ"
        },
        {
            "barcode": "171125219",
            "dpc": "03042115901",
            "name": "បឿន ផាត់"
        },
        {
            "barcode": "171125220",
            "dpc": "03042115801",
            "name": "សួន ចាន់ណា"
        },
        {
            "barcode": "171125221",
            "dpc": "03042115701",
            "name": "អោ ចំរ៉ុង"
        },
        {
            "barcode": "171125222",
            "dpc": "03042115601",
            "name": "ហ៊ីម ម៉ាសូគី"
        },
        {
            "barcode": "171125223",
            "dpc": "03042115501",
            "name": "លី ខា"
        },
        {
            "barcode": "171125224",
            "dpc": "03042108101",
            "name": "ប៉ាង រីម"
        },
        {
            "barcode": "171125225",
            "dpc": "03042108201",
            "name": "ជឹង សុខហេង"
        },
        {
            "barcode": "171125226",
            "dpc": "03042108301",
            "name": "ម៉ូត ពេជ្រ"
        },
        {
            "barcode": "171125227",
            "dpc": "03042107901",
            "name": "ខាន ប្រហ៊ីម"
        },
        {
            "barcode": "171125228",
            "dpc": "03042107801",
            "name": "អ៊ីសាលាស៊ី"
        },
        {
            "barcode": "171125229",
            "dpc": "03042107701",
            "name": "កៅ ប៊ូរ"
        },
        {
            "barcode": "171125230",
            "dpc": "03042106801",
            "name": "ស៊ិន សុវណ្ណ"
        },
        {
            "barcode": "171125231",
            "dpc": "03042106701",
            "name": "យ៉េប សីហាស់"
        },
        {
            "barcode": "171125232",
            "dpc": "03042106601",
            "name": "ស៊ូ សរ"
        },
        {
            "barcode": "171125233",
            "dpc": "03042106501",
            "name": "លាស់ សេត"
        },
        {
            "barcode": "171125234",
            "dpc": "03042106201",
            "name": "យ៉ែប ស្លាម៉ាស់"
        },
        {
            "barcode": "171125235",
            "dpc": "03042106301",
            "name": "ម៉ាត់ សារិន"
        },
        {
            "barcode": "171125236",
            "dpc": "03042106401",
            "name": "នី ម៉ាត់"
        },
        {
            "barcode": "171125237",
            "dpc": "03042106101",
            "name": "ម៉ាត់ ម៉ាលី"
        },
        {
            "barcode": "171125238",
            "dpc": "03042106001",
            "name": "គង់ ទូច"
        },
        {
            "barcode": "171125239",
            "dpc": "03042105901",
            "name": "ជា ចំណង់"
        },
        {
            "barcode": "171125240",
            "dpc": "03042105301",
            "name": "ឡុក សូដានី"
        },
        {
            "barcode": "171125241",
            "dpc": "03042105001",
            "name": "ទិត ដាវី"
        },
        {
            "barcode": "171125242",
            "dpc": "03042104901",
            "name": "ទិត កន្យា"
        },
        {
            "barcode": "171125243",
            "dpc": "03042105401",
            "name": "សួន សារឿន"
        },
        {
            "barcode": "171125244",
            "dpc": "03042105101",
            "name": "អ៊ូម ដាលី"
        },
        {
            "barcode": "171125245",
            "dpc": "03042105201",
            "name": "ឯម សុជាតា"
        },
        {
            "barcode": "171125246",
            "dpc": "03042104001",
            "name": "អ៊ីស្កាន់ដេ ហ្សាកាស៊ី"
        },
        {
            "barcode": "171125247",
            "dpc": "03042103901",
            "name": "ហាក់ នឿម"
        },
        {
            "barcode": "171125248",
            "dpc": "03042103701",
            "name": "ឆួន យ៉ាន"
        },
        {
            "barcode": "171125249",
            "dpc": "03042102901",
            "name": "ម៉ាន យ៉ាន"
        },
        {
            "barcode": "171125250",
            "dpc": "03042103001",
            "name": "សុះ យូកូប"
        },
        {
            "barcode": "171125251",
            "dpc": "03042103101",
            "name": "លី សាទ"
        },
        {
            "barcode": "171125252",
            "dpc": "03042103201",
            "name": "សុខ វង្ស"
        },
        {
            "barcode": "171125253",
            "dpc": "03042103401",
            "name": "អៀង អៃរ៉ា"
        },
        {
            "barcode": "171125254",
            "dpc": "03042103301",
            "name": "អៀង ដាណេ"
        },
        {
            "barcode": "171125255",
            "dpc": "03042103501",
            "name": "ជា ហួន"
        },
        {
            "barcode": "171125256",
            "dpc": "03042102801",
            "name": "ជា ម៉ៅ"
        },
        {
            "barcode": "171125257",
            "dpc": "03042102701",
            "name": "ឡែក ស្រីហ្វីយ៉ាស់"
        },
        {
            "barcode": "171125258",
            "dpc": "03042102601",
            "name": "កា សេន"
        },
        {
            "barcode": "171125259",
            "dpc": "03042102501",
            "name": "ម៉ាត់ ដូម៉ាន"
        },
        {
            "barcode": "171125260",
            "dpc": "03042102301",
            "name": "កប ដា"
        },
        {
            "barcode": "171125261",
            "dpc": "03042102201",
            "name": "ទូច មុន្នី"
        },
        {
            "barcode": "171125262",
            "dpc": "03042102001",
            "name": "ថាប់ ធឿន"
        },
        {
            "barcode": "171125263",
            "dpc": "03042101901",
            "name": "ថាប់ វ៉ាន់ធៀង"
        },
        {
            "barcode": "171125264",
            "dpc": "03042101801",
            "name": "ពៅ សូរ៉ាង"
        },
        {
            "barcode": "171125265",
            "dpc": "03042101701",
            "name": "វង្ស ឆាត"
        },
        {
            "barcode": "171125266",
            "dpc": "03042101601",
            "name": "តាំង សាន់"
        },
        {
            "barcode": "171125267",
            "dpc": "03042101401",
            "name": "ហៃ សុភី"
        },
        {
            "barcode": "171125268",
            "dpc": "03042101301",
            "name": "សួន សេង"
        },
        {
            "barcode": "171125269",
            "dpc": "03042101201",
            "name": "នួន តាន់"
        },
        {
            "barcode": "171125270",
            "dpc": "03042101101",
            "name": "អ៊ឹម វ៉ាន់ធី"
        },
        {
            "barcode": "171125271",
            "dpc": "03042101001",
            "name": "ឈួម ឈង"
        },
        {
            "barcode": "171125272",
            "dpc": "03042100801",
            "name": "មាស ផាន់ណា"
        },
        {
            "barcode": "171125273",
            "dpc": "03042100701",
            "name": "ស៊ួន ពៅ"
        },
        {
            "barcode": "171125274",
            "dpc": "03042100601",
            "name": "ហ៊ុន សូវណ្ណា"
        },
        {
            "barcode": "171125275",
            "dpc": "03042100501",
            "name": "ទិត សុខា ១"
        },
        {
            "barcode": "171125276",
            "dpc": "03042100401",
            "name": "ស៊ូ សារី"
        },
        {
            "barcode": "171125277",
            "dpc": "03042100301",
            "name": "ជុំ ចាន់ហាន"
        },
        {
            "barcode": "171125278",
            "dpc": "03042100201",
            "name": "ម៉ាត់ ម៉ារីណា"
        },
        {
            "barcode": "171125279",
            "dpc": "03042107601",
            "name": "ទុយ ខរ"
        },
        {
            "barcode": "171125280",
            "dpc": "03042108401",
            "name": "ហ៊ុន ចាន់ដារ៉ា"
        },
        {
            "barcode": "171125281",
            "dpc": "03042108501",
            "name": "ចំរើន ភារម្យ"
        },
        {
            "barcode": "171125282",
            "dpc": "03042108701",
            "name": "សាម ចំរ៉ាត់"
        },
        {
            "barcode": "171125283",
            "dpc": "03042108801",
            "name": "ឆាំ ផល្តុន"
        },
        {
            "barcode": "171125284",
            "dpc": "03042108901",
            "name": "ស៊ឹម រ៉ា"
        },
        {
            "barcode": "171125285",
            "dpc": "03042109001",
            "name": "គឹម លី"
        },
        {
            "barcode": "171125286",
            "dpc": "03042109101",
            "name": "ឆាំ ពុទ្ធារ៉ា"
        },
        {
            "barcode": "171125287",
            "dpc": "03042109201",
            "name": "ឯម ប៉ិលប៊ុណ្តាត"
        },
        {
            "barcode": "171125288",
            "dpc": "03042109301",
            "name": "កែម ភី"
        },
        {
            "barcode": "171125289",
            "dpc": "03042109401",
            "name": "វ័ន គឹមស៊ាន"
        },
        {
            "barcode": "171125290",
            "dpc": "03042109501",
            "name": "ហែ សុធា"
        },
        {
            "barcode": "171125291",
            "dpc": "03042109601",
            "name": "ស៊ឹម យ៉ា"
        },
        {
            "barcode": "171125292",
            "dpc": "03042109701",
            "name": "សឹម ម៉ាត់សារុន"
        },
        {
            "barcode": "171125293",
            "dpc": "03042109801",
            "name": "នុត រ៉ា"
        },
        {
            "barcode": "171125294",
            "dpc": "03042109901",
            "name": "ឌុក ឈឿប"
        },
        {
            "barcode": "171125295",
            "dpc": "03042110001",
            "name": "ទីន លក្ឌា"
        },
        {
            "barcode": "171125296",
            "dpc": "03042110101",
            "name": "ឃុំ កាំ"
        },
        {
            "barcode": "171125297",
            "dpc": "03042110201",
            "name": "តោ ណែ"
        },
        {
            "barcode": "171125298",
            "dpc": "03042110301",
            "name": "នឹម សាលី"
        },
        {
            "barcode": "171125299",
            "dpc": "03042110401",
            "name": "សឿន វុបុល"
        },
        {
            "barcode": "171125300",
            "dpc": "03042110501",
            "name": "សឿន សឿត"
        },
        {
            "barcode": "171125301",
            "dpc": "03042110601",
            "name": "យ៉ង់ ដេម"
        },
        {
            "barcode": "171125302",
            "dpc": "03042110701",
            "name": "គុជ ឃឿត"
        },
        {
            "barcode": "171125303",
            "dpc": "03042110801",
            "name": "ទូច សុធី"
        },
        {
            "barcode": "171125304",
            "dpc": "03042110901",
            "name": "សំ ហឿប"
        },
        {
            "barcode": "171125305",
            "dpc": "03042111001",
            "name": "សំ ហឿត"
        },
        {
            "barcode": "171125306",
            "dpc": "03042111101",
            "name": "ប៊ុត ធៀម"
        },
        {
            "barcode": "171125307",
            "dpc": "03042111201",
            "name": "ថាច់ សឿ"
        },
        {
            "barcode": "171125308",
            "dpc": "03042111301",
            "name": "ឡាន ឆាយ"
        },
        {
            "barcode": "171125309",
            "dpc": "03042111401",
            "name": "ស៊ា ស៊ីនួន"
        },
        {
            "barcode": "171125310",
            "dpc": "03042111501",
            "name": "អ៊ឹម គុជ"
        },
        {
            "barcode": "171125311",
            "dpc": "03042111601",
            "name": "ឡុង ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171125312",
            "dpc": "03042111701",
            "name": "ទ្រី ហេង"
        },
        {
            "barcode": "171125313",
            "dpc": "03042111801",
            "name": "នន់ រីវ"
        },
        {
            "barcode": "171125314",
            "dpc": "03042111901",
            "name": "ឯម វិចិត្រ"
        },
        {
            "barcode": "171125315",
            "dpc": "03042112001",
            "name": "សាន ណាវី"
        },
        {
            "barcode": "171125316",
            "dpc": "03042112101",
            "name": "តន់ សុំរ៉ង"
        },
        {
            "barcode": "171125317",
            "dpc": "03042112201",
            "name": "សួម កំសត់"
        },
        {
            "barcode": "171125318",
            "dpc": "03042112301",
            "name": "ថាប់ សឿប"
        },
        {
            "barcode": "171125319",
            "dpc": "03042112401",
            "name": "ប៉ែន ធុល"
        },
        {
            "barcode": "171125320",
            "dpc": "03042112501",
            "name": "ប៉ែន ប៊ុនធឿន"
        },
        {
            "barcode": "171125321",
            "dpc": "03042112601",
            "name": "រ៉ូ រ៉ា"
        },
        {
            "barcode": "171125322",
            "dpc": "03042112701",
            "name": "រ៉ូ ស៊ីមន"
        },
        {
            "barcode": "171125323",
            "dpc": "03042112801",
            "name": "វឿន ទូច"
        },
        {
            "barcode": "171125324",
            "dpc": "03042112901",
            "name": "ហាន ធី"
        },
        {
            "barcode": "171125325",
            "dpc": "03042113001",
            "name": "ស៊ិន ធឿប"
        },
        {
            "barcode": "171125326",
            "dpc": "03042113101",
            "name": "អឿ ពីវ"
        },
        {
            "barcode": "171125327",
            "dpc": "03042113201",
            "name": "សេក សុគន្ធារី"
        },
        {
            "barcode": "171125328",
            "dpc": "03042113301",
            "name": "ផាត់ សុឃឿន"
        },
        {
            "barcode": "171125329",
            "dpc": "03042113501",
            "name": "ថៃ វណ្ណា"
        },
        {
            "barcode": "171125330",
            "dpc": "03042113601",
            "name": "លី គៀតគី"
        },
        {
            "barcode": "171125331",
            "dpc": "03042113801",
            "name": "ហែម រឿប"
        },
        {
            "barcode": "171125332",
            "dpc": "03042113901",
            "name": "ស៊ិន កូយ"
        },
        {
            "barcode": "171125333",
            "dpc": "03042114001",
            "name": "រូប ថា"
        },
        {
            "barcode": "171125334",
            "dpc": "03042114101",
            "name": "ឈួន សាវិន"
        },
        {
            "barcode": "171125335",
            "dpc": "03042114201",
            "name": "ឈឹម បាន"
        },
        {
            "barcode": "171125336",
            "dpc": "03042114301",
            "name": "ប្រាក់ ម៉ន"
        },
        {
            "barcode": "171125337",
            "dpc": "03042114501",
            "name": "ឈឹម សារឿត"
        },
        {
            "barcode": "171125338",
            "dpc": "03042114601",
            "name": "ហួត ហ៊"
        },
        {
            "barcode": "171125339",
            "dpc": "03042114701",
            "name": "រ៉ូ រី"
        },
        {
            "barcode": "171125340",
            "dpc": "03042114801",
            "name": "ស៊ីវ ជឿន"
        },
        {
            "barcode": "171125341",
            "dpc": "03042114901",
            "name": "មួន សុជាតិ"
        },
        {
            "barcode": "171125342",
            "dpc": "03042115001",
            "name": "ហ៊ុល ធៀង"
        },
        {
            "barcode": "171125343",
            "dpc": "03042115101",
            "name": "ប៉ុល សុផាត"
        },
        {
            "barcode": "171125344",
            "dpc": "03042115201",
            "name": "ទ័រ ការីម"
        },
        {
            "barcode": "171125345",
            "dpc": "03042115301",
            "name": "ជា ឃិន"
        },
        {
            "barcode": "171125346",
            "dpc": "03042115401",
            "name": "គ្រៀល ហៀង"
        },
        {
            "barcode": "171125347",
            "dpc": "03042118501",
            "name": "សោ ថងឌី"
        },
        {
            "barcode": "171125348",
            "dpc": "03042118601",
            "name": "ស៊ិន យោប"
        },
        {
            "barcode": "171125349",
            "dpc": "03042118701",
            "name": "មិន សុចាន់"
        },
        {
            "barcode": "171125350",
            "dpc": "03042118801",
            "name": "ស៊ូ ចិន្តា"
        },
        {
            "barcode": "171125351",
            "dpc": "03042119001",
            "name": "លី ម៉ាប់"
        },
        {
            "barcode": "171125352",
            "dpc": "03042119601",
            "name": "សាន់ យ៉ាស់"
        },
        {
            "barcode": "171125353",
            "dpc": "03042119801",
            "name": "ថរ សារ៉េត"
        },
        {
            "barcode": "171125354",
            "dpc": "03042120401",
            "name": "ស សុគន្ធ"
        },
        {
            "barcode": "171125355",
            "dpc": "03042120801",
            "name": "ជៃ រ៉ឺ"
        },
        {
            "barcode": "171125356",
            "dpc": "03042120901",
            "name": "រីម រើន"
        },
        {
            "barcode": "171125357",
            "dpc": "03042121001",
            "name": "នី សាម៉េត"
        },
        {
            "barcode": "171125358",
            "dpc": "03042121101",
            "name": "ទីន អ៊ីសើ"
        },
        {
            "barcode": "171125359",
            "dpc": "03042121201",
            "name": "តាត គឹម"
        },
        {
            "barcode": "171125360",
            "dpc": "03042121301",
            "name": "ឯល ការីម ២"
        },
        {
            "barcode": "171125361",
            "dpc": "03042121401",
            "name": "ឈឿន ឈុំ"
        },
        {
            "barcode": "171125362",
            "dpc": "03042121501",
            "name": "ឡិប អារ៉ាហ្វាត់"
        },
        {
            "barcode": "171125363",
            "dpc": "03042121601",
            "name": "សុប ឡេស"
        },
        {
            "barcode": "171125364",
            "dpc": "03042121801",
            "name": "នាក់ ជា ២"
        },
        {
            "barcode": "171125365",
            "dpc": "03042121901",
            "name": "ស្មាន មូស្កាន"
        },
        {
            "barcode": "171125366",
            "dpc": "03042122001",
            "name": "តឹក អាន"
        },
        {
            "barcode": "171125367",
            "dpc": "03042122101",
            "name": "ឡែម ឃឿត"
        },
        {
            "barcode": "171125368",
            "dpc": "03042122201",
            "name": "ស៊ិន សុធារី"
        },
        {
            "barcode": "171125369",
            "dpc": "03042122301",
            "name": "ឆាត ផត់"
        },
        {
            "barcode": "171125370",
            "dpc": "03042122401",
            "name": "រីម រ៉ុម"
        },
        {
            "barcode": "171125371",
            "dpc": "03042122601",
            "name": "អ៊ុក ប៊ុនធឿន"
        },
        {
            "barcode": "171125372",
            "dpc": "03042122701",
            "name": "ទឹម ហួត"
        },
        {
            "barcode": "171125373",
            "dpc": "03042122801",
            "name": "លិស ឡេត"
        },
        {
            "barcode": "171125374",
            "dpc": "03042122901",
            "name": "វ៉ន សាវី"
        },
        {
            "barcode": "171125375",
            "dpc": "03042123001",
            "name": "ម៉ម រិទ្ធី"
        },
        {
            "barcode": "171125376",
            "dpc": "03042123201",
            "name": "យ៉ាយ ឡូត"
        },
        {
            "barcode": "171125377",
            "dpc": "03042123301",
            "name": "វង់ វឿត"
        },
        {
            "barcode": "171125378",
            "dpc": "03042123401",
            "name": "ហម សុភាព"
        },
        {
            "barcode": "171125379",
            "dpc": "03042123501",
            "name": "ឡូយ វណ្ណា"
        },
        {
            "barcode": "171125380",
            "dpc": "03042123601",
            "name": "ម៉ៅ កំសាន្ត"
        },
        {
            "barcode": "171125381",
            "dpc": "03042123701",
            "name": "ញឹម ច្រៀប"
        },
        {
            "barcode": "171125382",
            "dpc": "03042123801",
            "name": "អ៊ុន ហ៊ីង"
        },
        {
            "barcode": "171125383",
            "dpc": "03042123901",
            "name": "ពត ធី"
        },
        {
            "barcode": "171125384",
            "dpc": "03042124001",
            "name": "សុខ សម្បត្តិ"
        },
        {
            "barcode": "171125385",
            "dpc": "03042124101",
            "name": "ព្រាន សុខ"
        },
        {
            "barcode": "171125386",
            "dpc": "03042124201",
            "name": "ឈឿន ឈុំ ២"
        },
        {
            "barcode": "171125387",
            "dpc": "03042124301",
            "name": "នៅ ស៊ាន"
        },
        {
            "barcode": "171125388",
            "dpc": "03042124401",
            "name": "ផាន ថន"
        },
        {
            "barcode": "171125389",
            "dpc": "03042124501",
            "name": "ម៉ សុផល"
        },
        {
            "barcode": "171125390",
            "dpc": "03042124601",
            "name": "ហាន កក"
        },
        {
            "barcode": "171125391",
            "dpc": "03042124701",
            "name": "ជា មុំ"
        },
        {
            "barcode": "171125392",
            "dpc": "03042124801",
            "name": "គល់ សាវឿន"
        },
        {
            "barcode": "171125393",
            "dpc": "03042124901",
            "name": "ម៉ាក ស៊ីម"
        },
        {
            "barcode": "171125394",
            "dpc": "03042125001",
            "name": "អឿន អឿត"
        },
        {
            "barcode": "171125395",
            "dpc": "03042125101",
            "name": "អឿម អង"
        },
        {
            "barcode": "171125396",
            "dpc": "03042125201",
            "name": "រាជ ថាវរៈ"
        },
        {
            "barcode": "171125397",
            "dpc": "03042125301",
            "name": "ផាន់ វ៉ាន់"
        },
        {
            "barcode": "171125398",
            "dpc": "03042125401",
            "name": "ធៀម គង់ជាតិ"
        },
        {
            "barcode": "171125399",
            "dpc": "03042125501",
            "name": "ជួន សុផល"
        },
        {
            "barcode": "171125400",
            "dpc": "03042125601",
            "name": "លឹម សៀរ"
        },
        {
            "barcode": "171125401",
            "dpc": "03042125701",
            "name": "អ៊ូច រ៉េត"
        },
        {
            "barcode": "171125402",
            "dpc": "03042125801",
            "name": "ស ប៉ាច"
        },
        {
            "barcode": "171125403",
            "dpc": "03042125901",
            "name": "បឿន ភឿត"
        },
        {
            "barcode": "171125404",
            "dpc": "03042126001",
            "name": "អឿន អេង"
        },
        {
            "barcode": "171125405",
            "dpc": "03042126101",
            "name": "ស សារឿន"
        },
        {
            "barcode": "171125406",
            "dpc": "03042126201",
            "name": "យ័ន្ត យ៉ុង"
        },
        {
            "barcode": "171125407",
            "dpc": "03042126401",
            "name": "គង់ សារ៉ៅ"
        },
        {
            "barcode": "171125408",
            "dpc": "03042126501",
            "name": "អ៊ឹម សារម្យ"
        },
        {
            "barcode": "171125409",
            "dpc": "03042126701",
            "name": "អឿន នៅ"
        },
        {
            "barcode": "171125410",
            "dpc": "03042126801",
            "name": "ឆៃ ស៊ុយ"
        },
        {
            "barcode": "171125411",
            "dpc": "03042126901",
            "name": "ឌឿន ដុស"
        },
        {
            "barcode": "171125412",
            "dpc": "03042127001",
            "name": "លុយ សុផល"
        },
        {
            "barcode": "171125413",
            "dpc": "03042127101",
            "name": "ទ្រី ជួរ"
        },
        {
            "barcode": "171125414",
            "dpc": "03042127201",
            "name": "ឃាន សុឃុន"
        },
        {
            "barcode": "171125415",
            "dpc": "03042127301",
            "name": "គាំ រី"
        },
        {
            "barcode": "171125416",
            "dpc": "03042127401",
            "name": "ទី អេង"
        },
        {
            "barcode": "171125417",
            "dpc": "03042127501",
            "name": "អ៊ុង ប៉ូច"
        },
        {
            "barcode": "171125418",
            "dpc": "03042127601",
            "name": "ឡឹក ចាន់ នី"
        },
        {
            "barcode": "171125419",
            "dpc": "03042127701",
            "name": "អ៊ុន ទី"
        },
        {
            "barcode": "171125420",
            "dpc": "03042127901",
            "name": "តាំង ថន"
        },
        {
            "barcode": "171125421",
            "dpc": "03042128001",
            "name": "ហេង ទេវី"
        },
        {
            "barcode": "171125422",
            "dpc": "03042128101",
            "name": "ប៉ោក មុំ"
        },
        {
            "barcode": "171125423",
            "dpc": "03042128201",
            "name": "យឿន យ៉េត"
        },
        {
            "barcode": "171125424",
            "dpc": "03042128401",
            "name": "ដួង ឃុន"
        },
        {
            "barcode": "171125425",
            "dpc": "03042128501",
            "name": "តាន់ ឈីវ"
        },
        {
            "barcode": "171125426",
            "dpc": "03042128601",
            "name": "សុខ អាន"
        },
        {
            "barcode": "171125427",
            "dpc": "03042128701",
            "name": "សិក រឿន"
        },
        {
            "barcode": "171125428",
            "dpc": "03042128801",
            "name": "ម៉ែន រុំ"
        },
        {
            "barcode": "171125429",
            "dpc": "03042128901",
            "name": "ម៉ម យ៉ាន"
        },
        {
            "barcode": "171125430",
            "dpc": "03042129101",
            "name": "ច័ន្ទ សុវណ្ណារិទ្ធ"
        },
        {
            "barcode": "171125431",
            "dpc": "03042129201",
            "name": "លាន លៀង"
        },
        {
            "barcode": "171125432",
            "dpc": "03042129301",
            "name": "យឹម ពៅវឌ្ឍនៈ"
        },
        {
            "barcode": "171125433",
            "dpc": "03042129501",
            "name": "លឹម ចាន់ដារ៉ា"
        },
        {
            "barcode": "171125434",
            "dpc": "03042129601",
            "name": "សា ធឿន"
        },
        {
            "barcode": "171125435",
            "dpc": "03042129801",
            "name": "ញាំ ហ៊ុច"
        },
        {
            "barcode": "171125436",
            "dpc": "03042129901",
            "name": "ណែម រ៉េត"
        },
        {
            "barcode": "171125437",
            "dpc": "03042130001",
            "name": "ត្រឹង សែនសុធី"
        },
        {
            "barcode": "171125438",
            "dpc": "03042130101",
            "name": "មាន សាម៉េត"
        },
        {
            "barcode": "171125439",
            "dpc": "03042130301",
            "name": "ម៉ិ ភីណា"
        },
        {
            "barcode": "171125440",
            "dpc": "03042130401",
            "name": "ឈិត រ៉ែម"
        },
        {
            "barcode": "171125441",
            "dpc": "03042130501",
            "name": "ស្រី សុបិន្ត"
        },
        {
            "barcode": "171125442",
            "dpc": "03042130601",
            "name": "ម៉េត សុភ័ក្រ"
        },
        {
            "barcode": "171125443",
            "dpc": "03042130701",
            "name": "លិម ស៊ុយ"
        },
        {
            "barcode": "171125444",
            "dpc": "03042130801",
            "name": "កែវ មករា"
        },
        {
            "barcode": "171125445",
            "dpc": "03042130901",
            "name": "គង់ សារៀង"
        },
        {
            "barcode": "171125446",
            "dpc": "03042131001",
            "name": "ញុក៉ុ សុផល"
        },
        {
            "barcode": "171125447",
            "dpc": "03042131101",
            "name": "ឌុច ឌួង"
        },
        {
            "barcode": "171125448",
            "dpc": "03042131201",
            "name": "អ៊ី លក់សាច់ជ្រូក"
        },
        {
            "barcode": "171125449",
            "dpc": "03042131301",
            "name": "ឃាន ឃឿន"
        },
        {
            "barcode": "171125450",
            "dpc": "03042131401",
            "name": "យឹម សឿម"
        },
        {
            "barcode": "171125451",
            "dpc": "03042131501",
            "name": "បឿន សឹន"
        },
        {
            "barcode": "171125452",
            "dpc": "03042131601",
            "name": "ជួន ឃិន"
        },
        {
            "barcode": "171125453",
            "dpc": "03042131701",
            "name": "សំ ម៉ាច"
        },
        {
            "barcode": "171125454",
            "dpc": "03042131801",
            "name": "ឌុច ហ៊ល"
        },
        {
            "barcode": "171125455",
            "dpc": "03042131901",
            "name": "ឡាន ប៉ូន"
        },
        {
            "barcode": "171125456",
            "dpc": "03042132101",
            "name": "សូ លន់"
        },
        {
            "barcode": "171125457",
            "dpc": "03042132201",
            "name": "ហួត សុគន្ធា"
        },
        {
            "barcode": "171125458",
            "dpc": "03042132301",
            "name": "ណុប យួន"
        },
        {
            "barcode": "171125459",
            "dpc": "03042132501",
            "name": "ស សំណាង"
        },
        {
            "barcode": "171125460",
            "dpc": "03042132601",
            "name": "មួង ធី"
        },
        {
            "barcode": "171125461",
            "dpc": "03042132701",
            "name": "លឹម លក្ខិណា"
        },
        {
            "barcode": "171125462",
            "dpc": "03042132901",
            "name": "ឡៅ ឡេត"
        },
        {
            "barcode": "171125463",
            "dpc": "03042133101",
            "name": "អ៊ួន ចាន់រួន"
        },
        {
            "barcode": "171125464",
            "dpc": "03042133201",
            "name": "មឿត ណារិន"
        },
        {
            "barcode": "171125465",
            "dpc": "03042133301",
            "name": "សោម សុខា"
        },
        {
            "barcode": "171125466",
            "dpc": "03042133401",
            "name": "ទេព ប៊ុនណ្ណា"
        },
        {
            "barcode": "171125467",
            "dpc": "03042133601",
            "name": "លឹម សុវណ្ណា"
        },
        {
            "barcode": "171125468",
            "dpc": "03042133701",
            "name": "ឡាច លន់"
        },
        {
            "barcode": "171125469",
            "dpc": "03042133801",
            "name": "ស៊ន សង្វាត"
        },
        {
            "barcode": "171125470",
            "dpc": "03042134001",
            "name": "ជេត សាវុន"
        },
        {
            "barcode": "171125471",
            "dpc": "03042134101",
            "name": "សែម សាបើយ"
        },
        {
            "barcode": "171125472",
            "dpc": "03042134201",
            "name": "គល់ សារ៉ុម"
        },
        {
            "barcode": "171125473",
            "dpc": "03042134301",
            "name": "មីន ខ្លឹង"
        },
        {
            "barcode": "171125474",
            "dpc": "03042134401",
            "name": "សាលាបឋមសិក្សានរា"
        },
        {
            "barcode": "171125475",
            "dpc": "03042134501",
            "name": "ស៊ន ចាន់ដារ៉ា"
        },
        {
            "barcode": "171125476",
            "dpc": "03042134601",
            "name": "ពេជ្រ រស្មី"
        },
        {
            "barcode": "171125477",
            "dpc": "03042134701",
            "name": "មីត ស្មាន"
        },
        {
            "barcode": "171125478",
            "dpc": "03042134801",
            "name": "មាស សុខុម"
        },
        {
            "barcode": "171125479",
            "dpc": "03042134901",
            "name": "ឡន សារុំ"
        },
        {
            "barcode": "171125480",
            "dpc": "03042135001",
            "name": "ណុះ ផាត់ទីម៉ាស់"
        },
        {
            "barcode": "171125481",
            "dpc": "03042135101",
            "name": "ស៊ីត សា"
        },
        {
            "barcode": "171125482",
            "dpc": "03042135201",
            "name": "សន មារឌី"
        },
        {
            "barcode": "171125483",
            "dpc": "03042135301",
            "name": "លី កូប"
        },
        {
            "barcode": "171125484",
            "dpc": "03042135401",
            "name": "កែវ ច័ន្ទសុគន្ធា"
        },
        {
            "barcode": "171125485",
            "dpc": "03042135501",
            "name": "នៅ នី"
        },
        {
            "barcode": "171125486",
            "dpc": "03042135601",
            "name": "វ៉ាត សិម៉ឹ"
        },
        {
            "barcode": "171125487",
            "dpc": "03042135701",
            "name": "រ៉ិល សាន់"
        },
        {
            "barcode": "171125488",
            "dpc": "03042135801",
            "name": "កែវ ពៅ"
        },
        {
            "barcode": "171125489",
            "dpc": "03042135901",
            "name": "ជុំ សម្បត្តិ"
        },
        {
            "barcode": "171125490",
            "dpc": "03042136001",
            "name": "ង៉ូវ ជៀប"
        },
        {
            "barcode": "171125491",
            "dpc": "03042136101",
            "name": "លី សុខម៉ី"
        },
        {
            "barcode": "171125492",
            "dpc": "03042136201",
            "name": "សួង សុភាព"
        },
        {
            "barcode": "171125493",
            "dpc": "03042136301",
            "name": "តុង ប៊ុននាង"
        },
        {
            "barcode": "171125494",
            "dpc": "03042136401",
            "name": "អ៊ីត ស្រឡេះ"
        },
        {
            "barcode": "171125495",
            "dpc": "03042136501",
            "name": "អ៊ីណា"
        },
        {
            "barcode": "171125496",
            "dpc": "03042136601",
            "name": "ឡាយ បំរ៉ុង"
        },
        {
            "barcode": "171125497",
            "dpc": "03042136801",
            "name": "ទីន សើហ្វីអ៊ី"
        },
        {
            "barcode": "171125498",
            "dpc": "03042136901",
            "name": "លី គីយ៉ា"
        },
        {
            "barcode": "171125499",
            "dpc": "03042137001",
            "name": "សេន ហ្វាស៊ី"
        },
        {
            "barcode": "171125500",
            "dpc": "03042137101",
            "name": "មីត ម៉ាត់"
        },
        {
            "barcode": "171125501",
            "dpc": "03042137201",
            "name": "ម៉ាត់ សាឡេះ"
        },
        {
            "barcode": "171125502",
            "dpc": "03042137301",
            "name": "ហាំ មូសើ"
        },
        {
            "barcode": "171125503",
            "dpc": "03042137401",
            "name": "កូប សុះ"
        },
        {
            "barcode": "171125504",
            "dpc": "03042137501",
            "name": "ស៊ុន សាវុន"
        },
        {
            "barcode": "171125505",
            "dpc": "03042137601",
            "name": "សុខ សាយ"
        },
        {
            "barcode": "171125506",
            "dpc": "03042137701",
            "name": "ពៅ កង"
        },
        {
            "barcode": "171125507",
            "dpc": "03042137801",
            "name": "យ៉ា យូសុះ"
        },
        {
            "barcode": "171125508",
            "dpc": "03042138101",
            "name": "ម៉ក់ សារ៉ើន"
        },
        {
            "barcode": "171125509",
            "dpc": "03042138201",
            "name": "ទូច សាអ៊ុន"
        },
        {
            "barcode": "171125510",
            "dpc": "03042138301",
            "name": "ឡឹង ស៊្រាន"
        },
        {
            "barcode": "171125511",
            "dpc": "03042138401",
            "name": "សា ម៉ាអាត"
        },
        {
            "barcode": "171125512",
            "dpc": "03042138501",
            "name": "ងួន ផល"
        },
        {
            "barcode": "171125513",
            "dpc": "03042138601",
            "name": "ឱ សាវ៉ាត"
        },
        {
            "barcode": "171125514",
            "dpc": "03042138701",
            "name": "ឆាយ តាំង"
        },
        {
            "barcode": "171125515",
            "dpc": "03042138801",
            "name": "អឿន អាន"
        },
        {
            "barcode": "171125516",
            "dpc": "03042138901",
            "name": "តាន់ ជូឈៀង"
        },
        {
            "barcode": "171125517",
            "dpc": "03042139001",
            "name": "ម៉ៅ គី"
        },
        {
            "barcode": "171125518",
            "dpc": "03042139101",
            "name": "សារ៉ង សុផានី"
        },
        {
            "barcode": "171125519",
            "dpc": "03042139201",
            "name": "ថុល ផារី"
        },
        {
            "barcode": "171125520",
            "dpc": "03042139301",
            "name": "ឈិត ប៊ុនទ្រី"
        },
        {
            "barcode": "171125521",
            "dpc": "03042139401",
            "name": "អឿន សុខ"
        },
        {
            "barcode": "171125522",
            "dpc": "03042139501",
            "name": "ហោ សុវណ្ណ"
        },
        {
            "barcode": "171125523",
            "dpc": "03042139601",
            "name": "លី វណ្ណារ៉ា"
        },
        {
            "barcode": "171125524",
            "dpc": "03042139701",
            "name": "លួន សុថារី"
        },
        {
            "barcode": "171125525",
            "dpc": "03042139801",
            "name": "តាន់ ប្រុស"
        },
        {
            "barcode": "171125526",
            "dpc": "03042139901",
            "name": "ឃុន ម៉ារីយុំ"
        },
        {
            "barcode": "171125527",
            "dpc": "03042140101",
            "name": "ហូ សាន់"
        },
        {
            "barcode": "171125528",
            "dpc": "03042140201",
            "name": "យិន ហួង"
        },
        {
            "barcode": "171125529",
            "dpc": "03042140301",
            "name": "ស៊ិន លន"
        },
        {
            "barcode": "171125530",
            "dpc": "03042140601",
            "name": "ស៊ុន ប៊ុនសុង"
        },
        {
            "barcode": "171125531",
            "dpc": "03042140701",
            "name": "ថោង វណ្ណះ"
        },
        {
            "barcode": "171125532",
            "dpc": "03042140801",
            "name": "ម៉ូត ម៉ាន"
        },
        {
            "barcode": "171125533",
            "dpc": "03042140901",
            "name": "សឿន ហាន"
        },
        {
            "barcode": "171125534",
            "dpc": "03042141001",
            "name": "សុះ តាស់"
        },
        {
            "barcode": "171125535",
            "dpc": "03042141101",
            "name": "សុះ ត្រហៀក"
        },
        {
            "barcode": "171125536",
            "dpc": "03042141201",
            "name": "ហ្វា ហាយ័ត"
        },
        {
            "barcode": "171125537",
            "dpc": "03042141301",
            "name": "រ៉េះ ហាស៊ីណាស់"
        },
        {
            "barcode": "171125538",
            "dpc": "03042141401",
            "name": "ឡិប មូសើ"
        },
        {
            "barcode": "171125539",
            "dpc": "03042141501",
            "name": "ហ៊ីម សាឡេះ"
        },
        {
            "barcode": "171125540",
            "dpc": "03042141701",
            "name": "ពៀន ប៉ូយ"
        },
        {
            "barcode": "171125541",
            "dpc": "03042141801",
            "name": "លី ម៉េង"
        },
        {
            "barcode": "171125542",
            "dpc": "03042141901",
            "name": "រ៉ិល ម៉ាន"
        },
        {
            "barcode": "171125543",
            "dpc": "03042142001",
            "name": "ទារ៍ សារ៉ាត់"
        },
        {
            "barcode": "171125544",
            "dpc": "03042142101",
            "name": "រ៉េស យូសុះ"
        },
        {
            "barcode": "171125545",
            "dpc": "03042142201",
            "name": "លី សំរ៉ស់"
        },
        {
            "barcode": "171125546",
            "dpc": "03042142301",
            "name": "ស្លេស ស្មាអែល"
        },
        {
            "barcode": "171125547",
            "dpc": "03042142401",
            "name": "នួន សារ៉េន"
        },
        {
            "barcode": "171125548",
            "dpc": "03042142501",
            "name": "ម៉ាត់ ហាំលី"
        },
        {
            "barcode": "171125549",
            "dpc": "03042142701",
            "name": "ផាន ផាន់"
        },
        {
            "barcode": "171125550",
            "dpc": "03042142901",
            "name": "ម៉ូត សារុន"
        },
        {
            "barcode": "171125551",
            "dpc": "03042143001",
            "name": "ស៊ូ ហ្វីយ៉ាន"
        },
        {
            "barcode": "171125552",
            "dpc": "03042143101",
            "name": "ឡោះ សាត"
        },
        {
            "barcode": "171125553",
            "dpc": "03042143301",
            "name": "សើ សាត"
        },
        {
            "barcode": "171125554",
            "dpc": "03042143501",
            "name": "ស្វាយ យ៉ិន"
        },
        {
            "barcode": "171125555",
            "dpc": "03042143601",
            "name": "ហ្វាស់ មាត់លី"
        },
        {
            "barcode": "171125556",
            "dpc": "03042143701",
            "name": "សេន ម៉ារី"
        },
        {
            "barcode": "171125557",
            "dpc": "03042143801",
            "name": "រេត សាហ៊ី្វ"
        },
        {
            "barcode": "171125558",
            "dpc": "03042143901",
            "name": "ហ៊ី្វ ហ្វៀស"
        },
        {
            "barcode": "171125559",
            "dpc": "03042144001",
            "name": "ទីន ប្រុស"
        },
        {
            "barcode": "171125560",
            "dpc": "03042144201",
            "name": "ឈឿត ម៉ាត់"
        },
        {
            "barcode": "171125561",
            "dpc": "03042144301",
            "name": "យ៉ុន សេន"
        },
        {
            "barcode": "171125562",
            "dpc": "03042144401",
            "name": "ឡឹប វណ្ណា"
        },
        {
            "barcode": "171125563",
            "dpc": "03042144501",
            "name": "ហ្វាស់ រ៉ស៊ីឌី"
        },
        {
            "barcode": "171125564",
            "dpc": "03042144601",
            "name": "ឯល ណាន"
        },
        {
            "barcode": "171125565",
            "dpc": "03042144701",
            "name": "ម៉ាត់ ស៊ីណាត"
        },
        {
            "barcode": "171125566",
            "dpc": "03042144901",
            "name": "ម៉ីន យូសុះ"
        },
        {
            "barcode": "171125567",
            "dpc": "03042145001",
            "name": "សុះ សារ៉ន"
        },
        {
            "barcode": "171125568",
            "dpc": "03042145101",
            "name": "ស៊ឹម ហែមី"
        },
        {
            "barcode": "171125569",
            "dpc": "03042145201",
            "name": "យ៉ើ កាម៉ារីយ៉ាស់"
        },
        {
            "barcode": "171125570",
            "dpc": "03042145301",
            "name": "សឹម ហាំម៉ាស់"
        },
        {
            "barcode": "171125571",
            "dpc": "03042145401",
            "name": "ម៉ូត ម៉ាន"
        },
        {
            "barcode": "171125572",
            "dpc": "03042145501",
            "name": "លី សេត"
        },
        {
            "barcode": "171125573",
            "dpc": "03042145601",
            "name": "មីន កល្លី"
        },
        {
            "barcode": "171125574",
            "dpc": "03042145701",
            "name": "ឃ្លីន ម៉ារីយ៉ាន"
        },
        {
            "barcode": "171125575",
            "dpc": "03042145801",
            "name": "ឡេះ សើ"
        },
        {
            "barcode": "171125576",
            "dpc": "03042145901",
            "name": "ឡោះ ហាំ"
        },
        {
            "barcode": "171125577",
            "dpc": "03042146001",
            "name": "ឯល អ៊ីសា"
        },
        {
            "barcode": "171125578",
            "dpc": "03042146101",
            "name": "ទូ ឡោះយ៉ាន"
        },
        {
            "barcode": "171125579",
            "dpc": "03042146201",
            "name": "ស្លេះ សាលីម"
        },
        {
            "barcode": "171125580",
            "dpc": "03042146301",
            "name": "ផេង ឡា"
        },
        {
            "barcode": "171125581",
            "dpc": "03042146401",
            "name": "វ៉ន សុផា"
        },
        {
            "barcode": "171125582",
            "dpc": "03042146501",
            "name": "សុះ យ៉ានី"
        },
        {
            "barcode": "171125583",
            "dpc": "03042146601",
            "name": "អែល សាវីវ៉ាន់ហ្ស៊េន"
        },
        {
            "barcode": "171125584",
            "dpc": "03042146701",
            "name": "សឹម រ៉សេត"
        },
        {
            "barcode": "171125585",
            "dpc": "03042146801",
            "name": "យ៉ាន់ ណូ"
        },
        {
            "barcode": "171125586",
            "dpc": "03042146901",
            "name": "ម៉ាន កាទ័រ"
        },
        {
            "barcode": "171125587",
            "dpc": "03042147001",
            "name": "ឯល ម៉ាស់"
        },
        {
            "barcode": "171125588",
            "dpc": "03042147101",
            "name": "សុះ ណាគាត"
        },
        {
            "barcode": "171125589",
            "dpc": "03042147201",
            "name": "លី ស្មាន"
        },
        {
            "barcode": "171125590",
            "dpc": "03042147301",
            "name": "ម៉ៅ ឡេះ"
        },
        {
            "barcode": "171125591",
            "dpc": "03042147401",
            "name": "ម៉ូត ម៉ាន"
        },
        {
            "barcode": "171125592",
            "dpc": "03042147501",
            "name": "ជា ផល្លា"
        },
        {
            "barcode": "171125593",
            "dpc": "03042147601",
            "name": "អ៊ុំ ស្រីមុំ"
        },
        {
            "barcode": "171125594",
            "dpc": "03042147701",
            "name": "រុន ហ្វាត់"
        },
        {
            "barcode": "171125595",
            "dpc": "03042147801",
            "name": "យ៉ា រំម្លី"
        },
        {
            "barcode": "171125596",
            "dpc": "03042147901",
            "name": "រ៉េះ កាណាឌី"
        },
        {
            "barcode": "171125597",
            "dpc": "03042148001",
            "name": "លី រ៉ស៊ី"
        }
    ]
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
