let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=

    [
        {
            "barcode": "171130144",
            "dpc": "03052200401",
            "name": "សណ្ឋាគាររ៉ូយ៉ាល់"
        },
        {
            "barcode": "171130145",
            "dpc": "03052200501",
            "name": "សណ្ឋាគាររ៉ូយ៉ាល់"
        },
        {
            "barcode": "171130146",
            "dpc": "03052200701",
            "name": "សណ្ឋាគារអន្តរជាតិ"
        },
        {
            "barcode": "171130147",
            "dpc": "03052200801",
            "name": "សណ្ឋាគារតេអូ"
        },
        {
            "barcode": "171130148",
            "dpc": "03052200901",
            "name": "សណ្ឋាគារតេអូ"
        },
        {
            "barcode": "171130149",
            "dpc": "03052201001",
            "name": "គ្លីនិកបាត់ដំបង"
        },
        {
            "barcode": "171130150",
            "dpc": "03052201101",
            "name": "ផ្ទះ.សំណាក់មនោរម្យ"
        },
        {
            "barcode": "171130151",
            "dpc": "03052201201",
            "name": "ភោជនីយដ្ឋានសប្បាយណាស់"
        },
        {
            "barcode": "171130152",
            "dpc": "03052201301",
            "name": "សួន សារុន ត្បូងវត្តសង្កែ"
        },
        {
            "barcode": "171130153",
            "dpc": "03052201501",
            "name": "ប៊ុត គឹមស៊ាន"
        },
        {
            "barcode": "171130154",
            "dpc": "03052201601",
            "name": "យ៉ម ចំរើន ១"
        },
        {
            "barcode": "171130155",
            "dpc": "03052201701",
            "name": "វែង  ស៊្រុន ៣"
        },
        {
            "barcode": "171130156",
            "dpc": "03052201801",
            "name": "សុខ សុខុន  ពន្ឋនាគារ"
        },
        {
            "barcode": "171130157",
            "dpc": "03052201901",
            "name": "រោងចក្រអគ្គិសនី(ក្រោមសាតូដូ)"
        },
        {
            "barcode": "171130158",
            "dpc": "03052202001",
            "name": "រោងចក្រអគ្គិសនី ២"
        },
        {
            "barcode": "171130159",
            "dpc": "03052202101",
            "name": "មណ្ឌលកុមារកំព្រា SOS"
        },
        {
            "barcode": "171130160",
            "dpc": "03052202201",
            "name": "យ៉ម ចំរើន ១"
        },
        {
            "barcode": "171130161",
            "dpc": "03052202301",
            "name": "អាជីវកម្មទឹកបរិសុទ្ធបន្ទាយស្រី"
        },
        {
            "barcode": "171130162",
            "dpc": "03052202401",
            "name": "សមាគមជនជាតិចិនលាងហួ"
        },
        {
            "barcode": "171130163",
            "dpc": "03052202501",
            "name": "លឹម ឆាយ ១"
        },
        {
            "barcode": "171130164",
            "dpc": "03052202601",
            "name": "សាខាគយនិងរដ្ឋាករខេត្ត"
        },
        {
            "barcode": "171130165",
            "dpc": "03052202701",
            "name": "អង្គការ ឃែ រំចេក៤"
        },
        {
            "barcode": "171130166",
            "dpc": "03052202801",
            "name": "សណ្ឋាគារ វិមានមាស"
        },
        {
            "barcode": "171130167",
            "dpc": "03052202901",
            "name": "តែ តៃលី ផ្សារលើ"
        },
        {
            "barcode": "171130168",
            "dpc": "03052203001",
            "name": "អ៊ុន ម៉េង​ សណ្ឋាគារអាស៊ី"
        },
        {
            "barcode": "171130169",
            "dpc": "03052203101",
            "name": "ស្ថានអគ្គកុងស៊ុលវៀតណាម"
        },
        {
            "barcode": "171130170",
            "dpc": "03052203201",
            "name": "ហម ចិត្រ"
        },
        {
            "barcode": "171130171",
            "dpc": "03052203301",
            "name": "ឃឹម វុទ្ធី"
        },
        {
            "barcode": "171130172",
            "dpc": "03052203501",
            "name": "ប្រព័ន្ធទឹកចូលផ្សារណាត់"
        },
        {
            "barcode": "171130173",
            "dpc": "03052203601",
            "name": "ស៊ុន សារ៉េត"
        },
        {
            "barcode": "171130174",
            "dpc": "03052203701",
            "name": "យ៉ាន បូផៃ សាច់អាំង២"
        },
        {
            "barcode": "171130175",
            "dpc": "03052203801",
            "name": "សុខ សុខុន ពីស៊ីនទឹក"
        },
        {
            "barcode": "171130176",
            "dpc": "03052203901",
            "name": "សៀ ស៊ិន"
        },
        {
            "barcode": "171130177",
            "dpc": "03052204001",
            "name": "អាហារដ្ឋានសន្តិភាព"
        },
        {
            "barcode": "171130178",
            "dpc": "03052204101",
            "name": "ឡេន រ៉ា លក់ពោះគោ២កន្លៈ"
        },
        {
            "barcode": "171130179",
            "dpc": "03052204201",
            "name": "ងួន ហួត (ថៃលី)"
        },
        {
            "barcode": "171130180",
            "dpc": "03052204301",
            "name": "ឈុន លីម"
        },
        {
            "barcode": "171130181",
            "dpc": "03052204401",
            "name": "ជា ថូន ផ្លូវលេខ៣"
        },
        {
            "barcode": "171130182",
            "dpc": "03052204501",
            "name": "ភោជនីយដ្ឋាន សួនយុវ័ន"
        },
        {
            "barcode": "171130183",
            "dpc": "03052204601",
            "name": "ទាន់សម័យម៉ាស្សាខារ៉ាអូខេ"
        },
        {
            "barcode": "171130184",
            "dpc": "03052204701",
            "name": "ទូច   លាងខេង"
        },
        {
            "barcode": "171130185",
            "dpc": "03052204801",
            "name": "ពៅ គឹមហាន(លក់គុយទាវ)"
        },
        {
            "barcode": "171130186",
            "dpc": "03052204901",
            "name": "ជឹម  ចំណាន(ឥន្ទ្រីយ៍មាស)"
        },
        {
            "barcode": "171130187",
            "dpc": "03052205001",
            "name": "អ៊ុយ លីវ(ប្រេងឥន្ទនៈឡាអេ)"
        },
        {
            "barcode": "171130188",
            "dpc": "03052205101",
            "name": "ហាក់ ឡេង(លក់គុយទាវឡាអេ)"
        },
        {
            "barcode": "171130189",
            "dpc": "03052205201",
            "name": "អាជីវកម្មសាណាត់២ (សេងហ៊ួ)"
        },
        {
            "barcode": "171130190",
            "dpc": "03052205301",
            "name": "ផិត ផៃណុង"
        },
        {
            "barcode": "171130191",
            "dpc": "03052205401",
            "name": "ណៃ គឹមសុន ប៉ៃលិន"
        },
        {
            "barcode": "171130192",
            "dpc": "03052205501",
            "name": "សោម  សាឃឿង"
        },
        {
            "barcode": "171130193",
            "dpc": "03052205601",
            "name": "សឿ រតនា"
        },
        {
            "barcode": "171130194",
            "dpc": "03052205701",
            "name": "ស្ថានីយ៏ តូតាល់"
        },
        {
            "barcode": "171130195",
            "dpc": "03052205801",
            "name": "ឃន ណារិទ្ធ"
        },
        {
            "barcode": "171130196",
            "dpc": "03052205901",
            "name": "សណ្ឋាគារស្តារ អ៊ុន ផល្លា"
        },
        {
            "barcode": "171130197",
            "dpc": "03052206001",
            "name": "សណ្ឋាគារ ឃីង"
        },
        {
            "barcode": "171130198",
            "dpc": "03052206101",
            "name": "ឡេង ហេង(សណ្ឋាគារ)"
        },
        {
            "barcode": "171130199",
            "dpc": "03052206201",
            "name": "វិច តូរីយ៉ា(សណ្ឋាគារ)"
        },
        {
            "barcode": "171130200",
            "dpc": "03052206301",
            "name": "ប៊ុន ពៅ រតនៈ(សណ្ឋាគារ)"
        },
        {
            "barcode": "171130201",
            "dpc": "03052206401",
            "name": "ជុក គឹមហ៊ាប់"
        },
        {
            "barcode": "171130202",
            "dpc": "03052206601",
            "name": "ហូ លីដេ(ផ្ទះសំណាក់)"
        },
        {
            "barcode": "171130203",
            "dpc": "03052206701",
            "name": "គុយ ទ្រី"
        },
        {
            "barcode": "171130204",
            "dpc": "03052206801",
            "name": "សោ ថាលី  កូលាបស"
        },
        {
            "barcode": "171130205",
            "dpc": "03052206901",
            "name": "ង៉ែត សុគន្ធ   (លក់បាយ )"
        },
        {
            "barcode": "171130206",
            "dpc": "03052207001",
            "name": "ប៉ោ  វណ្ណះ ១"
        },
        {
            "barcode": "171130207",
            "dpc": "03052207101",
            "name": "វត្តពោវាល"
        },
        {
            "barcode": "171130208",
            "dpc": "03052207201",
            "name": "ស៊ុន  ប៊ុនតារា(ផ្សារលើ)"
        },
        {
            "barcode": "171130209",
            "dpc": "03052207301",
            "name": "ប្រេង តេលា"
        },
        {
            "barcode": "171130210",
            "dpc": "03052207401",
            "name": "ជា  ពលរិទ្ធ    ខារ៉ាអូឃេ"
        },
        {
            "barcode": "171130211",
            "dpc": "03052207501",
            "name": "ឃេ អូ  ភោជនីយដ្ឋាន"
        },
        {
            "barcode": "171130212",
            "dpc": "03052207601",
            "name": "ហួន ហៀង  ភោជនីយដ្ឋានអាស៊ានបៀរ"
        },
        {
            "barcode": "171130213",
            "dpc": "03052207701",
            "name": "ជឹម  ពៅ"
        },
        {
            "barcode": "171130214",
            "dpc": "03052207901",
            "name": "ឡុង សុធី  ភោជនីយដ្ឋាន"
        },
        {
            "barcode": "171130215",
            "dpc": "03052208001",
            "name": "ម៉ៅ ហួរ  បណ្តុះសណ្តែក"
        },
        {
            "barcode": "171130216",
            "dpc": "03052208101",
            "name": "នូវ សាវុធ មៃមៃ ភោជនីយដ្ឋាន"
        },
        {
            "barcode": "171130217",
            "dpc": "03052208201",
            "name": "វី  ឆែ"
        },
        {
            "barcode": "171130218",
            "dpc": "03052208301",
            "name": "ញ៉ែម វណ្ណា  លាង ឡាន"
        },
        {
            "barcode": "171130219",
            "dpc": "03052208401",
            "name": "ម៉ៅ សេងថៃ   ភរំចេក៤"
        },
        {
            "barcode": "171130220",
            "dpc": "03052208501",
            "name": "សណ្ឋាគារ បាណន់"
        },
        {
            "barcode": "171130221",
            "dpc": "03052208601",
            "name": "យូ ចាន់ទី"
        },
        {
            "barcode": "171130222",
            "dpc": "03052208801",
            "name": "ផ្សារ ក្រណាត់ បឹងឈូក"
        },
        {
            "barcode": "171130223",
            "dpc": "03052208901",
            "name": "ព្រៈវិហារកាតូលិក ១"
        },
        {
            "barcode": "171130224",
            "dpc": "03052209001",
            "name": "គីម វែង  លាង ឡាន"
        },
        {
            "barcode": "171130225",
            "dpc": "03052209101",
            "name": "យ៉ុន តូរ៉ាត់ ឃេអូរ"
        },
        {
            "barcode": "171130226",
            "dpc": "03052209201",
            "name": "ស៊ីន ឃន   (សាច់គោអាំង )"
        },
        {
            "barcode": "171130227",
            "dpc": "03052209301",
            "name": "សមាគមគុយទាវ"
        },
        {
            "barcode": "171130228",
            "dpc": "03052209401",
            "name": "វិញ  សាន់"
        },
        {
            "barcode": "171130229",
            "dpc": "03052209501",
            "name": "នរោត្តម ចក្រាវុធ"
        },
        {
            "barcode": "171130230",
            "dpc": "03052209601",
            "name": "ណា ណៃ"
        },
        {
            "barcode": "171130231",
            "dpc": "03052209801",
            "name": "ឯ.ឧ. ងិន ឃន ៣"
        },
        {
            "barcode": "171130232",
            "dpc": "03052209901",
            "name": "ជ្រិន ញ៉"
        },
        {
            "barcode": "171130233",
            "dpc": "03052210001",
            "name": "សកលវិទ្យាល័យ ប្រជាជាតិ"
        },
        {
            "barcode": "171130234",
            "dpc": "03052210101",
            "name": "អា  មួយ"
        },
        {
            "barcode": "171130235",
            "dpc": "03052210201",
            "name": "កែវ វ៉ាន់ទី"
        },
        {
            "barcode": "171130236",
            "dpc": "03052210301",
            "name": "សណ្នាគារ ជយ័ជំនៈ"
        },
        {
            "barcode": "171130237",
            "dpc": "03052210401",
            "name": "ខៀវ ផុន"
        },
        {
            "barcode": "171130238",
            "dpc": "03052210501",
            "name": "នូ ណូរ៉ា"
        },
        {
            "barcode": "171130239",
            "dpc": "03052210601",
            "name": "ថាច់ សង្វាត"
        },
        {
            "barcode": "171130240",
            "dpc": "03052210701",
            "name": "គឹម សារី"
        },
        {
            "barcode": "171130241",
            "dpc": "03052210801",
            "name": "ចំណតរថយន្ត"
        },
        {
            "barcode": "171130242",
            "dpc": "03052210901",
            "name": "ប៊ុន សេង (គ្លីនិកសុខភាព)"
        },
        {
            "barcode": "171130243",
            "dpc": "03052211001",
            "name": "សុខ  សុខុម"
        },
        {
            "barcode": "171130244",
            "dpc": "03052211101",
            "name": "ផ្សារលក់ត្រី"
        },
        {
            "barcode": "171130245",
            "dpc": "03052211201",
            "name": "ជា   សង្វាសេរីវឌ្ឍន៏"
        },
        {
            "barcode": "171130246",
            "dpc": "03052211301",
            "name": "ព្រៈវិហារកាតូលិក ២"
        },
        {
            "barcode": "171130247",
            "dpc": "03052211401",
            "name": "អ៊ី ផេង"
        },
        {
            "barcode": "171130248",
            "dpc": "03052211501",
            "name": "វែង ស៊្រុន"
        },
        {
            "barcode": "171130249",
            "dpc": "03052211601",
            "name": "អេង ពេញ"
        },
        {
            "barcode": "171130250",
            "dpc": "03052211701",
            "name": "គង់ យឿម ផ្ទ.  ក.  ភ."
        },
        {
            "barcode": "171130251",
            "dpc": "03052211901",
            "name": "ប៊ុន សេង ១"
        },
        {
            "barcode": "171130252",
            "dpc": "03052212001",
            "name": "អង្កការ អេ អ អឹម"
        },
        {
            "barcode": "171130253",
            "dpc": "03052212101",
            "name": "គិត   រ៉ាវី"
        },
        {
            "barcode": "171130254",
            "dpc": "03052212201",
            "name": "ហេង យាន (ហាងអ៊ិចហ្គោល )"
        },
        {
            "barcode": "171130255",
            "dpc": "03052212301",
            "name": "ផ្ទះ.សំណាក់ភ្នំខៀវ"
        },
        {
            "barcode": "171130256",
            "dpc": "03052212401",
            "name": "សំ  កុល"
        },
        {
            "barcode": "171130257",
            "dpc": "03052212501",
            "name": "សេង សុម៉ាឡៃ (ខារាអូខេហេបភី )"
        },
        {
            "barcode": "171130258",
            "dpc": "03052212601",
            "name": "ណង  ណារ័ត្ន"
        },
        {
            "barcode": "171130259",
            "dpc": "03052212701",
            "name": "លឹម ភិចហួរ"
        },
        {
            "barcode": "171130260",
            "dpc": "03052212801",
            "name": "លឹម ឆាយ ២"
        },
        {
            "barcode": "171130261",
            "dpc": "03052212901",
            "name": "លឹម ឆាយ ៣"
        },
        {
            "barcode": "171130262",
            "dpc": "03052213001",
            "name": "លឹម ឆាយ ៤"
        },
        {
            "barcode": "171130263",
            "dpc": "03052213101",
            "name": "ជី អែស ធី"
        },
        {
            "barcode": "171130264",
            "dpc": "03052213201",
            "name": "ហួន សាយ"
        },
        {
            "barcode": "171130265",
            "dpc": "03052213301",
            "name": "ក្រុម ជុំនុំ ប៊ី អែស ធី"
        },
        {
            "barcode": "171130266",
            "dpc": "03052213401",
            "name": "អេង សុខនេត"
        },
        {
            "barcode": "171130267",
            "dpc": "03052213501",
            "name": "រស់ សារ៉ន"
        },
        {
            "barcode": "171130268",
            "dpc": "03052213601",
            "name": "លឹម  ឈួងសៀ"
        },
        {
            "barcode": "171130269",
            "dpc": "03052213701",
            "name": "យ៉ា សារឿន"
        },
        {
            "barcode": "171130270",
            "dpc": "03052213801",
            "name": "រស់ ពិសិដ្ឋ"
        },
        {
            "barcode": "171130271",
            "dpc": "03052213901",
            "name": "វែង ស៊្រុន ២"
        },
        {
            "barcode": "171130272",
            "dpc": "03052214001",
            "name": "រិន វិសាល ១"
        },
        {
            "barcode": "171130273",
            "dpc": "03052214101",
            "name": "ស៊ិន ហួរ"
        },
        {
            "barcode": "171130274",
            "dpc": "03052214201",
            "name": "ហែម សុធា"
        },
        {
            "barcode": "171130275",
            "dpc": "03052214301",
            "name": "សាលារៀន យូ.អ៊ឹម.អ៊ី"
        },
        {
            "barcode": "171130276",
            "dpc": "03052214401",
            "name": "គឹម សុខ"
        },
        {
            "barcode": "171130277",
            "dpc": "03052214501",
            "name": "ការ៉ាស់សាំង តេលា (អន្លង់វិល )"
        },
        {
            "barcode": "171130278",
            "dpc": "03052214601",
            "name": "កុមារឥតព្រំដែន"
        },
        {
            "barcode": "171130279",
            "dpc": "03052214701",
            "name": "ហុង ឆាយ"
        },
        {
            "barcode": "171130280",
            "dpc": "03052214801",
            "name": "ហៃ ភួង"
        },
        {
            "barcode": "171130281",
            "dpc": "03052214901",
            "name": "អ៊ារ ថៃភួង"
        },
        {
            "barcode": "171130282",
            "dpc": "03052215001",
            "name": "វិទ្យាល័យបៀលប្រាយ ១"
        },
        {
            "barcode": "171130283",
            "dpc": "03052215101",
            "name": "កូវ ជីងប៊ុង"
        },
        {
            "barcode": "171130284",
            "dpc": "03052215201",
            "name": "សួន ឆៀត (ស្ទួន២៣ )"
        },
        {
            "barcode": "171130285",
            "dpc": "03052215301",
            "name": "ធា   លឹម"
        },
        {
            "barcode": "171130286",
            "dpc": "03052215401",
            "name": "សត្តឃាត"
        },
        {
            "barcode": "171130287",
            "dpc": "03052215501",
            "name": "សំ   គីម ២"
        },
        {
            "barcode": "171130288",
            "dpc": "03052215601",
            "name": "ព្រឿន  សឿត"
        },
        {
            "barcode": "171130289",
            "dpc": "03052215701",
            "name": "អ៊ុត   មួយ ១"
        },
        {
            "barcode": "171130290",
            "dpc": "03052215801",
            "name": "អ៊ុត   មួយ ២"
        },
        {
            "barcode": "171130291",
            "dpc": "03052215901",
            "name": "ថាំ   ស៊ុនថូ"
        },
        {
            "barcode": "171130292",
            "dpc": "03052216001",
            "name": "វែង   សុផល"
        },
        {
            "barcode": "171130293",
            "dpc": "03052216101",
            "name": "ប៉ា   សុជាតិវង្ស"
        },
        {
            "barcode": "171130294",
            "dpc": "03052216301",
            "name": "ចាន់   សម្ជស្ស"
        },
        {
            "barcode": "171130295",
            "dpc": "03052216401",
            "name": "តាំង  ជុងខេង"
        },
        {
            "barcode": "171130296",
            "dpc": "03052216501",
            "name": "ឡូ   សុផល"
        },
        {
            "barcode": "171130297",
            "dpc": "03052216601",
            "name": "សាប៊ូ  អូហ្សាណូ"
        },
        {
            "barcode": "171130298",
            "dpc": "03052216701",
            "name": "នក់   ម៉ង់"
        },
        {
            "barcode": "171130299",
            "dpc": "03052216801",
            "name": "សយ បូរ៉ា"
        },
        {
            "barcode": "171130300",
            "dpc": "03052216901",
            "name": "ហ៊ុយុ ហេង"
        },
        {
            "barcode": "171130301",
            "dpc": "03052217101",
            "name": "ហុង  សារិន"
        },
        {
            "barcode": "171130302",
            "dpc": "03052217201",
            "name": "ឌុក អៀក"
        },
        {
            "barcode": "171130303",
            "dpc": "03052217301",
            "name": "សួន  សុខន"
        },
        {
            "barcode": "171130304",
            "dpc": "03052217401",
            "name": "សេរី ចរិយា ១"
        },
        {
            "barcode": "171130305",
            "dpc": "03052217501",
            "name": "សេរី ចរិយា ២"
        },
        {
            "barcode": "171130306",
            "dpc": "03052217601",
            "name": "ណៃ គឹមសុន ២"
        },
        {
            "barcode": "171130307",
            "dpc": "03052217701",
            "name": "សេង សុទ្ធី"
        },
        {
            "barcode": "171130308",
            "dpc": "03052217801",
            "name": "មាស សុភាព"
        },
        {
            "barcode": "171130309",
            "dpc": "03052217901",
            "name": "ប៊ន សោ ភ័ណ"
        },
        {
            "barcode": "171130310",
            "dpc": "03052218101",
            "name": "វិទ្យាល័យបៀលប្រាយ ២"
        },
        {
            "barcode": "171130311",
            "dpc": "03052218201",
            "name": "ងិន ឃន ១"
        },
        {
            "barcode": "171130312",
            "dpc": "03052218301",
            "name": "ងិន ឃន ៤"
        },
        {
            "barcode": "171130313",
            "dpc": "03052218401",
            "name": "ងិន ឃន ៥"
        },
        {
            "barcode": "171130314",
            "dpc": "03052218501",
            "name": "ងិន ឃន ៦"
        },
        {
            "barcode": "171130315",
            "dpc": "03052218601",
            "name": "យ៉ម   ចំរើន ៤"
        },
        {
            "barcode": "171130316",
            "dpc": "03052218701",
            "name": "សណ្ឋាគារស្ទឹងសង្កែ"
        },
        {
            "barcode": "171130317",
            "dpc": "03052218801",
            "name": "ហេង លាប"
        },
        {
            "barcode": "171130318",
            "dpc": "03052218901",
            "name": "វ៉ាន់  ហម"
        },
        {
            "barcode": "171130319",
            "dpc": "03052219001",
            "name": "រស់ យាន"
        },
        {
            "barcode": "171130320",
            "dpc": "03052219101",
            "name": "ភោជនីយដ្ឋាន វិមានរៀម"
        },
        {
            "barcode": "171130321",
            "dpc": "03052219301",
            "name": "សួន  រើន"
        },
        {
            "barcode": "171130322",
            "dpc": "03052219401",
            "name": "លឹម  ទៀហេង"
        },
        {
            "barcode": "171130323",
            "dpc": "03052219501",
            "name": "បេង  ភី ១"
        },
        {
            "barcode": "171130324",
            "dpc": "03052219601",
            "name": "កាកបាទក្រហម"
        },
        {
            "barcode": "171130325",
            "dpc": "03052219701",
            "name": "ប៊ុន  សេង ២"
        },
        {
            "barcode": "171130326",
            "dpc": "03052219801",
            "name": "តូ  មិត"
        },
        {
            "barcode": "171130327",
            "dpc": "03052219901",
            "name": "ហេង តុលា"
        },
        {
            "barcode": "171130328",
            "dpc": "03052220101",
            "name": "តូតាល់អន្លងវិល"
        },
        {
            "barcode": "171130329",
            "dpc": "03052220201",
            "name": "សាឌុន  សារិទ្ធ"
        },
        {
            "barcode": "171130330",
            "dpc": "03052220301",
            "name": "ជាម ចាន់សោភ័ណ"
        },
        {
            "barcode": "171130331",
            "dpc": "03052220401",
            "name": "ម៉ៅ  អេង"
        },
        {
            "barcode": "171130332",
            "dpc": "03052220501",
            "name": "ឡុង  សុធី ២"
        },
        {
            "barcode": "171130333",
            "dpc": "03052220601",
            "name": "ហត្ថ  ធី"
        },
        {
            "barcode": "171130334",
            "dpc": "03052220701",
            "name": "យិន  គិតឡេង"
        },
        {
            "barcode": "171130335",
            "dpc": "03052220901",
            "name": "អ៊ឹង  គឹមលី"
        },
        {
            "barcode": "171130336",
            "dpc": "03052221001",
            "name": "មាស ចាន់ធឿន"
        },
        {
            "barcode": "171130337",
            "dpc": "03052221101",
            "name": "រី  រឿន"
        },
        {
            "barcode": "171130338",
            "dpc": "03052221201",
            "name": "ណាំ  ទុំ (រ៉ាក់ )"
        },
        {
            "barcode": "171130339",
            "dpc": "03052221301",
            "name": "ហួយ ចន្ធី"
        },
        {
            "barcode": "171130340",
            "dpc": "03052221401",
            "name": "រាជ  សុវណ្ណារិទ្ធ (ហូលីដេ ២ )"
        },
        {
            "barcode": "171130341",
            "dpc": "03052221501",
            "name": "អ៊ឹង  គីរីរ័ត្ន"
        },
        {
            "barcode": "171130342",
            "dpc": "03052221601",
            "name": "ប៉ាត់  ផលបុត្រ"
        },
        {
            "barcode": "171130343",
            "dpc": "03052221701",
            "name": "ប៊ុន  សុវណ្ណ"
        },
        {
            "barcode": "171130344",
            "dpc": "03052221801",
            "name": "យន់  ណូរ៉ាត"
        },
        {
            "barcode": "171130345",
            "dpc": "03052221901",
            "name": "ង៉ូវ  វែងហុក"
        },
        {
            "barcode": "171130346",
            "dpc": "03052222001",
            "name": "ខេមរាបាត់ដំបង ១"
        },
        {
            "barcode": "171130347",
            "dpc": "03052222101",
            "name": "ខេមរាបាត់ដំបង ២"
        },
        {
            "barcode": "171130348",
            "dpc": "03052222201",
            "name": "រាត្រីស្ទឹងសង្គែ"
        },
        {
            "barcode": "171130349",
            "dpc": "03052222301",
            "name": "អាហារដ្ឋានរីករាយ"
        },
        {
            "barcode": "171130350",
            "dpc": "03052222401",
            "name": "ប៉ោ  វណ្ណះ"
        },
        {
            "barcode": "171130351",
            "dpc": "03052222501",
            "name": "ចាន់  ធី"
        },
        {
            "barcode": "171130352",
            "dpc": "03052222601",
            "name": "សុខ  រ៉ាថន (ការ៉ាស់សាំង សូគីម៉ិច  )"
        },
        {
            "barcode": "171130353",
            "dpc": "03052222701",
            "name": "ឈឹម  ស៊ួ"
        },
        {
            "barcode": "171130354",
            "dpc": "03052222801",
            "name": "មឹក  ហេង"
        },
        {
            "barcode": "171130355",
            "dpc": "03052222901",
            "name": "តាំង  ឈុន (ប៉ូលីស )"
        },
        {
            "barcode": "171130356",
            "dpc": "03052223001",
            "name": "សុខ  ឡាវ"
        },
        {
            "barcode": "171130357",
            "dpc": "03052223101",
            "name": "លឹម  សេងហ៊ួរ"
        },
        {
            "barcode": "171130358",
            "dpc": "03052223201",
            "name": "ជា  អេង ១"
        },
        {
            "barcode": "171130359",
            "dpc": "03052223301",
            "name": "ជា  អេង ២"
        },
        {
            "barcode": "171130360",
            "dpc": "03052223401",
            "name": "ហោ  តុងហាប់"
        },
        {
            "barcode": "171130361",
            "dpc": "03052223501",
            "name": "បេង  ភី"
        },
        {
            "barcode": "171130362",
            "dpc": "03052223601",
            "name": "បេ  សារឿន"
        },
        {
            "barcode": "171130363",
            "dpc": "03052223801",
            "name": "ហម  សាម៉ុន"
        },
        {
            "barcode": "171130364",
            "dpc": "03052223901",
            "name": "បង្គន់អនាម័យសាធាណះ"
        },
        {
            "barcode": "171130365",
            "dpc": "03052224001",
            "name": "តុក  សុងសួ"
        },
        {
            "barcode": "171130366",
            "dpc": "03052224101",
            "name": "សិប្បកម្មលូ"
        },
        {
            "barcode": "171130367",
            "dpc": "03052224201",
            "name": "បួន  សៀ"
        },
        {
            "barcode": "171130368",
            "dpc": "03052224301",
            "name": "ដៃដែក"
        },
        {
            "barcode": "171130369",
            "dpc": "03052224401",
            "name": "ស  ឌឿ"
        },
        {
            "barcode": "171130370",
            "dpc": "03052224501",
            "name": "អ៊ុំ  ចំរើន"
        },
        {
            "barcode": "171130371",
            "dpc": "03052224601",
            "name": "ហ៊ូ  រតនា"
        },
        {
            "barcode": "171130372",
            "dpc": "03052224701",
            "name": "ឌុក  ឆវេត"
        },
        {
            "barcode": "171130373",
            "dpc": "03052224801",
            "name": "អ៊ុំ  អេង"
        },
        {
            "barcode": "171130374",
            "dpc": "03052224901",
            "name": "សាលា អ៊ី.ស៊ី.ស៊ី"
        },
        {
            "barcode": "171130375",
            "dpc": "03052225001",
            "name": "ហួន  ហេង"
        },
        {
            "barcode": "171130376",
            "dpc": "03052225101",
            "name": "ស៊ុន លីនណា"
        },
        {
            "barcode": "171130377",
            "dpc": "03052225201",
            "name": "នៅ  យូរឡុង (វត្តសូភី )"
        },
        {
            "barcode": "171130378",
            "dpc": "03052225301",
            "name": "វត្តពោធិក្នុង"
        },
        {
            "barcode": "171130379",
            "dpc": "03052225401",
            "name": "កុង  យក់"
        },
        {
            "barcode": "171130380",
            "dpc": "03052225501",
            "name": "តាំង  ឡាយ"
        },
        {
            "barcode": "171130381",
            "dpc": "03052225601",
            "name": "ឈិត  សុក"
        },
        {
            "barcode": "171130382",
            "dpc": "03052225701",
            "name": "អែម  សុផល"
        },
        {
            "barcode": "171130383",
            "dpc": "03052225801",
            "name": "សន  និល"
        },
        {
            "barcode": "171130384",
            "dpc": "03052225901",
            "name": "គឹម  មុន្នី"
        },
        {
            "barcode": "171130385",
            "dpc": "03052226001",
            "name": "អ៊ុក  ស៊ីណយ"
        },
        {
            "barcode": "171130386",
            "dpc": "03052226101",
            "name": "ប្រាក់  ព្រី"
        },
        {
            "barcode": "171130387",
            "dpc": "03052226201",
            "name": "ងួន  ពន្លក"
        },
        {
            "barcode": "171130388",
            "dpc": "03052226301",
            "name": "សេង  ប៊ូ"
        },
        {
            "barcode": "171130389",
            "dpc": "03052226501",
            "name": "ផ្សារថ្មី"
        },
        {
            "barcode": "171130390",
            "dpc": "03052226601",
            "name": "តាំង  ម៉េងគង់"
        },
        {
            "barcode": "171130391",
            "dpc": "03052226701",
            "name": "វត្តផ្សារថ្មី"
        },
        {
            "barcode": "171130392",
            "dpc": "03052226801",
            "name": "ចេង  អឿន"
        },
        {
            "barcode": "171130393",
            "dpc": "03052226901",
            "name": "ក្រុមហ៊ុន អិលឌីអែស"
        },
        {
            "barcode": "171130394",
            "dpc": "03052227001",
            "name": "តុប  ថូលីណា ១"
        },
        {
            "barcode": "171130395",
            "dpc": "03052227101",
            "name": "តុប  ថូលីណា ២"
        },
        {
            "barcode": "171130396",
            "dpc": "03052227201",
            "name": "ឡាំ  ឆៃលីន"
        },
        {
            "barcode": "171130397",
            "dpc": "03052227301",
            "name": "វ៉ាន់  ណារ៉េត"
        },
        {
            "barcode": "171130398",
            "dpc": "03052227401",
            "name": "នៅ  សិទ្ធិគុណ"
        },
        {
            "barcode": "171130399",
            "dpc": "03052227501",
            "name": "សួន  វណ្ណនេត"
        },
        {
            "barcode": "171130400",
            "dpc": "03052227601",
            "name": "សៀ   ស៊ិន ១"
        },
        {
            "barcode": "171130401",
            "dpc": "03052227701",
            "name": "គាន  ថៃ ១"
        },
        {
            "barcode": "171130402",
            "dpc": "03052227801",
            "name": "ឃុន  ងួនហុង"
        },
        {
            "barcode": "171130403",
            "dpc": "03052227901",
            "name": "វិទ្យាល័យបៀលប្រាយ ៣"
        },
        {
            "barcode": "171130404",
            "dpc": "03052228001",
            "name": "សន  សុភ័ក្រ"
        },
        {
            "barcode": "171130405",
            "dpc": "03052228101",
            "name": "ឡុង  ចន្ថា"
        },
        {
            "barcode": "171130406",
            "dpc": "03052228201",
            "name": "ម៉ម  បណ្ឌិត"
        },
        {
            "barcode": "171130407",
            "dpc": "03052228301",
            "name": "គង់  ធី"
        },
        {
            "barcode": "171130408",
            "dpc": "03052228501",
            "name": "លក  វណ្ណ"
        },
        {
            "barcode": "171130409",
            "dpc": "03052228601",
            "name": "វ៉ាត់   ស៊ីម"
        },
        {
            "barcode": "171130410",
            "dpc": "03052228701",
            "name": "ហ៊ាង  រ៉ាវុធ"
        },
        {
            "barcode": "171130411",
            "dpc": "03052228801",
            "name": "ទៀប  រី ២"
        },
        {
            "barcode": "171130412",
            "dpc": "03052228901",
            "name": "លឹម  ហូ"
        },
        {
            "barcode": "171130413",
            "dpc": "03052229001",
            "name": "ខឹម  សាឃឿន"
        },
        {
            "barcode": "171130414",
            "dpc": "03052229201",
            "name": "សឹង  លី"
        },
        {
            "barcode": "171130415",
            "dpc": "03052229301",
            "name": "ឯម  សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171130416",
            "dpc": "03052229401",
            "name": "ទឹម  វណ្ណា"
        },
        {
            "barcode": "171130417",
            "dpc": "03052229501",
            "name": "ផុន  ផាវុធ"
        },
        {
            "barcode": "171130418",
            "dpc": "03052229601",
            "name": "ឈុំ  ចាន់"
        },
        {
            "barcode": "171130419",
            "dpc": "03052229701",
            "name": "វត្តកណ្តាល"
        },
        {
            "barcode": "171130420",
            "dpc": "03052229801",
            "name": "ឌិត  ជិន"
        },
        {
            "barcode": "171130421",
            "dpc": "03052229901",
            "name": "ជួប  យ៉ុម"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
