let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171124308",
            "dpc": "03042334901",
            "name": "ហួង សារូ"
        },
        {
            "barcode": "171124309",
            "dpc": "03042347001",
            "name": "គុញ សាត"
        },
        {
            "barcode": "171124310",
            "dpc": "03042302001",
            "name": "ឈួយ សាមឿន"
        },
        {
            "barcode": "171124311",
            "dpc": "03042343301",
            "name": "ហុង វីរៈ"
        },
        {
            "barcode": "171124312",
            "dpc": "03042343501",
            "name": "ធ្យូង យ៉ន់"
        },
        {
            "barcode": "171124313",
            "dpc": "03042305101",
            "name": "សែម សម្បត្តិ"
        },
        {
            "barcode": "171124314",
            "dpc": "03042305201",
            "name": "គា ពិសិដ្ឋ"
        },
        {
            "barcode": "171124315",
            "dpc": "03042305401",
            "name": "នួន ស្រី"
        },
        {
            "barcode": "171124316",
            "dpc": "03042305301",
            "name": "កែវ រតនា"
        },
        {
            "barcode": "171124317",
            "dpc": "03042341001",
            "name": "សោ ចាន់ដេត"
        },
        {
            "barcode": "171124318",
            "dpc": "03042343601",
            "name": "កើយ ភាព"
        },
        {
            "barcode": "171124319",
            "dpc": "03042346401",
            "name": "ស៊ឹម ហាន"
        },
        {
            "barcode": "171124320",
            "dpc": "03042304801",
            "name": "វ៉ុន ប៊ុនធឿន"
        },
        {
            "barcode": "171124321",
            "dpc": "03042304901",
            "name": "នេត ភឹម"
        },
        {
            "barcode": "171124322",
            "dpc": "03042305001",
            "name": "សេក សឺត"
        },
        {
            "barcode": "171124323",
            "dpc": "03042306801",
            "name": "ព្រំ សំអាន"
        },
        {
            "barcode": "171124324",
            "dpc": "03042306901",
            "name": "ប៉ាត់ ចំរើន"
        },
        {
            "barcode": "171124325",
            "dpc": "03042339301",
            "name": "ឃួន នី"
        },
        {
            "barcode": "171124326",
            "dpc": "03042307001",
            "name": "ប៊ុន សារឿន"
        },
        {
            "barcode": "171124327",
            "dpc": "03042306701",
            "name": "ញ៉ែម សោភ័ណ"
        },
        {
            "barcode": "171124328",
            "dpc": "03042307101",
            "name": "រិទ្ធ វិសាល"
        },
        {
            "barcode": "171124329",
            "dpc": "03042307201",
            "name": "ប៊ុន ទិត្យារិទ្ធ"
        },
        {
            "barcode": "171124330",
            "dpc": "03042307301",
            "name": "អ៊ុល សុខសាន"
        },
        {
            "barcode": "171124331",
            "dpc": "03042307401",
            "name": "វណ្ណ ចរិយា"
        },
        {
            "barcode": "171124332",
            "dpc": "03042346101",
            "name": "ដេម ឌីណា"
        },
        {
            "barcode": "171124333",
            "dpc": "03042305501",
            "name": "នួន វ៉ាន់ថា"
        },
        {
            "barcode": "171124334",
            "dpc": "03042329901",
            "name": "ឆឹង អៀក"
        },
        {
            "barcode": "171124335",
            "dpc": "03042305601",
            "name": "ហួន ចំរើន"
        },
        {
            "barcode": "171124336",
            "dpc": "03042305801",
            "name": "ស៊ុន សុខ"
        },
        {
            "barcode": "171124337",
            "dpc": "03042305901",
            "name": "សំរិត ឆន១"
        },
        {
            "barcode": "171124338",
            "dpc": "03042306001",
            "name": "អ៊ុំ ដារី"
        },
        {
            "barcode": "171124339",
            "dpc": "03042341201",
            "name": "ប៉ង់ រីនីមីហ្សែល"
        },
        {
            "barcode": "171124340",
            "dpc": "03042306101",
            "name": "កូយ ហឿន"
        },
        {
            "barcode": "171124341",
            "dpc": "03042306201",
            "name": "ចាប មុំ"
        },
        {
            "barcode": "171124342",
            "dpc": "03042337801",
            "name": "សាំង ទក្ខិណា"
        },
        {
            "barcode": "171124343",
            "dpc": "03042337901",
            "name": "ហួត សុខុន"
        },
        {
            "barcode": "171124344",
            "dpc": "03042338001",
            "name": "សាំង វណ្ណី"
        },
        {
            "barcode": "171124345",
            "dpc": "03042345001",
            "name": "លឹម ប៉ោសេង"
        },
        {
            "barcode": "171124346",
            "dpc": "03042344301",
            "name": "វិញ សុខហៀក"
        },
        {
            "barcode": "171124347",
            "dpc": "03042338501",
            "name": "វួច ស្រេង"
        },
        {
            "barcode": "171124348",
            "dpc": "03042338601",
            "name": "សោម សម្បត្តិ"
        },
        {
            "barcode": "171124349",
            "dpc": "03042308801",
            "name": "ម៉ែន ចាន់នឿម"
        },
        {
            "barcode": "171124350",
            "dpc": "03042308701",
            "name": "កង សេដ្ឋា"
        },
        {
            "barcode": "171124351",
            "dpc": "03042307801",
            "name": "ឆោម ប៊ុនខន"
        },
        {
            "barcode": "171124352",
            "dpc": "03042338101",
            "name": "នេត សាវ"
        },
        {
            "barcode": "171124353",
            "dpc": "03042338201",
            "name": "ទៀង សុផល"
        },
        {
            "barcode": "171124354",
            "dpc": "03042308601",
            "name": "ហៀង ឆីវគុណ"
        },
        {
            "barcode": "171124355",
            "dpc": "03042332501",
            "name": "ង៉ែត រឹម"
        },
        {
            "barcode": "171124356",
            "dpc": "03042308201",
            "name": "សុខ ជា"
        },
        {
            "barcode": "171124357",
            "dpc": "03042339601",
            "name": "ទូច អង្គារិទ្ធ"
        },
        {
            "barcode": "171124358",
            "dpc": "03042339501",
            "name": "ឌុំ សារ៉ាត់"
        },
        {
            "barcode": "171124359",
            "dpc": "03042339401",
            "name": "សុវណ្ណ វឿន"
        },
        {
            "barcode": "171124360",
            "dpc": "03042307601",
            "name": "ឆុំ វណ្ណារី"
        },
        {
            "barcode": "171124361",
            "dpc": "03042339801",
            "name": "គី ពៅ"
        },
        {
            "barcode": "171124362",
            "dpc": "03042338901",
            "name": "ហេង ម៉ាឌីណូ"
        },
        {
            "barcode": "171124363",
            "dpc": "03042308501",
            "name": "សឿ ចាន់រ៉ាស៊ី"
        },
        {
            "barcode": "171124364",
            "dpc": "03042332401",
            "name": "អ៊ុល ថាវី"
        },
        {
            "barcode": "171124365",
            "dpc": "03042308901",
            "name": "កែន បូណាត"
        },
        {
            "barcode": "171124366",
            "dpc": "03042309001",
            "name": "ផុន ផល"
        },
        {
            "barcode": "171124367",
            "dpc": "03042309101",
            "name": "ម៉ៃ ភ្លើន"
        },
        {
            "barcode": "171124368",
            "dpc": "03042309201",
            "name": "សរ សុរិទ្ធ"
        },
        {
            "barcode": "171124369",
            "dpc": "03042309301",
            "name": "លឹម ហ្កិចឡាយ"
        },
        {
            "barcode": "171124370",
            "dpc": "03042309401",
            "name": "ឯម វរិទ្ធ"
        },
        {
            "barcode": "171124371",
            "dpc": "03042309501",
            "name": "ទេព ឧត្តម"
        },
        {
            "barcode": "171124372",
            "dpc": "03042309601",
            "name": "កែវ ប៊ុនឆែម"
        },
        {
            "barcode": "171124373",
            "dpc": "03042309701",
            "name": "ទេព ប៊ុនណារិទ្ធ"
        },
        {
            "barcode": "171124374",
            "dpc": "03042309801",
            "name": "អ៊ុំ សឹង"
        },
        {
            "barcode": "171124375",
            "dpc": "03042343701",
            "name": "អ៊ុំ គឹមស៊ុន"
        },
        {
            "barcode": "171124376",
            "dpc": "03042309901",
            "name": "បេ គឹមសាន"
        },
        {
            "barcode": "171124377",
            "dpc": "03042310001",
            "name": "អ៊ុំ គឹមសាន"
        },
        {
            "barcode": "171124378",
            "dpc": "03042310101",
            "name": "អ៊ុំ ទូច"
        },
        {
            "barcode": "171124379",
            "dpc": "03042310301",
            "name": "ចាន់ ឈុនលីកា"
        },
        {
            "barcode": "171124380",
            "dpc": "03042310201",
            "name": "ស្វាយ សំអឿន"
        },
        {
            "barcode": "171124381",
            "dpc": "03042310401",
            "name": "ប៉ែន រិទ្ធី"
        },
        {
            "barcode": "171124382",
            "dpc": "03042310501",
            "name": "ទុយ វុទ្ធី"
        },
        {
            "barcode": "171124383",
            "dpc": "03042310601",
            "name": "ពៅ សុវណ្ណ"
        },
        {
            "barcode": "171124384",
            "dpc": "03042310701",
            "name": "ងិន សូលីដា"
        },
        {
            "barcode": "171124385",
            "dpc": "03042310801",
            "name": "សៀន ចន្ថា"
        },
        {
            "barcode": "171124386",
            "dpc": "03042310901",
            "name": "ឡុញ ឃឿម"
        },
        {
            "barcode": "171124387",
            "dpc": "03042311001",
            "name": "ឡុង សំអៀត"
        },
        {
            "barcode": "171124388",
            "dpc": "03042311101",
            "name": "អ៊ុក សារ៉ាក់"
        },
        {
            "barcode": "171124389",
            "dpc": "03042311201",
            "name": "អ៊ុយ ប៊ូ"
        },
        {
            "barcode": "171124390",
            "dpc": "03042311301",
            "name": "ឈើយ សុខេត"
        },
        {
            "barcode": "171124391",
            "dpc": "03042347101",
            "name": "ប៊ុន សុធាវី"
        },
        {
            "barcode": "171124392",
            "dpc": "03042338401",
            "name": "សាលារៀនបាឡាត់"
        },
        {
            "barcode": "171124393",
            "dpc": "03042347201",
            "name": "ប៊ុន ធឹង ២"
        },
        {
            "barcode": "171124394",
            "dpc": "03042301701",
            "name": "លឹម ឃៀង"
        },
        {
            "barcode": "171124395",
            "dpc": "03042304301",
            "name": "ឡាយ សុវណ្ណមុន្នីរាជ ២"
        },
        {
            "barcode": "171124396",
            "dpc": "03042304701",
            "name": "ហួត ធូ"
        },
        {
            "barcode": "171124397",
            "dpc": "03042305701",
            "name": "សៅ សារិន"
        },
        {
            "barcode": "171124398",
            "dpc": "03042306301",
            "name": "លី ស៊្រូយ"
        },
        {
            "barcode": "171124399",
            "dpc": "03042306401",
            "name": "ទោម ថាច"
        },
        {
            "barcode": "171124400",
            "dpc": "03042306501",
            "name": "មៀច យន"
        },
        {
            "barcode": "171124401",
            "dpc": "03042306601",
            "name": "សេក ណៃហ៊ុន"
        },
        {
            "barcode": "171124402",
            "dpc": "03042307501",
            "name": "ណៃ ធៀង"
        },
        {
            "barcode": "171124403",
            "dpc": "03042307701",
            "name": "ប៉ិល សុជាតិ"
        },
        {
            "barcode": "171124404",
            "dpc": "03042307901",
            "name": "ម៉ៅ សុខុម"
        },
        {
            "barcode": "171124405",
            "dpc": "03042308101",
            "name": "អ៊ុង ណារៀង"
        },
        {
            "barcode": "171124406",
            "dpc": "03042308401",
            "name": "ជា ចាយ"
        },
        {
            "barcode": "171124407",
            "dpc": "03042312101",
            "name": "មឿន សារ៉េត"
        },
        {
            "barcode": "171124408",
            "dpc": "03042312501",
            "name": "ឡុង ហ៊ាន"
        },
        {
            "barcode": "171124409",
            "dpc": "03042312701",
            "name": "ព្រំ ផា"
        },
        {
            "barcode": "171124410",
            "dpc": "03042312801",
            "name": "សាត ទ្រី"
        },
        {
            "barcode": "171124411",
            "dpc": "03042313001",
            "name": "ជិន ស៊ន"
        },
        {
            "barcode": "171124412",
            "dpc": "03042313101",
            "name": "នាង សុភ័ក្រ"
        },
        {
            "barcode": "171124413",
            "dpc": "03042313201",
            "name": "មាស យ៉ានី"
        },
        {
            "barcode": "171124414",
            "dpc": "03042313301",
            "name": "អយ គា"
        },
        {
            "barcode": "171124415",
            "dpc": "03042313401",
            "name": "ឈុន ផានី"
        },
        {
            "barcode": "171124416",
            "dpc": "03042313501",
            "name": "សោម សុវណ្ណ"
        },
        {
            "barcode": "171124417",
            "dpc": "03042314701",
            "name": "ម៉ៅ ហ៊ាន"
        },
        {
            "barcode": "171124418",
            "dpc": "03042314801",
            "name": "កើយ សាវ៉េន"
        },
        {
            "barcode": "171124419",
            "dpc": "03042315001",
            "name": "កែវ ថុន"
        },
        {
            "barcode": "171124420",
            "dpc": "03042315101",
            "name": "ចាប ស៊ុនថាយ"
        },
        {
            "barcode": "171124421",
            "dpc": "03042315301",
            "name": "លឹម ឡៃស៊ាង"
        },
        {
            "barcode": "171124422",
            "dpc": "03042315401",
            "name": "នង សារ៉ែន"
        },
        {
            "barcode": "171124423",
            "dpc": "03042315501",
            "name": "ឡម វៀត"
        },
        {
            "barcode": "171124424",
            "dpc": "03042329201",
            "name": "ប៊ុន ធឹង"
        },
        {
            "barcode": "171124425",
            "dpc": "03042330101",
            "name": "លាង កឹមលន់"
        },
        {
            "barcode": "171124426",
            "dpc": "03042330301",
            "name": "ចាយ ស៊ាង"
        },
        {
            "barcode": "171124427",
            "dpc": "03042330401",
            "name": "ធិន ម៉ាក់ធែល"
        },
        {
            "barcode": "171124428",
            "dpc": "03042330501",
            "name": "ទួន ផល"
        },
        {
            "barcode": "171124429",
            "dpc": "03042332301",
            "name": "អ៊ិន ឧត្តម"
        },
        {
            "barcode": "171124430",
            "dpc": "03042332701",
            "name": "ផូ គឹមស្រៀង"
        },
        {
            "barcode": "171124431",
            "dpc": "03042333601",
            "name": "អ៊ិត សាខន"
        },
        {
            "barcode": "171124432",
            "dpc": "03042333901",
            "name": "សន សុង"
        },
        {
            "barcode": "171124433",
            "dpc": "03042334201",
            "name": "ញ៉ែ រ៉េត"
        },
        {
            "barcode": "171124434",
            "dpc": "03042334701",
            "name": "ស៊ី ធីអេស៊ា"
        },
        {
            "barcode": "171124435",
            "dpc": "03042335401",
            "name": "កែវ ចន្ថា"
        },
        {
            "barcode": "171124436",
            "dpc": "03042335901",
            "name": "នេត យឿន"
        },
        {
            "barcode": "171124437",
            "dpc": "03042336801",
            "name": "អ៊ុត បុប្ជា"
        },
        {
            "barcode": "171124438",
            "dpc": "03042337601",
            "name": "ធុច រ៉ា"
        },
        {
            "barcode": "171124439",
            "dpc": "03042337701",
            "name": "មាស កាន"
        },
        {
            "barcode": "171124440",
            "dpc": "03042338301",
            "name": "រ៉ា សុផុន"
        },
        {
            "barcode": "171124441",
            "dpc": "03042338701",
            "name": "ប៊ុន គង់"
        },
        {
            "barcode": "171124442",
            "dpc": "03042339701",
            "name": "សូ សំស័ក្ត"
        },
        {
            "barcode": "171124443",
            "dpc": "03042340501",
            "name": "ស៊ីវ លានគីម"
        },
        {
            "barcode": "171124444",
            "dpc": "03042340601",
            "name": "ស៊្រុនុ គឹមហុង"
        },
        {
            "barcode": "171124445",
            "dpc": "03042341101",
            "name": "ព្រហ្ម រតនៈ"
        },
        {
            "barcode": "171124446",
            "dpc": "03042342101",
            "name": "អ៊ុក ណារិទ្ធ"
        },
        {
            "barcode": "171124447",
            "dpc": "03042342201",
            "name": "អ៊ុក លី"
        },
        {
            "barcode": "171124448",
            "dpc": "03042342601",
            "name": "កែវ សាវ៉ៃហ៊ែន"
        },
        {
            "barcode": "171124449",
            "dpc": "03042342701",
            "name": "ទៀង វ៉ា"
        },
        {
            "barcode": "171124450",
            "dpc": "03042344701",
            "name": "ហង់ សុភ័ក្ត្រ"
        },
        {
            "barcode": "171124451",
            "dpc": "03042344801",
            "name": "គុំ កញ្ញា"
        },
        {
            "barcode": "171124452",
            "dpc": "03042344901",
            "name": "អ៊ុល ហ៊ួន"
        },
        {
            "barcode": "171124453",
            "dpc": "03042345201",
            "name": "ទ្រី នាង"
        },
        {
            "barcode": "171124454",
            "dpc": "03042345301",
            "name": "ពេជ្រ សុធា"
        },
        {
            "barcode": "171124455",
            "dpc": "03042346901",
            "name": "យឺ ដារ៉ុត"
        },
        {
            "barcode": "171124456",
            "dpc": "03042347501",
            "name": "ហេង អ៊ាប"
        },
        {
            "barcode": "171124457",
            "dpc": "03042347601",
            "name": "ហ៊ាង សុមនា ១"
        },
        {
            "barcode": "171124458",
            "dpc": "03042347701",
            "name": "ហ៊ាង សុមនា ២"
        },
        {
            "barcode": "171124459",
            "dpc": "03042347801",
            "name": "ជាម ណារ៉ុង"
        },
        {
            "barcode": "171124460",
            "dpc": "03042332201",
            "name": "សាយ សារុន"
        },
        {
            "barcode": "171124461",
            "dpc": "03042311401",
            "name": "សុំ ថាន"
        },
        {
            "barcode": "171124462",
            "dpc": "03042300101",
            "name": "អែត ហ្វូតត ១៧"
        },
        {
            "barcode": "171124463",
            "dpc": "03042300201",
            "name": "អែត ហ្វូត ១៨"
        },
        {
            "barcode": "171124464",
            "dpc": "03042300301",
            "name": "អែត ហ្វូត ១៩"
        },
        {
            "barcode": "171124465",
            "dpc": "03042300601",
            "name": "អៀង វឌ្ឍនា"
        },
        {
            "barcode": "171124466",
            "dpc": "03042300701",
            "name": "ស៊ុន សុផាត"
        },
        {
            "barcode": "171124467",
            "dpc": "03042300801",
            "name": "ចាន់ អេងបី"
        },
        {
            "barcode": "171124468",
            "dpc": "03042300901",
            "name": "ចាន់ ចេក"
        },
        {
            "barcode": "171124469",
            "dpc": "03042345501",
            "name": "សេង ម៉ៅ"
        },
        {
            "barcode": "171124470",
            "dpc": "03042301501",
            "name": "ម៉េង ហៀក"
        },
        {
            "barcode": "171124471",
            "dpc": "03042301601",
            "name": "ប្រាក់ សុផាន់ណារិទ្ធ"
        },
        {
            "barcode": "171124472",
            "dpc": "03042301801",
            "name": "គង់ វុត្ថា"
        },
        {
            "barcode": "171124473",
            "dpc": "03042301201",
            "name": "គីម មួយ ២"
        },
        {
            "barcode": "171124474",
            "dpc": "03042301101",
            "name": "គីម មួយ ១"
        },
        {
            "barcode": "171124475",
            "dpc": "03042301301",
            "name": "សុខ អៀម"
        },
        {
            "barcode": "171124476",
            "dpc": "03042301401",
            "name": "ស៊ុយ សុវណ្ណគិរី"
        },
        {
            "barcode": "171124477",
            "dpc": "03042311901",
            "name": "ជៀវ វន"
        },
        {
            "barcode": "171124478",
            "dpc": "03042336701",
            "name": "ខា ហេង"
        },
        {
            "barcode": "171124479",
            "dpc": "03042302201",
            "name": "ទឹម សាវ៉ាត"
        },
        {
            "barcode": "171124480",
            "dpc": "03042347301",
            "name": "ពេជ្រ សុធា"
        },
        {
            "barcode": "171124481",
            "dpc": "03042302401",
            "name": "នួន ចំរើន"
        },
        {
            "barcode": "171124482",
            "dpc": "03042334001",
            "name": "សុច ហុង"
        },
        {
            "barcode": "171124483",
            "dpc": "03042334101",
            "name": "ឡោ ងួន"
        },
        {
            "barcode": "171124484",
            "dpc": "03042334301",
            "name": "ម៉ុត ឌីណា"
        },
        {
            "barcode": "171124485",
            "dpc": "03042334401",
            "name": "ផែ រ៉ាន់"
        },
        {
            "barcode": "171124486",
            "dpc": "03042302601",
            "name": "ផៃ សុវណ្ណ"
        },
        {
            "barcode": "171124487",
            "dpc": "03042332601",
            "name": "អ៊ូច សុខា"
        },
        {
            "barcode": "171124488",
            "dpc": "03042346801",
            "name": "ប៉ក់ វីណា"
        },
        {
            "barcode": "171124489",
            "dpc": "03042302701",
            "name": "មិន គឹមសួរ"
        },
        {
            "barcode": "171124490",
            "dpc": "03042302801",
            "name": "យឹម ផល្លី"
        },
        {
            "barcode": "171124491",
            "dpc": "03042302901",
            "name": "ង៉ាន សំ"
        },
        {
            "barcode": "171124492",
            "dpc": "03042303001",
            "name": "វ៉ុន ឆុង"
        },
        {
            "barcode": "171124493",
            "dpc": "03042333201",
            "name": "ស៊ុន វុទ្ធី"
        },
        {
            "barcode": "171124494",
            "dpc": "03042333301",
            "name": "ស៊ុន ប៊ុនធឿន"
        },
        {
            "barcode": "171124495",
            "dpc": "03042303201",
            "name": "ព្រំ សុខា"
        },
        {
            "barcode": "171124496",
            "dpc": "03042313801",
            "name": "វ៉ិត គឹមលី"
        },
        {
            "barcode": "171124497",
            "dpc": "03042303301",
            "name": "ម៉ុង ហោ"
        },
        {
            "barcode": "171124498",
            "dpc": "03042333401",
            "name": "គួន ធី"
        },
        {
            "barcode": "171124499",
            "dpc": "03042304501",
            "name": "រស់ ប៊ុនរ័ត្ន"
        },
        {
            "barcode": "171124500",
            "dpc": "03042304601",
            "name": "លាក់ ណាត"
        },
        {
            "barcode": "171124501",
            "dpc": "03042303401",
            "name": "ហួត តាវ"
        },
        {
            "barcode": "171124502",
            "dpc": "03042330001",
            "name": "គួច ធិរិទ្ធ"
        },
        {
            "barcode": "171124503",
            "dpc": "03042304101",
            "name": "តែ ណាំ"
        },
        {
            "barcode": "171124504",
            "dpc": "03042304201",
            "name": "ម៉ី ចំរើន"
        },
        {
            "barcode": "171124505",
            "dpc": "03042334601",
            "name": "សោម រិទ្ធី"
        },
        {
            "barcode": "171124506",
            "dpc": "03042340201",
            "name": "យ៉ាន ហួត"
        },
        {
            "barcode": "171124507",
            "dpc": "03042333001",
            "name": "ធាម សំអុល"
        },
        {
            "barcode": "171124508",
            "dpc": "03042341901",
            "name": "ឈឿត ឈឿត"
        },
        {
            "barcode": "171124509",
            "dpc": "03042347901",
            "name": "ចន ដារ៉ាឡុងយូហាន់សុន"
        },
        {
            "barcode": "171124510",
            "dpc": "03042341701",
            "name": "ជួន សុផា"
        },
        {
            "barcode": "171124511",
            "dpc": "03042336101",
            "name": "ប្រាក់ បូរាណ"
        },
        {
            "barcode": "171124512",
            "dpc": "03042335701",
            "name": "ចន្ទ័ សុភា"
        },
        {
            "barcode": "171124513",
            "dpc": "03042331801",
            "name": "សុខ ចេង"
        },
        {
            "barcode": "171124514",
            "dpc": "03042344601",
            "name": "ប៉ែន សេដ្ឋា"
        },
        {
            "barcode": "171124515",
            "dpc": "03042342001",
            "name": "អិល ស៊ីដារ៉ាវុទ្ធី"
        },
        {
            "barcode": "171124516",
            "dpc": "03042341801",
            "name": "ម៉ម សារឿន"
        },
        {
            "barcode": "171124517",
            "dpc": "03042335801",
            "name": "សួរ សុកវិសាល"
        },
        {
            "barcode": "171124518",
            "dpc": "03042336201",
            "name": "ជា សង្ខារសរីវឌ្ឍន៍"
        },
        {
            "barcode": "171124519",
            "dpc": "03042336301",
            "name": "ស៊ូ កុសល់"
        },
        {
            "barcode": "171124520",
            "dpc": "03042304001",
            "name": "ធឹង គឹមហេង២"
        },
        {
            "barcode": "171124521",
            "dpc": "03042343401",
            "name": "សេស សារ៉ុម"
        },
        {
            "barcode": "171124522",
            "dpc": "03042303901",
            "name": "ប៊ូ អ៊ុល"
        },
        {
            "barcode": "171124523",
            "dpc": "03042303701",
            "name": "វង្ស សាវ៉ែ"
        },
        {
            "barcode": "171124524",
            "dpc": "03042303501",
            "name": "កែវ សៅសុភត្រា"
        },
        {
            "barcode": "171124525",
            "dpc": "03042333801",
            "name": "គិត ចាន់ថន"
        },
        {
            "barcode": "171124526",
            "dpc": "03042311501",
            "name": "បឹង កូរ៉េ"
        },
        {
            "barcode": "171124527",
            "dpc": "03042311601",
            "name": "សុខ សីហា"
        },
        {
            "barcode": "171124528",
            "dpc": "03042332801",
            "name": "ស្វាយ នាង"
        },
        {
            "barcode": "171124529",
            "dpc": "03042314501",
            "name": "អ៊ឹម ឆែរ៉ាត់"
        },
        {
            "barcode": "171124530",
            "dpc": "03042345801",
            "name": "អួន ណេង"
        },
        {
            "barcode": "171124531",
            "dpc": "03042314601",
            "name": "អួន ណាង"
        },
        {
            "barcode": "171124532",
            "dpc": "03042331401",
            "name": "ហៃ រ័ត្ន"
        },
        {
            "barcode": "171124533",
            "dpc": "03042334501",
            "name": "ឡម សានឿន"
        },
        {
            "barcode": "171124534",
            "dpc": "03042311701",
            "name": "សួន ឆោមសាវ៉ាត"
        },
        {
            "barcode": "171124535",
            "dpc": "03042311801",
            "name": "សុខ សារ៉េត"
        },
        {
            "barcode": "171124536",
            "dpc": "03042312001",
            "name": "កែវ រ៉ា"
        },
        {
            "barcode": "171124537",
            "dpc": "03042312201",
            "name": "តាំង ស្រីហុង"
        },
        {
            "barcode": "171124538",
            "dpc": "03042312401",
            "name": "ពិន ជុំ"
        },
        {
            "barcode": "171124539",
            "dpc": "03042312301",
            "name": "សៀង ហួត"
        },
        {
            "barcode": "171124540",
            "dpc": "03042347401",
            "name": "វង្ស នាង"
        },
        {
            "barcode": "171124541",
            "dpc": "03042331201",
            "name": "កេង សាវ័យ"
        },
        {
            "barcode": "171124542",
            "dpc": "03042345701",
            "name": "គង់ គឹមសាន"
        },
        {
            "barcode": "171124543",
            "dpc": "03042313901",
            "name": "ជ្រិន ញ៉"
        },
        {
            "barcode": "171124544",
            "dpc": "03042313601",
            "name": "សួន ញ៉ិប"
        },
        {
            "barcode": "171124545",
            "dpc": "03042314001",
            "name": "នេត ប៊ី"
        },
        {
            "barcode": "171124546",
            "dpc": "03042314101",
            "name": "រស់ សុចន"
        },
        {
            "barcode": "171124547",
            "dpc": "03042314301",
            "name": "ប្រម ម៉េត"
        },
        {
            "barcode": "171124548",
            "dpc": "03042314201",
            "name": "តន់ គឹមសេង"
        },
        {
            "barcode": "171124549",
            "dpc": "03042314401",
            "name": "ឡុញ សំ"
        },
        {
            "barcode": "171124550",
            "dpc": "03042345901",
            "name": "ម៉ី សុវណ្ណ"
        },
        {
            "barcode": "171124551",
            "dpc": "03042315601",
            "name": "លៀវ ភឿ"
        },
        {
            "barcode": "171124552",
            "dpc": "03042315701",
            "name": "អៀង វុទ្ធី"
        },
        {
            "barcode": "171124553",
            "dpc": "03042315801",
            "name": "ញ៉ែម ឃីម"
        },
        {
            "barcode": "171124554",
            "dpc": "03042315901",
            "name": "គឹម សារៀប"
        },
        {
            "barcode": "171124555",
            "dpc": "03042316001",
            "name": "សំ អឿត"
        },
        {
            "barcode": "171124556",
            "dpc": "03042344401",
            "name": "សាំង សុខុម"
        },
        {
            "barcode": "171124557",
            "dpc": "03042342301",
            "name": "ញ៉ែម វុឌ្ឍឹង"
        },
        {
            "barcode": "171124558",
            "dpc": "03042318201",
            "name": "ជួន សារឿន"
        },
        {
            "barcode": "171124559",
            "dpc": "03042318301",
            "name": "អៀង សាវន"
        },
        {
            "barcode": "171124560",
            "dpc": "03042318401",
            "name": "ហុន គឹមហាង"
        },
        {
            "barcode": "171124561",
            "dpc": "03042318501",
            "name": "ឈិន សុធារី"
        },
        {
            "barcode": "171124562",
            "dpc": "03042318601",
            "name": "ព្រាប ចំរើន"
        },
        {
            "barcode": "171124563",
            "dpc": "03042318701",
            "name": "អឿន វី"
        },
        {
            "barcode": "171124564",
            "dpc": "03042318801",
            "name": "ពៀវ ណាវី"
        },
        {
            "barcode": "171124565",
            "dpc": "03042318901",
            "name": "ច្រិច ជ្រឿម"
        },
        {
            "barcode": "171124566",
            "dpc": "03042319001",
            "name": "អ៊ឹង នារីរ័ត្ន"
        },
        {
            "barcode": "171124567",
            "dpc": "03042319101",
            "name": "យិន ខេមម៉ា"
        },
        {
            "barcode": "171124568",
            "dpc": "03042319201",
            "name": "អ៊ិត ប៊ុនសូម"
        },
        {
            "barcode": "171124569",
            "dpc": "03042319301",
            "name": "យួម ធឹង"
        },
        {
            "barcode": "171124570",
            "dpc": "03042319401",
            "name": "សែម សឿន"
        },
        {
            "barcode": "171124571",
            "dpc": "03042319501",
            "name": "ប៊ូ ប៉ិច"
        },
        {
            "barcode": "171124572",
            "dpc": "03042319601",
            "name": "ស៊ឹម លីហៀង"
        },
        {
            "barcode": "171124573",
            "dpc": "03042319701",
            "name": "ស៊ឹម លៀងហេង"
        },
        {
            "barcode": "171124574",
            "dpc": "03042319801",
            "name": "រ៉ូ រុំ"
        },
        {
            "barcode": "171124575",
            "dpc": "03042319901",
            "name": "ហែម សុខ"
        },
        {
            "barcode": "171124576",
            "dpc": "03042320001",
            "name": "សៅ សុផល"
        },
        {
            "barcode": "171124577",
            "dpc": "03042320101",
            "name": "ម៉ី សារ៉ាត់"
        },
        {
            "barcode": "171124578",
            "dpc": "03042320201",
            "name": "យួម វ៉ាន់"
        },
        {
            "barcode": "171124579",
            "dpc": "03042320301",
            "name": "ឈឹម វាសនា"
        },
        {
            "barcode": "171124580",
            "dpc": "03042320401",
            "name": "ប្រេម សុខណា"
        },
        {
            "barcode": "171124581",
            "dpc": "03042320501",
            "name": "សៅ រស់"
        },
        {
            "barcode": "171124582",
            "dpc": "03042320601",
            "name": "មេឃ សារឿន"
        },
        {
            "barcode": "171124583",
            "dpc": "03042320801",
            "name": "ជឿម សាវុធ"
        },
        {
            "barcode": "171124584",
            "dpc": "03042320901",
            "name": "ឡុង សេម"
        },
        {
            "barcode": "171124585",
            "dpc": "03042321001",
            "name": "រ៉ូ សារ៉ាន់"
        },
        {
            "barcode": "171124586",
            "dpc": "03042321101",
            "name": "យួម វ៉ាន់ធី"
        },
        {
            "barcode": "171124587",
            "dpc": "03042321201",
            "name": "យួម ធី"
        },
        {
            "barcode": "171124588",
            "dpc": "03042321301",
            "name": "ឃួន សុខណា"
        },
        {
            "barcode": "171124589",
            "dpc": "03042321401",
            "name": "រៀល ថែម"
        },
        {
            "barcode": "171124590",
            "dpc": "03042321501",
            "name": "អ៊ិត ញ៉ក់"
        },
        {
            "barcode": "171124591",
            "dpc": "03042321601",
            "name": "អ៊ិត វណ្ណា"
        },
        {
            "barcode": "171124592",
            "dpc": "03042321701",
            "name": "ថាច់ ធី"
        },
        {
            "barcode": "171124593",
            "dpc": "03042321801",
            "name": "ហ៊ាន គឹមលុន"
        },
        {
            "barcode": "171124594",
            "dpc": "03042321901",
            "name": "មុំ បារាំង"
        },
        {
            "barcode": "171124595",
            "dpc": "03042322001",
            "name": "ជេត សោភ័ណ"
        },
        {
            "barcode": "171124596",
            "dpc": "03042322101",
            "name": "ឆ្នៃ សូរីវង្ស"
        },
        {
            "barcode": "171124597",
            "dpc": "03042322201",
            "name": "អំ អឿន"
        },
        {
            "barcode": "171124598",
            "dpc": "03042322301",
            "name": "ជា សាវាត់"
        },
        {
            "barcode": "171124599",
            "dpc": "03042322401",
            "name": "ឃឿម សុខុម"
        },
        {
            "barcode": "171124600",
            "dpc": "03042322501",
            "name": "ស្មិត មាត"
        },
        {
            "barcode": "171124601",
            "dpc": "03042322601",
            "name": "ម៉ក់ ហួន"
        },
        {
            "barcode": "171124602",
            "dpc": "03042322701",
            "name": "យ៉ៃ ប៊ុនឆេន"
        },
        {
            "barcode": "171124603",
            "dpc": "03042322801",
            "name": "ម៉ម ទូច"
        },
        {
            "barcode": "171124604",
            "dpc": "03042322901",
            "name": "ឃី ឌីដាលីន"
        },
        {
            "barcode": "171124605",
            "dpc": "03042329701",
            "name": "ក្រួច ថែម"
        },
        {
            "barcode": "171124606",
            "dpc": "03042323001",
            "name": "ភួង ញ៉ន"
        },
        {
            "barcode": "171124607",
            "dpc": "03042323101",
            "name": "លួង សុម៉ាលី"
        },
        {
            "barcode": "171124608",
            "dpc": "03042304401",
            "name": "លឹម លាង"
        },
        {
            "barcode": "171124609",
            "dpc": "03042342501",
            "name": "យិន គឹមសេង"
        },
        {
            "barcode": "171124610",
            "dpc": "03042323201",
            "name": "មឿន ម៉េង"
        },
        {
            "barcode": "171124611",
            "dpc": "03042323301",
            "name": "គឹម ឈឿង"
        },
        {
            "barcode": "171124612",
            "dpc": "03042317701",
            "name": "ប្រាក់ សុភា"
        },
        {
            "barcode": "171124613",
            "dpc": "03042317801",
            "name": "រ័ត្ន ទី"
        },
        {
            "barcode": "171124614",
            "dpc": "03042317901",
            "name": "សុវណ្ណ ប្រណិត"
        },
        {
            "barcode": "171124615",
            "dpc": "03042338801",
            "name": "សំ ភារំ"
        },
        {
            "barcode": "171124616",
            "dpc": "03042336901",
            "name": "ចាន់ យ៉ា"
        },
        {
            "barcode": "171124617",
            "dpc": "03042334801",
            "name": "ប៊ុន រិទ្ធសុធេប"
        },
        {
            "barcode": "171124618",
            "dpc": "03042318101",
            "name": "ប៊ុន រិទ្ធលន់ដា"
        },
        {
            "barcode": "171124619",
            "dpc": "03042326001",
            "name": "ជួយ តាំង"
        },
        {
            "barcode": "171124620",
            "dpc": "03042326101",
            "name": "គង់ សុជាតិ"
        },
        {
            "barcode": "171124621",
            "dpc": "03042326301",
            "name": "ទិត្យ មុន្នីការ"
        },
        {
            "barcode": "171124622",
            "dpc": "03042326401",
            "name": "អាស្រមយាយជី"
        },
        {
            "barcode": "171124623",
            "dpc": "03042326501",
            "name": "លី នីម"
        },
        {
            "barcode": "171124624",
            "dpc": "03042326801",
            "name": "ឈឹម សារ៉ាត់"
        },
        {
            "barcode": "171124625",
            "dpc": "03042331601",
            "name": "ឆែម ចន្ថា"
        },
        {
            "barcode": "171124626",
            "dpc": "03042331701",
            "name": "ឆែម សាម៉ុន"
        },
        {
            "barcode": "171124627",
            "dpc": "03042326901",
            "name": "ទង ស៊្រី"
        },
        {
            "barcode": "171124628",
            "dpc": "03042316301",
            "name": "ឆែម រចនា"
        },
        {
            "barcode": "171124629",
            "dpc": "03042317101",
            "name": "គង់ យូរ៉ា"
        },
        {
            "barcode": "171124630",
            "dpc": "03042317001",
            "name": "អ៊ុយ រុន"
        },
        {
            "barcode": "171124631",
            "dpc": "03042316901",
            "name": "ម៉ៅ លីវ"
        },
        {
            "barcode": "171124632",
            "dpc": "03042316801",
            "name": "ម៉ក់ ថាវី"
        },
        {
            "barcode": "171124633",
            "dpc": "03042316501",
            "name": "គឹម នូ"
        },
        {
            "barcode": "171124634",
            "dpc": "03042316701",
            "name": "យី ទិត្យសាធកូរមី"
        },
        {
            "barcode": "171124635",
            "dpc": "03042316601",
            "name": "សយ សារុំ"
        },
        {
            "barcode": "171124636",
            "dpc": "03042316201",
            "name": "យ័ប ហុង"
        },
        {
            "barcode": "171124637",
            "dpc": "03042317201",
            "name": "យឹម ពឿត"
        },
        {
            "barcode": "171124638",
            "dpc": "03042317301",
            "name": "គឹម សារុំ"
        },
        {
            "barcode": "171124639",
            "dpc": "03042317401",
            "name": "គឹម សុមន"
        },
        {
            "barcode": "171124640",
            "dpc": "03042326701",
            "name": "កឹម សារុំ"
        },
        {
            "barcode": "171124641",
            "dpc": "03042317501",
            "name": "អ៊ិត រ៉ាស៊ី"
        },
        {
            "barcode": "171124642",
            "dpc": "03042346001",
            "name": "កុច រ៉ា ២"
        },
        {
            "barcode": "171124643",
            "dpc": "03042331901",
            "name": "ប៊ិត ជឹម"
        },
        {
            "barcode": "171124644",
            "dpc": "03042318001",
            "name": "ពៅ សាវើយ"
        },
        {
            "barcode": "171124645",
            "dpc": "03042340101",
            "name": "ពៅ សាវើយ ២"
        },
        {
            "barcode": "171124646",
            "dpc": "03042324201",
            "name": "បូរ សុភា"
        },
        {
            "barcode": "171124647",
            "dpc": "03042324601",
            "name": "ញ៉េប សោភ័ណ្ឌ"
        },
        {
            "barcode": "171124648",
            "dpc": "03042324501",
            "name": "ងូវ ញន"
        },
        {
            "barcode": "171124649",
            "dpc": "03042324401",
            "name": "ត្រង់ ពេក"
        },
        {
            "barcode": "171124650",
            "dpc": "03042324101",
            "name": "ហម ផា"
        },
        {
            "barcode": "171124651",
            "dpc": "03042324001",
            "name": "សឹង សុគន្ធារី"
        },
        {
            "barcode": "171124652",
            "dpc": "03042323801",
            "name": "សោ ប៊ុនរ៉េត"
        },
        {
            "barcode": "171124653",
            "dpc": "03042323701",
            "name": "ហម រតនា"
        },
        {
            "barcode": "171124654",
            "dpc": "03042323601",
            "name": "ស៊ិន ចំរ៉ាត់"
        },
        {
            "barcode": "171124655",
            "dpc": "03042323501",
            "name": "ញៀន ញុន"
        },
        {
            "barcode": "171124656",
            "dpc": "03042323401",
            "name": "សុខ ចំរើន"
        },
        {
            "barcode": "171124657",
            "dpc": "03042330201",
            "name": "វណ្ណ ចាន់ថា"
        },
        {
            "barcode": "171124658",
            "dpc": "03042342401",
            "name": "ប្រាក់ ស៊ីវន"
        },
        {
            "barcode": "171124659",
            "dpc": "03042324701",
            "name": "ខៀវ ផុន"
        },
        {
            "barcode": "171124660",
            "dpc": "03042324801",
            "name": "ស៊ឹម មួយគង់"
        },
        {
            "barcode": "171124661",
            "dpc": "03042341601",
            "name": "ដេត សារ័ត្ន"
        },
        {
            "barcode": "171124662",
            "dpc": "03042341501",
            "name": "ប៊ុន គឹមស៊ា"
        },
        {
            "barcode": "171124663",
            "dpc": "03042341401",
            "name": "ហួត ស៊ីវ៉ន"
        },
        {
            "barcode": "171124664",
            "dpc": "03042324901",
            "name": "គង់ ប៊ូ"
        },
        {
            "barcode": "171124665",
            "dpc": "03042325001",
            "name": "លាយ សាវែក"
        },
        {
            "barcode": "171124666",
            "dpc": "03042325101",
            "name": "ឡុច សំអឿន"
        },
        {
            "barcode": "171124667",
            "dpc": "03042330901",
            "name": "អេង ដុង"
        },
        {
            "barcode": "171124668",
            "dpc": "03042325201",
            "name": "រី សតបាត់ដំបង"
        },
        {
            "barcode": "171124669",
            "dpc": "03042325301",
            "name": "ចឹក ម៉ុយ"
        },
        {
            "barcode": "171124670",
            "dpc": "03042325401",
            "name": "ហ៊ីយ ថែប"
        },
        {
            "barcode": "171124671",
            "dpc": "03042325501",
            "name": "ស៊ិន សង់អឿប"
        },
        {
            "barcode": "171124672",
            "dpc": "03042346701",
            "name": "ពុន ឡាន់"
        },
        {
            "barcode": "171124673",
            "dpc": "03042346601",
            "name": "ឈឿន ប៊ុនលី"
        },
        {
            "barcode": "171124674",
            "dpc": "03042340801",
            "name": "គឹម ហៀង"
        },
        {
            "barcode": "171124675",
            "dpc": "03042325601",
            "name": "អ៊ឹង ហូវ"
        },
        {
            "barcode": "171124676",
            "dpc": "03042325701",
            "name": "គណៈបក្សវត្តគរ"
        },
        {
            "barcode": "171124677",
            "dpc": "03042329801",
            "name": "ដេត ស្រីទូច"
        },
        {
            "barcode": "171124678",
            "dpc": "03042325801",
            "name": "កែវ តាំងយ៉េត"
        },
        {
            "barcode": "171124679",
            "dpc": "03042337001",
            "name": "សុផល សុផានា"
        },
        {
            "barcode": "171124680",
            "dpc": "03042337101",
            "name": "តាំង ចុង"
        },
        {
            "barcode": "171124681",
            "dpc": "03042342801",
            "name": "លិញ ម្លិះ"
        },
        {
            "barcode": "171124682",
            "dpc": "03042342901",
            "name": "យិន រ៉ា"
        },
        {
            "barcode": "171124683",
            "dpc": "03042336001",
            "name": "ស៊ិន សង់អឿប"
        },
        {
            "barcode": "171124684",
            "dpc": "03042344001",
            "name": "ឈៀង ឈៀន"
        },
        {
            "barcode": "171124685",
            "dpc": "03042343901",
            "name": "វង្ស ធានី"
        },
        {
            "barcode": "171124686",
            "dpc": "03042343801",
            "name": "ទឹម សៀកឆេង"
        },
        {
            "barcode": "171124687",
            "dpc": "03042344501",
            "name": "មុំ អួន"
        },
        {
            "barcode": "171124688",
            "dpc": "03042329301",
            "name": "គណៈកម្មាធិការរៀបចំបោះឆ្នោត"
        },
        {
            "barcode": "171124689",
            "dpc": "03042329001",
            "name": "ផន សុភាព"
        },
        {
            "barcode": "171124690",
            "dpc": "03042328901",
            "name": "ម៉ាន សាម៉ន"
        },
        {
            "barcode": "171124691",
            "dpc": "03042328801",
            "name": "ម៉ន សាវ៉ាត"
        },
        {
            "barcode": "171124692",
            "dpc": "03042328701",
            "name": "ឡុង ផន"
        },
        {
            "barcode": "171124693",
            "dpc": "03042328601",
            "name": "សេក រដ្ឋា"
        },
        {
            "barcode": "171124694",
            "dpc": "03042328501",
            "name": "ឆែម សុឃិន"
        },
        {
            "barcode": "171124695",
            "dpc": "03042328401",
            "name": "កង វុទ្ធី"
        },
        {
            "barcode": "171124696",
            "dpc": "03042328301",
            "name": "កែវ សុផល"
        },
        {
            "barcode": "171124697",
            "dpc": "03042328201",
            "name": "កង ណាវី"
        },
        {
            "barcode": "171124698",
            "dpc": "03042328101",
            "name": "កង វុត្ថា"
        },
        {
            "barcode": "171124699",
            "dpc": "03042328001",
            "name": "កង វណ្ណដា"
        },
        {
            "barcode": "171124700",
            "dpc": "03042327901",
            "name": "កង វណ្ណី"
        },
        {
            "barcode": "171124701",
            "dpc": "03042327801",
            "name": "កៅ​ គឹមសៀន"
        },
        {
            "barcode": "171124702",
            "dpc": "03042327701",
            "name": "តាប់ សំណាង"
        },
        {
            "barcode": "171124703",
            "dpc": "03042327601",
            "name": "អ៊ី ស៊ីណែត"
        },
        {
            "barcode": "171124704",
            "dpc": "03042327501",
            "name": "ម៉ៅ សម្បូណ៍"
        },
        {
            "barcode": "171124705",
            "dpc": "03042327401",
            "name": "សួយ សុខាន់"
        },
        {
            "barcode": "171124706",
            "dpc": "03042327301",
            "name": "ម៉ៅ សម្បត្តិ"
        },
        {
            "barcode": "171124707",
            "dpc": "03042327201",
            "name": "រស់ ប៊ុនហែម"
        },
        {
            "barcode": "171124708",
            "dpc": "03042327101",
            "name": "ទូច ចរិយា"
        },
        {
            "barcode": "171124709",
            "dpc": "03042327001",
            "name": "ហេង លីស"
        },
        {
            "barcode": "171124710",
            "dpc": "03042331001",
            "name": "ជា ម៉ូលីកា"
        },
        {
            "barcode": "171124711",
            "dpc": "03042344101",
            "name": "យឹម កូឡា"
        },
        {
            "barcode": "171124712",
            "dpc": "03042341301",
            "name": "ហ៊ុម ប៊ុនឡា"
        },
        {
            "barcode": "171124713",
            "dpc": "03042339901",
            "name": "ញាណ ហាង"
        },
        {
            "barcode": "171124714",
            "dpc": "03042340001",
            "name": "ហង់ ឡាយអៀត២"
        },
        {
            "barcode": "171124715",
            "dpc": "03042335601",
            "name": "គុយ រិសិដ្ឋ"
        },
        {
            "barcode": "171124716",
            "dpc": "03042339201",
            "name": "អៀម ផល្លី"
        },
        {
            "barcode": "171124717",
            "dpc": "03042340401",
            "name": "អ៊ុយ សុទ្ធី"
        },
        {
            "barcode": "171124718",
            "dpc": "03042326601",
            "name": "ភិន ហេង"
        },
        {
            "barcode": "171124719",
            "dpc": "03042340301",
            "name": "ស៊ុត ផារឿន"
        },
        {
            "barcode": "171124720",
            "dpc": "03042339101",
            "name": "ងួន ស្គីដែន"
        },
        {
            "barcode": "171124721",
            "dpc": "03042339001",
            "name": "តុក គឹមស្រ៊ុន"
        },
        {
            "barcode": "171124722",
            "dpc": "03042331501",
            "name": "វ៉ន វឿត"
        },
        {
            "barcode": "171124723",
            "dpc": "03042330801",
            "name": "ពៅ លាង"
        },
        {
            "barcode": "171124724",
            "dpc": "03042330701",
            "name": "ឡេង វណ្ណា"
        },
        {
            "barcode": "171124725",
            "dpc": "03042330601",
            "name": "ឈុន សំបូរ័ត្ន"
        },
        {
            "barcode": "171124726",
            "dpc": "03042332001",
            "name": "ឆោម សុធារី"
        },
        {
            "barcode": "171124727",
            "dpc": "03042337501",
            "name": "សេង ចាន់លី"
        },
        {
            "barcode": "171124728",
            "dpc": "03042337201",
            "name": "ជា សុថានិត"
        },
        {
            "barcode": "171124729",
            "dpc": "03042325901",
            "name": "មឿន ឈឿន"
        },
        {
            "barcode": "171124730",
            "dpc": "03042344201",
            "name": "ក្រើក លួត"
        },
        {
            "barcode": "171124731",
            "dpc": "03042335001",
            "name": "ឌិត យ៉ាន"
        },
        {
            "barcode": "171124732",
            "dpc": "03042335101",
            "name": "ថូ ភិន"
        },
        {
            "barcode": "171124733",
            "dpc": "03042335501",
            "name": "គី គុយឡេង"
        },
        {
            "barcode": "171124734",
            "dpc": "03042343001",
            "name": "សេង ប៊ុនន្នី"
        },
        {
            "barcode": "171124735",
            "dpc": "03042345101",
            "name": "លឹម ឡុន"
        },
        {
            "barcode": "171124736",
            "dpc": "03042346201",
            "name": "ស៊ីវ៉ុន ខែមរ៉ុន២"
        },
        {
            "barcode": "171124737",
            "dpc": "03042343101",
            "name": "ភោគ ច័ន្ទសាវុន"
        },
        {
            "barcode": "171124738",
            "dpc": "03042335201",
            "name": "ញាណ កុសល"
        },
        {
            "barcode": "171124739",
            "dpc": "03042343201",
            "name": "វ៉យ គល់"
        },
        {
            "barcode": "171124740",
            "dpc": "03042346301",
            "name": "វាំង សុផល់"
        },
        {
            "barcode": "171124741",
            "dpc": "03042348001",
            "name": "ប៉ាច ផល្លា"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
