let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171129713",
            "dpc": "03012436401",
            "name": "ប៊ុតចាន់ ធី"
        },
        {
            "barcode": "171129714",
            "dpc": "03012436501",
            "name": "ជៀម ផារុំ"
        },
        {
            "barcode": "171129715",
            "dpc": "03012429801",
            "name": "សួន សុផល"
        },
        {
            "barcode": "171129716",
            "dpc": "03012424601",
            "name": "ហេង ឆាយ"
        },
        {
            "barcode": "171129717",
            "dpc": "03012422501",
            "name": "ចាយ បូរាន"
        },
        {
            "barcode": "171129718",
            "dpc": "03012427001",
            "name": "លី ទ្រឿង"
        },
        {
            "barcode": "171129719",
            "dpc": "03012427101",
            "name": "ឈៀង គឹមឈួន"
        },
        {
            "barcode": "171129720",
            "dpc": "03012427201",
            "name": "ជី យិន"
        },
        {
            "barcode": "171129721",
            "dpc": "03012413701",
            "name": "ផាន ទិត្យ"
        },
        {
            "barcode": "171129722",
            "dpc": "03012440001",
            "name": "អ៊ុំ ស៊ុយ"
        },
        {
            "barcode": "171129723",
            "dpc": "03012400501",
            "name": "នី ស្រីម៉ៅ"
        },
        {
            "barcode": "171129724",
            "dpc": "03012436001",
            "name": "ដែង វណ្ណនី"
        },
        {
            "barcode": "171129725",
            "dpc": "03012424501",
            "name": "ហេង ចាន់ថន"
        },
        {
            "barcode": "171129726",
            "dpc": "03012406201",
            "name": "លី ហុង"
        },
        {
            "barcode": "171129727",
            "dpc": "03012418601",
            "name": "សាញ់ សាន្ត"
        },
        {
            "barcode": "171129728",
            "dpc": "03012418701",
            "name": "យឹម ផល្លី"
        },
        {
            "barcode": "171129729",
            "dpc": "03012421901",
            "name": "ជឺ សំណាង"
        },
        {
            "barcode": "171129730",
            "dpc": "03012436801",
            "name": "ឆឹង ឆន"
        },
        {
            "barcode": "171129731",
            "dpc": "03012423101",
            "name": "សុខ សុភាព"
        },
        {
            "barcode": "171129732",
            "dpc": "03012422001",
            "name": "ធី សុផន"
        },
        {
            "barcode": "171129733",
            "dpc": "03012429901",
            "name": "ស៊ីម សារី"
        },
        {
            "barcode": "171129734",
            "dpc": "03012403901",
            "name": "ង៉ែត ប្រម"
        },
        {
            "barcode": "171129735",
            "dpc": "03012423001",
            "name": "ប៊ុត សាវង្ស២(អាស្រម)"
        },
        {
            "barcode": "171129736",
            "dpc": "03012430101",
            "name": "ខៀវ សែ"
        },
        {
            "barcode": "171129737",
            "dpc": "03012436101",
            "name": "ហេង កាវជា"
        },
        {
            "barcode": "171129738",
            "dpc": "03012430401",
            "name": "យឿត ស៊ីថា"
        },
        {
            "barcode": "171129739",
            "dpc": "03012414401",
            "name": "យឹម សម្រស់"
        },
        {
            "barcode": "171129740",
            "dpc": "03012442801",
            "name": "យិន ហ៊ាប"
        },
        {
            "barcode": "171129741",
            "dpc": "03012437101",
            "name": "ចាន់ ម៉េង"
        },
        {
            "barcode": "171129742",
            "dpc": "03012438701",
            "name": "ណន អុន"
        },
        {
            "barcode": "171129743",
            "dpc": "03012440901",
            "name": "អ៊ា មករា"
        },
        {
            "barcode": "171129744",
            "dpc": "03012420301",
            "name": "ស៊ុន សុផាត"
        },
        {
            "barcode": "171129745",
            "dpc": "03012420401",
            "name": "បេង ចេង"
        },
        {
            "barcode": "171129746",
            "dpc": "03012434301",
            "name": "វង្ស សុខយ៉េម"
        },
        {
            "barcode": "171129747",
            "dpc": "03012437001",
            "name": "ឡុង សំបូរ"
        },
        {
            "barcode": "171129748",
            "dpc": "03012433001",
            "name": "អ៊ុំ វណ្ណៈ"
        },
        {
            "barcode": "171129749",
            "dpc": "03012447001",
            "name": "ចត សុផានី"
        },
        {
            "barcode": "171129750",
            "dpc": "03012436301",
            "name": "សេង សារ៉េត"
        },
        {
            "barcode": "171129751",
            "dpc": "03012446901",
            "name": "សុខ ធូក"
        },
        {
            "barcode": "171129752",
            "dpc": "03012443201",
            "name": "សេង នី"
        },
        {
            "barcode": "171129753",
            "dpc": "03012402301",
            "name": "រ៉ាយ នី"
        },
        {
            "barcode": "171129754",
            "dpc": "03012403001",
            "name": "ឆោម ឆដា"
        },
        {
            "barcode": "171129755",
            "dpc": "03012439301",
            "name": "ប៉ាង គឹមស៊ា"
        },
        {
            "barcode": "171129756",
            "dpc": "03012418901",
            "name": "អយ ដេវី"
        },
        {
            "barcode": "171129757",
            "dpc": "03012430201",
            "name": "ហម សាម៉េត"
        },
        {
            "barcode": "171129758",
            "dpc": "03012414301",
            "name": "ទូច ជឹម"
        },
        {
            "barcode": "171129759",
            "dpc": "03012421701",
            "name": "គង់ ជុនដា"
        },
        {
            "barcode": "171129760",
            "dpc": "03012420501",
            "name": "គឹម សង"
        },
        {
            "barcode": "171129761",
            "dpc": "03012430701",
            "name": "ជូ កែវពិសិទ្ធ"
        },
        {
            "barcode": "171129762",
            "dpc": "03012414701",
            "name": "ម៉ែន សំបូរ"
        },
        {
            "barcode": "171129763",
            "dpc": "03012430601",
            "name": "អ៊ុច សិទ្ធិ"
        },
        {
            "barcode": "171129764",
            "dpc": "03012400301",
            "name": "ឡុង ផាវុទ្ធីយ៉ា"
        },
        {
            "barcode": "171129765",
            "dpc": "03012447401",
            "name": "លី ស៊ីណា"
        },
        {
            "barcode": "171129766",
            "dpc": "03012424701",
            "name": "លី មន្នី"
        },
        {
            "barcode": "171129767",
            "dpc": "03012413501",
            "name": "នរៈ កិត្យា"
        },
        {
            "barcode": "171129768",
            "dpc": "03012413601",
            "name": "សែម សារ៉ាត់"
        },
        {
            "barcode": "171129769",
            "dpc": "03012411901",
            "name": "លោភ សំអាង"
        },
        {
            "barcode": "171129770",
            "dpc": "03012402101",
            "name": "ប៉ង សុភ័ណ្ឌ"
        },
        {
            "barcode": "171129771",
            "dpc": "03012406001",
            "name": "ឃឹម សុគន្ធា"
        },
        {
            "barcode": "171129772",
            "dpc": "03012405701",
            "name": "រាជ កែវសុវណ្ណៈ"
        },
        {
            "barcode": "171129773",
            "dpc": "03012421001",
            "name": "អ៊ី សេងឡុង"
        },
        {
            "barcode": "171129774",
            "dpc": "03012405801",
            "name": "គង់ សារ៉េត"
        },
        {
            "barcode": "171129775",
            "dpc": "03012413901",
            "name": "តាំង សុខកាង"
        },
        {
            "barcode": "171129776",
            "dpc": "03012438801",
            "name": "អឿន តុញ"
        },
        {
            "barcode": "171129777",
            "dpc": "03012433201",
            "name": "ប្រាក់ ចន្ធូ"
        },
        {
            "barcode": "171129778",
            "dpc": "03012414201",
            "name": "ស៊្រីន សុគន្ធថូ"
        },
        {
            "barcode": "171129779",
            "dpc": "03012414601",
            "name": "ម៉ុន សារិទ្ធ"
        },
        {
            "barcode": "171129780",
            "dpc": "03012414501",
            "name": "មាស ស្រី"
        },
        {
            "barcode": "171129781",
            "dpc": "03012445101",
            "name": "គីវ គឹមផា"
        },
        {
            "barcode": "171129782",
            "dpc": "03012432301",
            "name": "ពេជ្រ សារិទ្ធ"
        },
        {
            "barcode": "171129783",
            "dpc": "03012405901",
            "name": "ប៉ា សុធារី"
        },
        {
            "barcode": "171129784",
            "dpc": "03012430501",
            "name": "អ៊ី រី"
        },
        {
            "barcode": "171129785",
            "dpc": "03012405101",
            "name": "តាំង មុយយូម"
        },
        {
            "barcode": "171129786",
            "dpc": "03012414801",
            "name": "ញេប គង់"
        },
        {
            "barcode": "171129787",
            "dpc": "03012414901",
            "name": "ដូង ស៊ីថា"
        },
        {
            "barcode": "171129788",
            "dpc": "03012423201",
            "name": "ដា ស៊ីដេត"
        },
        {
            "barcode": "171129789",
            "dpc": "03012419101",
            "name": "ម៉ាន់ ប្រុស"
        },
        {
            "barcode": "171129790",
            "dpc": "03012411501",
            "name": "លាង ផាន់ដេត"
        },
        {
            "barcode": "171129791",
            "dpc": "03012411601",
            "name": "សំ ចិន្តា"
        },
        {
            "barcode": "171129792",
            "dpc": "03012413401",
            "name": "ស្រួច លីម"
        },
        {
            "barcode": "171129793",
            "dpc": "03012434401",
            "name": "រស់ អួម"
        },
        {
            "barcode": "171129794",
            "dpc": "03012401601",
            "name": "គឹម អាន ២"
        },
        {
            "barcode": "171129795",
            "dpc": "03012433501",
            "name": "សន សុផល"
        },
        {
            "barcode": "171129796",
            "dpc": "03012418801",
            "name": "រាយ សំអាត"
        },
        {
            "barcode": "171129797",
            "dpc": "03012404901",
            "name": "សៅ សំណាង"
        },
        {
            "barcode": "171129798",
            "dpc": "03012427801",
            "name": "អ៊ិន សុឃឿន"
        },
        {
            "barcode": "171129799",
            "dpc": "03012427501",
            "name": "ថន សុភារម្យ"
        },
        {
            "barcode": "171129800",
            "dpc": "03012427601",
            "name": "ថេត នារ័ត្ត"
        },
        {
            "barcode": "171129801",
            "dpc": "03012427701",
            "name": "ភិត ទុន"
        },
        {
            "barcode": "171129802",
            "dpc": "03012442901",
            "name": "ព្រុយ ហ៊ីង"
        },
        {
            "barcode": "171129803",
            "dpc": "03012438901",
            "name": "កើង ស្រីយ៉ា"
        },
        {
            "barcode": "171129804",
            "dpc": "03012436601",
            "name": "ឈុន បូរ៉ា"
        },
        {
            "barcode": "171129805",
            "dpc": "03012439801",
            "name": "ចាន់ សម្បត្តិ"
        },
        {
            "barcode": "171129806",
            "dpc": "03012439101",
            "name": "សំ ប្រសិទ្ធ"
        },
        {
            "barcode": "171129807",
            "dpc": "03012439701",
            "name": "ទិត សេដ្ឋា"
        },
        {
            "barcode": "171129808",
            "dpc": "03012447601",
            "name": "ថាច់ សុខពិសី"
        },
        {
            "barcode": "171129809",
            "dpc": "03012433901",
            "name": "មាស ស៊ីណាត"
        },
        {
            "barcode": "171129810",
            "dpc": "03012404101",
            "name": "ណៃ រតនា"
        },
        {
            "barcode": "171129811",
            "dpc": "03012447901",
            "name": "ភិន ណៃ"
        },
        {
            "barcode": "171129812",
            "dpc": "03012447501",
            "name": "ញៀវ ញឹម"
        },
        {
            "barcode": "171129813",
            "dpc": "03012427901",
            "name": "ប៉ោ វ៉ាត"
        },
        {
            "barcode": "171129814",
            "dpc": "03012413301",
            "name": "នូ សាណាល់"
        },
        {
            "barcode": "171129815",
            "dpc": "03012440101",
            "name": "តាន់ វឌ្ឍនី"
        },
        {
            "barcode": "171129816",
            "dpc": "03012440201",
            "name": "ពេញ ដារ៉ារដ្ឋ"
        },
        {
            "barcode": "171129817",
            "dpc": "03012440301",
            "name": "គឹម សង្ហា"
        },
        {
            "barcode": "171129818",
            "dpc": "03012440401",
            "name": "សែប សុផល"
        },
        {
            "barcode": "171129819",
            "dpc": "03012440501",
            "name": "ហូរ រិម"
        },
        {
            "barcode": "171129820",
            "dpc": "03012445601",
            "name": "ញ៉ូវ ចាន់រ៉ា"
        },
        {
            "barcode": "171129821",
            "dpc": "03012440801",
            "name": "លឹម សុធី"
        },
        {
            "barcode": "171129822",
            "dpc": "03012447201",
            "name": "រ៉ុង ស៊ីដែន"
        },
        {
            "barcode": "171129823",
            "dpc": "03012436201",
            "name": "គឿន រ៉ូម៉ា"
        },
        {
            "barcode": "171129824",
            "dpc": "03012405301",
            "name": "ឡុង ប៊ុនសេង"
        },
        {
            "barcode": "171129825",
            "dpc": "03012427301",
            "name": "ព្រហ្ម សម្បត្តិ"
        },
        {
            "barcode": "171129826",
            "dpc": "03012405401",
            "name": "ជឺ សុខា"
        },
        {
            "barcode": "171129827",
            "dpc": "03012400601",
            "name": "គឹម ពន្លក"
        },
        {
            "barcode": "171129828",
            "dpc": "03012400701",
            "name": "សុខ សេង"
        },
        {
            "barcode": "171129829",
            "dpc": "03012401101",
            "name": "ហុង ហ៊"
        },
        {
            "barcode": "171129830",
            "dpc": "03012401501",
            "name": "ទូច គឹមសាន"
        },
        {
            "barcode": "171129831",
            "dpc": "03012401801",
            "name": "ឡូវ តេកហេង"
        },
        {
            "barcode": "171129832",
            "dpc": "03012402901",
            "name": "ហេង ណារិទ្ធ"
        },
        {
            "barcode": "171129833",
            "dpc": "03012404001",
            "name": "ស៊ុម សំណាង"
        },
        {
            "barcode": "171129834",
            "dpc": "03012404701",
            "name": "ឃុន វ៉ាន់ថា"
        },
        {
            "barcode": "171129835",
            "dpc": "03012405001",
            "name": "ស៊ីម ឡៃ"
        },
        {
            "barcode": "171129836",
            "dpc": "03012407601",
            "name": "ប៊ូ ប៊ុនសុង"
        },
        {
            "barcode": "171129837",
            "dpc": "03012408201",
            "name": "ភិន ស៊ីដែន"
        },
        {
            "barcode": "171129838",
            "dpc": "03012409901",
            "name": "ឥន សុវណ្ណា"
        },
        {
            "barcode": "171129839",
            "dpc": "03012411301",
            "name": "អ៊ូ វ៉ាន់ធឿន"
        },
        {
            "barcode": "171129840",
            "dpc": "03012411401",
            "name": "ឈៀង សុភី"
        },
        {
            "barcode": "171129841",
            "dpc": "03012413001",
            "name": "អូច អែម"
        },
        {
            "barcode": "171129842",
            "dpc": "03012415901",
            "name": "ភីវ ចំរើន"
        },
        {
            "barcode": "171129843",
            "dpc": "03012416101",
            "name": "ឈុន សម្បត្តិ"
        },
        {
            "barcode": "171129844",
            "dpc": "03012416601",
            "name": "ទូច មករា"
        },
        {
            "barcode": "171129845",
            "dpc": "03012418001",
            "name": "គង់ បណ្តូល"
        },
        {
            "barcode": "171129846",
            "dpc": "03012418201",
            "name": "លឿង សុភក្ត្រ័"
        },
        {
            "barcode": "171129847",
            "dpc": "03012418401",
            "name": "ចែម ធី"
        },
        {
            "barcode": "171129848",
            "dpc": "03012419201",
            "name": "សែម ទូច"
        },
        {
            "barcode": "171129849",
            "dpc": "03012419401",
            "name": "រ៉ែម បូរ៉ា"
        },
        {
            "barcode": "171129850",
            "dpc": "03012419601",
            "name": "អំ ផល្លី"
        },
        {
            "barcode": "171129851",
            "dpc": "03012419701",
            "name": "លី ហុង"
        },
        {
            "barcode": "171129852",
            "dpc": "03012420101",
            "name": "ប៉ិច ជិនដារ៉ា"
        },
        {
            "barcode": "171129853",
            "dpc": "03012420201",
            "name": "តាន់ ស៊ុនលាង"
        },
        {
            "barcode": "171129854",
            "dpc": "03012421301",
            "name": "ឈួរ ម៉េងឆ័រ"
        },
        {
            "barcode": "171129855",
            "dpc": "03012421601",
            "name": "សេង ដាវ៉ីត"
        },
        {
            "barcode": "171129856",
            "dpc": "03012422101",
            "name": "អួង ណារ៉ុម"
        },
        {
            "barcode": "171129857",
            "dpc": "03012422201",
            "name": "ឆាត់ ឆាយមោរ៉ា"
        },
        {
            "barcode": "171129858",
            "dpc": "03012422301",
            "name": "លត យ៉ុម"
        },
        {
            "barcode": "171129859",
            "dpc": "03012422401",
            "name": "ទូត រុំម្លាស់ ២"
        },
        {
            "barcode": "171129860",
            "dpc": "03012423501",
            "name": "ឃឿង ហ៊ួ"
        },
        {
            "barcode": "171129861",
            "dpc": "03012423901",
            "name": "សុខ សូនី"
        },
        {
            "barcode": "171129862",
            "dpc": "03012426101",
            "name": "ម៉ិល ស៊ុត"
        },
        {
            "barcode": "171129863",
            "dpc": "03012426301",
            "name": "លី មាលីស"
        },
        {
            "barcode": "171129864",
            "dpc": "03012426701",
            "name": "តាំង សៀងហៃ"
        },
        {
            "barcode": "171129865",
            "dpc": "03012428801",
            "name": "ឆេង ប៊ុនថេង"
        },
        {
            "barcode": "171129866",
            "dpc": "03012428901",
            "name": "បឿន យិក"
        },
        {
            "barcode": "171129867",
            "dpc": "03012429401",
            "name": "ឃីម ប៊ុនផេង"
        },
        {
            "barcode": "171129868",
            "dpc": "03012429501",
            "name": "គាំ សុផល"
        },
        {
            "barcode": "171129869",
            "dpc": "03012429601",
            "name": "គង់ រុំ"
        },
        {
            "barcode": "171129870",
            "dpc": "03012430001",
            "name": "ងី ឡាក់"
        },
        {
            "barcode": "171129871",
            "dpc": "03012431801",
            "name": "ធី ហ៊ួរ"
        },
        {
            "barcode": "171129872",
            "dpc": "03012432201",
            "name": "វ៉ា មុន្នីរដ្ឋ"
        },
        {
            "barcode": "171129873",
            "dpc": "03012432901",
            "name": "យ៉ម ចំរើន"
        },
        {
            "barcode": "171129874",
            "dpc": "03012433601",
            "name": "ជា ផល្លា"
        },
        {
            "barcode": "171129875",
            "dpc": "03012434001",
            "name": "ប៊ុន សួលាងសុង"
        },
        {
            "barcode": "171129876",
            "dpc": "03012435701",
            "name": "ម៉ៅ ធីតា"
        },
        {
            "barcode": "171129877",
            "dpc": "03012435801",
            "name": "វ៉ាន សុឃីម"
        },
        {
            "barcode": "171129878",
            "dpc": "03012436701",
            "name": "អឿម ចាន់ណារដ្ឋ"
        },
        {
            "barcode": "171129879",
            "dpc": "03012437201",
            "name": "មុំ ធីយ៉ា"
        },
        {
            "barcode": "171129880",
            "dpc": "03012437301",
            "name": "គឹម សុខសាន្ត"
        },
        {
            "barcode": "171129881",
            "dpc": "03012437401",
            "name": "ឡុង ពៅ"
        },
        {
            "barcode": "171129882",
            "dpc": "03012438501",
            "name": "ណៃ សុឃាង"
        },
        {
            "barcode": "171129883",
            "dpc": "03012439501",
            "name": "ផុន វណ្ណនិត"
        },
        {
            "barcode": "171129884",
            "dpc": "03012439901",
            "name": "អ៊ុង យឿន"
        },
        {
            "barcode": "171129885",
            "dpc": "03012440601",
            "name": "នូ ផល្លី"
        },
        {
            "barcode": "171129886",
            "dpc": "03012441101",
            "name": "ទី សុភិន"
        },
        {
            "barcode": "171129887",
            "dpc": "03012441701",
            "name": "អ៊ាន ធឿន"
        },
        {
            "barcode": "171129888",
            "dpc": "03012442201",
            "name": "សាលាបឋមសិក្សាអន្លង់វិល"
        },
        {
            "barcode": "171129889",
            "dpc": "03012442301",
            "name": "លី រតនៈ"
        },
        {
            "barcode": "171129890",
            "dpc": "03012442501",
            "name": "សុខ សាមុត"
        },
        {
            "barcode": "171129891",
            "dpc": "03012442701",
            "name": "បេ បេត"
        },
        {
            "barcode": "171129892",
            "dpc": "03012443601",
            "name": "លឿង សុតុល"
        },
        {
            "barcode": "171129893",
            "dpc": "03012444301",
            "name": "ប្រុក គឿន ៤"
        },
        {
            "barcode": "171129894",
            "dpc": "03012444801",
            "name": "ម៉ែន ផាត"
        },
        {
            "barcode": "171129895",
            "dpc": "03012444901",
            "name": "ហង់ បូរីណា"
        },
        {
            "barcode": "171129896",
            "dpc": "03012445201",
            "name": "ញ៉ុក ចំរើន"
        },
        {
            "barcode": "171129897",
            "dpc": "03012445301",
            "name": "ម៉ែន ផល្លី"
        },
        {
            "barcode": "171129898",
            "dpc": "03012445401",
            "name": "ងួន ហ្សឺឌី"
        },
        {
            "barcode": "171129899",
            "dpc": "03012445501",
            "name": "វែង គឹមលី"
        },
        {
            "barcode": "171129900",
            "dpc": "03012445901",
            "name": "ខាត់ ហ៊ួរ"
        },
        {
            "barcode": "171129901",
            "dpc": "03012446501",
            "name": "សិទ្ធិ ហុងស៊ិន"
        },
        {
            "barcode": "171129902",
            "dpc": "03012447101",
            "name": "ទី សុខ"
        },
        {
            "barcode": "171129903",
            "dpc": "03012447701",
            "name": "នុន សំបូរ"
        },
        {
            "barcode": "171129904",
            "dpc": "03012447801",
            "name": "លី យ៉ាត"
        },
        {
            "barcode": "171129905",
            "dpc": "03012418101",
            "name": "ប៊ុន រ៉ាឌី"
        },
        {
            "barcode": "171129906",
            "dpc": "03012434701",
            "name": "ឈឹន ឈុន"
        },
        {
            "barcode": "171129907",
            "dpc": "03012402001",
            "name": "អៀប ផាត"
        },
        {
            "barcode": "171129908",
            "dpc": "03012420801",
            "name": "ងិន ពៅ"
        },
        {
            "barcode": "171129909",
            "dpc": "03012443401",
            "name": "ហួត ឆេងលី"
        },
        {
            "barcode": "171129910",
            "dpc": "03012429201",
            "name": "លួង ប្រាថ្នា"
        },
        {
            "barcode": "171129911",
            "dpc": "03012433101",
            "name": "ង៉ែត ផារិន"
        },
        {
            "barcode": "171129912",
            "dpc": "03012441001",
            "name": "ទុំ ស៊ីណាត"
        },
        {
            "barcode": "171129913",
            "dpc": "03012445701",
            "name": "ស៊ុយ សំណាង"
        },
        {
            "barcode": "171129914",
            "dpc": "03012412301",
            "name": "ទិត្យ ចន្នី"
        },
        {
            "barcode": "171129915",
            "dpc": "03012434901",
            "name": "មល់ សាហឿម"
        },
        {
            "barcode": "171129916",
            "dpc": "03012438201",
            "name": "ហ៊ុន ហ៊ី"
        },
        {
            "barcode": "171129917",
            "dpc": "03012438601",
            "name": "ជួន សុផុន"
        },
        {
            "barcode": "171129918",
            "dpc": "03012403101",
            "name": "ពេជ្រ ស្រីកែវ"
        },
        {
            "barcode": "171129919",
            "dpc": "03012445801",
            "name": "វុត ស៊ីនួន"
        },
        {
            "barcode": "171129920",
            "dpc": "03012420701",
            "name": "អៀប រដ្ឋា"
        },
        {
            "barcode": "171129921",
            "dpc": "03012402201",
            "name": "ឡុង ប៊ុនម៉េង"
        },
        {
            "barcode": "171129922",
            "dpc": "03012424901",
            "name": "ម៉ី អេង"
        },
        {
            "barcode": "171129923",
            "dpc": "03012406101",
            "name": "គី ឋាមរ៉ា"
        },
        {
            "barcode": "171129924",
            "dpc": "03012432401",
            "name": "តាង ម៉ារីន"
        },
        {
            "barcode": "171129925",
            "dpc": "03012422801",
            "name": "រឿម កង"
        },
        {
            "barcode": "171129926",
            "dpc": "03012415801",
            "name": "ពុំ ភិរម្យ"
        },
        {
            "barcode": "171129927",
            "dpc": "03012438401",
            "name": "យ៉ាំ ចិត្រា"
        },
        {
            "barcode": "171129928",
            "dpc": "03012415501",
            "name": "ឡាំង លីអៀង"
        },
        {
            "barcode": "171129929",
            "dpc": "03012444601",
            "name": "ភឿក ឡុងឌី"
        },
        {
            "barcode": "171129930",
            "dpc": "03012415701",
            "name": "អ៊ុំ អង"
        },
        {
            "barcode": "171129931",
            "dpc": "03012444701",
            "name": "ឡុង ម៉ារ៉ា"
        },
        {
            "barcode": "171129932",
            "dpc": "03012404201",
            "name": "លី ហេង"
        },
        {
            "barcode": "171129933",
            "dpc": "03012439001",
            "name": "ទូច ផានី"
        },
        {
            "barcode": "171129934",
            "dpc": "03012430901",
            "name": "ព្រំ ឈឺន"
        },
        {
            "barcode": "171129935",
            "dpc": "03012431001",
            "name": "ឆាយ រិទ្ធី"
        },
        {
            "barcode": "171129936",
            "dpc": "03012431101",
            "name": "ទូច ចានណារី"
        },
        {
            "barcode": "171129937",
            "dpc": "03012412401",
            "name": "សយ វ័យ"
        },
        {
            "barcode": "171129938",
            "dpc": "03012435101",
            "name": "ពេជ្រ សុភា"
        },
        {
            "barcode": "171129939",
            "dpc": "03012438101",
            "name": "ឡាយ វ៉ិត"
        },
        {
            "barcode": "171129940",
            "dpc": "03012435001",
            "name": "អ៊ុក សុវណ្ណ"
        },
        {
            "barcode": "171129941",
            "dpc": "03012412801",
            "name": "ប៊ូ សុជាត"
        },
        {
            "barcode": "171129942",
            "dpc": "03012438301",
            "name": "ហួន ចិត្រា"
        },
        {
            "barcode": "171129943",
            "dpc": "03012438001",
            "name": "សុខ នឿន"
        },
        {
            "barcode": "171129944",
            "dpc": "03012425101",
            "name": "ខេង ផល្លា"
        },
        {
            "barcode": "171129945",
            "dpc": "03012412701",
            "name": "រស វិចិត្រ"
        },
        {
            "barcode": "171129946",
            "dpc": "03012412601",
            "name": "យុត សោភ័ណ្ឌ"
        },
        {
            "barcode": "171129947",
            "dpc": "03012403201",
            "name": "ពេជ្រ សេរីទុំ"
        },
        {
            "barcode": "171129948",
            "dpc": "03012444401",
            "name": "សាន់ សល់"
        },
        {
            "barcode": "171129949",
            "dpc": "03012400901",
            "name": "ចូត ប៊ុនណាវី"
        },
        {
            "barcode": "171129950",
            "dpc": "03012434801",
            "name": "នូ គឹមស៊ុង"
        },
        {
            "barcode": "171129951",
            "dpc": "03012405601",
            "name": "ហាក់ ស៊ី"
        },
        {
            "barcode": "171129952",
            "dpc": "03012444501",
            "name": "ប៉ុញ សុវណ្ណរិទ្ធ ២"
        },
        {
            "barcode": "171129953",
            "dpc": "03012405501",
            "name": "ឆែម ប៊ុនធឿន"
        },
        {
            "barcode": "171129954",
            "dpc": "03012417401",
            "name": "អុក គីមឡា"
        },
        {
            "barcode": "171129955",
            "dpc": "03012417501",
            "name": "ឈុន សារិទ្ធ"
        },
        {
            "barcode": "171129956",
            "dpc": "03012428401",
            "name": "អ៊ឹង គឺ"
        },
        {
            "barcode": "171129957",
            "dpc": "03012428301",
            "name": "ធូរ៉េ វត្តី ២"
        },
        {
            "barcode": "171129958",
            "dpc": "03012412001",
            "name": "លី សុផល"
        },
        {
            "barcode": "171129959",
            "dpc": "03012419901",
            "name": "ឆុន សុភាព"
        },
        {
            "barcode": "171129960",
            "dpc": "03012428201",
            "name": "ខេង សុធា"
        },
        {
            "barcode": "171129961",
            "dpc": "03012443301",
            "name": "អ៊ុច សាវន"
        },
        {
            "barcode": "171129962",
            "dpc": "03012404601",
            "name": "យឿន ប៊ុនធី"
        },
        {
            "barcode": "171129963",
            "dpc": "03012416001",
            "name": "លី ហាក"
        },
        {
            "barcode": "171129964",
            "dpc": "03012402801",
            "name": "ឈឹម សារ៉ន"
        },
        {
            "barcode": "171129965",
            "dpc": "03012408501",
            "name": "ងិន សាវុន"
        },
        {
            "barcode": "171129966",
            "dpc": "03012419001",
            "name": "លៀង ហួត"
        },
        {
            "barcode": "171129967",
            "dpc": "03012408601",
            "name": "ម៉ែន ឆាយ"
        },
        {
            "barcode": "171129968",
            "dpc": "03012408901",
            "name": "ខៀវ សាវឿន"
        },
        {
            "barcode": "171129969",
            "dpc": "03012409001",
            "name": "ថន ប៊ុនថុង"
        },
        {
            "barcode": "171129970",
            "dpc": "03012409101",
            "name": "អ៊ុយ ម៉ៃ"
        },
        {
            "barcode": "171129971",
            "dpc": "03012409201",
            "name": "សុខ ប៊ុនធឿន"
        },
        {
            "barcode": "171129972",
            "dpc": "03012409301",
            "name": "ពៅ ឃួន"
        },
        {
            "barcode": "171129973",
            "dpc": "03012409401",
            "name": "ពៅ ហ៊ុច"
        },
        {
            "barcode": "171129974",
            "dpc": "03012409501",
            "name": "ង៉ែត សុភ័ណ"
        },
        {
            "barcode": "171129975",
            "dpc": "03012409601",
            "name": "អួម សុភាព"
        },
        {
            "barcode": "171129976",
            "dpc": "03012410201",
            "name": "ស៊ុន សុភាព"
        },
        {
            "barcode": "171129977",
            "dpc": "03012410101",
            "name": "ផុន ស៊ីណាត"
        },
        {
            "barcode": "171129978",
            "dpc": "03012413801",
            "name": "ចាន ស៊ីថា"
        },
        {
            "barcode": "171129979",
            "dpc": "03012410001",
            "name": "ប្រាក់ យ៉ា"
        },
        {
            "barcode": "171129980",
            "dpc": "03012410301",
            "name": "សូ ចាន់ថា"
        },
        {
            "barcode": "171129981",
            "dpc": "03012409801",
            "name": "ពៅ វី"
        },
        {
            "barcode": "171129982",
            "dpc": "03012409701",
            "name": "ឡុង ខុន"
        },
        {
            "barcode": "171129983",
            "dpc": "03012402501",
            "name": "សុខ ធឹមហ៊ាង"
        },
        {
            "barcode": "171129984",
            "dpc": "03012402601",
            "name": "ព្រាប សុប៊ុន"
        },
        {
            "barcode": "171129985",
            "dpc": "03012408001",
            "name": "ជឹម វីតា"
        },
        {
            "barcode": "171129986",
            "dpc": "03012411801",
            "name": "ម៉េង លាង"
        },
        {
            "barcode": "171129987",
            "dpc": "03012401201",
            "name": "អាន សារាយ"
        },
        {
            "barcode": "171129988",
            "dpc": "03012408101",
            "name": "សំរិត គឹម"
        },
        {
            "barcode": "171129989",
            "dpc": "03012401001",
            "name": "យ៉ាង យ៉ុង"
        },
        {
            "barcode": "171129990",
            "dpc": "03012426401",
            "name": "សុខ សុផុន"
        },
        {
            "barcode": "171129991",
            "dpc": "03012407401",
            "name": "ឡី ស៊ីណា"
        },
        {
            "barcode": "171129992",
            "dpc": "03012407301",
            "name": "ថេន សុក្ខៈ"
        },
        {
            "barcode": "171129993",
            "dpc": "03012407201",
            "name": "ថេន ស្រីរុំ"
        },
        {
            "barcode": "171129994",
            "dpc": "03012407101",
            "name": "សាលសហគមន័"
        },
        {
            "barcode": "171129995",
            "dpc": "03012407001",
            "name": "ឈួត បូរី"
        },
        {
            "barcode": "171129996",
            "dpc": "03012407801",
            "name": "កង អាត"
        },
        {
            "barcode": "171129997",
            "dpc": "03012407701",
            "name": "ឈឹម គី"
        },
        {
            "barcode": "171129998",
            "dpc": "03012426901",
            "name": "លី ឡាង"
        },
        {
            "barcode": "171129999",
            "dpc": "03012406801",
            "name": "ផែង ផាត"
        },
        {
            "barcode": "171130000",
            "dpc": "03012407501",
            "name": "កង សារី"
        },
        {
            "barcode": "171130001",
            "dpc": "03012406701",
            "name": "ហែល រតនា"
        },
        {
            "barcode": "171130002",
            "dpc": "03012401901",
            "name": "ទូច សោភ័ណ"
        },
        {
            "barcode": "171130003",
            "dpc": "03012426801",
            "name": "ឆាន់ សូភី"
        },
        {
            "barcode": "171130004",
            "dpc": "03012401701",
            "name": "លឿង ពៅ"
        },
        {
            "barcode": "171130005",
            "dpc": "03012406601",
            "name": "ប៊ី សុភាព"
        },
        {
            "barcode": "171130006",
            "dpc": "03012406501",
            "name": "រឿន ផល"
        },
        {
            "barcode": "171130007",
            "dpc": "03012406401",
            "name": "ហម ថៃ"
        },
        {
            "barcode": "171130008",
            "dpc": "03012429001",
            "name": "សាត ធីដា"
        },
        {
            "barcode": "171130009",
            "dpc": "03012406301",
            "name": "សឿន ម៉េងទ្រី"
        },
        {
            "barcode": "171130010",
            "dpc": "03012429701",
            "name": "អ៊ុំ ឆៃ"
        },
        {
            "barcode": "171130011",
            "dpc": "03012408401",
            "name": "ហម សាឃឿន"
        },
        {
            "barcode": "171130012",
            "dpc": "03012407901",
            "name": "ជ័យ សុភាព"
        },
        {
            "barcode": "171130013",
            "dpc": "03012439401",
            "name": "បឹង កូឡាប"
        },
        {
            "barcode": "171130014",
            "dpc": "03012417201",
            "name": "សុខ ចាន់រិទ្ធី"
        },
        {
            "barcode": "171130015",
            "dpc": "03012414101",
            "name": "សាំង ប៊ុនថេន"
        },
        {
            "barcode": "171130016",
            "dpc": "03012433401",
            "name": "ជា សៀ"
        },
        {
            "barcode": "171130017",
            "dpc": "03012433301",
            "name": "ហែម សុផល"
        },
        {
            "barcode": "171130018",
            "dpc": "03012417301",
            "name": "ជា គឹមលី"
        },
        {
            "barcode": "171130019",
            "dpc": "03012423401",
            "name": "ប្រាក់ សៅវីរី"
        },
        {
            "barcode": "171130020",
            "dpc": "03012423301",
            "name": "ប្រាក់ សុភាព"
        },
        {
            "barcode": "171130021",
            "dpc": "03012446201",
            "name": "វ៉ា ដារិន"
        },
        {
            "barcode": "171130022",
            "dpc": "03012441201",
            "name": "ទូច សូភី"
        },
        {
            "barcode": "171130023",
            "dpc": "03012429301",
            "name": "ឈុយ ឆៃយ៉ា"
        },
        {
            "barcode": "171130024",
            "dpc": "03012434201",
            "name": "ចាន់ ចិន្ថា"
        },
        {
            "barcode": "171130025",
            "dpc": "03012434101",
            "name": "កែន ទុយ"
        },
        {
            "barcode": "171130026",
            "dpc": "03012443101",
            "name": "សាលារៀន ១៣មករា"
        },
        {
            "barcode": "171130027",
            "dpc": "03012439201",
            "name": "យ៉ាល សំអ៊ុល"
        },
        {
            "barcode": "171130028",
            "dpc": "03012435901",
            "name": "ថេន ព្រលឹង"
        },
        {
            "barcode": "171130029",
            "dpc": "03012434501",
            "name": "ចេង សំណាង"
        },
        {
            "barcode": "171130030",
            "dpc": "03012416201",
            "name": "សែម គឹមហ៊ាត"
        },
        {
            "barcode": "171130031",
            "dpc": "03012416301",
            "name": "ឃៀង គន្ធា"
        },
        {
            "barcode": "171130032",
            "dpc": "03012416401",
            "name": "ចាន់ ថុល"
        },
        {
            "barcode": "171130033",
            "dpc": "03012422601",
            "name": "សុ ជីវី"
        },
        {
            "barcode": "171130034",
            "dpc": "03012416501",
            "name": "ជឹម គង្គា"
        },
        {
            "barcode": "171130035",
            "dpc": "03012416701",
            "name": "ឆេង ស៊ីម៉ន"
        },
        {
            "barcode": "171130036",
            "dpc": "03012410401",
            "name": "លី គន្ធា"
        },
        {
            "barcode": "171130037",
            "dpc": "03012410501",
            "name": "អ៊ុំ សុភ័ក្រ"
        },
        {
            "barcode": "171130038",
            "dpc": "03012410601",
            "name": "សូ ហេង"
        },
        {
            "barcode": "171130039",
            "dpc": "03012410701",
            "name": "ព្រំ ភា"
        },
        {
            "barcode": "171130040",
            "dpc": "03012410901",
            "name": "វ៉ាន ថន"
        },
        {
            "barcode": "171130041",
            "dpc": "03012411001",
            "name": "វ៉ន ជៀន"
        },
        {
            "barcode": "171130042",
            "dpc": "03012422701",
            "name": "សុខ សាត"
        },
        {
            "barcode": "171130043",
            "dpc": "03012422901",
            "name": "យ៉ា បូណា"
        },
        {
            "barcode": "171130044",
            "dpc": "03012443801",
            "name": "ឈួយ ណារ៉ែត"
        },
        {
            "barcode": "171130045",
            "dpc": "03012403301",
            "name": "ម៉ុក សុផាណារ៉ា"
        },
        {
            "barcode": "171130046",
            "dpc": "03012431201",
            "name": "ថង ធី"
        },
        {
            "barcode": "171130047",
            "dpc": "03012424201",
            "name": "យីវ ទូច"
        },
        {
            "barcode": "171130048",
            "dpc": "03012426201",
            "name": "ហេង វាតកំសត់"
        },
        {
            "barcode": "171130049",
            "dpc": "03012435501",
            "name": "ហួន ពៅ"
        },
        {
            "barcode": "171130050",
            "dpc": "03012417901",
            "name": "ហូ ច័ន្ទពិសី"
        },
        {
            "barcode": "171130051",
            "dpc": "03012425601",
            "name": "ធី សារ៉ាត់"
        },
        {
            "barcode": "171130052",
            "dpc": "03012425701",
            "name": "ពេជ្រ ដារ៉ារិទ្ធ"
        },
        {
            "barcode": "171130053",
            "dpc": "03012416801",
            "name": "អ៊ុំ ឡុញ"
        },
        {
            "barcode": "171130054",
            "dpc": "03012416901",
            "name": "អែម សេង"
        },
        {
            "barcode": "171130055",
            "dpc": "03012417001",
            "name": "ខែម សារ៉ុម"
        },
        {
            "barcode": "171130056",
            "dpc": "03012417101",
            "name": "ចាន់ កូ"
        },
        {
            "barcode": "171130057",
            "dpc": "03012423601",
            "name": "ប៉ុក គឹមលៀម"
        },
        {
            "barcode": "171130058",
            "dpc": "03012420901",
            "name": "ឡាយ គន្ធា"
        },
        {
            "barcode": "171130059",
            "dpc": "03012435601",
            "name": "អឿន សុឡេង"
        },
        {
            "barcode": "171130060",
            "dpc": "03012419301",
            "name": "មិន លីហួរ"
        },
        {
            "barcode": "171130061",
            "dpc": "03012417601",
            "name": "ពៅ វិរៈ ១"
        },
        {
            "barcode": "171130062",
            "dpc": "03012417701",
            "name": "ពៅ វិរៈ ២"
        },
        {
            "barcode": "171130063",
            "dpc": "03012442401",
            "name": "អែម សារ៉េត"
        },
        {
            "barcode": "171130064",
            "dpc": "03012424001",
            "name": "ខេង ពិសិដ្ឋ"
        },
        {
            "barcode": "171130065",
            "dpc": "03012446001",
            "name": "សយ សានី"
        },
        {
            "barcode": "171130066",
            "dpc": "03012425401",
            "name": "ឃុត ស៊ីម"
        },
        {
            "barcode": "171130067",
            "dpc": "03012425501",
            "name": "សាន្ត សារិន"
        },
        {
            "barcode": "171130068",
            "dpc": "03012425301",
            "name": "ទូច យ៉េត"
        },
        {
            "barcode": "171130069",
            "dpc": "03012425001",
            "name": "យាន រិទ្ធីវង្ស"
        },
        {
            "barcode": "171130070",
            "dpc": "03012444201",
            "name": "អេង សុភី"
        },
        {
            "barcode": "171130071",
            "dpc": "03012425201",
            "name": "រី រ័ត្ន"
        },
        {
            "barcode": "171130072",
            "dpc": "03012446101",
            "name": "ង៉ែត សាម៉ៃ"
        },
        {
            "barcode": "171130073",
            "dpc": "03012444001",
            "name": "គង់ ឈួន"
        },
        {
            "barcode": "171130074",
            "dpc": "03012423801",
            "name": "លាម សុឃឿម"
        },
        {
            "barcode": "171130075",
            "dpc": "03012412201",
            "name": "ឆម ភិរុណ"
        },
        {
            "barcode": "171130076",
            "dpc": "03012432801",
            "name": "ផាន់ ណារិទ្ធ"
        },
        {
            "barcode": "171130077",
            "dpc": "03012415601",
            "name": "ឈៀង រឿត"
        },
        {
            "barcode": "171130078",
            "dpc": "03012443901",
            "name": "អូន ចាន់ណារី"
        },
        {
            "barcode": "171130079",
            "dpc": "03012412101",
            "name": "ពិន សុវណ្ណ"
        },
        {
            "barcode": "171130080",
            "dpc": "03012428701",
            "name": "យាំ ចិត្ត្រា"
        },
        {
            "barcode": "171130081",
            "dpc": "03012430801",
            "name": "យូ ពៅ"
        },
        {
            "barcode": "171130082",
            "dpc": "03012421401",
            "name": "ពៅ វិរៈ ៣"
        },
        {
            "barcode": "171130083",
            "dpc": "03012432701",
            "name": "ឈួន ចាន់ថន"
        },
        {
            "barcode": "171130084",
            "dpc": "03012424101",
            "name": "ម៉ែង គឹមលី"
        },
        {
            "barcode": "171130085",
            "dpc": "03012444101",
            "name": "សាំង សុធារិទ្ធ"
        },
        {
            "barcode": "171130086",
            "dpc": "03012432601",
            "name": "ហត្ថ ធី"
        },
        {
            "barcode": "171130087",
            "dpc": "03012417801",
            "name": "ម៉ី ឈុំ"
        },
        {
            "barcode": "171130088",
            "dpc": "03012423701",
            "name": "ញាណ វណ្ណៈ"
        },
        {
            "barcode": "171130089",
            "dpc": "03012441401",
            "name": "ងួន សេង"
        },
        {
            "barcode": "171130090",
            "dpc": "03012419501",
            "name": "ណាំ ផាច"
        },
        {
            "barcode": "171130091",
            "dpc": "03012441501",
            "name": "ឈុត ណាលីន"
        },
        {
            "barcode": "171130092",
            "dpc": "03012441601",
            "name": "អួត សឿត"
        },
        {
            "barcode": "171130093",
            "dpc": "03012428101",
            "name": "សារុំ ចានថេត"
        },
        {
            "barcode": "171130094",
            "dpc": "03012424801",
            "name": "ឆាំ សុភាព"
        },
        {
            "barcode": "171130095",
            "dpc": "03012435201",
            "name": "ធូ ចាន់ថា"
        },
        {
            "barcode": "171130096",
            "dpc": "03012447301",
            "name": "តាត សុភី"
        },
        {
            "barcode": "171130097",
            "dpc": "03012403601",
            "name": "សាយ សៀន"
        },
        {
            "barcode": "171130098",
            "dpc": "03012431901",
            "name": "រឿន វីរៈ"
        },
        {
            "barcode": "171130099",
            "dpc": "03012432001",
            "name": "ហួត ហឿប"
        },
        {
            "barcode": "171130100",
            "dpc": "03012432101",
            "name": "សាម មាន"
        },
        {
            "barcode": "171130101",
            "dpc": "03012400801",
            "name": "អ៊ា គឹមជឿន"
        },
        {
            "barcode": "171130102",
            "dpc": "03012404401",
            "name": "វុន សុគន្ធ"
        },
        {
            "barcode": "171130103",
            "dpc": "03012404301",
            "name": "អ៊ុំ សាវ៉ៃ"
        },
        {
            "barcode": "171130104",
            "dpc": "03012404501",
            "name": "ហ៊ីង គឹមហឿន"
        },
        {
            "barcode": "171130105",
            "dpc": "03012420001",
            "name": "ពៅ ទិញ"
        },
        {
            "barcode": "171130106",
            "dpc": "03012403401",
            "name": "ជឹម និមិត្ត"
        },
        {
            "barcode": "171130107",
            "dpc": "03012437501",
            "name": "ឌី ផល្លី"
        },
        {
            "barcode": "171130108",
            "dpc": "03012437601",
            "name": "វ៉ា ទៀង"
        },
        {
            "barcode": "171130109",
            "dpc": "03012437701",
            "name": "ចែ ធុល"
        },
        {
            "barcode": "171130110",
            "dpc": "03012437801",
            "name": "ថៅ វ៉ាន់ថន"
        },
        {
            "barcode": "171130111",
            "dpc": "03012403501",
            "name": "ណូល សំណាង"
        },
        {
            "barcode": "171130112",
            "dpc": "03012435401",
            "name": "វ៉ែន ពីង"
        },
        {
            "barcode": "171130113",
            "dpc": "03012401301",
            "name": "សុខ ពៅ"
        },
        {
            "barcode": "171130114",
            "dpc": "03012403701",
            "name": "សុខ ញ៉ាញ់"
        },
        {
            "barcode": "171130115",
            "dpc": "03012404801",
            "name": "ណុច ម៉ៅ"
        },
        {
            "barcode": "171130116",
            "dpc": "03012401401",
            "name": "អេង ណូ"
        },
        {
            "barcode": "171130117",
            "dpc": "03012446801",
            "name": "ម៉ៅ ផល្លា"
        },
        {
            "barcode": "171130118",
            "dpc": "03012446701",
            "name": "ស៊ុម ភូង"
        },
        {
            "barcode": "171130119",
            "dpc": "03012446601",
            "name": "ស៊ុម សុភី"
        },
        {
            "barcode": "171130120",
            "dpc": "03012415401",
            "name": "យាន ធី"
        },
        {
            "barcode": "171130121",
            "dpc": "03012446401",
            "name": "សុខ សាឃឿម"
        },
        {
            "barcode": "171130122",
            "dpc": "03012431601",
            "name": "ហួត នរា"
        },
        {
            "barcode": "171130123",
            "dpc": "03012431701",
            "name": "ហួត ជន"
        },
        {
            "barcode": "171130124",
            "dpc": "03012418301",
            "name": "សឹង ពុទ្ធារ៉ា"
        },
        {
            "barcode": "171130125",
            "dpc": "03012419801",
            "name": "ទេព សំណាង"
        },
        {
            "barcode": "171130126",
            "dpc": "03012421201",
            "name": "ម៉ៅ ប៊ុនឈឿង"
        },
        {
            "barcode": "171130127",
            "dpc": "03012421101",
            "name": "អឿង ពេជ្រ"
        },
        {
            "barcode": "171130128",
            "dpc": "03012442101",
            "name": "អៀង មុំ"
        },
        {
            "barcode": "171130129",
            "dpc": "03012431301",
            "name": "អ៊ុំ ម៉ូលីដា"
        },
        {
            "barcode": "171130130",
            "dpc": "03012431401",
            "name": "គឹម សារឿន"
        },
        {
            "barcode": "171130131",
            "dpc": "03012435301",
            "name": "ជា សុហួត"
        },
        {
            "barcode": "171130132",
            "dpc": "03012428001",
            "name": "អឿន អ៊ុយ"
        },
        {
            "barcode": "171130133",
            "dpc": "03012446301",
            "name": "ខាត់ ផាន់លី"
        },
        {
            "barcode": "171130134",
            "dpc": "03012400201",
            "name": "ព្រំ អឿន"
        },
        {
            "barcode": "171130135",
            "dpc": "03012400101",
            "name": "បាន ចំរើន"
        },
        {
            "barcode": "171130136",
            "dpc": "03012437901",
            "name": "សុខ កានីកា"
        },
        {
            "barcode": "171130137",
            "dpc": "03012425801",
            "name": "ហេង ប៊ុនហៀង"
        },
        {
            "barcode": "171130138",
            "dpc": "03012441801",
            "name": "ប្រម ព្រឿង"
        },
        {
            "barcode": "171130139",
            "dpc": "03012441901",
            "name": "ឈើន រដ្ឋា"
        },
        {
            "barcode": "171130140",
            "dpc": "03012425901",
            "name": "ដែង សាវ៉ុង"
        },
        {
            "barcode": "171130141",
            "dpc": "03012434601",
            "name": "ម៉ាង ចានថូ"
        },
        {
            "barcode": "171130142",
            "dpc": "03012442001",
            "name": "សោ និយមរ័ត្ន"
        },
        {
            "barcode": "171130143",
            "dpc": "03012448001",
            "name": "ចាន់ ឌី"
        },
        {
            "barcode": "171130857",
            "dpc": "03012412901",
            "name": "ឆាយ សេរី"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
