let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171126995",
            "dpc": "03022515101",
            "name": "ញឹក ប៊ុនឆប"
        },
        {
            "barcode": "171126996",
            "dpc": "03022523601",
            "name": "ម៉ាន ណាស៊ី"
        },
        {
            "barcode": "171126997",
            "dpc": "03022519901",
            "name": "រេះ ម៉ាត់"
        },
        {
            "barcode": "171126998",
            "dpc": "03022502601",
            "name": "សាប់ សារ៉េត"
        },
        {
            "barcode": "171126999",
            "dpc": "03022521401",
            "name": "អឿ សាយ័ណ្ណ"
        },
        {
            "barcode": "171127000",
            "dpc": "03022513601",
            "name": "គ្រី ស៊ិនលាង"
        },
        {
            "barcode": "171127001",
            "dpc": "03022547001",
            "name": "ឈឿន ពុទ្ធី"
        },
        {
            "barcode": "171127002",
            "dpc": "03022513701",
            "name": "ខាត់ ខាន"
        },
        {
            "barcode": "171127003",
            "dpc": "03022513801",
            "name": "ឌុន អន"
        },
        {
            "barcode": "171127004",
            "dpc": "03022513901",
            "name": "ស៊ុន ចំរើន"
        },
        {
            "barcode": "171127005",
            "dpc": "03022514201",
            "name": "តែ ឆុន"
        },
        {
            "barcode": "171127006",
            "dpc": "03022514301",
            "name": "អន រឿត"
        },
        {
            "barcode": "171127007",
            "dpc": "03022514101",
            "name": "សេង ពិសិទ្ធ"
        },
        {
            "barcode": "171127008",
            "dpc": "03022514001",
            "name": "សេង រ៉េន"
        },
        {
            "barcode": "171127009",
            "dpc": "03022508201",
            "name": "រ៉េះ សើ"
        },
        {
            "barcode": "171127010",
            "dpc": "03022508301",
            "name": "ស៊ូ សាទ្រី"
        },
        {
            "barcode": "171127011",
            "dpc": "03022513501",
            "name": "ឯល យ៉ាន"
        },
        {
            "barcode": "171127012",
            "dpc": "03022508401",
            "name": "ម៉ក់ ឃឿត"
        },
        {
            "barcode": "171127013",
            "dpc": "03022508601",
            "name": "ចេស សារឿន"
        },
        {
            "barcode": "171127014",
            "dpc": "03022513301",
            "name": "សាម ខុន"
        },
        {
            "barcode": "171127015",
            "dpc": "03022513401",
            "name": "សឿង ឡន"
        },
        {
            "barcode": "171127016",
            "dpc": "03022513201",
            "name": "ខូរ ឡាង"
        },
        {
            "barcode": "171127017",
            "dpc": "03022513101",
            "name": "ផល ផន"
        },
        {
            "barcode": "171127018",
            "dpc": "03022515301",
            "name": "ឯក ចាន់ថន"
        },
        {
            "barcode": "171127019",
            "dpc": "03022543901",
            "name": "ណុប ណារ៉ា ២"
        },
        {
            "barcode": "171127020",
            "dpc": "03022518301",
            "name": "សាន ស៊ីវន"
        },
        {
            "barcode": "171127021",
            "dpc": "03022518401",
            "name": "សុខ សុភ័ណ"
        },
        {
            "barcode": "171127022",
            "dpc": "03022502701",
            "name": "សួន សូរិន"
        },
        {
            "barcode": "171127023",
            "dpc": "03022502801",
            "name": "សួន វណ្ណារិទ្ធ"
        },
        {
            "barcode": "171127024",
            "dpc": "03022502901",
            "name": "រ៉ាត់ រី"
        },
        {
            "barcode": "171127025",
            "dpc": "03022503001",
            "name": "ឌី សុខពេញ"
        },
        {
            "barcode": "171127026",
            "dpc": "03022503101",
            "name": "ហួន សុធីរិទ្ធ"
        },
        {
            "barcode": "171127027",
            "dpc": "03022503201",
            "name": "ម៉ាត់ សុគ្រី"
        },
        {
            "barcode": "171127028",
            "dpc": "03022503301",
            "name": "អុំ យ៉ាន់"
        },
        {
            "barcode": "171127029",
            "dpc": "03022504601",
            "name": "ប៊ុន សុភាព"
        },
        {
            "barcode": "171127030",
            "dpc": "03022507001",
            "name": "ម៉ា ការីន"
        },
        {
            "barcode": "171127031",
            "dpc": "03022507801",
            "name": "ឡេះ នូប៉េះ"
        },
        {
            "barcode": "171127032",
            "dpc": "03022507901",
            "name": "ជ័យ សុភាព"
        },
        {
            "barcode": "171127033",
            "dpc": "03022508001",
            "name": "ផន ឃួន"
        },
        {
            "barcode": "171127034",
            "dpc": "03022508101",
            "name": "គង់ ចន្ថា"
        },
        {
            "barcode": "171127035",
            "dpc": "03022508701",
            "name": "ថង ឌឿន"
        },
        {
            "barcode": "171127036",
            "dpc": "03022508801",
            "name": "សាប់ មណា"
        },
        {
            "barcode": "171127037",
            "dpc": "03022508901",
            "name": "វ៉ាន់ រីយ៉ា"
        },
        {
            "barcode": "171127038",
            "dpc": "03022509001",
            "name": "សុខ រឿម"
        },
        {
            "barcode": "171127039",
            "dpc": "03022509101",
            "name": "ជា ហ៊ាង"
        },
        {
            "barcode": "171127040",
            "dpc": "03022509201",
            "name": "សៅ គាន"
        },
        {
            "barcode": "171127041",
            "dpc": "03022509301",
            "name": "ស៊ូ យ៉ន"
        },
        {
            "barcode": "171127042",
            "dpc": "03022509401",
            "name": "ឈុន ឡាយ"
        },
        {
            "barcode": "171127043",
            "dpc": "03022509501",
            "name": "ម៉ាន រី"
        },
        {
            "barcode": "171127044",
            "dpc": "03022509601",
            "name": "ទេព ស៊ុន"
        },
        {
            "barcode": "171127045",
            "dpc": "03022509701",
            "name": "តាំ ម៉ាស់"
        },
        {
            "barcode": "171127046",
            "dpc": "03022511701",
            "name": "សេង នាង"
        },
        {
            "barcode": "171127047",
            "dpc": "03022511801",
            "name": "វង្ស ភុំ"
        },
        {
            "barcode": "171127048",
            "dpc": "03022511901",
            "name": "តន់ ណាវ"
        },
        {
            "barcode": "171127049",
            "dpc": "03022512401",
            "name": "ព្រឿន ចាន់វ៉ន"
        },
        {
            "barcode": "171127050",
            "dpc": "03022515401",
            "name": "ខ្វាន់ ចំរើន"
        },
        {
            "barcode": "171127051",
            "dpc": "03022521301",
            "name": "មណ្ឌលសុខភាពស្លាកែត"
        },
        {
            "barcode": "171127052",
            "dpc": "03022539901",
            "name": "ស៊ុន ផាត"
        },
        {
            "barcode": "171127053",
            "dpc": "03022544701",
            "name": "អ៊ុច វណ្ណ"
        },
        {
            "barcode": "171127054",
            "dpc": "03022544801",
            "name": "ម៉ាក់ ផល្លី"
        },
        {
            "barcode": "171127055",
            "dpc": "03022544901",
            "name": "ប៊ុន សំអាន"
        },
        {
            "barcode": "171127056",
            "dpc": "03022545001",
            "name": "ម៉ុត ផល្លី"
        },
        {
            "barcode": "171127057",
            "dpc": "03022502401",
            "name": "ទូច ជួន"
        },
        {
            "barcode": "171127058",
            "dpc": "03022503401",
            "name": "កែវ សុវណ្ណារិទ្ធ"
        },
        {
            "barcode": "171127059",
            "dpc": "03022503501",
            "name": "ឈៀង នេត"
        },
        {
            "barcode": "171127060",
            "dpc": "03022503601",
            "name": "វង្ស កង"
        },
        {
            "barcode": "171127061",
            "dpc": "03022503801",
            "name": "វង្ស ធួក"
        },
        {
            "barcode": "171127062",
            "dpc": "03022503901",
            "name": "ម៉េត ដាវុធ"
        },
        {
            "barcode": "171127063",
            "dpc": "03022507201",
            "name": "តែម ចំរើន"
        },
        {
            "barcode": "171127064",
            "dpc": "03022507401",
            "name": "ហង់ ផា"
        },
        {
            "barcode": "171127065",
            "dpc": "03022507501",
            "name": "នុត ឡី"
        },
        {
            "barcode": "171127066",
            "dpc": "03022507601",
            "name": "លី ណាស៊ី"
        },
        {
            "barcode": "171127067",
            "dpc": "03022507701",
            "name": "វង្ស ថន"
        },
        {
            "barcode": "171127068",
            "dpc": "03022511501",
            "name": "កាំង ប៉េង"
        },
        {
            "barcode": "171127069",
            "dpc": "03022511601",
            "name": "ឈុន ធឿន"
        },
        {
            "barcode": "171127070",
            "dpc": "03022512201",
            "name": "រឿន សាវីន"
        },
        {
            "barcode": "171127071",
            "dpc": "03022523801",
            "name": "យ៉ន សុភ័ក្រធីតា"
        },
        {
            "barcode": "171127072",
            "dpc": "03022523901",
            "name": "តឹង ចាន់ធី"
        },
        {
            "barcode": "171127073",
            "dpc": "03022524001",
            "name": "និន ណុន"
        },
        {
            "barcode": "171127074",
            "dpc": "03022539801",
            "name": "ញ៉ែម ផល្លី"
        },
        {
            "barcode": "171127075",
            "dpc": "03022523001",
            "name": "អ៊ុក ចាន់ម៉ាលី ២"
        },
        {
            "barcode": "171127076",
            "dpc": "03022506801",
            "name": "ទេព ចយ"
        },
        {
            "barcode": "171127077",
            "dpc": "03022513001",
            "name": "ទឹម សុផាន់ណា"
        },
        {
            "barcode": "171127078",
            "dpc": "03022502301",
            "name": "សំ សុន"
        },
        {
            "barcode": "171127079",
            "dpc": "03022539601",
            "name": "ឡឹក រិវឌ្ឍន៍"
        },
        {
            "barcode": "171127080",
            "dpc": "03022512101",
            "name": "អ៊ឹម សុភាព"
        },
        {
            "barcode": "171127081",
            "dpc": "03022514701",
            "name": "ជា ផល្លី"
        },
        {
            "barcode": "171127082",
            "dpc": "03022514801",
            "name": "ពៅ ប្រុស"
        },
        {
            "barcode": "171127083",
            "dpc": "03022522901",
            "name": "នួន សិលា"
        },
        {
            "barcode": "171127084",
            "dpc": "03022523701",
            "name": "ប៊ុន ថាវ"
        },
        {
            "barcode": "171127085",
            "dpc": "03022518101",
            "name": "មាស សាម៉ុន"
        },
        {
            "barcode": "171127086",
            "dpc": "03022515501",
            "name": "ឈួម សាវី ២"
        },
        {
            "barcode": "171127087",
            "dpc": "03022501301",
            "name": "សេង លន់"
        },
        {
            "barcode": "171127088",
            "dpc": "03022502501",
            "name": "ជៀប យឿត"
        },
        {
            "barcode": "171127089",
            "dpc": "03022510501",
            "name": "មាស ម៉ូលីវណ្ណ"
        },
        {
            "barcode": "171127090",
            "dpc": "03022510601",
            "name": "មាស ចំណូល"
        },
        {
            "barcode": "171127091",
            "dpc": "03022524101",
            "name": "ឡាយ សុខហេង"
        },
        {
            "barcode": "171127092",
            "dpc": "03022522301",
            "name": "ឡាយ ស្រីអូន"
        },
        {
            "barcode": "171127093",
            "dpc": "03022506101",
            "name": "ឡាយ គីមហ៊ួរ"
        },
        {
            "barcode": "171127094",
            "dpc": "03022506001",
            "name": "ឡាយ សុខហេង ២"
        },
        {
            "barcode": "171127095",
            "dpc": "03022505901",
            "name": "ឡាយ សុខហេង ១"
        },
        {
            "barcode": "171127096",
            "dpc": "03022501601",
            "name": "វ៉ាយ សារ ២"
        },
        {
            "barcode": "171127097",
            "dpc": "03022506201",
            "name": "ឡាត ហ៊ត"
        },
        {
            "barcode": "171127098",
            "dpc": "03022520901",
            "name": "រឿន ប្រាថ្មា"
        },
        {
            "barcode": "171127099",
            "dpc": "03022515601",
            "name": "ឈឹម វណ្ណា"
        },
        {
            "barcode": "171127100",
            "dpc": "03022518001",
            "name": "ពឿន ពៅ"
        },
        {
            "barcode": "171127101",
            "dpc": "03022511401",
            "name": "ស៊ី សំណាង"
        },
        {
            "barcode": "171127102",
            "dpc": "03022511301",
            "name": "ប៊ុន សុង"
        },
        {
            "barcode": "171127103",
            "dpc": "03022524401",
            "name": "ជា សុខជា"
        },
        {
            "barcode": "171127104",
            "dpc": "03022541001",
            "name": "ស៊ិន ប៊ុនលី"
        },
        {
            "barcode": "171127105",
            "dpc": "03022540901",
            "name": "ពៅ រស្មី"
        },
        {
            "barcode": "171127106",
            "dpc": "03022540801",
            "name": "ស៊ន ពៅ"
        },
        {
            "barcode": "171127107",
            "dpc": "03022540701",
            "name": "កេង សុខម៉េង"
        },
        {
            "barcode": "171127108",
            "dpc": "03022501801",
            "name": "លឹម សុខធី"
        },
        {
            "barcode": "171127109",
            "dpc": "03022512801",
            "name": "លឹម ប៉ោហុង"
        },
        {
            "barcode": "171127110",
            "dpc": "03022512001",
            "name": "ជួន សុខុម"
        },
        {
            "barcode": "171127111",
            "dpc": "03022522801",
            "name": "ព្រាប សុភ័ក្រ"
        },
        {
            "barcode": "171127112",
            "dpc": "03022522701",
            "name": "ភួង ផល្លី"
        },
        {
            "barcode": "171127113",
            "dpc": "03022522601",
            "name": "អ៊ុក សាខន"
        },
        {
            "barcode": "171127114",
            "dpc": "03022514901",
            "name": "ឡាយ ស្រីមុំ"
        },
        {
            "barcode": "171127115",
            "dpc": "03022515001",
            "name": "សោម ម៉ៅ"
        },
        {
            "barcode": "171127116",
            "dpc": "03022544601",
            "name": "គី ស៊ីណែត"
        },
        {
            "barcode": "171127117",
            "dpc": "03022545101",
            "name": "ទេព កែវចាន់ដារ៉ា"
        },
        {
            "barcode": "171127118",
            "dpc": "03022523101",
            "name": "ខែម សារិន"
        },
        {
            "barcode": "171127119",
            "dpc": "03022523201",
            "name": "គង់ ពៅ"
        },
        {
            "barcode": "171127120",
            "dpc": "03022544301",
            "name": "ភី គឹមលាង"
        },
        {
            "barcode": "171127121",
            "dpc": "03022517701",
            "name": "ច័ន្ទ និមល"
        },
        {
            "barcode": "171127122",
            "dpc": "03022544201",
            "name": "យក់ ប៉ុណ្ណាកា"
        },
        {
            "barcode": "171127123",
            "dpc": "03022514401",
            "name": "សេង ពុទ្ធា"
        },
        {
            "barcode": "171127124",
            "dpc": "03022524201",
            "name": "ជ័យ វុទ្ធី"
        },
        {
            "barcode": "171127125",
            "dpc": "03022518201",
            "name": "សុន សុភាព"
        },
        {
            "barcode": "171127126",
            "dpc": "03022517501",
            "name": "នូ គីម"
        },
        {
            "barcode": "171127127",
            "dpc": "03022521201",
            "name": "យី ប៊ុនលុច"
        },
        {
            "barcode": "171127128",
            "dpc": "03022506401",
            "name": "ឡាច រិទ្ធី"
        },
        {
            "barcode": "171127129",
            "dpc": "03022512601",
            "name": "សាន ប៊ុនសាត"
        },
        {
            "barcode": "171127130",
            "dpc": "03022502101",
            "name": "ចាន់ សេន"
        },
        {
            "barcode": "171127131",
            "dpc": "03022544101",
            "name": "ស្រី ម៉ៃ"
        },
        {
            "barcode": "171127132",
            "dpc": "03022544001",
            "name": "ងឹ វណ្ណះ"
        },
        {
            "barcode": "171127133",
            "dpc": "03022521001",
            "name": "រ៉ន សុគន្ធា"
        },
        {
            "barcode": "171127134",
            "dpc": "03022519401",
            "name": "ថៃ វណ្ណារ៉ា"
        },
        {
            "barcode": "171127135",
            "dpc": "03022519501",
            "name": "ថៃ វណ្ណី"
        },
        {
            "barcode": "171127136",
            "dpc": "03022519601",
            "name": "តិច ថុង"
        },
        {
            "barcode": "171127137",
            "dpc": "03022520001",
            "name": "ជឺ នី"
        },
        {
            "barcode": "171127138",
            "dpc": "03022519701",
            "name": "ជា សុភាព"
        },
        {
            "barcode": "171127139",
            "dpc": "03022519801",
            "name": "សេង សៀន"
        },
        {
            "barcode": "171127140",
            "dpc": "03022510001",
            "name": "ឈឿង សុវណ្ណី"
        },
        {
            "barcode": "171127141",
            "dpc": "03022515801",
            "name": "ជុំ វណ្ណា"
        },
        {
            "barcode": "171127142",
            "dpc": "03022520701",
            "name": "គុជ ជ័រ"
        },
        {
            "barcode": "171127143",
            "dpc": "03022515701",
            "name": "ប៊ុន ភាព"
        },
        {
            "barcode": "171127144",
            "dpc": "03022512701",
            "name": "គង់​ ស៊ីថា"
        },
        {
            "barcode": "171127145",
            "dpc": "03022506701",
            "name": "កែវ សារឿន"
        },
        {
            "barcode": "171127146",
            "dpc": "03022517001",
            "name": "ឌី វុទ្ធី"
        },
        {
            "barcode": "171127147",
            "dpc": "03022519201",
            "name": "ផន ភិន"
        },
        {
            "barcode": "171127148",
            "dpc": "03022506601",
            "name": "ឈុន ឡាយ"
        },
        {
            "barcode": "171127149",
            "dpc": "03022506501",
            "name": "អឿង សាវរី"
        },
        {
            "barcode": "171127150",
            "dpc": "03022522501",
            "name": "ងួន ហេង"
        },
        {
            "barcode": "171127151",
            "dpc": "03022544501",
            "name": "សៅ សិច"
        },
        {
            "barcode": "171127152",
            "dpc": "03022544401",
            "name": "សេង ណាក់"
        },
        {
            "barcode": "171127153",
            "dpc": "03022509901",
            "name": "ចក់ នាង"
        },
        {
            "barcode": "171127154",
            "dpc": "03022523401",
            "name": "ហ៊ុន សោភ័ណ្ឌ"
        },
        {
            "barcode": "171127155",
            "dpc": "03022523501",
            "name": "អៀម ស៊ីវន"
        },
        {
            "barcode": "171127156",
            "dpc": "03022509801",
            "name": "ផាន់ សុគុណ"
        },
        {
            "barcode": "171127157",
            "dpc": "03022541401",
            "name": "ផុន សុភ័ណ្ឌ"
        },
        {
            "barcode": "171127158",
            "dpc": "03022547801",
            "name": "អ៊ាង សុខា"
        },
        {
            "barcode": "171127159",
            "dpc": "03022541501",
            "name": "មាស ហង្ស"
        },
        {
            "barcode": "171127160",
            "dpc": "03022546601",
            "name": "ទិត សៅរី"
        },
        {
            "barcode": "171127161",
            "dpc": "03022541601",
            "name": "ឡេង អូន"
        },
        {
            "barcode": "171127162",
            "dpc": "03022541701",
            "name": "ឈឿន ខូយ"
        },
        {
            "barcode": "171127163",
            "dpc": "03022541801",
            "name": "ពៅ វី"
        },
        {
            "barcode": "171127164",
            "dpc": "03022541901",
            "name": "មឿង សារ៉ន"
        },
        {
            "barcode": "171127165",
            "dpc": "03022542001",
            "name": "ស៊ឹម សារ៉េត"
        },
        {
            "barcode": "171127166",
            "dpc": "03022546501",
            "name": "ទូច សារីម"
        },
        {
            "barcode": "171127167",
            "dpc": "03022546401",
            "name": "វែង ស្រីនី"
        },
        {
            "barcode": "171127168",
            "dpc": "03022517201",
            "name": "ញ៉ ភាព"
        },
        {
            "barcode": "171127169",
            "dpc": "03022543501",
            "name": "មិម យ៉ន"
        },
        {
            "barcode": "171127170",
            "dpc": "03022526101",
            "name": "ភឿក សាខន"
        },
        {
            "barcode": "171127171",
            "dpc": "03022536201",
            "name": "សំ សុៈ"
        },
        {
            "barcode": "171127172",
            "dpc": "03022526001",
            "name": "អៀង គឹមហួយ"
        },
        {
            "barcode": "171127173",
            "dpc": "03022546301",
            "name": "យិន គិន"
        },
        {
            "barcode": "171127174",
            "dpc": "03022525901",
            "name": "អុំ វ៉ាន់"
        },
        {
            "barcode": "171127175",
            "dpc": "03022546201",
            "name": "ទឹម ម៉ាឡៃ"
        },
        {
            "barcode": "171127176",
            "dpc": "03022525801",
            "name": "កែវ ចាន់នី"
        },
        {
            "barcode": "171127177",
            "dpc": "03022525701",
            "name": "យិប សុផាន់"
        },
        {
            "barcode": "171127178",
            "dpc": "03022542101",
            "name": "ឡុង ណុប"
        },
        {
            "barcode": "171127179",
            "dpc": "03022525601",
            "name": "តេង អឿន"
        },
        {
            "barcode": "171127180",
            "dpc": "03022525501",
            "name": "តូ សេង"
        },
        {
            "barcode": "171127181",
            "dpc": "03022525401",
            "name": "រី យ៉ាន់"
        },
        {
            "barcode": "171127182",
            "dpc": "03022525301",
            "name": "ហេង រុំម្នី"
        },
        {
            "barcode": "171127183",
            "dpc": "03022536101",
            "name": "សំ សម្បត្តិ"
        },
        {
            "barcode": "171127184",
            "dpc": "03022536001",
            "name": "ខា សារិន"
        },
        {
            "barcode": "171127185",
            "dpc": "03022535901",
            "name": "ឈិម សុផាន"
        },
        {
            "barcode": "171127186",
            "dpc": "03022525201",
            "name": "ខ្លូត សុខុម"
        },
        {
            "barcode": "171127187",
            "dpc": "03022535801",
            "name": "ភិន ញឿន"
        },
        {
            "barcode": "171127188",
            "dpc": "03022535701",
            "name": "ម៉ៃ សុឃុល"
        },
        {
            "barcode": "171127189",
            "dpc": "03022535601",
            "name": "ប៉ុន សាគុណ"
        },
        {
            "barcode": "171127190",
            "dpc": "03022535501",
            "name": "ហ៊ុន ឃឿង"
        },
        {
            "barcode": "171127191",
            "dpc": "03022535401",
            "name": "ហ៊ុន ពៅ"
        },
        {
            "barcode": "171127192",
            "dpc": "03022535301",
            "name": "ហ៊ុន ធ្នូ"
        },
        {
            "barcode": "171127193",
            "dpc": "03022518601",
            "name": "សួង លាង"
        },
        {
            "barcode": "171127194",
            "dpc": "03022535201",
            "name": "ឃុន វិបុល"
        },
        {
            "barcode": "171127195",
            "dpc": "03022535101",
            "name": "ម៉ម រិន"
        },
        {
            "barcode": "171127196",
            "dpc": "03022517101",
            "name": "ហ៊ុន ចាប"
        },
        {
            "barcode": "171127197",
            "dpc": "03022518701",
            "name": "វ៉ែន វ៉ូ"
        },
        {
            "barcode": "171127198",
            "dpc": "03022525001",
            "name": "វិញ ហេង"
        },
        {
            "barcode": "171127199",
            "dpc": "03022502201",
            "name": "គ្រី ទូច"
        },
        {
            "barcode": "171127200",
            "dpc": "03022541301",
            "name": "ងួន ចាន់រតនា"
        },
        {
            "barcode": "171127201",
            "dpc": "03022547501",
            "name": "សោម ថន"
        },
        {
            "barcode": "171127202",
            "dpc": "03022547301",
            "name": "ខាវ រតនា"
        },
        {
            "barcode": "171127203",
            "dpc": "03022547401",
            "name": "សាន ស៊ីថា"
        },
        {
            "barcode": "171127204",
            "dpc": "03022545201",
            "name": "អួង វ៉ា"
        },
        {
            "barcode": "171127205",
            "dpc": "03022516701",
            "name": "ចេស សាម៉េត"
        },
        {
            "barcode": "171127206",
            "dpc": "03022516801",
            "name": "សៅ ឆុន"
        },
        {
            "barcode": "171127207",
            "dpc": "03022516901",
            "name": "ស៊ីវ លឿត"
        },
        {
            "barcode": "171127208",
            "dpc": "03022526201",
            "name": "ហួន សំណាង"
        },
        {
            "barcode": "171127209",
            "dpc": "03022536401",
            "name": "មឿន សុផាន់នី"
        },
        {
            "barcode": "171127210",
            "dpc": "03022526301",
            "name": "ប៊ុត យ៉ាត"
        },
        {
            "barcode": "171127211",
            "dpc": "03022536501",
            "name": "យី សៀកហាន"
        },
        {
            "barcode": "171127212",
            "dpc": "03022526401",
            "name": "ឡាក់ រស់"
        },
        {
            "barcode": "171127213",
            "dpc": "03022526501",
            "name": "ឈួន ចន្ធូ"
        },
        {
            "barcode": "171127214",
            "dpc": "03022526601",
            "name": "សាំង ឆៃ"
        },
        {
            "barcode": "171127215",
            "dpc": "03022526701",
            "name": "ឃុន មិនា"
        },
        {
            "barcode": "171127216",
            "dpc": "03022543101",
            "name": "ឆាំ កុសល់"
        },
        {
            "barcode": "171127217",
            "dpc": "03022526801",
            "name": "ម៉ាង សុវណ្ណ"
        },
        {
            "barcode": "171127218",
            "dpc": "03022526901",
            "name": "ព្រីង អូន"
        },
        {
            "barcode": "171127219",
            "dpc": "03022527001",
            "name": "គាវ ម៉ៅ"
        },
        {
            "barcode": "171127220",
            "dpc": "03022527101",
            "name": "អក្ខរ៉ាសម័យ"
        },
        {
            "barcode": "171127221",
            "dpc": "03022527201",
            "name": "អុល សុជា"
        },
        {
            "barcode": "171127222",
            "dpc": "03022542901",
            "name": "រត្ន ស្រីពេជ្រ"
        },
        {
            "barcode": "171127223",
            "dpc": "03022527301",
            "name": "មួង សុធា"
        },
        {
            "barcode": "171127224",
            "dpc": "03022527401",
            "name": "ឈិត សាលៀប"
        },
        {
            "barcode": "171127225",
            "dpc": "03022527501",
            "name": "ពៅ ពឿន"
        },
        {
            "barcode": "171127226",
            "dpc": "03022527601",
            "name": "សុខ ផូ"
        },
        {
            "barcode": "171127227",
            "dpc": "03022527701",
            "name": "សំ យ៉ាន់"
        },
        {
            "barcode": "171127228",
            "dpc": "03022536601",
            "name": "ឌិម ផុន"
        },
        {
            "barcode": "171127229",
            "dpc": "03022527801",
            "name": "តិប អេង"
        },
        {
            "barcode": "171127230",
            "dpc": "03022542701",
            "name": "វឿន សុណន់"
        },
        {
            "barcode": "171127231",
            "dpc": "03022536701",
            "name": "រ័ត្ន ស្រីលី"
        },
        {
            "barcode": "171127232",
            "dpc": "03022527901",
            "name": "ឡេង សំណាង"
        },
        {
            "barcode": "171127233",
            "dpc": "03022536801",
            "name": "នៅ ស៊ីមន"
        },
        {
            "barcode": "171127234",
            "dpc": "03022536901",
            "name": "ឈុំ សឿត"
        },
        {
            "barcode": "171127235",
            "dpc": "03022537001",
            "name": "ឈឹម សុគីម"
        },
        {
            "barcode": "171127236",
            "dpc": "03022528001",
            "name": "អាន ស៊ីហាក"
        },
        {
            "barcode": "171127237",
            "dpc": "03022528101",
            "name": "អួន សារ៉េន"
        },
        {
            "barcode": "171127238",
            "dpc": "03022537101",
            "name": "អួន រិទ្ធ"
        },
        {
            "barcode": "171127239",
            "dpc": "03022528201",
            "name": "ប៉ូ មុំ"
        },
        {
            "barcode": "171127240",
            "dpc": "03022537201",
            "name": "សុខ អេង"
        },
        {
            "barcode": "171127241",
            "dpc": "03022528301",
            "name": "សំ សុផាត"
        },
        {
            "barcode": "171127242",
            "dpc": "03022528401",
            "name": "ហែម នី"
        },
        {
            "barcode": "171127243",
            "dpc": "03022528501",
            "name": "រិន ស្រីមុំ"
        },
        {
            "barcode": "171127244",
            "dpc": "03022528601",
            "name": "ខៀវ លាភ"
        },
        {
            "barcode": "171127245",
            "dpc": "03022545701",
            "name": "វីន"
        },
        {
            "barcode": "171127246",
            "dpc": "03022537301",
            "name": "ខៀវ ចាន់ថង"
        },
        {
            "barcode": "171127247",
            "dpc": "03022528701",
            "name": "យីម សំអុល"
        },
        {
            "barcode": "171127248",
            "dpc": "03022528801",
            "name": "ស៊ុន សាវឿន"
        },
        {
            "barcode": "171127249",
            "dpc": "03022528901",
            "name": "ឈុន ឆេង"
        },
        {
            "barcode": "171127250",
            "dpc": "03022529001",
            "name": "អុំ រ៉ន"
        },
        {
            "barcode": "171127251",
            "dpc": "03022537501",
            "name": "ងិន ផល្លា"
        },
        {
            "barcode": "171127252",
            "dpc": "03022529101",
            "name": "ងិន សារ៉ាន់"
        },
        {
            "barcode": "171127253",
            "dpc": "03022543201",
            "name": "ឆៃ គីមសឿន"
        },
        {
            "barcode": "171127254",
            "dpc": "03022529201",
            "name": "ម៉ាង សារឿត"
        },
        {
            "barcode": "171127255",
            "dpc": "03022529301",
            "name": "ពេញ ចិន្តា"
        },
        {
            "barcode": "171127256",
            "dpc": "03022529401",
            "name": "ចាន់ ស៊ីដេត"
        },
        {
            "barcode": "171127257",
            "dpc": "03022529501",
            "name": "ហួត គឹមឡាយ"
        },
        {
            "barcode": "171127258",
            "dpc": "03022537601",
            "name": "ពេជ្រ សារឿន"
        },
        {
            "barcode": "171127259",
            "dpc": "03022529701",
            "name": "ម៉ុត សារ៉េត"
        },
        {
            "barcode": "171127260",
            "dpc": "03022543401",
            "name": "ទឹម សុផាន់នី"
        },
        {
            "barcode": "171127261",
            "dpc": "03022529801",
            "name": "សាន់ ហុង"
        },
        {
            "barcode": "171127262",
            "dpc": "03022546101",
            "name": "អួន វី"
        },
        {
            "barcode": "171127263",
            "dpc": "03022529901",
            "name": "ម៉េង ងន់ហេង"
        },
        {
            "barcode": "171127264",
            "dpc": "03022537701",
            "name": "មឿង ប៊ុនថា"
        },
        {
            "barcode": "171127265",
            "dpc": "03022530001",
            "name": "ឆោម សុវណ្ណ"
        },
        {
            "barcode": "171127266",
            "dpc": "03022530101",
            "name": "ប្រាក់ វ៉ាស់ធី"
        },
        {
            "barcode": "171127267",
            "dpc": "03022530201",
            "name": "ស៊ុន សារ៉េត"
        },
        {
            "barcode": "171127268",
            "dpc": "03022530401",
            "name": "ស៊ុំ សុវណ្ណ"
        },
        {
            "barcode": "171127269",
            "dpc": "03022530501",
            "name": "ហៀន ភាព"
        },
        {
            "barcode": "171127270",
            "dpc": "03022542301",
            "name": "រស់ ប៊ុនណាត"
        },
        {
            "barcode": "171127271",
            "dpc": "03022530601",
            "name": "ហ៊ុន សាត"
        },
        {
            "barcode": "171127272",
            "dpc": "03022530701",
            "name": "ទូច ចន្ធូ"
        },
        {
            "barcode": "171127273",
            "dpc": "03022530801",
            "name": "ចាប ចន្នី"
        },
        {
            "barcode": "171127274",
            "dpc": "03022530901",
            "name": "ហួន លាងសេង"
        },
        {
            "barcode": "171127275",
            "dpc": "03022531001",
            "name": "នៅ ស៊ីម"
        },
        {
            "barcode": "171127276",
            "dpc": "03022531101",
            "name": "ឡឹក ជីម"
        },
        {
            "barcode": "171127277",
            "dpc": "03022531301",
            "name": "ស៊ុន សារីម"
        },
        {
            "barcode": "171127278",
            "dpc": "03022531401",
            "name": "កុយ សំអូន"
        },
        {
            "barcode": "171127279",
            "dpc": "03022531501",
            "name": "អុំ ង៉ា"
        },
        {
            "barcode": "171127280",
            "dpc": "03022531601",
            "name": "ឡុង កាន"
        },
        {
            "barcode": "171127281",
            "dpc": "03022531701",
            "name": "ទេស សាវេត"
        },
        {
            "barcode": "171127282",
            "dpc": "03022531801",
            "name": "សំ ទន់"
        },
        {
            "barcode": "171127283",
            "dpc": "03022531901",
            "name": "មួង សូដា"
        },
        {
            "barcode": "171127284",
            "dpc": "03022532001",
            "name": "មិន ហ៊ីង"
        },
        {
            "barcode": "171127285",
            "dpc": "03022532101",
            "name": "សូ សឿន"
        },
        {
            "barcode": "171127286",
            "dpc": "03022537801",
            "name": "ម៉ៅ ម៉ាន់"
        },
        {
            "barcode": "171127287",
            "dpc": "03022537901",
            "name": "ភិន ង៉ា"
        },
        {
            "barcode": "171127288",
            "dpc": "03022538001",
            "name": "ចាន់ វី"
        },
        {
            "barcode": "171127289",
            "dpc": "03022532201",
            "name": "ហាច រដ្ឋា"
        },
        {
            "barcode": "171127290",
            "dpc": "03022532301",
            "name": "ហាច ម៉ៅ"
        },
        {
            "barcode": "171127291",
            "dpc": "03022538101",
            "name": "សឿន សាវុធ"
        },
        {
            "barcode": "171127292",
            "dpc": "03022542401",
            "name": "ចាន់ ហួត"
        },
        {
            "barcode": "171127293",
            "dpc": "03022538201",
            "name": "វិត ហាប់"
        },
        {
            "barcode": "171127294",
            "dpc": "03022542501",
            "name": "លន សម្បត្តិ"
        },
        {
            "barcode": "171127295",
            "dpc": "03022532401",
            "name": "ឡុក រឿម"
        },
        {
            "barcode": "171127296",
            "dpc": "03022538301",
            "name": "ង៉ូវ សុក"
        },
        {
            "barcode": "171127297",
            "dpc": "03022538401",
            "name": "ខាំ ឡៃ"
        },
        {
            "barcode": "171127298",
            "dpc": "03022538501",
            "name": "លិម សុវណ្ណ"
        },
        {
            "barcode": "171127299",
            "dpc": "03022538601",
            "name": "សាត សារ៉ាយ"
        },
        {
            "barcode": "171127300",
            "dpc": "03022538701",
            "name": "ញ៉ែប ប៊ុនថា"
        },
        {
            "barcode": "171127301",
            "dpc": "03022538801",
            "name": "សេក ស៊ីថា"
        },
        {
            "barcode": "171127302",
            "dpc": "03022538901",
            "name": "ប៉ិល ពៅ"
        },
        {
            "barcode": "171127303",
            "dpc": "03022532501",
            "name": "យ៉េត គឹមហ៊ន"
        },
        {
            "barcode": "171127304",
            "dpc": "03022539001",
            "name": "ស៊ុន រិន"
        },
        {
            "barcode": "171127305",
            "dpc": "03022532601",
            "name": "ឡែម ធី"
        },
        {
            "barcode": "171127306",
            "dpc": "03022532701",
            "name": "ម៉ាត់ លី"
        },
        {
            "barcode": "171127307",
            "dpc": "03022532801",
            "name": "សំ សាន"
        },
        {
            "barcode": "171127308",
            "dpc": "03022545901",
            "name": "អួង សុផល"
        },
        {
            "barcode": "171127309",
            "dpc": "03022532901",
            "name": "ម៉ម បូរី"
        },
        {
            "barcode": "171127310",
            "dpc": "03022533001",
            "name": "ញឹក ការ"
        },
        {
            "barcode": "171127311",
            "dpc": "03022533101",
            "name": "សេង ហួន"
        },
        {
            "barcode": "171127312",
            "dpc": "03022533201",
            "name": "ញឹក នី"
        },
        {
            "barcode": "171127313",
            "dpc": "03022533301",
            "name": "ប៊ួ ស៊ីណា"
        },
        {
            "barcode": "171127314",
            "dpc": "03022533401",
            "name": "ជា ស្រីមាស"
        },
        {
            "barcode": "171127315",
            "dpc": "03022533501",
            "name": "យ៉ុន គ្រោង"
        },
        {
            "barcode": "171127316",
            "dpc": "03022533601",
            "name": "មី ទូច"
        },
        {
            "barcode": "171127317",
            "dpc": "03022533701",
            "name": "សុខ សំអុន"
        },
        {
            "barcode": "171127318",
            "dpc": "03022533801",
            "name": "ស៊ុំ សំណាង"
        },
        {
            "barcode": "171127319",
            "dpc": "03022533901",
            "name": "ភឿក សំប៊ុន"
        },
        {
            "barcode": "171127320",
            "dpc": "03022534101",
            "name": "ស៊ុម ស៊ីនឿត"
        },
        {
            "barcode": "171127321",
            "dpc": "03022539101",
            "name": "ចាន់ ណូរ៉ា"
        },
        {
            "barcode": "171127322",
            "dpc": "03022534201",
            "name": "ភឿក សម្បត្តិ"
        },
        {
            "barcode": "171127323",
            "dpc": "03022546001",
            "name": "ប្រាក់ វ៉ាស់ធី"
        },
        {
            "barcode": "171127324",
            "dpc": "03022534301",
            "name": "ហ៊ាន បូផា"
        },
        {
            "barcode": "171127325",
            "dpc": "03022534401",
            "name": "ប៊ុន ឆវ័ន"
        },
        {
            "barcode": "171127326",
            "dpc": "03022505801",
            "name": "សេង ស្រីណែត"
        },
        {
            "barcode": "171127327",
            "dpc": "03022541101",
            "name": "អាន តិច"
        },
        {
            "barcode": "171127328",
            "dpc": "03022501501",
            "name": "ប្លង់ ស៊ីនណារ៉ា"
        },
        {
            "barcode": "171127329",
            "dpc": "03022518901",
            "name": "អុំ ខុម"
        },
        {
            "barcode": "171127330",
            "dpc": "03022518801",
            "name": "យ៉ត សំបូរ"
        },
        {
            "barcode": "171127331",
            "dpc": "03022517301",
            "name": "ឡុង ខុនវណ្ឌី"
        },
        {
            "barcode": "171127332",
            "dpc": "03022517401",
            "name": "គង់ លន"
        },
        {
            "barcode": "171127333",
            "dpc": "03022524501",
            "name": "ផាត់ រ៉ា"
        },
        {
            "barcode": "171127334",
            "dpc": "03022519001",
            "name": "ឡុង សារ៉ាន់"
        },
        {
            "barcode": "171127335",
            "dpc": "03022501401",
            "name": "សុខ ស៊ីណាត"
        },
        {
            "barcode": "171127336",
            "dpc": "03022507101",
            "name": "ញ៉េប ចំរើន"
        },
        {
            "barcode": "171127337",
            "dpc": "03022512501",
            "name": "ឈីវ ឈឿត"
        },
        {
            "barcode": "171127338",
            "dpc": "03022520401",
            "name": "ជុំ ចាន់ដារ៉ារិទ្ធ"
        },
        {
            "barcode": "171127339",
            "dpc": "03022547201",
            "name": "សុខ រ៉ាឌី"
        },
        {
            "barcode": "171127340",
            "dpc": "03022534801",
            "name": "ស៊ុង ស៊ីវ៉ាន់"
        },
        {
            "barcode": "171127341",
            "dpc": "03022534901",
            "name": "សួន ជំនិត"
        },
        {
            "barcode": "171127342",
            "dpc": "03022547601",
            "name": "គង់ សំអាត"
        },
        {
            "barcode": "171127343",
            "dpc": "03022547701",
            "name": "ឈឿម ផល្លី"
        },
        {
            "barcode": "171127344",
            "dpc": "03022520501",
            "name": "សៅ ឆុន"
        },
        {
            "barcode": "171127345",
            "dpc": "03022500101",
            "name": "ឌុក ដារ៉ារិទ្ធ"
        },
        {
            "barcode": "171127346",
            "dpc": "03022500201",
            "name": "គ្រី ចន្ថា"
        },
        {
            "barcode": "171127347",
            "dpc": "03022500301",
            "name": "អង្គការក្តីសង្ឍឹមនៃកុមារ"
        },
        {
            "barcode": "171127348",
            "dpc": "03022504701",
            "name": "ភឹង ឆាន"
        },
        {
            "barcode": "171127349",
            "dpc": "03022504801",
            "name": "រឿម ធុច"
        },
        {
            "barcode": "171127350",
            "dpc": "03022505001",
            "name": "សំ វីរះ"
        },
        {
            "barcode": "171127351",
            "dpc": "03022505101",
            "name": "ឡិប អារ៉ាហ្វាត់"
        },
        {
            "barcode": "171127352",
            "dpc": "03022510401",
            "name": "ឯល ម៉ាស់"
        },
        {
            "barcode": "171127353",
            "dpc": "03022510701",
            "name": "សេម សុផល"
        },
        {
            "barcode": "171127354",
            "dpc": "03022515201",
            "name": "ស៊ីត សេត"
        },
        {
            "barcode": "171127355",
            "dpc": "03022516001",
            "name": "ជាង ឃ្លោក"
        },
        {
            "barcode": "171127356",
            "dpc": "03022516501",
            "name": "ដាំ ចំរើន"
        },
        {
            "barcode": "171127357",
            "dpc": "03022518501",
            "name": "ទេស កាសូម"
        },
        {
            "barcode": "171127358",
            "dpc": "03022521101",
            "name": "ដួង សំរស្មី"
        },
        {
            "barcode": "171127359",
            "dpc": "03022521501",
            "name": "វ៉ាត ស៊ីម"
        },
        {
            "barcode": "171127360",
            "dpc": "03022522401",
            "name": "អ៊ឹង ទី"
        },
        {
            "barcode": "171127361",
            "dpc": "03022523301",
            "name": "ម៉ាត់ ម៉ារី"
        },
        {
            "barcode": "171127362",
            "dpc": "03022524601",
            "name": "ហេង ប៊ុនលី"
        },
        {
            "barcode": "171127363",
            "dpc": "03022524701",
            "name": "ទឹម ហ៊ីង"
        },
        {
            "barcode": "171127364",
            "dpc": "03022525101",
            "name": "សួន នួន"
        },
        {
            "barcode": "171127365",
            "dpc": "03022540101",
            "name": "ច្រែង រិទ្ធី"
        },
        {
            "barcode": "171127366",
            "dpc": "03022540201",
            "name": "ឡុង សាវ៉ាត"
        },
        {
            "barcode": "171127367",
            "dpc": "03022542601",
            "name": "ខាន់ ហុង"
        },
        {
            "barcode": "171127368",
            "dpc": "03022545301",
            "name": "ទីន សា"
        },
        {
            "barcode": "171127369",
            "dpc": "03022545601",
            "name": "ឯល ការីម ២"
        },
        {
            "barcode": "171127370",
            "dpc": "03022520101",
            "name": "សេង ហៃ១"
        },
        {
            "barcode": "171127371",
            "dpc": "03022543801",
            "name": "ត្រិច ថា"
        },
        {
            "barcode": "171127372",
            "dpc": "03022543701",
            "name": "វន់ វិបុល"
        },
        {
            "barcode": "171127373",
            "dpc": "03022534501",
            "name": "ប៊ុន វ៉ាន់ថា"
        },
        {
            "barcode": "171127374",
            "dpc": "03022521601",
            "name": "កែវ សាយ"
        },
        {
            "barcode": "171127375",
            "dpc": "03022521701",
            "name": "អ៊ី សំណាង"
        },
        {
            "barcode": "171127376",
            "dpc": "03022516101",
            "name": "ឯម ភិន"
        },
        {
            "barcode": "171127377",
            "dpc": "03022514501",
            "name": "ឈាន ឆឹម"
        },
        {
            "barcode": "171127378",
            "dpc": "03022510801",
            "name": "សួន ស៊ាប"
        },
        {
            "barcode": "171127379",
            "dpc": "03022534601",
            "name": "វណ្ណ កញ្ចណា"
        },
        {
            "barcode": "171127380",
            "dpc": "03022522001",
            "name": "ប៊ុន រ៉ន"
        },
        {
            "barcode": "171127381",
            "dpc": "03022521901",
            "name": "ជឿ គឹមឆាយ"
        },
        {
            "barcode": "171127382",
            "dpc": "03022521801",
            "name": "លី ង៉ា"
        },
        {
            "barcode": "171127383",
            "dpc": "03022517801",
            "name": "យិប វ៉ៃ"
        },
        {
            "barcode": "171127384",
            "dpc": "03022516201",
            "name": "ឈួម រួម"
        },
        {
            "barcode": "171127385",
            "dpc": "03022511001",
            "name": "សំ សាវៀង"
        },
        {
            "barcode": "171127386",
            "dpc": "03022510901",
            "name": "សេង ជា"
        },
        {
            "barcode": "171127387",
            "dpc": "03022500501",
            "name": "សុច ក្រួច"
        },
        {
            "barcode": "171127388",
            "dpc": "03022522201",
            "name": "ពុំ វណ្ណ"
        },
        {
            "barcode": "171127389",
            "dpc": "03022520201",
            "name": "យិន សាវុធ"
        },
        {
            "barcode": "171127390",
            "dpc": "03022511101",
            "name": "សេង គឹមហ៊ាក"
        },
        {
            "barcode": "171127391",
            "dpc": "03022505501",
            "name": "លុន ឆោម"
        },
        {
            "barcode": "171127392",
            "dpc": "03022505401",
            "name": "យុទ្ធ ពន្លក"
        },
        {
            "barcode": "171127393",
            "dpc": "03022500701",
            "name": "ពិន ចាន់នៀត"
        },
        {
            "barcode": "171127394",
            "dpc": "03022500601",
            "name": "ញឹម មន្ថា"
        },
        {
            "barcode": "171127395",
            "dpc": "03022546801",
            "name": "ប៊ុន រុំ"
        },
        {
            "barcode": "171127396",
            "dpc": "03022539301",
            "name": "យ៉ិន សារ៉ុម"
        },
        {
            "barcode": "171127397",
            "dpc": "03022505301",
            "name": "លឹម សុភ័ក្រ"
        },
        {
            "barcode": "171127398",
            "dpc": "03022539501",
            "name": "ជា ទ្រីប៊ុនរ័ត្ន"
        },
        {
            "barcode": "171127399",
            "dpc": "03022514601",
            "name": "វង់ កក្កដា"
        },
        {
            "barcode": "171127400",
            "dpc": "03022500901",
            "name": "ភួង សាមុត"
        },
        {
            "barcode": "171127401",
            "dpc": "03022500801",
            "name": "អឿ មេត្រី"
        },
        {
            "barcode": "171127402",
            "dpc": "03022501201",
            "name": "ហ៊ីម សុខខា"
        },
        {
            "barcode": "171127403",
            "dpc": "03022501001",
            "name": "សាលា ឧបោសថសីល"
        },
        {
            "barcode": "171127404",
            "dpc": "03022520301",
            "name": "សឿម ស៊ុន"
        },
        {
            "barcode": "171127405",
            "dpc": "03022516301",
            "name": "រី រិទ្ធី"
        },
        {
            "barcode": "171127406",
            "dpc": "03022505701",
            "name": "អេន ស៊ីណា"
        },
        {
            "barcode": "171127407",
            "dpc": "03022505601",
            "name": "អេន សាវឌី"
        },
        {
            "barcode": "171127408",
            "dpc": "03022504901",
            "name": "ទេព នីន"
        },
        {
            "barcode": "171127409",
            "dpc": "03022546901",
            "name": "លឹម ទូច"
        },
        {
            "barcode": "171127410",
            "dpc": "03022539401",
            "name": "រស់ សារ៉ុន"
        },
        {
            "barcode": "171127411",
            "dpc": "03022534701",
            "name": "លឿម វុទ្ធី"
        },
        {
            "barcode": "171127412",
            "dpc": "03022519101",
            "name": "តូច ខៃ"
        },
        {
            "barcode": "171127413",
            "dpc": "03022520601",
            "name": "យឿង យ៉េត"
        },
        {
            "barcode": "171127414",
            "dpc": "03022512901",
            "name": "វុន ស៊ីរឿន"
        },
        {
            "barcode": "171127415",
            "dpc": "03022543601",
            "name": "ម៉ុម ផូរ៉ា"
        },
        {
            "barcode": "171127416",
            "dpc": "03022511201",
            "name": "សៀង សុថង ៤"
        },
        {
            "barcode": "171127417",
            "dpc": "03022505201",
            "name": "ហាំង ឡេង"
        },
        {
            "barcode": "171127418",
            "dpc": "03022516401",
            "name": "ទីវ ជូឡុង"
        },
        {
            "barcode": "171127419",
            "dpc": "03022520801",
            "name": "វិត រិទ្ធី"
        },
        {
            "barcode": "171127420",
            "dpc": "03022547101",
            "name": "សុខ ប៊ុនដារ៉ា"
        },
        {
            "barcode": "171127421",
            "dpc": "03022524901",
            "name": "ឌឿន សុវណ្ណ"
        },
        {
            "barcode": "171127422",
            "dpc": "03022510301",
            "name": "ទាវ អុំមី"
        },
        {
            "barcode": "171127423",
            "dpc": "03022510201",
            "name": "ម៉ាត រ៉ែ"
        },
        {
            "barcode": "171127424",
            "dpc": "03022504001",
            "name": "ឡេះ ហ្វាស៊ី"
        },
        {
            "barcode": "171127425",
            "dpc": "03022504201",
            "name": "ណុះ សារិទ្ធ"
        },
        {
            "barcode": "171127426",
            "dpc": "03022504101",
            "name": "យី សេមម៉ូស្លីម"
        },
        {
            "barcode": "171127427",
            "dpc": "03022515901",
            "name": "ណាម មុនី"
        },
        {
            "barcode": "171127428",
            "dpc": "03022504401",
            "name": "រស់ ម៉ៅ"
        },
        {
            "barcode": "171127429",
            "dpc": "03022524801",
            "name": "សឹម ហ៊ូសាន"
        },
        {
            "barcode": "171127430",
            "dpc": "03022519301",
            "name": "លី រ៉ានី"
        },
        {
            "barcode": "171127431",
            "dpc": "03022510101",
            "name": "ទា ប៊ីណា"
        },
        {
            "barcode": "171127432",
            "dpc": "03022504301",
            "name": "កៅ ជប៉ុន"
        },
        {
            "barcode": "171127433",
            "dpc": "03022535001",
            "name": "ប្រាក់ ចាន់ណា"
        },
        {
            "barcode": "171127434",
            "dpc": "03022540601",
            "name": "លឹម សុភ័ណ្ឌ"
        },
        {
            "barcode": "171127435",
            "dpc": "03022540501",
            "name": "ហុង សុភាព"
        },
        {
            "barcode": "171127436",
            "dpc": "03022540401",
            "name": "ប៊ុន សៀង"
        },
        {
            "barcode": "171127437",
            "dpc": "03022540301",
            "name": "អឿ ប៊ុនថន"
        },
        {
            "barcode": "171127438",
            "dpc": "03022547901",
            "name": "ផេង រុងរឿង"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
