let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171128869",
            "dpc": "03032630301",
            "name": "ពៅ ជ្រិន"
        },
        {
            "barcode": "171128870",
            "dpc": "03032618401",
            "name": "វ៉ាន់ សុខា"
        },
        {
            "barcode": "171128871",
            "dpc": "03032607301",
            "name": "ពៅ ស្រីពេជ្រ"
        },
        {
            "barcode": "171128872",
            "dpc": "03032642101",
            "name": "ទិន សាមិត្ត"
        },
        {
            "barcode": "171128873",
            "dpc": "03032637801",
            "name": "ថូ សុភា"
        },
        {
            "barcode": "171128874",
            "dpc": "03032630501",
            "name": "ប៉ែន សារ៉ា"
        },
        {
            "barcode": "171128875",
            "dpc": "03032630101",
            "name": "មុយ គារ"
        },
        {
            "barcode": "171128876",
            "dpc": "03032630001",
            "name": "ឡាយ អូន"
        },
        {
            "barcode": "171128877",
            "dpc": "03032628801",
            "name": "យ៉ាន់ យឿន"
        },
        {
            "barcode": "171128878",
            "dpc": "03032622401",
            "name": "លន់ យឿន"
        },
        {
            "barcode": "171128879",
            "dpc": "03032614901",
            "name": "មុត មាន"
        },
        {
            "barcode": "171128880",
            "dpc": "03032614701",
            "name": "តាំង ប៊ុនហួត"
        },
        {
            "barcode": "171128881",
            "dpc": "03032605301",
            "name": "សេក វណ្ណថន"
        },
        {
            "barcode": "171128882",
            "dpc": "03032605201",
            "name": "តាន់ គឹមឡេង"
        },
        {
            "barcode": "171128883",
            "dpc": "03032601001",
            "name": "ញ៉ែម គឹមហេង"
        },
        {
            "barcode": "171128884",
            "dpc": "03032634501",
            "name": "កែ សៅ"
        },
        {
            "barcode": "171128885",
            "dpc": "03032626201",
            "name": "ជឿន គឹមសួរ"
        },
        {
            "barcode": "171128886",
            "dpc": "03032621501",
            "name": "ដួង ដារ៉ា"
        },
        {
            "barcode": "171128887",
            "dpc": "03032621401",
            "name": "ព្រំ ចំរើន"
        },
        {
            "barcode": "171128888",
            "dpc": "03032600801",
            "name": "ច័ន្ទ ថាវី"
        },
        {
            "barcode": "171128889",
            "dpc": "03032627201",
            "name": "យឹម ខេមរៈ"
        },
        {
            "barcode": "171128890",
            "dpc": "03032621201",
            "name": "ឈឹម សាមុន"
        },
        {
            "barcode": "171128891",
            "dpc": "03032619501",
            "name": "ចាន់ សេង"
        },
        {
            "barcode": "171128892",
            "dpc": "03032615301",
            "name": "ម៉ាស់ ម៉ាត់សេត"
        },
        {
            "barcode": "171128893",
            "dpc": "03032614801",
            "name": "ជា លែងហួត"
        },
        {
            "barcode": "171128894",
            "dpc": "03032614501",
            "name": "សាម ដារ៉ា"
        },
        {
            "barcode": "171128895",
            "dpc": "03032607701",
            "name": "ចាន់ សុខា"
        },
        {
            "barcode": "171128896",
            "dpc": "03032600901",
            "name": "ឡិប ណាវី"
        },
        {
            "barcode": "171128897",
            "dpc": "03032626601",
            "name": "ញ៉ែម សុធូ"
        },
        {
            "barcode": "171128898",
            "dpc": "03032626101",
            "name": "ជា ខាំ"
        },
        {
            "barcode": "171128899",
            "dpc": "03032626001",
            "name": "ជា ពន្លឺរស្មី"
        },
        {
            "barcode": "171128900",
            "dpc": "03032625901",
            "name": "ហោ ឃឺន"
        },
        {
            "barcode": "171128901",
            "dpc": "03032625801",
            "name": "ជា ង៉ិត"
        },
        {
            "barcode": "171128902",
            "dpc": "03032625701",
            "name": "ព្រុំ វណ្ណារី"
        },
        {
            "barcode": "171128903",
            "dpc": "03032624601",
            "name": "ឃុន ចន្ធី"
        },
        {
            "barcode": "171128904",
            "dpc": "03032623001",
            "name": "វី សាវង់"
        },
        {
            "barcode": "171128905",
            "dpc": "03032621801",
            "name": "កែវ អន"
        },
        {
            "barcode": "171128906",
            "dpc": "03032621701",
            "name": "ណម សុផាន"
        },
        {
            "barcode": "171128907",
            "dpc": "03032619601",
            "name": "វ៉ាន់ ស៊ីន"
        },
        {
            "barcode": "171128908",
            "dpc": "03032605601",
            "name": "ចុន ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171128909",
            "dpc": "03032636401",
            "name": "ជា ធូ"
        },
        {
            "barcode": "171128910",
            "dpc": "03032636301",
            "name": "សួស រំផា"
        },
        {
            "barcode": "171128911",
            "dpc": "03032636201",
            "name": "តឹក ឃុន"
        },
        {
            "barcode": "171128912",
            "dpc": "03032634401",
            "name": "លី កែវ"
        },
        {
            "barcode": "171128913",
            "dpc": "03032630401",
            "name": "ឆន វុទ្ធា"
        },
        {
            "barcode": "171128914",
            "dpc": "03032626501",
            "name": "សួន សុដានី"
        },
        {
            "barcode": "171128915",
            "dpc": "03032626401",
            "name": "កែវ ចាន់ថុល"
        },
        {
            "barcode": "171128916",
            "dpc": "03032623201",
            "name": "ស៊ុក វ៉ាន់ឌី"
        },
        {
            "barcode": "171128917",
            "dpc": "03032623101",
            "name": "ឈឹម ភីណាល់"
        },
        {
            "barcode": "171128918",
            "dpc": "03032622701",
            "name": "សុន សាវឿន"
        },
        {
            "barcode": "171128919",
            "dpc": "03032619701",
            "name": "ហាន់ ហ៊ីម"
        },
        {
            "barcode": "171128920",
            "dpc": "03032614601",
            "name": "ហូ ទិត្យ"
        },
        {
            "barcode": "171128921",
            "dpc": "03032614201",
            "name": "ហង់ វណ្ណី"
        },
        {
            "barcode": "171128922",
            "dpc": "03032614101",
            "name": "ក្រេម ប៉ូលីន"
        },
        {
            "barcode": "171128923",
            "dpc": "03032610701",
            "name": "ចាន់ ណារ៉ុង"
        },
        {
            "barcode": "171128924",
            "dpc": "03032608601",
            "name": "លី សុខសីហា"
        },
        {
            "barcode": "171128925",
            "dpc": "03032608301",
            "name": "ប៉ុន សេដ្ឋា"
        },
        {
            "barcode": "171128926",
            "dpc": "03032607601",
            "name": "សយ វ៉ិន"
        },
        {
            "barcode": "171128927",
            "dpc": "03032607501",
            "name": "ឯក កេត"
        },
        {
            "barcode": "171128928",
            "dpc": "03032607401",
            "name": "សរ សំណាង"
        },
        {
            "barcode": "171128929",
            "dpc": "03032606601",
            "name": "ហាវ ចន្ទតារា"
        },
        {
            "barcode": "171128930",
            "dpc": "03032605801",
            "name": "ស៊ឹម សល្យ"
        },
        {
            "barcode": "171128931",
            "dpc": "03032640101",
            "name": "តាំង គី"
        },
        {
            "barcode": "171128932",
            "dpc": "03032608001",
            "name": "វ៉ាន់ សារុំ"
        },
        {
            "barcode": "171128933",
            "dpc": "03032633501",
            "name": "ទួន ថាវី"
        },
        {
            "barcode": "171128934",
            "dpc": "03032618501",
            "name": "លី ម៉ៃហ្វុង"
        },
        {
            "barcode": "171128935",
            "dpc": "03032602501",
            "name": "លឹម ខន"
        },
        {
            "barcode": "171128936",
            "dpc": "03032601601",
            "name": "នុត ធួក"
        },
        {
            "barcode": "171128937",
            "dpc": "03032637701",
            "name": "ថុន ថាលីន"
        },
        {
            "barcode": "171128938",
            "dpc": "03032625201",
            "name": "លី អ៊ុតនី"
        },
        {
            "barcode": "171128939",
            "dpc": "03032629701",
            "name": "នាង ណៃ"
        },
        {
            "barcode": "171128940",
            "dpc": "03032602001",
            "name": "ឡុង ថុល"
        },
        {
            "barcode": "171128941",
            "dpc": "03032602401",
            "name": "គឹម ណារេត"
        },
        {
            "barcode": "171128942",
            "dpc": "03032635601",
            "name": "ជា សុផាន់ណា"
        },
        {
            "barcode": "171128943",
            "dpc": "03032617601",
            "name": "កង សុវណ្ណអង្គារ"
        },
        {
            "barcode": "171128944",
            "dpc": "03032635501",
            "name": "ឡាច ផូ"
        },
        {
            "barcode": "171128945",
            "dpc": "03032637601",
            "name": "ជួង កែវរដ្ឋា"
        },
        {
            "barcode": "171128946",
            "dpc": "03032618901",
            "name": "ចៅ ណាង"
        },
        {
            "barcode": "171128947",
            "dpc": "03032634001",
            "name": "សំ ផន"
        },
        {
            "barcode": "171128948",
            "dpc": "03032602201",
            "name": "សំ ជ្រីម"
        },
        {
            "barcode": "171128949",
            "dpc": "03032624701",
            "name": "ឡូញ ពៅ"
        },
        {
            "barcode": "171128950",
            "dpc": "03032619001",
            "name": "កែវ សុវណ្ណ"
        },
        {
            "barcode": "171128951",
            "dpc": "03032602901",
            "name": "ហង់ វណ្ឌី"
        },
        {
            "barcode": "171128952",
            "dpc": "03032640801",
            "name": "ប៉ុក វ៉ុង"
        },
        {
            "barcode": "171128953",
            "dpc": "03032618701",
            "name": "ជូ កែវពិសិដ្ឋ"
        },
        {
            "barcode": "171128954",
            "dpc": "03032622601",
            "name": "នៅ ចាន់"
        },
        {
            "barcode": "171128955",
            "dpc": "03032618801",
            "name": "ហាប់ វី"
        },
        {
            "barcode": "171128956",
            "dpc": "03032601101",
            "name": "សុខ អេង"
        },
        {
            "barcode": "171128957",
            "dpc": "03032600101",
            "name": "គឹម ឡី"
        },
        {
            "barcode": "171128958",
            "dpc": "03032644001",
            "name": "នួន សុខា"
        },
        {
            "barcode": "171128959",
            "dpc": "03032622501",
            "name": "ដែក ចាន់នួន"
        },
        {
            "barcode": "171128960",
            "dpc": "03032633801",
            "name": "អ៊ុង សុភ័ណ្ឌ"
        },
        {
            "barcode": "171128961",
            "dpc": "03032640301",
            "name": "ដោ ស៊ីនឿន"
        },
        {
            "barcode": "171128962",
            "dpc": "03032635701",
            "name": "ណាំ ណាន"
        },
        {
            "barcode": "171128963",
            "dpc": "03032635801",
            "name": "ទា សៀកជា"
        },
        {
            "barcode": "171128964",
            "dpc": "03032633601",
            "name": "ស៊ិន សុជាតិ"
        },
        {
            "barcode": "171128965",
            "dpc": "03032632101",
            "name": "លី វ៉ាន់ណា"
        },
        {
            "barcode": "171128966",
            "dpc": "03032632001",
            "name": "គឹម លាង"
        },
        {
            "barcode": "171128967",
            "dpc": "03032633701",
            "name": "ប៉ាល់ តឹក"
        },
        {
            "barcode": "171128968",
            "dpc": "03032628301",
            "name": "ទឹម បំរ៉ុង"
        },
        {
            "barcode": "171128969",
            "dpc": "03032606701",
            "name": "ហុក ហេង"
        },
        {
            "barcode": "171128970",
            "dpc": "03032606501",
            "name": "ដួង ភាច"
        },
        {
            "barcode": "171128971",
            "dpc": "03032619801",
            "name": "សុខ សូល័ក្ខណ៍"
        },
        {
            "barcode": "171128972",
            "dpc": "03032608401",
            "name": "ឡាច ផេង"
        },
        {
            "barcode": "171128973",
            "dpc": "03032625501",
            "name": "ហុង ជីហាក់"
        },
        {
            "barcode": "171128974",
            "dpc": "03032624501",
            "name": "សុខ ណាវី"
        },
        {
            "barcode": "171128975",
            "dpc": "03032628701",
            "name": "ចិន មុំ(វត្តទួលតាឯក)"
        },
        {
            "barcode": "171128976",
            "dpc": "03032636101",
            "name": "ហេង ណេង"
        },
        {
            "barcode": "171128977",
            "dpc": "03032636001",
            "name": "ជិន ហឿន"
        },
        {
            "barcode": "171128978",
            "dpc": "03032632201",
            "name": "ទេព ករុណា"
        },
        {
            "barcode": "171128979",
            "dpc": "03032605701",
            "name": "យូ បូរ"
        },
        {
            "barcode": "171128980",
            "dpc": "03032633401",
            "name": "សេក ហួយ"
        },
        {
            "barcode": "171128981",
            "dpc": "03032608201",
            "name": "អ៊ុច សុខហ៊ាង"
        },
        {
            "barcode": "171128982",
            "dpc": "03032607801",
            "name": "ថង ឈិនសុភា"
        },
        {
            "barcode": "171128983",
            "dpc": "03032607901",
            "name": "ឡុង សារេត"
        },
        {
            "barcode": "171128984",
            "dpc": "03032619201",
            "name": "រិន ពន្លក"
        },
        {
            "barcode": "171128985",
            "dpc": "03032637501",
            "name": "ច្រឹង ច័ន្ទរស្មី"
        },
        {
            "barcode": "171128986",
            "dpc": "03032628601",
            "name": "ហេង វុទ្ធី"
        },
        {
            "barcode": "171128987",
            "dpc": "03032615201",
            "name": "សេង សោម៉ា"
        },
        {
            "barcode": "171128988",
            "dpc": "03032619101",
            "name": "ម៉ែន សំអុល"
        },
        {
            "barcode": "171128989",
            "dpc": "03032635901",
            "name": "ទ្រី គឹមហៀង"
        },
        {
            "barcode": "171128990",
            "dpc": "03032603101",
            "name": "វង្ស ណៃ"
        },
        {
            "barcode": "171128991",
            "dpc": "03032600601",
            "name": "ឈុន លីណា"
        },
        {
            "barcode": "171128992",
            "dpc": "03032603001",
            "name": "ហាក់ ស្រី"
        },
        {
            "barcode": "171128993",
            "dpc": "03032622801",
            "name": "ឡុង វិត"
        },
        {
            "barcode": "171128994",
            "dpc": "03032631801",
            "name": "សេង រ៉ានី"
        },
        {
            "barcode": "171128995",
            "dpc": "03032633901",
            "name": "ហ៊ាង សុខហេង"
        },
        {
            "barcode": "171128996",
            "dpc": "03032631901",
            "name": "ឈាង សែម"
        },
        {
            "barcode": "171128997",
            "dpc": "03032600201",
            "name": "ឃុត សោភ័ណ"
        },
        {
            "barcode": "171128998",
            "dpc": "03032602601",
            "name": "រ៉ុន ចាន់ធី"
        },
        {
            "barcode": "171128999",
            "dpc": "03032602701",
            "name": "សុខ ចំរើន"
        },
        {
            "barcode": "171129000",
            "dpc": "03032621901",
            "name": "មឿត សាមឿន"
        },
        {
            "barcode": "171129001",
            "dpc": "03032603201",
            "name": "នួន សុគុណ"
        },
        {
            "barcode": "171129002",
            "dpc": "03032630201",
            "name": "ឃាន សំណាង"
        },
        {
            "barcode": "171129003",
            "dpc": "03032633301",
            "name": "គង់ សម"
        },
        {
            "barcode": "171129004",
            "dpc": "03032602101",
            "name": "សៅ សុភក្តិ"
        },
        {
            "barcode": "171129005",
            "dpc": "03032605901",
            "name": "មាស លីហួយ"
        },
        {
            "barcode": "171129006",
            "dpc": "03032609401",
            "name": "ប៊ុន ណាក់"
        },
        {
            "barcode": "171129007",
            "dpc": "03032620901",
            "name": "តាំង យ៉ាវ"
        },
        {
            "barcode": "171129008",
            "dpc": "03032630801",
            "name": "តែ គឹមសួន"
        },
        {
            "barcode": "171129009",
            "dpc": "03032615401",
            "name": "ម៉ៅ សុវណ្ណារី"
        },
        {
            "barcode": "171129010",
            "dpc": "03032641201",
            "name": "លី ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171129011",
            "dpc": "03032633001",
            "name": "លាង ហាក់"
        },
        {
            "barcode": "171129012",
            "dpc": "03032639901",
            "name": "ហុក កុសល៤"
        },
        {
            "barcode": "171129013",
            "dpc": "03032640001",
            "name": "បៅ តុង"
        },
        {
            "barcode": "171129014",
            "dpc": "03032643901",
            "name": "លឹម ឃុន"
        },
        {
            "barcode": "171129015",
            "dpc": "03032636701",
            "name": "សួ លី១"
        },
        {
            "barcode": "171129016",
            "dpc": "03032637001",
            "name": "សុខ ហេង១"
        },
        {
            "barcode": "171129017",
            "dpc": "03032636901",
            "name": "សុខ ហេង"
        },
        {
            "barcode": "171129018",
            "dpc": "03032638501",
            "name": "ឡុង ផន"
        },
        {
            "barcode": "171129019",
            "dpc": "03032638601",
            "name": "សែន គីមស៊ន"
        },
        {
            "barcode": "171129020",
            "dpc": "03032643701",
            "name": "សំ សេង"
        },
        {
            "barcode": "171129021",
            "dpc": "03032627701",
            "name": "យៀង គឹមយ៉ា"
        },
        {
            "barcode": "171129022",
            "dpc": "03032636801",
            "name": "សំ សេង ១"
        },
        {
            "barcode": "171129023",
            "dpc": "03032643801",
            "name": "កេង កន្និដ្ឋា"
        },
        {
            "barcode": "171129024",
            "dpc": "03032620801",
            "name": "ភៀន សុផល"
        },
        {
            "barcode": "171129025",
            "dpc": "03032617701",
            "name": "សួ លី"
        },
        {
            "barcode": "171129026",
            "dpc": "03032631401",
            "name": "ម៉ូវ ហោ"
        },
        {
            "barcode": "171129027",
            "dpc": "03032639301",
            "name": "ស៊ុន សុផា"
        },
        {
            "barcode": "171129028",
            "dpc": "03032606401",
            "name": "សុខ ភាព"
        },
        {
            "barcode": "171129029",
            "dpc": "03032606801",
            "name": "គឹម លី"
        },
        {
            "barcode": "171129030",
            "dpc": "03032614001",
            "name": "ជួន ប៉ូឡូ"
        },
        {
            "barcode": "171129031",
            "dpc": "03032621101",
            "name": "ជា វិដេ"
        },
        {
            "barcode": "171129032",
            "dpc": "03032629601",
            "name": "ហ៊ី ស៊ីថា"
        },
        {
            "barcode": "171129033",
            "dpc": "03032610501",
            "name": "តន់ សាវ៉ាត់"
        },
        {
            "barcode": "171129034",
            "dpc": "03032621001",
            "name": "ជា ពេង"
        },
        {
            "barcode": "171129035",
            "dpc": "03032638401",
            "name": "សោម សំនៀង"
        },
        {
            "barcode": "171129036",
            "dpc": "03032639201",
            "name": "សេង សុខនី"
        },
        {
            "barcode": "171129037",
            "dpc": "03032600401",
            "name": "កេង សុខហេង"
        },
        {
            "barcode": "171129038",
            "dpc": "03032609301",
            "name": "ថន គឹមហុង ១"
        },
        {
            "barcode": "171129039",
            "dpc": "03032616901",
            "name": "លាង សៀនអាន"
        },
        {
            "barcode": "171129040",
            "dpc": "03032607101",
            "name": "លឹម រក្សា"
        },
        {
            "barcode": "171129041",
            "dpc": "03032607201",
            "name": "តាំង ហុកសេង"
        },
        {
            "barcode": "171129042",
            "dpc": "03032610201",
            "name": "ឆាន់ រឿន"
        },
        {
            "barcode": "171129043",
            "dpc": "03032606301",
            "name": "មាស ឧត្តម"
        },
        {
            "barcode": "171129044",
            "dpc": "03032606201",
            "name": "លាង ហាវ"
        },
        {
            "barcode": "171129045",
            "dpc": "03032645401",
            "name": "ង៉ោ គន្ធា"
        },
        {
            "barcode": "171129046",
            "dpc": "03032645301",
            "name": "ហ៊ុយ ស៊ីម១"
        },
        {
            "barcode": "171129047",
            "dpc": "03032609601",
            "name": "ហ្វឹក អាន"
        },
        {
            "barcode": "171129048",
            "dpc": "03032610101",
            "name": "តាន់ ឡួង"
        },
        {
            "barcode": "171129049",
            "dpc": "03032616801",
            "name": "ឃូ ឡេង"
        },
        {
            "barcode": "171129050",
            "dpc": "03032609501",
            "name": "សុខ ឡេង"
        },
        {
            "barcode": "171129051",
            "dpc": "03032609201",
            "name": "ជា ចំរើន"
        },
        {
            "barcode": "171129052",
            "dpc": "03032603801",
            "name": "ហ្គូវ លាងគា"
        },
        {
            "barcode": "171129053",
            "dpc": "03032609101",
            "name": "សាន ពលៈ"
        },
        {
            "barcode": "171129054",
            "dpc": "03032630901",
            "name": "អេង ម៉េង"
        },
        {
            "barcode": "171129055",
            "dpc": "03032601901",
            "name": "យ៉ង់ ហាវ"
        },
        {
            "barcode": "171129056",
            "dpc": "03032609001",
            "name": "តាំង សុខហ៊ី"
        },
        {
            "barcode": "171129057",
            "dpc": "03032627601",
            "name": "ហុង ស៊ីវ"
        },
        {
            "barcode": "171129058",
            "dpc": "03032639401",
            "name": "ឃីម គឹមលាង"
        },
        {
            "barcode": "171129059",
            "dpc": "03032616101",
            "name": "គឹម ពេជ្រ"
        },
        {
            "barcode": "171129060",
            "dpc": "03032610301",
            "name": "ម៉ៃ ផាណា"
        },
        {
            "barcode": "171129061",
            "dpc": "03032647901",
            "name": "ញ៉ែម តិច"
        },
        {
            "barcode": "171129062",
            "dpc": "03032647801",
            "name": "អ៊ុន ទាគួង"
        },
        {
            "barcode": "171129063",
            "dpc": "03032647701",
            "name": "អ៊ុន ណារ៉ុង"
        },
        {
            "barcode": "171129064",
            "dpc": "03032647601",
            "name": "ឌឹម វីរោចន៍"
        },
        {
            "barcode": "171129065",
            "dpc": "03032647501",
            "name": "ស៊ី នួន"
        },
        {
            "barcode": "171129066",
            "dpc": "03032647301",
            "name": "ជិន ហុក"
        },
        {
            "barcode": "171129067",
            "dpc": "03032647201",
            "name": "ហឿង សុជាតិ"
        },
        {
            "barcode": "171129068",
            "dpc": "03032647101",
            "name": "តាន់ សៅដេត"
        },
        {
            "barcode": "171129069",
            "dpc": "03032646501",
            "name": "កៅ សារ៉ាឌី"
        },
        {
            "barcode": "171129070",
            "dpc": "03032646401",
            "name": "ហ៊ួរ ហាវ"
        },
        {
            "barcode": "171129071",
            "dpc": "03032646301",
            "name": "រិម សុវឌ្ឍនា"
        },
        {
            "barcode": "171129072",
            "dpc": "03032628501",
            "name": "ជឺ ពុំ៤"
        },
        {
            "barcode": "171129073",
            "dpc": "03032635301",
            "name": "ហេង ទន"
        },
        {
            "barcode": "171129074",
            "dpc": "03032623401",
            "name": "ស៊ុន សាវ៉ាត"
        },
        {
            "barcode": "171129075",
            "dpc": "03032629501",
            "name": "យ៉ុង យី"
        },
        {
            "barcode": "171129076",
            "dpc": "03032615801",
            "name": "ស្វាង សាវី"
        },
        {
            "barcode": "171129077",
            "dpc": "03032627501",
            "name": "សែម ដារា"
        },
        {
            "barcode": "171129078",
            "dpc": "03032615901",
            "name": "នេត អង់តូនី"
        },
        {
            "barcode": "171129079",
            "dpc": "03032641801",
            "name": "សុខ សុផាន់នី"
        },
        {
            "barcode": "171129080",
            "dpc": "03032620701",
            "name": "យូ គាសៀង"
        },
        {
            "barcode": "171129081",
            "dpc": "03032620601",
            "name": "ចាំង វិនខង"
        },
        {
            "barcode": "171129082",
            "dpc": "03032620501",
            "name": "ហេង សុខហួត"
        },
        {
            "barcode": "171129083",
            "dpc": "03032618301",
            "name": "សូ ណារិនរ៉ាវី"
        },
        {
            "barcode": "171129084",
            "dpc": "03032618201",
            "name": "ហូ គឹមហេង"
        },
        {
            "barcode": "171129085",
            "dpc": "03032618101",
            "name": "ដាញ់ អេងប៊ុនវ៉ាន់"
        },
        {
            "barcode": "171129086",
            "dpc": "03032616601",
            "name": "កឿន សត្យា"
        },
        {
            "barcode": "171129087",
            "dpc": "03032617301",
            "name": "ជឺ ពុំ ១"
        },
        {
            "barcode": "171129088",
            "dpc": "03032620401",
            "name": "ឆ អ៊ឹង"
        },
        {
            "barcode": "171129089",
            "dpc": "03032641901",
            "name": "តាំង ផេងហ៊ី"
        },
        {
            "barcode": "171129090",
            "dpc": "03032642001",
            "name": "តាំង ផេងហ៊ី ១"
        },
        {
            "barcode": "171129091",
            "dpc": "03032616501",
            "name": "ងិន សុកជា"
        },
        {
            "barcode": "171129092",
            "dpc": "03032616401",
            "name": "ស៊ី ថាពេជ្រ"
        },
        {
            "barcode": "171129093",
            "dpc": "03032617201",
            "name": "សាន់ ហៃ"
        },
        {
            "barcode": "171129094",
            "dpc": "03032615701",
            "name": "គឹម ម៉ូលី"
        },
        {
            "barcode": "171129095",
            "dpc": "03032615601",
            "name": "គា លីហូវ"
        },
        {
            "barcode": "171129096",
            "dpc": "03032615501",
            "name": "យូ គាសី"
        },
        {
            "barcode": "171129097",
            "dpc": "03032623601",
            "name": "ថា ប៊ុនធឿន"
        },
        {
            "barcode": "171129098",
            "dpc": "03032620301",
            "name": "តាំង សុខជូ"
        },
        {
            "barcode": "171129099",
            "dpc": "03032623701",
            "name": "យ៉ាន់ ម៉ៅ"
        },
        {
            "barcode": "171129100",
            "dpc": "03032623801",
            "name": "រិន សម្បត្តិ"
        },
        {
            "barcode": "171129101",
            "dpc": "03032638801",
            "name": "នឹម ស៊ីនួន"
        },
        {
            "barcode": "171129102",
            "dpc": "03032626301",
            "name": "អ៊ិន ឧត្តម"
        },
        {
            "barcode": "171129103",
            "dpc": "03032619401",
            "name": "ហេង ហុក១"
        },
        {
            "barcode": "171129104",
            "dpc": "03032624201",
            "name": "លីម ម៉ីយិន"
        },
        {
            "barcode": "171129105",
            "dpc": "03032627901",
            "name": "ឯម សាវ៉ាត់"
        },
        {
            "barcode": "171129106",
            "dpc": "03032632401",
            "name": "ឡុង អេងថៃ"
        },
        {
            "barcode": "171129107",
            "dpc": "03032632301",
            "name": "ទុយ វីន"
        },
        {
            "barcode": "171129108",
            "dpc": "03032629201",
            "name": "សូ សុកិត្យា"
        },
        {
            "barcode": "171129109",
            "dpc": "03032628101",
            "name": "ពៅ កញ្ញា"
        },
        {
            "barcode": "171129110",
            "dpc": "03032633101",
            "name": "ពឹង គឹមជូ"
        },
        {
            "barcode": "171129111",
            "dpc": "03032645701",
            "name": "ចៅ ស៊ីនលី"
        },
        {
            "barcode": "171129112",
            "dpc": "03032639601",
            "name": "សុង ហេង"
        },
        {
            "barcode": "171129113",
            "dpc": "03032631001",
            "name": "វ៉ាត ទូច"
        },
        {
            "barcode": "171129114",
            "dpc": "03032641301",
            "name": "តាំង សុវឌ្ឍនា"
        },
        {
            "barcode": "171129115",
            "dpc": "03032631101",
            "name": "តាន់ ប៊ុនពៅ"
        },
        {
            "barcode": "171129116",
            "dpc": "03032645501",
            "name": "ប៊ុន ហឿន ១"
        },
        {
            "barcode": "171129117",
            "dpc": "03032634601",
            "name": "ឡាយ ច័ន្ទរិទ្ធ"
        },
        {
            "barcode": "171129118",
            "dpc": "03032623301",
            "name": "ស៊ុំ នារ៉ា"
        },
        {
            "barcode": "171129119",
            "dpc": "03032638701",
            "name": "ឈឿន ហ័ន"
        },
        {
            "barcode": "171129120",
            "dpc": "03032639501",
            "name": "ធុច វ៉ា"
        },
        {
            "barcode": "171129121",
            "dpc": "03032627801",
            "name": "ធុច វណ្ណារ៉ាត់"
        },
        {
            "barcode": "171129122",
            "dpc": "03032625601",
            "name": "ពា លីហួរ"
        },
        {
            "barcode": "171129123",
            "dpc": "03032610601",
            "name": "ឈាង គុយ ហ៊ី"
        },
        {
            "barcode": "171129124",
            "dpc": "03032610401",
            "name": "សេម សេង"
        },
        {
            "barcode": "171129125",
            "dpc": "03032637201",
            "name": "សុធី គីរី"
        },
        {
            "barcode": "171129126",
            "dpc": "03032638901",
            "name": "ហួត ថាវី"
        },
        {
            "barcode": "171129127",
            "dpc": "03032631501",
            "name": "ហ៊ុន ម៉ាលីស"
        },
        {
            "barcode": "171129128",
            "dpc": "03032632801",
            "name": "អ៊ឹង ឡៃគីម"
        },
        {
            "barcode": "171129129",
            "dpc": "03032632701",
            "name": "អាង យ៉េង"
        },
        {
            "barcode": "171129130",
            "dpc": "03032632601",
            "name": "ចេង លីស៊ុនឃាង"
        },
        {
            "barcode": "171129131",
            "dpc": "03032628201",
            "name": "ច័ន្ទ ថន"
        },
        {
            "barcode": "171129132",
            "dpc": "03032643501",
            "name": "ចន្ទ័ ហេង"
        },
        {
            "barcode": "171129133",
            "dpc": "03032632501",
            "name": "ខៀវ ផាត់ជិន្នី"
        },
        {
            "barcode": "171129134",
            "dpc": "03032637101",
            "name": "ភោគ សុភី"
        },
        {
            "barcode": "171129135",
            "dpc": "03032645801",
            "name": "ស៊ិន សេរីរ័ត្ន"
        },
        {
            "barcode": "171129136",
            "dpc": "03032639801",
            "name": "ហង្ស សុធារ័ត្ន"
        },
        {
            "barcode": "171129137",
            "dpc": "03032645901",
            "name": "លឹម សុខខេង ១"
        },
        {
            "barcode": "171129138",
            "dpc": "03032639001",
            "name": "ហៀង ម៉ារី"
        },
        {
            "barcode": "171129139",
            "dpc": "03032641701",
            "name": "ម៉ែង សុធាកន្និដ្ឋា"
        },
        {
            "barcode": "171129140",
            "dpc": "03032641601",
            "name": "ទឹម ប៊ុនធី"
        },
        {
            "barcode": "171129141",
            "dpc": "03032646101",
            "name": "ហាន ស៊ីហ៊ីប"
        },
        {
            "barcode": "171129142",
            "dpc": "03032637301",
            "name": "ប៊ិច សារឿត"
        },
        {
            "barcode": "171129143",
            "dpc": "03032640601",
            "name": "ពៅ ទិញ"
        },
        {
            "barcode": "171129144",
            "dpc": "03032624001",
            "name": "សេង ស្រីពៅ"
        },
        {
            "barcode": "171129145",
            "dpc": "03032616001",
            "name": "សេង ស្រីពៅ ១"
        },
        {
            "barcode": "171129146",
            "dpc": "03032629801",
            "name": "ហុក កុសល២"
        },
        {
            "barcode": "171129147",
            "dpc": "03032616701",
            "name": "ហុក កុសល"
        },
        {
            "barcode": "171129148",
            "dpc": "03032629301",
            "name": "អ៊ឹម ច័ន្ទសុធា"
        },
        {
            "barcode": "171129149",
            "dpc": "03032631201",
            "name": "តាំង ណាំផេង"
        },
        {
            "barcode": "171129150",
            "dpc": "03032629401",
            "name": "ស៊ាវ សុវិជ្ជរី"
        },
        {
            "barcode": "171129151",
            "dpc": "03032639701",
            "name": "ហ៊ឹង ហូលិវុធ"
        },
        {
            "barcode": "171129152",
            "dpc": "03032620101",
            "name": "ម៉ុក សុវណ្ណឌី"
        },
        {
            "barcode": "171129153",
            "dpc": "03032641501",
            "name": "ទិត ច័ន្ទ្រកេសី"
        },
        {
            "barcode": "171129154",
            "dpc": "03032631301",
            "name": "វ៉ើន វណ្ណៈ"
        },
        {
            "barcode": "171129155",
            "dpc": "03032634701",
            "name": "អ៊ី ស៊ុនហួត"
        },
        {
            "barcode": "171129156",
            "dpc": "03032625401",
            "name": "ផ្សាររោងចក្រតំបាញ"
        },
        {
            "barcode": "171129157",
            "dpc": "03032630601",
            "name": "ចាន់ ហួត"
        },
        {
            "barcode": "171129158",
            "dpc": "03032628901",
            "name": "អ៊ឹង សួរ"
        },
        {
            "barcode": "171129159",
            "dpc": "03032629001",
            "name": "ប៊ុន ចំរើន"
        },
        {
            "barcode": "171129160",
            "dpc": "03032629901",
            "name": "ងី លាងសេង"
        },
        {
            "barcode": "171129161",
            "dpc": "03032603901",
            "name": "តាន់ មីសស្សែល ២៥៦"
        },
        {
            "barcode": "171129162",
            "dpc": "03032613801",
            "name": "តាន់ មីសស្សែល ២៥៤"
        },
        {
            "barcode": "171129163",
            "dpc": "03032613701",
            "name": "តាន់ មីសស្សែល ២៥២"
        },
        {
            "barcode": "171129164",
            "dpc": "03032613601",
            "name": "តាន់ មីសស្សែល ២៥០"
        },
        {
            "barcode": "171129165",
            "dpc": "03032613401",
            "name": "តាន់ មីសស្សែល ២៤៦"
        },
        {
            "barcode": "171129166",
            "dpc": "03032613301",
            "name": "តាន់ មីសស្សែល ២៤៤"
        },
        {
            "barcode": "171129167",
            "dpc": "03032613201",
            "name": "តាន់ មីសស្សែល ២៤២"
        },
        {
            "barcode": "171129168",
            "dpc": "03032613001",
            "name": "តាន់ មីសស្សែល ២៣៨"
        },
        {
            "barcode": "171129169",
            "dpc": "03032612901",
            "name": "តាន់ មីសស្សែល ២៣៦"
        },
        {
            "barcode": "171129170",
            "dpc": "03032612801",
            "name": "តាន់ មីសស្សែល ២៣៤"
        },
        {
            "barcode": "171129171",
            "dpc": "03032612701",
            "name": "តាន់ មីសស្សែល ២៣២"
        },
        {
            "barcode": "171129172",
            "dpc": "03032612601",
            "name": "តាន់ មីសស្សែល ២៣០"
        },
        {
            "barcode": "171129173",
            "dpc": "03032612501",
            "name": "តាន់ មីសស្សែល ២២៨"
        },
        {
            "barcode": "171129174",
            "dpc": "03032612401",
            "name": "តាន់ មីសស្សែល ២២៦"
        },
        {
            "barcode": "171129175",
            "dpc": "03032610801",
            "name": "តាន់ មីសស្សែល ២២៥"
        },
        {
            "barcode": "171129176",
            "dpc": "03032611001",
            "name": "តាន់ មីសស្សែល ២២៩"
        },
        {
            "barcode": "171129177",
            "dpc": "03032611101",
            "name": "តាន់ មីសស្សែល ២៣១"
        },
        {
            "barcode": "171129178",
            "dpc": "03032611201",
            "name": "តាន់ មីសស្សែល ២៣៣"
        },
        {
            "barcode": "171129179",
            "dpc": "03032611301",
            "name": "តាន់ មីសស្សែល ២៣៥"
        },
        {
            "barcode": "171129180",
            "dpc": "03032611401",
            "name": "តាន់ មីសស្សែល ២៣៧"
        },
        {
            "barcode": "171129181",
            "dpc": "03032611501",
            "name": "តាន់ មីសស្សែល ២៣៩"
        },
        {
            "barcode": "171129182",
            "dpc": "03032611601",
            "name": "តាន់ មីសស្សែល ២៤១"
        },
        {
            "barcode": "171129183",
            "dpc": "03032611901",
            "name": "តាន់ មីសស្សែល ២៤៧"
        },
        {
            "barcode": "171129184",
            "dpc": "03032612101",
            "name": "តាន់ មីសស្សែល ២៥១"
        },
        {
            "barcode": "171129185",
            "dpc": "03032612201",
            "name": "តាន់ មីសស្សែល ២៥៣"
        },
        {
            "barcode": "171129186",
            "dpc": "03032612301",
            "name": "តាន់ មីសស្សែល ២៥៥"
        },
        {
            "barcode": "171129187",
            "dpc": "03032605001",
            "name": "សឿន ចន្ថា"
        },
        {
            "barcode": "171129188",
            "dpc": "03032622201",
            "name": "រ៉ូ រ៉យ៉ា"
        },
        {
            "barcode": "171129189",
            "dpc": "03032605101",
            "name": "ជា បូព្រី"
        },
        {
            "barcode": "171129190",
            "dpc": "03032600501",
            "name": "ស៊ុន សុផា"
        },
        {
            "barcode": "171129191",
            "dpc": "03032621601",
            "name": "ផែ ណាំជៀវ"
        },
        {
            "barcode": "171129192",
            "dpc": "03032602801",
            "name": "ពិន ទី"
        },
        {
            "barcode": "171129193",
            "dpc": "03032603301",
            "name": "ម៉ី ផល្លា"
        },
        {
            "barcode": "171129194",
            "dpc": "03032622301",
            "name": "គឹម ឡាង"
        },
        {
            "barcode": "171129195",
            "dpc": "03032600301",
            "name": "ថាំង ចន្ថា"
        },
        {
            "barcode": "171129196",
            "dpc": "03032617001",
            "name": "ង៉ែត រ៉ែម"
        },
        {
            "barcode": "171129197",
            "dpc": "03032618601",
            "name": "ស្រី ម៉ានិត"
        },
        {
            "barcode": "171129198",
            "dpc": "03032638301",
            "name": "វិទ្យាល័យព្រះមុន្នីវង្ស"
        },
        {
            "barcode": "171129199",
            "dpc": "03032604701",
            "name": "សាបូអូហ្សាណូ"
        },
        {
            "barcode": "171129200",
            "dpc": "03032604101",
            "name": "គឹម ធីតា"
        },
        {
            "barcode": "171129201",
            "dpc": "03032604001",
            "name": "ស៊្រី គង់ដា"
        },
        {
            "barcode": "171129202",
            "dpc": "03032604201",
            "name": "សុខ រីន"
        },
        {
            "barcode": "171129203",
            "dpc": "03032604601",
            "name": "កឹម សាផាន្នភិរម្យ"
        },
        {
            "barcode": "171129204",
            "dpc": "03032608801",
            "name": "ចាប ក្លូត"
        },
        {
            "barcode": "171129205",
            "dpc": "03032608901",
            "name": "ប៉ិល សុវណ្ណា"
        },
        {
            "barcode": "171129206",
            "dpc": "03032604401",
            "name": "ភោគ សុភី"
        },
        {
            "barcode": "171129207",
            "dpc": "03032604501",
            "name": "ហេង រតនា"
        },
        {
            "barcode": "171129208",
            "dpc": "03032638201",
            "name": "វិទ្យាល័យ សោហឺ"
        },
        {
            "barcode": "171129209",
            "dpc": "03032605501",
            "name": "ចេង រស្មី"
        },
        {
            "barcode": "171129210",
            "dpc": "03032608501",
            "name": "ចាន់ ឃឿង"
        },
        {
            "barcode": "171129211",
            "dpc": "03032624101",
            "name": "ឌុល ម៉ូលី"
        },
        {
            "barcode": "171129212",
            "dpc": "03032617101",
            "name": "ឈួម ប៉ាន"
        },
        {
            "barcode": "171129213",
            "dpc": "03032601701",
            "name": "គួច វែង"
        },
        {
            "barcode": "171129214",
            "dpc": "03032601401",
            "name": "ឈីវ គី"
        },
        {
            "barcode": "171129215",
            "dpc": "03032638001",
            "name": "ឌួង វណ្ណា ១"
        },
        {
            "barcode": "171129216",
            "dpc": "03032634801",
            "name": "ចាន់ ប៊ុនធឿន"
        },
        {
            "barcode": "171129217",
            "dpc": "03032624401",
            "name": "ឆាយ គឹមជា"
        },
        {
            "barcode": "171129218",
            "dpc": "03032614301",
            "name": "គង់ សុផល"
        },
        {
            "barcode": "171129219",
            "dpc": "03032603601",
            "name": "អៀ ម៉េងលុច"
        },
        {
            "barcode": "171129220",
            "dpc": "03032635201",
            "name": "ហ៊ាង សុខគីម"
        },
        {
            "barcode": "171129221",
            "dpc": "03032626801",
            "name": "សាន ហូ"
        },
        {
            "barcode": "171129222",
            "dpc": "03032606001",
            "name": "ធនាគារវឌ្ឍនៈ"
        },
        {
            "barcode": "171129223",
            "dpc": "03032617501",
            "name": "ជុំ សុខែម"
        },
        {
            "barcode": "171129224",
            "dpc": "03032626901",
            "name": "វៀច សេង"
        },
        {
            "barcode": "171129225",
            "dpc": "03032641101",
            "name": "ម៉ុក សារុំ"
        },
        {
            "barcode": "171129226",
            "dpc": "03032614401",
            "name": "ឃួន ប៊ុនធី"
        },
        {
            "barcode": "171129227",
            "dpc": "03032604301",
            "name": "ជា ពៅ"
        },
        {
            "barcode": "171129228",
            "dpc": "03032634201",
            "name": "ថោង សាវឿន"
        },
        {
            "barcode": "171129229",
            "dpc": "03032615101",
            "name": "ធួន ពន្លឺ"
        },
        {
            "barcode": "171129230",
            "dpc": "03032615001",
            "name": "ញ៉ក់ ចំរ៉ុង"
        },
        {
            "barcode": "171129231",
            "dpc": "03032601801",
            "name": "សួន គឹមអេង"
        },
        {
            "barcode": "171129232",
            "dpc": "03032603701",
            "name": "គឹម ហន"
        },
        {
            "barcode": "171129233",
            "dpc": "03032635101",
            "name": "តាំង ចាន់ធី"
        },
        {
            "barcode": "171129234",
            "dpc": "03032601201",
            "name": "លឹម ស៊ីវហ្គិច"
        },
        {
            "barcode": "171129235",
            "dpc": "03032601301",
            "name": "ឈួន សុភាព"
        },
        {
            "barcode": "171129236",
            "dpc": "03032635001",
            "name": "ម៉ៅ ហ៊ួរ"
        },
        {
            "barcode": "171129237",
            "dpc": "03032625101",
            "name": "ធុច រ៉ា"
        },
        {
            "barcode": "171129238",
            "dpc": "03032629101",
            "name": "ណៃ ហុង"
        },
        {
            "barcode": "171129239",
            "dpc": "03032625301",
            "name": "ឈឿត ដានី"
        },
        {
            "barcode": "171129240",
            "dpc": "03032625001",
            "name": "រោ សេងវី"
        },
        {
            "barcode": "171129241",
            "dpc": "03032622901",
            "name": "ហ៊ុយ សុធារិទ្ធ"
        },
        {
            "barcode": "171129242",
            "dpc": "03032630701",
            "name": "ប៉ុក សុជាតិ"
        },
        {
            "barcode": "171129243",
            "dpc": "03032627301",
            "name": "ធនាគារជាតិកម្ពុជា"
        },
        {
            "barcode": "171129244",
            "dpc": "03032603401",
            "name": "ជា សុខ"
        },
        {
            "barcode": "171129245",
            "dpc": "03032638101",
            "name": "សាលា ២ធ្នូ"
        },
        {
            "barcode": "171129246",
            "dpc": "03032608701",
            "name": "យូ រ៉ាណេ"
        },
        {
            "barcode": "171129247",
            "dpc": "03032601501",
            "name": "ច្រឹក ណារ៉េត"
        },
        {
            "barcode": "171129248",
            "dpc": "03032600701",
            "name": "ឧប កែវផល្លី"
        },
        {
            "barcode": "171129249",
            "dpc": "03032640401",
            "name": "ឈុន ប៊ូ"
        },
        {
            "barcode": "171129250",
            "dpc": "03032602301",
            "name": "លីវ ប៊ុនឆេង"
        },
        {
            "barcode": "171129251",
            "dpc": "03032603501",
            "name": "ចាន់ ឃាង"
        },
        {
            "barcode": "171129252",
            "dpc": "03032604801",
            "name": "សែម នី"
        },
        {
            "barcode": "171129253",
            "dpc": "03032606101",
            "name": "ប៊ុន សារ៉ាវុធ"
        },
        {
            "barcode": "171129254",
            "dpc": "03032608101",
            "name": "ឈួរ មួយគាង"
        },
        {
            "barcode": "171129255",
            "dpc": "03032618001",
            "name": "ជេត សម្បត្តិ"
        },
        {
            "barcode": "171129256",
            "dpc": "03032624301",
            "name": "ជា សង្វាម៉ាលតី"
        },
        {
            "barcode": "171129257",
            "dpc": "03032624901",
            "name": "មៀច សុមន៍"
        },
        {
            "barcode": "171129258",
            "dpc": "03032626701",
            "name": "គូ គឹមស៊ា"
        },
        {
            "barcode": "171129259",
            "dpc": "03032627001",
            "name": "យ៉េត ហ៊ុន"
        },
        {
            "barcode": "171129260",
            "dpc": "03032627101",
            "name": "លី ចំរើន"
        },
        {
            "barcode": "171129261",
            "dpc": "03032631601",
            "name": "ពេជ្រ ផារី"
        },
        {
            "barcode": "171129262",
            "dpc": "03032631701",
            "name": "គុយ ផេង"
        },
        {
            "barcode": "171129263",
            "dpc": "03032634301",
            "name": "តាន់ មីសស្សែល ៣១"
        },
        {
            "barcode": "171129264",
            "dpc": "03032634901",
            "name": "ប៉ិល វណ្ណា"
        },
        {
            "barcode": "171129265",
            "dpc": "03032635401",
            "name": "សេង ប៉ោឡាយ"
        },
        {
            "barcode": "171129266",
            "dpc": "03032637901",
            "name": "ចាន់ ថន"
        },
        {
            "barcode": "171129267",
            "dpc": "03032640501",
            "name": "ឃួន ប៊ុនធី"
        },
        {
            "barcode": "171129268",
            "dpc": "03032640701",
            "name": "សាខាកាំកុងត្រូល"
        },
        {
            "barcode": "171129269",
            "dpc": "03032640901",
            "name": "ស៊ុំ យិធា"
        },
        {
            "barcode": "171129270",
            "dpc": "03032641001",
            "name": "ជូ គង់"
        },
        {
            "barcode": "171129271",
            "dpc": "03032642201",
            "name": "តាន់ មីសស្សែល ២១៨"
        },
        {
            "barcode": "171129272",
            "dpc": "03032642401",
            "name": "តាន់ មីសស្សែល ២១៤"
        },
        {
            "barcode": "171129273",
            "dpc": "03032642801",
            "name": "តាន់ មីសស្សែល ២០៦"
        },
        {
            "barcode": "171129274",
            "dpc": "03032643301",
            "name": "តាន់ មីសស្សែល ២១៣"
        },
        {
            "barcode": "171129275",
            "dpc": "03032644201",
            "name": "ចាន់ សុធានី"
        },
        {
            "barcode": "171129276",
            "dpc": "03032644301",
            "name": "លី គឹមឡាយ"
        },
        {
            "barcode": "171129277",
            "dpc": "03032644401",
            "name": "អ៊ាង ផល្លា"
        },
        {
            "barcode": "171129278",
            "dpc": "03032644601",
            "name": "ទី ទីត"
        },
        {
            "barcode": "171129279",
            "dpc": "03032644701",
            "name": "ហេង គឹមលី"
        },
        {
            "barcode": "171129280",
            "dpc": "03032644801",
            "name": "វ៉ាន់ នី"
        },
        {
            "barcode": "171129281",
            "dpc": "03032644901",
            "name": "អ៊ុន ណារ៉ុង"
        },
        {
            "barcode": "171129282",
            "dpc": "03032645001",
            "name": "អ៊ុំ ណារ៉ុង"
        },
        {
            "barcode": "171129283",
            "dpc": "03032645101",
            "name": "ជាង ហេង"
        },
        {
            "barcode": "171129284",
            "dpc": "03032645201",
            "name": "លឹម សេងហួរ"
        },
        {
            "barcode": "171129285",
            "dpc": "03032648001",
            "name": "ម៉ីចន្ទ័ មុន្នី"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
