let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171126922",
            "dpc": "03062800101",
            "name": "សាលាខេត្តទី ១"
        },
        {
            "barcode": "171126923",
            "dpc": "03062800201",
            "name": "សាលាខេត្តទី ២"
        },
        {
            "barcode": "171126924",
            "dpc": "03062800301",
            "name": "មន្ទីរមុខងារសារធារណះខេត្ត"
        },
        {
            "barcode": "171126925",
            "dpc": "03062800401",
            "name": "សាលាក្រុងបាត់ដំបង"
        },
        {
            "barcode": "171126926",
            "dpc": "03062800501",
            "name": "ព្រះរាជដំណាក់"
        },
        {
            "barcode": "171126927",
            "dpc": "03062800601",
            "name": "មន្ទីរទេសចរណ៍ខេត្ត"
        },
        {
            "barcode": "171126928",
            "dpc": "03062800701",
            "name": "សាលាដំបូងខេត្តបាត់ដំបង"
        },
        {
            "barcode": "171126929",
            "dpc": "03062800801",
            "name": "មន្ទីរសាធារណៈការ និង ដឹកជញ្ជូន"
        },
        {
            "barcode": "171126930",
            "dpc": "03062800901",
            "name": "ម.សាធារណការ(ចំណតគ្រឿងចក្រ)"
        },
        {
            "barcode": "171126931",
            "dpc": "03062801001",
            "name": "មន្ទីរប្រៃណីយ៍និងទូរគមនាគមន៍"
        },
        {
            "barcode": "171126932",
            "dpc": "03062801101",
            "name": "មន្ទីរ កសិកម្មខេត្ត"
        },
        {
            "barcode": "171126933",
            "dpc": "03062801201",
            "name": "ម.សង្គមកិច្ចយុទ្ធជននិងយុវនីតិសម្បទា"
        },
        {
            "barcode": "171126934",
            "dpc": "03062801301",
            "name": "ម.ស្តារលទ្ធភាពពលកម្មកាយសម្បទា"
        },
        {
            "barcode": "171126935",
            "dpc": "03062801401",
            "name": "ម.ស្តារលទ្ធភាពពលកម្មរបួសខួរឆ្អឹងខ្នង"
        },
        {
            "barcode": "171126936",
            "dpc": "03062801601",
            "name": "មន្ទីរ បរិស្ថានខេត្ត"
        },
        {
            "barcode": "171126937",
            "dpc": "03062801701",
            "name": "មន្ទីរ  ពាណិជ្ជកម្ម"
        },
        {
            "barcode": "171126938",
            "dpc": "03062801801",
            "name": "មន្ទីរ  ពត៌មានខេត្ត"
        },
        {
            "barcode": "171126939",
            "dpc": "03062801901",
            "name": "ទូទស្សន៍ជាតិ"
        },
        {
            "barcode": "171126940",
            "dpc": "03062802001",
            "name": "មន្ទីរវប្បធម៌និងសីល្បៈ១(ពិពណ៏)"
        },
        {
            "barcode": "171126941",
            "dpc": "03062802101",
            "name": "មន្ទីរវប្បធម៌និងសីល្បៈ២បណ្ណាល័យ"
        },
        {
            "barcode": "171126942",
            "dpc": "03062802201",
            "name": "មន្ទីរវប្បធម៌និងសីល្បៈ៣"
        },
        {
            "barcode": "171126943",
            "dpc": "03062802301",
            "name": "មន្ទីរអភិវឌ្ឍន៍ជនបទ"
        },
        {
            "barcode": "171126944",
            "dpc": "03062802401",
            "name": "មន្ទីរ សុរិយោដីខេត្ត"
        },
        {
            "barcode": "171126945",
            "dpc": "03062802501",
            "name": "មន្ទីរ អប់រំយុវជន និង កីឡាខេត្ត"
        },
        {
            "barcode": "171126946",
            "dpc": "03062802601",
            "name": "ការិយាល័យអប់រំស្រុក បាត់ដំបង"
        },
        {
            "barcode": "171126947",
            "dpc": "03062802701",
            "name": "មណ្ឌលគរុកោសល្យភូមិភាគ១"
        },
        {
            "barcode": "171126948",
            "dpc": "03062802801",
            "name": "មណ្ឌលគរុកោសល្យភូមិភាគ២"
        },
        {
            "barcode": "171126949",
            "dpc": "03062802901",
            "name": "មណ្ឌលគរុកោសល្យភូមិភាគ៣"
        },
        {
            "barcode": "171126950",
            "dpc": "03062803001",
            "name": "សាលាគរុកោសល្យ"
        },
        {
            "barcode": "171126951",
            "dpc": "03062803101",
            "name": "សាលាកុមារពិការភ្នែកនិងកុមារគថ្លង់"
        },
        {
            "barcode": "171126952",
            "dpc": "03062803201",
            "name": "មន្ទីរ ធម្មការ និង សាសនាខេត្ត"
        },
        {
            "barcode": "171126953",
            "dpc": "03062803301",
            "name": "មន្ទីរសេដ្ឋកិច្ច និង ហិរញ្ញវត្ថុខេត្ត"
        },
        {
            "barcode": "171126954",
            "dpc": "03062803401",
            "name": "មន្ទីរពេទ្យ ធំខេត្ត"
        },
        {
            "barcode": "171126955",
            "dpc": "03062803501",
            "name": "មន្ទីរ សុខាភិបាលខត្ត"
        },
        {
            "barcode": "171126956",
            "dpc": "03062803601",
            "name": "ស្ថានីយ៍អនាម័យខេត្ត"
        },
        {
            "barcode": "171126957",
            "dpc": "03062803701",
            "name": "មណ្ឌលសុខភាព អូរចារ"
        },
        {
            "barcode": "171126958",
            "dpc": "03062803801",
            "name": "សាលាសិក្សាសុខាភិបាលភូមិភាគ"
        },
        {
            "barcode": "171126959",
            "dpc": "03062803901",
            "name": "មន្ទីរបណ្តុៈបណ្តាលវិជ្ចាជីវៈ១"
        },
        {
            "barcode": "171126960",
            "dpc": "03062804001",
            "name": "មន្ទីរបណ្តុៈបណ្តាលវិជ្ចាជីវៈ២"
        },
        {
            "barcode": "171126961",
            "dpc": "03062804101",
            "name": "អគារស្នងការដ្ឋាននគរបាលទី១"
        },
        {
            "barcode": "171126962",
            "dpc": "03062804201",
            "name": "អគារស្នងការដ្ឋាននគរបាលទី២"
        },
        {
            "barcode": "171126963",
            "dpc": "03062804301",
            "name": "ការិយាល័យការពារនិងអន្តរាគមន៍ទី២"
        },
        {
            "barcode": "171126964",
            "dpc": "03062804401",
            "name": "ធនធានទឹកនិងឧតុនិយម"
        },
        {
            "barcode": "171126965",
            "dpc": "03062804501",
            "name": "រតនាគារខេត្តបាត់ដំបង"
        },
        {
            "barcode": "171126966",
            "dpc": "03062804601",
            "name": "សាកលវិទ្យាល័យបាត់ដំបង"
        },
        {
            "barcode": "171126967",
            "dpc": "03062804701",
            "name": "សាកលវិទ្យាល័យបាត់ដំបង ទី ២"
        },
        {
            "barcode": "171126968",
            "dpc": "03062804801",
            "name": "អន្តេវាសិកដ្ឋាន សាកលវិទ្យាល័យ"
        },
        {
            "barcode": "171126969",
            "dpc": "03062804901",
            "name": "ពន្ធនាគារ ខេត្តបាត់ដំបង"
        },
        {
            "barcode": "171126970",
            "dpc": "03062805001",
            "name": "មន្ទីរផែនការខេត្ត"
        },
        {
            "barcode": "171126971",
            "dpc": "03062805101",
            "name": "ភូមិភាគ ៥"
        },
        {
            "barcode": "171126972",
            "dpc": "03062805201",
            "name": "តំណាងរាស្ត្រ"
        },
        {
            "barcode": "171126973",
            "dpc": "03062805301",
            "name": "សាលាស្រុកសង្កែ"
        },
        {
            "barcode": "171126974",
            "dpc": "03062805401",
            "name": "មន្ទីរកិច្ចការនារីខេត្ត"
        },
        {
            "barcode": "171126975",
            "dpc": "03062805501",
            "name": "បញ្ជាការដ្ឋានកងរាជអាវុធហត្ថខេត្ត១"
        },
        {
            "barcode": "171126976",
            "dpc": "03062805601",
            "name": "ខណ្ឌរដ្ឋបាលជលផល"
        },
        {
            "barcode": "171126977",
            "dpc": "03062805701",
            "name": "ទំនាក់ទំនងរដ្ឋសភាព្រឹទ្ធសភា"
        },
        {
            "barcode": "171126978",
            "dpc": "03062805901",
            "name": "កុមារកំព្រា (ផ្លូវពោធិវង្ស)"
        },
        {
            "barcode": "171126979",
            "dpc": "03062806001",
            "name": "បុរីកុមារកំព្រាបាត់ដំបង"
        },
        {
            "barcode": "171126980",
            "dpc": "03062806101",
            "name": "មន្ទីរពេទ្យយោធភូមិភាគទី៥"
        },
        {
            "barcode": "171126981",
            "dpc": "03062806201",
            "name": "ខណ្ឌរដ្ឋបាលព្រៃឈើ"
        },
        {
            "barcode": "171126982",
            "dpc": "03062806301",
            "name": "អាគាររដ្ឋបាលពុទ្ធិកវិទ្យាល័យអ៊ឹងធួង"
        },
        {
            "barcode": "171126983",
            "dpc": "03062806401",
            "name": "សួនក្មេងនោម"
        },
        {
            "barcode": "171126984",
            "dpc": "03062806501",
            "name": "សួនផ្លូវលេខ៣"
        },
        {
            "barcode": "171126985",
            "dpc": "03062806601",
            "name": "សួននាគរាជបាញ់ទឹក"
        },
        {
            "barcode": "171126986",
            "dpc": "03062806701",
            "name": "សួនសាធារណះទី១"
        },
        {
            "barcode": "171126987",
            "dpc": "03062806801",
            "name": "សួនសាធារណៈមុខគណៈបក្ស"
        },
        {
            "barcode": "171126988",
            "dpc": "03062806901",
            "name": "សួនសាធារណះ"
        },
        {
            "barcode": "171126989",
            "dpc": "03062807201",
            "name": "សួនព្រែកមហាទេព"
        },
        {
            "barcode": "171126990",
            "dpc": "03062807301",
            "name": "សួនព្រែកមហាទេព ទី២"
        },
        {
            "barcode": "171126991",
            "dpc": "03062807401",
            "name": "សួនស្ទឹងខៀវ"
        },
        {
            "barcode": "171126992",
            "dpc": "03062807501",
            "name": "សួន នាគព័ន្ធ"
        },
        {
            "barcode": "171126993",
            "dpc": "03062807901",
            "name": "សួន មុខវត្តពោធិក្នុង"
        },
        {
            "barcode": "171126994",
            "dpc": "03062808101",
            "name": "សួនផ្លូវភ្លោះទី២ កោះសន្តិភាព"
        }
    ]
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
