let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171124742",
            "dpc": "03042927401",
            "name": "ហេង ធិ"
        },
        {
            "barcode": "171124743",
            "dpc": "03042927301",
            "name": "សោម អូន"
        },
        {
            "barcode": "171124744",
            "dpc": "03042927201",
            "name": "ជិន លន់"
        },
        {
            "barcode": "171124745",
            "dpc": "03042904201",
            "name": "នាម សុភា"
        },
        {
            "barcode": "171124746",
            "dpc": "03042917201",
            "name": "រួម ស៊ីនាថ"
        },
        {
            "barcode": "171124747",
            "dpc": "03042923401",
            "name": "ទេព រ៉ានី"
        },
        {
            "barcode": "171124748",
            "dpc": "03042935201",
            "name": "ធួង ងន់សេង"
        },
        {
            "barcode": "171124749",
            "dpc": "03042926701",
            "name": "យិន ឡាង"
        },
        {
            "barcode": "171124750",
            "dpc": "03042919401",
            "name": "ឡាច វិត"
        },
        {
            "barcode": "171124751",
            "dpc": "03042919501",
            "name": "ហុង ភាព"
        },
        {
            "barcode": "171124752",
            "dpc": "03042919701",
            "name": "សំ សារឿត"
        },
        {
            "barcode": "171124753",
            "dpc": "03042919801",
            "name": "ហង្ស រី"
        },
        {
            "barcode": "171124754",
            "dpc": "03042927501",
            "name": "ទៀប ចាន់ធឿន"
        },
        {
            "barcode": "171124755",
            "dpc": "03042935001",
            "name": "គីម លី"
        },
        {
            "barcode": "171124756",
            "dpc": "03042909201",
            "name": "លី ហួរ"
        },
        {
            "barcode": "171124757",
            "dpc": "03042933801",
            "name": "ឡិប ទ៉នី"
        },
        {
            "barcode": "171124758",
            "dpc": "03042920201",
            "name": "កៅ វុទ្ធិ"
        },
        {
            "barcode": "171124759",
            "dpc": "03042920401",
            "name": "កែវ បញ្ញា"
        },
        {
            "barcode": "171124760",
            "dpc": "03042920501",
            "name": "សុខ វាសនា"
        },
        {
            "barcode": "171124761",
            "dpc": "03042920601",
            "name": "ហុក លីហេង"
        },
        {
            "barcode": "171124762",
            "dpc": "03042920701",
            "name": "យ៉ុន សម្ភស្ស"
        },
        {
            "barcode": "171124763",
            "dpc": "03042908701",
            "name": "អ៊ុក មៃ"
        },
        {
            "barcode": "171124764",
            "dpc": "03042931501",
            "name": "ជា ដានី"
        },
        {
            "barcode": "171124765",
            "dpc": "03042909001",
            "name": "ហេង យី"
        },
        {
            "barcode": "171124766",
            "dpc": "03042931601",
            "name": "ឡាប ប៉េងគី"
        },
        {
            "barcode": "171124767",
            "dpc": "03042905401",
            "name": "គឹម យ៉ាន"
        },
        {
            "barcode": "171124768",
            "dpc": "03042901701",
            "name": "ឆុំ ស្លីម៉ាត់"
        },
        {
            "barcode": "171124769",
            "dpc": "03042912901",
            "name": "ពៅ ចាន់ថា"
        },
        {
            "barcode": "171124770",
            "dpc": "03042914601",
            "name": "ឈឺន សំណាង"
        },
        {
            "barcode": "171124771",
            "dpc": "03042914501",
            "name": "វាំង បាន"
        },
        {
            "barcode": "171124772",
            "dpc": "03042929201",
            "name": "សាយ សាវី"
        },
        {
            "barcode": "171124773",
            "dpc": "03042914401",
            "name": "ដាំ ម៉េង"
        },
        {
            "barcode": "171124774",
            "dpc": "03042909501",
            "name": "សេង ឡុង"
        },
        {
            "barcode": "171124775",
            "dpc": "03042910801",
            "name": "ហុក រតនា"
        },
        {
            "barcode": "171124776",
            "dpc": "03042910901",
            "name": "ជុំ សអ៊ុន"
        },
        {
            "barcode": "171124777",
            "dpc": "03042909701",
            "name": "វឿន ដាវី"
        },
        {
            "barcode": "171124778",
            "dpc": "03042909801",
            "name": "វិញ សាវឿន"
        },
        {
            "barcode": "171124779",
            "dpc": "03042902901",
            "name": "តែ ប៊ុនលី"
        },
        {
            "barcode": "171124780",
            "dpc": "03042911501",
            "name": "រេន សុខារ៉ា"
        },
        {
            "barcode": "171124781",
            "dpc": "03042900401",
            "name": "វិន វន"
        },
        {
            "barcode": "171124782",
            "dpc": "03042911101",
            "name": "ធី សោភា"
        },
        {
            "barcode": "171124783",
            "dpc": "03042910601",
            "name": "ជា វិចិត្រ"
        },
        {
            "barcode": "171124784",
            "dpc": "03042908401",
            "name": "ហៀក សុភ័ក្រ"
        },
        {
            "barcode": "171124785",
            "dpc": "03042916201",
            "name": "ឈៀង សុផាន់ដា"
        },
        {
            "barcode": "171124786",
            "dpc": "03042919901",
            "name": "ហ៊ាង រស្មី"
        },
        {
            "barcode": "171124787",
            "dpc": "03042917701",
            "name": "ឈិត អារុណ"
        },
        {
            "barcode": "171124788",
            "dpc": "03042931701",
            "name": "រ៉ន កណ្ណិកា"
        },
        {
            "barcode": "171124789",
            "dpc": "03042924301",
            "name": "ព្រាប យឿម"
        },
        {
            "barcode": "171124790",
            "dpc": "03042934201",
            "name": "សោម កុសល"
        },
        {
            "barcode": "171124791",
            "dpc": "03042909401",
            "name": "ខែម សឿន"
        },
        {
            "barcode": "171124792",
            "dpc": "03042936801",
            "name": "ទេព ភារម"
        },
        {
            "barcode": "171124793",
            "dpc": "03042931801",
            "name": "ចាន់ តេងសូនី"
        },
        {
            "barcode": "171124794",
            "dpc": "03042903501",
            "name": "លឹម គឹមជា"
        },
        {
            "barcode": "171124795",
            "dpc": "03042903601",
            "name": "ឌឿន ឆន"
        },
        {
            "barcode": "171124796",
            "dpc": "03042925901",
            "name": "ចាន់ សារិទ្ធិ"
        },
        {
            "barcode": "171124797",
            "dpc": "03042917001",
            "name": "ខែម សារិទ្ធី"
        },
        {
            "barcode": "171124798",
            "dpc": "03042909301",
            "name": "ង៉ែត គឹមឈឿន"
        },
        {
            "barcode": "171124799",
            "dpc": "03042927701",
            "name": "សំ សឿន"
        },
        {
            "barcode": "171124800",
            "dpc": "03042914701",
            "name": "ជួន សំណាង"
        },
        {
            "barcode": "171124801",
            "dpc": "03042921601",
            "name": "ធិម ម៉ារដ្ឋ"
        },
        {
            "barcode": "171124802",
            "dpc": "03042921701",
            "name": "លី សារឿន"
        },
        {
            "barcode": "171124803",
            "dpc": "03042900101",
            "name": "នួច ផុន"
        },
        {
            "barcode": "171124804",
            "dpc": "03042904501",
            "name": "សាលា CUS"
        },
        {
            "barcode": "171124805",
            "dpc": "03042901401",
            "name": "សាន់ ស៊ីនឿន"
        },
        {
            "barcode": "171124806",
            "dpc": "03042913101",
            "name": "ហុង សុខហេង"
        },
        {
            "barcode": "171124807",
            "dpc": "03042913201",
            "name": "ហុង សុខសិរី"
        },
        {
            "barcode": "171124808",
            "dpc": "03042917801",
            "name": "មុត សំ"
        },
        {
            "barcode": "171124809",
            "dpc": "03042913301",
            "name": "ទូច យ៉ាសិទ្ធិ"
        },
        {
            "barcode": "171124810",
            "dpc": "03042911201",
            "name": "គាំ សំអាត"
        },
        {
            "barcode": "171124811",
            "dpc": "03042909901",
            "name": "វង្ស សារិទ្ធភក្ដី"
        },
        {
            "barcode": "171124812",
            "dpc": "03042913001",
            "name": "ប៉ុច ជំនឿន"
        },
        {
            "barcode": "171124813",
            "dpc": "03042903001",
            "name": "លឹម ផល្គុន"
        },
        {
            "barcode": "171124814",
            "dpc": "03042919301",
            "name": "ង៉ែត មុំ"
        },
        {
            "barcode": "171124815",
            "dpc": "03042928001",
            "name": "បនា សុខា"
        },
        {
            "barcode": "171124816",
            "dpc": "03042908301",
            "name": "អុល ថូ"
        },
        {
            "barcode": "171124817",
            "dpc": "03042913401",
            "name": "ញ៉ែម រតនា"
        },
        {
            "barcode": "171124818",
            "dpc": "03042935101",
            "name": "ភិន ធឿន"
        },
        {
            "barcode": "171124819",
            "dpc": "03042902101",
            "name": "លាន ឡាត់"
        },
        {
            "barcode": "171124820",
            "dpc": "03042928401",
            "name": "សន សុខនិ"
        },
        {
            "barcode": "171124821",
            "dpc": "03042936301",
            "name": "អ៊ុត ស៊ីណាត១"
        },
        {
            "barcode": "171124822",
            "dpc": "03042936601",
            "name": "ឌុច រតនា"
        },
        {
            "barcode": "171124823",
            "dpc": "03042936701",
            "name": "គុយ សុងលាង"
        },
        {
            "barcode": "171124824",
            "dpc": "03042904401",
            "name": "វិទ្យាល័យសម្តេចឪ"
        },
        {
            "barcode": "171124825",
            "dpc": "03042901501",
            "name": "សាំង ប៊ុនម៉ៅ"
        },
        {
            "barcode": "171124826",
            "dpc": "03042901601",
            "name": "ជា សុផល់"
        },
        {
            "barcode": "171124827",
            "dpc": "03042923501",
            "name": "សុខ មុំ"
        },
        {
            "barcode": "171124828",
            "dpc": "03042936001",
            "name": "ធិន នរសីហា"
        },
        {
            "barcode": "171124829",
            "dpc": "03042907501",
            "name": "ភឿក ឡុងឌី"
        },
        {
            "barcode": "171124830",
            "dpc": "03042907601",
            "name": "កឹម ភឹម"
        },
        {
            "barcode": "171124831",
            "dpc": "03042901801",
            "name": "ឈួ ឡៃហ៊ាង"
        },
        {
            "barcode": "171124832",
            "dpc": "03042901201",
            "name": "ឡេង ស៊ីណា"
        },
        {
            "barcode": "171124833",
            "dpc": "03042932101",
            "name": "ហែម សុធា"
        },
        {
            "barcode": "171124834",
            "dpc": "03042935801",
            "name": "តែ ស៊ីណូ"
        },
        {
            "barcode": "171124835",
            "dpc": "03042933501",
            "name": "គឹម ទៀង"
        },
        {
            "barcode": "171124836",
            "dpc": "03042911601",
            "name": "រិទ្ធ ដាណេ"
        },
        {
            "barcode": "171124837",
            "dpc": "03042910001",
            "name": "តាំង ហ៊ីង"
        },
        {
            "barcode": "171124838",
            "dpc": "03042930301",
            "name": "ឃួន នឿន៣"
        },
        {
            "barcode": "171124839",
            "dpc": "03042926901",
            "name": "អ៊ុត ក្លឹង ៣"
        },
        {
            "barcode": "171124840",
            "dpc": "03042913501",
            "name": "ស៊ា រឿត"
        },
        {
            "barcode": "171124841",
            "dpc": "03042916601",
            "name": "សយ តឹង"
        },
        {
            "barcode": "171124842",
            "dpc": "03042916701",
            "name": "យិន វន"
        },
        {
            "barcode": "171124843",
            "dpc": "03042916801",
            "name": "ថយ សុភា"
        },
        {
            "barcode": "171124844",
            "dpc": "03042926001",
            "name": "ជា ពិសី"
        },
        {
            "barcode": "171124845",
            "dpc": "03042926101",
            "name": "ថៃ សាម៉ុន"
        },
        {
            "barcode": "171124846",
            "dpc": "03042930401",
            "name": "សូន្យ ណាវុធ"
        },
        {
            "barcode": "171124847",
            "dpc": "03042930601",
            "name": "នីវ ថាន"
        },
        {
            "barcode": "171124848",
            "dpc": "03042930701",
            "name": "ផុន សារ៉ុម"
        },
        {
            "barcode": "171124849",
            "dpc": "03042930501",
            "name": "មឿង មឿន"
        },
        {
            "barcode": "171124850",
            "dpc": "03042930801",
            "name": "សូ ស៊ីម"
        },
        {
            "barcode": "171124851",
            "dpc": "03042930901",
            "name": "អុំ ភីនីសារ៉ា"
        },
        {
            "barcode": "171124852",
            "dpc": "03042931101",
            "name": "វ៉ាន់ ច័ន្ទ"
        },
        {
            "barcode": "171124853",
            "dpc": "03042933301",
            "name": "អួន ណែម"
        },
        {
            "barcode": "171124854",
            "dpc": "03042902201",
            "name": "លីន វណ្ណា"
        },
        {
            "barcode": "171124855",
            "dpc": "03042916001",
            "name": "លិន សុខា"
        },
        {
            "barcode": "171124856",
            "dpc": "03042915901",
            "name": "ម៉ៅ សុជាតិ"
        },
        {
            "barcode": "171124857",
            "dpc": "03042915801",
            "name": "ឃុន ងួនហុង"
        },
        {
            "barcode": "171124858",
            "dpc": "03042934601",
            "name": "យី គក់"
        },
        {
            "barcode": "171124859",
            "dpc": "03042934501",
            "name": "ហុក សំសិទ្ធិ"
        },
        {
            "barcode": "171124860",
            "dpc": "03042923201",
            "name": "ឈឹម សារឿន"
        },
        {
            "barcode": "171124861",
            "dpc": "03042937901",
            "name": "ឃឹម គឹម"
        },
        {
            "barcode": "171124862",
            "dpc": "03042937801",
            "name": "បេង ប៊ុនអាត"
        },
        {
            "barcode": "171124863",
            "dpc": "03042937701",
            "name": "ស៊ុំ ចំរើន"
        },
        {
            "barcode": "171124864",
            "dpc": "03042937601",
            "name": "សំ សុធា"
        },
        {
            "barcode": "171124865",
            "dpc": "03042937201",
            "name": "ប្រោញ វុទ្ធី"
        },
        {
            "barcode": "171124866",
            "dpc": "03042937301",
            "name": "ឌួង អ៊ុត"
        },
        {
            "barcode": "171124867",
            "dpc": "03042937401",
            "name": "អឿន វុទ្ធី"
        },
        {
            "barcode": "171124868",
            "dpc": "03042937501",
            "name": "ស៊ុយ គឹមសឿន"
        },
        {
            "barcode": "171124869",
            "dpc": "03042937101",
            "name": "លួន ភាព"
        },
        {
            "barcode": "171124870",
            "dpc": "03042908501",
            "name": "ឆេង គឹមអាន"
        },
        {
            "barcode": "171124871",
            "dpc": "03042933401",
            "name": "ផាត់ ផារើយ"
        },
        {
            "barcode": "171124872",
            "dpc": "03042916101",
            "name": "យ៉ន ទីណា"
        },
        {
            "barcode": "171124873",
            "dpc": "03042913801",
            "name": "ឈួ គី"
        },
        {
            "barcode": "171124874",
            "dpc": "03042928201",
            "name": "ហ៊ន សារ៉ាត់"
        },
        {
            "barcode": "171124875",
            "dpc": "03042928101",
            "name": "យ៉ត យឿត"
        },
        {
            "barcode": "171124876",
            "dpc": "03042902401",
            "name": "វ៉ន ពៅ"
        },
        {
            "barcode": "171124877",
            "dpc": "03042911301",
            "name": "ឡុច វណ្ណផា"
        },
        {
            "barcode": "171124878",
            "dpc": "03042913601",
            "name": "ឡាច បូរ៉ា"
        },
        {
            "barcode": "171124879",
            "dpc": "03042926401",
            "name": "ង៉ែត មាន"
        },
        {
            "barcode": "171124880",
            "dpc": "03042906101",
            "name": "ជួង សុថា"
        },
        {
            "barcode": "171124881",
            "dpc": "03042902301",
            "name": "ប៉ិច សារ៉ែម"
        },
        {
            "barcode": "171124882",
            "dpc": "03042912301",
            "name": "មាន សុខរ៉ា"
        },
        {
            "barcode": "171124883",
            "dpc": "03042900701",
            "name": "ទួត ដារិទ្ធ"
        },
        {
            "barcode": "171124884",
            "dpc": "03042922201",
            "name": "សន ណាវី"
        },
        {
            "barcode": "171124885",
            "dpc": "03042922101",
            "name": "ឆាន់ វាសនា"
        },
        {
            "barcode": "171124886",
            "dpc": "03042922001",
            "name": "ធូក វុទ្ធី"
        },
        {
            "barcode": "171124887",
            "dpc": "03042933201",
            "name": "ព្រិស គឹមស៊ួ"
        },
        {
            "barcode": "171124888",
            "dpc": "03042900201",
            "name": "ឈួយ វិចិត្រ"
        },
        {
            "barcode": "171124889",
            "dpc": "03042901101",
            "name": "ស៊ិប សូលី"
        },
        {
            "barcode": "171124890",
            "dpc": "03042910201",
            "name": "សេង សុវុធដារ៉ា"
        },
        {
            "barcode": "171124891",
            "dpc": "03042922401",
            "name": "វ៉ាន់ វឌ្ឍនា"
        },
        {
            "barcode": "171124892",
            "dpc": "03042912001",
            "name": "គង់ រិន"
        },
        {
            "barcode": "171124893",
            "dpc": "03042922501",
            "name": "អាត វាសនា"
        },
        {
            "barcode": "171124894",
            "dpc": "03042929001",
            "name": "ឈួន ដាវី"
        },
        {
            "barcode": "171124895",
            "dpc": "03042914001",
            "name": "អ៊ុក វឌ្ឍរ័ត្ន"
        },
        {
            "barcode": "171124896",
            "dpc": "03042934401",
            "name": "ជា វណ្ណៈ"
        },
        {
            "barcode": "171124897",
            "dpc": "03042904901",
            "name": "មន្ទីរស្រាវជ្រាវ"
        },
        {
            "barcode": "171124898",
            "dpc": "03042905101",
            "name": "ប៉ិន វណ្ណៈ"
        },
        {
            "barcode": "171124899",
            "dpc": "03042922601",
            "name": "ប៊ី សុភ័ក្រ"
        },
        {
            "barcode": "171124900",
            "dpc": "03042902001",
            "name": "ឡុង ស៊ីណាត"
        },
        {
            "barcode": "171124901",
            "dpc": "03042923001",
            "name": "ប៉ែន ចិន្តា"
        },
        {
            "barcode": "171124902",
            "dpc": "03042905201",
            "name": "ចាន់ សំបូរ"
        },
        {
            "barcode": "171124903",
            "dpc": "03042922901",
            "name": "យូ ភីរុន"
        },
        {
            "barcode": "171124904",
            "dpc": "03042922801",
            "name": "ហេង ម៉េងហួត"
        },
        {
            "barcode": "171124905",
            "dpc": "03042916301",
            "name": "ឌិន សឿង"
        },
        {
            "barcode": "171124906",
            "dpc": "03042904001",
            "name": "ទង ស្រី"
        },
        {
            "barcode": "171124907",
            "dpc": "03042904701",
            "name": "ភោគ សុជាតិ"
        },
        {
            "barcode": "171124908",
            "dpc": "03042903901",
            "name": "មៀន ឈឿន"
        },
        {
            "barcode": "171124909",
            "dpc": "03042926501",
            "name": "គិន ស៊ុន"
        },
        {
            "barcode": "171124910",
            "dpc": "03042900601",
            "name": "សឿ សំអុល"
        },
        {
            "barcode": "171124911",
            "dpc": "03042906401",
            "name": "ភោគ សុជាតិ"
        },
        {
            "barcode": "171124912",
            "dpc": "03042906501",
            "name": "រស់ សុភាព"
        },
        {
            "barcode": "171124913",
            "dpc": "03042929101",
            "name": "ឈឿង វុទ្ធី"
        },
        {
            "barcode": "171124914",
            "dpc": "03042901001",
            "name": "សុខ ស៊ីថា"
        },
        {
            "barcode": "171124915",
            "dpc": "03042931001",
            "name": "ស៊ីង សាន"
        },
        {
            "barcode": "171124916",
            "dpc": "03042900301",
            "name": "នូ សុរិយា"
        },
        {
            "barcode": "171124917",
            "dpc": "03042900501",
            "name": "យស់ ម៉ារ៉ា"
        },
        {
            "barcode": "171124918",
            "dpc": "03042901901",
            "name": "ឡឹក រ៉ៃយ៉ា"
        },
        {
            "barcode": "171124919",
            "dpc": "03042902501",
            "name": "ឈឿត ដានី"
        },
        {
            "barcode": "171124920",
            "dpc": "03042902601",
            "name": "លេខ ពៅ"
        },
        {
            "barcode": "171124921",
            "dpc": "03042902701",
            "name": "ស៊ុន សំណាង"
        },
        {
            "barcode": "171124922",
            "dpc": "03042903101",
            "name": "ពេជ្រ សុផេង"
        },
        {
            "barcode": "171124923",
            "dpc": "03042903201",
            "name": "លីម ប៊ុនណា"
        },
        {
            "barcode": "171124924",
            "dpc": "03042903301",
            "name": "គួយ សុខជា"
        },
        {
            "barcode": "171124925",
            "dpc": "03042903401",
            "name": "សុខ ជីវី"
        },
        {
            "barcode": "171124926",
            "dpc": "03042903701",
            "name": "មឹង មុនីរម្យ"
        },
        {
            "barcode": "171124927",
            "dpc": "03042904801",
            "name": "យិន ម៉ៅ"
        },
        {
            "barcode": "171124928",
            "dpc": "03042905001",
            "name": "ហូវ សុមុនី"
        },
        {
            "barcode": "171124929",
            "dpc": "03042905301",
            "name": "ហួយ ចន្ធី"
        },
        {
            "barcode": "171124930",
            "dpc": "03042905501",
            "name": "កែវ ចន្ថា ២"
        },
        {
            "barcode": "171124931",
            "dpc": "03042905601",
            "name": "វ៉ែន ទូច"
        },
        {
            "barcode": "171124932",
            "dpc": "03042905701",
            "name": "អែតហ្វូត ២៥"
        },
        {
            "barcode": "171124933",
            "dpc": "03042905801",
            "name": "ប៉ែន អូន"
        },
        {
            "barcode": "171124934",
            "dpc": "03042905901",
            "name": "ផាវ ផល"
        },
        {
            "barcode": "171124935",
            "dpc": "03042906201",
            "name": "សាំង វាសនា"
        },
        {
            "barcode": "171124936",
            "dpc": "03042906301",
            "name": "ជឹម ចាន់ថន"
        },
        {
            "barcode": "171124937",
            "dpc": "03042906601",
            "name": "សាន"
        },
        {
            "barcode": "171124938",
            "dpc": "03042906701",
            "name": "ហ្គេច ម៉េងសូរី"
        },
        {
            "barcode": "171124939",
            "dpc": "03042906801",
            "name": "សុខុម សុខាលីន"
        },
        {
            "barcode": "171124940",
            "dpc": "03042906901",
            "name": "ឃុន ហ៊ីម"
        },
        {
            "barcode": "171124941",
            "dpc": "03042907001",
            "name": "សុង ណាំង"
        },
        {
            "barcode": "171124942",
            "dpc": "03042907101",
            "name": "ទូច ប៊ុនថេន"
        },
        {
            "barcode": "171124943",
            "dpc": "03042907201",
            "name": "ថន ថុលសុវណ្ណវិបុល"
        },
        {
            "barcode": "171124944",
            "dpc": "03042907401",
            "name": "សំណាង សីម៉ា"
        },
        {
            "barcode": "171124945",
            "dpc": "03042907701",
            "name": "កៅ អ៊ាងឡាយ ២"
        },
        {
            "barcode": "171124946",
            "dpc": "03042907801",
            "name": "បុន៊ សុខាណា"
        },
        {
            "barcode": "171124947",
            "dpc": "03042907901",
            "name": "ប៊ុន រដ្ឋា"
        },
        {
            "barcode": "171124948",
            "dpc": "03042908001",
            "name": "ប៊ុន វុទ្ធី"
        },
        {
            "barcode": "171124949",
            "dpc": "03042908101",
            "name": "សាំង សុធារស"
        },
        {
            "barcode": "171124950",
            "dpc": "03042908201",
            "name": "ឆៃ សុខុម"
        },
        {
            "barcode": "171124951",
            "dpc": "03042908601",
            "name": "ហ៊ុយ បៀន"
        },
        {
            "barcode": "171124952",
            "dpc": "03042908801",
            "name": "ឆឹង នី"
        },
        {
            "barcode": "171124953",
            "dpc": "03042908901",
            "name": "ឡេង ស៊ីណា ៤"
        },
        {
            "barcode": "171124954",
            "dpc": "03042909101",
            "name": "ហេង ផល្លី"
        },
        {
            "barcode": "171124955",
            "dpc": "03042909601",
            "name": "អ៊ុង ហេម"
        },
        {
            "barcode": "171124956",
            "dpc": "03042910101",
            "name": "សិបុ លឿត"
        },
        {
            "barcode": "171124957",
            "dpc": "03042910301",
            "name": "គុយ ប៉េងស៊្រាង"
        },
        {
            "barcode": "171124958",
            "dpc": "03042910401",
            "name": "ឈុន ថា"
        },
        {
            "barcode": "171124959",
            "dpc": "03042910501",
            "name": "ស៊ុន ហុង"
        },
        {
            "barcode": "171124960",
            "dpc": "03042910701",
            "name": "កុយ ស៊ីដេត"
        },
        {
            "barcode": "171124961",
            "dpc": "03042911001",
            "name": "ឯក សំយុទ្ធ"
        },
        {
            "barcode": "171124962",
            "dpc": "03042911401",
            "name": "នេត ស៊ីថន"
        },
        {
            "barcode": "171124963",
            "dpc": "03042911701",
            "name": "ហួរ ឆុង"
        },
        {
            "barcode": "171124964",
            "dpc": "03042911801",
            "name": "យុត តុងហាន់"
        },
        {
            "barcode": "171124965",
            "dpc": "03042911901",
            "name": "ឡៃ ចិន"
        },
        {
            "barcode": "171124966",
            "dpc": "03042912201",
            "name": "ឈុន បូទំ"
        },
        {
            "barcode": "171124967",
            "dpc": "03042912501",
            "name": "ជៀម សុខា"
        },
        {
            "barcode": "171124968",
            "dpc": "03042912601",
            "name": "តាំង ឡាយ"
        },
        {
            "barcode": "171124969",
            "dpc": "03042912701",
            "name": "អ៊ីវ ថន"
        },
        {
            "barcode": "171124970",
            "dpc": "03042912801",
            "name": "ទេព វណ្ណា"
        },
        {
            "barcode": "171124971",
            "dpc": "03042914101",
            "name": "ឈឹម សារ៉េត"
        },
        {
            "barcode": "171124972",
            "dpc": "03042914201",
            "name": "សំ សុខហេង"
        },
        {
            "barcode": "171124973",
            "dpc": "03042914301",
            "name": "សាន ចន"
        },
        {
            "barcode": "171124974",
            "dpc": "03042914801",
            "name": "ឌឿក វណ្ណា"
        },
        {
            "barcode": "171124975",
            "dpc": "03042914901",
            "name": "លៀង វិច្ឆិកា"
        },
        {
            "barcode": "171124976",
            "dpc": "03042915001",
            "name": "លាង សម្ផស្ស"
        },
        {
            "barcode": "171124977",
            "dpc": "03042915101",
            "name": "ឡៅ ប៊ុនលីដា"
        },
        {
            "barcode": "171124978",
            "dpc": "03042915201",
            "name": "ហ៊ួន ធារី"
        },
        {
            "barcode": "171124979",
            "dpc": "03042915301",
            "name": "ញ៉ុក ឆវី"
        },
        {
            "barcode": "171124980",
            "dpc": "03042915401",
            "name": "ទ្រិញ យី បូរីផ្សារលើ"
        },
        {
            "barcode": "171124981",
            "dpc": "03042915501",
            "name": "ហ៊ាង សុម៉ាណា បូរីផ្សារេលី"
        },
        {
            "barcode": "171124982",
            "dpc": "03042915601",
            "name": "បនា ឡង បូរីផ្សារលើ"
        },
        {
            "barcode": "171124983",
            "dpc": "03042915701",
            "name": "ហ៊ឹង ផល្លា"
        },
        {
            "barcode": "171124984",
            "dpc": "03042916401",
            "name": "អែម យុទ្ធ"
        },
        {
            "barcode": "171124985",
            "dpc": "03042916501",
            "name": "គា ថៃ"
        },
        {
            "barcode": "171124986",
            "dpc": "03042916901",
            "name": "ចាន់ សុធី"
        },
        {
            "barcode": "171124987",
            "dpc": "03042917101",
            "name": "ឡុង យ៉ាន"
        },
        {
            "barcode": "171124988",
            "dpc": "03042917301",
            "name": "គា ចាន់នី"
        },
        {
            "barcode": "171124989",
            "dpc": "03042917601",
            "name": "ថាន់ រដ្ឋា"
        },
        {
            "barcode": "171124990",
            "dpc": "03042917901",
            "name": "ប៉ែន សុវណ្ណតារា"
        },
        {
            "barcode": "171124991",
            "dpc": "03042918001",
            "name": "ធួន រ៉ាវុធ"
        },
        {
            "barcode": "171124992",
            "dpc": "03042918101",
            "name": "ឡិប សុធា"
        },
        {
            "barcode": "171124993",
            "dpc": "03042918201",
            "name": "លឿង ណាគ្រី"
        },
        {
            "barcode": "171124994",
            "dpc": "03042918301",
            "name": "តិ ចាន់គុណ"
        },
        {
            "barcode": "171124995",
            "dpc": "03042918601",
            "name": "សេង ហុង"
        },
        {
            "barcode": "171124996",
            "dpc": "03042918701",
            "name": "ប៉ុស្តន៍បាយ័ន្ត"
        },
        {
            "barcode": "171124997",
            "dpc": "03042918801",
            "name": "គឹម វុទ្ឌី"
        },
        {
            "barcode": "171124998",
            "dpc": "03042918901",
            "name": "ប្រាក់ វុទ្ធី"
        },
        {
            "barcode": "171124999",
            "dpc": "03042919001",
            "name": "ហុង ចាន់ណា"
        },
        {
            "barcode": "171125000",
            "dpc": "03042919101",
            "name": "ធនាគារកាណាឌីយ៉ា"
        },
        {
            "barcode": "171125001",
            "dpc": "03042919201",
            "name": "ធនាគារប្រៃណីយ៍"
        },
        {
            "barcode": "171125002",
            "dpc": "03042919601",
            "name": "យស់ សាមឿន"
        },
        {
            "barcode": "171125003",
            "dpc": "03042920001",
            "name": "សំ ដារ៉ាវុធ"
        },
        {
            "barcode": "171125004",
            "dpc": "03042920801",
            "name": "កៅ សុផារី"
        },
        {
            "barcode": "171125005",
            "dpc": "03042920901",
            "name": "ពៅ ជា"
        },
        {
            "barcode": "171125006",
            "dpc": "03042921001",
            "name": "ម៉ម សំអុល"
        },
        {
            "barcode": "171125007",
            "dpc": "03042921101",
            "name": "មុំ សុផល"
        },
        {
            "barcode": "171125008",
            "dpc": "03042921201",
            "name": "ព្រំ សុផល"
        },
        {
            "barcode": "171125009",
            "dpc": "03042921401",
            "name": "លឹម ហាក់"
        },
        {
            "barcode": "171125010",
            "dpc": "03042921501",
            "name": "ម៉ុង ធី"
        },
        {
            "barcode": "171125011",
            "dpc": "03042921801",
            "name": "ណៃ វុន"
        },
        {
            "barcode": "171125012",
            "dpc": "03042921901",
            "name": "លឹម ស៊ីថា"
        },
        {
            "barcode": "171125013",
            "dpc": "03042922301",
            "name": "ហុង ស៊ីថា"
        },
        {
            "barcode": "171125014",
            "dpc": "03042923101",
            "name": "អ៊ាន ចន្ទ័ណា"
        },
        {
            "barcode": "171125015",
            "dpc": "03042923601",
            "name": "ដោក ហេង"
        },
        {
            "barcode": "171125016",
            "dpc": "03042923701",
            "name": "ស៊ង លួត"
        },
        {
            "barcode": "171125017",
            "dpc": "03042923801",
            "name": "យិន ធីរ៉ាក់"
        },
        {
            "barcode": "171125018",
            "dpc": "03042923901",
            "name": "វង្ស ឌីណា"
        },
        {
            "barcode": "171125019",
            "dpc": "03042924001",
            "name": "កែវ ជី"
        },
        {
            "barcode": "171125020",
            "dpc": "03042924101",
            "name": "ប៊ុត គីម"
        },
        {
            "barcode": "171125021",
            "dpc": "03042924201",
            "name": "ឯក ម៉ារ៉ាឌី"
        },
        {
            "barcode": "171125022",
            "dpc": "03042924401",
            "name": "នៅ តុលា"
        },
        {
            "barcode": "171125023",
            "dpc": "03042924501",
            "name": "សោម សម្បត្តិ"
        },
        {
            "barcode": "171125024",
            "dpc": "03042924601",
            "name": "សំរទ្ធ ណារី"
        },
        {
            "barcode": "171125025",
            "dpc": "03042924701",
            "name": "ហាក់ ស៊្រី"
        },
        {
            "barcode": "171125026",
            "dpc": "03042924801",
            "name": "ម៉ៅ រឿង"
        },
        {
            "barcode": "171125027",
            "dpc": "03042924901",
            "name": "ព្រឹង តិ"
        },
        {
            "barcode": "171125028",
            "dpc": "03042925001",
            "name": "ម៉ី សំអាង"
        },
        {
            "barcode": "171125029",
            "dpc": "03042925101",
            "name": "ស្រី មុន្នីរិទ្ធ"
        },
        {
            "barcode": "171125030",
            "dpc": "03042925201",
            "name": "គ្រីន ប៊ុនធី"
        },
        {
            "barcode": "171125031",
            "dpc": "03042925301",
            "name": "ស្រេង ឡៃស៊ាង"
        },
        {
            "barcode": "171125032",
            "dpc": "03042925401",
            "name": "វេទ ដារ៉ា"
        },
        {
            "barcode": "171125033",
            "dpc": "03042925601",
            "name": "វ៉ាន់ សំបូរ"
        },
        {
            "barcode": "171125034",
            "dpc": "03042925701",
            "name": "អ៊ុក ឈិន"
        },
        {
            "barcode": "171125035",
            "dpc": "03042925801",
            "name": "សុខ ចាន់ធឿន"
        },
        {
            "barcode": "171125036",
            "dpc": "03042926201",
            "name": "ជា សាវឹម"
        },
        {
            "barcode": "171125037",
            "dpc": "03042926301",
            "name": "លន់ ឆឿន"
        },
        {
            "barcode": "171125038",
            "dpc": "03042927001",
            "name": "សាំង សែន"
        },
        {
            "barcode": "171125039",
            "dpc": "03042927101",
            "name": "គង់ រិទ្ធ"
        },
        {
            "barcode": "171125040",
            "dpc": "03042927601",
            "name": "ធឹង គឹមហេង ២"
        },
        {
            "barcode": "171125041",
            "dpc": "03042927801",
            "name": "ឈីត រដ្ឋា"
        },
        {
            "barcode": "171125042",
            "dpc": "03042927901",
            "name": "ហ៊ុយ កុសល់"
        },
        {
            "barcode": "171125043",
            "dpc": "03042928301",
            "name": "សុខ ប៊ុនដារ៉ា"
        },
        {
            "barcode": "171125044",
            "dpc": "03042928601",
            "name": "ជុំ រិទ្ធី"
        },
        {
            "barcode": "171125045",
            "dpc": "03042928801",
            "name": "តឹក សំណាក់ ៣"
        },
        {
            "barcode": "171125046",
            "dpc": "03042928901",
            "name": "សារ៉ង ម៉ាឡា"
        },
        {
            "barcode": "171125047",
            "dpc": "03042929301",
            "name": "ប៉េង វុត្ថា"
        },
        {
            "barcode": "171125048",
            "dpc": "03042929401",
            "name": "ម៉ី សយ"
        },
        {
            "barcode": "171125049",
            "dpc": "03042929501",
            "name": "ជូ អរុណ"
        },
        {
            "barcode": "171125050",
            "dpc": "03042929601",
            "name": "ជា រ៉ុង"
        },
        {
            "barcode": "171125051",
            "dpc": "03042929701",
            "name": "ទិត្យ រស្មី"
        },
        {
            "barcode": "171125052",
            "dpc": "03042929801",
            "name": "វ៉េង ហុក"
        },
        {
            "barcode": "171125053",
            "dpc": "03042930001",
            "name": "ជៀម សុខា ២"
        },
        {
            "barcode": "171125054",
            "dpc": "03042930101",
            "name": "លន់ ណាក់"
        },
        {
            "barcode": "171125055",
            "dpc": "03042931201",
            "name": "ស៊ុន សារុន"
        },
        {
            "barcode": "171125056",
            "dpc": "03042931301",
            "name": "ស៊ត ស៊ិន"
        },
        {
            "barcode": "171125057",
            "dpc": "03042931901",
            "name": "អ៊ុយ ថារិទ្ធ"
        },
        {
            "barcode": "171125058",
            "dpc": "03042932001",
            "name": "ខឹម យ៉ាន់"
        },
        {
            "barcode": "171125059",
            "dpc": "03042932201",
            "name": "នូវ ចាន់ដារ៉ា"
        },
        {
            "barcode": "171125060",
            "dpc": "03042932501",
            "name": "គុំ វិចិត្ត"
        },
        {
            "barcode": "171125061",
            "dpc": "03042932601",
            "name": "គូ សុងលី"
        },
        {
            "barcode": "171125062",
            "dpc": "03042932701",
            "name": "ស៊ូ សានិត"
        },
        {
            "barcode": "171125063",
            "dpc": "03042932801",
            "name": "ហុង ស៊ីថា"
        },
        {
            "barcode": "171125064",
            "dpc": "03042932901",
            "name": "គង់ ឡេង"
        },
        {
            "barcode": "171125065",
            "dpc": "03042933001",
            "name": "គន់ សូផល្លី"
        },
        {
            "barcode": "171125066",
            "dpc": "03042933601",
            "name": "លេង ណែត"
        },
        {
            "barcode": "171125067",
            "dpc": "03042933701",
            "name": "សុខ យ៉ារ៉ា"
        },
        {
            "barcode": "171125068",
            "dpc": "03042933901",
            "name": "សោ ទ៉ុនលាង"
        },
        {
            "barcode": "171125069",
            "dpc": "03042934001",
            "name": "សួង សុគុណ"
        },
        {
            "barcode": "171125070",
            "dpc": "03042934101",
            "name": "ម៉េង វណ្ណៈ"
        },
        {
            "barcode": "171125071",
            "dpc": "03042934701",
            "name": "វុទ្ធ រដ្ឋា"
        },
        {
            "barcode": "171125072",
            "dpc": "03042934801",
            "name": "ហេង ចរិយា"
        },
        {
            "barcode": "171125073",
            "dpc": "03042934901",
            "name": "ឈុន សំបូររ័ត្ន"
        },
        {
            "barcode": "171125074",
            "dpc": "03042935301",
            "name": "យី សុងគី"
        },
        {
            "barcode": "171125075",
            "dpc": "03042935401",
            "name": "ញឹក ប៊ុនឈៀត"
        },
        {
            "barcode": "171125076",
            "dpc": "03042935601",
            "name": "ពិន សុគន្ធ"
        },
        {
            "barcode": "171125077",
            "dpc": "03042935701",
            "name": "ភូ សុខជា"
        },
        {
            "barcode": "171125078",
            "dpc": "03042936101",
            "name": "គី ផល"
        },
        {
            "barcode": "171125079",
            "dpc": "03042936201",
            "name": "ធួន រ៉ាវុធ"
        },
        {
            "barcode": "171125080",
            "dpc": "03042936901",
            "name": "ដែង ខាន់"
        },
        {
            "barcode": "171125081",
            "dpc": "03042937001",
            "name": "ទៀង សុង"
        },
        {
            "barcode": "171125082",
            "dpc": "03042938001",
            "name": "សក់ សំពឿន"
        },
        {
            "barcode": "171125083",
            "dpc": "03042938101",
            "name": "កាយ សុផល"
        },
        {
            "barcode": "171125084",
            "dpc": "03042938201",
            "name": "ជា ភួយ"
        },
        {
            "barcode": "171125085",
            "dpc": "03042938301",
            "name": "ជា ឈឿង"
        },
        {
            "barcode": "171125086",
            "dpc": "03042938401",
            "name": "ជា ខ"
        },
        {
            "barcode": "171125087",
            "dpc": "03042938501",
            "name": "ជា ហិញ"
        },
        {
            "barcode": "171125088",
            "dpc": "03042938601",
            "name": "ជា គង់"
        },
        {
            "barcode": "171125089",
            "dpc": "03042938701",
            "name": "ឈឹម កី"
        },
        {
            "barcode": "171125090",
            "dpc": "03042938801",
            "name": "ឈឹម ឈួង"
        },
        {
            "barcode": "171125091",
            "dpc": "03042938901",
            "name": "អ៊ិត បេង"
        },
        {
            "barcode": "171125092",
            "dpc": "03042939001",
            "name": "ជី គឹមហួយ"
        },
        {
            "barcode": "171125093",
            "dpc": "03042939101",
            "name": "អ៊ិត ពុំ"
        },
        {
            "barcode": "171125094",
            "dpc": "03042939201",
            "name": "មឿក សាមាជ"
        },
        {
            "barcode": "171125095",
            "dpc": "03042939301",
            "name": "ចែត ពាន"
        },
        {
            "barcode": "171125096",
            "dpc": "03042939401",
            "name": "ទៀង ប៊ុនទិត្យ"
        },
        {
            "barcode": "171125097",
            "dpc": "03042939601",
            "name": "ទឹម សុផេត"
        },
        {
            "barcode": "171125098",
            "dpc": "03042939701",
            "name": "ឈួត សុខា"
        },
        {
            "barcode": "171125099",
            "dpc": "03042939801",
            "name": "ឈឿន សុវណ្ណា"
        },
        {
            "barcode": "171125100",
            "dpc": "03042939901",
            "name": "ផន ផាន"
        },
        {
            "barcode": "171125101",
            "dpc": "03042940001",
            "name": "ជ សេងហៀង"
        },
        {
            "barcode": "171125102",
            "dpc": "03042940101",
            "name": "ទូច វ៉ាន់ថន"
        },
        {
            "barcode": "171125103",
            "dpc": "03042940201",
            "name": "ម៉ៅ វិចិត្រ"
        },
        {
            "barcode": "171125104",
            "dpc": "03042940601",
            "name": "បៀ មុន្នី"
        },
        {
            "barcode": "171125105",
            "dpc": "03042940701",
            "name": "ងួន រី"
        },
        {
            "barcode": "171125106",
            "dpc": "03042940901",
            "name": "សាង ឡេង"
        },
        {
            "barcode": "171125107",
            "dpc": "03042941001",
            "name": "ជួន ស្រីនី"
        },
        {
            "barcode": "171125108",
            "dpc": "03042941101",
            "name": "អោក រៀត"
        },
        {
            "barcode": "171125109",
            "dpc": "03042941201",
            "name": "រុន រដ្ឋា"
        },
        {
            "barcode": "171125110",
            "dpc": "03042941301",
            "name": "សៀង សារិទ្ធ"
        },
        {
            "barcode": "171125111",
            "dpc": "03042941401",
            "name": "រុន ពិសិដ្ឋ"
        },
        {
            "barcode": "171125112",
            "dpc": "03042941601",
            "name": "វាត វិបុល"
        },
        {
            "barcode": "171125113",
            "dpc": "03042941701",
            "name": "ម៉ៅ ភីរិទ្ធ"
        },
        {
            "barcode": "171125114",
            "dpc": "03042941801",
            "name": "វ៉ាត សុខលី"
        },
        {
            "barcode": "171125115",
            "dpc": "03042941901",
            "name": "ញែម កឿន"
        },
        {
            "barcode": "171125116",
            "dpc": "03042942001",
            "name": "ម៉ៅ មិ"
        },
        {
            "barcode": "171125117",
            "dpc": "03042942101",
            "name": "យ៉េត ម៉ាន"
        },
        {
            "barcode": "171125118",
            "dpc": "03042942201",
            "name": "ចំរើន រិទ្ធិ"
        },
        {
            "barcode": "171125119",
            "dpc": "03042942301",
            "name": "ចាប យន"
        },
        {
            "barcode": "171125120",
            "dpc": "03042942401",
            "name": "វន ហឿត"
        },
        {
            "barcode": "171125121",
            "dpc": "03042942501",
            "name": "គឹម ហេង"
        },
        {
            "barcode": "171125122",
            "dpc": "03042942801",
            "name": "ពៅ ញាណ"
        },
        {
            "barcode": "171125123",
            "dpc": "03042942901",
            "name": "ពៅ អុក"
        },
        {
            "barcode": "171125124",
            "dpc": "03042943001",
            "name": "ង៉ាម នងរដ្ឋា"
        },
        {
            "barcode": "171125125",
            "dpc": "03042943101",
            "name": "ឈឿន សុវណ្ណះ"
        },
        {
            "barcode": "171125126",
            "dpc": "03042943301",
            "name": "នួន សាន"
        },
        {
            "barcode": "171125127",
            "dpc": "03042943401",
            "name": "ចន្ទ័ សុជាតិ"
        },
        {
            "barcode": "171125128",
            "dpc": "03042943501",
            "name": "ហ៊ត បួ"
        },
        {
            "barcode": "171125129",
            "dpc": "03042943601",
            "name": "សុខ លីគា"
        },
        {
            "barcode": "171125130",
            "dpc": "03042943701",
            "name": "មួន ថានី"
        },
        {
            "barcode": "171125131",
            "dpc": "03042943801",
            "name": "ឡុច វណ្ណថា"
        },
        {
            "barcode": "171125132",
            "dpc": "03042943901",
            "name": "គង់ បាន"
        },
        {
            "barcode": "171125133",
            "dpc": "03042944001",
            "name": "រីន សុភាព"
        },
        {
            "barcode": "171125134",
            "dpc": "03042944201",
            "name": "ស៊ុត សាវ៉ៃ"
        },
        {
            "barcode": "171125135",
            "dpc": "03042944301",
            "name": "អ៊ឹម សុខធា"
        },
        {
            "barcode": "171125136",
            "dpc": "03042944401",
            "name": "ថន ថេរ"
        },
        {
            "barcode": "171125137",
            "dpc": "03042944501",
            "name": "មាស សុផាត"
        },
        {
            "barcode": "171125138",
            "dpc": "03042944601",
            "name": "ប្រាក់ កុសល់"
        },
        {
            "barcode": "171125139",
            "dpc": "03042944701",
            "name": "កន គឹមស៊"
        },
        {
            "barcode": "171125140",
            "dpc": "03042945001",
            "name": "ភោគ ធារី"
        },
        {
            "barcode": "171125141",
            "dpc": "03042945101",
            "name": "ទួត សាទុំ"
        },
        {
            "barcode": "171125142",
            "dpc": "03042945201",
            "name": "ចាន់ សុខុម"
        },
        {
            "barcode": "171125143",
            "dpc": "03042945401",
            "name": "អ៊ាម ងិ"
        },
        {
            "barcode": "171125144",
            "dpc": "03042945601",
            "name": "អ៊ុម សំ"
        },
        {
            "barcode": "171125145",
            "dpc": "03042945701",
            "name": "សាំង យឿន"
        },
        {
            "barcode": "171125146",
            "dpc": "03042945801",
            "name": "អោក បេងឈុន"
        },
        {
            "barcode": "171125147",
            "dpc": "03042945901",
            "name": "ភឿក បេងឈាន"
        },
        {
            "barcode": "171125148",
            "dpc": "03042946101",
            "name": "ថាវ សារឿន"
        },
        {
            "barcode": "171125149",
            "dpc": "03042946201",
            "name": "ម៉ាក យូរ៉ាត់"
        },
        {
            "barcode": "171125150",
            "dpc": "03042946401",
            "name": "ស៊ិន សុគន្ធ"
        },
        {
            "barcode": "171125151",
            "dpc": "03042946501",
            "name": "ឈឿម យិន"
        },
        {
            "barcode": "171125152",
            "dpc": "03042946601",
            "name": "ទេព បញ្ញា"
        },
        {
            "barcode": "171125153",
            "dpc": "03042946701",
            "name": "ហ៊ុល បឋម"
        },
        {
            "barcode": "171125154",
            "dpc": "03042947001",
            "name": "ហ៊ុល ម៉ាឡៃ"
        },
        {
            "barcode": "171125155",
            "dpc": "03042947101",
            "name": "អឿប ល្បត់"
        },
        {
            "barcode": "171125156",
            "dpc": "03042947201",
            "name": "រៀង"
        },
        {
            "barcode": "171125157",
            "dpc": "03042947301",
            "name": "ពៅ"
        },
        {
            "barcode": "171125158",
            "dpc": "03042947501",
            "name": "ឆយ សារិន"
        },
        {
            "barcode": "171125159",
            "dpc": "03042947601",
            "name": "ភិន សុថេត"
        },
        {
            "barcode": "171125160",
            "dpc": "03042947701",
            "name": "ស៊ាន ចាន់ធា"
        },
        {
            "barcode": "171125161",
            "dpc": "03042947801",
            "name": "គៀង ហាន"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
