let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171128426",
            "dpc": "03033325801",
            "name": "លន់ សុខចំរើន"
        },
        {
            "barcode": "171128427",
            "dpc": "03033303601",
            "name": "អ៊ឹម ថា"
        },
        {
            "barcode": "171128428",
            "dpc": "03033325501",
            "name": "អែប ភិរុណ"
        },
        {
            "barcode": "171128429",
            "dpc": "03033303301",
            "name": "ឡេង សេងលាង"
        },
        {
            "barcode": "171128430",
            "dpc": "03033303201",
            "name": "លួត សំបូ"
        },
        {
            "barcode": "171128431",
            "dpc": "03033303101",
            "name": "វង្ស វិចិត្រ"
        },
        {
            "barcode": "171128432",
            "dpc": "03033302501",
            "name": "ប៉ាង មារិទ្ធ"
        },
        {
            "barcode": "171128433",
            "dpc": "03033302401",
            "name": "យ៉ត គៀវ"
        },
        {
            "barcode": "171128434",
            "dpc": "03033302301",
            "name": "ហ៊ុន ហ៊ី"
        },
        {
            "barcode": "171128435",
            "dpc": "03033302101",
            "name": "អ៊ុំ សុខឡាយ"
        },
        {
            "barcode": "171128436",
            "dpc": "03033302001",
            "name": "ផៃ បុប្ផា"
        },
        {
            "barcode": "171128437",
            "dpc": "03033301901",
            "name": "មាន  សាលវ័ន្ត"
        },
        {
            "barcode": "171128438",
            "dpc": "03033301801",
            "name": "សុខ  ពុធ"
        },
        {
            "barcode": "171128439",
            "dpc": "03033301701",
            "name": "រត្ន័  ចន្ធូ"
        },
        {
            "barcode": "171128440",
            "dpc": "03033301601",
            "name": "ហិញ  រដ្ឋា"
        },
        {
            "barcode": "171128441",
            "dpc": "03033301501",
            "name": "កាន់  ស៊ីចន្ទ័តូ"
        },
        {
            "barcode": "171128442",
            "dpc": "03033301401",
            "name": "ងី  វណ្ណះ"
        },
        {
            "barcode": "171128443",
            "dpc": "03033301301",
            "name": "អ៊ឹម  ផល្លា"
        },
        {
            "barcode": "171128444",
            "dpc": "03033301201",
            "name": "សុខ  សុវណ្ណ"
        },
        {
            "barcode": "171128445",
            "dpc": "03033301101",
            "name": "អ៊ឹង  ចិន្តា"
        },
        {
            "barcode": "171128446",
            "dpc": "03033301001",
            "name": "សេង  ម៉េង"
        },
        {
            "barcode": "171128447",
            "dpc": "03033300901",
            "name": "យ៉ាន  ស្រអែម"
        },
        {
            "barcode": "171128448",
            "dpc": "03033300801",
            "name": "លី  សុភាព"
        },
        {
            "barcode": "171128449",
            "dpc": "03033300701",
            "name": "ផន  វិចិត្រ"
        },
        {
            "barcode": "171128450",
            "dpc": "03033300601",
            "name": "លីម  ស៊ីចេង"
        },
        {
            "barcode": "171128451",
            "dpc": "03033300501",
            "name": "រិន រ៉ាត់"
        },
        {
            "barcode": "171128452",
            "dpc": "03033300401",
            "name": "កែ សៅ"
        },
        {
            "barcode": "171128453",
            "dpc": "03033300201",
            "name": "ឈន វៃ"
        },
        {
            "barcode": "171128454",
            "dpc": "03033300101",
            "name": "តាំង បេងគុណ"
        },
        {
            "barcode": "171128455",
            "dpc": "03033326001",
            "name": "ស្រី ទិព្វសម្បត្តិ"
        },
        {
            "barcode": "171128456",
            "dpc": "03033326101",
            "name": "ញ៉េប វ៉ន"
        },
        {
            "barcode": "171128457",
            "dpc": "03033325901",
            "name": "សុខ នី"
        },
        {
            "barcode": "171128458",
            "dpc": "03033307501",
            "name": "ជ  គាង"
        },
        {
            "barcode": "171128459",
            "dpc": "03033303501",
            "name": "ប៉ោ ស៊ីនួន"
        },
        {
            "barcode": "171128460",
            "dpc": "03033303401",
            "name": "គឹម ឡៃ"
        },
        {
            "barcode": "171128461",
            "dpc": "03033326201",
            "name": "រិន សារី"
        },
        {
            "barcode": "171128462",
            "dpc": "03033303801",
            "name": "ម៉ី ផល្លា"
        },
        {
            "barcode": "171128463",
            "dpc": "03033326301",
            "name": "យិន  ចិត្រា ១"
        },
        {
            "barcode": "171128464",
            "dpc": "03033308401",
            "name": "យឹម ចិត្រា"
        },
        {
            "barcode": "171128465",
            "dpc": "03033326601",
            "name": "មាស សារុន"
        },
        {
            "barcode": "171128466",
            "dpc": "03033307801",
            "name": "ហុង កុសល"
        },
        {
            "barcode": "171128467",
            "dpc": "03033307901",
            "name": "ឈាងអៀង"
        },
        {
            "barcode": "171128468",
            "dpc": "03033308001",
            "name": "ជា សិទ្ធ"
        },
        {
            "barcode": "171128469",
            "dpc": "03033308101",
            "name": "ខេង សៀកហួត"
        },
        {
            "barcode": "171128470",
            "dpc": "03033326701",
            "name": "តោ សាលីន"
        },
        {
            "barcode": "171128471",
            "dpc": "03033307001",
            "name": "ជឺ ពុំ"
        },
        {
            "barcode": "171128472",
            "dpc": "03033306901",
            "name": "លឹម ម៉ី"
        },
        {
            "barcode": "171128473",
            "dpc": "03033306801",
            "name": "អៀម ម៉េងគង់"
        },
        {
            "barcode": "171128474",
            "dpc": "03033308301",
            "name": "នូវ គឹមណៃ"
        },
        {
            "barcode": "171128475",
            "dpc": "03033308501",
            "name": "ជឺ ពុំ"
        },
        {
            "barcode": "171128476",
            "dpc": "03033302601",
            "name": "ញ៉េប  ចាន់នី"
        },
        {
            "barcode": "171128477",
            "dpc": "03033302701",
            "name": "នី  យ៉ារី"
        },
        {
            "barcode": "171128478",
            "dpc": "03033302801",
            "name": "គុណ  យឿន"
        },
        {
            "barcode": "171128479",
            "dpc": "03033302901",
            "name": "ប៊ុន   វន្នី"
        },
        {
            "barcode": "171128480",
            "dpc": "03033303001",
            "name": "ចៅ  ចេកអាំង"
        },
        {
            "barcode": "171128481",
            "dpc": "03033303701",
            "name": "មាស  ធន"
        },
        {
            "barcode": "171128482",
            "dpc": "03033303901",
            "name": "ចាន់  សាវ៉ៃ"
        },
        {
            "barcode": "171128483",
            "dpc": "03033304001",
            "name": "ជុំ  ចាន់ថន"
        },
        {
            "barcode": "171128484",
            "dpc": "03033304101",
            "name": "ឆន  សុភ័ស្ត"
        },
        {
            "barcode": "171128485",
            "dpc": "03033304201",
            "name": "លី  ស៊ុក"
        },
        {
            "barcode": "171128486",
            "dpc": "03033304301",
            "name": "ប៉ែ  សារៀម"
        },
        {
            "barcode": "171128487",
            "dpc": "03033304401",
            "name": "ឡុក  ចាន់ធី"
        },
        {
            "barcode": "171128488",
            "dpc": "03033304501",
            "name": "ខៀវ  ឈឿត"
        },
        {
            "barcode": "171128489",
            "dpc": "03033304701",
            "name": "យក់  លីវ"
        },
        {
            "barcode": "171128490",
            "dpc": "03033304801",
            "name": "ស៊ឹម ស៊ីថា"
        },
        {
            "barcode": "171128491",
            "dpc": "03033304901",
            "name": "សុខ  ផាន់"
        },
        {
            "barcode": "171128492",
            "dpc": "03033305001",
            "name": "អ៊ុក អ៊ូច"
        },
        {
            "barcode": "171128493",
            "dpc": "03033305101",
            "name": "កុល  ប្រពៃ"
        },
        {
            "barcode": "171128494",
            "dpc": "03033305201",
            "name": "អ៊ឹម  ផល្លា"
        },
        {
            "barcode": "171128495",
            "dpc": "03033305301",
            "name": "រស់  សាបឿន"
        },
        {
            "barcode": "171128496",
            "dpc": "03033305401",
            "name": "រស់  ទីណាល់"
        },
        {
            "barcode": "171128497",
            "dpc": "03033305501",
            "name": "សេង  សុថុន"
        },
        {
            "barcode": "171128498",
            "dpc": "03033305601",
            "name": "មាឃ  រចនា"
        },
        {
            "barcode": "171128499",
            "dpc": "03033305701",
            "name": "សៅ  ឆុន"
        },
        {
            "barcode": "171128500",
            "dpc": "03033305801",
            "name": "កែវ  ធី"
        },
        {
            "barcode": "171128501",
            "dpc": "03033305901",
            "name": "សំ  សាវន"
        },
        {
            "barcode": "171128502",
            "dpc": "03033306001",
            "name": "ស៊ីន   យ៉ែម"
        },
        {
            "barcode": "171128503",
            "dpc": "03033306101",
            "name": "អ៊ុំ  សុធីតា"
        },
        {
            "barcode": "171128504",
            "dpc": "03033306201",
            "name": "សន  សុផល"
        },
        {
            "barcode": "171128505",
            "dpc": "03033306301",
            "name": "ចាន់  ក្រេប"
        },
        {
            "barcode": "171128506",
            "dpc": "03033306401",
            "name": "លន់  ចាន់អុង"
        },
        {
            "barcode": "171128507",
            "dpc": "03033306501",
            "name": "ធួន  វណ្ណី"
        },
        {
            "barcode": "171128508",
            "dpc": "03033306601",
            "name": "ផាន់   ស៊ុនបុប្ជា"
        },
        {
            "barcode": "171128509",
            "dpc": "03033306701",
            "name": "គីវ  វ៉ាន់នី"
        },
        {
            "barcode": "171128510",
            "dpc": "03033307201",
            "name": "ចាន់  ទូច"
        },
        {
            "barcode": "171128511",
            "dpc": "03033307401",
            "name": "ប៉ុល  ឃួន"
        },
        {
            "barcode": "171128512",
            "dpc": "03033307601",
            "name": "បេង ស៊ីណាត ១"
        },
        {
            "barcode": "171128513",
            "dpc": "03033307701",
            "name": "បេង ស៊ីណាត ២"
        },
        {
            "barcode": "171128514",
            "dpc": "03033308601",
            "name": "បាន  ហួត"
        },
        {
            "barcode": "171128515",
            "dpc": "03033308701",
            "name": "ឃួន ម៉ាឡា"
        },
        {
            "barcode": "171128516",
            "dpc": "03033308801",
            "name": "ហង្ស សីណា"
        },
        {
            "barcode": "171128517",
            "dpc": "03033308901",
            "name": "ម៉ៅ  សាវុន"
        },
        {
            "barcode": "171128518",
            "dpc": "03033309001",
            "name": "ចាន់  ណារី"
        },
        {
            "barcode": "171128519",
            "dpc": "03033309101",
            "name": "ចាន់  រដ្ឋា"
        },
        {
            "barcode": "171128520",
            "dpc": "03033309201",
            "name": "លី   ហុង"
        },
        {
            "barcode": "171128521",
            "dpc": "03033309301",
            "name": "សុខ  ណារ៉ា"
        },
        {
            "barcode": "171128522",
            "dpc": "03033309401",
            "name": "សេង  សុខឃាង"
        },
        {
            "barcode": "171128523",
            "dpc": "03033309501",
            "name": "សួស  ភីរុន"
        },
        {
            "barcode": "171128524",
            "dpc": "03033309601",
            "name": "មណ្ឌលសុខភាពជ្រៃ"
        },
        {
            "barcode": "171128525",
            "dpc": "03033309701",
            "name": "ហ៊ន  សាមិត"
        },
        {
            "barcode": "171128526",
            "dpc": "03033309901",
            "name": "ឆយ  ចាន់ណា"
        },
        {
            "barcode": "171128527",
            "dpc": "03033310001",
            "name": "លី  ឆាយ"
        },
        {
            "barcode": "171128528",
            "dpc": "03033310101",
            "name": "ជ្រិន  សុភស្ត័"
        },
        {
            "barcode": "171128529",
            "dpc": "03033310201",
            "name": "សៀង  វីរៈ"
        },
        {
            "barcode": "171128530",
            "dpc": "03033310301",
            "name": "រ៉េត  រិន"
        },
        {
            "barcode": "171128531",
            "dpc": "03033310401",
            "name": "ខាត់  គីមលាង"
        },
        {
            "barcode": "171128532",
            "dpc": "03033310501",
            "name": "ហ៊ូ  ឡាយឡូវ"
        },
        {
            "barcode": "171128533",
            "dpc": "03033310601",
            "name": "ងួន  រ៉ាឌី"
        },
        {
            "barcode": "171128534",
            "dpc": "03033310701",
            "name": "ហាស់  ស៊ីណេម"
        },
        {
            "barcode": "171128535",
            "dpc": "03033310801",
            "name": "គឹម  សំអុល"
        },
        {
            "barcode": "171128536",
            "dpc": "03033310901",
            "name": "សុត  សុខុម"
        },
        {
            "barcode": "171128537",
            "dpc": "03033311001",
            "name": "វ៉ាត  សុភាព"
        },
        {
            "barcode": "171128538",
            "dpc": "03033311101",
            "name": "ពិន  ចាន់ធី"
        },
        {
            "barcode": "171128539",
            "dpc": "03033311201",
            "name": "ច័ន្ទ  សុថុន"
        },
        {
            "barcode": "171128540",
            "dpc": "03033311301",
            "name": "ត្រាន់  ធីហឿង"
        },
        {
            "barcode": "171128541",
            "dpc": "03033311401",
            "name": "ឃុន  សារឿន"
        },
        {
            "barcode": "171128542",
            "dpc": "03033311501",
            "name": "តាន់  ធុច"
        },
        {
            "barcode": "171128543",
            "dpc": "03033311601",
            "name": "ហ៊ន  សាមិត"
        },
        {
            "barcode": "171128544",
            "dpc": "03033311701",
            "name": "ស៊ុន  ឈុន"
        },
        {
            "barcode": "171128545",
            "dpc": "03033311801",
            "name": "យុង  សម្បត្តិ"
        },
        {
            "barcode": "171128546",
            "dpc": "03033311901",
            "name": "ហួ  កុយ"
        },
        {
            "barcode": "171128547",
            "dpc": "03033312001",
            "name": "រិទ្ធ  វុទ្ធី"
        },
        {
            "barcode": "171128548",
            "dpc": "03033312101",
            "name": "ទូច  នាង"
        },
        {
            "barcode": "171128549",
            "dpc": "03033312201",
            "name": "ហឿង  ពៅ"
        },
        {
            "barcode": "171128550",
            "dpc": "03033312301",
            "name": "ចាន់  បញ្ញា"
        },
        {
            "barcode": "171128551",
            "dpc": "03033312401",
            "name": "ស្រី  ពេញ"
        },
        {
            "barcode": "171128552",
            "dpc": "03033312501",
            "name": "វ៉ាន់  ធី"
        },
        {
            "barcode": "171128553",
            "dpc": "03033312601",
            "name": "មាឃ  ឆាយ"
        },
        {
            "barcode": "171128554",
            "dpc": "03033312701",
            "name": "យ៉ា  គឹ់មលី"
        },
        {
            "barcode": "171128555",
            "dpc": "03033312801",
            "name": "ផាន់  សារិ"
        },
        {
            "barcode": "171128556",
            "dpc": "03033312901",
            "name": "សៅ  សំណាង"
        },
        {
            "barcode": "171128557",
            "dpc": "03033313001",
            "name": "ទេស  សុន"
        },
        {
            "barcode": "171128558",
            "dpc": "03033313101",
            "name": "វ័រ  វឌ្ឍនះ"
        },
        {
            "barcode": "171128559",
            "dpc": "03033313201",
            "name": "នួន  ឡាំ"
        },
        {
            "barcode": "171128560",
            "dpc": "03033313301",
            "name": "ម៉ៃ  យីមហ៊ាង"
        },
        {
            "barcode": "171128561",
            "dpc": "03033313401",
            "name": "ហោ  ឌីម៉ង់"
        },
        {
            "barcode": "171128562",
            "dpc": "03033313501",
            "name": "ត្រេស  សាវឿង"
        },
        {
            "barcode": "171128563",
            "dpc": "03033313601",
            "name": "ម៉ៃ  អ៊ាន"
        },
        {
            "barcode": "171128564",
            "dpc": "03033313701",
            "name": "ឆឹង  វ៉ន"
        },
        {
            "barcode": "171128565",
            "dpc": "03033313801",
            "name": "ម៉ុក  សាលៀម"
        },
        {
            "barcode": "171128566",
            "dpc": "03033313901",
            "name": "រឿង ឌេតតេជពល"
        },
        {
            "barcode": "171128567",
            "dpc": "03033314001",
            "name": "ហេង  សូវៀត"
        },
        {
            "barcode": "171128568",
            "dpc": "03033314101",
            "name": "ហាន  សំអាត"
        },
        {
            "barcode": "171128569",
            "dpc": "03033314201",
            "name": "ប៊ុន  លីម"
        },
        {
            "barcode": "171128570",
            "dpc": "03033314301",
            "name": "តាន់  ឃឿន"
        },
        {
            "barcode": "171128571",
            "dpc": "03033314401",
            "name": "រត្ន័  សាវី"
        },
        {
            "barcode": "171128572",
            "dpc": "03033314501",
            "name": "អឿន  គីណាល់"
        },
        {
            "barcode": "171128573",
            "dpc": "03033314601",
            "name": "រើន  ភាព"
        },
        {
            "barcode": "171128574",
            "dpc": "03033314701",
            "name": "ម៉ៅ  សារុន"
        },
        {
            "barcode": "171128575",
            "dpc": "03033314801",
            "name": "ស៊ីវ  ទ្រី"
        },
        {
            "barcode": "171128576",
            "dpc": "03033314901",
            "name": "ស៊ិន  សារ៉ែន"
        },
        {
            "barcode": "171128577",
            "dpc": "03033315001",
            "name": "ស៊ិន  សារ៉ន"
        },
        {
            "barcode": "171128578",
            "dpc": "03033315101",
            "name": "ស៊ិន  សារិ"
        },
        {
            "barcode": "171128579",
            "dpc": "03033315301",
            "name": "ណៃ   សុខន"
        },
        {
            "barcode": "171128580",
            "dpc": "03033315401",
            "name": "េឃ្លាក  មុន្នី"
        },
        {
            "barcode": "171128581",
            "dpc": "03033315501",
            "name": "ព្រិល  វាសនា"
        },
        {
            "barcode": "171128582",
            "dpc": "03033315601",
            "name": "កែន  ប៊ុនយ៉េង"
        },
        {
            "barcode": "171128583",
            "dpc": "03033315701",
            "name": "ចៀម  វណ្ណា"
        },
        {
            "barcode": "171128584",
            "dpc": "03033315801",
            "name": "អេង  លិញ"
        },
        {
            "barcode": "171128585",
            "dpc": "03033315901",
            "name": "ភួង  សម្ឆស្ស"
        },
        {
            "barcode": "171128586",
            "dpc": "03033316001",
            "name": "សេង  ពិសិដ្ឋ"
        },
        {
            "barcode": "171128587",
            "dpc": "03033316201",
            "name": "ឆឹង  វ៉ាត"
        },
        {
            "barcode": "171128588",
            "dpc": "03033316301",
            "name": "ងួន  សារឿប"
        },
        {
            "barcode": "171128589",
            "dpc": "03033316401",
            "name": "ណាក់  សាវុធ"
        },
        {
            "barcode": "171128590",
            "dpc": "03033316501",
            "name": "ងិន  សំអាត"
        },
        {
            "barcode": "171128591",
            "dpc": "03033316601",
            "name": "សេង  ពិសិដ្ធ"
        },
        {
            "barcode": "171128592",
            "dpc": "03033316701",
            "name": "នន  នាង"
        },
        {
            "barcode": "171128593",
            "dpc": "03033316801",
            "name": "វ៉ា  ចន្ទ័ពិសិដ្ឋ"
        },
        {
            "barcode": "171128594",
            "dpc": "03033316901",
            "name": "វ៉ាន់ វ៉ាត"
        },
        {
            "barcode": "171128595",
            "dpc": "03033317001",
            "name": "សាន់  សាន"
        },
        {
            "barcode": "171128596",
            "dpc": "03033317101",
            "name": "ឆាយ  ជឿន"
        },
        {
            "barcode": "171128597",
            "dpc": "03033317201",
            "name": "ឆាយ  សែ"
        },
        {
            "barcode": "171128598",
            "dpc": "03033317501",
            "name": "វ៉ែន  ស៊ីន"
        },
        {
            "barcode": "171128599",
            "dpc": "03033317601",
            "name": "ផាន់  ស្រីផុន"
        },
        {
            "barcode": "171128600",
            "dpc": "03033317701",
            "name": "វ៉ើត  ហ៊ួយ"
        },
        {
            "barcode": "171128601",
            "dpc": "03033317801",
            "name": "ប្រាក់  សម្បត្តិ"
        },
        {
            "barcode": "171128602",
            "dpc": "03033317901",
            "name": "ឡាត  សាលី"
        },
        {
            "barcode": "171128603",
            "dpc": "03033318101",
            "name": "សាន  យ៉ន"
        },
        {
            "barcode": "171128604",
            "dpc": "03033318201",
            "name": "ផ្ទះ. ក. ភ.អណ្តូងចេញ"
        },
        {
            "barcode": "171128605",
            "dpc": "03033318301",
            "name": "សឿន  ចាន់ណា"
        },
        {
            "barcode": "171128606",
            "dpc": "03033318401",
            "name": "អ៊ុក  ហឿន"
        },
        {
            "barcode": "171128607",
            "dpc": "03033318501",
            "name": "ទេព  ជួន"
        },
        {
            "barcode": "171128608",
            "dpc": "03033318601",
            "name": "ឡេង  ហេង"
        },
        {
            "barcode": "171128609",
            "dpc": "03033318701",
            "name": "សន  សុខរ៉ា"
        },
        {
            "barcode": "171128610",
            "dpc": "03033318901",
            "name": "មឹក  ប៊ែ"
        },
        {
            "barcode": "171128611",
            "dpc": "03033319001",
            "name": "កែវ  យ៉ាត"
        },
        {
            "barcode": "171128612",
            "dpc": "03033319101",
            "name": "គឹម  ឃន"
        },
        {
            "barcode": "171128613",
            "dpc": "03033319201",
            "name": "ឡុង  ចាន់ថា"
        },
        {
            "barcode": "171128614",
            "dpc": "03033319301",
            "name": "យិន  សង់"
        },
        {
            "barcode": "171128615",
            "dpc": "03033319501",
            "name": "ចៅ  ធន់"
        },
        {
            "barcode": "171128616",
            "dpc": "03033319701",
            "name": "គឹម   ស៊ាន"
        },
        {
            "barcode": "171128617",
            "dpc": "03033319801",
            "name": "មិត  យ៉ុន"
        },
        {
            "barcode": "171128618",
            "dpc": "03033319901",
            "name": "សេង  ភូមិន្ទ"
        },
        {
            "barcode": "171128619",
            "dpc": "03033320001",
            "name": "ទូច សុខហេង"
        },
        {
            "barcode": "171128620",
            "dpc": "03033320101",
            "name": "ម៉ៅ  ឌីណេត"
        },
        {
            "barcode": "171128621",
            "dpc": "03033320201",
            "name": "ប៊ាន  សំណាង"
        },
        {
            "barcode": "171128622",
            "dpc": "03033320301",
            "name": "គង់  ចិន្តា"
        },
        {
            "barcode": "171128623",
            "dpc": "03033320401",
            "name": "ស៊ុន  ពិសិដ្ឋ"
        },
        {
            "barcode": "171128624",
            "dpc": "03033320501",
            "name": "យ៉ាត  ឈួម"
        },
        {
            "barcode": "171128625",
            "dpc": "03033320601",
            "name": "ភួន  ម៉ៅ"
        },
        {
            "barcode": "171128626",
            "dpc": "03033320701",
            "name": "ថោង  ធី"
        },
        {
            "barcode": "171128627",
            "dpc": "03033320801",
            "name": "អ៊ួន  ចំរើន"
        },
        {
            "barcode": "171128628",
            "dpc": "03033320901",
            "name": "គង់  សាវី"
        },
        {
            "barcode": "171128629",
            "dpc": "03033321001",
            "name": "កុយ  កញ្ចនា"
        },
        {
            "barcode": "171128630",
            "dpc": "03033321101",
            "name": "សាយ រីយ៉ា"
        },
        {
            "barcode": "171128631",
            "dpc": "03033321201",
            "name": "តឹង  ចៃ"
        },
        {
            "barcode": "171128632",
            "dpc": "03033321301",
            "name": "វុធ  ធាន"
        },
        {
            "barcode": "171128633",
            "dpc": "03033321401",
            "name": "ហៃម  សឺន"
        },
        {
            "barcode": "171128634",
            "dpc": "03033321501",
            "name": "សេស  សាវ៉ាត"
        },
        {
            "barcode": "171128635",
            "dpc": "03033321601",
            "name": "ចេង  ចំរើន"
        },
        {
            "barcode": "171128636",
            "dpc": "03033321701",
            "name": "អេង សារឿន"
        },
        {
            "barcode": "171128637",
            "dpc": "03033321801",
            "name": "កែវ  ស្រី"
        },
        {
            "barcode": "171128638",
            "dpc": "03033321901",
            "name": "លុយ  ឡី"
        },
        {
            "barcode": "171128639",
            "dpc": "03033322001",
            "name": "លី  ប៊ុនយីន"
        },
        {
            "barcode": "171128640",
            "dpc": "03033322101",
            "name": "ហ៊ុន  យ៉ាន"
        },
        {
            "barcode": "171128641",
            "dpc": "03033322201",
            "name": "យុន  សាវឿន"
        },
        {
            "barcode": "171128642",
            "dpc": "03033322301",
            "name": "សែម  ប៊ុនធឿន"
        },
        {
            "barcode": "171128643",
            "dpc": "03033322401",
            "name": "រស់  វណ្ណរដ្ឋ"
        },
        {
            "barcode": "171128644",
            "dpc": "03033322501",
            "name": "ហ៊ួ  ចណ្ណា"
        },
        {
            "barcode": "171128645",
            "dpc": "03033322601",
            "name": "អ៊ិន  តន"
        },
        {
            "barcode": "171128646",
            "dpc": "03033322701",
            "name": "ហែម  សំអាត"
        },
        {
            "barcode": "171128647",
            "dpc": "03033322801",
            "name": "ស៊ុន  រិទ្ធ"
        },
        {
            "barcode": "171128648",
            "dpc": "03033322901",
            "name": "ឡុង  ប៊ុនថន"
        },
        {
            "barcode": "171128649",
            "dpc": "03033323101",
            "name": "ហៀង  គីមងិន"
        },
        {
            "barcode": "171128650",
            "dpc": "03033323201",
            "name": "តែ  លីដា"
        },
        {
            "barcode": "171128651",
            "dpc": "03033323301",
            "name": "វ៉ង លីហ៊ាង"
        },
        {
            "barcode": "171128652",
            "dpc": "03033323401",
            "name": "ហ៊ាន  មេត្រី"
        },
        {
            "barcode": "171128653",
            "dpc": "03033323501",
            "name": "ជុំ  សុខខេង"
        },
        {
            "barcode": "171128654",
            "dpc": "03033323601",
            "name": "សាន  សារ៉ន"
        },
        {
            "barcode": "171128655",
            "dpc": "03033323701",
            "name": "ទេស  ចំរើន"
        },
        {
            "barcode": "171128656",
            "dpc": "03033323801",
            "name": "លឹម  ដុល្លា"
        },
        {
            "barcode": "171128657",
            "dpc": "03033323901",
            "name": "សុខ  ធី"
        },
        {
            "barcode": "171128658",
            "dpc": "03033324001",
            "name": "ញ៉ែម  ពង់"
        },
        {
            "barcode": "171128659",
            "dpc": "03033324101",
            "name": "ម៉ៅ  រ៉េត"
        },
        {
            "barcode": "171128660",
            "dpc": "03033324201",
            "name": "ងនិ  សារ៉េត"
        },
        {
            "barcode": "171128661",
            "dpc": "03033324301",
            "name": "ឆន  កាក់"
        },
        {
            "barcode": "171128662",
            "dpc": "03033324401",
            "name": "សារ៉េត  វាសនា"
        },
        {
            "barcode": "171128663",
            "dpc": "03033324501",
            "name": "ហួត  ចិន្តា"
        },
        {
            "barcode": "171128664",
            "dpc": "03033324601",
            "name": "តុប  ឌឿន"
        },
        {
            "barcode": "171128665",
            "dpc": "03033324701",
            "name": "វី  សុខចំរើន"
        },
        {
            "barcode": "171128666",
            "dpc": "03033324801",
            "name": "ជៀម  ផែ"
        },
        {
            "barcode": "171128667",
            "dpc": "03033324901",
            "name": "អ៊ុយ  សារ៉ម"
        },
        {
            "barcode": "171128668",
            "dpc": "03033325001",
            "name": "លុយ  ចន្ថា"
        },
        {
            "barcode": "171128669",
            "dpc": "03033325101",
            "name": "ពេជ្រ  វណ្ណះ"
        },
        {
            "barcode": "171128670",
            "dpc": "03033325201",
            "name": "ធូ  សច្ចនា"
        },
        {
            "barcode": "171128671",
            "dpc": "03033325301",
            "name": "ឆេង  លុយ"
        },
        {
            "barcode": "171128672",
            "dpc": "03033325401",
            "name": "ជា  ពៅ"
        },
        {
            "barcode": "171128673",
            "dpc": "03033325601",
            "name": "ទូច  ឆេង"
        },
        {
            "barcode": "171128674",
            "dpc": "03033325701",
            "name": "វី  នាង"
        },
        {
            "barcode": "171128675",
            "dpc": "03033326801",
            "name": "ម៉ន  ឌឿន"
        },
        {
            "barcode": "171128676",
            "dpc": "03033327001",
            "name": "ជោតិ ច័ន្ទចរិយា"
        },
        {
            "barcode": "171128677",
            "dpc": "03033327101",
            "name": "អ៊ីង ចាន់ថាច"
        },
        {
            "barcode": "171128678",
            "dpc": "03033327201",
            "name": "ស ស៊ុយ"
        },
        {
            "barcode": "171128679",
            "dpc": "03033327301",
            "name": "ម៉ម សុខែមរិ"
        },
        {
            "barcode": "171128680",
            "dpc": "03033327401",
            "name": "កែវ គឹមអាយ"
        },
        {
            "barcode": "171128681",
            "dpc": "03033327501",
            "name": "គ្រួច សារើយ"
        },
        {
            "barcode": "171128682",
            "dpc": "03033327601",
            "name": "ពុធ សានី"
        },
        {
            "barcode": "171128683",
            "dpc": "03033327701",
            "name": "ឯម សាម៉េត"
        },
        {
            "barcode": "171128684",
            "dpc": "03033327801",
            "name": "សែម ដា"
        },
        {
            "barcode": "171128685",
            "dpc": "03033327901",
            "name": "កង សុផានី"
        },
        {
            "barcode": "171128686",
            "dpc": "03033328001",
            "name": "ទូច ណារី"
        },
        {
            "barcode": "171128687",
            "dpc": "03033328101",
            "name": "ឡេង សានឿត"
        },
        {
            "barcode": "171128688",
            "dpc": "03033328201",
            "name": "ពេជ្រ វាន់ឌី"
        },
        {
            "barcode": "171128689",
            "dpc": "03033328301",
            "name": "ឃឹម សុជាតិ"
        },
        {
            "barcode": "171128690",
            "dpc": "03033328601",
            "name": "ឃួន ឆិកា"
        },
        {
            "barcode": "171128691",
            "dpc": "03033328701",
            "name": "ឃួន ថុនា"
        },
        {
            "barcode": "171128692",
            "dpc": "03033328801",
            "name": "សែម កៅ"
        },
        {
            "barcode": "171128693",
            "dpc": "03033328901",
            "name": "ហែម ចំរើន"
        },
        {
            "barcode": "171128694",
            "dpc": "03033329001",
            "name": "ឯក កាន"
        },
        {
            "barcode": "171128695",
            "dpc": "03033329201",
            "name": "ឡុង ចិន្តា"
        },
        {
            "barcode": "171128696",
            "dpc": "03033329301",
            "name": "លី ណាវី"
        },
        {
            "barcode": "171128697",
            "dpc": "03033329401",
            "name": "ពង្ស រតន:"
        },
        {
            "barcode": "171128698",
            "dpc": "03033329501",
            "name": "ប៊ិត សារួម"
        },
        {
            "barcode": "171128699",
            "dpc": "03033329601",
            "name": "មុំ ទូច"
        },
        {
            "barcode": "171128700",
            "dpc": "03033329701",
            "name": "កា ចន្ទ័វុទ្ធី"
        },
        {
            "barcode": "171128701",
            "dpc": "03033329801",
            "name": "កា ហុន"
        },
        {
            "barcode": "171128702",
            "dpc": "03033329901",
            "name": "ឡេង ផេង"
        },
        {
            "barcode": "171128703",
            "dpc": "03033330001",
            "name": "គឹម សុប"
        },
        {
            "barcode": "171128704",
            "dpc": "03033330101",
            "name": "អុំ ព្រឿង"
        },
        {
            "barcode": "171128705",
            "dpc": "03033330201",
            "name": "អុំ សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171128706",
            "dpc": "03033330301",
            "name": "សែន ណារ៉ុង"
        },
        {
            "barcode": "171128707",
            "dpc": "03033330401",
            "name": "ងិន សុខុន"
        },
        {
            "barcode": "171128708",
            "dpc": "03033330501",
            "name": "ប៉ិល ចាន់ណារ៉ា"
        },
        {
            "barcode": "171128709",
            "dpc": "03033330601",
            "name": "ឈូក ឆាយា"
        },
        {
            "barcode": "171128710",
            "dpc": "03033330701",
            "name": "លាង ចន្ធូ"
        },
        {
            "barcode": "171128711",
            "dpc": "03033330801",
            "name": "កែវ មុន្នី"
        },
        {
            "barcode": "171128712",
            "dpc": "03033330901",
            "name": "យិន សុផាន"
        },
        {
            "barcode": "171128713",
            "dpc": "03033331001",
            "name": "រ៉ុង ពន្លក"
        },
        {
            "barcode": "171128714",
            "dpc": "03033331101",
            "name": "ហួន ហាន"
        },
        {
            "barcode": "171128715",
            "dpc": "03033331201",
            "name": "គី ប៊ុណ្ណារ៉ា"
        },
        {
            "barcode": "171128716",
            "dpc": "03033331301",
            "name": "ចិត្រ សុវណ្ណនី"
        },
        {
            "barcode": "171128717",
            "dpc": "03033331401",
            "name": "អ៊ូ មីនា"
        },
        {
            "barcode": "171128718",
            "dpc": "03033331501",
            "name": "ហាច យ៉ា"
        },
        {
            "barcode": "171128719",
            "dpc": "03033331601",
            "name": "ស៊ីន ឃីម"
        },
        {
            "barcode": "171128720",
            "dpc": "03033331701",
            "name": "ម៉ក់ សាវុធ"
        },
        {
            "barcode": "171128721",
            "dpc": "03033331801",
            "name": "ឃីវ សុវត្តិ"
        },
        {
            "barcode": "171128722",
            "dpc": "03033331901",
            "name": "ភាជ ឆុន"
        },
        {
            "barcode": "171128723",
            "dpc": "03033332001",
            "name": "ពិន ឌី"
        },
        {
            "barcode": "171128724",
            "dpc": "03033332101",
            "name": "ជាង មនីលីដា"
        },
        {
            "barcode": "171128725",
            "dpc": "03033332201",
            "name": "នួន លៀង"
        },
        {
            "barcode": "171128726",
            "dpc": "03033332301",
            "name": "តឿម ឃ៉ឺត"
        },
        {
            "barcode": "171128727",
            "dpc": "03033332401",
            "name": "យស់ សុផល"
        },
        {
            "barcode": "171128728",
            "dpc": "03033332501",
            "name": "ភួន ឃឿន"
        },
        {
            "barcode": "171128729",
            "dpc": "03033332601",
            "name": "គុយ ធារិន"
        },
        {
            "barcode": "171128730",
            "dpc": "03033332701",
            "name": "សោ វិចិត្រ"
        },
        {
            "barcode": "171128731",
            "dpc": "03033332801",
            "name": "ជា ថូន"
        },
        {
            "barcode": "171128732",
            "dpc": "03033332901",
            "name": "ឈិន ភារុន"
        },
        {
            "barcode": "171128733",
            "dpc": "03033333001",
            "name": "សុខ ឆវី"
        },
        {
            "barcode": "171128734",
            "dpc": "03033333201",
            "name": "ជា វិដេ"
        },
        {
            "barcode": "171128735",
            "dpc": "03033333301",
            "name": "លាង ហាវ"
        },
        {
            "barcode": "171128736",
            "dpc": "03033333601",
            "name": "ព្រហ្ម សុផល"
        },
        {
            "barcode": "171128737",
            "dpc": "03033333701",
            "name": "ឡុង ស៊ីរ៉ាវុធ"
        },
        {
            "barcode": "171128738",
            "dpc": "03033333901",
            "name": "ហុក កុសល"
        },
        {
            "barcode": "171128739",
            "dpc": "03033334101",
            "name": "ភិន សារុន"
        },
        {
            "barcode": "171128740",
            "dpc": "03033334201",
            "name": "ចៅ សុខកឿន"
        },
        {
            "barcode": "171128741",
            "dpc": "03033334301",
            "name": "កែវ សម្បត"
        },
        {
            "barcode": "171128742",
            "dpc": "03033334401",
            "name": "ស៊ុន សុផា ៤"
        },
        {
            "barcode": "171128743",
            "dpc": "03033334501",
            "name": "ស៊ុន សុផា ៣"
        },
        {
            "barcode": "171128744",
            "dpc": "03033334701",
            "name": "សោម សាវ៉ុង"
        },
        {
            "barcode": "171128745",
            "dpc": "03033334801",
            "name": "ខឹម ចៅសែន"
        },
        {
            "barcode": "171128746",
            "dpc": "03033334901",
            "name": "យឿម ចាន់ធី"
        },
        {
            "barcode": "171128747",
            "dpc": "03033335001",
            "name": "យិប វ៉ាន់"
        },
        {
            "barcode": "171128748",
            "dpc": "03033335101",
            "name": "ណាយ នឿន"
        },
        {
            "barcode": "171128749",
            "dpc": "03033335201",
            "name": "ហៀង លីណា"
        },
        {
            "barcode": "171128750",
            "dpc": "03033335301",
            "name": "ឈឿង គឹមសេង"
        },
        {
            "barcode": "171128751",
            "dpc": "03033335501",
            "name": "ប៉ិច រីដា"
        },
        {
            "barcode": "171128752",
            "dpc": "03033335601",
            "name": "សុខ ចន្នី"
        },
        {
            "barcode": "171128753",
            "dpc": "03033335701",
            "name": "សាយ ចន្ធូ"
        },
        {
            "barcode": "171128754",
            "dpc": "03033335801",
            "name": "ហែម សុទ"
        },
        {
            "barcode": "171128755",
            "dpc": "03033335901",
            "name": "គិត សុចន្ទ័ដាវី"
        },
        {
            "barcode": "171128756",
            "dpc": "03033336101",
            "name": "ឆែម សាវន"
        },
        {
            "barcode": "171128757",
            "dpc": "03033336201",
            "name": "ញ៉ែម សុគន្ធា"
        },
        {
            "barcode": "171128758",
            "dpc": "03033336301",
            "name": "មឿន សារ៉ន់"
        },
        {
            "barcode": "171128759",
            "dpc": "03033336401",
            "name": "ផាន់ ចន្រ្ដា"
        },
        {
            "barcode": "171128760",
            "dpc": "03033336501",
            "name": "ឆាន់ រឿន"
        },
        {
            "barcode": "171128761",
            "dpc": "03033336601",
            "name": "ប៉ែន ធិតា"
        },
        {
            "barcode": "171128762",
            "dpc": "03033336701",
            "name": "នូ ចំណុច"
        },
        {
            "barcode": "171128763",
            "dpc": "03033336801",
            "name": "ជា សារ៉ុន"
        },
        {
            "barcode": "171128764",
            "dpc": "03033337001",
            "name": "យ៉ាន បូផៃ"
        },
        {
            "barcode": "171128765",
            "dpc": "03033337101",
            "name": "រិន រ៉ា"
        },
        {
            "barcode": "171128766",
            "dpc": "03033337301",
            "name": "ចែត យ៉ុម"
        },
        {
            "barcode": "171128767",
            "dpc": "03033337401",
            "name": "ពៅ ចរិយា"
        },
        {
            "barcode": "171128768",
            "dpc": "03033337501",
            "name": "ណន វណ្ណនឿន"
        },
        {
            "barcode": "171128769",
            "dpc": "03033337601",
            "name": "ឈឹម សុតា"
        },
        {
            "barcode": "171128770",
            "dpc": "03033337701",
            "name": "ភោគ សុខាត់"
        },
        {
            "barcode": "171128771",
            "dpc": "03033337801",
            "name": "សោម ប្រុស"
        },
        {
            "barcode": "171128772",
            "dpc": "03033337901",
            "name": "ឈិន ណារិទ"
        },
        {
            "barcode": "171128773",
            "dpc": "03033338001",
            "name": "គឹម ភិន"
        },
        {
            "barcode": "171128774",
            "dpc": "03033338101",
            "name": "សាក់ ស"
        },
        {
            "barcode": "171128775",
            "dpc": "03033338201",
            "name": "ទាវ សុផាត"
        },
        {
            "barcode": "171128776",
            "dpc": "03033338301",
            "name": "លី វ៉ានថេត"
        },
        {
            "barcode": "171128777",
            "dpc": "03033338401",
            "name": "រស់ ទីណាល"
        },
        {
            "barcode": "171128778",
            "dpc": "03033338501",
            "name": "យ៉ុង ចិន"
        },
        {
            "barcode": "171128779",
            "dpc": "03033338601",
            "name": "យ៉ា ម៉ៅ"
        },
        {
            "barcode": "171128780",
            "dpc": "03033338701",
            "name": "លឹម ចន្ធី"
        },
        {
            "barcode": "171128781",
            "dpc": "03033338801",
            "name": "ទិត រដ្ឋា"
        },
        {
            "barcode": "171128782",
            "dpc": "03033338901",
            "name": "វ៉ាន់ វ៉ន"
        },
        {
            "barcode": "171128783",
            "dpc": "03033339001",
            "name": "ហុង សៅលន់"
        },
        {
            "barcode": "171128784",
            "dpc": "03033339101",
            "name": "សួន ជៀប"
        },
        {
            "barcode": "171128785",
            "dpc": "03033339201",
            "name": "ទុំ សោផង់"
        },
        {
            "barcode": "171128786",
            "dpc": "03033339301",
            "name": "ស្រៀង គឹមទី"
        },
        {
            "barcode": "171128787",
            "dpc": "03033339401",
            "name": "សូ សារ៉េន"
        },
        {
            "barcode": "171128788",
            "dpc": "03033339501",
            "name": "សៅ ប៊ុនឡា"
        },
        {
            "barcode": "171128789",
            "dpc": "03033339601",
            "name": "ង៉ែត ចន្ធី"
        },
        {
            "barcode": "171128790",
            "dpc": "03033339701",
            "name": "ប៉ុក រុន"
        },
        {
            "barcode": "171128791",
            "dpc": "03033339801",
            "name": "សឿ សារី"
        },
        {
            "barcode": "171128792",
            "dpc": "03033339901",
            "name": "ឡាក់ ម៉ានី"
        },
        {
            "barcode": "171128793",
            "dpc": "03033340101",
            "name": "សន វ៉ាន់"
        },
        {
            "barcode": "171128794",
            "dpc": "03033340201",
            "name": "រិន សំអុល"
        },
        {
            "barcode": "171128795",
            "dpc": "03033340301",
            "name": "អ៊ឹង អ៊ិត១"
        },
        {
            "barcode": "171128796",
            "dpc": "03033340501",
            "name": "ជឺ ពុំ"
        },
        {
            "barcode": "171128797",
            "dpc": "03033340601",
            "name": "ហៃ សាខន"
        },
        {
            "barcode": "171128798",
            "dpc": "03033340701",
            "name": "បៀច សុផល"
        },
        {
            "barcode": "171128799",
            "dpc": "03033340801",
            "name": "ធូ រើន"
        },
        {
            "barcode": "171128800",
            "dpc": "03033340901",
            "name": "គីម យឿប"
        },
        {
            "barcode": "171128801",
            "dpc": "03033341001",
            "name": "សំ ឡុង"
        },
        {
            "barcode": "171128802",
            "dpc": "03033341101",
            "name": "ត្រាំង ចាន់ទួង"
        },
        {
            "barcode": "171128803",
            "dpc": "03033341201",
            "name": "ពុធ វ៉ាន់មុន្នី"
        },
        {
            "barcode": "171128804",
            "dpc": "03033341301",
            "name": "ជីង ហ៊ុយគួង"
        },
        {
            "barcode": "171128805",
            "dpc": "03033341401",
            "name": "យី គក់"
        },
        {
            "barcode": "171128806",
            "dpc": "03033341501",
            "name": "សុខ គង់"
        },
        {
            "barcode": "171128807",
            "dpc": "03033341801",
            "name": "ចាយ ធានី"
        },
        {
            "barcode": "171128808",
            "dpc": "03033341901",
            "name": "វី សាវេន"
        },
        {
            "barcode": "171128809",
            "dpc": "03033342101",
            "name": "ស៊ុត អ៊ួច"
        },
        {
            "barcode": "171128810",
            "dpc": "03033342201",
            "name": "សុត លាភា"
        },
        {
            "barcode": "171128811",
            "dpc": "03033342301",
            "name": "ទី  ឈឿត"
        },
        {
            "barcode": "171128812",
            "dpc": "03033342401",
            "name": "យិន ម៉ាច"
        },
        {
            "barcode": "171128813",
            "dpc": "03033342501",
            "name": "ឈឹម ម៉ារឌី"
        },
        {
            "barcode": "171128814",
            "dpc": "03033342601",
            "name": "ប៉ែន  ម៉ាន"
        },
        {
            "barcode": "171128815",
            "dpc": "03033342701",
            "name": "គឹម ឆវី"
        },
        {
            "barcode": "171128816",
            "dpc": "03033342801",
            "name": "សាំង សុគន្ធា"
        },
        {
            "barcode": "171128817",
            "dpc": "03033342901",
            "name": "សយ មៅ"
        },
        {
            "barcode": "171128818",
            "dpc": "03033343001",
            "name": "ផន ខេម"
        },
        {
            "barcode": "171128819",
            "dpc": "03033343101",
            "name": "រឿន សុធារ៉ា"
        },
        {
            "barcode": "171128820",
            "dpc": "03033343201",
            "name": "សៀង ចន្ធី"
        },
        {
            "barcode": "171128821",
            "dpc": "03033343301",
            "name": "អេ ផល្លា"
        },
        {
            "barcode": "171128822",
            "dpc": "03033343401",
            "name": "តា លិន"
        },
        {
            "barcode": "171128823",
            "dpc": "03033343501",
            "name": "ព្រឿង ចិន្តា"
        },
        {
            "barcode": "171128824",
            "dpc": "03033343601",
            "name": "វ៉ាន់ ចាន់ណូ"
        },
        {
            "barcode": "171128825",
            "dpc": "03033343701",
            "name": "ផល សុវណ្ណ"
        },
        {
            "barcode": "171128826",
            "dpc": "03033343801",
            "name": "អ៊ុំ ពន្លឺ"
        },
        {
            "barcode": "171128827",
            "dpc": "03033343901",
            "name": "ឡឹង បុប្ជា"
        },
        {
            "barcode": "171128828",
            "dpc": "03033344001",
            "name": "ឈឿង ជុំ"
        },
        {
            "barcode": "171128829",
            "dpc": "03033344101",
            "name": "ឈឿត សារួន"
        },
        {
            "barcode": "171128830",
            "dpc": "03033344201",
            "name": "ភន ភាព"
        },
        {
            "barcode": "171128831",
            "dpc": "03033344301",
            "name": "សៀម វុន"
        },
        {
            "barcode": "171128832",
            "dpc": "03033344401",
            "name": "ហូន វ៉ានឌឿន"
        },
        {
            "barcode": "171128833",
            "dpc": "03033344501",
            "name": "ជា កក្តដា"
        },
        {
            "barcode": "171128834",
            "dpc": "03033344601",
            "name": "មាន អក្ខរា"
        },
        {
            "barcode": "171128835",
            "dpc": "03033344701",
            "name": "អ៊ុច រដ្ឋា"
        },
        {
            "barcode": "171128836",
            "dpc": "03033344801",
            "name": "ប៊ុន ទូច"
        },
        {
            "barcode": "171128837",
            "dpc": "03033344901",
            "name": "សួ វណ្ណថន"
        },
        {
            "barcode": "171128838",
            "dpc": "03033345001",
            "name": "ង៉ុយ សុងហ៉ុយ"
        },
        {
            "barcode": "171128839",
            "dpc": "03033345101",
            "name": "ក្រៀល សុភាព"
        },
        {
            "barcode": "171128840",
            "dpc": "03033345201",
            "name": "ខាត់ ថង"
        },
        {
            "barcode": "171128841",
            "dpc": "03033345301",
            "name": "ញ៉ក់ ពីវ"
        },
        {
            "barcode": "171128842",
            "dpc": "03033345401",
            "name": "ស៊ិន យ៉ែម"
        },
        {
            "barcode": "171128843",
            "dpc": "03033345501",
            "name": "អ៊ុំ សុឃឿន"
        },
        {
            "barcode": "171128844",
            "dpc": "03033345601",
            "name": "លី សុធី"
        },
        {
            "barcode": "171128845",
            "dpc": "03033345701",
            "name": "អ៊ុំ ប៊ុនណយ"
        },
        {
            "barcode": "171128846",
            "dpc": "03033345801",
            "name": "ជា ពៅ"
        },
        {
            "barcode": "171128847",
            "dpc": "03033345901",
            "name": "មុំ ឆិល"
        },
        {
            "barcode": "171128848",
            "dpc": "03033346001",
            "name": "ហង្ថ វណ្ណា"
        },
        {
            "barcode": "171128849",
            "dpc": "03033346101",
            "name": "កែវ ខន"
        },
        {
            "barcode": "171128850",
            "dpc": "03033346201",
            "name": "ក្រុមហ៊ុនមិសុតា"
        },
        {
            "barcode": "171128851",
            "dpc": "03033346301",
            "name": "អ៊ុន សុជាតិ"
        },
        {
            "barcode": "171128852",
            "dpc": "03033346401",
            "name": "លី វ៉ាននី"
        },
        {
            "barcode": "171128853",
            "dpc": "03033346501",
            "name": "ប៊ី ចាន់ថា"
        },
        {
            "barcode": "171128854",
            "dpc": "03033346601",
            "name": "យ៉ាង ស៊ត"
        },
        {
            "barcode": "171128855",
            "dpc": "03033346701",
            "name": "នុត ហឿម"
        },
        {
            "barcode": "171128856",
            "dpc": "03033346801",
            "name": "គឹម ផល"
        },
        {
            "barcode": "171128857",
            "dpc": "03033346901",
            "name": "ថាច់ ចិន្តា"
        },
        {
            "barcode": "171128858",
            "dpc": "03033347001",
            "name": "អ៊ុង មិនា"
        },
        {
            "barcode": "171128859",
            "dpc": "03033347101",
            "name": "សែមដា"
        },
        {
            "barcode": "171128860",
            "dpc": "03033347201",
            "name": "លាង ធារី"
        },
        {
            "barcode": "171128861",
            "dpc": "03033347301",
            "name": "ជា ផែន"
        },
        {
            "barcode": "171128862",
            "dpc": "03033347401",
            "name": "ពា ចាន់បូរី"
        },
        {
            "barcode": "171128863",
            "dpc": "03033347501",
            "name": "ស៊ន ចំណាន"
        },
        {
            "barcode": "171128864",
            "dpc": "03033347601",
            "name": "ពា សុផាន"
        },
        {
            "barcode": "171128865",
            "dpc": "03033347701",
            "name": "ប្រុស សារឿន"
        },
        {
            "barcode": "171128866",
            "dpc": "03033347801",
            "name": "បេ ផល"
        },
        {
            "barcode": "171128867",
            "dpc": "03033347901",
            "name": "នួន ចន្ធូ"
        },
        {
            "barcode": "171128868",
            "dpc": "03033348001",
            "name": "ស៊ិន សទ្ធី"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
