let start=moment('2017-12-01').toDate();
let end=moment('2017-12-30').toDate();

let barcodes=
    [
        {
            "barcode": "171127439",
            "dpc": "03043600101",
            "name": "ព្រាប ជាដា"
        },
        {
            "barcode": "171127440",
            "dpc": "03043600301",
            "name": "ធួន រ៉ាវុធ"
        },
        {
            "barcode": "171127441",
            "dpc": "03043600501",
            "name": "ឆៃ សាវ៉ាត"
        },
        {
            "barcode": "171127442",
            "dpc": "03043600701",
            "name": "ហឿន សំរិទ្ធ"
        },
        {
            "barcode": "171127443",
            "dpc": "03043600801",
            "name": "អ៊ឹង សុខុម"
        },
        {
            "barcode": "171127444",
            "dpc": "03043600901",
            "name": "អ៊ី សីហា"
        },
        {
            "barcode": "171127445",
            "dpc": "03043601001",
            "name": "ទាវ លក្ខីណា"
        },
        {
            "barcode": "171127446",
            "dpc": "03043601101",
            "name": "ទ៉ុត សារ៉ាន់"
        },
        {
            "barcode": "171127447",
            "dpc": "03043601201",
            "name": "ឃុត ពៅ"
        },
        {
            "barcode": "171127448",
            "dpc": "03043601301",
            "name": "ទូច ហេង"
        },
        {
            "barcode": "171127449",
            "dpc": "03043601401",
            "name": "សាលាបឋមសិក្សា វត្តគរ"
        },
        {
            "barcode": "171127450",
            "dpc": "03043601501",
            "name": "ម៉ុក យ៉ុន"
        },
        {
            "barcode": "171127451",
            "dpc": "03043601601",
            "name": "ភោគ វង្ស"
        },
        {
            "barcode": "171127452",
            "dpc": "03043601701",
            "name": "ឈន ចិត្រា"
        },
        {
            "barcode": "171127453",
            "dpc": "03043601801",
            "name": "សៅ សុចិត្រ"
        },
        {
            "barcode": "171127454",
            "dpc": "03043601901",
            "name": "នូ អេងសំរិទ្ធ"
        },
        {
            "barcode": "171127455",
            "dpc": "03043602001",
            "name": "យន់ គុំ"
        },
        {
            "barcode": "171127456",
            "dpc": "03043602101",
            "name": "ភួង សា"
        },
        {
            "barcode": "171127457",
            "dpc": "03043602201",
            "name": "ផាន់ ពន្លឺ"
        },
        {
            "barcode": "171127458",
            "dpc": "03043602301",
            "name": "ម៉ុល ឌន"
        },
        {
            "barcode": "171127459",
            "dpc": "03043602401",
            "name": "ហុង ឈឿន"
        },
        {
            "barcode": "171127460",
            "dpc": "03043602601",
            "name": "អោ សំង៉ា"
        },
        {
            "barcode": "171127461",
            "dpc": "03043602701",
            "name": "មឿន ស៊ីថា"
        },
        {
            "barcode": "171127462",
            "dpc": "03043602801",
            "name": "រស់ សុនាថ"
        },
        {
            "barcode": "171127463",
            "dpc": "03043602901",
            "name": "នូ ចិន្តា"
        },
        {
            "barcode": "171127464",
            "dpc": "03043603001",
            "name": "កែវ ធានី"
        },
        {
            "barcode": "171127465",
            "dpc": "03043603101",
            "name": "រ៉ុង សុភ័ក្រ"
        },
        {
            "barcode": "171127466",
            "dpc": "03043603201",
            "name": "លាង តុលា"
        },
        {
            "barcode": "171127467",
            "dpc": "03043603301",
            "name": "លាង សុខហៃ"
        },
        {
            "barcode": "171127468",
            "dpc": "03043603401",
            "name": "សារ៉ាឌី"
        },
        {
            "barcode": "171127469",
            "dpc": "03043603601",
            "name": "លី វ៉ាន់ណូ"
        },
        {
            "barcode": "171127470",
            "dpc": "03043603701",
            "name": "ប៊ុន ចានមុន្មី"
        },
        {
            "barcode": "171127471",
            "dpc": "03043603801",
            "name": "អ៊ុត នាង"
        },
        {
            "barcode": "171127472",
            "dpc": "03043603901",
            "name": "យិន សុខុម"
        },
        {
            "barcode": "171127473",
            "dpc": "03043604001",
            "name": "សំអុន ធារិទ្ធ"
        },
        {
            "barcode": "171127474",
            "dpc": "03043604101",
            "name": "ធូ ចន្ថា"
        },
        {
            "barcode": "171127475",
            "dpc": "03043604401",
            "name": "ប្រុក រី"
        },
        {
            "barcode": "171127476",
            "dpc": "03043604501",
            "name": "ធ្យូង ទូច"
        },
        {
            "barcode": "171127477",
            "dpc": "03043604601",
            "name": "ឡេង សុផល្លី"
        },
        {
            "barcode": "171127478",
            "dpc": "03043604701",
            "name": "ចិន ឆន"
        },
        {
            "barcode": "171127479",
            "dpc": "03043604801",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "171127480",
            "dpc": "03043604901",
            "name": "ថេង សុធៀន"
        },
        {
            "barcode": "171127481",
            "dpc": "03043605101",
            "name": "ឡុង គីម"
        },
        {
            "barcode": "171127482",
            "dpc": "03043605201",
            "name": "វ៉ាន់ ថន"
        },
        {
            "barcode": "171127483",
            "dpc": "03043605301",
            "name": "វណ្ណ ឌី"
        },
        {
            "barcode": "171127484",
            "dpc": "03043605401",
            "name": "គីម ស៊ីវ៉ុង"
        },
        {
            "barcode": "171127485",
            "dpc": "03043605501",
            "name": "នៅ សុវណ្ណីមុនី"
        },
        {
            "barcode": "171127486",
            "dpc": "03043605601",
            "name": "ស៊ីវ ថាច"
        },
        {
            "barcode": "171127487",
            "dpc": "03043605701",
            "name": "ញ៉ែម កេត"
        },
        {
            "barcode": "171127488",
            "dpc": "03043605901",
            "name": "សៅ ដេន"
        },
        {
            "barcode": "171127489",
            "dpc": "03043606001",
            "name": "គីម កុសល់"
        },
        {
            "barcode": "171127490",
            "dpc": "03043606101",
            "name": "លី អ៊ន"
        },
        {
            "barcode": "171127491",
            "dpc": "03043606301",
            "name": "យិន ទី"
        },
        {
            "barcode": "171127492",
            "dpc": "03043606501",
            "name": "លឹម ប៊ុនឈៀង"
        },
        {
            "barcode": "171127493",
            "dpc": "03043606601",
            "name": "ប៉ុល សាវុធ"
        },
        {
            "barcode": "171127494",
            "dpc": "03043606701",
            "name": "ជា លក្ខិណា"
        },
        {
            "barcode": "171127495",
            "dpc": "03043606801",
            "name": "ស្រី សម្បត្តិ"
        },
        {
            "barcode": "171127496",
            "dpc": "03043606901",
            "name": "ប៉ែន ធុច"
        },
        {
            "barcode": "171127497",
            "dpc": "03043607001",
            "name": "វ៉ា គន្ធា"
        },
        {
            "barcode": "171127498",
            "dpc": "03043607101",
            "name": "ហៀង ដារ៉ាវុទ្ធ"
        },
        {
            "barcode": "171127499",
            "dpc": "03043607201",
            "name": "សែម ផល្លី"
        },
        {
            "barcode": "171127500",
            "dpc": "03043607301",
            "name": "សេង លី"
        },
        {
            "barcode": "171127501",
            "dpc": "03043607401",
            "name": "ប្រម រដ្ឋា"
        },
        {
            "barcode": "171127502",
            "dpc": "03043607501",
            "name": "អ៊ឹង ឈុនទ្រី"
        },
        {
            "barcode": "171127503",
            "dpc": "03043607601",
            "name": "សុខ សេរីឃីម"
        },
        {
            "barcode": "171127504",
            "dpc": "03043607701",
            "name": "សុខ សេរីឃីម ២"
        },
        {
            "barcode": "171127505",
            "dpc": "03043607801",
            "name": "ប៉ាវ សៀ"
        },
        {
            "barcode": "171127506",
            "dpc": "03043607901",
            "name": "ឈឹម សារេត"
        },
        {
            "barcode": "171127507",
            "dpc": "03043608001",
            "name": "ឈឿម ឈិន"
        },
        {
            "barcode": "171127508",
            "dpc": "03043608101",
            "name": "ឈឿម ឈាលី"
        },
        {
            "barcode": "171127509",
            "dpc": "03043608201",
            "name": "ម៉ៅ វ៉ាន់"
        },
        {
            "barcode": "171127510",
            "dpc": "03043608301",
            "name": "ភោគ សំអ៊ុន"
        },
        {
            "barcode": "171127511",
            "dpc": "03043608401",
            "name": "ផន ផៃ"
        },
        {
            "barcode": "171127512",
            "dpc": "03043608501",
            "name": "តាំង ចាន់ធី"
        },
        {
            "barcode": "171127513",
            "dpc": "03043608601",
            "name": "លឿម ម៉ៃ"
        },
        {
            "barcode": "171127514",
            "dpc": "03043608701",
            "name": "ចន រចនា"
        },
        {
            "barcode": "171127515",
            "dpc": "03043608801",
            "name": "ឆាត ង៉ា"
        },
        {
            "barcode": "171127516",
            "dpc": "03043608901",
            "name": "ភុំ ភៀង"
        },
        {
            "barcode": "171127517",
            "dpc": "03043609001",
            "name": "ប៉ិច ឆាត"
        },
        {
            "barcode": "171127518",
            "dpc": "03043609101",
            "name": "ឈិន សាមឿន"
        },
        {
            "barcode": "171127519",
            "dpc": "03043609201",
            "name": "ញិប វុទ្ធី"
        },
        {
            "barcode": "171127520",
            "dpc": "03043609401",
            "name": "ភី ណារី"
        },
        {
            "barcode": "171127521",
            "dpc": "03043609501",
            "name": "ភុំ លាភ"
        },
        {
            "barcode": "171127522",
            "dpc": "03043609601",
            "name": "ហ៊ូ ហេង"
        },
        {
            "barcode": "171127523",
            "dpc": "03043609701",
            "name": "ចាប សៀន"
        },
        {
            "barcode": "171127524",
            "dpc": "03043609801",
            "name": "រស់ ស្រីមុំ"
        },
        {
            "barcode": "171127525",
            "dpc": "03043609901",
            "name": "ផេង សុវណ្ណា"
        },
        {
            "barcode": "171127526",
            "dpc": "03043610101",
            "name": "រស់ ហ៊ីម"
        },
        {
            "barcode": "171127527",
            "dpc": "03043610201",
            "name": "ប៉ិ ឆួត"
        },
        {
            "barcode": "171127528",
            "dpc": "03043610301",
            "name": "សុខ រើន"
        },
        {
            "barcode": "171127529",
            "dpc": "03043610401",
            "name": "សឿន ហ៊ីង"
        },
        {
            "barcode": "171127530",
            "dpc": "03043610501",
            "name": "តេង ឆាវស៊ិញ"
        },
        {
            "barcode": "171127531",
            "dpc": "03043610601",
            "name": "លឿង លឿប"
        },
        {
            "barcode": "171127532",
            "dpc": "03043610701",
            "name": "លឿង ពៅ"
        },
        {
            "barcode": "171127533",
            "dpc": "03043610801",
            "name": "ពុន ស៊ីឡុង"
        },
        {
            "barcode": "171127534",
            "dpc": "03043610901",
            "name": "ឈៀង ចំរើន"
        },
        {
            "barcode": "171127535",
            "dpc": "03043611001",
            "name": "ម៉ៅ គន្ធា"
        },
        {
            "barcode": "171127536",
            "dpc": "03043611101",
            "name": "អ៊ូច សារៀង"
        },
        {
            "barcode": "171127537",
            "dpc": "03043611201",
            "name": "លឿម ប៉ក់"
        },
        {
            "barcode": "171127538",
            "dpc": "03043611301",
            "name": "យោគ ធី"
        },
        {
            "barcode": "171127539",
            "dpc": "03043611401",
            "name": "ទូច សាវឿត"
        },
        {
            "barcode": "171127540",
            "dpc": "03043611501",
            "name": "ទូច កែវ"
        },
        {
            "barcode": "171127541",
            "dpc": "03043611601",
            "name": "សុខ សាន្ត"
        },
        {
            "barcode": "171127542",
            "dpc": "03043611701",
            "name": "ឈួន ខឿន"
        },
        {
            "barcode": "171127543",
            "dpc": "03043611801",
            "name": "ប៉ែន ខឿង១"
        },
        {
            "barcode": "171127544",
            "dpc": "03043611901",
            "name": "ប៉ែន ខឿង២"
        },
        {
            "barcode": "171127545",
            "dpc": "03043612001",
            "name": "លី ចាន់ថន"
        },
        {
            "barcode": "171127546",
            "dpc": "03043612101",
            "name": "លឿង សល់"
        },
        {
            "barcode": "171127547",
            "dpc": "03043612301",
            "name": "សោ សារិន"
        },
        {
            "barcode": "171127548",
            "dpc": "03043612401",
            "name": "ឈឹម ភិរម្យ"
        },
        {
            "barcode": "171127549",
            "dpc": "03043612501",
            "name": "ផន ភឿត២"
        },
        {
            "barcode": "171127550",
            "dpc": "03043612701",
            "name": "ឈីវ ស្រេង"
        },
        {
            "barcode": "171127551",
            "dpc": "03043612801",
            "name": "គីន ចំរ៉ុង"
        },
        {
            "barcode": "171127552",
            "dpc": "03043612901",
            "name": "ឆាំ សារឿត"
        },
        {
            "barcode": "171127553",
            "dpc": "03043613001",
            "name": "ណុប មករា"
        },
        {
            "barcode": "171127554",
            "dpc": "03043613101",
            "name": "ម៉ៅ សារ៉ាត់"
        },
        {
            "barcode": "171127555",
            "dpc": "03043613201",
            "name": "សេង សុខឡាង"
        },
        {
            "barcode": "171127556",
            "dpc": "03043613301",
            "name": "ឌឹម សំណាង"
        },
        {
            "barcode": "171127557",
            "dpc": "03043613501",
            "name": "យាន គន្ធា"
        },
        {
            "barcode": "171127558",
            "dpc": "03043613601",
            "name": "តុល ផន"
        },
        {
            "barcode": "171127559",
            "dpc": "03043613701",
            "name": "យាន ធី"
        },
        {
            "barcode": "171127560",
            "dpc": "03043614001",
            "name": "ពាង ឆលៀត"
        },
        {
            "barcode": "171127561",
            "dpc": "03043614201",
            "name": "ងិន ពេញ"
        },
        {
            "barcode": "171127562",
            "dpc": "03043614301",
            "name": "សំ សុខហួន"
        },
        {
            "barcode": "171127563",
            "dpc": "03043614501",
            "name": "យូ គីមហួន"
        },
        {
            "barcode": "171127564",
            "dpc": "03043614601",
            "name": "ម៉ា សុខអេង"
        },
        {
            "barcode": "171127565",
            "dpc": "03043614701",
            "name": "ឃិត ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171127566",
            "dpc": "03043614901",
            "name": "រិនវណ្ណា"
        },
        {
            "barcode": "171127567",
            "dpc": "03043615001",
            "name": "ឡៅ កង"
        },
        {
            "barcode": "171127568",
            "dpc": "03043615101",
            "name": "កង ចាន់ធី"
        },
        {
            "barcode": "171127569",
            "dpc": "03043615301",
            "name": "សាន សិន"
        },
        {
            "barcode": "171127570",
            "dpc": "03043615401",
            "name": "ឡាំ វិញ"
        },
        {
            "barcode": "171127571",
            "dpc": "03043615501",
            "name": "ព្រំ វិបុល"
        },
        {
            "barcode": "171127572",
            "dpc": "03043615701",
            "name": "ដុំ សៅរី"
        },
        {
            "barcode": "171127573",
            "dpc": "03043615801",
            "name": "ផែន សុធា"
        },
        {
            "barcode": "171127574",
            "dpc": "03043615901",
            "name": "ទូច ប៊ុនរិន្ទ"
        },
        {
            "barcode": "171127575",
            "dpc": "03043616001",
            "name": "ជា សុវណ្ណ"
        },
        {
            "barcode": "171127576",
            "dpc": "03043616101",
            "name": "ជា សេតថារី"
        },
        {
            "barcode": "171127577",
            "dpc": "03043616201",
            "name": "នួន បំរ៉ុង"
        },
        {
            "barcode": "171127578",
            "dpc": "03043616301",
            "name": "ឡុង ណាត"
        },
        {
            "barcode": "171127579",
            "dpc": "03043616401",
            "name": "នួន គីមស៊ត"
        },
        {
            "barcode": "171127580",
            "dpc": "03043616501",
            "name": "ហៃ តាវ"
        },
        {
            "barcode": "171127581",
            "dpc": "03043616601",
            "name": "នាល ភី"
        },
        {
            "barcode": "171127582",
            "dpc": "03043616701",
            "name": "សិន គន្ធា"
        },
        {
            "barcode": "171127583",
            "dpc": "03043616801",
            "name": "ម៉ៃ ចន្ថា"
        },
        {
            "barcode": "171127584",
            "dpc": "03043616901",
            "name": "ម៉ម ម៉ុត"
        },
        {
            "barcode": "171127585",
            "dpc": "03043617101",
            "name": "រស់ សុខឿន"
        },
        {
            "barcode": "171127586",
            "dpc": "03043617201",
            "name": "ភាព រតនា"
        },
        {
            "barcode": "171127587",
            "dpc": "03043617301",
            "name": "សឿ សាវ៉ុង"
        },
        {
            "barcode": "171127588",
            "dpc": "03043617401",
            "name": "ឃុត សាឡន"
        },
        {
            "barcode": "171127589",
            "dpc": "03043617501",
            "name": "ឡាច ឡុង"
        },
        {
            "barcode": "171127590",
            "dpc": "03043617601",
            "name": "នៅ នឿត"
        },
        {
            "barcode": "171127591",
            "dpc": "03043617701",
            "name": "ជឹង សុគន្ធ"
        },
        {
            "barcode": "171127592",
            "dpc": "03043617801",
            "name": "ពៅ ណាសៀ"
        },
        {
            "barcode": "171127593",
            "dpc": "03043617901",
            "name": "ចាន់ ម៉េង"
        },
        {
            "barcode": "171127594",
            "dpc": "03043618001",
            "name": "ជូ មុនី"
        },
        {
            "barcode": "171127595",
            "dpc": "03043618101",
            "name": "អៀប សាវ៊ើន"
        },
        {
            "barcode": "171127596",
            "dpc": "03043618201",
            "name": "អៀប សារ៉ាន់"
        },
        {
            "barcode": "171127597",
            "dpc": "03043618401",
            "name": "ឯក វណ្ណថុន"
        },
        {
            "barcode": "171127598",
            "dpc": "03043618501",
            "name": "វិន សាវឹង"
        },
        {
            "barcode": "171127599",
            "dpc": "03043618601",
            "name": "ម្លិះ គឹមបេង"
        },
        {
            "barcode": "171127600",
            "dpc": "03043618701",
            "name": "ហ៊ុន ហុក"
        },
        {
            "barcode": "171127601",
            "dpc": "03043618801",
            "name": "កែវ ប៊ុនធៀន"
        },
        {
            "barcode": "171127602",
            "dpc": "03043618901",
            "name": "សាំង ចន្ថា"
        },
        {
            "barcode": "171127603",
            "dpc": "03043619001",
            "name": "នង សារិទ្ធ"
        },
        {
            "barcode": "171127604",
            "dpc": "03043619101",
            "name": "វ៉ាត សុវណ្ណ"
        },
        {
            "barcode": "171127605",
            "dpc": "03043619201",
            "name": "ហាន ឆឺត"
        },
        {
            "barcode": "171127606",
            "dpc": "03043619301",
            "name": "ញណ ឈឿត"
        },
        {
            "barcode": "171127607",
            "dpc": "03043619401",
            "name": "ឡុង សាវី"
        },
        {
            "barcode": "171127608",
            "dpc": "03043619501",
            "name": "អូច សុខន"
        },
        {
            "barcode": "171127609",
            "dpc": "03043619601",
            "name": "ជុំ បណ្តូរ"
        },
        {
            "barcode": "171127610",
            "dpc": "03043619701",
            "name": "នូវ ឆេន"
        },
        {
            "barcode": "171127611",
            "dpc": "03043619901",
            "name": "បាន សល់"
        },
        {
            "barcode": "171127612",
            "dpc": "03043620001",
            "name": "ខ្វា សាយ"
        },
        {
            "barcode": "171127613",
            "dpc": "03043620101",
            "name": "សេន អេសអារី"
        },
        {
            "barcode": "171127614",
            "dpc": "03043620201",
            "name": "ប្រក ណារេត"
        },
        {
            "barcode": "171127615",
            "dpc": "03043620301",
            "name": "ហូត សម្ជស្ស"
        },
        {
            "barcode": "171127616",
            "dpc": "03043620401",
            "name": "ធី សារ៉េន"
        },
        {
            "barcode": "171127617",
            "dpc": "03043620501",
            "name": "ធាន កុយ"
        },
        {
            "barcode": "171127618",
            "dpc": "03043620601",
            "name": "សួ ខេង"
        },
        {
            "barcode": "171127619",
            "dpc": "03043620701",
            "name": "ប្រាក់ ម៉ាល័យ"
        },
        {
            "barcode": "171127620",
            "dpc": "03043620801",
            "name": "ជុំ ចាន់ហ៊ន"
        },
        {
            "barcode": "171127621",
            "dpc": "03043620901",
            "name": "ចាន់ សុភាព"
        },
        {
            "barcode": "171127622",
            "dpc": "03043621001",
            "name": "តាន់ សឺឡាង"
        },
        {
            "barcode": "171127623",
            "dpc": "03043621101",
            "name": "ចាន់ ឈឹមសុវណ្ណរិទ្ធ"
        },
        {
            "barcode": "171127624",
            "dpc": "03043621201",
            "name": "ស៊ុត រ៉ូន"
        },
        {
            "barcode": "171127625",
            "dpc": "03043621301",
            "name": "សែម ខុំ"
        },
        {
            "barcode": "171127626",
            "dpc": "03043621501",
            "name": "ហួត គឿន"
        },
        {
            "barcode": "171127627",
            "dpc": "03043621601",
            "name": "រ៉ុង ដារ៉ា"
        },
        {
            "barcode": "171127628",
            "dpc": "03043621701",
            "name": "ឈឿន ឈៀត"
        },
        {
            "barcode": "171127629",
            "dpc": "03043621801",
            "name": "ឈឹម សុធា"
        },
        {
            "barcode": "171127630",
            "dpc": "03043621901",
            "name": "ឈឹម សុភា"
        },
        {
            "barcode": "171127631",
            "dpc": "03043622001",
            "name": "សារួន"
        },
        {
            "barcode": "171127632",
            "dpc": "03043622101",
            "name": "កែន សារ៉ុន"
        },
        {
            "barcode": "171127633",
            "dpc": "03043622201",
            "name": "មិត្ត សាខន"
        },
        {
            "barcode": "171127634",
            "dpc": "03043622301",
            "name": "វិន រស់"
        },
        {
            "barcode": "171127635",
            "dpc": "03043622401",
            "name": "អ៊ី សុផល"
        },
        {
            "barcode": "171127636",
            "dpc": "03043622501",
            "name": "អឿ ភាព"
        },
        {
            "barcode": "171127637",
            "dpc": "03043622701",
            "name": "ហ្វារ៉ុម មីយ៉ាន"
        },
        {
            "barcode": "171127638",
            "dpc": "03043622801",
            "name": "ឡោះ ហ៊ឺ"
        },
        {
            "barcode": "171127639",
            "dpc": "03043622901",
            "name": "ឡោះ យ៉ាន"
        },
        {
            "barcode": "171127640",
            "dpc": "03043623001",
            "name": "ដារី"
        },
        {
            "barcode": "171127641",
            "dpc": "03043623101",
            "name": "ម៉ាន សារី"
        },
        {
            "barcode": "171127642",
            "dpc": "03043623301",
            "name": "ផែ សុគុម"
        },
        {
            "barcode": "171127643",
            "dpc": "03043623401",
            "name": "សិម សារីយ៉ាស់"
        },
        {
            "barcode": "171127644",
            "dpc": "03043623501",
            "name": "យ៉ាន់ ណូ"
        },
        {
            "barcode": "171127645",
            "dpc": "03043623701",
            "name": "ញ៉ុក សុខា"
        },
        {
            "barcode": "171127646",
            "dpc": "03043623901",
            "name": "រុន សារី"
        },
        {
            "barcode": "171127647",
            "dpc": "03043624001",
            "name": "ហុង ស្រេង"
        },
        {
            "barcode": "171127648",
            "dpc": "03043624101",
            "name": "រេន សុខារ៉ា"
        },
        {
            "barcode": "171127649",
            "dpc": "03043624201",
            "name": "ស៊ុម សុគន្ធ"
        },
        {
            "barcode": "171127650",
            "dpc": "03043624301",
            "name": "ឡុច រស្មី"
        },
        {
            "barcode": "171127651",
            "dpc": "03043624401",
            "name": "ឡាច រដ្ឋ"
        },
        {
            "barcode": "171127652",
            "dpc": "03043624601",
            "name": "អ៊ិត ធីតា"
        },
        {
            "barcode": "171127653",
            "dpc": "03043624701",
            "name": "ទែន រស្មី"
        },
        {
            "barcode": "171127654",
            "dpc": "03043624801",
            "name": "សៅរ សម្បូណ៍"
        },
        {
            "barcode": "171127655",
            "dpc": "03043624901",
            "name": "ប៉ិល ថនស៊ី"
        },
        {
            "barcode": "171127656",
            "dpc": "03043625001",
            "name": "កង សុខា"
        },
        {
            "barcode": "171127657",
            "dpc": "03043625101",
            "name": "កង សុធា"
        },
        {
            "barcode": "171127658",
            "dpc": "03043625201",
            "name": "រិទ្ធ សួម"
        },
        {
            "barcode": "171127659",
            "dpc": "03043625301",
            "name": "ហេង ប៉ិច"
        },
        {
            "barcode": "171127660",
            "dpc": "03043625401",
            "name": "រី រ៉ូន"
        },
        {
            "barcode": "171127661",
            "dpc": "03043625501",
            "name": "អេ ភាព"
        },
        {
            "barcode": "171127662",
            "dpc": "03043625601",
            "name": "ពត ភាព"
        },
        {
            "barcode": "171127663",
            "dpc": "03043625701",
            "name": "ហែម ភីរម្យ"
        },
        {
            "barcode": "171127664",
            "dpc": "03043625801",
            "name": "អឿន រី"
        },
        {
            "barcode": "171127665",
            "dpc": "03043625901",
            "name": "ញាំ សាវេត"
        },
        {
            "barcode": "171127666",
            "dpc": "03043626001",
            "name": "ថាំង សុផា"
        },
        {
            "barcode": "171127667",
            "dpc": "03043626101",
            "name": "ជន គ្រី"
        },
        {
            "barcode": "171127668",
            "dpc": "03043626201",
            "name": "ជន សារ៉េត"
        },
        {
            "barcode": "171127669",
            "dpc": "03043626301",
            "name": "ជន សារេន"
        },
        {
            "barcode": "171127670",
            "dpc": "03043626401",
            "name": "ផាន សំអុល"
        },
        {
            "barcode": "171127671",
            "dpc": "03043626501",
            "name": "ឌុក វន"
        },
        {
            "barcode": "171127672",
            "dpc": "03043626601",
            "name": "សាន បូរេត"
        },
        {
            "barcode": "171127673",
            "dpc": "03043626701",
            "name": "សួន ពៅ"
        },
        {
            "barcode": "171127674",
            "dpc": "03043626801",
            "name": "កុប តុលា"
        },
        {
            "barcode": "171127675",
            "dpc": "03043626901",
            "name": "ឈិន ចន្ថា"
        },
        {
            "barcode": "171127676",
            "dpc": "03043627001",
            "name": "សុខ ប៊ុនដារ៉ា"
        },
        {
            "barcode": "171127677",
            "dpc": "03043627101",
            "name": "រឿម សាវៃ"
        },
        {
            "barcode": "171127678",
            "dpc": "03043627201",
            "name": "អុង ណារ៉ន"
        },
        {
            "barcode": "171127679",
            "dpc": "03043627301",
            "name": "អ៊ុយ ហួន"
        },
        {
            "barcode": "171127680",
            "dpc": "03043627401",
            "name": "នីន សោភ័ណ្ឌ"
        },
        {
            "barcode": "171127681",
            "dpc": "03043627601",
            "name": "សូ ជា"
        },
        {
            "barcode": "171127682",
            "dpc": "03043627701",
            "name": "រិទ្ធ បុណ្ណា"
        },
        {
            "barcode": "171127683",
            "dpc": "03043627801",
            "name": "ជា សុផល"
        },
        {
            "barcode": "171127684",
            "dpc": "03043627901",
            "name": "វ៉ាន់ សម្បត្តិ"
        },
        {
            "barcode": "171127685",
            "dpc": "03043628001",
            "name": "ឡី តង"
        },
        {
            "barcode": "171127686",
            "dpc": "03043628101",
            "name": "គីម សេង"
        },
        {
            "barcode": "171127687",
            "dpc": "03043628201",
            "name": "អែម សុខា"
        },
        {
            "barcode": "171127688",
            "dpc": "03043628501",
            "name": "លុយ សុវណ្ណ"
        },
        {
            "barcode": "171127689",
            "dpc": "03043628601",
            "name": "សរ ណាវី"
        },
        {
            "barcode": "171127690",
            "dpc": "03043628701",
            "name": "រស់ សេងហុង"
        },
        {
            "barcode": "171127691",
            "dpc": "03043628801",
            "name": "តេង វឿត"
        },
        {
            "barcode": "171127692",
            "dpc": "03043628901",
            "name": "អ៊ុត ឡាវ"
        },
        {
            "barcode": "171127693",
            "dpc": "03043629101",
            "name": "ទេព ស៊ឹម"
        },
        {
            "barcode": "171127694",
            "dpc": "03043629201",
            "name": "ម៉ែន ប៊ុនហឿន"
        },
        {
            "barcode": "171127695",
            "dpc": "03043629301",
            "name": "មៀច ចំរើន"
        },
        {
            "barcode": "171127696",
            "dpc": "03043629401",
            "name": "កែវ ឡឹក"
        },
        {
            "barcode": "171127697",
            "dpc": "03043629501",
            "name": "អ៊ឹង ផល្គុន"
        },
        {
            "barcode": "171127698",
            "dpc": "03043629601",
            "name": "ហុក វុទ្ធី"
        },
        {
            "barcode": "171127699",
            "dpc": "03043629701",
            "name": "ស៊ីវន ខេមរុន"
        },
        {
            "barcode": "171127700",
            "dpc": "03043629801",
            "name": "ជូន សុភាព"
        },
        {
            "barcode": "171127701",
            "dpc": "03043629901",
            "name": "ឡម គង់"
        },
        {
            "barcode": "171127702",
            "dpc": "03043630001",
            "name": "យឿម ដារ៉ា"
        },
        {
            "barcode": "171127703",
            "dpc": "03043630101",
            "name": "បឿន ភាព"
        },
        {
            "barcode": "171127704",
            "dpc": "03043630201",
            "name": "ស៊ន​ លី"
        },
        {
            "barcode": "171127705",
            "dpc": "03043630301",
            "name": "ឯល ដា"
        },
        {
            "barcode": "171127706",
            "dpc": "03043630401",
            "name": "រៀប សារៀង"
        },
        {
            "barcode": "171127707",
            "dpc": "03043630501",
            "name": "លួម ណារី"
        },
        {
            "barcode": "171127708",
            "dpc": "03043630601",
            "name": "នឿន រិទ្ជ"
        },
        {
            "barcode": "171127709",
            "dpc": "03043630701",
            "name": "យឺន បុប្ឋា"
        },
        {
            "barcode": "171127710",
            "dpc": "03043631001",
            "name": "ឃីន សឿន"
        },
        {
            "barcode": "171127711",
            "dpc": "03043631201",
            "name": "ប៉ាល សុភឿត"
        },
        {
            "barcode": "171127712",
            "dpc": "03043631301",
            "name": "អិន វីរ៉ា"
        },
        {
            "barcode": "171127713",
            "dpc": "03043631401",
            "name": "យើ មាន"
        },
        {
            "barcode": "171127714",
            "dpc": "03043631501",
            "name": "ហែម សារ៉ន"
        },
        {
            "barcode": "171127715",
            "dpc": "03043631601",
            "name": "វ៉ាន់ នៅ"
        },
        {
            "barcode": "171127716",
            "dpc": "03043631801",
            "name": "នេត វណ្ណៈ"
        },
        {
            "barcode": "171127717",
            "dpc": "03043631901",
            "name": "ង៉ោល សឿង"
        },
        {
            "barcode": "171127718",
            "dpc": "03043632001",
            "name": "អីវ ឡុញ"
        },
        {
            "barcode": "171127719",
            "dpc": "03043632101",
            "name": "ចេក លួង"
        },
        {
            "barcode": "171127720",
            "dpc": "03043632201",
            "name": "សុខ ឡេង"
        },
        {
            "barcode": "171127721",
            "dpc": "03043632301",
            "name": "សេង បូទុំ"
        },
        {
            "barcode": "171127722",
            "dpc": "03043632401",
            "name": "មេត សុធី"
        },
        {
            "barcode": "171127723",
            "dpc": "03043632501",
            "name": "យី ជាល"
        },
        {
            "barcode": "171127724",
            "dpc": "03043632601",
            "name": "នន់ ណង់"
        },
        {
            "barcode": "171127725",
            "dpc": "03043632701",
            "name": "ឡង សារិទ្ធ"
        },
        {
            "barcode": "171127726",
            "dpc": "03043632801",
            "name": "ភិន ភេន"
        },
        {
            "barcode": "171127727",
            "dpc": "03043632901",
            "name": "មិត្ត តាំ"
        },
        {
            "barcode": "171127728",
            "dpc": "03043633001",
            "name": "ចែម ស៊ីនួន"
        },
        {
            "barcode": "171127729",
            "dpc": "03043633101",
            "name": "សុង សាយ"
        },
        {
            "barcode": "171127730",
            "dpc": "03043633201",
            "name": "ប៉ុល សុភា"
        },
        {
            "barcode": "171127731",
            "dpc": "03043633301",
            "name": "សែម សាវ៉ាត"
        },
        {
            "barcode": "171127732",
            "dpc": "03043633401",
            "name": "លឿង សុឃីម"
        },
        {
            "barcode": "171127733",
            "dpc": "03043633601",
            "name": "លិវ សារ៉ូ"
        },
        {
            "barcode": "171127734",
            "dpc": "03043633701",
            "name": "ម៉ៃ ភុ"
        },
        {
            "barcode": "171127735",
            "dpc": "03043633801",
            "name": "សិន ផល្លី"
        },
        {
            "barcode": "171127736",
            "dpc": "03043633901",
            "name": "អុំ ណាវុធ"
        },
        {
            "barcode": "171127737",
            "dpc": "03043634001",
            "name": "សឹង មុំ"
        },
        {
            "barcode": "171127738",
            "dpc": "03043634101",
            "name": "ចាយ​ ពៅ"
        },
        {
            "barcode": "171127739",
            "dpc": "03043634201",
            "name": "ចាន់ សុភី"
        },
        {
            "barcode": "171127740",
            "dpc": "03043634301",
            "name": "ធី ចាន់ភា"
        },
        {
            "barcode": "171127741",
            "dpc": "03043634401",
            "name": "សុគន្ធ ណារី"
        },
        {
            "barcode": "171127742",
            "dpc": "03043634501",
            "name": "ជា សំអាត"
        },
        {
            "barcode": "171127743",
            "dpc": "03043634601",
            "name": "ជា ផល្លី"
        },
        {
            "barcode": "171127744",
            "dpc": "03043634701",
            "name": "ឌិប រ៉ាវុធ"
        },
        {
            "barcode": "171127745",
            "dpc": "03043634801",
            "name": "ឌិប សាតុន"
        },
        {
            "barcode": "171127746",
            "dpc": "03043634901",
            "name": "សួស ផល្លី"
        },
        {
            "barcode": "171127747",
            "dpc": "03043635101",
            "name": "ស្រី ម៉ៅ"
        },
        {
            "barcode": "171127748",
            "dpc": "03043635201",
            "name": "គឹម ផារុណ"
        },
        {
            "barcode": "171127749",
            "dpc": "03043635301",
            "name": "ហែម នីម"
        },
        {
            "barcode": "171127750",
            "dpc": "03043635401",
            "name": "ឈុន ប៊ុនសុវណ្ណ"
        },
        {
            "barcode": "171127751",
            "dpc": "03043635501",
            "name": "ណែត"
        },
        {
            "barcode": "171127752",
            "dpc": "03043635601",
            "name": "តាម វៃ២"
        },
        {
            "barcode": "171127753",
            "dpc": "03043635701",
            "name": "ម៉ុត សួន"
        },
        {
            "barcode": "171127754",
            "dpc": "03043635801",
            "name": "មាស ផល្លា"
        },
        {
            "barcode": "171127755",
            "dpc": "03043636001",
            "name": "អ៊ុយ យូន"
        },
        {
            "barcode": "171127756",
            "dpc": "03043636101",
            "name": "ស្រី ចន្ធូ"
        },
        {
            "barcode": "171127757",
            "dpc": "03043636201",
            "name": "ស្រី ចិន្តា"
        },
        {
            "barcode": "171127758",
            "dpc": "03043636301",
            "name": "ថោង ចន្ថា"
        },
        {
            "barcode": "171127759",
            "dpc": "03043636401",
            "name": "អ៊ុក បួន"
        },
        {
            "barcode": "171127760",
            "dpc": "03043636501",
            "name": "កូវ សាវ៉ន"
        },
        {
            "barcode": "171127761",
            "dpc": "03043636601",
            "name": "មួន សរិទ្ធ"
        },
        {
            "barcode": "171127762",
            "dpc": "03043636701",
            "name": "ហង្ស ហេង"
        },
        {
            "barcode": "171127763",
            "dpc": "03043636801",
            "name": "ភួង ស៊ីយ៉ុន"
        },
        {
            "barcode": "171127764",
            "dpc": "03043636901",
            "name": "ជិន យឿន"
        },
        {
            "barcode": "171127765",
            "dpc": "03043637001",
            "name": "អុំ លន់អេង"
        },
        {
            "barcode": "171127766",
            "dpc": "03043637101",
            "name": "អុំ រ៉ា"
        },
        {
            "barcode": "171127767",
            "dpc": "03043637201",
            "name": "ម៉ម សំណាង"
        },
        {
            "barcode": "171127768",
            "dpc": "03043637301",
            "name": "នៅ សុធា"
        },
        {
            "barcode": "171127769",
            "dpc": "03043637501",
            "name": "ណុប សាមិ"
        },
        {
            "barcode": "171127770",
            "dpc": "03043637601",
            "name": "គង់ ឡេង"
        },
        {
            "barcode": "171127771",
            "dpc": "03043637701",
            "name": "ម៉ារិន ឧត្តមឆៃ"
        },
        {
            "barcode": "171127772",
            "dpc": "03043637801",
            "name": "សុះ មីន"
        },
        {
            "barcode": "171127773",
            "dpc": "03043637901",
            "name": "ស្រី សោភណ័្ឌ"
        },
        {
            "barcode": "171127774",
            "dpc": "03043638001",
            "name": "ជិន ឆន"
        },
        {
            "barcode": "171127775",
            "dpc": "03043638101",
            "name": "ថោ ចាន់ណា"
        },
        {
            "barcode": "171127776",
            "dpc": "03043638201",
            "name": "ស៊ុន ទូច"
        },
        {
            "barcode": "171127777",
            "dpc": "03043638301",
            "name": "ម៉ី ឡុញ"
        },
        {
            "barcode": "171127778",
            "dpc": "03043638401",
            "name": "កាន់ ទ្រី"
        },
        {
            "barcode": "171127779",
            "dpc": "03043638501",
            "name": "គីម វ៉ាន់"
        },
        {
            "barcode": "171127780",
            "dpc": "03043638701",
            "name": "កែវ ចន្ថា"
        },
        {
            "barcode": "171127781",
            "dpc": "03043638801",
            "name": "កែវ នេត"
        },
        {
            "barcode": "171127782",
            "dpc": "03043639001",
            "name": "អែម ពុធថា"
        },
        {
            "barcode": "171127783",
            "dpc": "03043639101",
            "name": "ខុន សុខេន"
        },
        {
            "barcode": "171127784",
            "dpc": "03043639201",
            "name": "ចាន់ សុមាលី"
        },
        {
            "barcode": "171127785",
            "dpc": "03043639301",
            "name": "ម៉ុន ម៉ុត"
        },
        {
            "barcode": "171127786",
            "dpc": "03043639401",
            "name": "ថោង រី"
        },
        {
            "barcode": "171127787",
            "dpc": "03043639501",
            "name": "ពុំ វណ្ណរ័ត្ន"
        },
        {
            "barcode": "171127788",
            "dpc": "03043639601",
            "name": "រិន រចនា"
        },
        {
            "barcode": "171127789",
            "dpc": "03043639701",
            "name": "ផាត់ ផារិម"
        },
        {
            "barcode": "171127790",
            "dpc": "03043639801",
            "name": "សៀង អូន"
        },
        {
            "barcode": "171127791",
            "dpc": "03043639901",
            "name": "ងិន ភន"
        },
        {
            "barcode": "171127792",
            "dpc": "03043640001",
            "name": "ទុំ ផាន់ណា"
        },
        {
            "barcode": "171127793",
            "dpc": "03043640101",
            "name": "ពឿន ធី"
        },
        {
            "barcode": "171127794",
            "dpc": "03043640201",
            "name": "ប្រឹង បី"
        },
        {
            "barcode": "171127795",
            "dpc": "03043640301",
            "name": "លន់ សុខុន"
        },
        {
            "barcode": "171127796",
            "dpc": "03043640501",
            "name": "ក្រិច ឡុង"
        },
        {
            "barcode": "171127797",
            "dpc": "03043640601",
            "name": "ប្រាក់ ដារីន"
        },
        {
            "barcode": "171127798",
            "dpc": "03043640701",
            "name": "ផាន់ ផារី"
        },
        {
            "barcode": "171127799",
            "dpc": "03043640801",
            "name": "ចក់ យូវ"
        },
        {
            "barcode": "171127800",
            "dpc": "03043640901",
            "name": "រាជ យន់"
        },
        {
            "barcode": "171127801",
            "dpc": "03043641001",
            "name": "អ៊ួ សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171127802",
            "dpc": "03043641101",
            "name": "លន់ វ៉ា"
        },
        {
            "barcode": "171127803",
            "dpc": "03043641201",
            "name": "សៅ សុធា"
        },
        {
            "barcode": "171127804",
            "dpc": "03043641301",
            "name": "ប៉ិល សារិម"
        },
        {
            "barcode": "171127805",
            "dpc": "03043641401",
            "name": "ធុយ ធី"
        },
        {
            "barcode": "171127806",
            "dpc": "03043641501",
            "name": "លន់ សំណាង"
        },
        {
            "barcode": "171127807",
            "dpc": "03043641901",
            "name": "ម៉ាត់ ប៉ាកៀត"
        },
        {
            "barcode": "171127808",
            "dpc": "03043642001",
            "name": "ឡប សារ៉ាត់"
        },
        {
            "barcode": "171127809",
            "dpc": "03043642101",
            "name": "ប៊ុត ហុល"
        },
        {
            "barcode": "171127810",
            "dpc": "03043642301",
            "name": "ឌុច ឌឿន"
        },
        {
            "barcode": "171127811",
            "dpc": "03043642401",
            "name": "ជីម សារ៉ាយ"
        },
        {
            "barcode": "171127812",
            "dpc": "03043642501",
            "name": "រិទ្ធ សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171127813",
            "dpc": "03043642601",
            "name": "អ៊ុក ធា"
        },
        {
            "barcode": "171127814",
            "dpc": "03043642701",
            "name": "ឡុច វ៉ាន"
        },
        {
            "barcode": "171127815",
            "dpc": "03043642801",
            "name": "ទេស ប៉ិច"
        },
        {
            "barcode": "171127816",
            "dpc": "03043642901",
            "name": "ហៃ គឹមហ៊ូ"
        },
        {
            "barcode": "171127817",
            "dpc": "03043643001",
            "name": "ទេស ពៅ"
        },
        {
            "barcode": "171127818",
            "dpc": "03043643101",
            "name": "ម៉ក់ ហឿម"
        },
        {
            "barcode": "171127819",
            "dpc": "03043643201",
            "name": "ការទ័រហ្វាស៊ី"
        },
        {
            "barcode": "171127820",
            "dpc": "03043643301",
            "name": "ម៉ាន ហាលី"
        },
        {
            "barcode": "171127821",
            "dpc": "03043643401",
            "name": "ស្មាន ហ្សារី"
        },
        {
            "barcode": "171127822",
            "dpc": "03043643501",
            "name": "លី ស៊ូគី"
        },
        {
            "barcode": "171127823",
            "dpc": "03043643601",
            "name": "កែវ យើ"
        },
        {
            "barcode": "171127824",
            "dpc": "03043643701",
            "name": "យួប ហាប់ស្រស់"
        },
        {
            "barcode": "171127825",
            "dpc": "03043643801",
            "name": "មីន ទីកាស់"
        },
        {
            "barcode": "171127826",
            "dpc": "03043643901",
            "name": "ឡឹប ខឡេស"
        },
        {
            "barcode": "171127827",
            "dpc": "03043644001",
            "name": "ម៉ាត់ សារីហាស់"
        },
        {
            "barcode": "171127828",
            "dpc": "03043644101",
            "name": "នី អាស់ម៉ាត់"
        },
        {
            "barcode": "171127829",
            "dpc": "03043644201",
            "name": "រស់ ម៉ារី"
        },
        {
            "barcode": "171127830",
            "dpc": "03043644301",
            "name": "ម៉ី ពោ"
        },
        {
            "barcode": "171127831",
            "dpc": "03043644401",
            "name": "ឡោះ ហាំ"
        },
        {
            "barcode": "171127832",
            "dpc": "03043644501",
            "name": "ម៉ាន សុខា"
        },
        {
            "barcode": "171127833",
            "dpc": "03043644601",
            "name": "រ៉ិត រ៉ូសេត"
        },
        {
            "barcode": "171127834",
            "dpc": "03043644701",
            "name": "នាក់ រ៉ូសេត"
        },
        {
            "barcode": "171127835",
            "dpc": "03043644801",
            "name": "សេន ស៊ូហ្វីយ៉ាន"
        },
        {
            "barcode": "171127836",
            "dpc": "03043644901",
            "name": "សេន ស្មារី"
        },
        {
            "barcode": "171127837",
            "dpc": "03043645001",
            "name": "តូន ហ្វាឌីឡាស់"
        },
        {
            "barcode": "171127838",
            "dpc": "03043645101",
            "name": "កូប តាស់"
        },
        {
            "barcode": "171127839",
            "dpc": "03043645201",
            "name": "ម៉ិល ខុម"
        },
        {
            "barcode": "171127840",
            "dpc": "03043645301",
            "name": "សោះ អាពីឌះ"
        },
        {
            "barcode": "171127841",
            "dpc": "03043645401",
            "name": "យុន យីម"
        },
        {
            "barcode": "171127842",
            "dpc": "03043645501",
            "name": "កើ ម៉ាត់សេត"
        },
        {
            "barcode": "171127843",
            "dpc": "03043645701",
            "name": "សានិត វិសាល"
        },
        {
            "barcode": "171127844",
            "dpc": "03043645801",
            "name": "កែវ ហួយ"
        },
        {
            "barcode": "171127845",
            "dpc": "03043646001",
            "name": "រដ្ឋ ធានី"
        },
        {
            "barcode": "171127846",
            "dpc": "03043646101",
            "name": "គឹម ហ៊ួ"
        },
        {
            "barcode": "171127847",
            "dpc": "03043646201",
            "name": "ហ្ស៊ី ហ្គេ"
        },
        {
            "barcode": "171127848",
            "dpc": "03043646301",
            "name": "យ៉ម ពៅ"
        },
        {
            "barcode": "171127849",
            "dpc": "03043646401",
            "name": "យន់ គឹមយ៉ុន"
        },
        {
            "barcode": "171127850",
            "dpc": "03043646501",
            "name": "អ៊ឺង គឹមស៊ន"
        },
        {
            "barcode": "171127851",
            "dpc": "03043646801",
            "name": "ចាន់ តុន"
        },
        {
            "barcode": "171127852",
            "dpc": "03043647101",
            "name": "ជា ប៊ុនលី"
        },
        {
            "barcode": "171127853",
            "dpc": "03043647201",
            "name": "យ៉ង សំនៀង"
        },
        {
            "barcode": "171127854",
            "dpc": "03043647301",
            "name": "យ៉ម សារិន"
        },
        {
            "barcode": "171127855",
            "dpc": "03043647401",
            "name": "ដាំ ឈឿយ"
        },
        {
            "barcode": "171127856",
            "dpc": "03043647501",
            "name": "វ៉ាន់ សុខា"
        },
        {
            "barcode": "171127857",
            "dpc": "03043647601",
            "name": "សោ ចំរើន"
        },
        {
            "barcode": "171127858",
            "dpc": "03043647701",
            "name": "ហូ សុខហេង"
        },
        {
            "barcode": "171127859",
            "dpc": "03043647901",
            "name": "សុខ លីន"
        },
        {
            "barcode": "171127860",
            "dpc": "03043648001",
            "name": "សម្បត្តិ រ៉ា"
        },
        {
            "barcode": "171127861",
            "dpc": "03043648101",
            "name": "គង់ សម្បត្តិ"
        },
        {
            "barcode": "171127862",
            "dpc": "03043648201",
            "name": "ហឹម ភឿត"
        },
        {
            "barcode": "171127863",
            "dpc": "03043648301",
            "name": "គង់ ចាន់ធី"
        },
        {
            "barcode": "171127864",
            "dpc": "03043648401",
            "name": "គង់ រ៉ាត់"
        },
        {
            "barcode": "171127865",
            "dpc": "03043648501",
            "name": "គង់ ចាន់ទី"
        },
        {
            "barcode": "171127866",
            "dpc": "03043648601",
            "name": "ខៀវ សុផាន"
        },
        {
            "barcode": "171127867",
            "dpc": "03043648701",
            "name": "ជូន ញឹប"
        },
        {
            "barcode": "171127868",
            "dpc": "03043648801",
            "name": "ពិន រឿត"
        },
        {
            "barcode": "171127869",
            "dpc": "03043648901",
            "name": "ពិន ព្រែក"
        },
        {
            "barcode": "171127870",
            "dpc": "03043649001",
            "name": "ស៊ិន រាត់"
        },
        {
            "barcode": "171127871",
            "dpc": "03043649201",
            "name": "ពិន វុធ"
        },
        {
            "barcode": "171127872",
            "dpc": "03043649301",
            "name": "ពិន ទួច"
        },
        {
            "barcode": "171127873",
            "dpc": "03043649401",
            "name": "យ៉ន សៅលី"
        },
        {
            "barcode": "171127874",
            "dpc": "03043649501",
            "name": "ខេម រៈ"
        },
        {
            "barcode": "171127875",
            "dpc": "03043649601",
            "name": "ពិន សាម៉ន"
        },
        {
            "barcode": "171127876",
            "dpc": "03043649801",
            "name": "ពិន ចាន់រី"
        },
        {
            "barcode": "171127877",
            "dpc": "03043650001",
            "name": "ណាវ អមរិណ"
        },
        {
            "barcode": "171127878",
            "dpc": "03043650101",
            "name": "ស៊ិន មុំ"
        },
        {
            "barcode": "171127879",
            "dpc": "03043650201",
            "name": "ចាន់ សាវី"
        },
        {
            "barcode": "171127880",
            "dpc": "03043650301",
            "name": "ឈុំ ភាន់"
        },
        {
            "barcode": "171127881",
            "dpc": "03043650401",
            "name": "សំ ចន្តិា"
        },
        {
            "barcode": "171127882",
            "dpc": "03043650501",
            "name": "ចាន់ នី"
        },
        {
            "barcode": "171127883",
            "dpc": "03043650601",
            "name": "នក់ សុភាន់"
        },
        {
            "barcode": "171127884",
            "dpc": "03043650701",
            "name": "រ៉ាយ ចិន្តា"
        },
        {
            "barcode": "171127885",
            "dpc": "03043650801",
            "name": "ប៉ា សុហេង"
        },
        {
            "barcode": "171127886",
            "dpc": "03043650901",
            "name": "សយ សារេម"
        },
        {
            "barcode": "171127887",
            "dpc": "03043651001",
            "name": "ប៉ន វិចិត្រ"
        },
        {
            "barcode": "171127888",
            "dpc": "03043651101",
            "name": "ប៉ន ស្រីឡុច"
        },
        {
            "barcode": "171127889",
            "dpc": "03043651301",
            "name": "ងួន សុជាតា"
        },
        {
            "barcode": "171127890",
            "dpc": "03043651401",
            "name": "ប៉ន សុផានី"
        },
        {
            "barcode": "171127891",
            "dpc": "03043651501",
            "name": "ស្រូច ចាន់នី"
        },
        {
            "barcode": "171127892",
            "dpc": "03043651601",
            "name": "ស្រូច ចាន់ណា"
        },
        {
            "barcode": "171127893",
            "dpc": "03043651701",
            "name": "អុំ ធីម"
        },
        {
            "barcode": "171127894",
            "dpc": "03043651801",
            "name": "ឈឿម ម៉ារី"
        },
        {
            "barcode": "171127895",
            "dpc": "03043651901",
            "name": "ចាន់ រឿន"
        },
        {
            "barcode": "171127896",
            "dpc": "03043652001",
            "name": "ចាន់ សំណាង"
        },
        {
            "barcode": "171127897",
            "dpc": "03043652101",
            "name": "មុត ស៊ីណា"
        },
        {
            "barcode": "171127898",
            "dpc": "03043652201",
            "name": "កែវ សារៀន"
        },
        {
            "barcode": "171127899",
            "dpc": "03043652301",
            "name": "ង៉ា រៀង"
        },
        {
            "barcode": "171127900",
            "dpc": "03043652401",
            "name": "ញ៉ន គង្គា"
        },
        {
            "barcode": "171127901",
            "dpc": "03043652501",
            "name": "វុន វុទ្ធី"
        },
        {
            "barcode": "171127902",
            "dpc": "03043652601",
            "name": "ចាន់ រ៉ាត់"
        },
        {
            "barcode": "171127903",
            "dpc": "03043652701",
            "name": "ឈឿ សភាសិត"
        },
        {
            "barcode": "171127904",
            "dpc": "03043652801",
            "name": "ហេង ស៊ីម"
        },
        {
            "barcode": "171127905",
            "dpc": "03043652901",
            "name": "ហេង ទ្រី"
        },
        {
            "barcode": "171127906",
            "dpc": "03043653001",
            "name": "យិន ប៉ុន"
        },
        {
            "barcode": "171127907",
            "dpc": "03043653101",
            "name": "ឆោម ឆន"
        },
        {
            "barcode": "171127908",
            "dpc": "03043653201",
            "name": "ហម ថង"
        },
        {
            "barcode": "171127909",
            "dpc": "03043653301",
            "name": "ភាជ ភឿត"
        },
        {
            "barcode": "171127910",
            "dpc": "03043653401",
            "name": "អៀង ណារិន"
        },
        {
            "barcode": "171127911",
            "dpc": "03043653501",
            "name": "សួង តារ៉ា"
        },
        {
            "barcode": "171127912",
            "dpc": "03043653601",
            "name": "ផិត ផាន់ណា"
        },
        {
            "barcode": "171127913",
            "dpc": "03043653701",
            "name": "ភាជ សំបូរ"
        },
        {
            "barcode": "171127914",
            "dpc": "03043653801",
            "name": "យឹម ស៊ាប"
        },
        {
            "barcode": "171127915",
            "dpc": "03043653901",
            "name": "យ៉ែម សាវី"
        },
        {
            "barcode": "171127916",
            "dpc": "03043654101",
            "name": "ណយ សុភី"
        },
        {
            "barcode": "171127917",
            "dpc": "03043654001",
            "name": "ណយ សាន់"
        },
        {
            "barcode": "171127918",
            "dpc": "03043654201",
            "name": "ញឹក សាវេត"
        },
        {
            "barcode": "171127919",
            "dpc": "03043654401",
            "name": "វ៉ាត ឆាត"
        },
        {
            "barcode": "171127920",
            "dpc": "03043654501",
            "name": "ស្រី សំអឿន"
        },
        {
            "barcode": "171127921",
            "dpc": "03043654601",
            "name": "ហ៊ឹម ហ៊ីង"
        },
        {
            "barcode": "171127922",
            "dpc": "03043654701",
            "name": "កោ សេរីវឌ្ឍន៍"
        },
        {
            "barcode": "171127923",
            "dpc": "03043654801",
            "name": "ឌិត ណូក"
        },
        {
            "barcode": "171127924",
            "dpc": "03043654901",
            "name": "ណ ណាល់"
        },
        {
            "barcode": "171127925",
            "dpc": "03043655001",
            "name": "មាស់ សឿត"
        },
        {
            "barcode": "171127926",
            "dpc": "03043655101",
            "name": "អ៊ិត សុផានី"
        },
        {
            "barcode": "171127927",
            "dpc": "03043655201",
            "name": "សោម សិលា"
        },
        {
            "barcode": "171127928",
            "dpc": "03043655301",
            "name": "អង វើន"
        },
        {
            "barcode": "171127929",
            "dpc": "03043655401",
            "name": "សេង សំអុល"
        },
        {
            "barcode": "171127930",
            "dpc": "03043655501",
            "name": "ផាន់ ពីសី"
        },
        {
            "barcode": "171127931",
            "dpc": "03043655601",
            "name": "ជិន រៀប"
        },
        {
            "barcode": "171127932",
            "dpc": "03043655701",
            "name": "ណ ណាវ"
        },
        {
            "barcode": "171127933",
            "dpc": "03043655801",
            "name": "ជិត រិន"
        },
        {
            "barcode": "171127934",
            "dpc": "03043655901",
            "name": "លន់ ម៉ាប់"
        },
        {
            "barcode": "171127935",
            "dpc": "03043656001",
            "name": "សុង ចាន់"
        },
        {
            "barcode": "171127936",
            "dpc": "03043656101",
            "name": "ជាតិ"
        },
        {
            "barcode": "171127937",
            "dpc": "03043656201",
            "name": "គង់ លក្ខិណា"
        },
        {
            "barcode": "171127938",
            "dpc": "03043656301",
            "name": "សេង ងយ"
        },
        {
            "barcode": "171127939",
            "dpc": "03043656501",
            "name": "គង់ ហេងងួន"
        },
        {
            "barcode": "171127940",
            "dpc": "03043656601",
            "name": "ឈឿម សភាព"
        },
        {
            "barcode": "171127941",
            "dpc": "03043656701",
            "name": "ឈិត ចាន់ថន"
        },
        {
            "barcode": "171127942",
            "dpc": "03043656801",
            "name": "រ៉ាវុធ អូលិវីយ៉េ"
        },
        {
            "barcode": "171127943",
            "dpc": "03043656901",
            "name": "រើន វុឌ្ឃី"
        },
        {
            "barcode": "171127944",
            "dpc": "03043657001",
            "name": "ពេទ្យ សាវិន"
        },
        {
            "barcode": "171127945",
            "dpc": "03043657101",
            "name": "ឆាយ សាវន"
        },
        {
            "barcode": "171127946",
            "dpc": "03043657201",
            "name": "ជួប វុតថា"
        },
        {
            "barcode": "171127947",
            "dpc": "03043657301",
            "name": "ឆូត ឆុង"
        },
        {
            "barcode": "171127948",
            "dpc": "03043657401",
            "name": "យី វិរៈ"
        },
        {
            "barcode": "171127949",
            "dpc": "03043657501",
            "name": "រិន គឹមលី"
        },
        {
            "barcode": "171127950",
            "dpc": "03043657601",
            "name": "រ៉ែម រ៉ាន់"
        },
        {
            "barcode": "171127951",
            "dpc": "03043657701",
            "name": "ឡាយ វន"
        },
        {
            "barcode": "171127952",
            "dpc": "03043657801",
            "name": "ទុយ ជា"
        },
        {
            "barcode": "171127953",
            "dpc": "03043657901",
            "name": "សំ ផាណន"
        },
        {
            "barcode": "171127954",
            "dpc": "03043658001",
            "name": "ជន សុភក្រ័"
        },
        {
            "barcode": "171127955",
            "dpc": "03043658101",
            "name": "ស្រឿ គឹមស៊ា"
        },
        {
            "barcode": "171127956",
            "dpc": "03043658301",
            "name": "សន ស៊ីផាត"
        },
        {
            "barcode": "171127957",
            "dpc": "03043658501",
            "name": "ស៊ីន សុភ័ក្រ្ត"
        },
        {
            "barcode": "171127958",
            "dpc": "03043658601",
            "name": "ព្រឿង សារ៉ាន"
        },
        {
            "barcode": "171127959",
            "dpc": "03043658701",
            "name": "រ៉ាន់ រ៉ឿត"
        },
        {
            "barcode": "171127960",
            "dpc": "03043658801",
            "name": "គង់ ទូច"
        },
        {
            "barcode": "171127961",
            "dpc": "03043658901",
            "name": "គង់ ដាវីម៉ូណ៉ែត"
        },
        {
            "barcode": "171127962",
            "dpc": "03043659001",
            "name": "អ៊ឹង ឡេងហ៊ាង"
        },
        {
            "barcode": "171127963",
            "dpc": "03043659101",
            "name": "គង់ រតនៈសម្បត្តិ"
        },
        {
            "barcode": "171127964",
            "dpc": "03043659201",
            "name": "ប៊ុន សំនៀង"
        },
        {
            "barcode": "171127965",
            "dpc": "03043659301",
            "name": "គង់ សំណាង"
        },
        {
            "barcode": "171127966",
            "dpc": "03043659401",
            "name": "រស់ ចំរើន"
        },
        {
            "barcode": "171127967",
            "dpc": "03043659501",
            "name": "ជី តុងងួន"
        },
        {
            "barcode": "171127968",
            "dpc": "03043659701",
            "name": "ស្រ៊ីង រតនា"
        },
        {
            "barcode": "171127969",
            "dpc": "03043659801",
            "name": "គឹម ភឿន"
        },
        {
            "barcode": "171127970",
            "dpc": "03043659901",
            "name": "សួស សារឿន"
        },
        {
            "barcode": "171127971",
            "dpc": "03043660001",
            "name": "ហួយ ចិត្រា"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
