let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=
[
        {
            "barcode": "171105208",
            "dpc": "03010302201",
            "name": "ងឿន រិទ្ធ"
        },
        {
            "barcode": "171105209",
            "dpc": "03010302301",
            "name": "ហេង សុផល"
        },
        {
            "barcode": "171105210",
            "dpc": "03010302501",
            "name": "ធាវ  អ៊ិត"
        },
        {
            "barcode": "171105211",
            "dpc": "03010302701",
            "name": "វណ្ណា ដា"
        },
        {
            "barcode": "171105212",
            "dpc": "03010302801",
            "name": "ភន សុខា"
        },
        {
            "barcode": "171105213",
            "dpc": "03010302901",
            "name": "សួស សុខភាព"
        },
        {
            "barcode": "171105214",
            "dpc": "03010303001",
            "name": "សុខ ជា"
        },
        {
            "barcode": "171105215",
            "dpc": "03010303101",
            "name": "ស៊ាន ហ៊ុល"
        },
        {
            "barcode": "171105216",
            "dpc": "03010303201",
            "name": "គា យ៉ាន"
        },
        {
            "barcode": "171105217",
            "dpc": "03010303301",
            "name": "រស់ សារ៉េត"
        },
        {
            "barcode": "171105218",
            "dpc": "03010303401",
            "name": "ចាន់ សុខឡេង"
        },
        {
            "barcode": "171105219",
            "dpc": "03010303501",
            "name": "យឹម សាវ៉ាត"
        },
        {
            "barcode": "171105220",
            "dpc": "03010303601",
            "name": "មុត សារឿន"
        },
        {
            "barcode": "171105221",
            "dpc": "03010303701",
            "name": "សេង អាន"
        },
        {
            "barcode": "171105222",
            "dpc": "03010303901",
            "name": "សេក អៀង"
        },
        {
            "barcode": "171105223",
            "dpc": "03010303801",
            "name": "អ៊ិត ស៊ីធា"
        },
        {
            "barcode": "171105224",
            "dpc": "03010304001",
            "name": "អែម គឹមស៊ុន"
        },
        {
            "barcode": "171105225",
            "dpc": "03010304101",
            "name": "ទាវ អ៊ុយសឹង"
        },
        {
            "barcode": "171105226",
            "dpc": "03010304201",
            "name": "អែម ប៊ុនណាត"
        },
        {
            "barcode": "171105227",
            "dpc": "03010304301",
            "name": "ង៉ែត វុទ្ធី"
        },
        {
            "barcode": "171105228",
            "dpc": "03010304401",
            "name": "ឡាច ម៉ាន់"
        },
        {
            "barcode": "171105229",
            "dpc": "03010304601",
            "name": "ចាន់ សំបូរ"
        },
        {
            "barcode": "171105230",
            "dpc": "03010304701",
            "name": "ទាន់ សម័យ"
        },
        {
            "barcode": "171105231",
            "dpc": "03010304801",
            "name": "គឹម បូរី"
        },
        {
            "barcode": "171105232",
            "dpc": "03010305001",
            "name": "ទិត ជិន"
        },
        {
            "barcode": "171105233",
            "dpc": "03010333401",
            "name": "អ៊ីវ អមរា"
        },
        {
            "barcode": "171105234",
            "dpc": "03010333501",
            "name": "ឃី ធារ៉ា"
        },
        {
            "barcode": "171105235",
            "dpc": "03010333601",
            "name": "គង់ ហ៊ាន"
        },
        {
            "barcode": "171105236",
            "dpc": "03010333701",
            "name": "អាត ទីត ១"
        },
        {
            "barcode": "171105237",
            "dpc": "03010333801",
            "name": "អាត ទីត ២"
        },
        {
            "barcode": "171105238",
            "dpc": "03010333901",
            "name": "ថង ជី"
        },
        {
            "barcode": "171105239",
            "dpc": "03010334001",
            "name": "អៀប សាវឿត"
        },
        {
            "barcode": "171105240",
            "dpc": "03010334201",
            "name": "អ៊ឹប លឿត ១"
        },
        {
            "barcode": "171105241",
            "dpc": "03010334301",
            "name": "ហ៊ឹង ចំរើន"
        },
        {
            "barcode": "171105242",
            "dpc": "03010334401",
            "name": "ជា​ សុធា"
        },
        {
            "barcode": "171105243",
            "dpc": "03010334501",
            "name": "ស៊ិន ឈៀន"
        },
        {
            "barcode": "171105244",
            "dpc": "03010334601",
            "name": "ចែក ប៊ុនឈៀង"
        },
        {
            "barcode": "171105245",
            "dpc": "03010334801",
            "name": "រ័ត្ន វ៉ាន់ថា"
        },
        {
            "barcode": "171105246",
            "dpc": "03010334901",
            "name": "សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171105247",
            "dpc": "03010335001",
            "name": "លាស់ សុទ្ធ២"
        },
        {
            "barcode": "171105248",
            "dpc": "03010335101",
            "name": "លាស់ សុទ្ធ ២"
        },
        {
            "barcode": "171105249",
            "dpc": "03010335201",
            "name": "ម៉េង ហ៊ាង"
        },
        {
            "barcode": "171105250",
            "dpc": "03010335301",
            "name": "ឈុន លី"
        },
        {
            "barcode": "171105251",
            "dpc": "03010335401",
            "name": "វ៉ាត វ៉ារីម"
        },
        {
            "barcode": "171105252",
            "dpc": "03010335501",
            "name": "ពួក   លីហាក់"
        },
        {
            "barcode": "171105253",
            "dpc": "03010335601",
            "name": "សឹង ខូច"
        },
        {
            "barcode": "171105254",
            "dpc": "03010335701",
            "name": "ហេង ផាន់"
        },
        {
            "barcode": "171105255",
            "dpc": "03010335801",
            "name": "សឹង ង៉ុយ"
        },
        {
            "barcode": "171105256",
            "dpc": "03010335901",
            "name": "តាំង ម៉េង"
        },
        {
            "barcode": "171105257",
            "dpc": "03010336001",
            "name": "ប៉ូ សុខអេង"
        },
        {
            "barcode": "171105258",
            "dpc": "03010336101",
            "name": "ឈុន ណៃ"
        },
        {
            "barcode": "171105259",
            "dpc": "03010336201",
            "name": "ប៉ូ ស៊ុនទាក"
        },
        {
            "barcode": "171105260",
            "dpc": "03010336301",
            "name": "ទ្រី ម៉េងឡាយ"
        },
        {
            "barcode": "171105261",
            "dpc": "03010336401",
            "name": "សេង សុភា"
        },
        {
            "barcode": "171105262",
            "dpc": "03010336501",
            "name": "សេម ម៉ារីន"
        },
        {
            "barcode": "171105263",
            "dpc": "03010336601",
            "name": "ស៊ុយ ងិន"
        },
        {
            "barcode": "171105264",
            "dpc": "03010336701",
            "name": "យឹក ចន្ធី"
        },
        {
            "barcode": "171105265",
            "dpc": "03010336801",
            "name": "អោម ពិសិទ្ធ"
        },
        {
            "barcode": "171105266",
            "dpc": "03010336901",
            "name": "ឈៀង ហាក"
        },
        {
            "barcode": "171105267",
            "dpc": "03010337001",
            "name": "អ៊ឹម លឿត"
        },
        {
            "barcode": "171105268",
            "dpc": "03010337101",
            "name": "គុជ ជ"
        },
        {
            "barcode": "171105269",
            "dpc": "03010337301",
            "name": "ប៊ុន វណ្ណា"
        },
        {
            "barcode": "171105270",
            "dpc": "03010337401",
            "name": "សេម ចំរ៉ាត់"
        },
        {
            "barcode": "171105271",
            "dpc": "03010337501",
            "name": "ខី ហ៊ត"
        },
        {
            "barcode": "171105272",
            "dpc": "03010337601",
            "name": "លន់ សៀន"
        },
        {
            "barcode": "171105273",
            "dpc": "03010337701",
            "name": "ទ្រី ម៉េង"
        },
        {
            "barcode": "171105274",
            "dpc": "03010337901",
            "name": "ឃុន ដាលាង"
        },
        {
            "barcode": "171105275",
            "dpc": "03010338001",
            "name": "តាន់ សុផល"
        },
        {
            "barcode": "171105276",
            "dpc": "03010338101",
            "name": "ទិត សំពាក្យ"
        },
        {
            "barcode": "171105277",
            "dpc": "03010338201",
            "name": "សយ ហ៊ាង"
        },
        {
            "barcode": "171105278",
            "dpc": "03010338301",
            "name": "ទិត កៀត"
        },
        {
            "barcode": "171105279",
            "dpc": "03010304501",
            "name": "ង៉ែត ឈី"
        },
        {
            "barcode": "171105280",
            "dpc": "03010306001",
            "name": "គី មឿន"
        },
        {
            "barcode": "171105281",
            "dpc": "03010306101",
            "name": "អនសុខម៉ាលភាព ១"
        },
        {
            "barcode": "171105282",
            "dpc": "03010305601",
            "name": "លឹម ស៊ីណាត"
        },
        {
            "barcode": "171105283",
            "dpc": "03010305801",
            "name": "សុខ ចាន់ថា"
        },
        {
            "barcode": "171105284",
            "dpc": "03010305701",
            "name": "ងិន អូន"
        },
        {
            "barcode": "171105285",
            "dpc": "03010305901",
            "name": "ទី ហ៊ាង"
        },
        {
            "barcode": "171105286",
            "dpc": "03010306201",
            "name": "ចាន់ ទូច"
        },
        {
            "barcode": "171105287",
            "dpc": "03010306301",
            "name": "វ៉ាន់ គ្រី"
        },
        {
            "barcode": "171105288",
            "dpc": "03010306401",
            "name": "ទេស ឃឿន"
        },
        {
            "barcode": "171105289",
            "dpc": "03010306701",
            "name": "ឡៃ ស៊ីម"
        },
        {
            "barcode": "171105290",
            "dpc": "03010306501",
            "name": "ឌុន វុទ្ធី"
        },
        {
            "barcode": "171105291",
            "dpc": "03010306601",
            "name": "ហង សារៀប"
        },
        {
            "barcode": "171105292",
            "dpc": "03010306901",
            "name": "បង ណាក់"
        },
        {
            "barcode": "171105293",
            "dpc": "03010306801",
            "name": "វ៉ាន់ សុឆិន"
        },
        {
            "barcode": "171105294",
            "dpc": "03010307001",
            "name": "ភួង គឹមស៊ុន"
        },
        {
            "barcode": "171105295",
            "dpc": "03010307101",
            "name": "ស៊ូ ប៊ុនសុំ"
        },
        {
            "barcode": "171105296",
            "dpc": "03010307201",
            "name": "ចាប សំណាង ២"
        },
        {
            "barcode": "171105297",
            "dpc": "03010307301",
            "name": "នៀត"
        },
        {
            "barcode": "171105298",
            "dpc": "03010307401",
            "name": "អ៊ុំ យ៉ា"
        },
        {
            "barcode": "171105299",
            "dpc": "03010307501",
            "name": "ទ្រៀង វិន"
        },
        {
            "barcode": "171105300",
            "dpc": "03010307601",
            "name": "ទ្រឿង វុទ្ធា"
        },
        {
            "barcode": "171105301",
            "dpc": "03010307701",
            "name": "ចាប សំណាង ១"
        },
        {
            "barcode": "171105302",
            "dpc": "03010307801",
            "name": "រូត  ប៉ូលីន"
        },
        {
            "barcode": "171105303",
            "dpc": "03010307901",
            "name": "គឹម សារ៉ាន់"
        },
        {
            "barcode": "171105304",
            "dpc": "03010308001",
            "name": "ព្រុំ សាវន"
        },
        {
            "barcode": "171105305",
            "dpc": "03010308101",
            "name": "និវ  ណន"
        },
        {
            "barcode": "171105306",
            "dpc": "03010308201",
            "name": "យឿម យ៉េង"
        },
        {
            "barcode": "171105307",
            "dpc": "03010308301",
            "name": "ថោង ប្រានី"
        },
        {
            "barcode": "171105308",
            "dpc": "03010308401",
            "name": "ផន សាលីន"
        },
        {
            "barcode": "171105309",
            "dpc": "03010305201",
            "name": "ម៉េង សុឡាតា"
        },
        {
            "barcode": "171105310",
            "dpc": "03010305301",
            "name": "អន ផល្លា"
        },
        {
            "barcode": "171105311",
            "dpc": "03010305501",
            "name": "ម៉ម ស្រីរដ្ឋ"
        },
        {
            "barcode": "171105312",
            "dpc": "03010305401",
            "name": "អោក ចានធឿន ១"
        },
        {
            "barcode": "171105313",
            "dpc": "03010309501",
            "name": "ទូច មន្នី"
        },
        {
            "barcode": "171105314",
            "dpc": "03010309601",
            "name": "ហ៊ី ហ៊ីង"
        },
        {
            "barcode": "171105315",
            "dpc": "03010309701",
            "name": "ជា ចន្យា"
        },
        {
            "barcode": "171105316",
            "dpc": "03010309801",
            "name": "ជា សេត"
        },
        {
            "barcode": "171105317",
            "dpc": "03010309901",
            "name": "ស៊ូ សឿន"
        },
        {
            "barcode": "171105318",
            "dpc": "03010310001",
            "name": "យិន ហ៊ាង"
        },
        {
            "barcode": "171105319",
            "dpc": "03010310101",
            "name": "មុំ សេង"
        },
        {
            "barcode": "171105320",
            "dpc": "03010310201",
            "name": "ស៊ុយ  មុំ"
        },
        {
            "barcode": "171105321",
            "dpc": "03010310401",
            "name": "ហេង រ៉ាឌី"
        },
        {
            "barcode": "171105322",
            "dpc": "03010310501",
            "name": "យ៉ា ខឿប"
        },
        {
            "barcode": "171105323",
            "dpc": "03010310601",
            "name": "ហុង សាខឿន"
        },
        {
            "barcode": "171105324",
            "dpc": "03010310701",
            "name": "គិត ម៉េងហាក់"
        },
        {
            "barcode": "171105325",
            "dpc": "03010310801",
            "name": "ហេង សុផាត"
        },
        {
            "barcode": "171105326",
            "dpc": "03010310901",
            "name": "ហេង សុភាព"
        },
        {
            "barcode": "171105327",
            "dpc": "03010311001",
            "name": "ង៉ាត វ៉ានថា"
        },
        {
            "barcode": "171105328",
            "dpc": "03010309401",
            "name": "រស់ កិត្យា"
        },
        {
            "barcode": "171105329",
            "dpc": "03010311101",
            "name": "ព្រះវិហារគ្រីះបរិសុទ្ធ"
        },
        {
            "barcode": "171105330",
            "dpc": "03010311201",
            "name": "អ៊ិត ឃឿត"
        },
        {
            "barcode": "171105331",
            "dpc": "03010311301",
            "name": "ដើង ស៊ីថា"
        },
        {
            "barcode": "171105332",
            "dpc": "03010311401",
            "name": "ហួត ចានថង"
        },
        {
            "barcode": "171105333",
            "dpc": "03010311501",
            "name": "ហួត ចាន់ស៊ី"
        },
        {
            "barcode": "171105334",
            "dpc": "03010311601",
            "name": "ជឺ  បុទុំ"
        },
        {
            "barcode": "171105335",
            "dpc": "03010311701",
            "name": "កែវ សំអឿន"
        },
        {
            "barcode": "171105336",
            "dpc": "03010311801",
            "name": "ទូច សឿន"
        },
        {
            "barcode": "171105337",
            "dpc": "03010311901",
            "name": "ចុង ស៊ីន"
        },
        {
            "barcode": "171105338",
            "dpc": "03010312001",
            "name": "អាត វណ្ណា ១"
        },
        {
            "barcode": "171105339",
            "dpc": "03010312101",
            "name": "សេង គួន"
        },
        {
            "barcode": "171105340",
            "dpc": "03010312301",
            "name": "យោក ស៊ីផុន"
        },
        {
            "barcode": "171105341",
            "dpc": "03010312401",
            "name": "អាត់ វណ្ណា ២"
        },
        {
            "barcode": "171105342",
            "dpc": "03010312501",
            "name": "វណ្ណា  រ៉េ ១"
        },
        {
            "barcode": "171105343",
            "dpc": "03010312601",
            "name": "ថន ច្ឆា"
        },
        {
            "barcode": "171105344",
            "dpc": "03010312701",
            "name": "ឆាត់ ឆាយឆដា១"
        },
        {
            "barcode": "171105345",
            "dpc": "03010312801",
            "name": "វ៉ន យួង"
        },
        {
            "barcode": "171105346",
            "dpc": "03010312901",
            "name": "ជ័យ សុផាត"
        },
        {
            "barcode": "171105347",
            "dpc": "03010313001",
            "name": "អ៊ុន សាវ៉ុន"
        },
        {
            "barcode": "171105348",
            "dpc": "03010313101",
            "name": "សុខ ចំរើន"
        },
        {
            "barcode": "171105349",
            "dpc": "03010313201",
            "name": "រី សុធារ៉ា"
        },
        {
            "barcode": "171105350",
            "dpc": "03010313301",
            "name": "តិច សេង"
        },
        {
            "barcode": "171105351",
            "dpc": "03010313401",
            "name": "តិច ស៊ាង"
        },
        {
            "barcode": "171105352",
            "dpc": "03010313501",
            "name": "អោម នៅ"
        },
        {
            "barcode": "171105353",
            "dpc": "03010313601",
            "name": "ខុង កវី"
        },
        {
            "barcode": "171105354",
            "dpc": "03010313801",
            "name": "ចាន សុខលីន"
        },
        {
            "barcode": "171105355",
            "dpc": "03010313901",
            "name": "តា ហេង"
        },
        {
            "barcode": "171105356",
            "dpc": "03010314001",
            "name": "គួច  ម៉ារី ១"
        },
        {
            "barcode": "171105357",
            "dpc": "03010314101",
            "name": "គួច  ម៉ារី ២"
        },
        {
            "barcode": "171105358",
            "dpc": "03010314201",
            "name": "ហេង សន"
        },
        {
            "barcode": "171105359",
            "dpc": "03010314301",
            "name": "ឡាញ់ ម៉ុងទី"
        },
        {
            "barcode": "171105360",
            "dpc": "03010331301",
            "name": "អ៊ុយ សុខុម"
        },
        {
            "barcode": "171105361",
            "dpc": "03010331401",
            "name": "ហ៊ាង អូន"
        },
        {
            "barcode": "171105362",
            "dpc": "03010331501",
            "name": "នុត សារុន"
        },
        {
            "barcode": "171105363",
            "dpc": "03010331601",
            "name": "នុត សារិទ្ធ"
        },
        {
            "barcode": "171105364",
            "dpc": "03010331701",
            "name": "មាស សុភិន ១"
        },
        {
            "barcode": "171105365",
            "dpc": "03010331801",
            "name": "មាស សុភិន ២"
        },
        {
            "barcode": "171105366",
            "dpc": "03010331901",
            "name": "ហូរ ប៊ុនហេង"
        },
        {
            "barcode": "171105367",
            "dpc": "03010332001",
            "name": "ហុង ចាន់នី"
        },
        {
            "barcode": "171105368",
            "dpc": "03010332101",
            "name": "ងិន សុជា"
        },
        {
            "barcode": "171105369",
            "dpc": "03010332201",
            "name": "តាំង ហុង"
        },
        {
            "barcode": "171105370",
            "dpc": "03010332301",
            "name": "ប៉ាវ សុភាព"
        },
        {
            "barcode": "171105371",
            "dpc": "03010332501",
            "name": "ជា ចាន់ថា"
        },
        {
            "barcode": "171105372",
            "dpc": "03010332601",
            "name": "ឈុំ ហៀង"
        },
        {
            "barcode": "171105373",
            "dpc": "03010332801",
            "name": "កែវ ពិសិទ្ធ"
        },
        {
            "barcode": "171105374",
            "dpc": "03010332901",
            "name": "ចាន់ ឃុយ"
        },
        {
            "barcode": "171105375",
            "dpc": "03010333001",
            "name": "សុខ អាន"
        },
        {
            "barcode": "171105376",
            "dpc": "03010333101",
            "name": "ជ័យ សារឿន"
        },
        {
            "barcode": "171105377",
            "dpc": "03010333301",
            "name": "សុខ វណ្ណី"
        },
        {
            "barcode": "171105378",
            "dpc": "03010328501",
            "name": "អ៊ិន សារឿន"
        },
        {
            "barcode": "171105379",
            "dpc": "03010328901",
            "name": "រស ផល"
        },
        {
            "barcode": "171105380",
            "dpc": "03010329001",
            "name": "សៅ ញ៉ាំង"
        },
        {
            "barcode": "171105381",
            "dpc": "03010329401",
            "name": "វ៉ាន់ ធី"
        },
        {
            "barcode": "171105382",
            "dpc": "03010308501",
            "name": "ពេជ្រ បូរ"
        },
        {
            "barcode": "171105383",
            "dpc": "03010309201",
            "name": "រ៉ុង ឈឿន"
        },
        {
            "barcode": "171105384",
            "dpc": "03010308601",
            "name": "ព្រំ ឆៃយ៉ាន"
        },
        {
            "barcode": "171105385",
            "dpc": "03010308701",
            "name": "សេង ថាឌី ១"
        },
        {
            "barcode": "171105386",
            "dpc": "03010308801",
            "name": "សេង ថាឌី ២"
        },
        {
            "barcode": "171105387",
            "dpc": "03010308901",
            "name": "សរ យស់ថាវរៈ"
        },
        {
            "barcode": "171105388",
            "dpc": "03010309101",
            "name": "អែវ និមល"
        },
        {
            "barcode": "171105389",
            "dpc": "03010326901",
            "name": "យិន សារឿន ១"
        },
        {
            "barcode": "171105390",
            "dpc": "03010327001",
            "name": "យិន សារឿន ២"
        },
        {
            "barcode": "171105391",
            "dpc": "03010327101",
            "name": "យិន សារឿន ៣"
        },
        {
            "barcode": "171105392",
            "dpc": "03010327301",
            "name": "ឈាង ឌុក"
        },
        {
            "barcode": "171105393",
            "dpc": "03010327501",
            "name": "ថ្លាង ប៊ុនណាត"
        },
        {
            "barcode": "171105394",
            "dpc": "03010327801",
            "name": "អ៊ុំ រ៉ា"
        },
        {
            "barcode": "171105395",
            "dpc": "03010328301",
            "name": "អ៊ុន រឿន"
        },
        {
            "barcode": "171105396",
            "dpc": "03010329701",
            "name": "ហ៊ុល យ៉ាង"
        },
        {
            "barcode": "171105397",
            "dpc": "03010329601",
            "name": "ទាវ វុទ្ធី"
        },
        {
            "barcode": "171105398",
            "dpc": "03010329501",
            "name": "ឃឹម សារ៉ាត់"
        },
        {
            "barcode": "171105399",
            "dpc": "03010329301",
            "name": "អ៊ុយ លីវ ៣"
        },
        {
            "barcode": "171105400",
            "dpc": "03010329201",
            "name": "អ៊ុយ លីវ ២"
        },
        {
            "barcode": "171105401",
            "dpc": "03010328801",
            "name": "ខាំ សារ៉ុម"
        },
        {
            "barcode": "171105402",
            "dpc": "03010328401",
            "name": "យ៉ាន សុភី"
        },
        {
            "barcode": "171105403",
            "dpc": "03010328201",
            "name": "កែវ ហឿន"
        },
        {
            "barcode": "171105404",
            "dpc": "03010328101",
            "name": "កែវ  រ៉ាដា"
        },
        {
            "barcode": "171105405",
            "dpc": "03010328001",
            "name": "ឯម សុភី"
        },
        {
            "barcode": "171105406",
            "dpc": "03010327901",
            "name": "ប៊ុន ពៅ"
        },
        {
            "barcode": "171105407",
            "dpc": "03010327601",
            "name": "កាន់ ណាឌី"
        },
        {
            "barcode": "171105408",
            "dpc": "03010327401",
            "name": "តាង សារ៉េត"
        },
        {
            "barcode": "171105409",
            "dpc": "03010327201",
            "name": "ថោង ផល្លា"
        },
        {
            "barcode": "171105410",
            "dpc": "03010319201",
            "name": "សាលារៀនព្រែកព្រះស្តេច"
        },
        {
            "barcode": "171105411",
            "dpc": "03010319301",
            "name": "កែវ ផូ"
        },
        {
            "barcode": "171105412",
            "dpc": "03010319701",
            "name": "សុង ស៊ឹង"
        },
        {
            "barcode": "171105413",
            "dpc": "03010320201",
            "name": "ភុំ រីណូ"
        },
        {
            "barcode": "171105414",
            "dpc": "03010320301",
            "name": "សៀង ស៊ាត"
        },
        {
            "barcode": "171105415",
            "dpc": "03010320401",
            "name": "លី សេង"
        },
        {
            "barcode": "171105416",
            "dpc": "03010320601",
            "name": "រឿន ឈិន"
        },
        {
            "barcode": "171105417",
            "dpc": "03010320701",
            "name": "ហុង សុជា"
        },
        {
            "barcode": "171105418",
            "dpc": "03010320801",
            "name": "ហាក់ ទៀង"
        },
        {
            "barcode": "171105419",
            "dpc": "03010321001",
            "name": "គឹម ប៊ុនថា"
        },
        {
            "barcode": "171105420",
            "dpc": "03010321101",
            "name": "ថោង សារ៉ន"
        },
        {
            "barcode": "171105421",
            "dpc": "03010329801",
            "name": "ថង ចេង"
        },
        {
            "barcode": "171105422",
            "dpc": "03010330801",
            "name": "ជា​ សុខុប"
        },
        {
            "barcode": "171105423",
            "dpc": "03010330701",
            "name": "ហ៊ាង ណៃជឹង"
        },
        {
            "barcode": "171105424",
            "dpc": "03010330601",
            "name": "សាត សារ៉ន"
        },
        {
            "barcode": "171105425",
            "dpc": "03010330401",
            "name": "អឿន ឈន"
        },
        {
            "barcode": "171105426",
            "dpc": "03010330501",
            "name": "នូ សំបូរ"
        },
        {
            "barcode": "171105427",
            "dpc": "03010330301",
            "name": "ហ៊ាង តឹកលី"
        },
        {
            "barcode": "171105428",
            "dpc": "03010330201",
            "name": "យន់ ឡៃ"
        },
        {
            "barcode": "171105429",
            "dpc": "03010330101",
            "name": "ឪ សារឿន"
        },
        {
            "barcode": "171105430",
            "dpc": "03010330001",
            "name": "ជិន សំប៊ុន"
        },
        {
            "barcode": "171105431",
            "dpc": "03010329901",
            "name": "ថង សៀង"
        },
        {
            "barcode": "171105432",
            "dpc": "03010330901",
            "name": "ព្រិល ហ៊ាង"
        },
        {
            "barcode": "171105433",
            "dpc": "03010331001",
            "name": "ឈឿ ឈួន"
        },
        {
            "barcode": "171105434",
            "dpc": "03010331201",
            "name": "ធីតា លក្ខិណា"
        },
        {
            "barcode": "171105435",
            "dpc": "03010309301",
            "name": "អ៊ឹង ថាវី"
        },
        {
            "barcode": "171105436",
            "dpc": "03010314501",
            "name": "គង់ សក់"
        },
        {
            "barcode": "171105437",
            "dpc": "03010314701",
            "name": "ឃួន ផន"
        },
        {
            "barcode": "171105438",
            "dpc": "03010314801",
            "name": "កែវ ម៉ូរ៉ាគន្ធ"
        },
        {
            "barcode": "171105439",
            "dpc": "03010314901",
            "name": "សំ សែម"
        },
        {
            "barcode": "171105440",
            "dpc": "03010315001",
            "name": "មុំ រ៉ៃ"
        },
        {
            "barcode": "171105441",
            "dpc": "03010315201",
            "name": "អ៊ុំ ម៉ាលី"
        },
        {
            "barcode": "171105442",
            "dpc": "03010315101",
            "name": "កៅ ថា"
        },
        {
            "barcode": "171105443",
            "dpc": "03010315301",
            "name": "ម៉ិល ហេង"
        },
        {
            "barcode": "171105444",
            "dpc": "03010315401",
            "name": "មាស ស្រាង"
        },
        {
            "barcode": "171105445",
            "dpc": "03010315501",
            "name": "ហង្ស ស៊ីណា"
        },
        {
            "barcode": "171105446",
            "dpc": "03010315601",
            "name": "សុទ្ធ ឈឿម"
        },
        {
            "barcode": "171105447",
            "dpc": "03010318401",
            "name": "សុក សោភា"
        },
        {
            "barcode": "171105448",
            "dpc": "03010318501",
            "name": "ម៉ាច គឹមឆាយ"
        },
        {
            "barcode": "171105449",
            "dpc": "03010318901",
            "name": "ម៉ន រ៉ែត"
        },
        {
            "barcode": "171105450",
            "dpc": "03010319001",
            "name": "ផាត់ សេង"
        },
        {
            "barcode": "171105451",
            "dpc": "03010319101",
            "name": "ឡេង ជីវ"
        },
        {
            "barcode": "171105452",
            "dpc": "03010319901",
            "name": "ភិវ ចំរើន"
        },
        {
            "barcode": "171105453",
            "dpc": "03010317601",
            "name": "ឥត ចំណាន"
        },
        {
            "barcode": "171105454",
            "dpc": "03010317701",
            "name": "កៀវ គឹមលន"
        },
        {
            "barcode": "171105455",
            "dpc": "03010317801",
            "name": "ចៅ គឹមអូន ១"
        },
        {
            "barcode": "171105456",
            "dpc": "03010317901",
            "name": "ចៅ គឹមអូន ២"
        },
        {
            "barcode": "171105457",
            "dpc": "03010318101",
            "name": "រស់ សារួន"
        },
        {
            "barcode": "171105458",
            "dpc": "03010318201",
            "name": "ឡាយ ទិតដារ៉ា"
        },
        {
            "barcode": "171105459",
            "dpc": "03010318301",
            "name": "ភឿក រ័ត្ន"
        },
        {
            "barcode": "171105460",
            "dpc": "03010315701",
            "name": "យក់ វ៉ានឆវី"
        },
        {
            "barcode": "171105461",
            "dpc": "03010315801",
            "name": "កែវ ដារ៉ា"
        },
        {
            "barcode": "171105462",
            "dpc": "03010315901",
            "name": "លឹម សាម៉េត"
        },
        {
            "barcode": "171105463",
            "dpc": "03010316101",
            "name": "ស៊ាង យ៉ាងហ្គោ"
        },
        {
            "barcode": "171105464",
            "dpc": "03010316601",
            "name": "លួង ឡេង"
        },
        {
            "barcode": "171105465",
            "dpc": "03010316701",
            "name": "ប៉ាន ប៊ុនរឿន"
        },
        {
            "barcode": "171105466",
            "dpc": "03010316501",
            "name": "ម៉ី ប៊ុនហួរ១"
        },
        {
            "barcode": "171105467",
            "dpc": "03010316201",
            "name": "ម៉ី ប៊ុនហូរ"
        },
        {
            "barcode": "171105468",
            "dpc": "03010316901",
            "name": "ឡឹក សុខុន"
        },
        {
            "barcode": "171105469",
            "dpc": "03010316301",
            "name": "នូវ សុភាព ១"
        },
        {
            "barcode": "171105470",
            "dpc": "03010316401",
            "name": "នូវ សុភាព ២"
        },
        {
            "barcode": "171105471",
            "dpc": "03010317001",
            "name": "សំ វែង"
        },
        {
            "barcode": "171105472",
            "dpc": "03010317101",
            "name": "អ៊ុក សឿន"
        },
        {
            "barcode": "171105473",
            "dpc": "03010317201",
            "name": "គុណ សាលឿត"
        },
        {
            "barcode": "171105474",
            "dpc": "03010317301",
            "name": "កែវ ភ័ក្រ្ត"
        },
        {
            "barcode": "171105475",
            "dpc": "03010317401",
            "name": "សៅ សុជាតិ ១"
        },
        {
            "barcode": "171105476",
            "dpc": "03010318001",
            "name": "ចៅ  គឹមអូន ៣"
        },
        {
            "barcode": "171105477",
            "dpc": "03010338501",
            "name": "លី យូសូស"
        },
        {
            "barcode": "171105478",
            "dpc": "03010300401",
            "name": "ជឹម ឈិញ"
        },
        {
            "barcode": "171105479",
            "dpc": "03010338601",
            "name": "ហួយ ហុង"
        },
        {
            "barcode": "171105480",
            "dpc": "03010338701",
            "name": "ស្រី ល័ក្ខ"
        },
        {
            "barcode": "171105481",
            "dpc": "03010338801",
            "name": "ប្រាង ភឿត"
        },
        {
            "barcode": "171105482",
            "dpc": "03010338901",
            "name": "សេង ហូរ"
        },
        {
            "barcode": "171105483",
            "dpc": "03010339001",
            "name": "យ៉ាត ចរិយា"
        },
        {
            "barcode": "171105484",
            "dpc": "03010339101",
            "name": "អ៊ុល រឿន"
        },
        {
            "barcode": "171105485",
            "dpc": "03010339201",
            "name": "អ៊ាប វិសាល"
        },
        {
            "barcode": "171105486",
            "dpc": "03010339301",
            "name": "សយ សាវិច"
        },
        {
            "barcode": "171105487",
            "dpc": "03010339401",
            "name": "ជឿម ឃុន"
        },
        {
            "barcode": "171105488",
            "dpc": "03010339501",
            "name": "ទុំ ប៊ុនធៀន"
        },
        {
            "barcode": "171105489",
            "dpc": "03010321401",
            "name": "ឆឹង ដួង"
        },
        {
            "barcode": "171105490",
            "dpc": "03010321201",
            "name": "ហុង គុយ"
        },
        {
            "barcode": "171105491",
            "dpc": "03010320901",
            "name": "ទូច ហួត"
        },
        {
            "barcode": "171105492",
            "dpc": "03010320501",
            "name": "សាយ សុភាព"
        },
        {
            "barcode": "171105493",
            "dpc": "03010320101",
            "name": "មឹង សួន"
        },
        {
            "barcode": "171105494",
            "dpc": "03010320001",
            "name": "ស ធុច"
        },
        {
            "barcode": "171105495",
            "dpc": "03010319801",
            "name": "ម៉ី ផាន់ណារិទ្ធ"
        },
        {
            "barcode": "171105496",
            "dpc": "03010319401",
            "name": "ស្រី ឆូ"
        },
        {
            "barcode": "171105497",
            "dpc": "03010319601",
            "name": "តោ សាហឿយ"
        },
        {
            "barcode": "171105498",
            "dpc": "03010319501",
            "name": "តោ ហ៊ុន"
        },
        {
            "barcode": "171105499",
            "dpc": "03010326701",
            "name": "លាស គួយ"
        },
        {
            "barcode": "171105500",
            "dpc": "03010326601",
            "name": "ភិន វណ្ណា"
        },
        {
            "barcode": "171105501",
            "dpc": "03010338401",
            "name": "គង់ ឈួន"
        },
        {
            "barcode": "171105502",
            "dpc": "03010326501",
            "name": "ងួន កិត្យា"
        },
        {
            "barcode": "171105503",
            "dpc": "03010326401",
            "name": "ឆឹង ឈួម"
        },
        {
            "barcode": "171105504",
            "dpc": "03010326301",
            "name": "ឆយ ម៉ូវធាង"
        },
        {
            "barcode": "171105505",
            "dpc": "03010326201",
            "name": "វ៉ាន់ ឃាង"
        },
        {
            "barcode": "171105506",
            "dpc": "03010326101",
            "name": "ប៉ក ចាន់"
        },
        {
            "barcode": "171105507",
            "dpc": "03010326001",
            "name": "ប៉ូយ ហ៊ីម"
        },
        {
            "barcode": "171105508",
            "dpc": "03010325901",
            "name": "អេង ង៉ោ"
        },
        {
            "barcode": "171105509",
            "dpc": "03010325801",
            "name": "សុខ អឿន"
        },
        {
            "barcode": "171105510",
            "dpc": "03010325701",
            "name": "ឆឹង ឆាង"
        },
        {
            "barcode": "171105511",
            "dpc": "03010325601",
            "name": "សន ផាន់នី"
        },
        {
            "barcode": "171105512",
            "dpc": "03010325401",
            "name": "ប៉ែន សំបូរ"
        },
        {
            "barcode": "171105513",
            "dpc": "03010325301",
            "name": "មុំ វ៉ាត"
        },
        {
            "barcode": "171105514",
            "dpc": "03010325501",
            "name": "ឡុង សុផាន"
        },
        {
            "barcode": "171105515",
            "dpc": "03010325201",
            "name": "ឡេង សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171105516",
            "dpc": "03010325101",
            "name": "សៀង សាវឿន"
        },
        {
            "barcode": "171105517",
            "dpc": "03010325001",
            "name": "ស ចាន់ថា"
        },
        {
            "barcode": "171105518",
            "dpc": "03010324901",
            "name": "ព្រែក ថា"
        },
        {
            "barcode": "171105519",
            "dpc": "03010324801",
            "name": "ហោ ផល្លី"
        },
        {
            "barcode": "171105520",
            "dpc": "03010324701",
            "name": "គុយ ចាន់ធូ"
        },
        {
            "barcode": "171105521",
            "dpc": "03010324601",
            "name": "ហាក គឹមលាង"
        },
        {
            "barcode": "171105522",
            "dpc": "03010324201",
            "name": "អួង បូរ៉ាផា"
        },
        {
            "barcode": "171105523",
            "dpc": "03010324401",
            "name": "មាស ផុន"
        },
        {
            "barcode": "171105524",
            "dpc": "03010324501",
            "name": "ហុក លាភ"
        },
        {
            "barcode": "171105525",
            "dpc": "03010324301",
            "name": "គី ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171105526",
            "dpc": "03010324101",
            "name": "ឈិន សុផានី"
        },
        {
            "barcode": "171105527",
            "dpc": "03010323901",
            "name": "អេង សាលឿន"
        },
        {
            "barcode": "171105528",
            "dpc": "03010323801",
            "name": "ឆោម គឹមយួង"
        },
        {
            "barcode": "171105529",
            "dpc": "03010323701",
            "name": "ទឹម សេរី"
        },
        {
            "barcode": "171105530",
            "dpc": "03010323601",
            "name": "ឃួន ស៊ាប"
        },
        {
            "barcode": "171105531",
            "dpc": "03010323501",
            "name": "អឿម ប៊ុណ្ណា"
        },
        {
            "barcode": "171105532",
            "dpc": "03010323401",
            "name": "លាន នី"
        },
        {
            "barcode": "171105533",
            "dpc": "03010323301",
            "name": "សយ សារ៉ន"
        },
        {
            "barcode": "171105534",
            "dpc": "03010323201",
            "name": "ខុង ធួក"
        },
        {
            "barcode": "171105535",
            "dpc": "03010323101",
            "name": "អ៊ុក សំផុន"
        },
        {
            "barcode": "171105536",
            "dpc": "03010323001",
            "name": "សយ រៀង"
        },
        {
            "barcode": "171105537",
            "dpc": "03010322801",
            "name": "សូ ផេងគុណ"
        },
        {
            "barcode": "171105538",
            "dpc": "03010322701",
            "name": "ហួត  គីរីរិត"
        },
        {
            "barcode": "171105539",
            "dpc": "03010322601",
            "name": "ភឿប​ ផាយោ"
        },
        {
            "barcode": "171105540",
            "dpc": "03010322501",
            "name": "សោ គឹមឡាយ"
        },
        {
            "barcode": "171105541",
            "dpc": "03010322401",
            "name": "រ៉ែត គុណធារី"
        },
        {
            "barcode": "171105542",
            "dpc": "03010322301",
            "name": "សុខ វិបុល"
        },
        {
            "barcode": "171105543",
            "dpc": "03010322201",
            "name": "ខាត់ ឡុង"
        },
        {
            "barcode": "171105544",
            "dpc": "03010322901",
            "name": "ឈុត សុគន្ធា"
        },
        {
            "barcode": "171105545",
            "dpc": "03010322101",
            "name": "ថៃ ហេង"
        },
        {
            "barcode": "171105546",
            "dpc": "03010321901",
            "name": "បេង សុធី"
        },
        {
            "barcode": "171105547",
            "dpc": "03010321801",
            "name": "ហុង វណ្ណារិទ្ធ"
        },
        {
            "barcode": "171105548",
            "dpc": "03010321601",
            "name": "តាន់ សិទ្ធ"
        },
        {
            "barcode": "171105549",
            "dpc": "03010321701",
            "name": "យ៉ាត ថូ"
        },
        {
            "barcode": "171105550",
            "dpc": "03010342101",
            "name": "កែវ ម៉ាន់ធឿន"
        },
        {
            "barcode": "171105551",
            "dpc": "03010342201",
            "name": "សាង សាវុន"
        },
        {
            "barcode": "171105552",
            "dpc": "03010342401",
            "name": "ភឹម ហេង"
        },
        {
            "barcode": "171105553",
            "dpc": "03010342501",
            "name": "តាំង ម៉េង"
        },
        {
            "barcode": "171105554",
            "dpc": "03010342601",
            "name": "ងួន រតនៈ ២"
        },
        {
            "barcode": "171105555",
            "dpc": "03010342701",
            "name": "ឆយ ម៉ូវធៀង"
        },
        {
            "barcode": "171105556",
            "dpc": "03010342901",
            "name": "ឈឿត សំខាន់"
        },
        {
            "barcode": "171105557",
            "dpc": "03010342801",
            "name": "ហេង ហៀង"
        },
        {
            "barcode": "171105558",
            "dpc": "03010343001",
            "name": "ងិន ណារី"
        },
        {
            "barcode": "171105559",
            "dpc": "03010343101",
            "name": "សឹង កាក់"
        },
        {
            "barcode": "171105560",
            "dpc": "03010343201",
            "name": "អៀរ រិទ្ធី"
        },
        {
            "barcode": "171105561",
            "dpc": "03010343301",
            "name": "ប៉េង រ៉ាដេត"
        },
        {
            "barcode": "171105562",
            "dpc": "03010343401",
            "name": "ឃុន កី"
        },
        {
            "barcode": "171105563",
            "dpc": "03010343501",
            "name": "ចាន់ គឹមឡេង"
        },
        {
            "barcode": "171105564",
            "dpc": "03010343601",
            "name": "គី គឹមឡេង"
        },
        {
            "barcode": "171105565",
            "dpc": "03010343801",
            "name": "សឿន ឃឿប"
        },
        {
            "barcode": "171105566",
            "dpc": "03010343901",
            "name": "ក្រូច គីរី"
        },
        {
            "barcode": "171105567",
            "dpc": "03010344001",
            "name": "សាត សុខុំ"
        },
        {
            "barcode": "171105568",
            "dpc": "03010344101",
            "name": "ធូ ធិន"
        },
        {
            "barcode": "171105569",
            "dpc": "03010344901",
            "name": "ឆឺយ ស៊ីន"
        },
        {
            "barcode": "171105570",
            "dpc": "03010344701",
            "name": "សុខ លាងហួយ"
        },
        {
            "barcode": "171105571",
            "dpc": "03010344601",
            "name": "គឹម ហ្គិច"
        },
        {
            "barcode": "171105572",
            "dpc": "03010344501",
            "name": "រ័ត្ន វ៉ាន់"
        },
        {
            "barcode": "171105573",
            "dpc": "03010344401",
            "name": "ទ្រី ណារ៉ែត"
        },
        {
            "barcode": "171105574",
            "dpc": "03010344301",
            "name": "អ៊ុន ឆៃហ៊ាង"
        },
        {
            "barcode": "171105575",
            "dpc": "03010344201",
            "name": "ទី ផាត"
        },
        {
            "barcode": "171105576",
            "dpc": "03010345201",
            "name": "ស៊ុយ សុវណ្ណមន្នី"
        },
        {
            "barcode": "171105577",
            "dpc": "03010337801",
            "name": "សៀង  លីម"
        },
        {
            "barcode": "171105578",
            "dpc": "03010344801",
            "name": "គង់ បណ្តូល"
        },
        {
            "barcode": "171105579",
            "dpc": "03010345501",
            "name": "ហេង ពៅ"
        },
        {
            "barcode": "171105580",
            "dpc": "03010345301",
            "name": "វិទ្យាស្ថានអភិវឌ្ឍន៍"
        },
        {
            "barcode": "171105581",
            "dpc": "03010345401",
            "name": "ងួន គង់"
        },
        {
            "barcode": "171105582",
            "dpc": "03010345601",
            "name": "សឿន ស៊ីថា"
        },
        {
            "barcode": "171105583",
            "dpc": "03010345701",
            "name": "អ៊ុក សាវុន"
        },
        {
            "barcode": "171105584",
            "dpc": "03010345801",
            "name": "ទឹម ដារ៉េត"
        },
        {
            "barcode": "171105585",
            "dpc": "03010345901",
            "name": "ឡាច លីម"
        },
        {
            "barcode": "171105586",
            "dpc": "03010346001",
            "name": "ចាន់ ទូច"
        },
        {
            "barcode": "171105587",
            "dpc": "03010346101",
            "name": "ម៉ា ម៉ុន្ថា"
        },
        {
            "barcode": "171105588",
            "dpc": "03010346201",
            "name": "ចាន់ រ៉ា"
        },
        {
            "barcode": "171105589",
            "dpc": "03010346401",
            "name": "ងួន ប៊ុនណា"
        },
        {
            "barcode": "171105590",
            "dpc": "03010346501",
            "name": "ជឹម  ជឿន"
        },
        {
            "barcode": "171105591",
            "dpc": "03010346601",
            "name": "សន សុផាន់នី"
        },
        {
            "barcode": "171105592",
            "dpc": "03010346901",
            "name": "លន់ ហ៊ិន"
        },
        {
            "barcode": "171105593",
            "dpc": "03010347001",
            "name": "ខាត់ ជុន"
        },
        {
            "barcode": "171105594",
            "dpc": "03010347101",
            "name": "យន់ រ៉ាវី"
        },
        {
            "barcode": "171105595",
            "dpc": "03010347401",
            "name": "ប៉ាវ ចាន់ដារ៉ា"
        },
        {
            "barcode": "171105596",
            "dpc": "03010339601",
            "name": "គឹម ភិគុណ"
        },
        {
            "barcode": "171105597",
            "dpc": "03010339701",
            "name": "នន់ នៅ"
        },
        {
            "barcode": "171105598",
            "dpc": "03010339801",
            "name": "ហេង សុផាត"
        },
        {
            "barcode": "171105599",
            "dpc": "03010340001",
            "name": "ឃឹម សាវុធ"
        },
        {
            "barcode": "171105600",
            "dpc": "03010339901",
            "name": "ទិត និត"
        },
        {
            "barcode": "171105601",
            "dpc": "03010340101",
            "name": "យ៉ាន ធី"
        },
        {
            "barcode": "171105602",
            "dpc": "03010340201",
            "name": "ជា ណាវី"
        },
        {
            "barcode": "171105603",
            "dpc": "03010340301",
            "name": "ឈួន សំណាង"
        },
        {
            "barcode": "171105604",
            "dpc": "03010340401",
            "name": "កាំង មាឌ"
        },
        {
            "barcode": "171105605",
            "dpc": "03010340501",
            "name": "ស៊ីម ហុង"
        },
        {
            "barcode": "171105606",
            "dpc": "03010340701",
            "name": "ឡាយ សារ៉ុង"
        },
        {
            "barcode": "171105607",
            "dpc": "03010340601",
            "name": "ចាយ សំណាង"
        },
        {
            "barcode": "171105608",
            "dpc": "03010340801",
            "name": "ភេង សាធី"
        },
        {
            "barcode": "171105609",
            "dpc": "03010340901",
            "name": "ចាន់ វណ្ណៈ"
        },
        {
            "barcode": "171105610",
            "dpc": "03010341001",
            "name": "ប៉ែន តាន់"
        },
        {
            "barcode": "171105611",
            "dpc": "03010341101",
            "name": "ម៉ាន់ សូនី"
        },
        {
            "barcode": "171105612",
            "dpc": "03010341201",
            "name": "គឹម ចាន់"
        },
        {
            "barcode": "171105613",
            "dpc": "03010341301",
            "name": "អ៊ុល កញ្ញា"
        },
        {
            "barcode": "171105614",
            "dpc": "03010341401",
            "name": "ទេព កុសល"
        },
        {
            "barcode": "171105615",
            "dpc": "03010341501",
            "name": "ញ៉ូ សាអ៊ីម"
        },
        {
            "barcode": "171105616",
            "dpc": "03010341601",
            "name": "ញ៉ូ សុផារី"
        },
        {
            "barcode": "171105617",
            "dpc": "03010341701",
            "name": "កែវ ឡុង"
        },
        {
            "barcode": "171105618",
            "dpc": "03010341801",
            "name": "ម៉ាត់ យើ"
        },
        {
            "barcode": "171105619",
            "dpc": "03010341901",
            "name": "ម៉ាត់ លះ"
        },
        {
            "barcode": "171105620",
            "dpc": "03010342001",
            "name": "ម៉ាត់ យ៉ាន"
        },
        {
            "barcode": "171105621",
            "dpc": "03010346701",
            "name": "រី ចាន់ដូ"
        },
        {
            "barcode": "171105622",
            "dpc": "03010347201",
            "name": "ហ៊ីម សុភាព"
        },
        {
            "barcode": "171105623",
            "dpc": "03010347301",
            "name": "ចាប សារី"
        },
        {
            "barcode": "171105624",
            "dpc": "03010347501",
            "name": "ឃ្លាំង សូគីម៉ិច"
        },
        {
            "barcode": "171105625",
            "dpc": "03010347601",
            "name": "នង ប៉ុនធឿន"
        },
        {
            "barcode": "171105626",
            "dpc": "03010347701",
            "name": "ហេង ចាន់ថាវី"
        },
        {
            "barcode": "171105627",
            "dpc": "03010347801",
            "name": "សំ គឹមហ៊ុន"
        },
        {
            "barcode": "171105628",
            "dpc": "03010347901",
            "name": "ឃឿ យូលី"
        },
        {
            "barcode": "171105629",
            "dpc": "03010302601",
            "name": "ឡាយ  ជាង"
        },
        {
            "barcode": "171105630",
            "dpc": "03010305101",
            "name": "តាន់ បូរ៉ាវណ្ណ"
        },
        {
            "barcode": "171105631",
            "dpc": "03010310301",
            "name": "ហុង  សុវណ្ណ"
        },
        {
            "barcode": "171105632",
            "dpc": "03010312201",
            "name": "ស វ៉ាន់ណារ៉េត"
        },
        {
            "barcode": "171105633",
            "dpc": "03010300101",
            "name": "គង់  យិន"
        },
        {
            "barcode": "171105634",
            "dpc": "03010300201",
            "name": "គង់  ហាច"
        },
        {
            "barcode": "171105635",
            "dpc": "03010300301",
            "name": "លួង  ខន"
        },
        {
            "barcode": "171105636",
            "dpc": "03010300601",
            "name": "ប៉ិច  គឹមលី"
        },
        {
            "barcode": "171105637",
            "dpc": "03010300701",
            "name": "សៅ  រិន្ទ"
        },
        {
            "barcode": "171105638",
            "dpc": "03010300901",
            "name": "លី  សំណាង"
        },
        {
            "barcode": "171105639",
            "dpc": "03010301001",
            "name": "ស៊ីម  សាវុន"
        },
        {
            "barcode": "171105640",
            "dpc": "03010301101",
            "name": "ជា ខេមរិន"
        },
        {
            "barcode": "171105641",
            "dpc": "03010301201",
            "name": "ពក  សម្បត្តិ"
        },
        {
            "barcode": "171105642",
            "dpc": "03010301301",
            "name": "សៅ  ប៊ុនសុង"
        },
        {
            "barcode": "171105643",
            "dpc": "03010301401",
            "name": "ងឹម ខេមរិទ្ធ"
        },
        {
            "barcode": "171105644",
            "dpc": "03010301501",
            "name": "ស៊ូ  គឹមហេង"
        },
        {
            "barcode": "171105645",
            "dpc": "03010301601",
            "name": "លឹម គឹមលាង"
        },
        {
            "barcode": "171105646",
            "dpc": "03010301701",
            "name": "ស៊ីន ពៅចិន្តា"
        },
        {
            "barcode": "171105647",
            "dpc": "03010301801",
            "name": "យិន លិននិន"
        },
        {
            "barcode": "171105648",
            "dpc": "03010302101",
            "name": "រុំ  រ៉េត"
        },
        {
            "barcode": "171109502",
            "dpc": "03010348001",
            "name": "ភួង សារុំ"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});