let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=
[
    {
        "barcode": "171110492",
        "dpc": "03010606701",
        "name": "ទន់  វ៉ាយ"
    },
    {
        "barcode": "171110493",
        "dpc": "03010626901",
        "name": "ហុក គីម"
    },
    {
        "barcode": "171110494",
        "dpc": "03010627101",
        "name": "ភី ផាន"
    },
    {
        "barcode": "171110495",
        "dpc": "03010627201",
        "name": "ជេស ទិត"
    },
    {
        "barcode": "171110496",
        "dpc": "03010627401",
        "name": "លឹម ងិធ"
    },
    {
        "barcode": "171110497",
        "dpc": "03010627501",
        "name": "ថាន់ ចន្តា"
    },
    {
        "barcode": "171110498",
        "dpc": "03010618301",
        "name": "លី  សៀប"
    },
    {
        "barcode": "171110499",
        "dpc": "03010618201",
        "name": "ពេជ្រ  ព្រហ្មមុន្នី"
    },
    {
        "barcode": "171110500",
        "dpc": "03010627301",
        "name": "ប៊ុន ចំរើន"
    },
    {
        "barcode": "171110501",
        "dpc": "03010618001",
        "name": "អ៊ឹម វត្តី"
    },
    {
        "barcode": "171110502",
        "dpc": "03010618101",
        "name": "ភួង   សុភាព"
    },
    {
        "barcode": "171110503",
        "dpc": "03010618401",
        "name": "ម៉ុន សាមឿន"
    },
    {
        "barcode": "171110504",
        "dpc": "03010618501",
        "name": "ម៉ក ទឹម"
    },
    {
        "barcode": "171110505",
        "dpc": "03010618601",
        "name": "ប៊ុច ស៊ត"
    },
    {
        "barcode": "171110506",
        "dpc": "03010618701",
        "name": "សៀក សារ៉េត"
    },
    {
        "barcode": "171110507",
        "dpc": "03010618801",
        "name": "ម៉ៃ សុវណ្ណ"
    },
    {
        "barcode": "171110508",
        "dpc": "03010618901",
        "name": "ទូច ប៊ុនធឿន"
    },
    {
        "barcode": "171110509",
        "dpc": "03010617601",
        "name": "ថុង  សុខជាតិ"
    },
    {
        "barcode": "171110510",
        "dpc": "03010617701",
        "name": "អាង  វុទ្ធី"
    },
    {
        "barcode": "171110511",
        "dpc": "03010617301",
        "name": "សៅ ដាំ"
    },
    {
        "barcode": "171110512",
        "dpc": "03010617401",
        "name": "សេង ថាវ"
    },
    {
        "barcode": "171110513",
        "dpc": "03010617001",
        "name": "ចាន់ វាសនា"
    },
    {
        "barcode": "171110514",
        "dpc": "03010616701",
        "name": "មិត្ត ចិន្តា"
    },
    {
        "barcode": "171110515",
        "dpc": "03010616801",
        "name": "គង់ ទឺ"
    },
    {
        "barcode": "171110516",
        "dpc": "03010619401",
        "name": "នឹម កែវ"
    },
    {
        "barcode": "171110517",
        "dpc": "03010619001",
        "name": "ភិន ប៊ុនរឿន"
    },
    {
        "barcode": "171110518",
        "dpc": "03010619101",
        "name": "អ៊ុំ សារី"
    },
    {
        "barcode": "171110519",
        "dpc": "03010619601",
        "name": "គណបក្សប្រជាជន"
    },
    {
        "barcode": "171110520",
        "dpc": "03010619701",
        "name": "ឈឹម សូលីដែន"
    },
    {
        "barcode": "171110521",
        "dpc": "03010619801",
        "name": "គឹម សៅលឿត"
    },
    {
        "barcode": "171110522",
        "dpc": "03010619901",
        "name": "ប៉ាង នួន"
    },
    {
        "barcode": "171110523",
        "dpc": "03010620101",
        "name": "ហេង កាកសុង"
    },
    {
        "barcode": "171110524",
        "dpc": "03010620601",
        "name": "រិន  សារ៉ន"
    },
    {
        "barcode": "171110525",
        "dpc": "03010620701",
        "name": "អ៊ឹង សី"
    },
    {
        "barcode": "171110526",
        "dpc": "03010617201",
        "name": "យិន  ចន្ធី"
    },
    {
        "barcode": "171110527",
        "dpc": "03010617101",
        "name": "អម រ៉េត"
    },
    {
        "barcode": "171110528",
        "dpc": "03010616601",
        "name": "ទីន ម៉ារី"
    },
    {
        "barcode": "171110529",
        "dpc": "03010620501",
        "name": "ឌុង ឌីម"
    },
    {
        "barcode": "171110530",
        "dpc": "03010620401",
        "name": "រស់ លី"
    },
    {
        "barcode": "171110531",
        "dpc": "03010620301",
        "name": "គង់ រ៉ាវី"
    },
    {
        "barcode": "171110532",
        "dpc": "03010620201",
        "name": "ឃ្លោក ដែន"
    },
    {
        "barcode": "171110533",
        "dpc": "03010621101",
        "name": "ប៊ុត សំអឿ"
    },
    {
        "barcode": "171110534",
        "dpc": "03010626501",
        "name": "ណុប ដារ៉ា"
    },
    {
        "barcode": "171110535",
        "dpc": "03010626601",
        "name": "ហួន  សង្ហា"
    },
    {
        "barcode": "171110536",
        "dpc": "03010626701",
        "name": "តេង សំអាត"
    },
    {
        "barcode": "171110537",
        "dpc": "03010626801",
        "name": "សាយ សារ័ត្ន"
    },
    {
        "barcode": "171110538",
        "dpc": "03010626001",
        "name": "ប៉ិច  ណម"
    },
    {
        "barcode": "171110539",
        "dpc": "03010626101",
        "name": "ស៊ឺន ស៊ីលីណា"
    },
    {
        "barcode": "171110540",
        "dpc": "03010626201",
        "name": "យឹម សេតដារ៉ា"
    },
    {
        "barcode": "171110541",
        "dpc": "03010626301",
        "name": "សោម សង្វាស័ក"
    },
    {
        "barcode": "171110542",
        "dpc": "03010624301",
        "name": "លី លន់"
    },
    {
        "barcode": "171110543",
        "dpc": "03010624501",
        "name": "នាក ណន"
    },
    {
        "barcode": "171110544",
        "dpc": "03010624401",
        "name": "គង់ ចិន្តា"
    },
    {
        "barcode": "171110545",
        "dpc": "03010619301",
        "name": "អៀ សុផាត"
    },
    {
        "barcode": "171110546",
        "dpc": "03010625901",
        "name": "សួន ឧត្តម"
    },
    {
        "barcode": "171110547",
        "dpc": "03010625601",
        "name": "ចៅ សៅ"
    },
    {
        "barcode": "171110548",
        "dpc": "03010625701",
        "name": "ចៅ ម៉ៅ"
    },
    {
        "barcode": "171110549",
        "dpc": "03010619201",
        "name": "ងន សំអុស"
    },
    {
        "barcode": "171110550",
        "dpc": "03010624601",
        "name": "នាក ណាន់"
    },
    {
        "barcode": "171110551",
        "dpc": "03010624801",
        "name": "ប៊ន សារឹម"
    },
    {
        "barcode": "171110552",
        "dpc": "03010624701",
        "name": "យស់ សម្បត្តិ"
    },
    {
        "barcode": "171110553",
        "dpc": "03010624901",
        "name": "សេត ប្រិយ"
    },
    {
        "barcode": "171110554",
        "dpc": "03010625001",
        "name": "សែន សុភ័ណ្ឌ"
    },
    {
        "barcode": "171110555",
        "dpc": "03010625101",
        "name": "សន ប៊ុនណា"
    },
    {
        "barcode": "171110556",
        "dpc": "03010625201",
        "name": "គិវ  គឹមហឿង"
    },
    {
        "barcode": "171110557",
        "dpc": "03010625301",
        "name": "ប៉ែន ហ៊ន"
    },
    {
        "barcode": "171110558",
        "dpc": "03010615601",
        "name": "ចាន់ បុប្ផា"
    },
    {
        "barcode": "171110559",
        "dpc": "03010621001",
        "name": "សួន វុត្ថា"
    },
    {
        "barcode": "171110560",
        "dpc": "03010615501",
        "name": "ថាំង  សៀម"
    },
    {
        "barcode": "171110561",
        "dpc": "03010632201",
        "name": "យូ ហយ"
    },
    {
        "barcode": "171110562",
        "dpc": "03010632101",
        "name": "តាំង ឈិនហ៊ួរ"
    },
    {
        "barcode": "171110563",
        "dpc": "03010628101",
        "name": "រ៉ុង គឹមស៊ាន"
    },
    {
        "barcode": "171110564",
        "dpc": "03010627801",
        "name": "ទីន ដារី"
    },
    {
        "barcode": "171110565",
        "dpc": "03010627901",
        "name": "លឹម វ៉ានណែត"
    },
    {
        "barcode": "171110566",
        "dpc": "03010627701",
        "name": "ង៉ោ ស៊ុនហេង"
    },
    {
        "barcode": "171110567",
        "dpc": "03010615901",
        "name": "ទន់ រឿ"
    },
    {
        "barcode": "171110568",
        "dpc": "03010616301",
        "name": "អៀម ផាន់ណា"
    },
    {
        "barcode": "171110569",
        "dpc": "03010616201",
        "name": "ភិន ប្រម"
    },
    {
        "barcode": "171110570",
        "dpc": "03010615701",
        "name": "សយ បូនិត"
    },
    {
        "barcode": "171110571",
        "dpc": "03010615801",
        "name": "កែវ ផានី"
    },
    {
        "barcode": "171110572",
        "dpc": "03010628401",
        "name": "សឿង សឿម"
    },
    {
        "barcode": "171110573",
        "dpc": "03010628901",
        "name": "សយ លីហេង"
    },
    {
        "barcode": "171110574",
        "dpc": "03010629101",
        "name": "បូ ហាក"
    },
    {
        "barcode": "171110575",
        "dpc": "03010629001",
        "name": "ហេង លឹមសេង"
    },
    {
        "barcode": "171110576",
        "dpc": "03010628701",
        "name": "អ៊ុន ដានី ១"
    },
    {
        "barcode": "171110577",
        "dpc": "03010628601",
        "name": "លឹម ស៊ាន"
    },
    {
        "barcode": "171110578",
        "dpc": "03010614401",
        "name": "វ៉ា ស៊ីថារ៉ុត"
    },
    {
        "barcode": "171110579",
        "dpc": "03010616501",
        "name": "ឈួន    សាវិន"
    },
    {
        "barcode": "171110580",
        "dpc": "03010629801",
        "name": "រូម  រុន"
    },
    {
        "barcode": "171110581",
        "dpc": "03010629701",
        "name": "ឡេង  ឃីម"
    },
    {
        "barcode": "171110582",
        "dpc": "03010629601",
        "name": "ស  គឹមប៉ាក"
    },
    {
        "barcode": "171110583",
        "dpc": "03010629401",
        "name": "កែវ  វិចិត្រ"
    },
    {
        "barcode": "171110584",
        "dpc": "03010629501",
        "name": "វ៉ាន  ស្រីពៅ"
    },
    {
        "barcode": "171110585",
        "dpc": "03010629201",
        "name": "លឹម ហុង"
    },
    {
        "barcode": "171110586",
        "dpc": "03010630201",
        "name": "សុខ ឈឿន"
    },
    {
        "barcode": "171110587",
        "dpc": "03010630101",
        "name": "ឡុង ផលគុណ"
    },
    {
        "barcode": "171110588",
        "dpc": "03010630001",
        "name": "វណ្ណ សុផល"
    },
    {
        "barcode": "171110589",
        "dpc": "03010631001",
        "name": "ផុន ចន្ត្រា"
    },
    {
        "barcode": "171110590",
        "dpc": "03010631101",
        "name": "សូ ភីយ៉ា"
    },
    {
        "barcode": "171110591",
        "dpc": "03010632001",
        "name": "ចាប លី"
    },
    {
        "barcode": "171110592",
        "dpc": "03010630801",
        "name": "សាង គឹមសាយ"
    },
    {
        "barcode": "171110593",
        "dpc": "03010630601",
        "name": "ពេជ្រ វណ្ណា ៣"
    },
    {
        "barcode": "171110594",
        "dpc": "03010630701",
        "name": "ពេជ្រ វណ្ណា ២"
    },
    {
        "barcode": "171110595",
        "dpc": "03010630501",
        "name": "តាំង គង់"
    },
    {
        "barcode": "171110596",
        "dpc": "03010630301",
        "name": "ឌី សុខលឹម"
    },
    {
        "barcode": "171110597",
        "dpc": "03010631401",
        "name": "យ៉ាន់ សម័យ"
    },
    {
        "barcode": "171110598",
        "dpc": "03010632501",
        "name": "ម៉ៅទឹម សុវណ្ណារិទ្ធ"
    },
    {
        "barcode": "171110599",
        "dpc": "03010632301",
        "name": "សួន បុប្ផា"
    },
    {
        "barcode": "171110600",
        "dpc": "03010631801",
        "name": "ជឿន ចិន្តា"
    },
    {
        "barcode": "171110601",
        "dpc": "03010632401",
        "name": "ចាន់ ញ៉ន"
    },
    {
        "barcode": "171110602",
        "dpc": "03010622901",
        "name": "ទៀប រី"
    },
    {
        "barcode": "171110603",
        "dpc": "03010623001",
        "name": "ការិ.ព្រហ្មទណ្ឌកំរិតស្រាល"
    },
    {
        "barcode": "171110604",
        "dpc": "03010623201",
        "name": "សឿន ម៉ាច"
    },
    {
        "barcode": "171110605",
        "dpc": "03010623301",
        "name": "អៀវ យ៉ា"
    },
    {
        "barcode": "171110606",
        "dpc": "03010623101",
        "name": "ម៉ែន សុភិន"
    },
    {
        "barcode": "171110607",
        "dpc": "03010622601",
        "name": "ស៊ីម ឡៃ"
    },
    {
        "barcode": "171110608",
        "dpc": "03010622301",
        "name": "ខឹម ស៊ីណាន"
    },
    {
        "barcode": "171110609",
        "dpc": "03010622401",
        "name": "នៅ នឿន"
    },
    {
        "barcode": "171110610",
        "dpc": "03010621701",
        "name": "ពុំ ចាន់"
    },
    {
        "barcode": "171110611",
        "dpc": "03010621501",
        "name": "តូយ ភន"
    },
    {
        "barcode": "171110612",
        "dpc": "03010621401",
        "name": "កើង សុខខេង"
    },
    {
        "barcode": "171110613",
        "dpc": "03010615201",
        "name": "ឈួម ពុធ"
    },
    {
        "barcode": "171110614",
        "dpc": "03010622001",
        "name": "ឌូង  វាសនា"
    },
    {
        "barcode": "171110615",
        "dpc": "03010621801",
        "name": "ឈួម ឆយ"
    },
    {
        "barcode": "171110616",
        "dpc": "03010615101",
        "name": "យ៉ែម យុន"
    },
    {
        "barcode": "171110617",
        "dpc": "03010633901",
        "name": "វ៉ែន លឿន"
    },
    {
        "barcode": "171110618",
        "dpc": "03010633801",
        "name": "គឹម កុយ"
    },
    {
        "barcode": "171110619",
        "dpc": "03010633701",
        "name": "ឈឹម វជិរ៉ា"
    },
    {
        "barcode": "171110620",
        "dpc": "03010633501",
        "name": "គី ឡែ"
    },
    {
        "barcode": "171110621",
        "dpc": "03010633601",
        "name": "ឆយ ជា"
    },
    {
        "barcode": "171110622",
        "dpc": "03010633401",
        "name": "ផឹក រឿន"
    },
    {
        "barcode": "171110623",
        "dpc": "03010633201",
        "name": "វង់ វី"
    },
    {
        "barcode": "171110624",
        "dpc": "03010633301",
        "name": "ប៉ោ ចន្ធី"
    },
    {
        "barcode": "171110625",
        "dpc": "03010632601",
        "name": "មៀច ផល្លី"
    },
    {
        "barcode": "171110626",
        "dpc": "03010632701",
        "name": "លួង ចាន់"
    },
    {
        "barcode": "171110627",
        "dpc": "03010623601",
        "name": "ជួន រិទ្ធី"
    },
    {
        "barcode": "171110628",
        "dpc": "03010623501",
        "name": "កុច ផន"
    },
    {
        "barcode": "171110629",
        "dpc": "03010623401",
        "name": "សៅ ថាច"
    },
    {
        "barcode": "171110630",
        "dpc": "03010623701",
        "name": "វ៉ាន់ ដារ៉ា"
    },
    {
        "barcode": "171110631",
        "dpc": "03010623801",
        "name": "សាលាហូប"
    },
    {
        "barcode": "171110632",
        "dpc": "03010623901",
        "name": "ខាន់ សុភាព"
    },
    {
        "barcode": "171110633",
        "dpc": "03010624001",
        "name": "សន សាន"
    },
    {
        "barcode": "171110634",
        "dpc": "03010624101",
        "name": "យឿន សំអ៊ុល"
    },
    {
        "barcode": "171110635",
        "dpc": "03010624201",
        "name": "សុខ លាងហ៊ាប"
    },
    {
        "barcode": "171110636",
        "dpc": "03010632901",
        "name": "លន់ រិទ្ធ"
    },
    {
        "barcode": "171110637",
        "dpc": "03010632801",
        "name": "ទី សុខុន"
    },
    {
        "barcode": "171110638",
        "dpc": "03010633101",
        "name": "ញ៉ែម  សុធា"
    },
    {
        "barcode": "171110639",
        "dpc": "03010633001",
        "name": "ពេញ ចាន់ដារ៉ា"
    },
    {
        "barcode": "171110640",
        "dpc": "03010614301",
        "name": "ហាច គឹមសុក"
    },
    {
        "barcode": "171110641",
        "dpc": "03010614501",
        "name": "ម៉ៅ វិញ"
    },
    {
        "barcode": "171110642",
        "dpc": "03010614601",
        "name": "ឆួ គឹមហ៊ី"
    },
    {
        "barcode": "171110643",
        "dpc": "03010614701",
        "name": "គុយ គឹមហេង"
    },
    {
        "barcode": "171110644",
        "dpc": "03010614801",
        "name": "សាំង សោផា"
    },
    {
        "barcode": "171110645",
        "dpc": "03010614901",
        "name": "សុខ ឆែម"
    },
    {
        "barcode": "171110646",
        "dpc": "03010616001",
        "name": "ស៊ូ  វ៉ាន់"
    },
    {
        "barcode": "171110647",
        "dpc": "03010616101",
        "name": "អ៊ុំ   សារិទ្ធ"
    },
    {
        "barcode": "171110648",
        "dpc": "03010616401",
        "name": "អួន  ឈឿប"
    },
    {
        "barcode": "171110649",
        "dpc": "03010616901",
        "name": "វី  លីហួង"
    },
    {
        "barcode": "171110650",
        "dpc": "03010617501",
        "name": "ម៉ែន  សុវណ្ណ"
    },
    {
        "barcode": "171110651",
        "dpc": "03010617901",
        "name": "អ៊ិត  សម្ផស្ស"
    },
    {
        "barcode": "171110652",
        "dpc": "03010620001",
        "name": "សោម  សារឿង"
    },
    {
        "barcode": "171110653",
        "dpc": "03010620801",
        "name": "ហ៊ីម  ចាន់ធី"
    },
    {
        "barcode": "171110654",
        "dpc": "03010620901",
        "name": "ផន  វី"
    },
    {
        "barcode": "171110655",
        "dpc": "03010621201",
        "name": "ប៉ោ  ចិន្តា"
    },
    {
        "barcode": "171110656",
        "dpc": "03010621601",
        "name": "ម៉ែន   ប៊ុនរឿន"
    },
    {
        "barcode": "171110657",
        "dpc": "03010622201",
        "name": "កេត   អ័កតីដេ"
    },
    {
        "barcode": "171110658",
        "dpc": "03010622801",
        "name": "ប៉ិន  យួម"
    },
    {
        "barcode": "171110659",
        "dpc": "03010628501",
        "name": "ឌុង  វិបុល"
    },
    {
        "barcode": "171110660",
        "dpc": "03010629301",
        "name": "ឃី   តិញ"
    },
    {
        "barcode": "171110661",
        "dpc": "03010630401",
        "name": "លឹម  ឃាង"
    },
    {
        "barcode": "171110662",
        "dpc": "03010630901",
        "name": "ឆាយ  គឹមហួ"
    },
    {
        "barcode": "171110663",
        "dpc": "03010631301",
        "name": "ទុយ  សូនី"
    },
    {
        "barcode": "171110664",
        "dpc": "03010631601",
        "name": "ផា  លឿម ផ.  ក.  ភ."
    },
    {
        "barcode": "171110665",
        "dpc": "03010634401",
        "name": "អ៊ី  ហួង"
    },
    {
        "barcode": "171110666",
        "dpc": "03010634101",
        "name": "ស៊ីន សុភ័ក្រ្ត"
    },
    {
        "barcode": "171110667",
        "dpc": "03010634201",
        "name": "ថង សាវដ្តី"
    },
    {
        "barcode": "171110668",
        "dpc": "03010634301",
        "name": "ភោក រិទ្ធា"
    },
    {
        "barcode": "171110669",
        "dpc": "03010636001",
        "name": "ឆឹង សេរីវឌ្ឍន៍"
    },
    {
        "barcode": "171110670",
        "dpc": "03010636201",
        "name": "ម៉ៅ សុវណ្ណរ៉ា"
    },
    {
        "barcode": "171110671",
        "dpc": "03010634701",
        "name": "ចាន ឃាង"
    },
    {
        "barcode": "171110672",
        "dpc": "03010634801",
        "name": "ភឹម ផុន"
    },
    {
        "barcode": "171110673",
        "dpc": "03010634601",
        "name": "ហឿង សារ៉ាត់"
    },
    {
        "barcode": "171110674",
        "dpc": "03010635901",
        "name": "យ៉ាំ ចាន់ចិត្រា"
    },
    {
        "barcode": "171110675",
        "dpc": "03010634901",
        "name": "វ៉ន ឃាង"
    },
    {
        "barcode": "171110676",
        "dpc": "03010635301",
        "name": "ភា បញ្ញា"
    },
    {
        "barcode": "171110677",
        "dpc": "03010634501",
        "name": "ម៉េង សុខម៉ាន់"
    },
    {
        "barcode": "171110678",
        "dpc": "03010635701",
        "name": "អ៊ុយ គឹមឆៃ"
    },
    {
        "barcode": "171110679",
        "dpc": "03010635501",
        "name": "កែវ លីហ៊ុន"
    },
    {
        "barcode": "171110680",
        "dpc": "03010635201",
        "name": "តាក មករា"
    },
    {
        "barcode": "171110681",
        "dpc": "03010635001",
        "name": "អឿន អេង"
    },
    {
        "barcode": "171110682",
        "dpc": "03010635801",
        "name": "ប្រាក ឌីណា"
    },
    {
        "barcode": "171110683",
        "dpc": "03010635601",
        "name": "ហាក់ ចំរើន"
    },
    {
        "barcode": "171110684",
        "dpc": "03010643101",
        "name": "ផា រ៉ាវុធ"
    },
    {
        "barcode": "171110685",
        "dpc": "03010643201",
        "name": "ម៉ម ពៅ"
    },
    {
        "barcode": "171110686",
        "dpc": "03010643301",
        "name": "ជួប   ហាប់"
    },
    {
        "barcode": "171110687",
        "dpc": "03010639101",
        "name": "ហែម វន្ថា"
    },
    {
        "barcode": "171110688",
        "dpc": "03010640001",
        "name": "ថត រីណា"
    },
    {
        "barcode": "171110689",
        "dpc": "03010636301",
        "name": "រឹម សារឿន"
    },
    {
        "barcode": "171110690",
        "dpc": "03010636401",
        "name": "កង់  ចន្ថា"
    },
    {
        "barcode": "171110691",
        "dpc": "03010636501",
        "name": "សឺង ម៉ារិទ្ធ"
    },
    {
        "barcode": "171110692",
        "dpc": "03010636701",
        "name": "ហុង  ភីដា"
    },
    {
        "barcode": "171110693",
        "dpc": "03010636601",
        "name": "ទី គឹមហេង"
    },
    {
        "barcode": "171110694",
        "dpc": "03010636901",
        "name": "សយ សាភឿង"
    },
    {
        "barcode": "171110695",
        "dpc": "03010637201",
        "name": "ម៉ាន មារី"
    },
    {
        "barcode": "171110696",
        "dpc": "03010637101",
        "name": "សុខ ហាក"
    },
    {
        "barcode": "171110697",
        "dpc": "03010637001",
        "name": "ណុះ ម៉ាន់"
    },
    {
        "barcode": "171110698",
        "dpc": "03010637301",
        "name": "លី យូសុស"
    },
    {
        "barcode": "171110699",
        "dpc": "03010638401",
        "name": "ស៊ុន វន"
    },
    {
        "barcode": "171110700",
        "dpc": "03010638201",
        "name": "ឆឹង  ថន"
    },
    {
        "barcode": "171110701",
        "dpc": "03010638101",
        "name": "យុត សុភ័ណ្ឌ"
    },
    {
        "barcode": "171110702",
        "dpc": "03010638001",
        "name": "សៀង សុធឿន"
    },
    {
        "barcode": "171110703",
        "dpc": "03010638701",
        "name": "ម៉ាត់ ស្មាន់"
    },
    {
        "barcode": "171110704",
        "dpc": "03010637801",
        "name": "កែវ គឹមអេង"
    },
    {
        "barcode": "171110705",
        "dpc": "03010637701",
        "name": "តាំង ប៉េងហុង"
    },
    {
        "barcode": "171110706",
        "dpc": "03010637601",
        "name": "អ៊ូ ផល្លី"
    },
    {
        "barcode": "171110707",
        "dpc": "03010637501",
        "name": "ស៊ុម រៀម"
    },
    {
        "barcode": "171110708",
        "dpc": "03010639301",
        "name": "លឹម សុភា"
    },
    {
        "barcode": "171110709",
        "dpc": "03010639401",
        "name": "តាំង គឹមហេង"
    },
    {
        "barcode": "171110710",
        "dpc": "03010639501",
        "name": "យ៉ាំ ហាន់"
    },
    {
        "barcode": "171110711",
        "dpc": "03010638601",
        "name": "ផុន មករា"
    },
    {
        "barcode": "171110712",
        "dpc": "03010639601",
        "name": "អ៊ឹង ហួកឺ"
    },
    {
        "barcode": "171110713",
        "dpc": "03010639801",
        "name": "ចក ជូន ២"
    },
    {
        "barcode": "171110714",
        "dpc": "03010639701",
        "name": "ចក ណារ៉ង់ឌី"
    },
    {
        "barcode": "171110715",
        "dpc": "03010639901",
        "name": "ឥន សៅរិទ្ធ"
    },
    {
        "barcode": "171110716",
        "dpc": "03010640101",
        "name": "គឹម ផល្លា"
    },
    {
        "barcode": "171110717",
        "dpc": "03010640301",
        "name": "ខឹម សុផល"
    },
    {
        "barcode": "171110718",
        "dpc": "03010640501",
        "name": "ខេង សុខុម"
    },
    {
        "barcode": "171110719",
        "dpc": "03010640201",
        "name": "ឆែម វិចិត្រ"
    },
    {
        "barcode": "171110720",
        "dpc": "03010644701",
        "name": "ឈុំ ហេង"
    },
    {
        "barcode": "171110721",
        "dpc": "03010644601",
        "name": "ណែល ផុន"
    },
    {
        "barcode": "171110722",
        "dpc": "03010644501",
        "name": "ប៊ុន រ័ត្ន"
    },
    {
        "barcode": "171110723",
        "dpc": "03010644401",
        "name": "ងួន បាន"
    },
    {
        "barcode": "171110724",
        "dpc": "03010644301",
        "name": "យ៉ុង ឆៃយុត"
    },
    {
        "barcode": "171110725",
        "dpc": "03010644201",
        "name": "យិន ស៊ូ"
    },
    {
        "barcode": "171110726",
        "dpc": "03010644101",
        "name": "សៀម ភក្តី"
    },
    {
        "barcode": "171110727",
        "dpc": "03010643901",
        "name": "ផា  សិលា"
    },
    {
        "barcode": "171110728",
        "dpc": "03010643701",
        "name": "ប៉េង ប៉ូរ៉ា"
    },
    {
        "barcode": "171110729",
        "dpc": "03010643801",
        "name": "អៀ ខេមរា"
    },
    {
        "barcode": "171110730",
        "dpc": "03010643501",
        "name": "សាង សាវុធ"
    },
    {
        "barcode": "171110731",
        "dpc": "03010643601",
        "name": "ឃឿង តាន់ ២"
    },
    {
        "barcode": "171110732",
        "dpc": "03010643401",
        "name": "ប៉ូ ពៅ"
    },
    {
        "barcode": "171110733",
        "dpc": "03010645001",
        "name": "សាញ់ សែម"
    },
    {
        "barcode": "171110734",
        "dpc": "03010644801",
        "name": "ម៉ា សារ៉ុម"
    },
    {
        "barcode": "171110735",
        "dpc": "03010645601",
        "name": "បូលី ងាន់"
    },
    {
        "barcode": "171110736",
        "dpc": "03010645501",
        "name": "សៅ សុខុម"
    },
    {
        "barcode": "171110737",
        "dpc": "03010645301",
        "name": "ជេត វណ្ណី"
    },
    {
        "barcode": "171110738",
        "dpc": "03010645201",
        "name": "ម៉ៅ ឈឿន"
    },
    {
        "barcode": "171110739",
        "dpc": "03010646001",
        "name": "ស ហេង"
    },
    {
        "barcode": "171110740",
        "dpc": "03010645801",
        "name": "ជឺ ហ៊ង"
    },
    {
        "barcode": "171110741",
        "dpc": "03010645701",
        "name": "មឿង វុត្ថា"
    },
    {
        "barcode": "171110742",
        "dpc": "03010646601",
        "name": "ខាត់ សារិន"
    },
    {
        "barcode": "171110743",
        "dpc": "03010646501",
        "name": "ពេជ្រ ចំរើន"
    },
    {
        "barcode": "171110744",
        "dpc": "03010646401",
        "name": "ឈឹម គឹមលាង"
    },
    {
        "barcode": "171110745",
        "dpc": "03010646301",
        "name": "ម៉ុត សារួន"
    },
    {
        "barcode": "171110746",
        "dpc": "03010646201",
        "name": "ជា ថាវ៉ាន់"
    },
    {
        "barcode": "171110747",
        "dpc": "03010608001",
        "name": "យិន ឆលីវណ្ណ"
    },
    {
        "barcode": "171110748",
        "dpc": "03010603201",
        "name": "សៀន សេន"
    },
    {
        "barcode": "171110749",
        "dpc": "03010603101",
        "name": "ហេង អៀន"
    },
    {
        "barcode": "171110750",
        "dpc": "03010611601",
        "name": "ជ័យ ម៉ៅ"
    },
    {
        "barcode": "171110751",
        "dpc": "03010611801",
        "name": "ផ្លុង  ឆៃ"
    },
    {
        "barcode": "171110752",
        "dpc": "03010611501",
        "name": "ភួង ផល្លា"
    },
    {
        "barcode": "171110753",
        "dpc": "03010611401",
        "name": "ផន  សឿន"
    },
    {
        "barcode": "171110754",
        "dpc": "03010611301",
        "name": "យក ហាក់"
    },
    {
        "barcode": "171110755",
        "dpc": "03010611101",
        "name": "សេង ឆៃ"
    },
    {
        "barcode": "171110756",
        "dpc": "03010611001",
        "name": "អ៊ុក សារិន"
    },
    {
        "barcode": "171110757",
        "dpc": "03010610901",
        "name": "រិន ហោ"
    },
    {
        "barcode": "171110758",
        "dpc": "03010610801",
        "name": "ភួង សម្បត្តិ"
    },
    {
        "barcode": "171110759",
        "dpc": "03010610701",
        "name": "សាវឿត ទូច"
    },
    {
        "barcode": "171110760",
        "dpc": "03010610301",
        "name": "ជិវ  គឹមសាន"
    },
    {
        "barcode": "171110761",
        "dpc": "03010610501",
        "name": "ឃួន ឃឿប"
    },
    {
        "barcode": "171110762",
        "dpc": "03010609801",
        "name": "ជុំ សំអឿន"
    },
    {
        "barcode": "171110763",
        "dpc": "03010608301",
        "name": "ជឹង ភ័ក្រត្រា"
    },
    {
        "barcode": "171110764",
        "dpc": "03010608201",
        "name": "លឹម ស៊ីថន"
    },
    {
        "barcode": "171110765",
        "dpc": "03010608101",
        "name": "ប៊ុន យាន"
    },
    {
        "barcode": "171110766",
        "dpc": "03010607901",
        "name": "ផាច់ ផូរ"
    },
    {
        "barcode": "171110767",
        "dpc": "03010607801",
        "name": "ជា ប៊ុនលៀង"
    },
    {
        "barcode": "171110768",
        "dpc": "03010607501",
        "name": "ប្រាក់ ឃុន"
    },
    {
        "barcode": "171110769",
        "dpc": "03010607601",
        "name": "អូ ប៊ុននៀរ"
    },
    {
        "barcode": "171110770",
        "dpc": "03010607301",
        "name": "ហាស់ ភីណា"
    },
    {
        "barcode": "171110771",
        "dpc": "03010605101",
        "name": "ជិន យ៉ុម"
    },
    {
        "barcode": "171110772",
        "dpc": "03010609001",
        "name": "ហៃ សីហា"
    },
    {
        "barcode": "171110773",
        "dpc": "03010609101",
        "name": "សួន ហ៊ាន"
    },
    {
        "barcode": "171110774",
        "dpc": "03010609401",
        "name": "ឈៀង សំអាត"
    },
    {
        "barcode": "171110775",
        "dpc": "03010609501",
        "name": "អូច  សុផល"
    },
    {
        "barcode": "171110776",
        "dpc": "03010612001",
        "name": "ឈៀង  ស្រេង"
    },
    {
        "barcode": "171110777",
        "dpc": "03010611901",
        "name": "ដៀប  វណ្ណនី"
    },
    {
        "barcode": "171110778",
        "dpc": "03010613101",
        "name": "ជា សម្បត្តិ"
    },
    {
        "barcode": "171110779",
        "dpc": "03010613001",
        "name": "គង់ ឈួយ"
    },
    {
        "barcode": "171110780",
        "dpc": "03010612901",
        "name": "ឈឿន សេរីវុឌ្ឍ"
    },
    {
        "barcode": "171110781",
        "dpc": "03010612801",
        "name": "ឃឹម ង៉ុយ"
    },
    {
        "barcode": "171110782",
        "dpc": "03010612701",
        "name": "ប៉ូយ  លាភ"
    },
    {
        "barcode": "171110783",
        "dpc": "03010612601",
        "name": "ងិន  សារឿន"
    },
    {
        "barcode": "171110784",
        "dpc": "03010612501",
        "name": "សៀង  សារ៉ាត់"
    },
    {
        "barcode": "171110785",
        "dpc": "03010612301",
        "name": "ប្រាក់ ហេង"
    },
    {
        "barcode": "171110786",
        "dpc": "03010612101",
        "name": "គឹម  ង៉ោ"
    },
    {
        "barcode": "171110787",
        "dpc": "03010612201",
        "name": "ប្រាក់  ដាវី"
    },
    {
        "barcode": "171110788",
        "dpc": "03010609601",
        "name": "ស៊ីន ស៊ីន"
    },
    {
        "barcode": "171110789",
        "dpc": "03010608901",
        "name": "ហួត គឹមលី"
    },
    {
        "barcode": "171110790",
        "dpc": "03010609201",
        "name": "សេក វណ្ណឌី"
    },
    {
        "barcode": "171110791",
        "dpc": "03010609301",
        "name": "អេង ង៉ោ"
    },
    {
        "barcode": "171110792",
        "dpc": "03010605201",
        "name": "យស់ សុខន"
    },
    {
        "barcode": "171110793",
        "dpc": "03010605301",
        "name": "ទូច ស៊ីផាន់"
    },
    {
        "barcode": "171110794",
        "dpc": "03010605401",
        "name": "ជិន យ៉េន"
    },
    {
        "barcode": "171110795",
        "dpc": "03010605701",
        "name": "ប៉ាវ  ប៊ុនរឿង"
    },
    {
        "barcode": "171110796",
        "dpc": "03010605901",
        "name": "កា  ស៊ាន"
    },
    {
        "barcode": "171110797",
        "dpc": "03010613501",
        "name": "តាំ លី"
    },
    {
        "barcode": "171110798",
        "dpc": "03010613401",
        "name": "សាយ យី"
    },
    {
        "barcode": "171110799",
        "dpc": "03010613301",
        "name": "លឹម ប៊ុនពីវ"
    },
    {
        "barcode": "171110800",
        "dpc": "03010613201",
        "name": "ហៀង គឹមចេង"
    },
    {
        "barcode": "171110801",
        "dpc": "03010614201",
        "name": "សយ ធឿន"
    },
    {
        "barcode": "171110802",
        "dpc": "03010614101",
        "name": "ជួប លឿ"
    },
    {
        "barcode": "171110803",
        "dpc": "03010613901",
        "name": "អ៊ុក លន់"
    },
    {
        "barcode": "171110804",
        "dpc": "03010613801",
        "name": "សុខ សំអឿន"
    },
    {
        "barcode": "171110805",
        "dpc": "03010613701",
        "name": "វ៉ន សុវណ្ណ"
    },
    {
        "barcode": "171110806",
        "dpc": "03010614001",
        "name": "សាំង ប៊ុនថេន"
    },
    {
        "barcode": "171110807",
        "dpc": "03010613601",
        "name": "ដូង សំលេង"
    },
    {
        "barcode": "171110808",
        "dpc": "03010606001",
        "name": "សេង  ណៃ"
    },
    {
        "barcode": "171110809",
        "dpc": "03010602901",
        "name": "ឯម ទីណា"
    },
    {
        "barcode": "171110810",
        "dpc": "03010602801",
        "name": "នូ វណ្ណៈ"
    },
    {
        "barcode": "171110811",
        "dpc": "03010602501",
        "name": "ម៉ម សុខាល័យ"
    },
    {
        "barcode": "171110812",
        "dpc": "03010602401",
        "name": "អរ រ៉ាន់"
    },
    {
        "barcode": "171110813",
        "dpc": "03010602201",
        "name": "គុយ សារៀន"
    },
    {
        "barcode": "171110814",
        "dpc": "03010602301",
        "name": "គុយ សារ៉េត"
    },
    {
        "barcode": "171110815",
        "dpc": "03010602101",
        "name": "ចាន់ យ៉ា"
    },
    {
        "barcode": "171110816",
        "dpc": "03010602001",
        "name": "ហ៊ុន ហៀន"
    },
    {
        "barcode": "171110817",
        "dpc": "03010601901",
        "name": "សៀក សាមឌី"
    },
    {
        "barcode": "171110818",
        "dpc": "03010601801",
        "name": "ជុំ មួន"
    },
    {
        "barcode": "171110819",
        "dpc": "03010601701",
        "name": "វ៉ា ផារិន"
    },
    {
        "barcode": "171110820",
        "dpc": "03010601501",
        "name": "ជួប សាប៉ុន"
    },
    {
        "barcode": "171110821",
        "dpc": "03010600601",
        "name": "ថុក កៀត"
    },
    {
        "barcode": "171110822",
        "dpc": "03010600201",
        "name": "សឺន  ដានី"
    },
    {
        "barcode": "171110823",
        "dpc": "03010600501",
        "name": "ផាន់ លក្ខិណា"
    },
    {
        "barcode": "171110824",
        "dpc": "03010600101",
        "name": "ឈួយ វង"
    },
    {
        "barcode": "171110825",
        "dpc": "03010601101",
        "name": "ហេង ឌីណា"
    },
    {
        "barcode": "171110826",
        "dpc": "03010600301",
        "name": "វៀង ជា"
    },
    {
        "barcode": "171110827",
        "dpc": "03010600701",
        "name": "ម៉ាក ប៊ុនថន"
    },
    {
        "barcode": "171110828",
        "dpc": "03010600801",
        "name": "ខឹម តាន់"
    },
    {
        "barcode": "171110829",
        "dpc": "03010601401",
        "name": "ប៉ោ លក្ខិណា"
    },
    {
        "barcode": "171110830",
        "dpc": "03010600901",
        "name": "ហួង ម៉ានី"
    },
    {
        "barcode": "171110831",
        "dpc": "03010601301",
        "name": "ប៉ោ នី"
    },
    {
        "barcode": "171110832",
        "dpc": "03010601001",
        "name": "ឃួន យាន"
    },
    {
        "barcode": "171110833",
        "dpc": "03010603001",
        "name": "ប៉ូ  យឿន"
    },
    {
        "barcode": "171110834",
        "dpc": "03010600401",
        "name": "ស៊ុន យ៉ន"
    },
    {
        "barcode": "171110835",
        "dpc": "03010601601",
        "name": "កឺ  ស៊ុន"
    },
    {
        "barcode": "171110836",
        "dpc": "03010603401",
        "name": "សី សាខន"
    },
    {
        "barcode": "171110837",
        "dpc": "03010603501",
        "name": "ឆេង ហាប់"
    },
    {
        "barcode": "171110838",
        "dpc": "03010603601",
        "name": "ម៉ក មឿន"
    },
    {
        "barcode": "171110839",
        "dpc": "03010603701",
        "name": "ដន បាន"
    },
    {
        "barcode": "171110840",
        "dpc": "03010603801",
        "name": "សំ ពៅ"
    },
    {
        "barcode": "171110841",
        "dpc": "03010603901",
        "name": "តូច សូភី"
    },
    {
        "barcode": "171110842",
        "dpc": "03010604001",
        "name": "វ៉ាន់ ដាលីន"
    },
    {
        "barcode": "171110843",
        "dpc": "03010604101",
        "name": "សើ សាម៉េត"
    },
    {
        "barcode": "171110844",
        "dpc": "03010604201",
        "name": "ហា ជា"
    },
    {
        "barcode": "171110845",
        "dpc": "03010604301",
        "name": "ជុំ សុឃីម"
    },
    {
        "barcode": "171110846",
        "dpc": "03010604901",
        "name": "នាង សុខា"
    },
    {
        "barcode": "171110847",
        "dpc": "03010605001",
        "name": "ពុធ ឆេង"
    },
    {
        "barcode": "171110848",
        "dpc": "03010610201",
        "name": "រិន  មុន្នីវណ្ណ"
    },
    {
        "barcode": "171110849",
        "dpc": "03010610401",
        "name": "ជិវ  គឹមសាន"
    },
    {
        "barcode": "171110850",
        "dpc": "03010610101",
        "name": "ឈុំ ហេង"
    },
    {
        "barcode": "171110851",
        "dpc": "03010610001",
        "name": "ញ៉ាន គឹមនឿន"
    },
    {
        "barcode": "171110852",
        "dpc": "03010609901",
        "name": "ភាជ សំពណ៌"
    },
    {
        "barcode": "171110853",
        "dpc": "03010610601",
        "name": "ម៉ា សារុំ"
    },
    {
        "barcode": "171110854",
        "dpc": "03010608701",
        "name": "ឆោម ស៊ីម"
    },
    {
        "barcode": "171110855",
        "dpc": "03010608801",
        "name": "ផល រ៉ុម"
    },
    {
        "barcode": "171110856",
        "dpc": "03010608601",
        "name": "ទេព ម៉េងសួ"
    },
    {
        "barcode": "171110857",
        "dpc": "03010608401",
        "name": "ម៉ន សាវុន"
    },
    {
        "barcode": "171110858",
        "dpc": "03010608501",
        "name": "ផុន ដារ៉ារដ្ឋ"
    },
    {
        "barcode": "171110859",
        "dpc": "03010607401",
        "name": "ឈឿន សោ"
    },
    {
        "barcode": "171110860",
        "dpc": "03010607201",
        "name": "វ៉ាយ  យ៉ឹង"
    },
    {
        "barcode": "171110861",
        "dpc": "03010641901",
        "name": "កង់  ចានី"
    },
    {
        "barcode": "171110862",
        "dpc": "03010642001",
        "name": "ស្រី  ចំរើន"
    },
    {
        "barcode": "171110863",
        "dpc": "03010642701",
        "name": "កាក់ សុម៉ាលី"
    },
    {
        "barcode": "171110864",
        "dpc": "03010641701",
        "name": "ទិត  ដា"
    },
    {
        "barcode": "171110865",
        "dpc": "03010641601",
        "name": "ផេង   សាលី"
    },
    {
        "barcode": "171110866",
        "dpc": "03010641501",
        "name": "អ៊ុន  ពៅស័កញ្ញា"
    },
    {
        "barcode": "171110867",
        "dpc": "03010642201",
        "name": "នាង  សារ៉ាត់"
    },
    {
        "barcode": "171110868",
        "dpc": "03010642101",
        "name": "អ៊ាន  ហាក់លី"
    },
    {
        "barcode": "171110869",
        "dpc": "03010640601",
        "name": "ធីម ហូរ"
    },
    {
        "barcode": "171110870",
        "dpc": "03010640701",
        "name": "វុធ សុផល"
    },
    {
        "barcode": "171110871",
        "dpc": "03010641001",
        "name": "ងួន ពៅចិន្តា"
    },
    {
        "barcode": "171110872",
        "dpc": "03010642801",
        "name": "ទូច ស្រីអូន"
    },
    {
        "barcode": "171110873",
        "dpc": "03010642401",
        "name": "សុខ យ៉ា"
    },
    {
        "barcode": "171110874",
        "dpc": "03010642601",
        "name": "ឌុក  ដារ៉ារិទ្ធ"
    },
    {
        "barcode": "171110875",
        "dpc": "03010643001",
        "name": "អៀង យ៉ានិត"
    },
    {
        "barcode": "171110876",
        "dpc": "03010642901",
        "name": "កាន ចោម"
    },
    {
        "barcode": "171110877",
        "dpc": "03010642301",
        "name": "ពេជ្រ ចន្ថា"
    },
    {
        "barcode": "171110878",
        "dpc": "03010641201",
        "name": "ឌា សឿម"
    },
    {
        "barcode": "171110879",
        "dpc": "03010641101",
        "name": "កែវ សារ៉ន"
    },
    {
        "barcode": "171110880",
        "dpc": "03010638501",
        "name": "គឹម ហ៊ុន"
    },
    {
        "barcode": "171110881",
        "dpc": "03010638801",
        "name": "ព្រះវិហារជីវិតថ្មី"
    },
    {
        "barcode": "171110882",
        "dpc": "03010638901",
        "name": "ជេត  ណាត"
    },
    {
        "barcode": "171110883",
        "dpc": "03010639001",
        "name": "តាំង ឡៃ"
    },
    {
        "barcode": "171110884",
        "dpc": "03010637401",
        "name": "ឈួន  ចាន់ដាវី"
    },
    {
        "barcode": "171110885",
        "dpc": "03010638301",
        "name": "យាប់  មេត្តា"
    },
    {
        "barcode": "171110886",
        "dpc": "03010641401",
        "name": "ហែម  ចន្ធី"
    },
    {
        "barcode": "171110887",
        "dpc": "03010642501",
        "name": "ធៀម  នន"
    },
    {
        "barcode": "171110888",
        "dpc": "03010605501",
        "name": "អ៊ុន  សំអាត"
    },
    {
        "barcode": "171110889",
        "dpc": "03010611701",
        "name": "រីក  សុវណ្ណ"
    },
    {
        "barcode": "171110890",
        "dpc": "03010619501",
        "name": "ឡាំ  យាំង"
    },
    {
        "barcode": "171110891",
        "dpc": "03010622701",
        "name": "ណូ"
    },
    {
        "barcode": "171110892",
        "dpc": "03010628301",
        "name": "ប៊ុត  ទឺ"
    },
    {
        "barcode": "171110893",
        "dpc": "03010631201",
        "name": "វត្ត  បច្ឆា"
    },
    {
        "barcode": "171110894",
        "dpc": "03010631501",
        "name": "តុង  សុគុណ"
    },
    {
        "barcode": "171110895",
        "dpc": "03010631701",
        "name": "យូ  គឹមសេង"
    },
    {
        "barcode": "171110896",
        "dpc": "03010631901",
        "name": "គង់  សុលី"
    },
    {
        "barcode": "171110897",
        "dpc": "03010634001",
        "name": "កង  សុវណ្ណ"
    },
    {
        "barcode": "171110898",
        "dpc": "03010640801",
        "name": "ដាង  សុភា"
    },
    {
        "barcode": "171110899",
        "dpc": "03010640901",
        "name": "ម៉ី  សុផាន់ណារ៉ុង"
    },
    {
        "barcode": "171110900",
        "dpc": "03010647301",
        "name": "កេត ចាន់អូន"
    },
    {
        "barcode": "171110901",
        "dpc": "03010647401",
        "name": "ម៉ាង សុទ្ធ ២"
    },
    {
        "barcode": "171110902",
        "dpc": "03010647501",
        "name": "ប្រុក គឿន ១"
    },
    {
        "barcode": "171110903",
        "dpc": "03010647601",
        "name": "ប្រុក គឿន ២"
    },
    {
        "barcode": "171110904",
        "dpc": "03010647901",
        "name": "សូម សារ៉ាន់"
    },
    {
        "barcode": "171110905",
        "dpc": "03010647801",
        "name": "ជុំ  សំណង"
    },
    {
        "barcode": "171110906",
        "dpc": "03010647701",
        "name": "សាំង  ស៊ីណា"
    },
    {
        "barcode": "171110907",
        "dpc": "03010606501",
        "name": "សាត គឹមសាន្ត"
    },
    {
        "barcode": "171110908",
        "dpc": "03010606601",
        "name": "ទូច ស៊ីផាន់"
    },
    {
        "barcode": "171110909",
        "dpc": "03010606801",
        "name": "កែវ សេង"
    },
    {
        "barcode": "171110910",
        "dpc": "03010606901",
        "name": "លឹម សុភាព"
    },
    {
        "barcode": "171110911",
        "dpc": "03010607001",
        "name": "ធៀន ឡំ"
    },
    {
        "barcode": "171110912",
        "dpc": "03010646701",
        "name": "ពុល  សាង"
    },
    {
        "barcode": "171110913",
        "dpc": "03010646801",
        "name": "មួង ស៊ីផាន់"
    },
    {
        "barcode": "171110914",
        "dpc": "03010646901",
        "name": "ប៉ុក ប៊ុនធឿន"
    },
    {
        "barcode": "171110915",
        "dpc": "03010647001",
        "name": "អន សំអាត"
    },
    {
        "barcode": "171110916",
        "dpc": "03010647101",
        "name": "អ៊ូ សឿត"
    },
    {
        "barcode": "171110917",
        "dpc": "03010647201",
        "name": "សឿន ស៊ាត"
    },
    {
        "barcode": "171110918",
        "dpc": "03010606101",
        "name": "គឹម ម៉ារា"
    },
    {
        "barcode": "171110919",
        "dpc": "03010606201",
        "name": "ម៉ាច  មុយ"
    },
    {
        "barcode": "171110920",
        "dpc": "03010606401",
        "name": "អ៊ឹង ទឹត"
    },
    {
        "barcode": "171110921",
        "dpc": "03010604401",
        "name": "ដាន់  វុទ្ធី"
    },
    {
        "barcode": "171110922",
        "dpc": "03010604601",
        "name": "ថាញ់  យឿន"
    },
    {
        "barcode": "171110923",
        "dpc": "03010604701",
        "name": "ឡាំ   វ៉ាន់"
    },
    {
        "barcode": "171110924",
        "dpc": "03010607101",
        "name": "មណ្ឌលកុមារកំព្រា"
    },
    {
        "barcode": "171110925",
        "dpc": "03010648001",
        "name": "ផុន ស៊ីផាន"
    }
];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});