let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=
[
    {
        "barcode": "171111759",
        "dpc": "03012436401",
        "name": "ប៊ុតចាន់ ធី"
    },
    {
        "barcode": "171111760",
        "dpc": "03012436501",
        "name": "ជៀម ផារុំ"
    },
    {
        "barcode": "171111761",
        "dpc": "03012429801",
        "name": "សួន សុផល"
    },
    {
        "barcode": "171111762",
        "dpc": "03012424601",
        "name": "ហេង ឆាយ"
    },
    {
        "barcode": "171111763",
        "dpc": "03012422501",
        "name": "ចាយ បូរាន"
    },
    {
        "barcode": "171111764",
        "dpc": "03012414001",
        "name": "ហាយ ហួត"
    },
    {
        "barcode": "171111765",
        "dpc": "03012427001",
        "name": "លី ទ្រឿង"
    },
    {
        "barcode": "171111766",
        "dpc": "03012427101",
        "name": "ឈៀង គឹមឈួន"
    },
    {
        "barcode": "171111767",
        "dpc": "03012427201",
        "name": "ជី យិន"
    },
    {
        "barcode": "171111768",
        "dpc": "03012413701",
        "name": "ផាន ទិត្យ"
    },
    {
        "barcode": "171111769",
        "dpc": "03012440001",
        "name": "អ៊ុំ ស៊ុយ"
    },
    {
        "barcode": "171111770",
        "dpc": "03012400501",
        "name": "នី ស្រីម៉ៅ"
    },
    {
        "barcode": "171111771",
        "dpc": "03012436001",
        "name": "ដែង វណ្ណនី"
    },
    {
        "barcode": "171111772",
        "dpc": "03012424501",
        "name": "ហេង ចាន់ថន"
    },
    {
        "barcode": "171111773",
        "dpc": "03012406201",
        "name": "លី ហុង"
    },
    {
        "barcode": "171111774",
        "dpc": "03012418601",
        "name": "សាញ់ សាន្ត"
    },
    {
        "barcode": "171111775",
        "dpc": "03012421901",
        "name": "ជឺ សំណាង"
    },
    {
        "barcode": "171111776",
        "dpc": "03012436801",
        "name": "ឆឹង ឆន"
    },
    {
        "barcode": "171111777",
        "dpc": "03012423101",
        "name": "សុខ សុភាព"
    },
    {
        "barcode": "171111778",
        "dpc": "03012422001",
        "name": "ធី សុផន"
    },
    {
        "barcode": "171111779",
        "dpc": "03012429901",
        "name": "ស៊ីម សារី"
    },
    {
        "barcode": "171111780",
        "dpc": "03012403901",
        "name": "ង៉ែត ប្រម"
    },
    {
        "barcode": "171111781",
        "dpc": "03012423001",
        "name": "ប៊ុត សាវង្ស២(អាស្រម)"
    },
    {
        "barcode": "171111782",
        "dpc": "03012430101",
        "name": "ខៀវ សែ"
    },
    {
        "barcode": "171111783",
        "dpc": "03012436101",
        "name": "ហេង កាវជា"
    },
    {
        "barcode": "171111784",
        "dpc": "03012430401",
        "name": "យឿត ស៊ីថា"
    },
    {
        "barcode": "171111785",
        "dpc": "03012414401",
        "name": "យឹម សម្រស់"
    },
    {
        "barcode": "171111786",
        "dpc": "03012442801",
        "name": "យិន ហ៊ាប"
    },
    {
        "barcode": "171111787",
        "dpc": "03012437101",
        "name": "ចាន់ ម៉េង"
    },
    {
        "barcode": "171111788",
        "dpc": "03012438701",
        "name": "ណន អុន"
    },
    {
        "barcode": "171111789",
        "dpc": "03012440901",
        "name": "អ៊ា មករា"
    },
    {
        "barcode": "171111790",
        "dpc": "03012420301",
        "name": "ស៊ុន សុផាត"
    },
    {
        "barcode": "171111791",
        "dpc": "03012420401",
        "name": "បេង ចេង"
    },
    {
        "barcode": "171111792",
        "dpc": "03012434301",
        "name": "វង្ស សុខយ៉េម"
    },
    {
        "barcode": "171111793",
        "dpc": "03012437001",
        "name": "ឡុង សំបូរ"
    },
    {
        "barcode": "171111794",
        "dpc": "03012433001",
        "name": "អ៊ុំ វណ្ណៈ"
    },
    {
        "barcode": "171111795",
        "dpc": "03012447001",
        "name": "ចត សុផានី"
    },
    {
        "barcode": "171111796",
        "dpc": "03012436301",
        "name": "សេង សារ៉េត"
    },
    {
        "barcode": "171111797",
        "dpc": "03012446901",
        "name": "សុខ ធូក"
    },
    {
        "barcode": "171111798",
        "dpc": "03012443201",
        "name": "សេង នី"
    },
    {
        "barcode": "171111799",
        "dpc": "03012402301",
        "name": "រ៉ាយ នី"
    },
    {
        "barcode": "171111800",
        "dpc": "03012403001",
        "name": "ឆោម ឆដា"
    },
    {
        "barcode": "171111801",
        "dpc": "03012439301",
        "name": "ប៉ាង គឹមស៊ា"
    },
    {
        "barcode": "171111802",
        "dpc": "03012418901",
        "name": "អយ ដេវី"
    },
    {
        "barcode": "171111803",
        "dpc": "03012430201",
        "name": "ហម សាម៉េត"
    },
    {
        "barcode": "171111804",
        "dpc": "03012414301",
        "name": "ទូច ជឹម"
    },
    {
        "barcode": "171111805",
        "dpc": "03012421701",
        "name": "គង់ ជុនដា"
    },
    {
        "barcode": "171111806",
        "dpc": "03012430701",
        "name": "ជូ កែវពិសិទ្ធ"
    },
    {
        "barcode": "171111807",
        "dpc": "03012414701",
        "name": "ម៉ែន សំបូរ"
    },
    {
        "barcode": "171111808",
        "dpc": "03012400301",
        "name": "ឡុង ផាវុទ្ធីយ៉ា"
    },
    {
        "barcode": "171111809",
        "dpc": "03012447401",
        "name": "លី ស៊ីណា"
    },
    {
        "barcode": "171111810",
        "dpc": "03012424701",
        "name": "លី មន្នី"
    },
    {
        "barcode": "171111811",
        "dpc": "03012413501",
        "name": "នរៈ កិត្យា"
    },
    {
        "barcode": "171111812",
        "dpc": "03012413601",
        "name": "សែម សារ៉ាត់"
    },
    {
        "barcode": "171111813",
        "dpc": "03012411901",
        "name": "លោភ សំអាង"
    },
    {
        "barcode": "171111814",
        "dpc": "03012402101",
        "name": "ប៉ង សុភ័ណ្ឌ"
    },
    {
        "barcode": "171111815",
        "dpc": "03012406001",
        "name": "ឃឹម សុគន្ធា"
    },
    {
        "barcode": "171111816",
        "dpc": "03012421001",
        "name": "អ៊ី សេងឡុង"
    },
    {
        "barcode": "171111817",
        "dpc": "03012413901",
        "name": "តាំង សុខកាង"
    },
    {
        "barcode": "171111818",
        "dpc": "03012438801",
        "name": "អឿន តុញ"
    },
    {
        "barcode": "171111819",
        "dpc": "03012433201",
        "name": "ប្រាក់ ចន្ធូ"
    },
    {
        "barcode": "171111820",
        "dpc": "03012414201",
        "name": "ស៊្រីន សុគន្ធថូ"
    },
    {
        "barcode": "171111821",
        "dpc": "03012414601",
        "name": "ម៉ុន សារិទ្ធ"
    },
    {
        "barcode": "171111822",
        "dpc": "03012414501",
        "name": "មាស ស្រី"
    },
    {
        "barcode": "171111823",
        "dpc": "03012445101",
        "name": "គីវ គឹមផា"
    },
    {
        "barcode": "171111824",
        "dpc": "03012432301",
        "name": "ពេជ្រ សារិទ្ធ"
    },
    {
        "barcode": "171111825",
        "dpc": "03012430501",
        "name": "អ៊ី រី"
    },
    {
        "barcode": "171111826",
        "dpc": "03012405101",
        "name": "តាំង មុយយូម"
    },
    {
        "barcode": "171111827",
        "dpc": "03012414801",
        "name": "ញេប គង់"
    },
    {
        "barcode": "171111828",
        "dpc": "03012414901",
        "name": "ដូង ស៊ីថា"
    },
    {
        "barcode": "171111829",
        "dpc": "03012423201",
        "name": "ដា ស៊ីដេត"
    },
    {
        "barcode": "171111830",
        "dpc": "03012419101",
        "name": "ម៉ាន់ ប្រុស"
    },
    {
        "barcode": "171111831",
        "dpc": "03012411501",
        "name": "លាង ផាន់ដេត"
    },
    {
        "barcode": "171111832",
        "dpc": "03012411601",
        "name": "សំ ចិន្តា"
    },
    {
        "barcode": "171111833",
        "dpc": "03012413401",
        "name": "ស្រួច លីម"
    },
    {
        "barcode": "171111834",
        "dpc": "03012434401",
        "name": "រស់ អួម"
    },
    {
        "barcode": "171111835",
        "dpc": "03012401601",
        "name": "គឹម អាន ២"
    },
    {
        "barcode": "171111836",
        "dpc": "03012433501",
        "name": "សន សុផល"
    },
    {
        "barcode": "171111837",
        "dpc": "03012418801",
        "name": "រាយ សំអាត"
    },
    {
        "barcode": "171111838",
        "dpc": "03012404901",
        "name": "សៅ សំណាង"
    },
    {
        "barcode": "171111839",
        "dpc": "03012427501",
        "name": "ថន សុភារម្យ"
    },
    {
        "barcode": "171111840",
        "dpc": "03012427601",
        "name": "ថេត នារ័ត្ត"
    },
    {
        "barcode": "171111841",
        "dpc": "03012427701",
        "name": "ភិត ទុន"
    },
    {
        "barcode": "171111842",
        "dpc": "03012442901",
        "name": "ព្រុយ ហ៊ីង"
    },
    {
        "barcode": "171111843",
        "dpc": "03012438901",
        "name": "កើង ស្រីយ៉ា"
    },
    {
        "barcode": "171111844",
        "dpc": "03012436601",
        "name": "ឈុន បូរ៉ា"
    },
    {
        "barcode": "171111845",
        "dpc": "03012439801",
        "name": "ចាន់ សម្បត្តិ"
    },
    {
        "barcode": "171111846",
        "dpc": "03012439101",
        "name": "សំ ប្រសិទ្ធ"
    },
    {
        "barcode": "171111847",
        "dpc": "03012439701",
        "name": "ទិត សេដ្ឋា"
    },
    {
        "barcode": "171111848",
        "dpc": "03012447601",
        "name": "ថាច់ សុខពិសី"
    },
    {
        "barcode": "171111849",
        "dpc": "03012433901",
        "name": "មាស ស៊ីណាត"
    },
    {
        "barcode": "171111850",
        "dpc": "03012404101",
        "name": "ណៃ រតនា"
    },
    {
        "barcode": "171111851",
        "dpc": "03012447901",
        "name": "ភិន ណៃ"
    },
    {
        "barcode": "171111852",
        "dpc": "03012447501",
        "name": "ញៀវ ញឹម"
    },
    {
        "barcode": "171111853",
        "dpc": "03012427901",
        "name": "ប៉ោ វ៉ាត"
    },
    {
        "barcode": "171111854",
        "dpc": "03012413301",
        "name": "នូ សាណាល់"
    },
    {
        "barcode": "171111855",
        "dpc": "03012440101",
        "name": "តាន់ វឌ្ឍនី"
    },
    {
        "barcode": "171111856",
        "dpc": "03012440201",
        "name": "ពេញ ដារ៉ារដ្ឋ"
    },
    {
        "barcode": "171111857",
        "dpc": "03012440301",
        "name": "គឹម សង្ហា"
    },
    {
        "barcode": "171111858",
        "dpc": "03012440401",
        "name": "សែប សុផល"
    },
    {
        "barcode": "171111859",
        "dpc": "03012440501",
        "name": "ហូរ រិម"
    },
    {
        "barcode": "171111860",
        "dpc": "03012445601",
        "name": "ញ៉ូវ ចាន់រ៉ា"
    },
    {
        "barcode": "171111861",
        "dpc": "03012440701",
        "name": "ពេជ្រ សុខប៉ូ"
    },
    {
        "barcode": "171111862",
        "dpc": "03012440801",
        "name": "លឹម សុធី"
    },
    {
        "barcode": "171111863",
        "dpc": "03012447201",
        "name": "រ៉ុង ស៊ីដែន"
    },
    {
        "barcode": "171111864",
        "dpc": "03012436201",
        "name": "គឿន រ៉ូម៉ា"
    },
    {
        "barcode": "171111865",
        "dpc": "03012405301",
        "name": "ឡុង ប៊ុនសេង"
    },
    {
        "barcode": "171111866",
        "dpc": "03012427301",
        "name": "ព្រហ្ម សម្បត្តិ"
    },
    {
        "barcode": "171111867",
        "dpc": "03012432501",
        "name": "វ៉ាត ស៊ីម"
    },
    {
        "barcode": "171111868",
        "dpc": "03012400401",
        "name": "ឡេង ពៅ"
    },
    {
        "barcode": "171111869",
        "dpc": "03012400601",
        "name": "គឹម ពន្លក"
    },
    {
        "barcode": "171111870",
        "dpc": "03012400701",
        "name": "សុខ សេង"
    },
    {
        "barcode": "171111871",
        "dpc": "03012401101",
        "name": "ហុង ហ៊"
    },
    {
        "barcode": "171111872",
        "dpc": "03012401501",
        "name": "ទូច គឹមសាន"
    },
    {
        "barcode": "171111873",
        "dpc": "03012401801",
        "name": "ឡូវ តេកហេង"
    },
    {
        "barcode": "171111874",
        "dpc": "03012402901",
        "name": "ហេង ណារិទ្ធ"
    },
    {
        "barcode": "171111875",
        "dpc": "03012404001",
        "name": "ស៊ុម សំណាង"
    },
    {
        "barcode": "171111876",
        "dpc": "03012404701",
        "name": "ឃុន វ៉ាន់ថា"
    },
    {
        "barcode": "171111877",
        "dpc": "03012405001",
        "name": "ស៊ីម ឡៃ"
    },
    {
        "barcode": "171111878",
        "dpc": "03012407601",
        "name": "ប៊ូ ប៊ុនសុង"
    },
    {
        "barcode": "171111879",
        "dpc": "03012408201",
        "name": "ភិន ស៊ីដែន"
    },
    {
        "barcode": "171111880",
        "dpc": "03012409901",
        "name": "ឥន សុវណ្ណា"
    },
    {
        "barcode": "171111881",
        "dpc": "03012411301",
        "name": "អ៊ូ វ៉ាន់ធឿន"
    },
    {
        "barcode": "171111882",
        "dpc": "03012411401",
        "name": "ឈៀង សុភី"
    },
    {
        "barcode": "171111883",
        "dpc": "03012413001",
        "name": "អូច អែម"
    },
    {
        "barcode": "171111884",
        "dpc": "03012415901",
        "name": "ភីវ ចំរើន"
    },
    {
        "barcode": "171111885",
        "dpc": "03012416101",
        "name": "ឈុន សម្បត្តិ"
    },
    {
        "barcode": "171111886",
        "dpc": "03012416601",
        "name": "ទូច មករា"
    },
    {
        "barcode": "171111887",
        "dpc": "03012418001",
        "name": "គង់ បណ្តូល"
    },
    {
        "barcode": "171111888",
        "dpc": "03012418201",
        "name": "លឿង សុភក្ត្រ័"
    },
    {
        "barcode": "171111889",
        "dpc": "03012418401",
        "name": "ចែម ធី"
    },
    {
        "barcode": "171111890",
        "dpc": "03012419201",
        "name": "សែម ទូច"
    },
    {
        "barcode": "171111891",
        "dpc": "03012419401",
        "name": "រ៉ែម បូរ៉ា"
    },
    {
        "barcode": "171111892",
        "dpc": "03012419601",
        "name": "អំ ផល្លី"
    },
    {
        "barcode": "171111893",
        "dpc": "03012419701",
        "name": "លី ហុង"
    },
    {
        "barcode": "171111894",
        "dpc": "03012420201",
        "name": "តាន់ ស៊ុនលាង"
    },
    {
        "barcode": "171111895",
        "dpc": "03012421301",
        "name": "ឈួរ ម៉េងឆ័រ"
    },
    {
        "barcode": "171111896",
        "dpc": "03012421501",
        "name": "សមាគមន៍"
    },
    {
        "barcode": "171111897",
        "dpc": "03012421601",
        "name": "សេង ដាវ៉ីត"
    },
    {
        "barcode": "171111898",
        "dpc": "03012422101",
        "name": "អួង ណារ៉ុម"
    },
    {
        "barcode": "171111899",
        "dpc": "03012422201",
        "name": "ឆាត់ ឆាយមោរ៉ា"
    },
    {
        "barcode": "171111900",
        "dpc": "03012422301",
        "name": "លត យ៉ុម"
    },
    {
        "barcode": "171111901",
        "dpc": "03012422401",
        "name": "ទូត រុំម្លាស់ ២"
    },
    {
        "barcode": "171111902",
        "dpc": "03012423501",
        "name": "ឃឿង ហ៊ួ"
    },
    {
        "barcode": "171111903",
        "dpc": "03012423901",
        "name": "សុខ សូនី"
    },
    {
        "barcode": "171111904",
        "dpc": "03012426101",
        "name": "ម៉ិល ស៊ុត"
    },
    {
        "barcode": "171111905",
        "dpc": "03012426301",
        "name": "លី មាលីស"
    },
    {
        "barcode": "171111906",
        "dpc": "03012426701",
        "name": "តាំង សៀងហៃ"
    },
    {
        "barcode": "171111907",
        "dpc": "03012428801",
        "name": "ឆេង ប៊ុនថេង"
    },
    {
        "barcode": "171111908",
        "dpc": "03012428901",
        "name": "បឿន យិក"
    },
    {
        "barcode": "171111909",
        "dpc": "03012429401",
        "name": "ឃីម ប៊ុនផេង"
    },
    {
        "barcode": "171111910",
        "dpc": "03012429501",
        "name": "គាំ សុផល"
    },
    {
        "barcode": "171111911",
        "dpc": "03012429601",
        "name": "គង់ រុំ"
    },
    {
        "barcode": "171111912",
        "dpc": "03012430001",
        "name": "ងី ឡាក់"
    },
    {
        "barcode": "171111913",
        "dpc": "03012432201",
        "name": "វ៉ា មុន្នីរដ្ឋ"
    },
    {
        "barcode": "171111914",
        "dpc": "03012432901",
        "name": "យ៉ម ចំរើន"
    },
    {
        "barcode": "171111915",
        "dpc": "03012433601",
        "name": "ជា ផល្លា"
    },
    {
        "barcode": "171111916",
        "dpc": "03012434001",
        "name": "ប៊ុន សួលាងសុង"
    },
    {
        "barcode": "171111917",
        "dpc": "03012435701",
        "name": "ម៉ៅ ធីតា"
    },
    {
        "barcode": "171111918",
        "dpc": "03012435801",
        "name": "វ៉ាន សុឃីម"
    },
    {
        "barcode": "171111919",
        "dpc": "03012436701",
        "name": "អឿម ចាន់ណារដ្ឋ"
    },
    {
        "barcode": "171111920",
        "dpc": "03012437301",
        "name": "គឹម សុខសាន្ត"
    },
    {
        "barcode": "171111921",
        "dpc": "03012437401",
        "name": "ឡុង ពៅ"
    },
    {
        "barcode": "171111922",
        "dpc": "03012438501",
        "name": "ណៃ សុឃាង"
    },
    {
        "barcode": "171111923",
        "dpc": "03012439501",
        "name": "ផុន វណ្ណនិត"
    },
    {
        "barcode": "171111924",
        "dpc": "03012439901",
        "name": "អ៊ុង យឿន"
    },
    {
        "barcode": "171111925",
        "dpc": "03012440601",
        "name": "នូ ផល្លី"
    },
    {
        "barcode": "171111926",
        "dpc": "03012441101",
        "name": "ទី សុភិន"
    },
    {
        "barcode": "171111927",
        "dpc": "03012441701",
        "name": "អ៊ាន ធឿន"
    },
    {
        "barcode": "171111928",
        "dpc": "03012442201",
        "name": "សាលាបឋមសិក្សាអន្លង់វិល"
    },
    {
        "barcode": "171111929",
        "dpc": "03012442301",
        "name": "លី រតនៈ"
    },
    {
        "barcode": "171111930",
        "dpc": "03012442501",
        "name": "សុខ សាមុត"
    },
    {
        "barcode": "171111931",
        "dpc": "03012443001",
        "name": "មាស កុយ"
    },
    {
        "barcode": "171111932",
        "dpc": "03012443601",
        "name": "លឿង សុតុល"
    },
    {
        "barcode": "171111933",
        "dpc": "03012444301",
        "name": "ប្រុក គឿន ៤"
    },
    {
        "barcode": "171111934",
        "dpc": "03012444801",
        "name": "ម៉ែន ផាត"
    },
    {
        "barcode": "171111935",
        "dpc": "03012444901",
        "name": "ហង់ បូរីណា"
    },
    {
        "barcode": "171111936",
        "dpc": "03012445201",
        "name": "ញ៉ុក ចំរើន"
    },
    {
        "barcode": "171111937",
        "dpc": "03012445301",
        "name": "ម៉ែន ផល្លី"
    },
    {
        "barcode": "171111938",
        "dpc": "03012445401",
        "name": "ងួន ហ្សឺឌី"
    },
    {
        "barcode": "171111939",
        "dpc": "03012445501",
        "name": "វែង គឹមលី"
    },
    {
        "barcode": "171111940",
        "dpc": "03012445901",
        "name": "ខាត់ ហ៊ួរ"
    },
    {
        "barcode": "171111941",
        "dpc": "03012446501",
        "name": "សិទ្ធិ ហុងស៊ិន"
    },
    {
        "barcode": "171111942",
        "dpc": "03012447101",
        "name": "ទី សុខ"
    },
    {
        "barcode": "171111943",
        "dpc": "03012447701",
        "name": "នុន សំបូរ"
    },
    {
        "barcode": "171111944",
        "dpc": "03012447801",
        "name": "លី យ៉ាត"
    },
    {
        "barcode": "171111945",
        "dpc": "03012418101",
        "name": "ប៊ុន រ៉ាឌី"
    },
    {
        "barcode": "171111946",
        "dpc": "03012434701",
        "name": "ឈឹន ឈុន"
    },
    {
        "barcode": "171111947",
        "dpc": "03012402001",
        "name": "អៀប ផាត"
    },
    {
        "barcode": "171111948",
        "dpc": "03012420801",
        "name": "ងិន ពៅ"
    },
    {
        "barcode": "171111949",
        "dpc": "03012443401",
        "name": "ហួត ឆេងលី"
    },
    {
        "barcode": "171111950",
        "dpc": "03012429201",
        "name": "លួង ប្រាថ្នា"
    },
    {
        "barcode": "171111951",
        "dpc": "03012433101",
        "name": "ង៉ែត ផារិន"
    },
    {
        "barcode": "171111952",
        "dpc": "03012441001",
        "name": "ទុំ ស៊ីណាត"
    },
    {
        "barcode": "171111953",
        "dpc": "03012445701",
        "name": "ស៊ុយ សំណាង"
    },
    {
        "barcode": "171111954",
        "dpc": "03012412301",
        "name": "ទិត្យ ចន្នី"
    },
    {
        "barcode": "171111955",
        "dpc": "03012434901",
        "name": "មល់ សាហឿម"
    },
    {
        "barcode": "171111956",
        "dpc": "03012438201",
        "name": "ហ៊ុន ហ៊ី"
    },
    {
        "barcode": "171111957",
        "dpc": "03012438601",
        "name": "ជួន សុផុន"
    },
    {
        "barcode": "171111958",
        "dpc": "03012403101",
        "name": "ពេជ្រ ស្រីកែវ"
    },
    {
        "barcode": "171111959",
        "dpc": "03012445801",
        "name": "វុត ស៊ីនួន"
    },
    {
        "barcode": "171111960",
        "dpc": "03012420701",
        "name": "អៀប រដ្ឋា"
    },
    {
        "barcode": "171111961",
        "dpc": "03012402201",
        "name": "ឡុង ប៊ុនម៉េង"
    },
    {
        "barcode": "171111962",
        "dpc": "03012424901",
        "name": "ម៉ី អេង"
    },
    {
        "barcode": "171111963",
        "dpc": "03012406101",
        "name": "គី ឋាមរ៉ា"
    },
    {
        "barcode": "171111964",
        "dpc": "03012432401",
        "name": "តាង ម៉ារីន"
    },
    {
        "barcode": "171111965",
        "dpc": "03012422801",
        "name": "រឿម កង"
    },
    {
        "barcode": "171111966",
        "dpc": "03012415801",
        "name": "ពុំ ភិរម្យ"
    },
    {
        "barcode": "171111967",
        "dpc": "03012438401",
        "name": "យ៉ាំ ចិត្រា"
    },
    {
        "barcode": "171111968",
        "dpc": "03012415501",
        "name": "ឡាំង លីអៀង"
    },
    {
        "barcode": "171111969",
        "dpc": "03012444601",
        "name": "ភឿក ឡុងឌី"
    },
    {
        "barcode": "171111970",
        "dpc": "03012415701",
        "name": "អ៊ុំ អង"
    },
    {
        "barcode": "171111971",
        "dpc": "03012444701",
        "name": "ឡុង ម៉ារ៉ា"
    },
    {
        "barcode": "171111972",
        "dpc": "03012404201",
        "name": "លី ហេង"
    },
    {
        "barcode": "171111973",
        "dpc": "03012439001",
        "name": "ទូច ផានី"
    },
    {
        "barcode": "171111974",
        "dpc": "03012430901",
        "name": "ព្រំ ឈឺន"
    },
    {
        "barcode": "171111975",
        "dpc": "03012431001",
        "name": "ឆាយ រិទ្ធី"
    },
    {
        "barcode": "171111976",
        "dpc": "03012431101",
        "name": "ទូច ចានណារី"
    },
    {
        "barcode": "171111977",
        "dpc": "03012412401",
        "name": "សយ វ័យ"
    },
    {
        "barcode": "171111978",
        "dpc": "03012412501",
        "name": "ទូន ណូយ"
    },
    {
        "barcode": "171111979",
        "dpc": "03012435101",
        "name": "ពេជ្រ សុភា"
    },
    {
        "barcode": "171111980",
        "dpc": "03012438101",
        "name": "ឡាយ វ៉ិត"
    },
    {
        "barcode": "171111981",
        "dpc": "03012435001",
        "name": "អ៊ុក សុវណ្ណ"
    },
    {
        "barcode": "171111982",
        "dpc": "03012412801",
        "name": "ប៊ូ សុជាត"
    },
    {
        "barcode": "171111983",
        "dpc": "03012438301",
        "name": "ហួន ចិត្រា"
    },
    {
        "barcode": "171111984",
        "dpc": "03012438001",
        "name": "សុខ នឿន"
    },
    {
        "barcode": "171111985",
        "dpc": "03012425101",
        "name": "ខេង ផល្លា"
    },
    {
        "barcode": "171111986",
        "dpc": "03012412701",
        "name": "រស វិចិត្រ"
    },
    {
        "barcode": "171111987",
        "dpc": "03012412601",
        "name": "យុត សោភ័ណ្ឌ"
    },
    {
        "barcode": "171111988",
        "dpc": "03012403201",
        "name": "ពេជ្រ សេរីទុំ"
    },
    {
        "barcode": "171111989",
        "dpc": "03012444401",
        "name": "សាន់ សល់"
    },
    {
        "barcode": "171111990",
        "dpc": "03012400901",
        "name": "ចូត ប៊ុនណាវី"
    },
    {
        "barcode": "171111991",
        "dpc": "03012405601",
        "name": "ហាក់ ស៊ី"
    },
    {
        "barcode": "171111992",
        "dpc": "03012444501",
        "name": "ប៉ុញ សុវណ្ណរិទ្ធ ២"
    },
    {
        "barcode": "171111993",
        "dpc": "03012405501",
        "name": "ឆែម ប៊ុនធឿន"
    },
    {
        "barcode": "171111994",
        "dpc": "03012417401",
        "name": "អុក គីមឡា"
    },
    {
        "barcode": "171111995",
        "dpc": "03012417501",
        "name": "ឈុន សារិទ្ធ"
    },
    {
        "barcode": "171111996",
        "dpc": "03012428401",
        "name": "អ៊ឹង គឺ"
    },
    {
        "barcode": "171111997",
        "dpc": "03012412001",
        "name": "លី សុផល"
    },
    {
        "barcode": "171111998",
        "dpc": "03012428201",
        "name": "ខេង សុធា"
    },
    {
        "barcode": "171111999",
        "dpc": "03012443301",
        "name": "អ៊ុច សាវន"
    },
    {
        "barcode": "171112000",
        "dpc": "03012404601",
        "name": "យឿន ប៊ុនធី"
    },
    {
        "barcode": "171112001",
        "dpc": "03012416001",
        "name": "លី ហាក"
    },
    {
        "barcode": "171112002",
        "dpc": "03012402801",
        "name": "ឈឹម សារ៉ន"
    },
    {
        "barcode": "171112003",
        "dpc": "03012408501",
        "name": "ងិន សាវុន"
    },
    {
        "barcode": "171112004",
        "dpc": "03012408601",
        "name": "ម៉ែន ឆាយ"
    },
    {
        "barcode": "171112005",
        "dpc": "03012408801",
        "name": "ចាន សាវ៉ន"
    },
    {
        "barcode": "171112006",
        "dpc": "03012408901",
        "name": "ខៀវ សាវឿន"
    },
    {
        "barcode": "171112007",
        "dpc": "03012409001",
        "name": "ថន ប៊ុនថុង"
    },
    {
        "barcode": "171112008",
        "dpc": "03012409101",
        "name": "អ៊ុយ ម៉ៃ"
    },
    {
        "barcode": "171112009",
        "dpc": "03012409201",
        "name": "សុខ ប៊ុនធឿន"
    },
    {
        "barcode": "171112010",
        "dpc": "03012409301",
        "name": "ពៅ ឃួន"
    },
    {
        "barcode": "171112011",
        "dpc": "03012409401",
        "name": "ពៅ ហ៊ុច"
    },
    {
        "barcode": "171112012",
        "dpc": "03012409501",
        "name": "ង៉ែត សុភ័ណ"
    },
    {
        "barcode": "171112013",
        "dpc": "03012409601",
        "name": "អួម សុភាព"
    },
    {
        "barcode": "171112014",
        "dpc": "03012410201",
        "name": "ស៊ុន សុភាព"
    },
    {
        "barcode": "171112015",
        "dpc": "03012410101",
        "name": "ផុន ស៊ីណាត"
    },
    {
        "barcode": "171112016",
        "dpc": "03012413801",
        "name": "ចាន ស៊ីថា"
    },
    {
        "barcode": "171112017",
        "dpc": "03012410001",
        "name": "ប្រាក់ យ៉ា"
    },
    {
        "barcode": "171112018",
        "dpc": "03012410301",
        "name": "សូ ចាន់ថា"
    },
    {
        "barcode": "171112019",
        "dpc": "03012409801",
        "name": "ពៅ វី"
    },
    {
        "barcode": "171112020",
        "dpc": "03012409701",
        "name": "ឡុង ខុន"
    },
    {
        "barcode": "171112021",
        "dpc": "03012402501",
        "name": "សុខ ធឹមហ៊ាង"
    },
    {
        "barcode": "171112022",
        "dpc": "03012402601",
        "name": "ព្រាប សុប៊ុន"
    },
    {
        "barcode": "171112023",
        "dpc": "03012402701",
        "name": "ផាត ភូន"
    },
    {
        "barcode": "171112024",
        "dpc": "03012408001",
        "name": "ជឹម វីតា"
    },
    {
        "barcode": "171112025",
        "dpc": "03012411801",
        "name": "ម៉េង លាង"
    },
    {
        "barcode": "171112026",
        "dpc": "03012401201",
        "name": "អាន សារាយ"
    },
    {
        "barcode": "171112027",
        "dpc": "03012408101",
        "name": "សំរិត គឹម"
    },
    {
        "barcode": "171112028",
        "dpc": "03012401001",
        "name": "យ៉ាង យ៉ុង"
    },
    {
        "barcode": "171112029",
        "dpc": "03012426401",
        "name": "សុខ សុផុន"
    },
    {
        "barcode": "171112030",
        "dpc": "03012407401",
        "name": "ឡី ស៊ីណា"
    },
    {
        "barcode": "171112031",
        "dpc": "03012407301",
        "name": "ថេន សុក្ខៈ"
    },
    {
        "barcode": "171112032",
        "dpc": "03012407201",
        "name": "ថេន ស្រីរុំ"
    },
    {
        "barcode": "171112033",
        "dpc": "03012407101",
        "name": "សាលសហគមន័"
    },
    {
        "barcode": "171112034",
        "dpc": "03012407001",
        "name": "ឈួត បូរី"
    },
    {
        "barcode": "171112035",
        "dpc": "03012406901",
        "name": "ទុយ សាវ៉ាត"
    },
    {
        "barcode": "171112036",
        "dpc": "03012407801",
        "name": "កង អាត"
    },
    {
        "barcode": "171112037",
        "dpc": "03012407701",
        "name": "ឈឹម គី"
    },
    {
        "barcode": "171112038",
        "dpc": "03012426901",
        "name": "លី ឡាង"
    },
    {
        "barcode": "171112039",
        "dpc": "03012406801",
        "name": "ផែង ផាត"
    },
    {
        "barcode": "171112040",
        "dpc": "03012407501",
        "name": "កង សារី"
    },
    {
        "barcode": "171112041",
        "dpc": "03012406701",
        "name": "ហែល រតនា"
    },
    {
        "barcode": "171112042",
        "dpc": "03012401901",
        "name": "ទូច សោភ័ណ"
    },
    {
        "barcode": "171112043",
        "dpc": "03012426801",
        "name": "ឆាន់ សូភី"
    },
    {
        "barcode": "171112044",
        "dpc": "03012401701",
        "name": "លឿង ពៅ"
    },
    {
        "barcode": "171112045",
        "dpc": "03012406601",
        "name": "ប៊ី សុភាព"
    },
    {
        "barcode": "171112046",
        "dpc": "03012406501",
        "name": "រឿន ផល"
    },
    {
        "barcode": "171112047",
        "dpc": "03012406401",
        "name": "ហម ថៃ"
    },
    {
        "barcode": "171112048",
        "dpc": "03012406301",
        "name": "សឿន ម៉េងទ្រី"
    },
    {
        "barcode": "171112049",
        "dpc": "03012429701",
        "name": "អ៊ុំ ឆៃ"
    },
    {
        "barcode": "171112050",
        "dpc": "03012408401",
        "name": "ហម សាឃឿន"
    },
    {
        "barcode": "171112051",
        "dpc": "03012426501",
        "name": "ង៉ែត សុខនី"
    },
    {
        "barcode": "171112052",
        "dpc": "03012407901",
        "name": "ជ័យ សុភាព"
    },
    {
        "barcode": "171112053",
        "dpc": "03012439401",
        "name": "បឹង កូឡាប"
    },
    {
        "barcode": "171112054",
        "dpc": "03012417201",
        "name": "សុខ ចាន់រិទ្ធី"
    },
    {
        "barcode": "171112055",
        "dpc": "03012414101",
        "name": "សាំង ប៊ុនថេន"
    },
    {
        "barcode": "171112056",
        "dpc": "03012433401",
        "name": "ជា សៀ"
    },
    {
        "barcode": "171112057",
        "dpc": "03012433301",
        "name": "ហែម សុផល"
    },
    {
        "barcode": "171112058",
        "dpc": "03012417301",
        "name": "ជា គឹមលី"
    },
    {
        "barcode": "171112059",
        "dpc": "03012423401",
        "name": "ប្រាក់ សៅវីរី"
    },
    {
        "barcode": "171112060",
        "dpc": "03012423301",
        "name": "ប្រាក់ សុភាព"
    },
    {
        "barcode": "171112061",
        "dpc": "03012446201",
        "name": "វ៉ា ដារិន"
    },
    {
        "barcode": "171112062",
        "dpc": "03012441201",
        "name": "ទូច សូភី"
    },
    {
        "barcode": "171112063",
        "dpc": "03012429301",
        "name": "ឈុយ ឆៃយ៉ា"
    },
    {
        "barcode": "171112064",
        "dpc": "03012434201",
        "name": "ចាន់ ចិន្ថា"
    },
    {
        "barcode": "171112065",
        "dpc": "03012434101",
        "name": "កែន ទុយ"
    },
    {
        "barcode": "171112066",
        "dpc": "03012439201",
        "name": "យ៉ាល សំអ៊ុល"
    },
    {
        "barcode": "171112067",
        "dpc": "03012435901",
        "name": "ថេន ព្រលឹង"
    },
    {
        "barcode": "171112068",
        "dpc": "03012424301",
        "name": "គឹម សុធារ៉ា"
    },
    {
        "barcode": "171112069",
        "dpc": "03012434501",
        "name": "ចេង សំណាង"
    },
    {
        "barcode": "171112070",
        "dpc": "03012411101",
        "name": "សាលសមាគមន៍"
    },
    {
        "barcode": "171112071",
        "dpc": "03012416201",
        "name": "សែម គឹមហ៊ាត"
    },
    {
        "barcode": "171112072",
        "dpc": "03012416301",
        "name": "ឃៀង គន្ធា"
    },
    {
        "barcode": "171112073",
        "dpc": "03012416401",
        "name": "ចាន់ ថុល"
    },
    {
        "barcode": "171112074",
        "dpc": "03012422601",
        "name": "សុ ជីវី"
    },
    {
        "barcode": "171112075",
        "dpc": "03012416501",
        "name": "ជឹម គង្គា"
    },
    {
        "barcode": "171112076",
        "dpc": "03012416701",
        "name": "ឆេង ស៊ីម៉ន"
    },
    {
        "barcode": "171112077",
        "dpc": "03012410401",
        "name": "លី គន្ធា"
    },
    {
        "barcode": "171112078",
        "dpc": "03012410501",
        "name": "អ៊ុំ សុភ័ក្រ"
    },
    {
        "barcode": "171112079",
        "dpc": "03012410601",
        "name": "សូ ហេង"
    },
    {
        "barcode": "171112080",
        "dpc": "03012410701",
        "name": "ព្រំ ភា"
    },
    {
        "barcode": "171112081",
        "dpc": "03012410901",
        "name": "វ៉ាន ថន"
    },
    {
        "barcode": "171112082",
        "dpc": "03012411001",
        "name": "វ៉ន ជៀន"
    },
    {
        "barcode": "171112083",
        "dpc": "03012422701",
        "name": "សុខ សាត"
    },
    {
        "barcode": "171112084",
        "dpc": "03012422901",
        "name": "យ៉ា បូណា"
    },
    {
        "barcode": "171112085",
        "dpc": "03012443801",
        "name": "ឈួយ ណារ៉ែត"
    },
    {
        "barcode": "171112086",
        "dpc": "03012403301",
        "name": "ម៉ុក សុផាណារ៉ា"
    },
    {
        "barcode": "171112087",
        "dpc": "03012431201",
        "name": "ថង ធី"
    },
    {
        "barcode": "171112088",
        "dpc": "03012424201",
        "name": "យីវ ទូច"
    },
    {
        "barcode": "171112089",
        "dpc": "03012426201",
        "name": "ហេង វាតកំសត់"
    },
    {
        "barcode": "171112090",
        "dpc": "03012435501",
        "name": "ហួន ពៅ"
    },
    {
        "barcode": "171112091",
        "dpc": "03012417901",
        "name": "ហូ ច័ន្ទពិសី"
    },
    {
        "barcode": "171112092",
        "dpc": "03012425601",
        "name": "ធី សារ៉ាត់"
    },
    {
        "barcode": "171112093",
        "dpc": "03012425701",
        "name": "ពេជ្រ ដារ៉ារិទ្ធ"
    },
    {
        "barcode": "171112094",
        "dpc": "03012416801",
        "name": "អ៊ុំ ឡុញ"
    },
    {
        "barcode": "171112095",
        "dpc": "03012416901",
        "name": "អែម សេង"
    },
    {
        "barcode": "171112096",
        "dpc": "03012417001",
        "name": "ខែម សារ៉ុម"
    },
    {
        "barcode": "171112097",
        "dpc": "03012417101",
        "name": "ចាន់ កូ"
    },
    {
        "barcode": "171112098",
        "dpc": "03012423601",
        "name": "ប៉ុក គឹមលៀម"
    },
    {
        "barcode": "171112099",
        "dpc": "03012420901",
        "name": "ឡាយ គន្ធា"
    },
    {
        "barcode": "171112100",
        "dpc": "03012435601",
        "name": "អឿន សុឡេង"
    },
    {
        "barcode": "171112101",
        "dpc": "03012419301",
        "name": "មិន លីហួរ"
    },
    {
        "barcode": "171112102",
        "dpc": "03012417601",
        "name": "ពៅ វិរៈ ១"
    },
    {
        "barcode": "171112103",
        "dpc": "03012417701",
        "name": "ពៅ វិរៈ ២"
    },
    {
        "barcode": "171112104",
        "dpc": "03012442401",
        "name": "អែម សារ៉េត"
    },
    {
        "barcode": "171112105",
        "dpc": "03012424001",
        "name": "ខេង ពិសិដ្ឋ"
    },
    {
        "barcode": "171112106",
        "dpc": "03012446001",
        "name": "សយ សានី"
    },
    {
        "barcode": "171112107",
        "dpc": "03012425401",
        "name": "ឃុត ស៊ីម"
    },
    {
        "barcode": "171112108",
        "dpc": "03012425501",
        "name": "សាន្ត សារិន"
    },
    {
        "barcode": "171112109",
        "dpc": "03012425301",
        "name": "ទូច យ៉េត"
    },
    {
        "barcode": "171112110",
        "dpc": "03012425001",
        "name": "យាន រិទ្ធីវង្ស"
    },
    {
        "barcode": "171112111",
        "dpc": "03012444201",
        "name": "អេង សុភី"
    },
    {
        "barcode": "171112112",
        "dpc": "03012425201",
        "name": "រី រ័ត្ន"
    },
    {
        "barcode": "171112113",
        "dpc": "03012446101",
        "name": "ង៉ែត សាម៉ៃ"
    },
    {
        "barcode": "171112114",
        "dpc": "03012444001",
        "name": "គង់ ឈួន"
    },
    {
        "barcode": "171112115",
        "dpc": "03012423801",
        "name": "លាម សុឃឿម"
    },
    {
        "barcode": "171112116",
        "dpc": "03012412201",
        "name": "ឆម ភិរុណ"
    },
    {
        "barcode": "171112117",
        "dpc": "03012432801",
        "name": "ផាន់ ណារិទ្ធ"
    },
    {
        "barcode": "171112118",
        "dpc": "03012415601",
        "name": "ឈៀង រឿត"
    },
    {
        "barcode": "171112119",
        "dpc": "03012443901",
        "name": "អូន ចាន់ណារី"
    },
    {
        "barcode": "171112120",
        "dpc": "03012412101",
        "name": "ពិន សុវណ្ណ"
    },
    {
        "barcode": "171112121",
        "dpc": "03012428701",
        "name": "យាំ ចិត្ត្រា"
    },
    {
        "barcode": "171112122",
        "dpc": "03012430801",
        "name": "យូ ពៅ"
    },
    {
        "barcode": "171112123",
        "dpc": "03012421401",
        "name": "ពៅ វិរៈ ៣"
    },
    {
        "barcode": "171112124",
        "dpc": "03012432701",
        "name": "ឈួន ចាន់ថន"
    },
    {
        "barcode": "171112125",
        "dpc": "03012424101",
        "name": "ម៉ែង គឹមលី"
    },
    {
        "barcode": "171112126",
        "dpc": "03012444101",
        "name": "សាំង សុធារិទ្ធ"
    },
    {
        "barcode": "171112127",
        "dpc": "03012432601",
        "name": "ហត្ថ ធី"
    },
    {
        "barcode": "171112128",
        "dpc": "03012423701",
        "name": "ញាណ វណ្ណៈ"
    },
    {
        "barcode": "171112129",
        "dpc": "03012441401",
        "name": "ងួន សេង"
    },
    {
        "barcode": "171112130",
        "dpc": "03012419501",
        "name": "ណាំ ផាច"
    },
    {
        "barcode": "171112131",
        "dpc": "03012441501",
        "name": "ឈុត ណាលីន"
    },
    {
        "barcode": "171112132",
        "dpc": "03012441601",
        "name": "អួត សឿត"
    },
    {
        "barcode": "171112133",
        "dpc": "03012428101",
        "name": "សារុំ ចានថេត"
    },
    {
        "barcode": "171112134",
        "dpc": "03012420601",
        "name": "សៀង ណេង"
    },
    {
        "barcode": "171112135",
        "dpc": "03012424801",
        "name": "ឆាំ សុភាព"
    },
    {
        "barcode": "171112136",
        "dpc": "03012435201",
        "name": "ធូ ចាន់ថា"
    },
    {
        "barcode": "171112137",
        "dpc": "03012447301",
        "name": "តាត សុភី"
    },
    {
        "barcode": "171112138",
        "dpc": "03012403601",
        "name": "សាយ សៀន"
    },
    {
        "barcode": "171112139",
        "dpc": "03012431901",
        "name": "រឿន វីរៈ"
    },
    {
        "barcode": "171112140",
        "dpc": "03012432001",
        "name": "ហួត ហឿប"
    },
    {
        "barcode": "171112141",
        "dpc": "03012432101",
        "name": "សាម មាន"
    },
    {
        "barcode": "171112142",
        "dpc": "03012400801",
        "name": "អ៊ា គឹមជឿន"
    },
    {
        "barcode": "171112143",
        "dpc": "03012404401",
        "name": "វុន សុគន្ធ"
    },
    {
        "barcode": "171112144",
        "dpc": "03012404301",
        "name": "អ៊ុំ សាវ៉ៃ"
    },
    {
        "barcode": "171112145",
        "dpc": "03012404501",
        "name": "ហ៊ីង គឹមហឿន"
    },
    {
        "barcode": "171112146",
        "dpc": "03012420001",
        "name": "ពៅ ទិញ"
    },
    {
        "barcode": "171112147",
        "dpc": "03012403401",
        "name": "ជឹម និមិត្ត"
    },
    {
        "barcode": "171112148",
        "dpc": "03012437501",
        "name": "ឌី ផល្លី"
    },
    {
        "barcode": "171112149",
        "dpc": "03012437601",
        "name": "វ៉ា ទៀង"
    },
    {
        "barcode": "171112150",
        "dpc": "03012437701",
        "name": "ចែ ធុល"
    },
    {
        "barcode": "171112151",
        "dpc": "03012437801",
        "name": "ថៅ វ៉ាន់ថន"
    },
    {
        "barcode": "171112152",
        "dpc": "03012403501",
        "name": "ណូល សំណាង"
    },
    {
        "barcode": "171112153",
        "dpc": "03012435401",
        "name": "វ៉ែន ពីង"
    },
    {
        "barcode": "171112154",
        "dpc": "03012401301",
        "name": "សុខ ពៅ"
    },
    {
        "barcode": "171112155",
        "dpc": "03012403701",
        "name": "សុខ ញ៉ាញ់"
    },
    {
        "barcode": "171112156",
        "dpc": "03012404801",
        "name": "ណុច ម៉ៅ"
    },
    {
        "barcode": "171112157",
        "dpc": "03012401401",
        "name": "អេង ណូ"
    },
    {
        "barcode": "171112158",
        "dpc": "03012446801",
        "name": "ម៉ៅ ផល្លា"
    },
    {
        "barcode": "171112159",
        "dpc": "03012446701",
        "name": "ស៊ុម ភូង"
    },
    {
        "barcode": "171112160",
        "dpc": "03012446601",
        "name": "ស៊ុម សុភី"
    },
    {
        "barcode": "171112161",
        "dpc": "03012415401",
        "name": "យាន ធី"
    },
    {
        "barcode": "171112162",
        "dpc": "03012431601",
        "name": "ហួត នរា"
    },
    {
        "barcode": "171112163",
        "dpc": "03012431701",
        "name": "ហួត ជន"
    },
    {
        "barcode": "171112164",
        "dpc": "03012418301",
        "name": "សឹង ពុទ្ធារ៉ា"
    },
    {
        "barcode": "171112165",
        "dpc": "03012419801",
        "name": "ទេព សំណាង"
    },
    {
        "barcode": "171112166",
        "dpc": "03012421201",
        "name": "ម៉ៅ ប៊ុនឈឿង"
    },
    {
        "barcode": "171112167",
        "dpc": "03012421101",
        "name": "អឿង ពេជ្រ"
    },
    {
        "barcode": "171112168",
        "dpc": "03012442101",
        "name": "អៀង មុំ"
    },
    {
        "barcode": "171112169",
        "dpc": "03012431301",
        "name": "អ៊ុំ ម៉ូលីដា"
    },
    {
        "barcode": "171112170",
        "dpc": "03012413101",
        "name": "អ៊ឹង ធឹង"
    },
    {
        "barcode": "171112171",
        "dpc": "03012431401",
        "name": "គឹម សារឿន"
    },
    {
        "barcode": "171112172",
        "dpc": "03012435301",
        "name": "ជា សុហួត"
    },
    {
        "barcode": "171112173",
        "dpc": "03012428001",
        "name": "អឿន អ៊ុយ"
    },
    {
        "barcode": "171112174",
        "dpc": "03012446301",
        "name": "ខាត់ ផាន់លី"
    },
    {
        "barcode": "171112175",
        "dpc": "03012400201",
        "name": "ព្រំ អឿន"
    },
    {
        "barcode": "171112176",
        "dpc": "03012400101",
        "name": "បាន ចំរើន"
    },
    {
        "barcode": "171112177",
        "dpc": "03012437901",
        "name": "សុខ កានីកា"
    },
    {
        "barcode": "171112178",
        "dpc": "03012441801",
        "name": "ប្រម ព្រឿង"
    },
    {
        "barcode": "171112179",
        "dpc": "03012441901",
        "name": "ឈើន រដ្ឋា"
    },
    {
        "barcode": "171112180",
        "dpc": "03012425901",
        "name": "ដែង សាវ៉ុង"
    },
    {
        "barcode": "171112181",
        "dpc": "03012434601",
        "name": "ម៉ាង ចានថូ"
    },
    {
        "barcode": "171112182",
        "dpc": "03012442001",
        "name": "សោ និយមរ័ត្ន"
    },
    {
        "barcode": "171112183",
        "dpc": "03012448001",
        "name": "ចាន់ ឌី"
    }
]
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});