let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=
    [
    {
        "barcode": "171111335",
        "dpc": "03022515101",
        "name": "ញឹក ប៊ុនឆប"
    },
    {
        "barcode": "171111336",
        "dpc": "03022523601",
        "name": "ម៉ាន ណាស៊ី"
    },
    {
        "barcode": "171111337",
        "dpc": "03022519901",
        "name": "រេះ ម៉ាត់"
    },
    {
        "barcode": "171111338",
        "dpc": "03022502601",
        "name": "សាប់ សារ៉េត"
    },
    {
        "barcode": "171111339",
        "dpc": "03022513601",
        "name": "គ្រី ស៊ិនលាង"
    },
    {
        "barcode": "171111340",
        "dpc": "03022547001",
        "name": "ឈឿន ពុទ្ធី"
    },
    {
        "barcode": "171111341",
        "dpc": "03022513701",
        "name": "ខាត់ ខាន"
    },
    {
        "barcode": "171111342",
        "dpc": "03022513801",
        "name": "ឌុន អន"
    },
    {
        "barcode": "171111343",
        "dpc": "03022513901",
        "name": "ស៊ុន ចំរើន"
    },
    {
        "barcode": "171111344",
        "dpc": "03022514201",
        "name": "តែ ឆុន"
    },
    {
        "barcode": "171111345",
        "dpc": "03022514301",
        "name": "អន រឿត"
    },
    {
        "barcode": "171111346",
        "dpc": "03022514101",
        "name": "សេង ពិសិទ្ធ"
    },
    {
        "barcode": "171111347",
        "dpc": "03022514001",
        "name": "សេង រ៉េន"
    },
    {
        "barcode": "171111348",
        "dpc": "03022508201",
        "name": "រ៉េះ សើ"
    },
    {
        "barcode": "171111349",
        "dpc": "03022508301",
        "name": "ស៊ូ សាទ្រី"
    },
    {
        "barcode": "171111350",
        "dpc": "03022513501",
        "name": "ឯល យ៉ាន"
    },
    {
        "barcode": "171111351",
        "dpc": "03022508401",
        "name": "ម៉ក់ ឃឿត"
    },
    {
        "barcode": "171111352",
        "dpc": "03022513301",
        "name": "សាម ខុន"
    },
    {
        "barcode": "171111353",
        "dpc": "03022513401",
        "name": "សឿង ឡន"
    },
    {
        "barcode": "171111354",
        "dpc": "03022513201",
        "name": "ខូរ ឡាង"
    },
    {
        "barcode": "171111355",
        "dpc": "03022513101",
        "name": "ផល ផន"
    },
    {
        "barcode": "171111356",
        "dpc": "03022515301",
        "name": "ឯក ចាន់ថន"
    },
    {
        "barcode": "171111357",
        "dpc": "03022524301",
        "name": "ណុប ណារ៉ា ១"
    },
    {
        "barcode": "171111358",
        "dpc": "03022543901",
        "name": "ណុប ណារ៉ា ២"
    },
    {
        "barcode": "171111359",
        "dpc": "03022518401",
        "name": "សុខ សុភ័ណ"
    },
    {
        "barcode": "171111360",
        "dpc": "03022502701",
        "name": "សួន សូរិន"
    },
    {
        "barcode": "171111361",
        "dpc": "03022502801",
        "name": "សួន វណ្ណារិទ្ធ"
    },
    {
        "barcode": "171111362",
        "dpc": "03022502901",
        "name": "រ៉ាត់ រី"
    },
    {
        "barcode": "171111363",
        "dpc": "03022503001",
        "name": "ឌី សុខពេញ"
    },
    {
        "barcode": "171111364",
        "dpc": "03022503101",
        "name": "ហួន សុធីរិទ្ធ"
    },
    {
        "barcode": "171111365",
        "dpc": "03022503201",
        "name": "ម៉ាត់ សុគ្រី"
    },
    {
        "barcode": "171111366",
        "dpc": "03022503301",
        "name": "អុំ យ៉ាន់"
    },
    {
        "barcode": "171111367",
        "dpc": "03022504601",
        "name": "ប៊ុន សុភាព"
    },
    {
        "barcode": "171111368",
        "dpc": "03022507001",
        "name": "ម៉ា ការីន"
    },
    {
        "barcode": "171111369",
        "dpc": "03022507801",
        "name": "ឡេះ នូប៉េះ"
    },
    {
        "barcode": "171111370",
        "dpc": "03022507901",
        "name": "ជ័យ សុភាព"
    },
    {
        "barcode": "171111371",
        "dpc": "03022508001",
        "name": "ផន ឃួន"
    },
    {
        "barcode": "171111372",
        "dpc": "03022508101",
        "name": "គង់ ចន្ថា"
    },
    {
        "barcode": "171111373",
        "dpc": "03022508701",
        "name": "ថង ឌឿន"
    },
    {
        "barcode": "171111374",
        "dpc": "03022508801",
        "name": "សាប់ មណា"
    },
    {
        "barcode": "171111375",
        "dpc": "03022508901",
        "name": "វ៉ាន់ រីយ៉ា"
    },
    {
        "barcode": "171111376",
        "dpc": "03022509001",
        "name": "សុខ រឿម"
    },
    {
        "barcode": "171111377",
        "dpc": "03022509101",
        "name": "ជា ហ៊ាង"
    },
    {
        "barcode": "171111378",
        "dpc": "03022509201",
        "name": "សៅ គាន"
    },
    {
        "barcode": "171111379",
        "dpc": "03022509301",
        "name": "ស៊ូ យ៉ន"
    },
    {
        "barcode": "171111380",
        "dpc": "03022509401",
        "name": "ឈុន ឡាយ"
    },
    {
        "barcode": "171111381",
        "dpc": "03022509501",
        "name": "ម៉ាន រី"
    },
    {
        "barcode": "171111382",
        "dpc": "03022509701",
        "name": "តាំ ម៉ាស់"
    },
    {
        "barcode": "171111383",
        "dpc": "03022511701",
        "name": "សេង នាង"
    },
    {
        "barcode": "171111384",
        "dpc": "03022511801",
        "name": "វង្ស ភុំ"
    },
    {
        "barcode": "171111385",
        "dpc": "03022511901",
        "name": "តន់ ណាវ"
    },
    {
        "barcode": "171111386",
        "dpc": "03022512401",
        "name": "ព្រឿន ចាន់វ៉ន"
    },
    {
        "barcode": "171111387",
        "dpc": "03022515401",
        "name": "ខ្វាន់ ចំរើន"
    },
    {
        "barcode": "171111388",
        "dpc": "03022521301",
        "name": "មណ្ឌលសុខភាពស្លាកែត"
    },
    {
        "barcode": "171111389",
        "dpc": "03022539901",
        "name": "ស៊ុន ផាត"
    },
    {
        "barcode": "171111390",
        "dpc": "03022544701",
        "name": "អ៊ុច វណ្ណ"
    },
    {
        "barcode": "171111391",
        "dpc": "03022544801",
        "name": "ម៉ាក់ ផល្លី"
    },
    {
        "barcode": "171111392",
        "dpc": "03022544901",
        "name": "ប៊ុន សំអាន"
    },
    {
        "barcode": "171111393",
        "dpc": "03022545001",
        "name": "ម៉ុត ផល្លី"
    },
    {
        "barcode": "171111394",
        "dpc": "03022502401",
        "name": "ទូច ជួន"
    },
    {
        "barcode": "171111395",
        "dpc": "03022503501",
        "name": "ឈៀង នេត"
    },
    {
        "barcode": "171111396",
        "dpc": "03022503601",
        "name": "វង្ស កង"
    },
    {
        "barcode": "171111397",
        "dpc": "03022503701",
        "name": "ឆាំ ពៅ"
    },
    {
        "barcode": "171111398",
        "dpc": "03022503801",
        "name": "វង្ស ធួក"
    },
    {
        "barcode": "171111399",
        "dpc": "03022503901",
        "name": "ម៉េត ដាវុធ"
    },
    {
        "barcode": "171111400",
        "dpc": "03022507201",
        "name": "តែម ចំរើន"
    },
    {
        "barcode": "171111401",
        "dpc": "03022507401",
        "name": "ហង់ ផា"
    },
    {
        "barcode": "171111402",
        "dpc": "03022507501",
        "name": "នុត ឡី"
    },
    {
        "barcode": "171111403",
        "dpc": "03022507601",
        "name": "លី ណាស៊ី"
    },
    {
        "barcode": "171111404",
        "dpc": "03022507701",
        "name": "វង្ស ថន"
    },
    {
        "barcode": "171111405",
        "dpc": "03022511501",
        "name": "កាំង ប៉េង"
    },
    {
        "barcode": "171111406",
        "dpc": "03022511601",
        "name": "ឈុន ធឿន"
    },
    {
        "barcode": "171111407",
        "dpc": "03022512201",
        "name": "រឿន សាវីន"
    },
    {
        "barcode": "171111408",
        "dpc": "03022523801",
        "name": "យ៉ន សុភ័ក្រធីតា"
    },
    {
        "barcode": "171111409",
        "dpc": "03022523901",
        "name": "តឹង ចាន់ធី"
    },
    {
        "barcode": "171111410",
        "dpc": "03022524001",
        "name": "និន ណុន"
    },
    {
        "barcode": "171111411",
        "dpc": "03022539801",
        "name": "ញ៉ែម ផល្លី"
    },
    {
        "barcode": "171111412",
        "dpc": "03022523001",
        "name": "អ៊ុក ចាន់ម៉ាលី ២"
    },
    {
        "barcode": "171111413",
        "dpc": "03022506801",
        "name": "ទេព ចយ"
    },
    {
        "barcode": "171111414",
        "dpc": "03022513001",
        "name": "ទឹម សុផាន់ណា"
    },
    {
        "barcode": "171111415",
        "dpc": "03022502301",
        "name": "សំ សុន"
    },
    {
        "barcode": "171111416",
        "dpc": "03022539601",
        "name": "ឡឹក រិវឌ្ឍន៍"
    },
    {
        "barcode": "171111417",
        "dpc": "03022512101",
        "name": "អ៊ឹម សុភាព"
    },
    {
        "barcode": "171111418",
        "dpc": "03022514701",
        "name": "ជា ផល្លី"
    },
    {
        "barcode": "171111419",
        "dpc": "03022514801",
        "name": "ពៅ ប្រុស"
    },
    {
        "barcode": "171111420",
        "dpc": "03022522901",
        "name": "នួន សិលា"
    },
    {
        "barcode": "171111421",
        "dpc": "03022523701",
        "name": "ប៊ុន ថាវ"
    },
    {
        "barcode": "171111422",
        "dpc": "03022518101",
        "name": "មាស សាម៉ុន"
    },
    {
        "barcode": "171111423",
        "dpc": "03022515501",
        "name": "ឈួម សាវី ២"
    },
    {
        "barcode": "171111424",
        "dpc": "03022501301",
        "name": "សេង លន់"
    },
    {
        "barcode": "171111425",
        "dpc": "03022502501",
        "name": "ជៀប យឿត"
    },
    {
        "barcode": "171111426",
        "dpc": "03022510501",
        "name": "មាស ម៉ូលីវណ្ណ"
    },
    {
        "barcode": "171111427",
        "dpc": "03022510601",
        "name": "មាស ចំណូល"
    },
    {
        "barcode": "171111428",
        "dpc": "03022522301",
        "name": "ឡាយ ស្រីអូន"
    },
    {
        "barcode": "171111429",
        "dpc": "03022506101",
        "name": "ឡាយ គីមហ៊ួរ"
    },
    {
        "barcode": "171111430",
        "dpc": "03022506001",
        "name": "ឡាយ សុខហេង ២"
    },
    {
        "barcode": "171111431",
        "dpc": "03022505901",
        "name": "ឡាយ សុខហេង ១"
    },
    {
        "barcode": "171111432",
        "dpc": "03022501601",
        "name": "វ៉ាយ សារ ២"
    },
    {
        "barcode": "171111433",
        "dpc": "03022506201",
        "name": "ឡាត ហ៊ត"
    },
    {
        "barcode": "171111434",
        "dpc": "03022520901",
        "name": "រឿន ប្រាថ្មា"
    },
    {
        "barcode": "171111435",
        "dpc": "03022515601",
        "name": "ឈឹម វណ្ណា"
    },
    {
        "barcode": "171111436",
        "dpc": "03022518001",
        "name": "ពឿន ពៅ"
    },
    {
        "barcode": "171111437",
        "dpc": "03022511401",
        "name": "ស៊ី សំណាង"
    },
    {
        "barcode": "171111438",
        "dpc": "03022511301",
        "name": "ប៊ុន សុង"
    },
    {
        "barcode": "171111439",
        "dpc": "03022524401",
        "name": "ជា សុខជា"
    },
    {
        "barcode": "171111440",
        "dpc": "03022541001",
        "name": "ស៊ិន ប៊ុនលី"
    },
    {
        "barcode": "171111441",
        "dpc": "03022540901",
        "name": "ពៅ រស្មី"
    },
    {
        "barcode": "171111442",
        "dpc": "03022540801",
        "name": "ស៊ន ពៅ"
    },
    {
        "barcode": "171111443",
        "dpc": "03022540701",
        "name": "កេង សុខម៉េង"
    },
    {
        "barcode": "171111444",
        "dpc": "03022501801",
        "name": "លឹម សុខធី"
    },
    {
        "barcode": "171111445",
        "dpc": "03022512801",
        "name": "លឹម ប៉ោហុង"
    },
    {
        "barcode": "171111446",
        "dpc": "03022512001",
        "name": "ជួន សុខុម"
    },
    {
        "barcode": "171111447",
        "dpc": "03022522801",
        "name": "ព្រាប សុភ័ក្រ"
    },
    {
        "barcode": "171111448",
        "dpc": "03022522701",
        "name": "ភួង ផល្លី"
    },
    {
        "barcode": "171111449",
        "dpc": "03022522601",
        "name": "អ៊ុក សាខន"
    },
    {
        "barcode": "171111450",
        "dpc": "03022514901",
        "name": "ឡាយ ស្រីមុំ"
    },
    {
        "barcode": "171111451",
        "dpc": "03022539701",
        "name": "ឡាយ ផល្លី"
    },
    {
        "barcode": "171111452",
        "dpc": "03022544601",
        "name": "គី ស៊ីណែត"
    },
    {
        "barcode": "171111453",
        "dpc": "03022545101",
        "name": "ទេព កែវចាន់ដារ៉ា"
    },
    {
        "barcode": "171111454",
        "dpc": "03022523101",
        "name": "ខែម សារិន"
    },
    {
        "barcode": "171111455",
        "dpc": "03022523201",
        "name": "គង់ ពៅ"
    },
    {
        "barcode": "171111456",
        "dpc": "03022544301",
        "name": "ភី គឹមលាង"
    },
    {
        "barcode": "171111457",
        "dpc": "03022517701",
        "name": "ច័ន្ទ និមល"
    },
    {
        "barcode": "171111458",
        "dpc": "03022514401",
        "name": "សេង ពុទ្ធា"
    },
    {
        "barcode": "171111459",
        "dpc": "03022524201",
        "name": "ជ័យ វុទ្ធី"
    },
    {
        "barcode": "171111460",
        "dpc": "03022518201",
        "name": "សុន សុភាព"
    },
    {
        "barcode": "171111461",
        "dpc": "03022517601",
        "name": "ពៅ វិជ្ជា"
    },
    {
        "barcode": "171111462",
        "dpc": "03022517501",
        "name": "នូ គីម"
    },
    {
        "barcode": "171111463",
        "dpc": "03022506401",
        "name": "ឡាច រិទ្ធី"
    },
    {
        "barcode": "171111464",
        "dpc": "03022512601",
        "name": "សាន ប៊ុនសាត"
    },
    {
        "barcode": "171111465",
        "dpc": "03022502101",
        "name": "ចាន់ សេន"
    },
    {
        "barcode": "171111466",
        "dpc": "03022544101",
        "name": "ស្រី ម៉ៃ"
    },
    {
        "barcode": "171111467",
        "dpc": "03022544001",
        "name": "ងឹ វណ្ណះ"
    },
    {
        "barcode": "171111468",
        "dpc": "03022521001",
        "name": "រ៉ន សុគន្ធា"
    },
    {
        "barcode": "171111469",
        "dpc": "03022519401",
        "name": "ថៃ វណ្ណារ៉ា"
    },
    {
        "barcode": "171111470",
        "dpc": "03022519501",
        "name": "ថៃ វណ្ណី"
    },
    {
        "barcode": "171111471",
        "dpc": "03022519601",
        "name": "តិច ថុង"
    },
    {
        "barcode": "171111472",
        "dpc": "03022520001",
        "name": "ជឺ នី"
    },
    {
        "barcode": "171111473",
        "dpc": "03022519701",
        "name": "ជា សុភាព"
    },
    {
        "barcode": "171111474",
        "dpc": "03022519801",
        "name": "សេង សៀន"
    },
    {
        "barcode": "171111475",
        "dpc": "03022510001",
        "name": "ឈឿង សុវណ្ណី"
    },
    {
        "barcode": "171111476",
        "dpc": "03022515801",
        "name": "ជុំ វណ្ណា"
    },
    {
        "barcode": "171111477",
        "dpc": "03022520701",
        "name": "គុជ ជ័រ"
    },
    {
        "barcode": "171111478",
        "dpc": "03022512701",
        "name": "គង់​ ស៊ីថា"
    },
    {
        "barcode": "171111479",
        "dpc": "03022506701",
        "name": "កែវ សារឿន"
    },
    {
        "barcode": "171111480",
        "dpc": "03022517001",
        "name": "ឌី វុទ្ធី"
    },
    {
        "barcode": "171111481",
        "dpc": "03022519201",
        "name": "ផន ភិន"
    },
    {
        "barcode": "171111482",
        "dpc": "03022506601",
        "name": "ឈុន ឡាយ"
    },
    {
        "barcode": "171111483",
        "dpc": "03022522501",
        "name": "ងួន ហេង"
    },
    {
        "barcode": "171111484",
        "dpc": "03022544501",
        "name": "សៅ សិច"
    },
    {
        "barcode": "171111485",
        "dpc": "03022544401",
        "name": "សេង ណាក់"
    },
    {
        "barcode": "171111486",
        "dpc": "03022523401",
        "name": "ហ៊ុន សោភ័ណ្ឌ"
    },
    {
        "barcode": "171111487",
        "dpc": "03022523501",
        "name": "អៀម ស៊ីវន"
    },
    {
        "barcode": "171111488",
        "dpc": "03022509801",
        "name": "ផាន់ សុគុណ"
    },
    {
        "barcode": "171111489",
        "dpc": "03022541401",
        "name": "ផុន សុភ័ណ្ឌ"
    },
    {
        "barcode": "171111490",
        "dpc": "03022547801",
        "name": "អ៊ាង សុខា"
    },
    {
        "barcode": "171111491",
        "dpc": "03022541501",
        "name": "មាស ហង្ស"
    },
    {
        "barcode": "171111492",
        "dpc": "03022546601",
        "name": "ទិត សៅរី"
    },
    {
        "barcode": "171111493",
        "dpc": "03022541601",
        "name": "ឡេង អូន"
    },
    {
        "barcode": "171111494",
        "dpc": "03022541701",
        "name": "ឈឿន ខូយ"
    },
    {
        "barcode": "171111495",
        "dpc": "03022541801",
        "name": "ពៅ វី"
    },
    {
        "barcode": "171111496",
        "dpc": "03022541901",
        "name": "មឿង សារ៉ន"
    },
    {
        "barcode": "171111497",
        "dpc": "03022542001",
        "name": "ស៊ឹម សារ៉េត"
    },
    {
        "barcode": "171111498",
        "dpc": "03022546501",
        "name": "ទូច សារីម"
    },
    {
        "barcode": "171111499",
        "dpc": "03022546401",
        "name": "វែង ស្រីនី"
    },
    {
        "barcode": "171111500",
        "dpc": "03022517201",
        "name": "ញ៉ ភាព"
    },
    {
        "barcode": "171111501",
        "dpc": "03022543501",
        "name": "មិម យ៉ន"
    },
    {
        "barcode": "171111502",
        "dpc": "03022536301",
        "name": "ហ៊ីន ផល្លី"
    },
    {
        "barcode": "171111503",
        "dpc": "03022526101",
        "name": "ភឿក សាខន"
    },
    {
        "barcode": "171111504",
        "dpc": "03022526001",
        "name": "អៀង គឹមហួយ"
    },
    {
        "barcode": "171111505",
        "dpc": "03022546301",
        "name": "យិន គិន"
    },
    {
        "barcode": "171111506",
        "dpc": "03022525901",
        "name": "អុំ វ៉ាន់"
    },
    {
        "barcode": "171111507",
        "dpc": "03022546201",
        "name": "ទឹម ម៉ាឡៃ"
    },
    {
        "barcode": "171111508",
        "dpc": "03022525801",
        "name": "កែវ ចាន់នី"
    },
    {
        "barcode": "171111509",
        "dpc": "03022525701",
        "name": "យិប សុផាន់"
    },
    {
        "barcode": "171111510",
        "dpc": "03022542101",
        "name": "ឡុង ណុប"
    },
    {
        "barcode": "171111511",
        "dpc": "03022525601",
        "name": "តេង អឿន"
    },
    {
        "barcode": "171111512",
        "dpc": "03022525501",
        "name": "តូ សេង"
    },
    {
        "barcode": "171111513",
        "dpc": "03022525401",
        "name": "រី យ៉ាន់"
    },
    {
        "barcode": "171111514",
        "dpc": "03022525301",
        "name": "ហេង រុំម្នី"
    },
    {
        "barcode": "171111515",
        "dpc": "03022536101",
        "name": "សំ សម្បត្តិ"
    },
    {
        "barcode": "171111516",
        "dpc": "03022536001",
        "name": "ខា សារិន"
    },
    {
        "barcode": "171111517",
        "dpc": "03022535901",
        "name": "ឈិម សុផាន"
    },
    {
        "barcode": "171111518",
        "dpc": "03022525201",
        "name": "ខ្លូត សុខុម"
    },
    {
        "barcode": "171111519",
        "dpc": "03022535701",
        "name": "ម៉ៃ សុឃុល"
    },
    {
        "barcode": "171111520",
        "dpc": "03022535601",
        "name": "ប៉ុន សាគុណ"
    },
    {
        "barcode": "171111521",
        "dpc": "03022535501",
        "name": "ហ៊ុន ឃឿង"
    },
    {
        "barcode": "171111522",
        "dpc": "03022535401",
        "name": "ហ៊ុន ពៅ"
    },
    {
        "barcode": "171111523",
        "dpc": "03022535301",
        "name": "ហ៊ុន ធ្នូ"
    },
    {
        "barcode": "171111524",
        "dpc": "03022518601",
        "name": "សួង លាង"
    },
    {
        "barcode": "171111525",
        "dpc": "03022535201",
        "name": "ឃុន វិបុល"
    },
    {
        "barcode": "171111526",
        "dpc": "03022517101",
        "name": "ហ៊ុន ចាប"
    },
    {
        "barcode": "171111527",
        "dpc": "03022518701",
        "name": "វ៉ែន វ៉ូ"
    },
    {
        "barcode": "171111528",
        "dpc": "03022525001",
        "name": "វិញ ហេង"
    },
    {
        "barcode": "171111529",
        "dpc": "03022502201",
        "name": "គ្រី ទូច"
    },
    {
        "barcode": "171111530",
        "dpc": "03022541301",
        "name": "ងួន ចាន់រតនា"
    },
    {
        "barcode": "171111531",
        "dpc": "03022547501",
        "name": "សោម ថន"
    },
    {
        "barcode": "171111532",
        "dpc": "03022547301",
        "name": "ខាវ រតនា"
    },
    {
        "barcode": "171111533",
        "dpc": "03022547401",
        "name": "សាន ស៊ីថា"
    },
    {
        "barcode": "171111534",
        "dpc": "03022545201",
        "name": "អួង វ៉ា"
    },
    {
        "barcode": "171111535",
        "dpc": "03022516701",
        "name": "ចេស សាម៉េត"
    },
    {
        "barcode": "171111536",
        "dpc": "03022516801",
        "name": "សៅ ឆុន"
    },
    {
        "barcode": "171111537",
        "dpc": "03022516901",
        "name": "ស៊ីវ លឿត"
    },
    {
        "barcode": "171111538",
        "dpc": "03022526201",
        "name": "ហួន សំណាង"
    },
    {
        "barcode": "171111539",
        "dpc": "03022536401",
        "name": "មឿន សុផាន់នី"
    },
    {
        "barcode": "171111540",
        "dpc": "03022526301",
        "name": "ប៊ុត យ៉ាត"
    },
    {
        "barcode": "171111541",
        "dpc": "03022536501",
        "name": "យី សៀកហាន"
    },
    {
        "barcode": "171111542",
        "dpc": "03022526401",
        "name": "ឡាក់ រស់"
    },
    {
        "barcode": "171111543",
        "dpc": "03022526501",
        "name": "ឈួន ចន្ធូ"
    },
    {
        "barcode": "171111544",
        "dpc": "03022526601",
        "name": "សាំង ឆៃ"
    },
    {
        "barcode": "171111545",
        "dpc": "03022526701",
        "name": "ឃុន មិនា"
    },
    {
        "barcode": "171111546",
        "dpc": "03022543101",
        "name": "ឆាំ កុសល់"
    },
    {
        "barcode": "171111547",
        "dpc": "03022526801",
        "name": "ម៉ាង សុវណ្ណ"
    },
    {
        "barcode": "171111548",
        "dpc": "03022526901",
        "name": "ព្រីង អូន"
    },
    {
        "barcode": "171111549",
        "dpc": "03022527001",
        "name": "គាវ ម៉ៅ"
    },
    {
        "barcode": "171111550",
        "dpc": "03022527101",
        "name": "អក្ខរ៉ាសម័យ"
    },
    {
        "barcode": "171111551",
        "dpc": "03022527201",
        "name": "អុល សុជា"
    },
    {
        "barcode": "171111552",
        "dpc": "03022542901",
        "name": "រត្ន ស្រីពេជ្រ"
    },
    {
        "barcode": "171111553",
        "dpc": "03022527301",
        "name": "មួង សុធា"
    },
    {
        "barcode": "171111554",
        "dpc": "03022527401",
        "name": "ឈិត សាលៀប"
    },
    {
        "barcode": "171111555",
        "dpc": "03022527601",
        "name": "សុខ ផូ"
    },
    {
        "barcode": "171111556",
        "dpc": "03022527701",
        "name": "សំ យ៉ាន់"
    },
    {
        "barcode": "171111557",
        "dpc": "03022536601",
        "name": "ឌិម ផុន"
    },
    {
        "barcode": "171111558",
        "dpc": "03022527801",
        "name": "តិប អេង"
    },
    {
        "barcode": "171111559",
        "dpc": "03022542801",
        "name": "វ័ន ឆវី"
    },
    {
        "barcode": "171111560",
        "dpc": "03022542701",
        "name": "វឿន សុណន់"
    },
    {
        "barcode": "171111561",
        "dpc": "03022536701",
        "name": "រ័ត្ន ស្រីលី"
    },
    {
        "barcode": "171111562",
        "dpc": "03022527901",
        "name": "ឡេង សំណាង"
    },
    {
        "barcode": "171111563",
        "dpc": "03022536801",
        "name": "នៅ ស៊ីមន"
    },
    {
        "barcode": "171111564",
        "dpc": "03022536901",
        "name": "ឈុំ សឿត"
    },
    {
        "barcode": "171111565",
        "dpc": "03022537001",
        "name": "ឈឹម សុគីម"
    },
    {
        "barcode": "171111566",
        "dpc": "03022528001",
        "name": "អាន ស៊ីហាក"
    },
    {
        "barcode": "171111567",
        "dpc": "03022528101",
        "name": "អួន សារ៉េន"
    },
    {
        "barcode": "171111568",
        "dpc": "03022528201",
        "name": "ប៉ូ មុំ"
    },
    {
        "barcode": "171111569",
        "dpc": "03022537201",
        "name": "សុខ អេង"
    },
    {
        "barcode": "171111570",
        "dpc": "03022528301",
        "name": "សំ សុផាត"
    },
    {
        "barcode": "171111571",
        "dpc": "03022528401",
        "name": "ហែម នី"
    },
    {
        "barcode": "171111572",
        "dpc": "03022528501",
        "name": "រិន ស្រីមុំ"
    },
    {
        "barcode": "171111573",
        "dpc": "03022537301",
        "name": "ខៀវ ចាន់ថង"
    },
    {
        "barcode": "171111574",
        "dpc": "03022528701",
        "name": "យីម សំអុល"
    },
    {
        "barcode": "171111575",
        "dpc": "03022528801",
        "name": "ស៊ុន សាវឿន"
    },
    {
        "barcode": "171111576",
        "dpc": "03022528901",
        "name": "ឈុន ឆេង"
    },
    {
        "barcode": "171111577",
        "dpc": "03022537501",
        "name": "ងិន ផល្លា"
    },
    {
        "barcode": "171111578",
        "dpc": "03022529101",
        "name": "ងិន សារ៉ាន់"
    },
    {
        "barcode": "171111579",
        "dpc": "03022543201",
        "name": "ឆៃ គីមសឿន"
    },
    {
        "barcode": "171111580",
        "dpc": "03022529201",
        "name": "ម៉ាង សារឿត"
    },
    {
        "barcode": "171111581",
        "dpc": "03022529301",
        "name": "ពេញ ចិន្តា"
    },
    {
        "barcode": "171111582",
        "dpc": "03022529401",
        "name": "ចាន់ ស៊ីដេត"
    },
    {
        "barcode": "171111583",
        "dpc": "03022529501",
        "name": "ហួត គឹមឡាយ"
    },
    {
        "barcode": "171111584",
        "dpc": "03022537601",
        "name": "ពេជ្រ សារឿន"
    },
    {
        "barcode": "171111585",
        "dpc": "03022529701",
        "name": "ម៉ុត សារ៉េត"
    },
    {
        "barcode": "171111586",
        "dpc": "03022529801",
        "name": "សាន់ ហុង"
    },
    {
        "barcode": "171111587",
        "dpc": "03022546101",
        "name": "អួន វី"
    },
    {
        "barcode": "171111588",
        "dpc": "03022529901",
        "name": "ម៉េង ងន់ហេង"
    },
    {
        "barcode": "171111589",
        "dpc": "03022537701",
        "name": "មឿង ប៊ុនថា"
    },
    {
        "barcode": "171111590",
        "dpc": "03022530001",
        "name": "ឆោម សុវណ្ណ"
    },
    {
        "barcode": "171111591",
        "dpc": "03022530201",
        "name": "ស៊ុន សារ៉េត"
    },
    {
        "barcode": "171111592",
        "dpc": "03022530401",
        "name": "ស៊ុំ សុវណ្ណ"
    },
    {
        "barcode": "171111593",
        "dpc": "03022530501",
        "name": "ហៀន ភាព"
    },
    {
        "barcode": "171111594",
        "dpc": "03022542301",
        "name": "រស់ ប៊ុនណាត"
    },
    {
        "barcode": "171111595",
        "dpc": "03022530601",
        "name": "ហ៊ុន សាត"
    },
    {
        "barcode": "171111596",
        "dpc": "03022530701",
        "name": "ទូច ចន្ធូ"
    },
    {
        "barcode": "171111597",
        "dpc": "03022530801",
        "name": "ចាប ចន្នី"
    },
    {
        "barcode": "171111598",
        "dpc": "03022530901",
        "name": "ហួន លាងសេង"
    },
    {
        "barcode": "171111599",
        "dpc": "03022531001",
        "name": "នៅ ស៊ីម"
    },
    {
        "barcode": "171111600",
        "dpc": "03022531101",
        "name": "ឡឹក ជីម"
    },
    {
        "barcode": "171111601",
        "dpc": "03022531301",
        "name": "ស៊ុន សារីម"
    },
    {
        "barcode": "171111602",
        "dpc": "03022531401",
        "name": "កុយ សំអូន"
    },
    {
        "barcode": "171111603",
        "dpc": "03022531501",
        "name": "អុំ ង៉ា"
    },
    {
        "barcode": "171111604",
        "dpc": "03022531601",
        "name": "ឡុង កាន"
    },
    {
        "barcode": "171111605",
        "dpc": "03022531701",
        "name": "ទេស សាវេត"
    },
    {
        "barcode": "171111606",
        "dpc": "03022531801",
        "name": "សំ ទន់"
    },
    {
        "barcode": "171111607",
        "dpc": "03022531901",
        "name": "មួង សូដា"
    },
    {
        "barcode": "171111608",
        "dpc": "03022532001",
        "name": "មិន ហ៊ីង"
    },
    {
        "barcode": "171111609",
        "dpc": "03022537801",
        "name": "ម៉ៅ ម៉ាន់"
    },
    {
        "barcode": "171111610",
        "dpc": "03022537901",
        "name": "ភិន ង៉ា"
    },
    {
        "barcode": "171111611",
        "dpc": "03022538001",
        "name": "ចាន់ វី"
    },
    {
        "barcode": "171111612",
        "dpc": "03022532201",
        "name": "ហាច រដ្ឋា"
    },
    {
        "barcode": "171111613",
        "dpc": "03022532301",
        "name": "ហាច ម៉ៅ"
    },
    {
        "barcode": "171111614",
        "dpc": "03022538101",
        "name": "សឿន សាវុធ"
    },
    {
        "barcode": "171111615",
        "dpc": "03022542401",
        "name": "ចាន់ ហួត"
    },
    {
        "barcode": "171111616",
        "dpc": "03022538201",
        "name": "វិត ហាប់"
    },
    {
        "barcode": "171111617",
        "dpc": "03022542501",
        "name": "លន សម្បត្តិ"
    },
    {
        "barcode": "171111618",
        "dpc": "03022532401",
        "name": "ឡុក រឿម"
    },
    {
        "barcode": "171111619",
        "dpc": "03022538301",
        "name": "ង៉ូវ សុក"
    },
    {
        "barcode": "171111620",
        "dpc": "03022538401",
        "name": "ខាំ ឡៃ"
    },
    {
        "barcode": "171111621",
        "dpc": "03022538501",
        "name": "លិម សុវណ្ណ"
    },
    {
        "barcode": "171111622",
        "dpc": "03022538601",
        "name": "សាត សារ៉ាយ"
    },
    {
        "barcode": "171111623",
        "dpc": "03022538701",
        "name": "ញ៉ែប ប៊ុនថា"
    },
    {
        "barcode": "171111624",
        "dpc": "03022538801",
        "name": "សេក ស៊ីថា"
    },
    {
        "barcode": "171111625",
        "dpc": "03022538901",
        "name": "ប៉ិល ពៅ"
    },
    {
        "barcode": "171111626",
        "dpc": "03022532501",
        "name": "យ៉េត គឹមហ៊ន"
    },
    {
        "barcode": "171111627",
        "dpc": "03022539001",
        "name": "ស៊ុន រិន"
    },
    {
        "barcode": "171111628",
        "dpc": "03022532601",
        "name": "ឡែម ធី"
    },
    {
        "barcode": "171111629",
        "dpc": "03022532701",
        "name": "ម៉ាត់ លី"
    },
    {
        "barcode": "171111630",
        "dpc": "03022532801",
        "name": "សំ សាន"
    },
    {
        "barcode": "171111631",
        "dpc": "03022545901",
        "name": "អួង សុផល"
    },
    {
        "barcode": "171111632",
        "dpc": "03022532901",
        "name": "ម៉ម បូរី"
    },
    {
        "barcode": "171111633",
        "dpc": "03022533001",
        "name": "ញឹក ការ"
    },
    {
        "barcode": "171111634",
        "dpc": "03022533101",
        "name": "សេង ហួន"
    },
    {
        "barcode": "171111635",
        "dpc": "03022533201",
        "name": "ញឹក នី"
    },
    {
        "barcode": "171111636",
        "dpc": "03022533301",
        "name": "ប៊ួ ស៊ីណា"
    },
    {
        "barcode": "171111637",
        "dpc": "03022533501",
        "name": "យ៉ុន គ្រោង"
    },
    {
        "barcode": "171111638",
        "dpc": "03022533601",
        "name": "មី ទូច"
    },
    {
        "barcode": "171111639",
        "dpc": "03022533701",
        "name": "សុខ សំអុន"
    },
    {
        "barcode": "171111640",
        "dpc": "03022533801",
        "name": "ស៊ុំ សំណាង"
    },
    {
        "barcode": "171111641",
        "dpc": "03022533901",
        "name": "ភឿក សំប៊ុន"
    },
    {
        "barcode": "171111642",
        "dpc": "03022534101",
        "name": "ស៊ុម ស៊ីនឿត"
    },
    {
        "barcode": "171111643",
        "dpc": "03022539101",
        "name": "ចាន់ ណូរ៉ា"
    },
    {
        "barcode": "171111644",
        "dpc": "03022534201",
        "name": "ភឿក សម្បត្តិ"
    },
    {
        "barcode": "171111645",
        "dpc": "03022546001",
        "name": "ប្រាក់ វ៉ាស់ធី"
    },
    {
        "barcode": "171111646",
        "dpc": "03022534301",
        "name": "ហ៊ាន បូផា"
    },
    {
        "barcode": "171111647",
        "dpc": "03022505801",
        "name": "សេង ស្រីណែត"
    },
    {
        "barcode": "171111648",
        "dpc": "03022541101",
        "name": "អាន តិច"
    },
    {
        "barcode": "171111649",
        "dpc": "03022501501",
        "name": "ប្លង់ ស៊ីនណារ៉ា"
    },
    {
        "barcode": "171111650",
        "dpc": "03022518901",
        "name": "អុំ ខុម"
    },
    {
        "barcode": "171111651",
        "dpc": "03022518801",
        "name": "យ៉ត សំបូរ"
    },
    {
        "barcode": "171111652",
        "dpc": "03022517301",
        "name": "ឡុង ខុនវណ្ឌី"
    },
    {
        "barcode": "171111653",
        "dpc": "03022517401",
        "name": "គង់ លន"
    },
    {
        "barcode": "171111654",
        "dpc": "03022524501",
        "name": "ផាត់ រ៉ា"
    },
    {
        "barcode": "171111655",
        "dpc": "03022519001",
        "name": "ឡុង សារ៉ាន់"
    },
    {
        "barcode": "171111656",
        "dpc": "03022501401",
        "name": "សុខ ស៊ីណាត"
    },
    {
        "barcode": "171111657",
        "dpc": "03022507101",
        "name": "ញ៉េប ចំរើន"
    },
    {
        "barcode": "171111658",
        "dpc": "03022512501",
        "name": "ឈីវ ឈឿត"
    },
    {
        "barcode": "171111659",
        "dpc": "03022520401",
        "name": "ជុំ ចាន់ដារ៉ារិទ្ធ"
    },
    {
        "barcode": "171111660",
        "dpc": "03022547201",
        "name": "សុខ រ៉ាឌី"
    },
    {
        "barcode": "171111661",
        "dpc": "03022534801",
        "name": "ស៊ុង ស៊ីវ៉ាន់"
    },
    {
        "barcode": "171111662",
        "dpc": "03022534901",
        "name": "សួន ជំនិត"
    },
    {
        "barcode": "171111663",
        "dpc": "03022547601",
        "name": "គង់ សំអាត"
    },
    {
        "barcode": "171111664",
        "dpc": "03022547701",
        "name": "ឈឿម ផល្លី"
    },
    {
        "barcode": "171111665",
        "dpc": "03022520501",
        "name": "សៅ ឆុន"
    },
    {
        "barcode": "171111666",
        "dpc": "03022500101",
        "name": "ឌុក ដារ៉ារិទ្ធ"
    },
    {
        "barcode": "171111667",
        "dpc": "03022500201",
        "name": "គ្រី ចន្ថា"
    },
    {
        "barcode": "171111668",
        "dpc": "03022500301",
        "name": "អង្គការក្តីសង្ឍឹមនៃកុមារ"
    },
    {
        "barcode": "171111669",
        "dpc": "03022504701",
        "name": "ភឹង ឆាន"
    },
    {
        "barcode": "171111670",
        "dpc": "03022504801",
        "name": "រឿម ធុច"
    },
    {
        "barcode": "171111671",
        "dpc": "03022505001",
        "name": "សំ វីរះ"
    },
    {
        "barcode": "171111672",
        "dpc": "03022505101",
        "name": "ឡិប អារ៉ាហ្វាត់"
    },
    {
        "barcode": "171111673",
        "dpc": "03022510401",
        "name": "ឯល ម៉ាស់"
    },
    {
        "barcode": "171111674",
        "dpc": "03022510701",
        "name": "សេម សុផល"
    },
    {
        "barcode": "171111675",
        "dpc": "03022515201",
        "name": "ស៊ីត សេត"
    },
    {
        "barcode": "171111676",
        "dpc": "03022516001",
        "name": "ជាង ឃ្លោក"
    },
    {
        "barcode": "171111677",
        "dpc": "03022516501",
        "name": "ដាំ ចំរើន"
    },
    {
        "barcode": "171111678",
        "dpc": "03022516601",
        "name": "គណៈបក្សសង្កាត់ ស្លាកែត"
    },
    {
        "barcode": "171111679",
        "dpc": "03022518501",
        "name": "ទេស កាសូម"
    },
    {
        "barcode": "171111680",
        "dpc": "03022521101",
        "name": "ដួង សំរស្មី"
    },
    {
        "barcode": "171111681",
        "dpc": "03022521501",
        "name": "វ៉ាត ស៊ីម"
    },
    {
        "barcode": "171111682",
        "dpc": "03022522401",
        "name": "អ៊ឹង ទី"
    },
    {
        "barcode": "171111683",
        "dpc": "03022523301",
        "name": "ម៉ាត់ ម៉ារី"
    },
    {
        "barcode": "171111684",
        "dpc": "03022524601",
        "name": "ហេង ប៊ុនលី"
    },
    {
        "barcode": "171111685",
        "dpc": "03022524701",
        "name": "ទឹម ហ៊ីង"
    },
    {
        "barcode": "171111686",
        "dpc": "03022525101",
        "name": "សួន នួន"
    },
    {
        "barcode": "171111687",
        "dpc": "03022540201",
        "name": "ឡុង សាវ៉ាត"
    },
    {
        "barcode": "171111688",
        "dpc": "03022542601",
        "name": "ខាន់ ហុង"
    },
    {
        "barcode": "171111689",
        "dpc": "03022545301",
        "name": "ទីន សា"
    },
    {
        "barcode": "171111690",
        "dpc": "03022545401",
        "name": "ឌុក ឈូក"
    },
    {
        "barcode": "171111691",
        "dpc": "03022545601",
        "name": "ឯល ការីម ២"
    },
    {
        "barcode": "171111692",
        "dpc": "03022520101",
        "name": "សេង ហៃ១"
    },
    {
        "barcode": "171111693",
        "dpc": "03022543801",
        "name": "ត្រិច ថា"
    },
    {
        "barcode": "171111694",
        "dpc": "03022543701",
        "name": "វន់ វិបុល"
    },
    {
        "barcode": "171111695",
        "dpc": "03022534501",
        "name": "ប៊ុន វ៉ាន់ថា"
    },
    {
        "barcode": "171111696",
        "dpc": "03022521601",
        "name": "កែវ សាយ"
    },
    {
        "barcode": "171111697",
        "dpc": "03022521701",
        "name": "អ៊ី សំណាង"
    },
    {
        "barcode": "171111698",
        "dpc": "03022514501",
        "name": "ឈាន ឆឹម"
    },
    {
        "barcode": "171111699",
        "dpc": "03022510801",
        "name": "សួន ស៊ាប"
    },
    {
        "barcode": "171111700",
        "dpc": "03022534601",
        "name": "វណ្ណ កញ្ចណា"
    },
    {
        "barcode": "171111701",
        "dpc": "03022522001",
        "name": "ប៊ុន រ៉ន"
    },
    {
        "barcode": "171111702",
        "dpc": "03022521901",
        "name": "ជឿ គឹមឆាយ"
    },
    {
        "barcode": "171111703",
        "dpc": "03022521801",
        "name": "លី ង៉ា"
    },
    {
        "barcode": "171111704",
        "dpc": "03022517801",
        "name": "យិប វ៉ៃ"
    },
    {
        "barcode": "171111705",
        "dpc": "03022516201",
        "name": "ឈួម រួម"
    },
    {
        "barcode": "171111706",
        "dpc": "03022511001",
        "name": "សំ សាវៀង"
    },
    {
        "barcode": "171111707",
        "dpc": "03022510901",
        "name": "សេង ជា"
    },
    {
        "barcode": "171111708",
        "dpc": "03022500501",
        "name": "សុច ក្រួច"
    },
    {
        "barcode": "171111709",
        "dpc": "03022522201",
        "name": "ពុំ វណ្ណ"
    },
    {
        "barcode": "171111710",
        "dpc": "03022520201",
        "name": "យិន សាវុធ"
    },
    {
        "barcode": "171111711",
        "dpc": "03022511101",
        "name": "សេង គឹមហ៊ាក"
    },
    {
        "barcode": "171111712",
        "dpc": "03022505501",
        "name": "លុន ឆោម"
    },
    {
        "barcode": "171111713",
        "dpc": "03022505401",
        "name": "យុទ្ធ ពន្លក"
    },
    {
        "barcode": "171111714",
        "dpc": "03022500701",
        "name": "ពិន ចាន់នៀត"
    },
    {
        "barcode": "171111715",
        "dpc": "03022500601",
        "name": "ញឹម មន្ថា"
    },
    {
        "barcode": "171111716",
        "dpc": "03022546801",
        "name": "ប៊ុន រុំ"
    },
    {
        "barcode": "171111717",
        "dpc": "03022539301",
        "name": "យ៉ិន សារ៉ុម"
    },
    {
        "barcode": "171111718",
        "dpc": "03022505301",
        "name": "លឹម សុភ័ក្រ"
    },
    {
        "barcode": "171111719",
        "dpc": "03022539501",
        "name": "ជា ទ្រីប៊ុនរ័ត្ន"
    },
    {
        "barcode": "171111720",
        "dpc": "03022514601",
        "name": "វង់ កក្កដា"
    },
    {
        "barcode": "171111721",
        "dpc": "03022500901",
        "name": "ភួង សាមុត"
    },
    {
        "barcode": "171111722",
        "dpc": "03022500801",
        "name": "អឿ មេត្រី"
    },
    {
        "barcode": "171111723",
        "dpc": "03022501201",
        "name": "ហ៊ីម សុខខា"
    },
    {
        "barcode": "171111724",
        "dpc": "03022501001",
        "name": "សាលា ឧបោសថសីល"
    },
    {
        "barcode": "171111725",
        "dpc": "03022520301",
        "name": "សឿម ស៊ុន"
    },
    {
        "barcode": "171111726",
        "dpc": "03022516301",
        "name": "រី រិទ្ធី"
    },
    {
        "barcode": "171111727",
        "dpc": "03022505701",
        "name": "អេន ស៊ីណា"
    },
    {
        "barcode": "171111728",
        "dpc": "03022505601",
        "name": "អេន សាវឌី"
    },
    {
        "barcode": "171111729",
        "dpc": "03022504901",
        "name": "ទេព នីន"
    },
    {
        "barcode": "171111730",
        "dpc": "03022546901",
        "name": "លឹម ទូច"
    },
    {
        "barcode": "171111731",
        "dpc": "03022539401",
        "name": "រស់ សារ៉ុន"
    },
    {
        "barcode": "171111732",
        "dpc": "03022534701",
        "name": "លឿម វុទ្ធី"
    },
    {
        "barcode": "171111733",
        "dpc": "03022519101",
        "name": "តូច ខៃ"
    },
    {
        "barcode": "171111734",
        "dpc": "03022520601",
        "name": "យឿង យ៉េត"
    },
    {
        "barcode": "171111735",
        "dpc": "03022512901",
        "name": "វុន ស៊ីរឿន"
    },
    {
        "barcode": "171111736",
        "dpc": "03022511201",
        "name": "សៀង សុថង ៤"
    },
    {
        "barcode": "171111737",
        "dpc": "03022505201",
        "name": "ហាំង ឡេង"
    },
    {
        "barcode": "171111738",
        "dpc": "03022516401",
        "name": "ទីវ ជូឡុង"
    },
    {
        "barcode": "171111739",
        "dpc": "03022520801",
        "name": "វិត រិទ្ធី"
    },
    {
        "barcode": "171111740",
        "dpc": "03022547101",
        "name": "សុខ ប៊ុនដារ៉ា"
    },
    {
        "barcode": "171111741",
        "dpc": "03022524901",
        "name": "ឌឿន សុវណ្ណ"
    },
    {
        "barcode": "171111742",
        "dpc": "03022510301",
        "name": "ទាវ អុំមី"
    },
    {
        "barcode": "171111743",
        "dpc": "03022510201",
        "name": "ម៉ាត រ៉ែ"
    },
    {
        "barcode": "171111744",
        "dpc": "03022504001",
        "name": "ឡេះ ហ្វាស៊ី"
    },
    {
        "barcode": "171111745",
        "dpc": "03022504201",
        "name": "ណុះ សារិទ្ធ"
    },
    {
        "barcode": "171111746",
        "dpc": "03022504101",
        "name": "យី សេមម៉ូស្លីម"
    },
    {
        "barcode": "171111747",
        "dpc": "03022515901",
        "name": "ណាម មុនី"
    },
    {
        "barcode": "171111748",
        "dpc": "03022504401",
        "name": "រស់ ម៉ៅ"
    },
    {
        "barcode": "171111749",
        "dpc": "03022524801",
        "name": "សឹម ហ៊ូសាន"
    },
    {
        "barcode": "171111750",
        "dpc": "03022519301",
        "name": "លី រ៉ានី"
    },
    {
        "barcode": "171111751",
        "dpc": "03022510101",
        "name": "ទា ប៊ីណា"
    },
    {
        "barcode": "171111752",
        "dpc": "03022504301",
        "name": "កៅ ជប៉ុន"
    },
    {
        "barcode": "171111753",
        "dpc": "03022535001",
        "name": "ប្រាក់ ចាន់ណា"
    },
    {
        "barcode": "171111754",
        "dpc": "03022540601",
        "name": "លឹម សុភ័ណ្ឌ"
    },
    {
        "barcode": "171111755",
        "dpc": "03022540501",
        "name": "ហុង សុភាព"
    },
    {
        "barcode": "171111756",
        "dpc": "03022540401",
        "name": "ប៊ុន សៀង"
    },
    {
        "barcode": "171111757",
        "dpc": "03022547901",
        "name": "ផេង រុងរឿង"
    },
    {
        "barcode": "171111758",
        "dpc": "03022548001",
        "name": "ពេជ្រ គឹមធា"
    }
]
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});