let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=
    [
    {
        "barcode": "171110926",
        "dpc": "03032630301",
        "name": "ពៅ ជ្រិន"
    },
    {
        "barcode": "171110927",
        "dpc": "03032618401",
        "name": "វ៉ាន់ សុខា"
    },
    {
        "barcode": "171110928",
        "dpc": "03032607301",
        "name": "ពៅ ស្រីពេជ្រ"
    },
    {
        "barcode": "171110929",
        "dpc": "03032642101",
        "name": "ទិន សាមិត្ត"
    },
    {
        "barcode": "171110930",
        "dpc": "03032637801",
        "name": "ថូ សុភា"
    },
    {
        "barcode": "171110931",
        "dpc": "03032630501",
        "name": "ប៉ែន សារ៉ា"
    },
    {
        "barcode": "171110932",
        "dpc": "03032630101",
        "name": "មុយ គារ"
    },
    {
        "barcode": "171110933",
        "dpc": "03032630001",
        "name": "ឡាយ អូន"
    },
    {
        "barcode": "171110934",
        "dpc": "03032628801",
        "name": "យ៉ាន់ យឿន"
    },
    {
        "barcode": "171110935",
        "dpc": "03032622401",
        "name": "លន់ យឿន"
    },
    {
        "barcode": "171110936",
        "dpc": "03032614901",
        "name": "មុត មាន"
    },
    {
        "barcode": "171110937",
        "dpc": "03032614701",
        "name": "តាំង ប៊ុនហួត"
    },
    {
        "barcode": "171110938",
        "dpc": "03032605301",
        "name": "សេក វណ្ណថន"
    },
    {
        "barcode": "171110939",
        "dpc": "03032605201",
        "name": "តាន់ គឹមឡេង"
    },
    {
        "barcode": "171110940",
        "dpc": "03032601001",
        "name": "ញ៉ែម គឹមហេង"
    },
    {
        "barcode": "171110941",
        "dpc": "03032634501",
        "name": "កែ សៅ"
    },
    {
        "barcode": "171110942",
        "dpc": "03032626201",
        "name": "ជឿន គឹមសួរ"
    },
    {
        "barcode": "171110943",
        "dpc": "03032621501",
        "name": "ដួង ដារ៉ា"
    },
    {
        "barcode": "171110944",
        "dpc": "03032621401",
        "name": "ព្រំ ចំរើន"
    },
    {
        "barcode": "171110945",
        "dpc": "03032627201",
        "name": "យឹម ខេមរៈ"
    },
    {
        "barcode": "171110946",
        "dpc": "03032621201",
        "name": "ឈឹម សាមុន"
    },
    {
        "barcode": "171110947",
        "dpc": "03032619501",
        "name": "ចាន់ សេង"
    },
    {
        "barcode": "171110948",
        "dpc": "03032615301",
        "name": "ម៉ាស់ ម៉ាត់សេត"
    },
    {
        "barcode": "171110949",
        "dpc": "03032614801",
        "name": "ជា លែងហួត"
    },
    {
        "barcode": "171110950",
        "dpc": "03032614501",
        "name": "សាម ដារ៉ា"
    },
    {
        "barcode": "171110951",
        "dpc": "03032607701",
        "name": "ចាន់ សុខា"
    },
    {
        "barcode": "171110952",
        "dpc": "03032600901",
        "name": "ឡិប ណាវី"
    },
    {
        "barcode": "171110953",
        "dpc": "03032626601",
        "name": "ញ៉ែម សុធូ"
    },
    {
        "barcode": "171110954",
        "dpc": "03032626101",
        "name": "ជា ខាំ"
    },
    {
        "barcode": "171110955",
        "dpc": "03032626001",
        "name": "ជា ពន្លឺរស្មី"
    },
    {
        "barcode": "171110956",
        "dpc": "03032625901",
        "name": "ហោ ឃឺន"
    },
    {
        "barcode": "171110957",
        "dpc": "03032625801",
        "name": "ជា ង៉ិត"
    },
    {
        "barcode": "171110958",
        "dpc": "03032625701",
        "name": "ព្រុំ វណ្ណារី"
    },
    {
        "barcode": "171110959",
        "dpc": "03032624601",
        "name": "ឃុន ចន្ធី"
    },
    {
        "barcode": "171110960",
        "dpc": "03032623001",
        "name": "វី សាវង់"
    },
    {
        "barcode": "171110961",
        "dpc": "03032621801",
        "name": "កែវ អន"
    },
    {
        "barcode": "171110962",
        "dpc": "03032621701",
        "name": "ណម សុផាន"
    },
    {
        "barcode": "171110963",
        "dpc": "03032619601",
        "name": "វ៉ាន់ ស៊ីន"
    },
    {
        "barcode": "171110964",
        "dpc": "03032605601",
        "name": "ចុន ប៊ុនរិទ្ធ"
    },
    {
        "barcode": "171110965",
        "dpc": "03032636401",
        "name": "ជា ធូ"
    },
    {
        "barcode": "171110966",
        "dpc": "03032636201",
        "name": "តឹក ឃុន"
    },
    {
        "barcode": "171110967",
        "dpc": "03032634401",
        "name": "លី កែវ"
    },
    {
        "barcode": "171110968",
        "dpc": "03032630401",
        "name": "ឆន វុទ្ធា"
    },
    {
        "barcode": "171110969",
        "dpc": "03032626501",
        "name": "សួន សុដានី"
    },
    {
        "barcode": "171110970",
        "dpc": "03032626401",
        "name": "កែវ ចាន់ថុល"
    },
    {
        "barcode": "171110971",
        "dpc": "03032623201",
        "name": "ស៊ុក វ៉ាន់ឌី"
    },
    {
        "barcode": "171110972",
        "dpc": "03032623101",
        "name": "ឈឹម ភីណាល់"
    },
    {
        "barcode": "171110973",
        "dpc": "03032622701",
        "name": "សុន សាវឿន"
    },
    {
        "barcode": "171110974",
        "dpc": "03032619701",
        "name": "ហាន់ ហ៊ីម"
    },
    {
        "barcode": "171110975",
        "dpc": "03032614101",
        "name": "ក្រេម ប៉ូលីន"
    },
    {
        "barcode": "171110976",
        "dpc": "03032610701",
        "name": "ចាន់ ណារ៉ុង"
    },
    {
        "barcode": "171110977",
        "dpc": "03032608601",
        "name": "លី សុខសីហា"
    },
    {
        "barcode": "171110978",
        "dpc": "03032608301",
        "name": "ប៉ុន សេដ្ឋា"
    },
    {
        "barcode": "171110979",
        "dpc": "03032607601",
        "name": "សយ វ៉ិន"
    },
    {
        "barcode": "171110980",
        "dpc": "03032607501",
        "name": "ឯក កេត"
    },
    {
        "barcode": "171110981",
        "dpc": "03032607401",
        "name": "សរ សំណាង"
    },
    {
        "barcode": "171110982",
        "dpc": "03032606601",
        "name": "ហាវ ចន្ទតារា"
    },
    {
        "barcode": "171110983",
        "dpc": "03032605801",
        "name": "ស៊ឹម សល្យ"
    },
    {
        "barcode": "171110984",
        "dpc": "03032640201",
        "name": "លឹម សេង"
    },
    {
        "barcode": "171110985",
        "dpc": "03032640101",
        "name": "តាំង គី"
    },
    {
        "barcode": "171110986",
        "dpc": "03032608001",
        "name": "វ៉ាន់ សារុំ"
    },
    {
        "barcode": "171110987",
        "dpc": "03032633501",
        "name": "ទួន ថាវី"
    },
    {
        "barcode": "171110988",
        "dpc": "03032618501",
        "name": "លី ម៉ៃហ្វុង"
    },
    {
        "barcode": "171110989",
        "dpc": "03032602501",
        "name": "លឹម ខន"
    },
    {
        "barcode": "171110990",
        "dpc": "03032601601",
        "name": "នុត ធួក"
    },
    {
        "barcode": "171110991",
        "dpc": "03032637701",
        "name": "ថុន ថាលីន"
    },
    {
        "barcode": "171110992",
        "dpc": "03032625201",
        "name": "លី អ៊ុតនី"
    },
    {
        "barcode": "171110993",
        "dpc": "03032629701",
        "name": "នាង ណៃ"
    },
    {
        "barcode": "171110994",
        "dpc": "03032602001",
        "name": "ឡុង ថុល"
    },
    {
        "barcode": "171110995",
        "dpc": "03032602401",
        "name": "គឹម ណារេត"
    },
    {
        "barcode": "171110996",
        "dpc": "03032635601",
        "name": "ជា សុផាន់ណា"
    },
    {
        "barcode": "171110997",
        "dpc": "03032617601",
        "name": "កង សុវណ្ណអង្គារ"
    },
    {
        "barcode": "171110998",
        "dpc": "03032635501",
        "name": "ឡាច ផូ"
    },
    {
        "barcode": "171110999",
        "dpc": "03032637601",
        "name": "ជួង កែវរដ្ឋា"
    },
    {
        "barcode": "171111000",
        "dpc": "03032618901",
        "name": "ចៅ ណាង"
    },
    {
        "barcode": "171111001",
        "dpc": "03032634001",
        "name": "សំ ផន"
    },
    {
        "barcode": "171111002",
        "dpc": "03032602201",
        "name": "សំ ជ្រីម"
    },
    {
        "barcode": "171111003",
        "dpc": "03032624701",
        "name": "ឡូញ ពៅ"
    },
    {
        "barcode": "171111004",
        "dpc": "03032619001",
        "name": "កែវ សុវណ្ណ"
    },
    {
        "barcode": "171111005",
        "dpc": "03032602901",
        "name": "ហង់ វណ្ឌី"
    },
    {
        "barcode": "171111006",
        "dpc": "03032640801",
        "name": "ប៉ុក វ៉ុង"
    },
    {
        "barcode": "171111007",
        "dpc": "03032618701",
        "name": "ជូ កែវពិសិដ្ឋ"
    },
    {
        "barcode": "171111008",
        "dpc": "03032622601",
        "name": "នៅ ចាន់"
    },
    {
        "barcode": "171111009",
        "dpc": "03032618801",
        "name": "ហាប់ វី"
    },
    {
        "barcode": "171111010",
        "dpc": "03032601101",
        "name": "សុខ អេង"
    },
    {
        "barcode": "171111011",
        "dpc": "03032600101",
        "name": "គឹម ឡី"
    },
    {
        "barcode": "171111012",
        "dpc": "03032644001",
        "name": "នួន សុខា"
    },
    {
        "barcode": "171111013",
        "dpc": "03032622501",
        "name": "ដែក ចាន់នួន"
    },
    {
        "barcode": "171111014",
        "dpc": "03032633801",
        "name": "អ៊ុង សុភ័ណ្ឌ"
    },
    {
        "barcode": "171111015",
        "dpc": "03032640301",
        "name": "ដោ ស៊ីនឿន"
    },
    {
        "barcode": "171111016",
        "dpc": "03032635701",
        "name": "ណាំ ណាន"
    },
    {
        "barcode": "171111017",
        "dpc": "03032633601",
        "name": "ស៊ិន សុជាតិ"
    },
    {
        "barcode": "171111018",
        "dpc": "03032632101",
        "name": "លី វ៉ាន់ណា"
    },
    {
        "barcode": "171111019",
        "dpc": "03032632001",
        "name": "គឹម លាង"
    },
    {
        "barcode": "171111020",
        "dpc": "03032633701",
        "name": "ប៉ាល់ តឹក"
    },
    {
        "barcode": "171111021",
        "dpc": "03032628301",
        "name": "ទឹម បំរ៉ុង"
    },
    {
        "barcode": "171111022",
        "dpc": "03032606701",
        "name": "ហុក ហេង"
    },
    {
        "barcode": "171111023",
        "dpc": "03032606501",
        "name": "ដួង ភាច"
    },
    {
        "barcode": "171111024",
        "dpc": "03032619801",
        "name": "សុខ សូល័ក្ខណ៍"
    },
    {
        "barcode": "171111025",
        "dpc": "03032608401",
        "name": "ឡាច ផេង"
    },
    {
        "barcode": "171111026",
        "dpc": "03032625501",
        "name": "ហុង ជីហាក់"
    },
    {
        "barcode": "171111027",
        "dpc": "03032624501",
        "name": "សុខ ណាវី"
    },
    {
        "barcode": "171111028",
        "dpc": "03032628701",
        "name": "ចិន មុំ(វត្តទួលតាឯក)"
    },
    {
        "barcode": "171111029",
        "dpc": "03032636101",
        "name": "ហេង ណេង"
    },
    {
        "barcode": "171111030",
        "dpc": "03032636001",
        "name": "ជិន ហឿន"
    },
    {
        "barcode": "171111031",
        "dpc": "03032632201",
        "name": "ទេព ករុណា"
    },
    {
        "barcode": "171111032",
        "dpc": "03032605701",
        "name": "យូ បូរ"
    },
    {
        "barcode": "171111033",
        "dpc": "03032633401",
        "name": "សេក ហួយ"
    },
    {
        "barcode": "171111034",
        "dpc": "03032608201",
        "name": "អ៊ុច សុខហ៊ាង"
    },
    {
        "barcode": "171111035",
        "dpc": "03032607801",
        "name": "ថង ឈិនសុភា"
    },
    {
        "barcode": "171111036",
        "dpc": "03032607901",
        "name": "ឡុង សារេត"
    },
    {
        "barcode": "171111037",
        "dpc": "03032619201",
        "name": "រិន ពន្លក"
    },
    {
        "barcode": "171111038",
        "dpc": "03032637501",
        "name": "ច្រឹង ច័ន្ទរស្មី"
    },
    {
        "barcode": "171111039",
        "dpc": "03032628601",
        "name": "ហេង វុទ្ធី"
    },
    {
        "barcode": "171111040",
        "dpc": "03032615201",
        "name": "សេង សោម៉ា"
    },
    {
        "barcode": "171111041",
        "dpc": "03032619101",
        "name": "ម៉ែន សំអុល"
    },
    {
        "barcode": "171111042",
        "dpc": "03032635901",
        "name": "ទ្រី គឹមហៀង"
    },
    {
        "barcode": "171111043",
        "dpc": "03032603101",
        "name": "វង្ស ណៃ"
    },
    {
        "barcode": "171111044",
        "dpc": "03032600601",
        "name": "ឈុន លីណា"
    },
    {
        "barcode": "171111045",
        "dpc": "03032603001",
        "name": "ហាក់ ស្រី"
    },
    {
        "barcode": "171111046",
        "dpc": "03032622801",
        "name": "ឡុង វិត"
    },
    {
        "barcode": "171111047",
        "dpc": "03032631801",
        "name": "សេង រ៉ានី"
    },
    {
        "barcode": "171111048",
        "dpc": "03032633901",
        "name": "ហ៊ាង សុខហេង"
    },
    {
        "barcode": "171111049",
        "dpc": "03032631901",
        "name": "ឈាង សែម"
    },
    {
        "barcode": "171111050",
        "dpc": "03032600201",
        "name": "ឃុត សោភ័ណ"
    },
    {
        "barcode": "171111051",
        "dpc": "03032602601",
        "name": "រ៉ុន ចាន់ធី"
    },
    {
        "barcode": "171111052",
        "dpc": "03032602701",
        "name": "សុខ ចំរើន"
    },
    {
        "barcode": "171111053",
        "dpc": "03032621901",
        "name": "មឿត សាមឿន"
    },
    {
        "barcode": "171111054",
        "dpc": "03032603201",
        "name": "នួន សុគុណ"
    },
    {
        "barcode": "171111055",
        "dpc": "03032630201",
        "name": "ឃាន សំណាង"
    },
    {
        "barcode": "171111056",
        "dpc": "03032633301",
        "name": "គង់ សម"
    },
    {
        "barcode": "171111057",
        "dpc": "03032602101",
        "name": "សៅ សុភក្តិ"
    },
    {
        "barcode": "171111058",
        "dpc": "03032605901",
        "name": "មាស លីហួយ"
    },
    {
        "barcode": "171111059",
        "dpc": "03032609401",
        "name": "ប៊ុន ណាក់"
    },
    {
        "barcode": "171111060",
        "dpc": "03032620901",
        "name": "តាំង យ៉ាវ"
    },
    {
        "barcode": "171111061",
        "dpc": "03032630801",
        "name": "តែ គឹមសួន"
    },
    {
        "barcode": "171111062",
        "dpc": "03032615401",
        "name": "ម៉ៅ សុវណ្ណារី"
    },
    {
        "barcode": "171111063",
        "dpc": "03032641201",
        "name": "លី ប៊ុនរិទ្ធ"
    },
    {
        "barcode": "171111064",
        "dpc": "03032633001",
        "name": "លាង ហាក់"
    },
    {
        "barcode": "171111065",
        "dpc": "03032639901",
        "name": "ហុក កុសល៤"
    },
    {
        "barcode": "171111066",
        "dpc": "03032640001",
        "name": "បៅ តុង"
    },
    {
        "barcode": "171111067",
        "dpc": "03032643901",
        "name": "លឹម ឃុន"
    },
    {
        "barcode": "171111068",
        "dpc": "03032636701",
        "name": "សួ លី១"
    },
    {
        "barcode": "171111069",
        "dpc": "03032638501",
        "name": "ឡុង ផន"
    },
    {
        "barcode": "171111070",
        "dpc": "03032638601",
        "name": "សែន គីមស៊ន"
    },
    {
        "barcode": "171111071",
        "dpc": "03032643701",
        "name": "សំ សេង"
    },
    {
        "barcode": "171111072",
        "dpc": "03032627701",
        "name": "យៀង គឹមយ៉ា"
    },
    {
        "barcode": "171111073",
        "dpc": "03032636801",
        "name": "សំ សេង ១"
    },
    {
        "barcode": "171111074",
        "dpc": "03032643801",
        "name": "កេង កន្និដ្ឋា"
    },
    {
        "barcode": "171111075",
        "dpc": "03032636601",
        "name": "ហុក កុសល៣"
    },
    {
        "barcode": "171111076",
        "dpc": "03032616301",
        "name": "លី ឆទិញ"
    },
    {
        "barcode": "171111077",
        "dpc": "03032620801",
        "name": "ភៀន សុផល"
    },
    {
        "barcode": "171111078",
        "dpc": "03032617701",
        "name": "សួ លី"
    },
    {
        "barcode": "171111079",
        "dpc": "03032631401",
        "name": "ម៉ូវ ហោ"
    },
    {
        "barcode": "171111080",
        "dpc": "03032639301",
        "name": "ស៊ុន សុផា"
    },
    {
        "barcode": "171111081",
        "dpc": "03032606401",
        "name": "សុខ ភាព"
    },
    {
        "barcode": "171111082",
        "dpc": "03032606801",
        "name": "គឹម លី"
    },
    {
        "barcode": "171111083",
        "dpc": "03032621101",
        "name": "ជា វិដេ"
    },
    {
        "barcode": "171111084",
        "dpc": "03032629601",
        "name": "ហ៊ី ស៊ីថា"
    },
    {
        "barcode": "171111085",
        "dpc": "03032610501",
        "name": "តន់ សាវ៉ាត់"
    },
    {
        "barcode": "171111086",
        "dpc": "03032638401",
        "name": "សោម សំនៀង"
    },
    {
        "barcode": "171111087",
        "dpc": "03032639201",
        "name": "សេង សុខនី"
    },
    {
        "barcode": "171111088",
        "dpc": "03032600401",
        "name": "កេង សុខហេង"
    },
    {
        "barcode": "171111089",
        "dpc": "03032609301",
        "name": "ថន គឹមហុង ១"
    },
    {
        "barcode": "171111090",
        "dpc": "03032607101",
        "name": "លឹម រក្សា"
    },
    {
        "barcode": "171111091",
        "dpc": "03032607201",
        "name": "តាំង ហុកសេង"
    },
    {
        "barcode": "171111092",
        "dpc": "03032606301",
        "name": "មាស ឧត្តម"
    },
    {
        "barcode": "171111093",
        "dpc": "03032606201",
        "name": "លាង ហាវ"
    },
    {
        "barcode": "171111094",
        "dpc": "03032645401",
        "name": "ង៉ោ គន្ធា"
    },
    {
        "barcode": "171111095",
        "dpc": "03032645301",
        "name": "ហ៊ុយ ស៊ីម១"
    },
    {
        "barcode": "171111096",
        "dpc": "03032609601",
        "name": "ហ្វឹក អាន"
    },
    {
        "barcode": "171111097",
        "dpc": "03032610101",
        "name": "តាន់ ឡួង"
    },
    {
        "barcode": "171111098",
        "dpc": "03032610001",
        "name": "ឈរ ទី"
    },
    {
        "barcode": "171111099",
        "dpc": "03032616801",
        "name": "ឃូ ឡេង"
    },
    {
        "barcode": "171111100",
        "dpc": "03032609501",
        "name": "សុខ ឡេង"
    },
    {
        "barcode": "171111101",
        "dpc": "03032603801",
        "name": "ហ្គូវ លាងគា"
    },
    {
        "barcode": "171111102",
        "dpc": "03032630901",
        "name": "អេង ម៉េង"
    },
    {
        "barcode": "171111103",
        "dpc": "03032601901",
        "name": "យ៉ង់ ហាវ"
    },
    {
        "barcode": "171111104",
        "dpc": "03032609001",
        "name": "តាំង សុខហ៊ី"
    },
    {
        "barcode": "171111105",
        "dpc": "03032627601",
        "name": "ហុង ស៊ីវ"
    },
    {
        "barcode": "171111106",
        "dpc": "03032639401",
        "name": "ឃីម គឹមលាង"
    },
    {
        "barcode": "171111107",
        "dpc": "03032616101",
        "name": "គឹម ពេជ្រ"
    },
    {
        "barcode": "171111108",
        "dpc": "03032610301",
        "name": "ម៉ៃ ផាណា"
    },
    {
        "barcode": "171111109",
        "dpc": "03032606901",
        "name": "សួរ ឃីម"
    },
    {
        "barcode": "171111110",
        "dpc": "03032647901",
        "name": "ញ៉ែម តិច"
    },
    {
        "barcode": "171111111",
        "dpc": "03032647801",
        "name": "អ៊ុន ទាគួង"
    },
    {
        "barcode": "171111112",
        "dpc": "03032647701",
        "name": "អ៊ុន ណារ៉ុង"
    },
    {
        "barcode": "171111113",
        "dpc": "03032647601",
        "name": "ឌឹម វីរោចន៍"
    },
    {
        "barcode": "171111114",
        "dpc": "03032647501",
        "name": "ស៊ី នួន"
    },
    {
        "barcode": "171111115",
        "dpc": "03032647301",
        "name": "ជិន ហុក"
    },
    {
        "barcode": "171111116",
        "dpc": "03032647201",
        "name": "ហឿង សុជាតិ"
    },
    {
        "barcode": "171111117",
        "dpc": "03032647101",
        "name": "តាន់ សៅដេត"
    },
    {
        "barcode": "171111118",
        "dpc": "03032646501",
        "name": "កៅ សារ៉ាឌី"
    },
    {
        "barcode": "171111119",
        "dpc": "03032646401",
        "name": "ហ៊ួរ ហាវ"
    },
    {
        "barcode": "171111120",
        "dpc": "03032646301",
        "name": "រិម សុវឌ្ឍនា"
    },
    {
        "barcode": "171111121",
        "dpc": "03032628501",
        "name": "ជឺ ពុំ៤"
    },
    {
        "barcode": "171111122",
        "dpc": "03032635301",
        "name": "ហេង ទន"
    },
    {
        "barcode": "171111123",
        "dpc": "03032623401",
        "name": "ស៊ុន សាវ៉ាត"
    },
    {
        "barcode": "171111124",
        "dpc": "03032629501",
        "name": "យ៉ុង យី"
    },
    {
        "barcode": "171111125",
        "dpc": "03032615801",
        "name": "ស្វាង សាវី"
    },
    {
        "barcode": "171111126",
        "dpc": "03032627501",
        "name": "សែម ដារា"
    },
    {
        "barcode": "171111127",
        "dpc": "03032615901",
        "name": "នេត អង់តូនី"
    },
    {
        "barcode": "171111128",
        "dpc": "03032641801",
        "name": "សុខ សុផាន់នី"
    },
    {
        "barcode": "171111129",
        "dpc": "03032620701",
        "name": "យូ គាសៀង"
    },
    {
        "barcode": "171111130",
        "dpc": "03032620601",
        "name": "ចាំង វិនខង"
    },
    {
        "barcode": "171111131",
        "dpc": "03032620501",
        "name": "ហេង សុខហួត"
    },
    {
        "barcode": "171111132",
        "dpc": "03032618201",
        "name": "ហូ គឹមហេង"
    },
    {
        "barcode": "171111133",
        "dpc": "03032618101",
        "name": "ដាញ់ អេងប៊ុនវ៉ាន់"
    },
    {
        "barcode": "171111134",
        "dpc": "03032616601",
        "name": "កឿន សត្យា"
    },
    {
        "barcode": "171111135",
        "dpc": "03032617301",
        "name": "ជឺ ពុំ ១"
    },
    {
        "barcode": "171111136",
        "dpc": "03032620401",
        "name": "ឆ អ៊ឹង"
    },
    {
        "barcode": "171111137",
        "dpc": "03032641901",
        "name": "តាំង ផេងហ៊ី"
    },
    {
        "barcode": "171111138",
        "dpc": "03032642001",
        "name": "តាំង ផេងហ៊ី ១"
    },
    {
        "barcode": "171111139",
        "dpc": "03032616501",
        "name": "ងិន សុកជា"
    },
    {
        "barcode": "171111140",
        "dpc": "03032616401",
        "name": "ស៊ី ថាពេជ្រ"
    },
    {
        "barcode": "171111141",
        "dpc": "03032617201",
        "name": "សាន់ ហៃ"
    },
    {
        "barcode": "171111142",
        "dpc": "03032615701",
        "name": "គឹម ម៉ូលី"
    },
    {
        "barcode": "171111143",
        "dpc": "03032615601",
        "name": "គា លីហូវ"
    },
    {
        "barcode": "171111144",
        "dpc": "03032623601",
        "name": "ថា ប៊ុនធឿន"
    },
    {
        "barcode": "171111145",
        "dpc": "03032620201",
        "name": "សុខ ធី"
    },
    {
        "barcode": "171111146",
        "dpc": "03032623701",
        "name": "យ៉ាន់ ម៉ៅ"
    },
    {
        "barcode": "171111147",
        "dpc": "03032623801",
        "name": "រិន សម្បត្តិ"
    },
    {
        "barcode": "171111148",
        "dpc": "03032638801",
        "name": "នឹម ស៊ីនួន"
    },
    {
        "barcode": "171111149",
        "dpc": "03032626301",
        "name": "អ៊ិន ឧត្តម"
    },
    {
        "barcode": "171111150",
        "dpc": "03032619401",
        "name": "ហេង ហុក១"
    },
    {
        "barcode": "171111151",
        "dpc": "03032623901",
        "name": "សុខ រ៉ែន"
    },
    {
        "barcode": "171111152",
        "dpc": "03032627901",
        "name": "ឯម សាវ៉ាត់"
    },
    {
        "barcode": "171111153",
        "dpc": "03032632401",
        "name": "ឡុង អេងថៃ"
    },
    {
        "barcode": "171111154",
        "dpc": "03032632301",
        "name": "ទុយ វីន"
    },
    {
        "barcode": "171111155",
        "dpc": "03032629201",
        "name": "សូ សុកិត្យា"
    },
    {
        "barcode": "171111156",
        "dpc": "03032628101",
        "name": "ពៅ កញ្ញា"
    },
    {
        "barcode": "171111157",
        "dpc": "03032633101",
        "name": "ពឹង គឹមជូ"
    },
    {
        "barcode": "171111158",
        "dpc": "03032641401",
        "name": "ញាន កុឡាប"
    },
    {
        "barcode": "171111159",
        "dpc": "03032645701",
        "name": "ចៅ ស៊ីនលី"
    },
    {
        "barcode": "171111160",
        "dpc": "03032639601",
        "name": "សុង ហេង"
    },
    {
        "barcode": "171111161",
        "dpc": "03032631001",
        "name": "វ៉ាត ទូច"
    },
    {
        "barcode": "171111162",
        "dpc": "03032641301",
        "name": "តាំង សុវឌ្ឍនា"
    },
    {
        "barcode": "171111163",
        "dpc": "03032631101",
        "name": "តាន់ ប៊ុនពៅ"
    },
    {
        "barcode": "171111164",
        "dpc": "03032645501",
        "name": "ប៊ុន ហឿន ១"
    },
    {
        "barcode": "171111165",
        "dpc": "03032634601",
        "name": "ឡាយ ច័ន្ទរិទ្ធ"
    },
    {
        "barcode": "171111166",
        "dpc": "03032623301",
        "name": "ស៊ុំ នារ៉ា"
    },
    {
        "barcode": "171111167",
        "dpc": "03032638701",
        "name": "ឈឿន ហ័ន"
    },
    {
        "barcode": "171111168",
        "dpc": "03032639501",
        "name": "ធុច វ៉ា"
    },
    {
        "barcode": "171111169",
        "dpc": "03032627801",
        "name": "ធុច វណ្ណារ៉ាត់"
    },
    {
        "barcode": "171111170",
        "dpc": "03032625601",
        "name": "ពា លីហួរ"
    },
    {
        "barcode": "171111171",
        "dpc": "03032610601",
        "name": "ឈាង គុយ ហ៊ី"
    },
    {
        "barcode": "171111172",
        "dpc": "03032610401",
        "name": "សេម សេង"
    },
    {
        "barcode": "171111173",
        "dpc": "03032637201",
        "name": "សុធី គីរី"
    },
    {
        "barcode": "171111174",
        "dpc": "03032638901",
        "name": "ហួត ថាវី"
    },
    {
        "barcode": "171111175",
        "dpc": "03032643601",
        "name": "ជា បុប្ផា"
    },
    {
        "barcode": "171111176",
        "dpc": "03032631501",
        "name": "ហ៊ុន ម៉ាលីស"
    },
    {
        "barcode": "171111177",
        "dpc": "03032632801",
        "name": "អ៊ឹង ឡៃគីម"
    },
    {
        "barcode": "171111178",
        "dpc": "03032632701",
        "name": "អាង យ៉េង"
    },
    {
        "barcode": "171111179",
        "dpc": "03032632601",
        "name": "ចេង លីស៊ុនឃាង"
    },
    {
        "barcode": "171111180",
        "dpc": "03032628201",
        "name": "ច័ន្ទ ថន"
    },
    {
        "barcode": "171111181",
        "dpc": "03032643501",
        "name": "ចន្ទ័ ហេង"
    },
    {
        "barcode": "171111182",
        "dpc": "03032632501",
        "name": "ខៀវ ផាត់ជិន្នី"
    },
    {
        "barcode": "171111183",
        "dpc": "03032637101",
        "name": "ភោគ សុភី"
    },
    {
        "barcode": "171111184",
        "dpc": "03032645801",
        "name": "ស៊ិន សេរីរ័ត្ន"
    },
    {
        "barcode": "171111185",
        "dpc": "03032639801",
        "name": "ហង្ស សុធារ័ត្ន"
    },
    {
        "barcode": "171111186",
        "dpc": "03032645901",
        "name": "លឹម សុខខេង ១"
    },
    {
        "barcode": "171111187",
        "dpc": "03032639001",
        "name": "ហៀង ម៉ារី"
    },
    {
        "barcode": "171111188",
        "dpc": "03032641701",
        "name": "ម៉ែង សុធាកន្និដ្ឋា"
    },
    {
        "barcode": "171111189",
        "dpc": "03032641601",
        "name": "ទឹម ប៊ុនធី"
    },
    {
        "barcode": "171111190",
        "dpc": "03032646101",
        "name": "ហាន ស៊ីហ៊ីប"
    },
    {
        "barcode": "171111191",
        "dpc": "03032637301",
        "name": "ប៊ិច សារឿត"
    },
    {
        "barcode": "171111192",
        "dpc": "03032640601",
        "name": "ពៅ ទិញ"
    },
    {
        "barcode": "171111193",
        "dpc": "03032624001",
        "name": "សេង ស្រីពៅ"
    },
    {
        "barcode": "171111194",
        "dpc": "03032616001",
        "name": "សេង ស្រីពៅ ១"
    },
    {
        "barcode": "171111195",
        "dpc": "03032629301",
        "name": "អ៊ឹម ច័ន្ទសុធា"
    },
    {
        "barcode": "171111196",
        "dpc": "03032631201",
        "name": "តាំង ណាំផេង"
    },
    {
        "barcode": "171111197",
        "dpc": "03032629401",
        "name": "ស៊ាវ សុវិជ្ជរី"
    },
    {
        "barcode": "171111198",
        "dpc": "03032639701",
        "name": "ហ៊ឹង ហូលិវុធ"
    },
    {
        "barcode": "171111199",
        "dpc": "03032620101",
        "name": "ម៉ុក សុវណ្ណឌី"
    },
    {
        "barcode": "171111200",
        "dpc": "03032641501",
        "name": "ទិត ច័ន្ទ្រកេសី"
    },
    {
        "barcode": "171111201",
        "dpc": "03032631301",
        "name": "វ៉ើន វណ្ណៈ"
    },
    {
        "barcode": "171111202",
        "dpc": "03032634701",
        "name": "អ៊ី ស៊ុនហួត"
    },
    {
        "barcode": "171111203",
        "dpc": "03032625401",
        "name": "ផ្សាររោងចក្រតំបាញ"
    },
    {
        "barcode": "171111204",
        "dpc": "03032630601",
        "name": "ចាន់ ហួត"
    },
    {
        "barcode": "171111205",
        "dpc": "03032628901",
        "name": "អ៊ឹង សួរ"
    },
    {
        "barcode": "171111206",
        "dpc": "03032609901",
        "name": "ឈរ គង់ទី"
    },
    {
        "barcode": "171111207",
        "dpc": "03032629001",
        "name": "ប៊ុន ចំរើន"
    },
    {
        "barcode": "171111208",
        "dpc": "03032629901",
        "name": "ងី លាងសេង"
    },
    {
        "barcode": "171111209",
        "dpc": "03032603901",
        "name": "តាន់ មីសស្សែល ២៥៦"
    },
    {
        "barcode": "171111210",
        "dpc": "03032613801",
        "name": "តាន់ មីសស្សែល ២៥៤"
    },
    {
        "barcode": "171111211",
        "dpc": "03032613701",
        "name": "តាន់ មីសស្សែល ២៥២"
    },
    {
        "barcode": "171111212",
        "dpc": "03032613601",
        "name": "តាន់ មីសស្សែល ២៥០"
    },
    {
        "barcode": "171111213",
        "dpc": "03032613401",
        "name": "តាន់ មីសស្សែល ២៤៦"
    },
    {
        "barcode": "171111214",
        "dpc": "03032613301",
        "name": "តាន់ មីសស្សែល ២៤៤"
    },
    {
        "barcode": "171111215",
        "dpc": "03032613201",
        "name": "តាន់ មីសស្សែល ២៤២"
    },
    {
        "barcode": "171111216",
        "dpc": "03032613001",
        "name": "តាន់ មីសស្សែល ២៣៨"
    },
    {
        "barcode": "171111217",
        "dpc": "03032612901",
        "name": "តាន់ មីសស្សែល ២៣៦"
    },
    {
        "barcode": "171111218",
        "dpc": "03032612801",
        "name": "តាន់ មីសស្សែល ២៣៤"
    },
    {
        "barcode": "171111219",
        "dpc": "03032612701",
        "name": "តាន់ មីសស្សែល ២៣២"
    },
    {
        "barcode": "171111220",
        "dpc": "03032612601",
        "name": "តាន់ មីសស្សែល ២៣០"
    },
    {
        "barcode": "171111221",
        "dpc": "03032612401",
        "name": "តាន់ មីសស្សែល ២២៦"
    },
    {
        "barcode": "171111222",
        "dpc": "03032610801",
        "name": "តាន់ មីសស្សែល ២២៥"
    },
    {
        "barcode": "171111223",
        "dpc": "03032611001",
        "name": "តាន់ មីសស្សែល ២២៩"
    },
    {
        "barcode": "171111224",
        "dpc": "03032611101",
        "name": "តាន់ មីសស្សែល ២៣១"
    },
    {
        "barcode": "171111225",
        "dpc": "03032611201",
        "name": "តាន់ មីសស្សែល ២៣៣"
    },
    {
        "barcode": "171111226",
        "dpc": "03032611301",
        "name": "តាន់ មីសស្សែល ២៣៥"
    },
    {
        "barcode": "171111227",
        "dpc": "03032611401",
        "name": "តាន់ មីសស្សែល ២៣៧"
    },
    {
        "barcode": "171111228",
        "dpc": "03032611501",
        "name": "តាន់ មីសស្សែល ២៣៩"
    },
    {
        "barcode": "171111229",
        "dpc": "03032611601",
        "name": "តាន់ មីសស្សែល ២៤១"
    },
    {
        "barcode": "171111230",
        "dpc": "03032611901",
        "name": "តាន់ មីសស្សែល ២៤៧"
    },
    {
        "barcode": "171111231",
        "dpc": "03032612101",
        "name": "តាន់ មីសស្សែល ២៥១"
    },
    {
        "barcode": "171111232",
        "dpc": "03032612201",
        "name": "តាន់ មីសស្សែល ២៥៣"
    },
    {
        "barcode": "171111233",
        "dpc": "03032612301",
        "name": "តាន់ មីសស្សែល ២៥៥"
    },
    {
        "barcode": "171111234",
        "dpc": "03032605001",
        "name": "សឿន ចន្ថា"
    },
    {
        "barcode": "171111235",
        "dpc": "03032622201",
        "name": "រ៉ូ រ៉យ៉ា"
    },
    {
        "barcode": "171111236",
        "dpc": "03032605101",
        "name": "ជា បូព្រី"
    },
    {
        "barcode": "171111237",
        "dpc": "03032600501",
        "name": "ស៊ុន សុផា"
    },
    {
        "barcode": "171111238",
        "dpc": "03032621601",
        "name": "ផែ ណាំជៀវ"
    },
    {
        "barcode": "171111239",
        "dpc": "03032602801",
        "name": "ពិន ទី"
    },
    {
        "barcode": "171111240",
        "dpc": "03032603301",
        "name": "ម៉ី ផល្លា"
    },
    {
        "barcode": "171111241",
        "dpc": "03032622301",
        "name": "គឹម ឡាង"
    },
    {
        "barcode": "171111242",
        "dpc": "03032600301",
        "name": "ថាំង ចន្ថា"
    },
    {
        "barcode": "171111243",
        "dpc": "03032617001",
        "name": "ង៉ែត រ៉ែម"
    },
    {
        "barcode": "171111244",
        "dpc": "03032618601",
        "name": "ស្រី ម៉ានិត"
    },
    {
        "barcode": "171111245",
        "dpc": "03032638301",
        "name": "វិទ្យាល័យព្រះមុន្នីវង្ស"
    },
    {
        "barcode": "171111246",
        "dpc": "03032604701",
        "name": "សាបូអូហ្សាណូ"
    },
    {
        "barcode": "171111247",
        "dpc": "03032604101",
        "name": "គឹម ធីតា"
    },
    {
        "barcode": "171111248",
        "dpc": "03032604201",
        "name": "សុខ រីន"
    },
    {
        "barcode": "171111249",
        "dpc": "03032604601",
        "name": "កឹម សាផាន្នភិរម្យ"
    },
    {
        "barcode": "171111250",
        "dpc": "03032608801",
        "name": "ចាប ក្លូត"
    },
    {
        "barcode": "171111251",
        "dpc": "03032608901",
        "name": "ប៉ិល សុវណ្ណា"
    },
    {
        "barcode": "171111252",
        "dpc": "03032604401",
        "name": "ភោគ សុភី"
    },
    {
        "barcode": "171111253",
        "dpc": "03032604501",
        "name": "ហេង រតនា"
    },
    {
        "barcode": "171111254",
        "dpc": "03032638201",
        "name": "វិទ្យាល័យ សោហឺ"
    },
    {
        "barcode": "171111255",
        "dpc": "03032605501",
        "name": "ចេង រស្មី"
    },
    {
        "barcode": "171111256",
        "dpc": "03032608501",
        "name": "ចាន់ ឃឿង"
    },
    {
        "barcode": "171111257",
        "dpc": "03032624101",
        "name": "ឌុល ម៉ូលី"
    },
    {
        "barcode": "171111258",
        "dpc": "03032617101",
        "name": "ឈួម ប៉ាន"
    },
    {
        "barcode": "171111259",
        "dpc": "03032601701",
        "name": "គួច វែង"
    },
    {
        "barcode": "171111260",
        "dpc": "03032601401",
        "name": "ឈីវ គី"
    },
    {
        "barcode": "171111261",
        "dpc": "03032638001",
        "name": "ឌួង វណ្ណា ១"
    },
    {
        "barcode": "171111262",
        "dpc": "03032634801",
        "name": "ចាន់ ប៊ុនធឿន"
    },
    {
        "barcode": "171111263",
        "dpc": "03032624401",
        "name": "ឆាយ គឹមជា"
    },
    {
        "barcode": "171111264",
        "dpc": "03032614301",
        "name": "គង់ សុផល"
    },
    {
        "barcode": "171111265",
        "dpc": "03032603601",
        "name": "អៀ ម៉េងលុច"
    },
    {
        "barcode": "171111266",
        "dpc": "03032635201",
        "name": "ហ៊ាង សុខគីម"
    },
    {
        "barcode": "171111267",
        "dpc": "03032626801",
        "name": "សាន ហូ"
    },
    {
        "barcode": "171111268",
        "dpc": "03032606001",
        "name": "ធនាគារវឌ្ឍនៈ"
    },
    {
        "barcode": "171111269",
        "dpc": "03032617501",
        "name": "ជុំ សុខែម"
    },
    {
        "barcode": "171111270",
        "dpc": "03032626901",
        "name": "វៀច សេង"
    },
    {
        "barcode": "171111271",
        "dpc": "03032641101",
        "name": "ម៉ុក សារុំ"
    },
    {
        "barcode": "171111272",
        "dpc": "03032614401",
        "name": "ឃួន ប៊ុនធី"
    },
    {
        "barcode": "171111273",
        "dpc": "03032604301",
        "name": "ជា ពៅ"
    },
    {
        "barcode": "171111274",
        "dpc": "03032634201",
        "name": "ថោង សាវឿន"
    },
    {
        "barcode": "171111275",
        "dpc": "03032615101",
        "name": "ធួន ពន្លឺ"
    },
    {
        "barcode": "171111276",
        "dpc": "03032615001",
        "name": "ញ៉ក់ ចំរ៉ុង"
    },
    {
        "barcode": "171111277",
        "dpc": "03032601801",
        "name": "សួន គឹមអេង"
    },
    {
        "barcode": "171111278",
        "dpc": "03032603701",
        "name": "គឹម ហន"
    },
    {
        "barcode": "171111279",
        "dpc": "03032619901",
        "name": "នក់ ម៉ង់"
    },
    {
        "barcode": "171111280",
        "dpc": "03032635101",
        "name": "តាំង ចាន់ធី"
    },
    {
        "barcode": "171111281",
        "dpc": "03032601201",
        "name": "លឹម ស៊ីវហ្គិច"
    },
    {
        "barcode": "171111282",
        "dpc": "03032601301",
        "name": "ឈួន សុភាព"
    },
    {
        "barcode": "171111283",
        "dpc": "03032635001",
        "name": "ម៉ៅ ហ៊ួរ"
    },
    {
        "barcode": "171111284",
        "dpc": "03032625101",
        "name": "ធុច រ៉ា"
    },
    {
        "barcode": "171111285",
        "dpc": "03032629101",
        "name": "ណៃ ហុង"
    },
    {
        "barcode": "171111286",
        "dpc": "03032625301",
        "name": "ឈឿត ដានី"
    },
    {
        "barcode": "171111287",
        "dpc": "03032625001",
        "name": "រោ សេងវី"
    },
    {
        "barcode": "171111288",
        "dpc": "03032622901",
        "name": "ហ៊ុយ សុធារិទ្ធ"
    },
    {
        "barcode": "171111289",
        "dpc": "03032630701",
        "name": "ប៉ុក សុជាតិ"
    },
    {
        "barcode": "171111290",
        "dpc": "03032603401",
        "name": "ជា សុខ"
    },
    {
        "barcode": "171111291",
        "dpc": "03032638101",
        "name": "សាលា ២ធ្នូ"
    },
    {
        "barcode": "171111292",
        "dpc": "03032608701",
        "name": "យូ រ៉ាណេ"
    },
    {
        "barcode": "171111293",
        "dpc": "03032601501",
        "name": "ច្រឹក ណារ៉េត"
    },
    {
        "barcode": "171111294",
        "dpc": "03032600701",
        "name": "ឧប កែវផល្លី"
    },
    {
        "barcode": "171111295",
        "dpc": "03032640401",
        "name": "ឈុន ប៊ូ"
    },
    {
        "barcode": "171111296",
        "dpc": "03032602301",
        "name": "លីវ ប៊ុនឆេង"
    },
    {
        "barcode": "171111297",
        "dpc": "03032603501",
        "name": "ចាន់ ឃាង"
    },
    {
        "barcode": "171111298",
        "dpc": "03032604801",
        "name": "សែម នី"
    },
    {
        "barcode": "171111299",
        "dpc": "03032606101",
        "name": "ប៊ុន សារ៉ាវុធ"
    },
    {
        "barcode": "171111300",
        "dpc": "03032608101",
        "name": "ឈួរ មួយគាង"
    },
    {
        "barcode": "171111301",
        "dpc": "03032616201",
        "name": "ស៊ឹម វណ្ណៈ"
    },
    {
        "barcode": "171111302",
        "dpc": "03032618001",
        "name": "ជេត សម្បត្តិ"
    },
    {
        "barcode": "171111303",
        "dpc": "03032624301",
        "name": "ជា សង្វាម៉ាលតី"
    },
    {
        "barcode": "171111304",
        "dpc": "03032624901",
        "name": "មៀច សុមន៍"
    },
    {
        "barcode": "171111305",
        "dpc": "03032626701",
        "name": "គូ គឹមស៊ា"
    },
    {
        "barcode": "171111306",
        "dpc": "03032627001",
        "name": "យ៉េត ហ៊ុន"
    },
    {
        "barcode": "171111307",
        "dpc": "03032627101",
        "name": "លី ចំរើន"
    },
    {
        "barcode": "171111308",
        "dpc": "03032631601",
        "name": "ពេជ្រ ផារី"
    },
    {
        "barcode": "171111309",
        "dpc": "03032631701",
        "name": "គុយ ផេង"
    },
    {
        "barcode": "171111310",
        "dpc": "03032634301",
        "name": "តាន់ មីសស្សែល ៣១"
    },
    {
        "barcode": "171111311",
        "dpc": "03032634901",
        "name": "ប៉ិល វណ្ណា"
    },
    {
        "barcode": "171111312",
        "dpc": "03032635401",
        "name": "សេង ប៉ោឡាយ"
    },
    {
        "barcode": "171111313",
        "dpc": "03032637901",
        "name": "ចាន់ ថន"
    },
    {
        "barcode": "171111314",
        "dpc": "03032640501",
        "name": "ឃួន ប៊ុនធី"
    },
    {
        "barcode": "171111315",
        "dpc": "03032640701",
        "name": "សាខាកាំកុងត្រូល"
    },
    {
        "barcode": "171111316",
        "dpc": "03032640901",
        "name": "ស៊ុំ យិធា"
    },
    {
        "barcode": "171111317",
        "dpc": "03032641001",
        "name": "ជូ គង់"
    },
    {
        "barcode": "171111318",
        "dpc": "03032642201",
        "name": "តាន់ មីសស្សែល ២១៨"
    },
    {
        "barcode": "171111319",
        "dpc": "03032642401",
        "name": "តាន់ មីសស្សែល ២១៤"
    },
    {
        "barcode": "171111320",
        "dpc": "03032642801",
        "name": "តាន់ មីសស្សែល ២០៦"
    },
    {
        "barcode": "171111321",
        "dpc": "03032643301",
        "name": "តាន់ មីសស្សែល ២១៣"
    },
    {
        "barcode": "171111322",
        "dpc": "03032644201",
        "name": "ចាន់ សុធានី"
    },
    {
        "barcode": "171111323",
        "dpc": "03032644301",
        "name": "លី គឹមឡាយ"
    },
    {
        "barcode": "171111324",
        "dpc": "03032644401",
        "name": "អ៊ាង ផល្លា"
    },
    {
        "barcode": "171111325",
        "dpc": "03032644601",
        "name": "ទី ទីត"
    },
    {
        "barcode": "171111326",
        "dpc": "03032644701",
        "name": "ហេង គឹមលី"
    },
    {
        "barcode": "171111327",
        "dpc": "03032644801",
        "name": "វ៉ាន់ នី"
    },
    {
        "barcode": "171111328",
        "dpc": "03032644901",
        "name": "អ៊ុន ណារ៉ុង"
    },
    {
        "barcode": "171111329",
        "dpc": "03032645001",
        "name": "អ៊ុំ ណារ៉ុង"
    },
    {
        "barcode": "171111330",
        "dpc": "03032645101",
        "name": "ជាង ហេង"
    },
    {
        "barcode": "171111331",
        "dpc": "03032645201",
        "name": "លឹម សេងហួរ"
    },
    {
        "barcode": "171111332",
        "dpc": "03032648001",
        "name": "ម៉ីចន្ទ័ មុន្នី"
    },
    {
        "barcode": "171111333",
        "dpc": "03032621001",
        "name": "ជា ពេង"
    },
    {
        "barcode": "171111334",
        "dpc": "03032629801",
        "name": "ហុក កុសល២"
    }
]
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});