let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=
    [
        {
            "barcode": "171113135",
            "dpc": "03022706801",
            "name": "អំ ឆាំ"
        },
        {
            "barcode": "171113136",
            "dpc": "03022733301",
            "name": "សេង សុដានី"
        },
        {
            "barcode": "171113137",
            "dpc": "03022708601",
            "name": "សៀ ចំរើន"
        },
        {
            "barcode": "171113138",
            "dpc": "03022708501",
            "name": "ខៀវ សាមឿន"
        },
        {
            "barcode": "171113139",
            "dpc": "03022708401",
            "name": "វ៉ាន ណាស៊ារ"
        },
        {
            "barcode": "171113140",
            "dpc": "03022738401",
            "name": "ណម ផល្លា"
        },
        {
            "barcode": "171113141",
            "dpc": "03022703301",
            "name": "សួន សុខុន"
        },
        {
            "barcode": "171113142",
            "dpc": "03022728001",
            "name": "សួស សាលីន"
        },
        {
            "barcode": "171113143",
            "dpc": "03022728101",
            "name": "រ៉ សាក់"
        },
        {
            "barcode": "171113144",
            "dpc": "03022728301",
            "name": "ឡោះ សាវី"
        },
        {
            "barcode": "171113145",
            "dpc": "03022728701",
            "name": "ស៊ិន អ៊ិករ៉េៈ"
        },
        {
            "barcode": "171113146",
            "dpc": "03022732701",
            "name": "លី សាលីម"
        },
        {
            "barcode": "171113147",
            "dpc": "03022732801",
            "name": "មួន រីហ្វីន"
        },
        {
            "barcode": "171113148",
            "dpc": "03022732901",
            "name": "ឡេះ ឯល"
        },
        {
            "barcode": "171113149",
            "dpc": "03022733001",
            "name": "ជួន ចំណាប់"
        },
        {
            "barcode": "171113150",
            "dpc": "03022738101",
            "name": "ម៉ាស្ទីនឌីយ៉ាសុទី្ទន"
        },
        {
            "barcode": "171113151",
            "dpc": "03022743001",
            "name": "ជួប សាវង្ស"
        },
        {
            "barcode": "171113152",
            "dpc": "03022703401",
            "name": "ម៉ាន កៅហ្វិច"
        },
        {
            "barcode": "171113153",
            "dpc": "03022703501",
            "name": "ម៉េត អាស៊ីយ៉ាស់"
        },
        {
            "barcode": "171113154",
            "dpc": "03022706901",
            "name": "ស៊ុប សារី"
        },
        {
            "barcode": "171113155",
            "dpc": "03022718601",
            "name": "សួន ចាន់រ័ត្ន"
        },
        {
            "barcode": "171113156",
            "dpc": "03022719301",
            "name": "សាន់ ដន"
        },
        {
            "barcode": "171113157",
            "dpc": "03022719501",
            "name": "ប៉ាង សិលា"
        },
        {
            "barcode": "171113158",
            "dpc": "03022724501",
            "name": "សិត វណ្ណា"
        },
        {
            "barcode": "171113159",
            "dpc": "03022727901",
            "name": "ម៉ាត់ កាស់"
        },
        {
            "barcode": "171113160",
            "dpc": "03022733501",
            "name": "ចក់ ស្រស់"
        },
        {
            "barcode": "171113161",
            "dpc": "03022742801",
            "name": "ម៉ាត់ ហាទីរីន"
        },
        {
            "barcode": "171113162",
            "dpc": "03022706701",
            "name": "ហង្ស ញ៉ុក"
        },
        {
            "barcode": "171113163",
            "dpc": "03022742701",
            "name": "សឹម សូរ"
        },
        {
            "barcode": "171113164",
            "dpc": "03022742601",
            "name": "ជួនណារ៉េត"
        },
        {
            "barcode": "171113165",
            "dpc": "03022707001",
            "name": "នូ សារិទ្ធ"
        },
        {
            "barcode": "171113166",
            "dpc": "03022704501",
            "name": "វ៉ា ធឿន"
        },
        {
            "barcode": "171113167",
            "dpc": "03022703901",
            "name": "ហុង ពិសី"
        },
        {
            "barcode": "171113168",
            "dpc": "03022717101",
            "name": "សុខ នាង"
        },
        {
            "barcode": "171113169",
            "dpc": "03022705001",
            "name": "ហេង សុធា"
        },
        {
            "barcode": "171113170",
            "dpc": "03022721201",
            "name": "គឹម ណន"
        },
        {
            "barcode": "171113171",
            "dpc": "03022704801",
            "name": "ខែម សារ៉ាត់"
        },
        {
            "barcode": "171113172",
            "dpc": "03022707101",
            "name": "ទុយ ស៊ីន"
        },
        {
            "barcode": "171113173",
            "dpc": "03022702101",
            "name": "មាស មាលតី"
        },
        {
            "barcode": "171113174",
            "dpc": "03022727301",
            "name": "ប៉េង សាវី"
        },
        {
            "barcode": "171113175",
            "dpc": "03022727501",
            "name": "ដែន ណារ៉ុម"
        },
        {
            "barcode": "171113176",
            "dpc": "03022732601",
            "name": "ឃុត ចាន់ថន"
        },
        {
            "barcode": "171113177",
            "dpc": "03022736401",
            "name": "ក្រង់ ចាន់លី"
        },
        {
            "barcode": "171113178",
            "dpc": "03022705101",
            "name": "គឹម ឡូន"
        },
        {
            "barcode": "171113179",
            "dpc": "03022736501",
            "name": "ម៉ី សាវ៉ុង"
        },
        {
            "barcode": "171113180",
            "dpc": "03022743901",
            "name": "ស៊ុយ សំណាង"
        },
        {
            "barcode": "171113181",
            "dpc": "03022732301",
            "name": "ឈឹង រតនៈ"
        },
        {
            "barcode": "171113182",
            "dpc": "03022712901",
            "name": "ទូច រិទ្ធី"
        },
        {
            "barcode": "171113183",
            "dpc": "03022713001",
            "name": "ហ៊ាង សុចាន់"
        },
        {
            "barcode": "171113184",
            "dpc": "03022725901",
            "name": "ខៀវ ពន្លឺ"
        },
        {
            "barcode": "171113185",
            "dpc": "03022726001",
            "name": "ដំ រ៉ាឌី"
        },
        {
            "barcode": "171113186",
            "dpc": "03022711701",
            "name": "សឿម សឿង"
        },
        {
            "barcode": "171113187",
            "dpc": "03022705601",
            "name": "សួន សុវណ្ណ"
        },
        {
            "barcode": "171113188",
            "dpc": "03022720001",
            "name": "កូយ កុសល់"
        },
        {
            "barcode": "171113189",
            "dpc": "03022731301",
            "name": "ប៊ុន សុផល"
        },
        {
            "barcode": "171113190",
            "dpc": "03022717401",
            "name": "ថន វិណេត"
        },
        {
            "barcode": "171113191",
            "dpc": "03022700401",
            "name": "សៀ ឈាងហេង"
        },
        {
            "barcode": "171113192",
            "dpc": "03022736801",
            "name": "លី អូន"
        },
        {
            "barcode": "171113193",
            "dpc": "03022700301",
            "name": "យ៉ែម មឿន"
        },
        {
            "barcode": "171113194",
            "dpc": "03022704401",
            "name": "ឡាំង ង៉ាយ"
        },
        {
            "barcode": "171113195",
            "dpc": "03022713101",
            "name": "ឡៅ ប៊ួយ"
        },
        {
            "barcode": "171113196",
            "dpc": "03022725201",
            "name": "ញ៉ែម សុជាតិ"
        },
        {
            "barcode": "171113197",
            "dpc": "03022702701",
            "name": "ជុក ឯក"
        },
        {
            "barcode": "171113198",
            "dpc": "03022730301",
            "name": "អ៊ឹម អ៊ាម"
        },
        {
            "barcode": "171113199",
            "dpc": "03022716301",
            "name": "តាំង ស៊ីវហេង"
        },
        {
            "barcode": "171113200",
            "dpc": "03022730501",
            "name": "ឡុង ហូ"
        },
        {
            "barcode": "171113201",
            "dpc": "03022705901",
            "name": "ទ្រិញ អាន"
        },
        {
            "barcode": "171113202",
            "dpc": "03022730401",
            "name": "ចាន់ ប៊ុនធឿន"
        },
        {
            "barcode": "171113203",
            "dpc": "03022725501",
            "name": "ឡាយ សាំងថង២"
        },
        {
            "barcode": "171113204",
            "dpc": "03022736601",
            "name": "ជួប ចំរើន"
        },
        {
            "barcode": "171113205",
            "dpc": "03022709901",
            "name": "ឡេង ខេង"
        },
        {
            "barcode": "171113206",
            "dpc": "03022714501",
            "name": "ហេង ស៊ីឌឿន"
        },
        {
            "barcode": "171113207",
            "dpc": "03022714401",
            "name": "ហ៊ួ ម៉ុងហួត"
        },
        {
            "barcode": "171113208",
            "dpc": "03022714301",
            "name": "អួម ម៉ៅ"
        },
        {
            "barcode": "171113209",
            "dpc": "03022737801",
            "name": "សួន បុផ្ផា"
        },
        {
            "barcode": "171113210",
            "dpc": "03022709801",
            "name": "ម៉ី យ៉ានឈឿន"
        },
        {
            "barcode": "171113211",
            "dpc": "03022729101",
            "name": "ឡាយ រិទ្ធវង្ស២"
        },
        {
            "barcode": "171113212",
            "dpc": "03022722101",
            "name": "ពៅ ចាន់ថា"
        },
        {
            "barcode": "171113213",
            "dpc": "03022722201",
            "name": "ពៅ អេង"
        },
        {
            "barcode": "171113214",
            "dpc": "03022722301",
            "name": "សៅ វ៉ាន់ឌី"
        },
        {
            "barcode": "171113215",
            "dpc": "03022722401",
            "name": "កែវ សុវណ្ណដេត"
        },
        {
            "barcode": "171113216",
            "dpc": "03022704601",
            "name": "មុំ ឆវី"
        },
        {
            "barcode": "171113217",
            "dpc": "03022704701",
            "name": "ហុង លី"
        },
        {
            "barcode": "171113218",
            "dpc": "03022701901",
            "name": "សុខ សឿត"
        },
        {
            "barcode": "171113219",
            "dpc": "03022701801",
            "name": "ម៉ាត សាត"
        },
        {
            "barcode": "171113220",
            "dpc": "03022737901",
            "name": "ស្ហើង ណាន"
        },
        {
            "barcode": "171113221",
            "dpc": "03022737701",
            "name": "ឌី សំបូរ"
        },
        {
            "barcode": "171113222",
            "dpc": "03022729001",
            "name": "យុន រ៉ាអ៊ូល"
        },
        {
            "barcode": "171113223",
            "dpc": "03022736901",
            "name": "គឹម ឈឿន"
        },
        {
            "barcode": "171113224",
            "dpc": "03022742501",
            "name": "សែម ចន្ថា"
        },
        {
            "barcode": "171113225",
            "dpc": "03022737101",
            "name": "សៀវ សារិទ្ធ"
        },
        {
            "barcode": "171113226",
            "dpc": "03022737401",
            "name": "ញឹម សាវី"
        },
        {
            "barcode": "171113227",
            "dpc": "03022737601",
            "name": "លាង គឹមហាន"
        },
        {
            "barcode": "171113228",
            "dpc": "03022742301",
            "name": "ង៉ែត សារ៉េត"
        },
        {
            "barcode": "171113229",
            "dpc": "03022742201",
            "name": "មាស សុជាតិ"
        },
        {
            "barcode": "171113230",
            "dpc": "03022738501",
            "name": "ម៉ែន សម្បត្តិ"
        },
        {
            "barcode": "171113231",
            "dpc": "03022742401",
            "name": "យក់ រិទ្ធិយ៉ា"
        },
        {
            "barcode": "171113232",
            "dpc": "03022713201",
            "name": "ចាន់ វណ្ណា"
        },
        {
            "barcode": "171113233",
            "dpc": "03022702201",
            "name": "គីង សារឿន"
        },
        {
            "barcode": "171113234",
            "dpc": "03022727801",
            "name": "ហេង វែងឈៀង"
        },
        {
            "barcode": "171113235",
            "dpc": "03022713901",
            "name": "សួស លាង"
        },
        {
            "barcode": "171113236",
            "dpc": "03022718501",
            "name": "កូវ ជិញសៀង"
        },
        {
            "barcode": "171113237",
            "dpc": "03022732001",
            "name": "កង ស៊ិន"
        },
        {
            "barcode": "171113238",
            "dpc": "03022721901",
            "name": "រ៉េត ប៊ុនធឿន"
        },
        {
            "barcode": "171113239",
            "dpc": "03022732101",
            "name": "វី វឹង"
        },
        {
            "barcode": "171113240",
            "dpc": "03022713501",
            "name": "ឡឹម ឈាន"
        },
        {
            "barcode": "171113241",
            "dpc": "03022701301",
            "name": "ចាន់ សាមឿន"
        },
        {
            "barcode": "171113242",
            "dpc": "03022716801",
            "name": "មាស សារឿន"
        },
        {
            "barcode": "171113243",
            "dpc": "03022714801",
            "name": "អៀង ហាក់"
        },
        {
            "barcode": "171113244",
            "dpc": "03022724101",
            "name": "យ៉ិន ចាន់ម៉ូនីកា"
        },
        {
            "barcode": "171113245",
            "dpc": "03022724201",
            "name": "ម៉ៅ សុជាតិ"
        },
        {
            "barcode": "171113246",
            "dpc": "03022714601",
            "name": "ប៉ាត់ ភុន"
        },
        {
            "barcode": "171113247",
            "dpc": "03022717001",
            "name": "ហ៊ុន វិបុល"
        },
        {
            "barcode": "171113248",
            "dpc": "03022701201",
            "name": "តាំង ហ្គិច"
        },
        {
            "barcode": "171113249",
            "dpc": "03022703601",
            "name": "ហេង ចាន់"
        },
        {
            "barcode": "171113250",
            "dpc": "03022708101",
            "name": "ចាន់ ធី"
        },
        {
            "barcode": "171113251",
            "dpc": "03022708001",
            "name": "ស ឌីណា"
        },
        {
            "barcode": "171113252",
            "dpc": "03022703801",
            "name": "វ៉ាន់ ឌី"
        },
        {
            "barcode": "171113253",
            "dpc": "03022703701",
            "name": "ស៊ី វ៉ូន"
        },
        {
            "barcode": "171113254",
            "dpc": "03022719701",
            "name": "អ៊ុច ឆាំ"
        },
        {
            "barcode": "171113255",
            "dpc": "03022702901",
            "name": "រ៉េន វឌ្ឍនៈ"
        },
        {
            "barcode": "171113256",
            "dpc": "03022714701",
            "name": "ម៉ុយ ដាវ៉ិត"
        },
        {
            "barcode": "171113257",
            "dpc": "03022738301",
            "name": "សោម អៀ"
        },
        {
            "barcode": "171113258",
            "dpc": "03022713601",
            "name": "ម៉េង ម៉ារី"
        },
        {
            "barcode": "171113259",
            "dpc": "03022715001",
            "name": "គីម ផល្លា"
        },
        {
            "barcode": "171113260",
            "dpc": "03022715101",
            "name": "ប៉ិច ផល្លា"
        },
        {
            "barcode": "171113261",
            "dpc": "03022713701",
            "name": "សំ នៀង"
        },
        {
            "barcode": "171113262",
            "dpc": "03022738201",
            "name": "រស់ សាវ៉ុន"
        },
        {
            "barcode": "171113263",
            "dpc": "03022743201",
            "name": "អ៊ុយ សុង"
        },
        {
            "barcode": "171113264",
            "dpc": "03022720201",
            "name": "វ៉ាន់ ចាន់ធី"
        },
        {
            "barcode": "171113265",
            "dpc": "03022733201",
            "name": "គង់ សុជឿន"
        },
        {
            "barcode": "171113266",
            "dpc": "03022717701",
            "name": "យិន ថាវ"
        },
        {
            "barcode": "171113267",
            "dpc": "03022711001",
            "name": "សុត ធី"
        },
        {
            "barcode": "171113268",
            "dpc": "03022703101",
            "name": "វ៉ែន វួច"
        },
        {
            "barcode": "171113269",
            "dpc": "03022740601",
            "name": "ឡោ ជេដ្ឋា"
        },
        {
            "barcode": "171113270",
            "dpc": "03022704201",
            "name": "ឡោ អង"
        },
        {
            "barcode": "171113271",
            "dpc": "03022709201",
            "name": "ម៉ៅ សូវៀត"
        },
        {
            "barcode": "171113272",
            "dpc": "03022746701",
            "name": "ចាន់ សាវុធ"
        },
        {
            "barcode": "171113273",
            "dpc": "03022746801",
            "name": "ឆន សុវណ្ណគីរី"
        },
        {
            "barcode": "171113274",
            "dpc": "03022746901",
            "name": "អ៊ី សាវៃ"
        },
        {
            "barcode": "171113275",
            "dpc": "03022747001",
            "name": "អុង ពិទូ"
        },
        {
            "barcode": "171113276",
            "dpc": "03022747101",
            "name": "ពេជ្រ សុផៃ"
        },
        {
            "barcode": "171113277",
            "dpc": "03022747201",
            "name": "ឌួង សុខុម"
        },
        {
            "barcode": "171113278",
            "dpc": "03022747301",
            "name": "ញៀវ សឿត"
        },
        {
            "barcode": "171113279",
            "dpc": "03022747401",
            "name": "ម៉ក់ រ៉ាស៊ី"
        },
        {
            "barcode": "171113280",
            "dpc": "03022747501",
            "name": "សៀង រុំចង់"
        },
        {
            "barcode": "171113281",
            "dpc": "03022734501",
            "name": "ចិន ឡាវ"
        },
        {
            "barcode": "171113282",
            "dpc": "03022740701",
            "name": "ពិន សុភា"
        },
        {
            "barcode": "171113283",
            "dpc": "03022747901",
            "name": "សេង ខី"
        },
        {
            "barcode": "171113284",
            "dpc": "03022734601",
            "name": "សាត សឿម"
        },
        {
            "barcode": "171113285",
            "dpc": "03022726501",
            "name": "ងួន តុលា"
        },
        {
            "barcode": "171113286",
            "dpc": "03022711801",
            "name": "ស៊ុំ សឿន"
        },
        {
            "barcode": "171113287",
            "dpc": "03022731601",
            "name": "ពួកជុំនំគ្រីស្ទបរិស័ទខ្មែរ"
        },
        {
            "barcode": "171113288",
            "dpc": "03022723801",
            "name": "ង៉ែត ប៉េង"
        },
        {
            "barcode": "171113289",
            "dpc": "03022723901",
            "name": "ឃុន ស៊ីន"
        },
        {
            "barcode": "171113290",
            "dpc": "03022735301",
            "name": "ស្រី ណឹង"
        },
        {
            "barcode": "171113291",
            "dpc": "03022735201",
            "name": "ឃុន ឃឿត"
        },
        {
            "barcode": "171113292",
            "dpc": "03022727201",
            "name": "យក់ វីណង"
        },
        {
            "barcode": "171113293",
            "dpc": "03022702801",
            "name": "រឿន សំណាង"
        },
        {
            "barcode": "171113294",
            "dpc": "03022722001",
            "name": "គឹម សុង"
        },
        {
            "barcode": "171113295",
            "dpc": "03022735001",
            "name": "ដាំ សុង២"
        },
        {
            "barcode": "171113296",
            "dpc": "03022735101",
            "name": "ហ៊ាង សមាជ"
        },
        {
            "barcode": "171113297",
            "dpc": "03022711201",
            "name": "ដាំ លេខា"
        },
        {
            "barcode": "171113298",
            "dpc": "03022724301",
            "name": "សួស សុខន"
        },
        {
            "barcode": "171113299",
            "dpc": "03022711401",
            "name": "អៀ គឹមហៀង"
        },
        {
            "barcode": "171113300",
            "dpc": "03022713801",
            "name": "ចៅ ធៀង"
        },
        {
            "barcode": "171113301",
            "dpc": "03022707201",
            "name": "ហ៊ុំ ព្រេន"
        },
        {
            "barcode": "171113302",
            "dpc": "03022741201",
            "name": "វ៉ិច សន្ដិភាព"
        },
        {
            "barcode": "171113303",
            "dpc": "03022741301",
            "name": "យិម សុត"
        },
        {
            "barcode": "171113304",
            "dpc": "03022739501",
            "name": "នួន សុភឿន"
        },
        {
            "barcode": "171113305",
            "dpc": "03022700901",
            "name": "អេង សុយីន"
        },
        {
            "barcode": "171113306",
            "dpc": "03022716601",
            "name": "ស៊ីនម៉ុម"
        },
        {
            "barcode": "171113307",
            "dpc": "03022711101",
            "name": "ណាក សាវ៉ាត"
        },
        {
            "barcode": "171113308",
            "dpc": "03022705201",
            "name": "ស នាង"
        },
        {
            "barcode": "171113309",
            "dpc": "03022731801",
            "name": "សន គីរី"
        },
        {
            "barcode": "171113310",
            "dpc": "03022725601",
            "name": "ឡេង សំអុល"
        },
        {
            "barcode": "171113311",
            "dpc": "03022724401",
            "name": "ខឹម ហឿង"
        },
        {
            "barcode": "171113312",
            "dpc": "03022700801",
            "name": "សឿន សុបាល"
        },
        {
            "barcode": "171113313",
            "dpc": "03022740001",
            "name": "សូ សាវុធ"
        },
        {
            "barcode": "171113314",
            "dpc": "03022700601",
            "name": "ប៊ុន សាខន"
        },
        {
            "barcode": "171113315",
            "dpc": "03022700701",
            "name": "ឈួន ហ៊ាប"
        },
        {
            "barcode": "171113316",
            "dpc": "03022740101",
            "name": "ម៉ី ហ៊ុំ"
        },
        {
            "barcode": "171113317",
            "dpc": "03022740401",
            "name": "ព្រឿម ស៊ីណាត"
        },
        {
            "barcode": "171113318",
            "dpc": "03022740501",
            "name": "ជា ង៉ិ"
        },
        {
            "barcode": "171113319",
            "dpc": "03022705701",
            "name": "ស៊ាង ដុំ"
        },
        {
            "barcode": "171113320",
            "dpc": "03022707301",
            "name": "ហេង រំភើយ"
        },
        {
            "barcode": "171113321",
            "dpc": "03022716501",
            "name": "ហុក គា"
        },
        {
            "barcode": "171113322",
            "dpc": "03022709501",
            "name": "ផាត់ សុងសៀង"
        },
        {
            "barcode": "171113323",
            "dpc": "03022720301",
            "name": "រស់ ចាន់កុសល"
        },
        {
            "barcode": "171113324",
            "dpc": "03022716001",
            "name": "វៀង រ៉ាវី"
        },
        {
            "barcode": "171113325",
            "dpc": "03022715901",
            "name": "វណ សង្ហា"
        },
        {
            "barcode": "171113326",
            "dpc": "03022701101",
            "name": "អ៊ុក ហារ៉ាឌី"
        },
        {
            "barcode": "171113327",
            "dpc": "03022716401",
            "name": "ជា សុផល"
        },
        {
            "barcode": "171113328",
            "dpc": "03022732201",
            "name": "ហៀក ស៊ីនឿន"
        },
        {
            "barcode": "171113329",
            "dpc": "03022705401",
            "name": "យៀម កុងស៊ុន"
        },
        {
            "barcode": "171113330",
            "dpc": "03022711301",
            "name": "ហុង ដាវុធ"
        },
        {
            "barcode": "171113331",
            "dpc": "03022741501",
            "name": "យ៉ឹម យ៉ុង"
        },
        {
            "barcode": "171113332",
            "dpc": "03022741401",
            "name": "ជឿម ច្រិប"
        },
        {
            "barcode": "171113333",
            "dpc": "03022701001",
            "name": "អុំ ស៊ីនួន"
        },
        {
            "barcode": "171113334",
            "dpc": "03022724001",
            "name": "សយ វុទ្ធា"
        },
        {
            "barcode": "171113335",
            "dpc": "03022720701",
            "name": "នួន គឹមសួរ"
        },
        {
            "barcode": "171113336",
            "dpc": "03022709301",
            "name": "នាង សុភក្ត្រ"
        },
        {
            "barcode": "171113337",
            "dpc": "03022741101",
            "name": "សៅ ទិត្យ"
        },
        {
            "barcode": "171113338",
            "dpc": "03022735601",
            "name": "លី ម៉ាល័យ"
        },
        {
            "barcode": "171113339",
            "dpc": "03022735501",
            "name": "យួម សុវណ្ណ"
        },
        {
            "barcode": "171113340",
            "dpc": "03022741001",
            "name": "គ្រី សុណន់"
        },
        {
            "barcode": "171113341",
            "dpc": "03022705501",
            "name": "គឹម វណ្ណា"
        },
        {
            "barcode": "171113342",
            "dpc": "03022723401",
            "name": "សុខ សាមន្នី១"
        },
        {
            "barcode": "171113343",
            "dpc": "03022723501",
            "name": "សុខ សាមន្នី២"
        },
        {
            "barcode": "171113344",
            "dpc": "03022723601",
            "name": "សុខ សាមន្នី៣"
        },
        {
            "barcode": "171113345",
            "dpc": "03022723701",
            "name": "សុខ សាមន្នី៤"
        },
        {
            "barcode": "171113346",
            "dpc": "03022700501",
            "name": "ឈុន អេង"
        },
        {
            "barcode": "171113347",
            "dpc": "03022702001",
            "name": "សោម សុចិត្ត"
        },
        {
            "barcode": "171113348",
            "dpc": "03022703201",
            "name": "គង់ សុន"
        },
        {
            "barcode": "171113349",
            "dpc": "03022704901",
            "name": "អ៊ួន គឹមណង"
        },
        {
            "barcode": "171113350",
            "dpc": "03022705801",
            "name": "ថន ចាន់ធឿន"
        },
        {
            "barcode": "171113351",
            "dpc": "03022706101",
            "name": "ម៉េត លី"
        },
        {
            "barcode": "171113352",
            "dpc": "03022706201",
            "name": "សេង ហុង"
        },
        {
            "barcode": "171113353",
            "dpc": "03022706301",
            "name": "សេង ហៃ"
        },
        {
            "barcode": "171113354",
            "dpc": "03022706401",
            "name": "ជុច សាកន"
        },
        {
            "barcode": "171113355",
            "dpc": "03022706501",
            "name": "ជួន ហ៊ួរ"
        },
        {
            "barcode": "171113356",
            "dpc": "03022706601",
            "name": "សុខ លុច"
        },
        {
            "barcode": "171113357",
            "dpc": "03022707401",
            "name": "ឯល ដារ៉េះ"
        },
        {
            "barcode": "171113358",
            "dpc": "03022707501",
            "name": "លី ស្មាន"
        },
        {
            "barcode": "171113359",
            "dpc": "03022707801",
            "name": "ប៉ិន ចន្ធូ"
        },
        {
            "barcode": "171113360",
            "dpc": "03022709601",
            "name": "សេន ណារី"
        },
        {
            "barcode": "171113361",
            "dpc": "03022709701",
            "name": "លី យ៉ាមី"
        },
        {
            "barcode": "171113362",
            "dpc": "03022710001",
            "name": "រ៉េះ យ៉ើ"
        },
        {
            "barcode": "171113363",
            "dpc": "03022710701",
            "name": "គឹម សូលីណែត"
        },
        {
            "barcode": "171113364",
            "dpc": "03022710901",
            "name": "សាឡេៈ រ៉ហ្វី"
        },
        {
            "barcode": "171113365",
            "dpc": "03022711501",
            "name": "អុំ ម៉ាលី"
        },
        {
            "barcode": "171113366",
            "dpc": "03022711601",
            "name": "សឿន ពិសិទ្ធ"
        },
        {
            "barcode": "171113367",
            "dpc": "03022712001",
            "name": "មាន សារ៉ាត់"
        },
        {
            "barcode": "171113368",
            "dpc": "03022712101",
            "name": "ហម សុភក្រ័"
        },
        {
            "barcode": "171113369",
            "dpc": "03022712601",
            "name": "ហ៊ឹម ពុធសុវណ្ណ"
        },
        {
            "barcode": "171113370",
            "dpc": "03022712701",
            "name": "សាំង លីម"
        },
        {
            "barcode": "171113371",
            "dpc": "03022712801",
            "name": "លាង ឡា"
        },
        {
            "barcode": "171113372",
            "dpc": "03022713401",
            "name": "វ៉ាន់ រក្សា"
        },
        {
            "barcode": "171113373",
            "dpc": "03022714001",
            "name": "លី យ៉េត"
        },
        {
            "barcode": "171113374",
            "dpc": "03022715201",
            "name": "ឡោះ អាស្សីហ្សាស់"
        },
        {
            "barcode": "171113375",
            "dpc": "03022715301",
            "name": "ភឹត ស៊ីណា"
        },
        {
            "barcode": "171113376",
            "dpc": "03022715401",
            "name": "វ័រ វី"
        },
        {
            "barcode": "171113377",
            "dpc": "03022715501",
            "name": "ម៉ាត់ រ៉ភីយ៉ាស់"
        },
        {
            "barcode": "171113378",
            "dpc": "03022715601",
            "name": "សួន សុផល"
        },
        {
            "barcode": "171113379",
            "dpc": "03022715701",
            "name": "កែវ រ៉ស៊ីឌី"
        },
        {
            "barcode": "171113380",
            "dpc": "03022716101",
            "name": "សំ ហឿប"
        },
        {
            "barcode": "171113381",
            "dpc": "03022716201",
            "name": "លឿង សុខា"
        },
        {
            "barcode": "171113382",
            "dpc": "03022716701",
            "name": "ហួត ការី"
        },
        {
            "barcode": "171113383",
            "dpc": "03022718301",
            "name": "អៀ គីមហ៊ុន"
        },
        {
            "barcode": "171113384",
            "dpc": "03022718401",
            "name": "សំ គីមសេង"
        },
        {
            "barcode": "171113385",
            "dpc": "03022718701",
            "name": "លី ឆេង"
        },
        {
            "barcode": "171113386",
            "dpc": "03022718801",
            "name": "ឯល រ៉ូហ្សាត"
        },
        {
            "barcode": "171113387",
            "dpc": "03022718901",
            "name": "ហាប់ ស្រីមុំ"
        },
        {
            "barcode": "171113388",
            "dpc": "03022719001",
            "name": "ថាប់ សុធានី"
        },
        {
            "barcode": "171113389",
            "dpc": "03022719101",
            "name": "វ៉ាន់ ថា"
        },
        {
            "barcode": "171113390",
            "dpc": "03022719201",
            "name": "ម៉ៅ ដារ៉ា"
        },
        {
            "barcode": "171113391",
            "dpc": "03022719601",
            "name": "សំ ហេង"
        },
        {
            "barcode": "171113392",
            "dpc": "03022720601",
            "name": "ហួយ ចន្នី"
        },
        {
            "barcode": "171113393",
            "dpc": "03022721401",
            "name": "ឈិត ចាន់ភីរម្យ"
        },
        {
            "barcode": "171113394",
            "dpc": "03022721501",
            "name": "ម៉ូត សាគីរីន"
        },
        {
            "barcode": "171113395",
            "dpc": "03022721601",
            "name": "ប៉ោល ថន"
        },
        {
            "barcode": "171113396",
            "dpc": "03022721701",
            "name": "សំអែល សាវុធ"
        },
        {
            "barcode": "171113397",
            "dpc": "03022721801",
            "name": "រ័ត្ន សោភ័ណ្ឌ"
        },
        {
            "barcode": "171113398",
            "dpc": "03022722601",
            "name": "ផ្សារទំនើបភួ ពុយ"
        },
        {
            "barcode": "171113399",
            "dpc": "03022722701",
            "name": "ភួ ពុយ"
        },
        {
            "barcode": "171113400",
            "dpc": "03022722801",
            "name": "អ៊ឹង រស្មី"
        },
        {
            "barcode": "171113401",
            "dpc": "03022723301",
            "name": "ឡាច សម្បត្តិ"
        },
        {
            "barcode": "171113402",
            "dpc": "03022724701",
            "name": "ចៅ ហា"
        },
        {
            "barcode": "171113403",
            "dpc": "03022724801",
            "name": "គឹម ចន្ថា"
        },
        {
            "barcode": "171113404",
            "dpc": "03022725701",
            "name": "ប៉ោ គីម"
        },
        {
            "barcode": "171113405",
            "dpc": "03022725801",
            "name": "អ៊ុន សុផាត"
        },
        {
            "barcode": "171113406",
            "dpc": "03022726201",
            "name": "ហាំង ឡេង"
        },
        {
            "barcode": "171113407",
            "dpc": "03022726301",
            "name": "កុយ ណាឬទ្ធិ"
        },
        {
            "barcode": "171113408",
            "dpc": "03022726401",
            "name": "រ៉ែម ចឹក"
        },
        {
            "barcode": "171113409",
            "dpc": "03022726601",
            "name": "មាស ភី"
        },
        {
            "barcode": "171113410",
            "dpc": "03022726701",
            "name": "ញ៉ិល បូណាវី"
        },
        {
            "barcode": "171113411",
            "dpc": "03022726801",
            "name": "មាស សារពេជ្រ"
        },
        {
            "barcode": "171113412",
            "dpc": "03022726901",
            "name": "បាន សាវ៉េត"
        },
        {
            "barcode": "171113413",
            "dpc": "03022727001",
            "name": "ងី ហេង"
        },
        {
            "barcode": "171113414",
            "dpc": "03022727601",
            "name": "សែម សារ៉ាត់"
        },
        {
            "barcode": "171113415",
            "dpc": "03022727701",
            "name": "ងួន ភារម្យ"
        },
        {
            "barcode": "171113416",
            "dpc": "03022728201",
            "name": "ទួត រ៉ើន"
        },
        {
            "barcode": "171113417",
            "dpc": "03022728401",
            "name": "ឱ ចំរ៉ុង ២"
        },
        {
            "barcode": "171113418",
            "dpc": "03022728501",
            "name": "លី ម៉ាត់តារេៈ"
        },
        {
            "barcode": "171113419",
            "dpc": "03022728801",
            "name": "ឃុត សេន"
        },
        {
            "barcode": "171113420",
            "dpc": "03022728901",
            "name": "ទី ធី"
        },
        {
            "barcode": "171113421",
            "dpc": "03022729201",
            "name": "ង៉ត ញ៉ាញ់"
        },
        {
            "barcode": "171113422",
            "dpc": "03022729301",
            "name": "ផន វិចិត្រ"
        },
        {
            "barcode": "171113423",
            "dpc": "03022729401",
            "name": "ហែម ណារ័ត្ន"
        },
        {
            "barcode": "171113424",
            "dpc": "03022729501",
            "name": "ប៉ិច រដ្ឋា"
        },
        {
            "barcode": "171113425",
            "dpc": "03022729701",
            "name": "អុំ ឌិន"
        },
        {
            "barcode": "171113426",
            "dpc": "03022730001",
            "name": "ទូច ហ៊ីង"
        },
        {
            "barcode": "171113427",
            "dpc": "03022730101",
            "name": "ឃុន យឿន"
        },
        {
            "barcode": "171113428",
            "dpc": "03022730201",
            "name": "ប៉ុល ពេជ្រ"
        },
        {
            "barcode": "171113429",
            "dpc": "03022730601",
            "name": "ថៃ ចិន្តា"
        },
        {
            "barcode": "171113430",
            "dpc": "03022730701",
            "name": "មិន នាង"
        },
        {
            "barcode": "171113431",
            "dpc": "03022730801",
            "name": "សឿង សម្បត្តិ"
        },
        {
            "barcode": "171113432",
            "dpc": "03022730901",
            "name": "ឯក សុត្តារ៉ា"
        },
        {
            "barcode": "171113433",
            "dpc": "03022731101",
            "name": "យិន លាងហេង"
        },
        {
            "barcode": "171113434",
            "dpc": "03022731201",
            "name": "ម៉ៃ សាមុត"
        },
        {
            "barcode": "171113435",
            "dpc": "03022731501",
            "name": "ឡាយ សុខឡេង"
        },
        {
            "barcode": "171113436",
            "dpc": "03022731701",
            "name": "អ៊ុក ធឹម"
        },
        {
            "barcode": "171113437",
            "dpc": "03022731901",
            "name": "ថ ធឿន"
        },
        {
            "barcode": "171113438",
            "dpc": "03022732401",
            "name": "អ៊ឹម ម៉ុន់"
        },
        {
            "barcode": "171113439",
            "dpc": "03022732501",
            "name": "ស៊ិន វណ្ណា"
        },
        {
            "barcode": "171113440",
            "dpc": "03022733601",
            "name": "សួន សុខគា"
        },
        {
            "barcode": "171113441",
            "dpc": "03022733801",
            "name": "ងួន សេង"
        },
        {
            "barcode": "171113442",
            "dpc": "03022733901",
            "name": "ជួន កៅ"
        },
        {
            "barcode": "171113443",
            "dpc": "03022734001",
            "name": "អៀម ប៊ុននី"
        },
        {
            "barcode": "171113444",
            "dpc": "03022734201",
            "name": "សើន ចំរើន"
        },
        {
            "barcode": "171113445",
            "dpc": "03022734301",
            "name": "ទៀ ស៊ានី"
        },
        {
            "barcode": "171113446",
            "dpc": "03022734401",
            "name": "ម៉ុក សុថារី"
        },
        {
            "barcode": "171113447",
            "dpc": "03022734801",
            "name": "សន សុធី"
        },
        {
            "barcode": "171113448",
            "dpc": "03022734901",
            "name": "អ៊ុំ​ ឡ្ញុញ"
        },
        {
            "barcode": "171113449",
            "dpc": "03022735701",
            "name": "និល យឿត"
        },
        {
            "barcode": "171113450",
            "dpc": "03022735801",
            "name": "ឡឹក សុភា"
        },
        {
            "barcode": "171113451",
            "dpc": "03022735901",
            "name": "អ៊ុក ឧសភា"
        },
        {
            "barcode": "171113452",
            "dpc": "03022736001",
            "name": "ហម រិទ្ឋី១"
        },
        {
            "barcode": "171113453",
            "dpc": "03022736101",
            "name": "ហម រិទ្ឋី"
        },
        {
            "barcode": "171113454",
            "dpc": "03022736201",
            "name": "ឆន ណារី"
        },
        {
            "barcode": "171113455",
            "dpc": "03022736301",
            "name": "ឈុំ សិទ្ឋិ"
        },
        {
            "barcode": "171113456",
            "dpc": "03022736701",
            "name": "ងិន ចំរើន"
        },
        {
            "barcode": "171113457",
            "dpc": "03022738001",
            "name": "ពៅ សុជិន"
        },
        {
            "barcode": "171113458",
            "dpc": "03022738601",
            "name": "ម៉ាក់ នឿន"
        },
        {
            "barcode": "171113459",
            "dpc": "03022738701",
            "name": "ខន សុខលី"
        },
        {
            "barcode": "171113460",
            "dpc": "03022738801",
            "name": "សៀង សែម"
        },
        {
            "barcode": "171113461",
            "dpc": "03022738901",
            "name": "សូត្រ លិម"
        },
        {
            "barcode": "171113462",
            "dpc": "03022739001",
            "name": "ឯល យូសុះ"
        },
        {
            "barcode": "171113463",
            "dpc": "03022739201",
            "name": "និល ណារ៉ាន់"
        },
        {
            "barcode": "171113464",
            "dpc": "03022739301",
            "name": "គីន រ៉ម៉ាហ្វ្សី់"
        },
        {
            "barcode": "171113465",
            "dpc": "03022739401",
            "name": "រស់ ថន"
        },
        {
            "barcode": "171113466",
            "dpc": "03022740301",
            "name": "ឌឿប រិទ្វី"
        },
        {
            "barcode": "171113467",
            "dpc": "03022740901",
            "name": "សេង ភាព"
        },
        {
            "barcode": "171113468",
            "dpc": "03022741601",
            "name": "អ៊ុក សំអូន"
        },
        {
            "barcode": "171113469",
            "dpc": "03022741801",
            "name": "ងិន ពៅ"
        },
        {
            "barcode": "171113470",
            "dpc": "03022741901",
            "name": "មួន គង់"
        },
        {
            "barcode": "171113471",
            "dpc": "03022742001",
            "name": "គឹម រូឡង់"
        },
        {
            "barcode": "171113472",
            "dpc": "03022742101",
            "name": "វង្ស សារឿន"
        },
        {
            "barcode": "171113473",
            "dpc": "03022743301",
            "name": "ឆា ឆួប"
        },
        {
            "barcode": "171113474",
            "dpc": "03022743401",
            "name": "សុទ្វ សុន"
        },
        {
            "barcode": "171113475",
            "dpc": "03022743501",
            "name": "ខ្លូត សុខ"
        },
        {
            "barcode": "171113476",
            "dpc": "03022743601",
            "name": "ឌុច វិចិត្រ"
        },
        {
            "barcode": "171113477",
            "dpc": "03022743701",
            "name": "អ៊ុក យ៉េន"
        },
        {
            "barcode": "171113478",
            "dpc": "03022743801",
            "name": "ស៊ុន សុះ"
        },
        {
            "barcode": "171113479",
            "dpc": "03022745401",
            "name": "ចន្ទ័ ហេង"
        },
        {
            "barcode": "171113480",
            "dpc": "03022745501",
            "name": "ងឺ ម៉ារឌី"
        },
        {
            "barcode": "171113481",
            "dpc": "03022747601",
            "name": "ឡោ ម៉ាប់"
        },
        {
            "barcode": "171113482",
            "dpc": "03022747701",
            "name": "សំ ពៅ"
        },
        {
            "barcode": "171113483",
            "dpc": "03022747801",
            "name": "រៀប ឆេងគាម"
        },
        {
            "barcode": "171113484",
            "dpc": "03022718101",
            "name": "ពៅ បុប្ជា"
        },
        {
            "barcode": "171113485",
            "dpc": "03022745701",
            "name": "ហ៊ុយ ហេង"
        },
        {
            "barcode": "171113486",
            "dpc": "03022734101",
            "name": "ម៉ៅ វែង"
        },
        {
            "barcode": "171113487",
            "dpc": "03022722901",
            "name": "សៅ មិនាអង្គារ៉ា"
        },
        {
            "barcode": "171113488",
            "dpc": "03022717201",
            "name": "សេក សាគុណ"
        },
        {
            "barcode": "171113489",
            "dpc": "03022712301",
            "name": "អ៊ុង សុផាត"
        },
        {
            "barcode": "171113490",
            "dpc": "03022710201",
            "name": "លុយ សារុន"
        },
        {
            "barcode": "171113491",
            "dpc": "03022717301",
            "name": "ឈិន សឿន"
        },
        {
            "barcode": "171113492",
            "dpc": "03022745901",
            "name": "លន់ ឡោ"
        },
        {
            "barcode": "171113493",
            "dpc": "03022724901",
            "name": "ឡោ ប៊ុនឡេង"
        },
        {
            "barcode": "171113494",
            "dpc": "03022710401",
            "name": "សំ សារុន"
        },
        {
            "barcode": "171113495",
            "dpc": "03022710301",
            "name": "ជុំ ភាជ"
        },
        {
            "barcode": "171113496",
            "dpc": "03022710101",
            "name": "ហ៊ុន ដារា"
        },
        {
            "barcode": "171113497",
            "dpc": "03022704101",
            "name": "អឿង សាវិញ"
        },
        {
            "barcode": "171113498",
            "dpc": "03022704001",
            "name": "ជា ដារ៉ា"
        },
        {
            "barcode": "171113499",
            "dpc": "03022702601",
            "name": "លី ប៉ោជូ"
        },
        {
            "barcode": "171113500",
            "dpc": "03022700101",
            "name": "យក់ សំអឿន"
        },
        {
            "barcode": "171113501",
            "dpc": "03022746101",
            "name": "យឿម សុភ័ណដារ៉ា"
        },
        {
            "barcode": "171113502",
            "dpc": "03022746001",
            "name": "និល គុយហេង"
        },
        {
            "barcode": "171113503",
            "dpc": "03022723001",
            "name": "គង់ ដារ័ត្ន"
        },
        {
            "barcode": "171113504",
            "dpc": "03022720401",
            "name": "ជា​ សុខ"
        },
        {
            "barcode": "171113505",
            "dpc": "03022714101",
            "name": "អ៊ុំ ចាន់ណា"
        },
        {
            "barcode": "171113506",
            "dpc": "03022702501",
            "name": "យន យេន"
        },
        {
            "barcode": "171113507",
            "dpc": "03022746501",
            "name": "ឌី ឃាង"
        },
        {
            "barcode": "171113508",
            "dpc": "03022746301",
            "name": "ដិប ឪរ័ត្នន៍"
        },
        {
            "barcode": "171113509",
            "dpc": "03022746201",
            "name": "ហ៊ន សុភ័ណ"
        },
        {
            "barcode": "171113510",
            "dpc": "03022729901",
            "name": "វង់ ពិដោ"
        },
        {
            "barcode": "171113511",
            "dpc": "03022729801",
            "name": "ខាវ ណារ៉េត"
        },
        {
            "barcode": "171113512",
            "dpc": "03022725001",
            "name": "យឹម ប៊ុនរឿន"
        },
        {
            "barcode": "171113513",
            "dpc": "03022723201",
            "name": "ណុប គុំ"
        },
        {
            "barcode": "171113514",
            "dpc": "03022723101",
            "name": "ស៊ាន ណៃធី"
        },
        {
            "barcode": "171113515",
            "dpc": "03022718001",
            "name": "កុច រីណា"
        },
        {
            "barcode": "171113516",
            "dpc": "03022712401",
            "name": "អុំ ស៊ីណាត"
        },
        {
            "barcode": "171113517",
            "dpc": "03022710601",
            "name": "វែង គឹមហៀក"
        },
        {
            "barcode": "171113518",
            "dpc": "03022710501",
            "name": "ឯក ពេជ្រ"
        },
        {
            "barcode": "171113519",
            "dpc": "03022746401",
            "name": "សួន សារុំ"
        },
        {
            "barcode": "171113520",
            "dpc": "03022739601",
            "name": "ង៉ែត សាវ៉ុន"
        },
        {
            "barcode": "171113521",
            "dpc": "03022718201",
            "name": "ទុយ អារ៉ាម"
        },
        {
            "barcode": "171113522",
            "dpc": "03022739801",
            "name": "វន អេននី"
        },
        {
            "barcode": "171113523",
            "dpc": "03022739701",
            "name": "ខាវ យៀង"
        },
        {
            "barcode": "171113524",
            "dpc": "03022727101",
            "name": "លី គឹមធី"
        },
        {
            "barcode": "171113525",
            "dpc": "03022714201",
            "name": "ធា ចិន"
        },
        {
            "barcode": "171113526",
            "dpc": "03022704301",
            "name": "គុំ វង្សមុន្នី"
        },
        {
            "barcode": "171113527",
            "dpc": "03022720501",
            "name": "លី ពិសេត"
        },
        {
            "barcode": "171113528",
            "dpc": "03022717501",
            "name": "មុត សុធា"
        },
        {
            "barcode": "171113529",
            "dpc": "03022717601",
            "name": "រស់ ណារ៉ុង"
        },
        {
            "barcode": "171113530",
            "dpc": "03022700201",
            "name": "សំអុន សំណាង"
        },
        {
            "barcode": "171113531",
            "dpc": "03022712201",
            "name": "គីម សយ"
        },
        {
            "barcode": "171113532",
            "dpc": "03022721001",
            "name": "ហោ សុតន"
        },
        {
            "barcode": "171113533",
            "dpc": "03022725401",
            "name": "ស៊្រី ម៉េង"
        },
        {
            "barcode": "171113534",
            "dpc": "03022731401",
            "name": "ផាង ស៊ីលូថូ"
        },
        {
            "barcode": "171113535",
            "dpc": "03022713301",
            "name": "ចាន់ សម្បត្តិ"
        },
        {
            "barcode": "171113536",
            "dpc": "03022708201",
            "name": "ជា​ ហ៊ាង"
        },
        {
            "barcode": "171113537",
            "dpc": "03022745301",
            "name": "គឹម ហួត"
        },
        {
            "barcode": "171113538",
            "dpc": "03022745201",
            "name": "ចាន់ បូរ៉ា"
        },
        {
            "barcode": "171113539",
            "dpc": "03022744001",
            "name": "តាំង សុផល"
        },
        {
            "barcode": "171113540",
            "dpc": "03022744101",
            "name": "កែវ វុទ្ធី"
        },
        {
            "barcode": "171113541",
            "dpc": "03022744301",
            "name": "ប៉ោ មី"
        },
        {
            "barcode": "171113542",
            "dpc": "03022744401",
            "name": "ហ៊ាង"
        },
        {
            "barcode": "171113543",
            "dpc": "03022744501",
            "name": "មាស គន្ធេង"
        },
        {
            "barcode": "171113544",
            "dpc": "03022744601",
            "name": "ម៉ៅ ម៉ន"
        },
        {
            "barcode": "171113545",
            "dpc": "03022744701",
            "name": "អៀង សុធា"
        },
        {
            "barcode": "171113546",
            "dpc": "03022744801",
            "name": "គ្រូ រ័ត្ន"
        },
        {
            "barcode": "171113547",
            "dpc": "03022744901",
            "name": "ណឹង បូណា"
        },
        {
            "barcode": "171113548",
            "dpc": "03022745001",
            "name": "គ្រូ ភីរម្យ"
        },
        {
            "barcode": "171113549",
            "dpc": "03022745101",
            "name": "ជឹង ម៉ុយលី"
        },
        {
            "barcode": "171113550",
            "dpc": "03022708301",
            "name": "ចុង ផែត"
        },
        {
            "barcode": "171113551",
            "dpc": "03022724601",
            "name": "ហេង វែងឈាន"
        },
        {
            "barcode": "171113552",
            "dpc": "03022702301",
            "name": "ហេង នារតី"
        },
        {
            "barcode": "171113553",
            "dpc": "03022701501",
            "name": "ឡោះ ម៉ាស់"
        },
        {
            "barcode": "171113554",
            "dpc": "03022701701",
            "name": "ឯល លីណា"
        },
        {
            "barcode": "171113555",
            "dpc": "03022701401",
            "name": "យ៉េន សាវី"
        },
        {
            "barcode": "171113556",
            "dpc": "03022707701",
            "name": "ម៉ាន ម៉ាត់លី"
        },
        {
            "barcode": "171113557",
            "dpc": "03022701601",
            "name": "ខៀវ ពេជ្ររស្មីសុវណ្ណ"
        },
        {
            "barcode": "171113558",
            "dpc": "03022748001",
            "name": "ឌី សុខ"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
