
let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=
[
    {
        "barcode": "171106070",
        "dpc": "03042927401",
        "name": "ហេង ធិ"
    },
    {
        "barcode": "171106071",
        "dpc": "03042927301",
        "name": "សោម អូន"
    },
    {
        "barcode": "171106072",
        "dpc": "03042927201",
        "name": "ជិន លន់"
    },
    {
        "barcode": "171106073",
        "dpc": "03042904201",
        "name": "នាម សុភា"
    },
    {
        "barcode": "171106074",
        "dpc": "03042917201",
        "name": "រួម ស៊ីនាថ"
    },
    {
        "barcode": "171106075",
        "dpc": "03042923401",
        "name": "ទេព រ៉ានី"
    },
    {
        "barcode": "171106076",
        "dpc": "03042935201",
        "name": "ធួង ងន់សេង"
    },
    {
        "barcode": "171106077",
        "dpc": "03042926701",
        "name": "យិន ឡាង"
    },
    {
        "barcode": "171106078",
        "dpc": "03042919401",
        "name": "ឡាច វិត"
    },
    {
        "barcode": "171106079",
        "dpc": "03042919501",
        "name": "ហុង ភាព"
    },
    {
        "barcode": "171106080",
        "dpc": "03042919701",
        "name": "សំ សារឿត"
    },
    {
        "barcode": "171106081",
        "dpc": "03042919801",
        "name": "ហង្ស រី"
    },
    {
        "barcode": "171106082",
        "dpc": "03042927501",
        "name": "ទៀប ចាន់ធឿន"
    },
    {
        "barcode": "171106083",
        "dpc": "03042935001",
        "name": "គីម លី"
    },
    {
        "barcode": "171106084",
        "dpc": "03042933801",
        "name": "ឡិប ទ៉នី"
    },
    {
        "barcode": "171106085",
        "dpc": "03042920401",
        "name": "កែវ បញ្ញា"
    },
    {
        "barcode": "171106086",
        "dpc": "03042920501",
        "name": "សុខ វាសនា"
    },
    {
        "barcode": "171106087",
        "dpc": "03042920601",
        "name": "ហុក លីហេង"
    },
    {
        "barcode": "171106088",
        "dpc": "03042920701",
        "name": "យ៉ុន សម្ភស្ស"
    },
    {
        "barcode": "171106089",
        "dpc": "03042908701",
        "name": "អ៊ុក មៃ"
    },
    {
        "barcode": "171106090",
        "dpc": "03042931501",
        "name": "ជា ដានី"
    },
    {
        "barcode": "171106091",
        "dpc": "03042909001",
        "name": "ហេង យី"
    },
    {
        "barcode": "171106092",
        "dpc": "03042931601",
        "name": "ឡាប ប៉េងគី"
    },
    {
        "barcode": "171106093",
        "dpc": "03042905401",
        "name": "គឹម យ៉ាន"
    },
    {
        "barcode": "171106094",
        "dpc": "03042901701",
        "name": "ឆុំ ស្លីម៉ាត់"
    },
    {
        "barcode": "171106095",
        "dpc": "03042912901",
        "name": "ពៅ ចាន់ថា"
    },
    {
        "barcode": "171106096",
        "dpc": "03042914601",
        "name": "ឈឺន សំណាង"
    },
    {
        "barcode": "171106097",
        "dpc": "03042914501",
        "name": "វាំង បាន"
    },
    {
        "barcode": "171106098",
        "dpc": "03042929201",
        "name": "សាយ សាវី"
    },
    {
        "barcode": "171106099",
        "dpc": "03042914401",
        "name": "ដាំ ម៉េង"
    },
    {
        "barcode": "171106100",
        "dpc": "03042909501",
        "name": "សេង ឡុង"
    },
    {
        "barcode": "171106101",
        "dpc": "03042910801",
        "name": "ហុក រតនា"
    },
    {
        "barcode": "171106102",
        "dpc": "03042910901",
        "name": "ជុំ សអ៊ុន"
    },
    {
        "barcode": "171106103",
        "dpc": "03042909701",
        "name": "វឿន ដាវី"
    },
    {
        "barcode": "171106104",
        "dpc": "03042909801",
        "name": "វិញ សាវឿន"
    },
    {
        "barcode": "171106105",
        "dpc": "03042902901",
        "name": "តែ ប៊ុនលី"
    },
    {
        "barcode": "171106106",
        "dpc": "03042911501",
        "name": "រេន សុខារ៉ា"
    },
    {
        "barcode": "171106107",
        "dpc": "03042900401",
        "name": "វិន វន"
    },
    {
        "barcode": "171106108",
        "dpc": "03042911101",
        "name": "ធី សោភា"
    },
    {
        "barcode": "171106109",
        "dpc": "03042910601",
        "name": "ជា វិចិត្រ"
    },
    {
        "barcode": "171106110",
        "dpc": "03042908401",
        "name": "ហៀក សុភ័ក្រ"
    },
    {
        "barcode": "171106111",
        "dpc": "03042916201",
        "name": "ឈៀង សុផាន់ដា"
    },
    {
        "barcode": "171106112",
        "dpc": "03042919901",
        "name": "ហ៊ាង រស្មី"
    },
    {
        "barcode": "171106113",
        "dpc": "03042917701",
        "name": "ឈិត អារុណ"
    },
    {
        "barcode": "171106114",
        "dpc": "03042931701",
        "name": "រ៉ន កណ្ណិកា"
    },
    {
        "barcode": "171106115",
        "dpc": "03042924301",
        "name": "ព្រាប យឿម"
    },
    {
        "barcode": "171106116",
        "dpc": "03042934201",
        "name": "សោម កុសល"
    },
    {
        "barcode": "171106117",
        "dpc": "03042909401",
        "name": "ខែម សឿន"
    },
    {
        "barcode": "171106118",
        "dpc": "03042936801",
        "name": "ទេព ភារម"
    },
    {
        "barcode": "171106119",
        "dpc": "03042931801",
        "name": "ចាន់ តេងសូនី"
    },
    {
        "barcode": "171106120",
        "dpc": "03042903501",
        "name": "លឹម គឹមជា"
    },
    {
        "barcode": "171106121",
        "dpc": "03042903601",
        "name": "ឌឿន ឆន"
    },
    {
        "barcode": "171106122",
        "dpc": "03042925901",
        "name": "ចាន់ សារិទ្ធិ"
    },
    {
        "barcode": "171106123",
        "dpc": "03042917001",
        "name": "ខែម សារិទ្ធី"
    },
    {
        "barcode": "171106124",
        "dpc": "03042909301",
        "name": "ង៉ែត គឹមឈឿន"
    },
    {
        "barcode": "171106125",
        "dpc": "03042927701",
        "name": "សំ សឿន"
    },
    {
        "barcode": "171106126",
        "dpc": "03042914701",
        "name": "ជួន សំណាង"
    },
    {
        "barcode": "171106127",
        "dpc": "03042921601",
        "name": "ធិម ម៉ារដ្ឋ"
    },
    {
        "barcode": "171106128",
        "dpc": "03042921701",
        "name": "លី សារឿន"
    },
    {
        "barcode": "171106129",
        "dpc": "03042900101",
        "name": "នួច ផុន"
    },
    {
        "barcode": "171106130",
        "dpc": "03042904501",
        "name": "សាលា CUS"
    },
    {
        "barcode": "171106131",
        "dpc": "03042901401",
        "name": "សាន់ ស៊ីនឿន"
    },
    {
        "barcode": "171106132",
        "dpc": "03042934301",
        "name": "ឈួម សំណាង"
    },
    {
        "barcode": "171106133",
        "dpc": "03042913101",
        "name": "ហុង សុខហេង"
    },
    {
        "barcode": "171106134",
        "dpc": "03042917801",
        "name": "មុត សំ"
    },
    {
        "barcode": "171106135",
        "dpc": "03042913301",
        "name": "ទូច យ៉ាសិទ្ធិ"
    },
    {
        "barcode": "171106136",
        "dpc": "03042911201",
        "name": "គាំ សំអាត"
    },
    {
        "barcode": "171106137",
        "dpc": "03042909901",
        "name": "វង្ស សារិទ្ធភក្ដី"
    },
    {
        "barcode": "171106138",
        "dpc": "03042913001",
        "name": "ប៉ុច ជំនឿន"
    },
    {
        "barcode": "171106139",
        "dpc": "03042903001",
        "name": "លឹម ផល្គុន"
    },
    {
        "barcode": "171106140",
        "dpc": "03042919301",
        "name": "ង៉ែត មុំ"
    },
    {
        "barcode": "171106141",
        "dpc": "03042908301",
        "name": "អុល ថូ"
    },
    {
        "barcode": "171106142",
        "dpc": "03042913401",
        "name": "ញ៉ែម រតនា"
    },
    {
        "barcode": "171106143",
        "dpc": "03042935101",
        "name": "ភិន ធឿន"
    },
    {
        "barcode": "171106144",
        "dpc": "03042902101",
        "name": "លាន ឡាត់"
    },
    {
        "barcode": "171106145",
        "dpc": "03042928401",
        "name": "សន សុខនិ"
    },
    {
        "barcode": "171106146",
        "dpc": "03042936301",
        "name": "អ៊ុត ស៊ីណាត១"
    },
    {
        "barcode": "171106147",
        "dpc": "03042936601",
        "name": "ឌុច រតនា"
    },
    {
        "barcode": "171106148",
        "dpc": "03042936701",
        "name": "គុយ សុងលាង"
    },
    {
        "barcode": "171106149",
        "dpc": "03042904301",
        "name": "សាលាវត្តកំផែង"
    },
    {
        "barcode": "171106150",
        "dpc": "03042904401",
        "name": "វិទ្យាល័យសម្តេចឪ"
    },
    {
        "barcode": "171106151",
        "dpc": "03042901501",
        "name": "សាំង ប៊ុនម៉ៅ"
    },
    {
        "barcode": "171106152",
        "dpc": "03042901601",
        "name": "ជា សុផល់"
    },
    {
        "barcode": "171106153",
        "dpc": "03042923501",
        "name": "សុខ មុំ"
    },
    {
        "barcode": "171106154",
        "dpc": "03042936001",
        "name": "ធិន នរសីហា"
    },
    {
        "barcode": "171106155",
        "dpc": "03042907501",
        "name": "ភឿក ឡុងឌី"
    },
    {
        "barcode": "171106156",
        "dpc": "03042907601",
        "name": "កឹម ភឹម"
    },
    {
        "barcode": "171106157",
        "dpc": "03042901801",
        "name": "ឈួ ឡៃហ៊ាង"
    },
    {
        "barcode": "171106158",
        "dpc": "03042932101",
        "name": "ហែម សុធា"
    },
    {
        "barcode": "171106159",
        "dpc": "03042935801",
        "name": "តែ ស៊ីណូ"
    },
    {
        "barcode": "171106160",
        "dpc": "03042933501",
        "name": "គឹម ទៀង"
    },
    {
        "barcode": "171106161",
        "dpc": "03042911601",
        "name": "រិទ្ធ ដាណេ"
    },
    {
        "barcode": "171106162",
        "dpc": "03042910001",
        "name": "តាំង ហ៊ីង"
    },
    {
        "barcode": "171106163",
        "dpc": "03042930301",
        "name": "ឃួន នឿន៣"
    },
    {
        "barcode": "171106164",
        "dpc": "03042926901",
        "name": "អ៊ុត ក្លឹង ៣"
    },
    {
        "barcode": "171106165",
        "dpc": "03042913501",
        "name": "ស៊ា រឿត"
    },
    {
        "barcode": "171106166",
        "dpc": "03042916601",
        "name": "សយ តឹង"
    },
    {
        "barcode": "171106167",
        "dpc": "03042916701",
        "name": "យិន វន"
    },
    {
        "barcode": "171106168",
        "dpc": "03042916801",
        "name": "ថយ សុភា"
    },
    {
        "barcode": "171106169",
        "dpc": "03042926101",
        "name": "ថៃ សាម៉ុន"
    },
    {
        "barcode": "171106170",
        "dpc": "03042930401",
        "name": "សូន្យ ណាវុធ"
    },
    {
        "barcode": "171106171",
        "dpc": "03042930601",
        "name": "នីវ ថាន"
    },
    {
        "barcode": "171106172",
        "dpc": "03042930701",
        "name": "ផុន សារ៉ុម"
    },
    {
        "barcode": "171106173",
        "dpc": "03042930501",
        "name": "មឿង មឿន"
    },
    {
        "barcode": "171106174",
        "dpc": "03042930801",
        "name": "សូ ស៊ីម"
    },
    {
        "barcode": "171106175",
        "dpc": "03042930901",
        "name": "អុំ ភីនីសារ៉ា"
    },
    {
        "barcode": "171106176",
        "dpc": "03042931101",
        "name": "វ៉ាន់ ច័ន្ទ"
    },
    {
        "barcode": "171106177",
        "dpc": "03042933301",
        "name": "អួន ណែម"
    },
    {
        "barcode": "171106178",
        "dpc": "03042902201",
        "name": "លីន វណ្ណា"
    },
    {
        "barcode": "171106179",
        "dpc": "03042916001",
        "name": "លិន សុខា"
    },
    {
        "barcode": "171106180",
        "dpc": "03042915901",
        "name": "ម៉ៅ សុជាតិ"
    },
    {
        "barcode": "171106181",
        "dpc": "03042915801",
        "name": "ឃុន ងួនហុង"
    },
    {
        "barcode": "171106182",
        "dpc": "03042934601",
        "name": "យី គក់"
    },
    {
        "barcode": "171106183",
        "dpc": "03042934501",
        "name": "ហុក សំសិទ្ធិ"
    },
    {
        "barcode": "171106184",
        "dpc": "03042904101",
        "name": "ឌួង វណ្ណា២"
    },
    {
        "barcode": "171106185",
        "dpc": "03042923201",
        "name": "ឈឹម សារឿន"
    },
    {
        "barcode": "171106186",
        "dpc": "03042937901",
        "name": "ឃឹម គឹម"
    },
    {
        "barcode": "171106187",
        "dpc": "03042937801",
        "name": "បេង ប៊ុនអាត"
    },
    {
        "barcode": "171106188",
        "dpc": "03042937701",
        "name": "ស៊ុំ ចំរើន"
    },
    {
        "barcode": "171106189",
        "dpc": "03042937601",
        "name": "សំ សុធា"
    },
    {
        "barcode": "171106190",
        "dpc": "03042937201",
        "name": "ប្រោញ វុទ្ធី"
    },
    {
        "barcode": "171106191",
        "dpc": "03042937301",
        "name": "ឌួង អ៊ុត"
    },
    {
        "barcode": "171106192",
        "dpc": "03042937401",
        "name": "អឿន វុទ្ធី"
    },
    {
        "barcode": "171106193",
        "dpc": "03042937501",
        "name": "ស៊ុយ គឹមសឿន"
    },
    {
        "barcode": "171106194",
        "dpc": "03042908501",
        "name": "ឆេង គឹមអាន"
    },
    {
        "barcode": "171106195",
        "dpc": "03042933401",
        "name": "ផាត់ ផារើយ"
    },
    {
        "barcode": "171106196",
        "dpc": "03042916101",
        "name": "យ៉ន ទីណា"
    },
    {
        "barcode": "171106197",
        "dpc": "03042913801",
        "name": "ឈួ គី"
    },
    {
        "barcode": "171106198",
        "dpc": "03042913701",
        "name": "ពៅ លាង"
    },
    {
        "barcode": "171106199",
        "dpc": "03042928201",
        "name": "ហ៊ន សារ៉ាត់"
    },
    {
        "barcode": "171106200",
        "dpc": "03042928101",
        "name": "យ៉ត យឿត"
    },
    {
        "barcode": "171106201",
        "dpc": "03042902401",
        "name": "វ៉ន ពៅ"
    },
    {
        "barcode": "171106202",
        "dpc": "03042911301",
        "name": "ឡុច វណ្ណផា"
    },
    {
        "barcode": "171106203",
        "dpc": "03042913601",
        "name": "ឡាច បូរ៉ា"
    },
    {
        "barcode": "171106204",
        "dpc": "03042926401",
        "name": "ង៉ែត មាន"
    },
    {
        "barcode": "171106205",
        "dpc": "03042906101",
        "name": "ជួង សុថា"
    },
    {
        "barcode": "171106206",
        "dpc": "03042902301",
        "name": "ប៉ិច សារ៉ែម"
    },
    {
        "barcode": "171106207",
        "dpc": "03042912301",
        "name": "មាន សុខរ៉ា"
    },
    {
        "barcode": "171106208",
        "dpc": "03042900701",
        "name": "ទួត ដារិទ្ធ"
    },
    {
        "barcode": "171106209",
        "dpc": "03042922201",
        "name": "សន ណាវី"
    },
    {
        "barcode": "171106210",
        "dpc": "03042922101",
        "name": "ឆាន់ វាសនា"
    },
    {
        "barcode": "171106211",
        "dpc": "03042922001",
        "name": "ធូក វុទ្ធី"
    },
    {
        "barcode": "171106212",
        "dpc": "03042933201",
        "name": "ព្រិស គឹមស៊ួ"
    },
    {
        "barcode": "171106213",
        "dpc": "03042900201",
        "name": "ឈួយ វិចិត្រ"
    },
    {
        "barcode": "171106214",
        "dpc": "03042901101",
        "name": "ស៊ិប សូលី"
    },
    {
        "barcode": "171106215",
        "dpc": "03042910201",
        "name": "សេង សុវុធដារ៉ា"
    },
    {
        "barcode": "171106216",
        "dpc": "03042922401",
        "name": "វ៉ាន់ វឌ្ឍនា"
    },
    {
        "barcode": "171106217",
        "dpc": "03042912001",
        "name": "គង់ រិន"
    },
    {
        "barcode": "171106218",
        "dpc": "03042922501",
        "name": "អាត វាសនា"
    },
    {
        "barcode": "171106219",
        "dpc": "03042929001",
        "name": "ឈួន ដាវី"
    },
    {
        "barcode": "171106220",
        "dpc": "03042914001",
        "name": "អ៊ុក វឌ្ឍរ័ត្ន"
    },
    {
        "barcode": "171106221",
        "dpc": "03042934401",
        "name": "ជា វណ្ណៈ"
    },
    {
        "barcode": "171106222",
        "dpc": "03042904901",
        "name": "មន្ទីរស្រាវជ្រាវ"
    },
    {
        "barcode": "171106223",
        "dpc": "03042905101",
        "name": "ប៉ិន វណ្ណៈ"
    },
    {
        "barcode": "171106224",
        "dpc": "03042922601",
        "name": "ប៊ី សុភ័ក្រ"
    },
    {
        "barcode": "171106225",
        "dpc": "03042902001",
        "name": "ឡុង ស៊ីណាត"
    },
    {
        "barcode": "171106226",
        "dpc": "03042923001",
        "name": "ប៉ែន ចិន្តា"
    },
    {
        "barcode": "171106227",
        "dpc": "03042905201",
        "name": "ចាន់ សំបូរ"
    },
    {
        "barcode": "171106228",
        "dpc": "03042922901",
        "name": "យូ ភីរុន"
    },
    {
        "barcode": "171106229",
        "dpc": "03042922801",
        "name": "ហេង ម៉េងហួត"
    },
    {
        "barcode": "171106230",
        "dpc": "03042916301",
        "name": "ឌិន សឿង"
    },
    {
        "barcode": "171106231",
        "dpc": "03042904001",
        "name": "ទង ស្រី"
    },
    {
        "barcode": "171106232",
        "dpc": "03042904601",
        "name": "ងី ហេង"
    },
    {
        "barcode": "171106233",
        "dpc": "03042904701",
        "name": "ភោគ សុជាតិ"
    },
    {
        "barcode": "171106234",
        "dpc": "03042903901",
        "name": "មៀន ឈឿន"
    },
    {
        "barcode": "171106235",
        "dpc": "03042926501",
        "name": "គិន ស៊ុន"
    },
    {
        "barcode": "171106236",
        "dpc": "03042900601",
        "name": "សឿ សំអុល"
    },
    {
        "barcode": "171106237",
        "dpc": "03042906401",
        "name": "ភោគ សុជាតិ"
    },
    {
        "barcode": "171106238",
        "dpc": "03042906501",
        "name": "រស់ សុភាព"
    },
    {
        "barcode": "171106239",
        "dpc": "03042929101",
        "name": "ឈឿង វុទ្ធី"
    },
    {
        "barcode": "171106240",
        "dpc": "03042901001",
        "name": "សុខ ស៊ីថា"
    },
    {
        "barcode": "171106241",
        "dpc": "03042931001",
        "name": "ស៊ីង សាន"
    },
    {
        "barcode": "171106242",
        "dpc": "03042900301",
        "name": "នូ សុរិយា"
    },
    {
        "barcode": "171106243",
        "dpc": "03042900501",
        "name": "យស់ ម៉ារ៉ា"
    },
    {
        "barcode": "171106244",
        "dpc": "03042901901",
        "name": "ឡឹក រ៉ៃយ៉ា"
    },
    {
        "barcode": "171106245",
        "dpc": "03042902601",
        "name": "លេខ ពៅ"
    },
    {
        "barcode": "171106246",
        "dpc": "03042902701",
        "name": "ស៊ុន សំណាង"
    },
    {
        "barcode": "171106247",
        "dpc": "03042903101",
        "name": "ពេជ្រ សុផេង"
    },
    {
        "barcode": "171106248",
        "dpc": "03042903201",
        "name": "លីម ប៊ុនណា"
    },
    {
        "barcode": "171106249",
        "dpc": "03042903301",
        "name": "គួយ សុខជា"
    },
    {
        "barcode": "171106250",
        "dpc": "03042903401",
        "name": "សុខ ជីវី"
    },
    {
        "barcode": "171106251",
        "dpc": "03042903701",
        "name": "មឹង មុនីរម្យ"
    },
    {
        "barcode": "171106252",
        "dpc": "03042904801",
        "name": "យិន ម៉ៅ"
    },
    {
        "barcode": "171106253",
        "dpc": "03042905001",
        "name": "ហូវ សុមុនី"
    },
    {
        "barcode": "171106254",
        "dpc": "03042905301",
        "name": "ហួយ ចន្ធី"
    },
    {
        "barcode": "171106255",
        "dpc": "03042905501",
        "name": "កែវ ចន្ថា ២"
    },
    {
        "barcode": "171106256",
        "dpc": "03042905601",
        "name": "វ៉ែន ទូច"
    },
    {
        "barcode": "171106257",
        "dpc": "03042905701",
        "name": "អែតហ្វូត ២៥"
    },
    {
        "barcode": "171106258",
        "dpc": "03042905801",
        "name": "ប៉ែន អូន"
    },
    {
        "barcode": "171106259",
        "dpc": "03042905901",
        "name": "ផាវ ផល"
    },
    {
        "barcode": "171106260",
        "dpc": "03042906001",
        "name": "ទូច សម្បត្តិ"
    },
    {
        "barcode": "171106261",
        "dpc": "03042906201",
        "name": "សាំង វាសនា"
    },
    {
        "barcode": "171106262",
        "dpc": "03042906301",
        "name": "ជឹម ចាន់ថន"
    },
    {
        "barcode": "171106263",
        "dpc": "03042906601",
        "name": "សាន"
    },
    {
        "barcode": "171106264",
        "dpc": "03042906801",
        "name": "សុខុម សុខាលីន"
    },
    {
        "barcode": "171106265",
        "dpc": "03042906901",
        "name": "ឃុន ហ៊ីម"
    },
    {
        "barcode": "171106266",
        "dpc": "03042907001",
        "name": "សុង ណាំង"
    },
    {
        "barcode": "171106267",
        "dpc": "03042907201",
        "name": "ថន ថុលសុវណ្ណវិបុល"
    },
    {
        "barcode": "171106268",
        "dpc": "03042907401",
        "name": "សំណាង សីម៉ា"
    },
    {
        "barcode": "171106269",
        "dpc": "03042907801",
        "name": "បុន៊ សុខាណា"
    },
    {
        "barcode": "171106270",
        "dpc": "03042907901",
        "name": "ប៊ុន រដ្ឋា"
    },
    {
        "barcode": "171106271",
        "dpc": "03042908001",
        "name": "ប៊ុន វុទ្ធី"
    },
    {
        "barcode": "171106272",
        "dpc": "03042908101",
        "name": "សាំង សុធារស"
    },
    {
        "barcode": "171106273",
        "dpc": "03042908201",
        "name": "ឆៃ សុខុម"
    },
    {
        "barcode": "171106274",
        "dpc": "03042908601",
        "name": "ហ៊ុយ បៀន"
    },
    {
        "barcode": "171106275",
        "dpc": "03042908801",
        "name": "ឆឹង នី"
    },
    {
        "barcode": "171106276",
        "dpc": "03042908901",
        "name": "ឡេង ស៊ីណា ៤"
    },
    {
        "barcode": "171106277",
        "dpc": "03042909101",
        "name": "ហេង ផល្លី"
    },
    {
        "barcode": "171106278",
        "dpc": "03042909601",
        "name": "អ៊ុង ហេម"
    },
    {
        "barcode": "171106279",
        "dpc": "03042910101",
        "name": "សិបុ លឿត"
    },
    {
        "barcode": "171106280",
        "dpc": "03042910301",
        "name": "គុយ ប៉េងស៊្រាង"
    },
    {
        "barcode": "171106281",
        "dpc": "03042910401",
        "name": "ឈុន ថា"
    },
    {
        "barcode": "171106282",
        "dpc": "03042910501",
        "name": "ស៊ុន ហុង"
    },
    {
        "barcode": "171106283",
        "dpc": "03042910701",
        "name": "កុយ ស៊ីដេត"
    },
    {
        "barcode": "171106284",
        "dpc": "03042911001",
        "name": "ឯក សំយុទ្ធ"
    },
    {
        "barcode": "171106285",
        "dpc": "03042911401",
        "name": "នេត ស៊ីថន"
    },
    {
        "barcode": "171106286",
        "dpc": "03042911701",
        "name": "ហួរ ឆុង"
    },
    {
        "barcode": "171106287",
        "dpc": "03042911801",
        "name": "យុត តុងហាន់"
    },
    {
        "barcode": "171106288",
        "dpc": "03042911901",
        "name": "ឡៃ ចិន"
    },
    {
        "barcode": "171106289",
        "dpc": "03042912201",
        "name": "ឈុន បូទំ"
    },
    {
        "barcode": "171106290",
        "dpc": "03042912501",
        "name": "ជៀម សុខា"
    },
    {
        "barcode": "171106291",
        "dpc": "03042912601",
        "name": "តាំង ឡាយ"
    },
    {
        "barcode": "171106292",
        "dpc": "03042912701",
        "name": "អ៊ីវ ថន"
    },
    {
        "barcode": "171106293",
        "dpc": "03042912801",
        "name": "ទេព វណ្ណា"
    },
    {
        "barcode": "171106294",
        "dpc": "03042914101",
        "name": "ឈឹម សារ៉េត"
    },
    {
        "barcode": "171106295",
        "dpc": "03042914201",
        "name": "សំ សុខហេង"
    },
    {
        "barcode": "171106296",
        "dpc": "03042914301",
        "name": "សាន ចន"
    },
    {
        "barcode": "171106297",
        "dpc": "03042914801",
        "name": "ឌឿក វណ្ណា"
    },
    {
        "barcode": "171106298",
        "dpc": "03042914901",
        "name": "លៀង វិច្ឆិកា"
    },
    {
        "barcode": "171106299",
        "dpc": "03042915001",
        "name": "លាង សម្ផស្ស"
    },
    {
        "barcode": "171106300",
        "dpc": "03042915101",
        "name": "ឡៅ ប៊ុនលីដា"
    },
    {
        "barcode": "171106301",
        "dpc": "03042915201",
        "name": "ហ៊ួន ធារី"
    },
    {
        "barcode": "171106302",
        "dpc": "03042915301",
        "name": "ញ៉ុក ឆវី"
    },
    {
        "barcode": "171106303",
        "dpc": "03042915401",
        "name": "ទ្រិញ យី បូរីផ្សារលើ"
    },
    {
        "barcode": "171106304",
        "dpc": "03042915501",
        "name": "ហ៊ាង សុម៉ាណា បូរីផ្សារេលី"
    },
    {
        "barcode": "171106305",
        "dpc": "03042915601",
        "name": "បនា ឡង បូរីផ្សារលើ"
    },
    {
        "barcode": "171106306",
        "dpc": "03042915701",
        "name": "ហ៊ឹង ផល្លា"
    },
    {
        "barcode": "171106307",
        "dpc": "03042916401",
        "name": "អែម យុទ្ធ"
    },
    {
        "barcode": "171106308",
        "dpc": "03042916501",
        "name": "គា ថៃ"
    },
    {
        "barcode": "171106309",
        "dpc": "03042916901",
        "name": "ចាន់ សុធី"
    },
    {
        "barcode": "171106310",
        "dpc": "03042917101",
        "name": "ឡុង យ៉ាន"
    },
    {
        "barcode": "171106311",
        "dpc": "03042917301",
        "name": "គា ចាន់នី"
    },
    {
        "barcode": "171106312",
        "dpc": "03042917601",
        "name": "ថាន់ រដ្ឋា"
    },
    {
        "barcode": "171106313",
        "dpc": "03042917901",
        "name": "ប៉ែន សុវណ្ណតារា"
    },
    {
        "barcode": "171106314",
        "dpc": "03042918001",
        "name": "ធួន រ៉ាវុធ"
    },
    {
        "barcode": "171106315",
        "dpc": "03042918101",
        "name": "ឡិប សុធា"
    },
    {
        "barcode": "171106316",
        "dpc": "03042918201",
        "name": "លឿង ណាគ្រី"
    },
    {
        "barcode": "171106317",
        "dpc": "03042918301",
        "name": "តិ ចាន់គុណ"
    },
    {
        "barcode": "171106318",
        "dpc": "03042918401",
        "name": "អែតហ្វូត ២៦"
    },
    {
        "barcode": "171106319",
        "dpc": "03042918601",
        "name": "សេង ហុង"
    },
    {
        "barcode": "171106320",
        "dpc": "03042918701",
        "name": "ប៉ុស្តន៍បាយ័ន្ត"
    },
    {
        "barcode": "171106321",
        "dpc": "03042918801",
        "name": "គឹម វុទ្ឌី"
    },
    {
        "barcode": "171106322",
        "dpc": "03042918901",
        "name": "ប្រាក់ វុទ្ធី"
    },
    {
        "barcode": "171106323",
        "dpc": "03042919001",
        "name": "ហុង ចាន់ណា"
    },
    {
        "barcode": "171106324",
        "dpc": "03042919101",
        "name": "ធនាគារកាណាឌីយ៉ា"
    },
    {
        "barcode": "171106325",
        "dpc": "03042919201",
        "name": "ធនាគារប្រៃណីយ៍"
    },
    {
        "barcode": "171106326",
        "dpc": "03042919601",
        "name": "យស់ សាមឿន"
    },
    {
        "barcode": "171106327",
        "dpc": "03042920001",
        "name": "សំ ដារ៉ាវុធ"
    },
    {
        "barcode": "171106328",
        "dpc": "03042920801",
        "name": "កៅ សុផារី"
    },
    {
        "barcode": "171106329",
        "dpc": "03042920901",
        "name": "ពៅ ជា"
    },
    {
        "barcode": "171106330",
        "dpc": "03042921001",
        "name": "ម៉ម សំអុល"
    },
    {
        "barcode": "171106331",
        "dpc": "03042921101",
        "name": "មុំ សុផល"
    },
    {
        "barcode": "171106332",
        "dpc": "03042921201",
        "name": "ព្រំ សុផល"
    },
    {
        "barcode": "171106333",
        "dpc": "03042921401",
        "name": "លឹម ហាក់"
    },
    {
        "barcode": "171106334",
        "dpc": "03042921501",
        "name": "ម៉ុង ធី"
    },
    {
        "barcode": "171106335",
        "dpc": "03042921801",
        "name": "ណៃ វុន"
    },
    {
        "barcode": "171106336",
        "dpc": "03042921901",
        "name": "លឹម ស៊ីថា"
    },
    {
        "barcode": "171106337",
        "dpc": "03042922301",
        "name": "ហុង ស៊ីថា"
    },
    {
        "barcode": "171106338",
        "dpc": "03042923101",
        "name": "អ៊ាន ចន្ទ័ណា"
    },
    {
        "barcode": "171106339",
        "dpc": "03042923601",
        "name": "ដោក ហេង"
    },
    {
        "barcode": "171106340",
        "dpc": "03042923701",
        "name": "ស៊ង លួត"
    },
    {
        "barcode": "171106341",
        "dpc": "03042923801",
        "name": "យិន ធីរ៉ាក់"
    },
    {
        "barcode": "171106342",
        "dpc": "03042923901",
        "name": "វង្ស ឌីណា"
    },
    {
        "barcode": "171106343",
        "dpc": "03042924001",
        "name": "កែវ ជី"
    },
    {
        "barcode": "171106344",
        "dpc": "03042924101",
        "name": "ប៊ុត គីម"
    },
    {
        "barcode": "171106345",
        "dpc": "03042924201",
        "name": "ឯក ម៉ារ៉ាឌី"
    },
    {
        "barcode": "171106346",
        "dpc": "03042924401",
        "name": "នៅ តុលា"
    },
    {
        "barcode": "171106347",
        "dpc": "03042924501",
        "name": "សោម សម្បត្តិ"
    },
    {
        "barcode": "171106348",
        "dpc": "03042924601",
        "name": "សំរទ្ធ ណារី"
    },
    {
        "barcode": "171106349",
        "dpc": "03042924701",
        "name": "ហាក់ ស៊្រី"
    },
    {
        "barcode": "171106350",
        "dpc": "03042924801",
        "name": "ម៉ៅ រឿង"
    },
    {
        "barcode": "171106351",
        "dpc": "03042924901",
        "name": "ព្រឹង តិ"
    },
    {
        "barcode": "171106352",
        "dpc": "03042925001",
        "name": "ម៉ី សំអាង"
    },
    {
        "barcode": "171106353",
        "dpc": "03042925101",
        "name": "ស្រី មុន្នីរិទ្ធ"
    },
    {
        "barcode": "171106354",
        "dpc": "03042925201",
        "name": "គ្រីន ប៊ុនធី"
    },
    {
        "barcode": "171106355",
        "dpc": "03042925301",
        "name": "ស្រេង ឡៃស៊ាង"
    },
    {
        "barcode": "171106356",
        "dpc": "03042925501",
        "name": "នួន ម៉ារីន"
    },
    {
        "barcode": "171106357",
        "dpc": "03042925601",
        "name": "វ៉ាន់ សំបូរ"
    },
    {
        "barcode": "171106358",
        "dpc": "03042925701",
        "name": "អ៊ុក ឈិន"
    },
    {
        "barcode": "171106359",
        "dpc": "03042925801",
        "name": "សុខ ចាន់ធឿន"
    },
    {
        "barcode": "171106360",
        "dpc": "03042926201",
        "name": "ជា សាវឹម"
    },
    {
        "barcode": "171106361",
        "dpc": "03042926301",
        "name": "លន់ ឆឿន"
    },
    {
        "barcode": "171106362",
        "dpc": "03042927001",
        "name": "សាំង សែន"
    },
    {
        "barcode": "171106363",
        "dpc": "03042927101",
        "name": "គង់ រិទ្ធ"
    },
    {
        "barcode": "171106364",
        "dpc": "03042927601",
        "name": "ធឹង គឹមហេង ២"
    },
    {
        "barcode": "171106365",
        "dpc": "03042927801",
        "name": "ឈីត រដ្ឋា"
    },
    {
        "barcode": "171106366",
        "dpc": "03042927901",
        "name": "ហ៊ុយ កុសល់"
    },
    {
        "barcode": "171106367",
        "dpc": "03042928301",
        "name": "សុខ ប៊ុនដារ៉ា"
    },
    {
        "barcode": "171106368",
        "dpc": "03042928601",
        "name": "ជុំ រិទ្ធី"
    },
    {
        "barcode": "171106369",
        "dpc": "03042928801",
        "name": "តឹក សំណាក់ ៣"
    },
    {
        "barcode": "171106370",
        "dpc": "03042928901",
        "name": "សារ៉ង ម៉ាឡា"
    },
    {
        "barcode": "171106371",
        "dpc": "03042929301",
        "name": "ប៉េង វុត្ថា"
    },
    {
        "barcode": "171106372",
        "dpc": "03042929401",
        "name": "ម៉ី សយ"
    },
    {
        "barcode": "171106373",
        "dpc": "03042929501",
        "name": "ជូ អរុណ"
    },
    {
        "barcode": "171106374",
        "dpc": "03042929601",
        "name": "ជា រ៉ុង"
    },
    {
        "barcode": "171106375",
        "dpc": "03042929701",
        "name": "ទិត្យ រស្មី"
    },
    {
        "barcode": "171106376",
        "dpc": "03042929801",
        "name": "វ៉េង ហុក"
    },
    {
        "barcode": "171106377",
        "dpc": "03042930001",
        "name": "ជៀម សុខា ២"
    },
    {
        "barcode": "171106378",
        "dpc": "03042930101",
        "name": "លន់ ណាក់"
    },
    {
        "barcode": "171106379",
        "dpc": "03042931201",
        "name": "ស៊ុន សារុន"
    },
    {
        "barcode": "171106380",
        "dpc": "03042931301",
        "name": "ស៊ត ស៊ិន"
    },
    {
        "barcode": "171106381",
        "dpc": "03042931901",
        "name": "អ៊ុយ ថារិទ្ធ"
    },
    {
        "barcode": "171106382",
        "dpc": "03042932001",
        "name": "ខឹម យ៉ាន់"
    },
    {
        "barcode": "171106383",
        "dpc": "03042932201",
        "name": "នូវ ចាន់ដារ៉ា"
    },
    {
        "barcode": "171106384",
        "dpc": "03042932501",
        "name": "គុំ វិចិត្ត"
    },
    {
        "barcode": "171106385",
        "dpc": "03042932601",
        "name": "គូ សុងលី"
    },
    {
        "barcode": "171106386",
        "dpc": "03042932701",
        "name": "ស៊ូ សានិត"
    },
    {
        "barcode": "171106387",
        "dpc": "03042933001",
        "name": "គន់ សូផល្លី"
    },
    {
        "barcode": "171106388",
        "dpc": "03042933601",
        "name": "លេង ណែត"
    },
    {
        "barcode": "171106389",
        "dpc": "03042933701",
        "name": "សុខ យ៉ារ៉ា"
    },
    {
        "barcode": "171106390",
        "dpc": "03042933901",
        "name": "សោ ទ៉ុនលាង"
    },
    {
        "barcode": "171106391",
        "dpc": "03042934001",
        "name": "សួង សុគុណ"
    },
    {
        "barcode": "171106392",
        "dpc": "03042934101",
        "name": "ម៉េង វណ្ណៈ"
    },
    {
        "barcode": "171106393",
        "dpc": "03042934701",
        "name": "វុទ្ធ រដ្ឋា"
    },
    {
        "barcode": "171106394",
        "dpc": "03042934801",
        "name": "ហេង ចរិយា"
    },
    {
        "barcode": "171106395",
        "dpc": "03042934901",
        "name": "ឈុន សំបូររ័ត្ន"
    },
    {
        "barcode": "171106396",
        "dpc": "03042935301",
        "name": "យី សុងគី"
    },
    {
        "barcode": "171106397",
        "dpc": "03042935401",
        "name": "ញឹក ប៊ុនឈៀត"
    },
    {
        "barcode": "171106398",
        "dpc": "03042935601",
        "name": "ពិន សុគន្ធ"
    },
    {
        "barcode": "171106399",
        "dpc": "03042935701",
        "name": "ភូ សុខជា"
    },
    {
        "barcode": "171106400",
        "dpc": "03042936101",
        "name": "គី ផល"
    },
    {
        "barcode": "171106401",
        "dpc": "03042936201",
        "name": "ធួន រ៉ាវុធ"
    },
    {
        "barcode": "171106402",
        "dpc": "03042936901",
        "name": "ដែង ខាន់"
    },
    {
        "barcode": "171106403",
        "dpc": "03042937001",
        "name": "ទៀង សុង"
    },
    {
        "barcode": "171106404",
        "dpc": "03042938001",
        "name": "សក់ សំពឿន"
    },
    {
        "barcode": "171106405",
        "dpc": "03042938101",
        "name": "កាយ សុផល"
    },
    {
        "barcode": "171106406",
        "dpc": "03042938201",
        "name": "ជា ភួយ"
    },
    {
        "barcode": "171106407",
        "dpc": "03042938301",
        "name": "ជា ឈឿង"
    },
    {
        "barcode": "171106408",
        "dpc": "03042938401",
        "name": "ជា ខ"
    },
    {
        "barcode": "171106409",
        "dpc": "03042938501",
        "name": "ជា ហិញ"
    },
    {
        "barcode": "171106410",
        "dpc": "03042938601",
        "name": "ជា គង់"
    },
    {
        "barcode": "171106411",
        "dpc": "03042938801",
        "name": "ឈឹម ឈួង"
    },
    {
        "barcode": "171106412",
        "dpc": "03042938901",
        "name": "អ៊ិត បេង"
    },
    {
        "barcode": "171106413",
        "dpc": "03042939001",
        "name": "ជី គឹមហួយ"
    },
    {
        "barcode": "171106414",
        "dpc": "03042939101",
        "name": "អ៊ិត ពុំ"
    },
    {
        "barcode": "171106415",
        "dpc": "03042939201",
        "name": "មឿក សាមាជ"
    },
    {
        "barcode": "171106416",
        "dpc": "03042939301",
        "name": "ចែត ពាន"
    },
    {
        "barcode": "171106417",
        "dpc": "03042939401",
        "name": "ទៀង ប៊ុនទិត្យ"
    },
    {
        "barcode": "171106418",
        "dpc": "03042939501",
        "name": "អ៊ុច សន"
    },
    {
        "barcode": "171106419",
        "dpc": "03042939701",
        "name": "ឈួត សុខា"
    },
    {
        "barcode": "171106420",
        "dpc": "03042939801",
        "name": "ឈឿន សុវណ្ណា"
    },
    {
        "barcode": "171106421",
        "dpc": "03042939901",
        "name": "ផន ផាន"
    },
    {
        "barcode": "171106422",
        "dpc": "03042940001",
        "name": "ជ សេងហៀង"
    },
    {
        "barcode": "171106423",
        "dpc": "03042940101",
        "name": "ទូច វ៉ាន់ថន"
    },
    {
        "barcode": "171106424",
        "dpc": "03042940201",
        "name": "ម៉ៅ វិចិត្រ"
    },
    {
        "barcode": "171106425",
        "dpc": "03042940401",
        "name": "វ៉ាត់ វុត្ថា"
    },
    {
        "barcode": "171106426",
        "dpc": "03042940501",
        "name": "ប៊ួ ព្រីដា"
    },
    {
        "barcode": "171106427",
        "dpc": "03042940601",
        "name": "បៀ មុន្នី"
    },
    {
        "barcode": "171106428",
        "dpc": "03042940701",
        "name": "ងួន រី"
    },
    {
        "barcode": "171106429",
        "dpc": "03042940901",
        "name": "សាង ឡេង"
    },
    {
        "barcode": "171106430",
        "dpc": "03042941001",
        "name": "ជួន ស្រីនី"
    },
    {
        "barcode": "171106431",
        "dpc": "03042941101",
        "name": "អោក រៀត"
    },
    {
        "barcode": "171106432",
        "dpc": "03042941201",
        "name": "រុន រដ្ឋា"
    },
    {
        "barcode": "171106433",
        "dpc": "03042941301",
        "name": "សៀង សារិទ្ធ"
    },
    {
        "barcode": "171106434",
        "dpc": "03042941401",
        "name": "រុន ពិសិដ្ឋ"
    },
    {
        "barcode": "171106435",
        "dpc": "03042941601",
        "name": "វាត វិបុល"
    },
    {
        "barcode": "171106436",
        "dpc": "03042941701",
        "name": "ម៉ៅ ភីរិទ្ធ"
    },
    {
        "barcode": "171106437",
        "dpc": "03042941801",
        "name": "វ៉ាត សុខលី"
    },
    {
        "barcode": "171106438",
        "dpc": "03042941901",
        "name": "ញែម កឿន"
    },
    {
        "barcode": "171106439",
        "dpc": "03042942001",
        "name": "ម៉ៅ មិ"
    },
    {
        "barcode": "171106440",
        "dpc": "03042942101",
        "name": "យ៉េត ម៉ាន"
    },
    {
        "barcode": "171106441",
        "dpc": "03042942201",
        "name": "ចំរើន រិទ្ធិ"
    },
    {
        "barcode": "171106442",
        "dpc": "03042942301",
        "name": "ចាប យន"
    },
    {
        "barcode": "171106443",
        "dpc": "03042942401",
        "name": "វន ហឿត"
    },
    {
        "barcode": "171106444",
        "dpc": "03042942501",
        "name": "គឹម ហេង"
    },
    {
        "barcode": "171106445",
        "dpc": "03042942601",
        "name": "រ៉ុម វ៉ាត"
    },
    {
        "barcode": "171106446",
        "dpc": "03042942701",
        "name": "ផ្ទះ. ក. ភ."
    },
    {
        "barcode": "171106447",
        "dpc": "03042942801",
        "name": "ពៅ ញាណ"
    },
    {
        "barcode": "171106448",
        "dpc": "03042942901",
        "name": "ពៅ អុក"
    },
    {
        "barcode": "171106449",
        "dpc": "03042943001",
        "name": "ង៉ាម នងរដ្ឋា"
    },
    {
        "barcode": "171106450",
        "dpc": "03042943101",
        "name": "ឈឿន សុវណ្ណះ"
    },
    {
        "barcode": "171106451",
        "dpc": "03042943401",
        "name": "ចន្ទ័ សុជាតិ"
    },
    {
        "barcode": "171106452",
        "dpc": "03042943501",
        "name": "ហ៊ត បួ"
    },
    {
        "barcode": "171106453",
        "dpc": "03042943601",
        "name": "សុខ លីគា"
    },
    {
        "barcode": "171106454",
        "dpc": "03042943801",
        "name": "ឡុច វណ្ណថា"
    },
    {
        "barcode": "171106455",
        "dpc": "03042943901",
        "name": "គង់ បាន"
    },
    {
        "barcode": "171106456",
        "dpc": "03042944101",
        "name": "ស៊ុត សាវង"
    },
    {
        "barcode": "171106457",
        "dpc": "03042944201",
        "name": "ស៊ុត សាវ៉ៃ"
    },
    {
        "barcode": "171106458",
        "dpc": "03042944301",
        "name": "អ៊ឹម សុខធា"
    },
    {
        "barcode": "171106459",
        "dpc": "03042944401",
        "name": "ថន ថេរ"
    },
    {
        "barcode": "171106460",
        "dpc": "03042944501",
        "name": "មាស សុផាត"
    },
    {
        "barcode": "171106461",
        "dpc": "03042944601",
        "name": "ប្រាក់ កុសល់"
    },
    {
        "barcode": "171106462",
        "dpc": "03042944701",
        "name": "កន គឹមស៊"
    },
    {
        "barcode": "171106463",
        "dpc": "03042944801",
        "name": "មុំ សុវត្ថិ"
    },
    {
        "barcode": "171106464",
        "dpc": "03042944901",
        "name": "ពៅ សារឿន"
    },
    {
        "barcode": "171106465",
        "dpc": "03042945101",
        "name": "ទួត សាទុំ"
    },
    {
        "barcode": "171106466",
        "dpc": "03042945201",
        "name": "ចាន់ សុខុម"
    },
    {
        "barcode": "171106467",
        "dpc": "03042945401",
        "name": "អ៊ាម ងិ"
    },
    {
        "barcode": "171106468",
        "dpc": "03042945501",
        "name": "មៀន មៀង"
    },
    {
        "barcode": "171106469",
        "dpc": "03042945601",
        "name": "អ៊ុម សំ"
    },
    {
        "barcode": "171106470",
        "dpc": "03042945701",
        "name": "សាំង យឿន"
    },
    {
        "barcode": "171106471",
        "dpc": "03042945801",
        "name": "អោក បេងឈុន"
    },
    {
        "barcode": "171106472",
        "dpc": "03042945901",
        "name": "ភឿក បេងឈាន"
    },
    {
        "barcode": "171106473",
        "dpc": "03042946101",
        "name": "ថាវ សារឿន"
    },
    {
        "barcode": "171106474",
        "dpc": "03042946201",
        "name": "ម៉ាក យូរ៉ាត់"
    },
    {
        "barcode": "171106475",
        "dpc": "03042946301",
        "name": "អាង ចុងបរ"
    },
    {
        "barcode": "171106476",
        "dpc": "03042946401",
        "name": "ស៊ិន សុគន្ធ"
    },
    {
        "barcode": "171106477",
        "dpc": "03042946601",
        "name": "ទេព បញ្ញា"
    },
    {
        "barcode": "171106478",
        "dpc": "03042946701",
        "name": "ហ៊ុល បឋម"
    },
    {
        "barcode": "171106479",
        "dpc": "03042946801",
        "name": "វើន ធី"
    },
    {
        "barcode": "171106480",
        "dpc": "03042946901",
        "name": "ផុន រ៉ា"
    },
    {
        "barcode": "171106481",
        "dpc": "03042947101",
        "name": "អឿប ល្បត់"
    },
    {
        "barcode": "171106482",
        "dpc": "03042947401",
        "name": "ម្លិះ គឹមបេង"
    },
    {
        "barcode": "171106483",
        "dpc": "03042947601",
        "name": "ភិន សុថេត"
    },
    {
        "barcode": "171106484",
        "dpc": "03042947701",
        "name": "ស៊ាន ចាន់ធា"
    },
    {
        "barcode": "171106485",
        "dpc": "03042947901",
        "name": "ប៊ុត ចាន់សុថា"
    }
];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});