let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=

    [
        {
            "barcode": "171113962",
            "dpc": "03023211201",
            "name": "នួន សម្បត្តិ"
        },
        {
            "barcode": "171113963",
            "dpc": "03023206301",
            "name": "សេត សាឡែសវណ្ណា"
        },
        {
            "barcode": "171113964",
            "dpc": "03023214301",
            "name": "សើ វុទ្ធី"
        },
        {
            "barcode": "171113965",
            "dpc": "03023211301",
            "name": "ស៊ុន សុជាតិ"
        },
        {
            "barcode": "171113966",
            "dpc": "03023214401",
            "name": "ស៊ឹម សុវណ្ណ"
        },
        {
            "barcode": "171113967",
            "dpc": "03023219001",
            "name": "សូរ គន្ធា"
        },
        {
            "barcode": "171113968",
            "dpc": "03023203101",
            "name": "ឡឹក រិវឌ្ឍន៍"
        },
        {
            "barcode": "171113969",
            "dpc": "03023210901",
            "name": "ទេព តាល់"
        },
        {
            "barcode": "171113970",
            "dpc": "03023213701",
            "name": "ភីវ ផល្លី"
        },
        {
            "barcode": "171113971",
            "dpc": "03023205301",
            "name": "សុខ ចាន់ថន"
        },
        {
            "barcode": "171113972",
            "dpc": "03023205201",
            "name": "ហ៊ាន ស៊ុំ"
        },
        {
            "barcode": "171113973",
            "dpc": "03023204301",
            "name": "ហម  សំអាត"
        },
        {
            "barcode": "171113974",
            "dpc": "03023204101",
            "name": "ម៉ៅ ឡុង"
        },
        {
            "barcode": "171113975",
            "dpc": "03023204001",
            "name": "យ៉ាន់ សារឿន"
        },
        {
            "barcode": "171113976",
            "dpc": "03023204201",
            "name": "ពុធ ចំរើន"
        },
        {
            "barcode": "171113977",
            "dpc": "03023213201",
            "name": "ព្រំ ព្រឿត"
        },
        {
            "barcode": "171113978",
            "dpc": "03023213101",
            "name": "ឈឿន សាវ៉ន"
        },
        {
            "barcode": "171113979",
            "dpc": "03023213001",
            "name": "ញ៉ែម សុវណ្ណ"
        },
        {
            "barcode": "171113980",
            "dpc": "03023217301",
            "name": "រស់ វុទ្ធី"
        },
        {
            "barcode": "171113981",
            "dpc": "03023217401",
            "name": "ខុន នារី"
        },
        {
            "barcode": "171113982",
            "dpc": "03023217501",
            "name": "ឆៃ ដារ៉ា"
        },
        {
            "barcode": "171113983",
            "dpc": "03023219501",
            "name": "សេង ហ៊ួត"
        },
        {
            "barcode": "171113984",
            "dpc": "03023207701",
            "name": "សាំង ប៊ុនលី"
        },
        {
            "barcode": "171113985",
            "dpc": "03023207601",
            "name": "ឡាយ នី"
        },
        {
            "barcode": "171113986",
            "dpc": "03023220701",
            "name": "យ៉ាន់ ឌឿន"
        },
        {
            "barcode": "171113987",
            "dpc": "03023219301",
            "name": "ផេង សិទ្ធ"
        },
        {
            "barcode": "171113988",
            "dpc": "03023210601",
            "name": "ម៉ា ប៉ូ"
        },
        {
            "barcode": "171113989",
            "dpc": "03023205701",
            "name": "ស៊ិន សុផល"
        },
        {
            "barcode": "171113990",
            "dpc": "03023205601",
            "name": "ចែ វណ្ណី"
        },
        {
            "barcode": "171113991",
            "dpc": "03023205401",
            "name": "ស៊ិន សុគី"
        },
        {
            "barcode": "171113992",
            "dpc": "03023214701",
            "name": "ភួយ សុណារ័ត្ន"
        },
        {
            "barcode": "171113993",
            "dpc": "03023205501",
            "name": "យឹម សាមឿន"
        },
        {
            "barcode": "171113994",
            "dpc": "03023205801",
            "name": "សួន គួន"
        },
        {
            "barcode": "171113995",
            "dpc": "03023205901",
            "name": "ពេជ្រ វ៉ាង"
        },
        {
            "barcode": "171113996",
            "dpc": "03023202801",
            "name": "ឡាយ បូរ៉ាវី"
        },
        {
            "barcode": "171113997",
            "dpc": "03023217701",
            "name": "យឹម ឌឿន"
        },
        {
            "barcode": "171113998",
            "dpc": "03023218201",
            "name": "ហ៊ន សុខា"
        },
        {
            "barcode": "171113999",
            "dpc": "03023218401",
            "name": "សំ សៀន"
        },
        {
            "barcode": "171114000",
            "dpc": "03023218601",
            "name": "ឡុង ដារ៉ា"
        },
        {
            "barcode": "171114001",
            "dpc": "03023218701",
            "name": "ជួន សុផល"
        },
        {
            "barcode": "171114002",
            "dpc": "03023218801",
            "name": "ឈៀន ឈឹម"
        },
        {
            "barcode": "171114003",
            "dpc": "03023219101",
            "name": "តឹក ស៊ីណា"
        },
        {
            "barcode": "171114004",
            "dpc": "03023202901",
            "name": "អ៊ុយ វណ្ណៈ"
        },
        {
            "barcode": "171114005",
            "dpc": "03023210501",
            "name": "ឈ លីហ៊ាង"
        },
        {
            "barcode": "171114006",
            "dpc": "03023214001",
            "name": "សឿន សីម៉ា"
        },
        {
            "barcode": "171114007",
            "dpc": "03023214201",
            "name": "ហ៊ួត ស៊ិន"
        },
        {
            "barcode": "171114008",
            "dpc": "03023213601",
            "name": "ហ៊ួ យ៉ាង"
        },
        {
            "barcode": "171114009",
            "dpc": "03023219601",
            "name": "ជួង  សុខុម"
        },
        {
            "barcode": "171114010",
            "dpc": "03023218501",
            "name": "នី វុទ្ធី"
        },
        {
            "barcode": "171114011",
            "dpc": "03023218001",
            "name": "នូ វី"
        },
        {
            "barcode": "171114012",
            "dpc": "03023220501",
            "name": "អូន គន្ធា"
        },
        {
            "barcode": "171114013",
            "dpc": "03023220401",
            "name": "កែវ សុខុម"
        },
        {
            "barcode": "171114014",
            "dpc": "03023220301",
            "name": "ពេជ្រ ស្រីអូន"
        },
        {
            "barcode": "171114015",
            "dpc": "03023220201",
            "name": "ជា គី"
        },
        {
            "barcode": "171114016",
            "dpc": "03023220101",
            "name": "សាំង សៀប"
        },
        {
            "barcode": "171114017",
            "dpc": "03023220001",
            "name": "ស៊ឹម សុខចំរើន"
        },
        {
            "barcode": "171114018",
            "dpc": "03023219901",
            "name": "កែវ ស្រីទូច"
        },
        {
            "barcode": "171114019",
            "dpc": "03023219801",
            "name": "មូល ផល្លា"
        },
        {
            "barcode": "171114020",
            "dpc": "03023206101",
            "name": "ប៉េង សុខេង"
        },
        {
            "barcode": "171114021",
            "dpc": "03023200401",
            "name": "អេង សុធីរិទ្ធ"
        },
        {
            "barcode": "171114022",
            "dpc": "03023206001",
            "name": "ឆេង ឆាន់"
        },
        {
            "barcode": "171114023",
            "dpc": "03023218901",
            "name": "ហុង គឹមឡុង"
        },
        {
            "barcode": "171114024",
            "dpc": "03023201901",
            "name": "អ៊ី សាមិត្ត"
        },
        {
            "barcode": "171114025",
            "dpc": "03023202001",
            "name": "ផល សុភឿត"
        },
        {
            "barcode": "171114026",
            "dpc": "03023210201",
            "name": "ទូច វែង"
        },
        {
            "barcode": "171114027",
            "dpc": "03023210101",
            "name": "អ៊ី សាវ៉ើន"
        },
        {
            "barcode": "171114028",
            "dpc": "03023210001",
            "name": "គឹម  ទ្រី"
        },
        {
            "barcode": "171114029",
            "dpc": "03023209901",
            "name": "សុង សុខា"
        },
        {
            "barcode": "171114030",
            "dpc": "03023209601",
            "name": "សួន សុភ័ក្រ"
        },
        {
            "barcode": "171114031",
            "dpc": "03023205101",
            "name": "ទេព វល័ក្ខ"
        },
        {
            "barcode": "171114032",
            "dpc": "03023209101",
            "name": "សាម ឆាង"
        },
        {
            "barcode": "171114033",
            "dpc": "03023209201",
            "name": "បន៉ា  សុខ"
        },
        {
            "barcode": "171114034",
            "dpc": "03023201101",
            "name": "លី  គឹមបឿន"
        },
        {
            "barcode": "171114035",
            "dpc": "03023224501",
            "name": "អ៊ាង   អ៊ី"
        },
        {
            "barcode": "171114036",
            "dpc": "03023201401",
            "name": "ខាំ  ស្រស់"
        },
        {
            "barcode": "171114037",
            "dpc": "03023201601",
            "name": "យាយ ឡៃ"
        },
        {
            "barcode": "171114038",
            "dpc": "03023202601",
            "name": "សួន ស្រីល័ក្ខ"
        },
        {
            "barcode": "171114039",
            "dpc": "03023208501",
            "name": "ខឹម ពៅ"
        },
        {
            "barcode": "171114040",
            "dpc": "03023208401",
            "name": "ឡាច សម្ជស្ស"
        },
        {
            "barcode": "171114041",
            "dpc": "03023213401",
            "name": "សេង ណុប"
        },
        {
            "barcode": "171114042",
            "dpc": "03023209001",
            "name": "ម៉ន សុភាព"
        },
        {
            "barcode": "171114043",
            "dpc": "03023209301",
            "name": "ស៊ន សាវី"
        },
        {
            "barcode": "171114044",
            "dpc": "03023204501",
            "name": "ឈិត សុខ"
        },
        {
            "barcode": "171114045",
            "dpc": "03023211501",
            "name": "ណូត យ៉ារី"
        },
        {
            "barcode": "171114046",
            "dpc": "03023202501",
            "name": "គង់ សុផល"
        },
        {
            "barcode": "171114047",
            "dpc": "03023201201",
            "name": "ទូច យ៉ុង"
        },
        {
            "barcode": "171114048",
            "dpc": "03023201301",
            "name": "ហៀក សឿង"
        },
        {
            "barcode": "171114049",
            "dpc": "03023220901",
            "name": "អ៊ិត វុទ្ធីរិទ្ធ"
        },
        {
            "barcode": "171114050",
            "dpc": "03023201001",
            "name": "ពិន ថាវី"
        },
        {
            "barcode": "171114051",
            "dpc": "03023200801",
            "name": "សុខ សាមន្នី៥"
        },
        {
            "barcode": "171114052",
            "dpc": "03023200701",
            "name": "សុខ សាមន្នី៦"
        },
        {
            "barcode": "171114053",
            "dpc": "03023216901",
            "name": "សុច សឺត"
        },
        {
            "barcode": "171114054",
            "dpc": "03023216801",
            "name": "ស្រី នីម"
        },
        {
            "barcode": "171114055",
            "dpc": "03023216701",
            "name": "លឿង ឡេង"
        },
        {
            "barcode": "171114056",
            "dpc": "03023216601",
            "name": "សាំង ចន្ធី"
        },
        {
            "barcode": "171114057",
            "dpc": "03023216501",
            "name": "សេង តូយ"
        },
        {
            "barcode": "171114058",
            "dpc": "03023216201",
            "name": "ឌុល ជា"
        },
        {
            "barcode": "171114059",
            "dpc": "03023215901",
            "name": "ហយ មនោ"
        },
        {
            "barcode": "171114060",
            "dpc": "03023215701",
            "name": "គី​ ឆី"
        },
        {
            "barcode": "171114061",
            "dpc": "03023212301",
            "name": "តឹក លន"
        },
        {
            "barcode": "171114062",
            "dpc": "03023212201",
            "name": "គី ពេជ្រ"
        },
        {
            "barcode": "171114063",
            "dpc": "03023212101",
            "name": "ខន ខេមរិទ្ធ"
        },
        {
            "barcode": "171114064",
            "dpc": "03023216401",
            "name": "មិត្ត សុភាព"
        },
        {
            "barcode": "171114065",
            "dpc": "03023212501",
            "name": "កែវ អ៊ីម"
        },
        {
            "barcode": "171114066",
            "dpc": "03023203701",
            "name": "វ៉ាត សាវ៉ុន"
        },
        {
            "barcode": "171114067",
            "dpc": "03023212601",
            "name": "យ៉ាង កាំងស្រ៊ុន"
        },
        {
            "barcode": "171114068",
            "dpc": "03023212401",
            "name": "គឹម ភារី"
        },
        {
            "barcode": "171114069",
            "dpc": "03023203801",
            "name": "ឡុង គឹមងួន"
        },
        {
            "barcode": "171114070",
            "dpc": "03023203901",
            "name": "វេង  លីម"
        },
        {
            "barcode": "171114071",
            "dpc": "03023200101",
            "name": "សោ ស្រីណុច"
        },
        {
            "barcode": "171114072",
            "dpc": "03023210801",
            "name": "ឆាយ សារិ"
        },
        {
            "barcode": "171114073",
            "dpc": "03023200201",
            "name": "គ្រុយ  ប៉ាមុន្នី"
        },
        {
            "barcode": "171114074",
            "dpc": "03023200301",
            "name": "ប៉ែន  ហាប់"
        },
        {
            "barcode": "171114075",
            "dpc": "03023200501",
            "name": "សំ  សុភ័ក្រ"
        },
        {
            "barcode": "171114076",
            "dpc": "03023200901",
            "name": "ប៉ែន  ថាញ់"
        },
        {
            "barcode": "171114077",
            "dpc": "03023201501",
            "name": "ហៀក  កែម"
        },
        {
            "barcode": "171114078",
            "dpc": "03023201701",
            "name": "ព្រាប  យ៉ុន"
        },
        {
            "barcode": "171114079",
            "dpc": "03023202101",
            "name": "វ៉ាន  បណ្តែត"
        },
        {
            "barcode": "171114080",
            "dpc": "03023202201",
            "name": "ឆៃ  ចិន្តា"
        },
        {
            "barcode": "171114081",
            "dpc": "03023202301",
            "name": "ខឹម  លក្ខណា"
        },
        {
            "barcode": "171114082",
            "dpc": "03023202401",
            "name": "លុក  វ៉ន"
        },
        {
            "barcode": "171114083",
            "dpc": "03023202701",
            "name": "សៅ  ភីរ៉ា"
        },
        {
            "barcode": "171114084",
            "dpc": "03023203201",
            "name": "កែវ សំបូរ"
        },
        {
            "barcode": "171114085",
            "dpc": "03023203301",
            "name": "ស្មាន  សាន់"
        },
        {
            "barcode": "171114086",
            "dpc": "03023203401",
            "name": "ណុះ  គុំម៉ារី"
        },
        {
            "barcode": "171114087",
            "dpc": "03023204401",
            "name": "ឌី  វណ្ណដេត"
        },
        {
            "barcode": "171114088",
            "dpc": "03023204701",
            "name": "សួន  ផល្លី"
        },
        {
            "barcode": "171114089",
            "dpc": "03023204801",
            "name": "លី  គីនឃុន"
        },
        {
            "barcode": "171114090",
            "dpc": "03023204901",
            "name": "វ៉ាន់  ចាន់"
        },
        {
            "barcode": "171114091",
            "dpc": "03023205001",
            "name": "ជៀម  មន្ថា"
        },
        {
            "barcode": "171114092",
            "dpc": "03023206201",
            "name": "ម៉េត  សាឡេះ"
        },
        {
            "barcode": "171114093",
            "dpc": "03023206401",
            "name": "ឆាន់  រិទ្ធី"
        },
        {
            "barcode": "171114094",
            "dpc": "03023206501",
            "name": "ប៉ែន  អឿន"
        },
        {
            "barcode": "171114095",
            "dpc": "03023206601",
            "name": "ឡាយ  លួម"
        },
        {
            "barcode": "171114096",
            "dpc": "03023206701",
            "name": "ជុំ  គីមសេង"
        },
        {
            "barcode": "171114097",
            "dpc": "03023206801",
            "name": "ខន  មុនី"
        },
        {
            "barcode": "171114098",
            "dpc": "03023206901",
            "name": "ជិន ប៊ុនធឿន"
        },
        {
            "barcode": "171114099",
            "dpc": "03023207201",
            "name": "ង៉ែត  ចិត្រា"
        },
        {
            "barcode": "171114100",
            "dpc": "03023207301",
            "name": "ឡាញ់  បូរ៉ា"
        },
        {
            "barcode": "171114101",
            "dpc": "03023207401",
            "name": "ភួ  វាសនា"
        },
        {
            "barcode": "171114102",
            "dpc": "03023207501",
            "name": "វណ្ណ តូម៉ា"
        },
        {
            "barcode": "171114103",
            "dpc": "03023207801",
            "name": "ខឹម ចន្ទរដ្ឋា"
        },
        {
            "barcode": "171114104",
            "dpc": "03023208001",
            "name": "នឿន  សាវឿន"
        },
        {
            "barcode": "171114105",
            "dpc": "03023208101",
            "name": "តាំង ហេងលីី"
        },
        {
            "barcode": "171114106",
            "dpc": "03023208201",
            "name": "បនា  សាវឿត"
        },
        {
            "barcode": "171114107",
            "dpc": "03023208301",
            "name": "កែវ  សំណាង"
        },
        {
            "barcode": "171114108",
            "dpc": "03023208601",
            "name": "នុត  យឿត"
        },
        {
            "barcode": "171114109",
            "dpc": "03023208701",
            "name": "ឈិត  សំអុល"
        },
        {
            "barcode": "171114110",
            "dpc": "03023208801",
            "name": "ហ៊ុល  ឆាង"
        },
        {
            "barcode": "171114111",
            "dpc": "03023209501",
            "name": "ទូច  សំអុល"
        },
        {
            "barcode": "171114112",
            "dpc": "03023209801",
            "name": "សែម  រិន"
        },
        {
            "barcode": "171114113",
            "dpc": "03023210301",
            "name": "អឿ  ប៉ាន"
        },
        {
            "barcode": "171114114",
            "dpc": "03023210401",
            "name": "អ៊ា ចាន់នឿន"
        },
        {
            "barcode": "171114115",
            "dpc": "03023210701",
            "name": "ដែង  វិជ្ជា"
        },
        {
            "barcode": "171114116",
            "dpc": "03023211401",
            "name": "ឡាយ ប៊ុនហុង"
        },
        {
            "barcode": "171114117",
            "dpc": "03023211601",
            "name": "យ៉ើ ម៉ូហាំម៉ាតតៅ់ហ្វិច"
        },
        {
            "barcode": "171114118",
            "dpc": "03023211701",
            "name": "ចឹក ធី"
        },
        {
            "barcode": "171114119",
            "dpc": "03023211801",
            "name": "ហ្វាល់ ម៉ាលី"
        },
        {
            "barcode": "171114120",
            "dpc": "03023212001",
            "name": "ឆុល សុភ័ណ"
        },
        {
            "barcode": "171114121",
            "dpc": "03023212801",
            "name": "យ៉ាំ សុផាត"
        },
        {
            "barcode": "171114122",
            "dpc": "03023212901",
            "name": "ឈុន  អាង"
        },
        {
            "barcode": "171114123",
            "dpc": "03023213301",
            "name": "សាឡេះ  រូហ្វីី"
        },
        {
            "barcode": "171114124",
            "dpc": "03023213501",
            "name": "វ៉ាន់  ខេម៉ា"
        },
        {
            "barcode": "171114125",
            "dpc": "03023213901",
            "name": "ឡេង  សុខា"
        },
        {
            "barcode": "171114126",
            "dpc": "03023214501",
            "name": "រឿន  ទីវន្ត័"
        },
        {
            "barcode": "171114127",
            "dpc": "03023214801",
            "name": "ហ៊ុត  ឆៃ"
        },
        {
            "barcode": "171114128",
            "dpc": "03023214901",
            "name": "ភោគ  ចាន់លា"
        },
        {
            "barcode": "171114129",
            "dpc": "03023215001",
            "name": "សាញ់  វី"
        },
        {
            "barcode": "171114130",
            "dpc": "03023215101",
            "name": "ជៀប  សាវឿត"
        },
        {
            "barcode": "171114131",
            "dpc": "03023215201",
            "name": "ហៀក ឆឹង"
        },
        {
            "barcode": "171114132",
            "dpc": "03023215301",
            "name": "ហោ  ស៊ីណា"
        },
        {
            "barcode": "171114133",
            "dpc": "03023215401",
            "name": "ហោ  មុំ"
        },
        {
            "barcode": "171114134",
            "dpc": "03023215501",
            "name": "ហោ  ផារិទ្ធ"
        },
        {
            "barcode": "171114135",
            "dpc": "03023215601",
            "name": "ចាន់  រ៉ុង"
        },
        {
            "barcode": "171114136",
            "dpc": "03023215801",
            "name": "ទុយ  ប៊ុនរត្ន័"
        },
        {
            "barcode": "171114137",
            "dpc": "03023216001",
            "name": "សង  ចន្ថា"
        },
        {
            "barcode": "171114138",
            "dpc": "03023216101",
            "name": "ហែម  ចន្ថា"
        },
        {
            "barcode": "171114139",
            "dpc": "03023216301",
            "name": "សុទ្ធ  សុវណ្ណាវី"
        },
        {
            "barcode": "171114140",
            "dpc": "03023217001",
            "name": "រស់  ញ៉ិល"
        },
        {
            "barcode": "171114141",
            "dpc": "03023217101",
            "name": "និល  ហ៊ីង"
        },
        {
            "barcode": "171114142",
            "dpc": "03023217201",
            "name": "រ៉ែម  វីរៈ"
        },
        {
            "barcode": "171114143",
            "dpc": "03023217801",
            "name": "អ៊ុន  សម្បត្តិ"
        },
        {
            "barcode": "171114144",
            "dpc": "03023217901",
            "name": "ជុំ  រតនា"
        },
        {
            "barcode": "171114145",
            "dpc": "03023218101",
            "name": "ហ៊ាន  សុន"
        },
        {
            "barcode": "171114146",
            "dpc": "03023218301",
            "name": "ឃឿង  សាវី"
        },
        {
            "barcode": "171114147",
            "dpc": "03023219201",
            "name": "គីម  ចាន់ឡាយ"
        },
        {
            "barcode": "171114148",
            "dpc": "03023219401",
            "name": "ហេង  ហាច"
        },
        {
            "barcode": "171114149",
            "dpc": "03023219701",
            "name": "សួន  សាវ៉ាង"
        },
        {
            "barcode": "171114150",
            "dpc": "03023220801",
            "name": "អ៊ឹង   លីហេង"
        },
        {
            "barcode": "171114151",
            "dpc": "03023221001",
            "name": "ទឹម  សុធា"
        },
        {
            "barcode": "171114152",
            "dpc": "03023221101",
            "name": "សោម  នឿន"
        },
        {
            "barcode": "171114153",
            "dpc": "03023221201",
            "name": "ង៉ាក់  ធន"
        },
        {
            "barcode": "171114154",
            "dpc": "03023221301",
            "name": "ធី"
        },
        {
            "barcode": "171114155",
            "dpc": "03023221401",
            "name": "សាន  សំវី"
        },
        {
            "barcode": "171114156",
            "dpc": "03023221501",
            "name": "ឃឹម ស៊ីម"
        },
        {
            "barcode": "171114157",
            "dpc": "03023221601",
            "name": "ឃឹម  លាង"
        },
        {
            "barcode": "171114158",
            "dpc": "03023221701",
            "name": "ទ្រីវ  ធី"
        },
        {
            "barcode": "171114159",
            "dpc": "03023221801",
            "name": "ជា  ប៊ុនថា"
        },
        {
            "barcode": "171114160",
            "dpc": "03023221901",
            "name": "ពេញ  សំបូរ"
        },
        {
            "barcode": "171114161",
            "dpc": "03023222001",
            "name": "សាលាបឋមសិក្សាអណ្តូងចេញ"
        },
        {
            "barcode": "171114162",
            "dpc": "03023222101",
            "name": "ទេស  សាវុធធីយ៉ា"
        },
        {
            "barcode": "171114163",
            "dpc": "03023222201",
            "name": "ទេស រតនា"
        },
        {
            "barcode": "171114164",
            "dpc": "03023222301",
            "name": "ទេស  សុរតនី"
        },
        {
            "barcode": "171114165",
            "dpc": "03023222401",
            "name": "ឆន  សាវ៉ន"
        },
        {
            "barcode": "171114166",
            "dpc": "03023222501",
            "name": "យូ  ហា"
        },
        {
            "barcode": "171114167",
            "dpc": "03023222601",
            "name": "ប៊ុន  សច្ចរ៉ា"
        },
        {
            "barcode": "171114168",
            "dpc": "03023222701",
            "name": "ពេជ្រ សុផារី"
        },
        {
            "barcode": "171114169",
            "dpc": "03023222801",
            "name": "គង់  ស្រស់"
        },
        {
            "barcode": "171114170",
            "dpc": "03023222901",
            "name": "ឈុន  សេង"
        },
        {
            "barcode": "171114171",
            "dpc": "03023223001",
            "name": "ហេង  ប៊ុនសួរ"
        },
        {
            "barcode": "171114172",
            "dpc": "03023223101",
            "name": "ឡេង  ស៊្រុន"
        },
        {
            "barcode": "171114173",
            "dpc": "03023223201",
            "name": "ឡុច   សន្តិករ"
        },
        {
            "barcode": "171114174",
            "dpc": "03023223301",
            "name": "មួយ  គក់"
        },
        {
            "barcode": "171114175",
            "dpc": "03023223401",
            "name": "ខាវ  នៅ"
        },
        {
            "barcode": "171114176",
            "dpc": "03023223501",
            "name": "ប៉ោ  រ៉េក្រិន្ត"
        },
        {
            "barcode": "171114177",
            "dpc": "03023223601",
            "name": "លឹម ឆាយងួន"
        },
        {
            "barcode": "171114178",
            "dpc": "03023223701",
            "name": "កែវ  គង់"
        },
        {
            "barcode": "171114179",
            "dpc": "03023223901",
            "name": "កែវ  ចន្ថា"
        },
        {
            "barcode": "171114180",
            "dpc": "03023224001",
            "name": "រិន"
        },
        {
            "barcode": "171114181",
            "dpc": "03023224101",
            "name": "នៅ  ហ៊ីម"
        },
        {
            "barcode": "171114182",
            "dpc": "03023224201",
            "name": "ជ័យ  ដួងសិលា"
        },
        {
            "barcode": "171114183",
            "dpc": "03023224301",
            "name": "ជិន  សឿម"
        },
        {
            "barcode": "171114184",
            "dpc": "03023224401",
            "name": "ផុក  សុក"
        },
        {
            "barcode": "171114185",
            "dpc": "03023224601",
            "name": "តុង  ហេង"
        },
        {
            "barcode": "171114186",
            "dpc": "03023224701",
            "name": "ក្រិន  ម៉ូវ"
        },
        {
            "barcode": "171114187",
            "dpc": "03023224801",
            "name": "ងួន  សុបញ្ញា"
        },
        {
            "barcode": "171114188",
            "dpc": "03023224901",
            "name": "អ៊ុប  ភីឡាយ"
        },
        {
            "barcode": "171114189",
            "dpc": "03023225001",
            "name": "ស៊ិន  ង៉ុន"
        },
        {
            "barcode": "171114190",
            "dpc": "03023225101",
            "name": "ភួង  សេងហាន"
        },
        {
            "barcode": "171114191",
            "dpc": "03023225201",
            "name": "មុំ  ដេត"
        },
        {
            "barcode": "171114192",
            "dpc": "03023225401",
            "name": "ស៊ុន  សុវិជ្ជា"
        },
        {
            "barcode": "171114193",
            "dpc": "03023225501",
            "name": "ជុំ  ប៊ុនធឿន"
        },
        {
            "barcode": "171114194",
            "dpc": "03023225601",
            "name": "ផេង  កុសល់"
        },
        {
            "barcode": "171114195",
            "dpc": "03023225701",
            "name": "ហ៊ឺ  ហាន"
        },
        {
            "barcode": "171114196",
            "dpc": "03023225801",
            "name": "គង់  អៅ"
        },
        {
            "barcode": "171114197",
            "dpc": "03023225901",
            "name": "ផ្ទះ. ក. ភ.ពពាលខែ ឃ.ជ្រៃ"
        },
        {
            "barcode": "171114198",
            "dpc": "03023226001",
            "name": "ស៊ុំ  សុខុម"
        },
        {
            "barcode": "171114199",
            "dpc": "03023226101",
            "name": "ជីវ  រ៉ា"
        },
        {
            "barcode": "171114200",
            "dpc": "03023226301",
            "name": "ឃឹម  ប៊ុនហៀក"
        },
        {
            "barcode": "171114201",
            "dpc": "03023226401",
            "name": "ហុង  តូម៉ា"
        },
        {
            "barcode": "171114202",
            "dpc": "03023226501",
            "name": "យីម   យ៉ុង"
        },
        {
            "barcode": "171114203",
            "dpc": "03023226601",
            "name": "ឆេង  គីម"
        },
        {
            "barcode": "171114204",
            "dpc": "03023226701",
            "name": "ជា  ឆាយបូរណ៍"
        },
        {
            "barcode": "171114205",
            "dpc": "03023226801",
            "name": "ហុង  សុភី"
        },
        {
            "barcode": "171114206",
            "dpc": "03023226901",
            "name": "ម៉ៅ សុគន្ឌឌី"
        },
        {
            "barcode": "171114207",
            "dpc": "03023227101",
            "name": "សាយ   ស៊ីវហេង"
        },
        {
            "barcode": "171114208",
            "dpc": "03023227301",
            "name": "ស្វាយ  សែត"
        },
        {
            "barcode": "171114209",
            "dpc": "03023227401",
            "name": "ច្រុច   អ៊ូ"
        },
        {
            "barcode": "171114210",
            "dpc": "03023227601",
            "name": "ម៉ៅ ថេត"
        },
        {
            "barcode": "171114211",
            "dpc": "03023227701",
            "name": "ឈាម លីន"
        },
        {
            "barcode": "171114212",
            "dpc": "03023227801",
            "name": "ឡេង ចំរើន"
        },
        {
            "barcode": "171114213",
            "dpc": "03023227901",
            "name": "រឿន ដុងប៉ា"
        },
        {
            "barcode": "171114214",
            "dpc": "03023228001",
            "name": "ឈួម ហៀង"
        },
        {
            "barcode": "171114215",
            "dpc": "03023228201",
            "name": "ប្រាក់ ឆុំ"
        },
        {
            "barcode": "171114216",
            "dpc": "03023228301",
            "name": "ហ៊ុន គឹមសួក៍"
        },
        {
            "barcode": "171114217",
            "dpc": "03023228501",
            "name": "សេង ពេក"
        },
        {
            "barcode": "171114218",
            "dpc": "03023228601",
            "name": "ឃឺ សុផល"
        },
        {
            "barcode": "171114219",
            "dpc": "03023228701",
            "name": "ឆម អឿម"
        },
        {
            "barcode": "171114220",
            "dpc": "03023228801",
            "name": "លឹម ឆាយងួន"
        },
        {
            "barcode": "171114221",
            "dpc": "03023228901",
            "name": "គង់ អ៊ឺន"
        },
        {
            "barcode": "171114222",
            "dpc": "03023229001",
            "name": "អឿន សុភក្តិ"
        },
        {
            "barcode": "171114223",
            "dpc": "03023229101",
            "name": "អឿន សុភាព"
        },
        {
            "barcode": "171114224",
            "dpc": "03023229201",
            "name": "ស៊ឹម សាវិត"
        },
        {
            "barcode": "171114225",
            "dpc": "03023229301",
            "name": "ភុន ចាន់ណា"
        },
        {
            "barcode": "171114226",
            "dpc": "03023229401",
            "name": "ភុន កុសល់"
        },
        {
            "barcode": "171114227",
            "dpc": "03023229501",
            "name": "អ៊ុំ ឈឿត"
        },
        {
            "barcode": "171114228",
            "dpc": "03023229601",
            "name": "អ៊ិន ស៊ីណាត"
        },
        {
            "barcode": "171114229",
            "dpc": "03023229701",
            "name": "សួស ឃឿត"
        },
        {
            "barcode": "171114230",
            "dpc": "03023229801",
            "name": "ឃី សុខុម"
        },
        {
            "barcode": "171114231",
            "dpc": "03023229901",
            "name": "ហេង សាមន្នី"
        },
        {
            "barcode": "171114232",
            "dpc": "03023230001",
            "name": "ស៊ុយ ផេង"
        },
        {
            "barcode": "171114233",
            "dpc": "03023230101",
            "name": "ហ៊ាង នី"
        },
        {
            "barcode": "171114234",
            "dpc": "03023230201",
            "name": "នី សេដ្ឋា"
        },
        {
            "barcode": "171114235",
            "dpc": "03023230301",
            "name": "ឡុន ស៊ីណាត"
        },
        {
            "barcode": "171114236",
            "dpc": "03023230401",
            "name": "ប៉ែន សំអុល"
        },
        {
            "barcode": "171114237",
            "dpc": "03023230501",
            "name": "ង៉ិន ព្រឿន"
        },
        {
            "barcode": "171114238",
            "dpc": "03023230601",
            "name": "ងួន ភីរុណ"
        },
        {
            "barcode": "171114239",
            "dpc": "03023230701",
            "name": "ថ្លាង ផល្គុន"
        },
        {
            "barcode": "171114240",
            "dpc": "03023230801",
            "name": "លឹម សុខហេង"
        },
        {
            "barcode": "171114241",
            "dpc": "03023230901",
            "name": "ឈាន រតនៈ"
        },
        {
            "barcode": "171114242",
            "dpc": "03023231001",
            "name": "ងួន ភារម្យ"
        },
        {
            "barcode": "171114243",
            "dpc": "03023231101",
            "name": "សុង ហេង១"
        },
        {
            "barcode": "171114244",
            "dpc": "03023231201",
            "name": "សុង ហេង២"
        },
        {
            "barcode": "171114245",
            "dpc": "03023231301",
            "name": "យ៉ាន់ ទី"
        },
        {
            "barcode": "171114246",
            "dpc": "03023231501",
            "name": "គង់ យ៉ុម២"
        },
        {
            "barcode": "171114247",
            "dpc": "03023231601",
            "name": "យ៉ាន អង"
        },
        {
            "barcode": "171114248",
            "dpc": "03023231701",
            "name": "ព្រំ សួម"
        },
        {
            "barcode": "171114249",
            "dpc": "03023231801",
            "name": "ចិន សុវណ្ណដា"
        },
        {
            "barcode": "171114250",
            "dpc": "03023231901",
            "name": "គង់ យ៉ាន"
        },
        {
            "barcode": "171114251",
            "dpc": "03023232001",
            "name": "សឿត ហូយ"
        },
        {
            "barcode": "171114252",
            "dpc": "03023232101",
            "name": "សឿត ពិសាក់"
        },
        {
            "barcode": "171114253",
            "dpc": "03023232201",
            "name": "ប្រិម ផល្លី២៦"
        },
        {
            "barcode": "171114254",
            "dpc": "03023232301",
            "name": "សឿន ពិសិទ្ធ"
        },
        {
            "barcode": "171114255",
            "dpc": "03023232401",
            "name": "ឈុន ប៊ុនរក្ស"
        },
        {
            "barcode": "171114256",
            "dpc": "03023232501",
            "name": "ជា ចន្ទ្រា"
        },
        {
            "barcode": "171114257",
            "dpc": "03023232601",
            "name": "ស៊ិន សុមេធា១"
        },
        {
            "barcode": "171114258",
            "dpc": "03023232701",
            "name": "ស៊ិន សាវុធ"
        },
        {
            "barcode": "171114259",
            "dpc": "03023232801",
            "name": "ស៊ិន សុមេធា២"
        },
        {
            "barcode": "171114260",
            "dpc": "03023232901",
            "name": "កា ប៉ូឡូ"
        },
        {
            "barcode": "171114261",
            "dpc": "03023233001",
            "name": "លី ម៉ៃ"
        },
        {
            "barcode": "171114262",
            "dpc": "03023233101",
            "name": "ស៊ុត  ពីង"
        },
        {
            "barcode": "171114263",
            "dpc": "03023233201",
            "name": "វ៉ាន់ ឡូវ"
        },
        {
            "barcode": "171114264",
            "dpc": "03023233301",
            "name": "រឿង ភីរុណ"
        },
        {
            "barcode": "171114265",
            "dpc": "03023233501",
            "name": "ស៊ូរ បូរ"
        },
        {
            "barcode": "171114266",
            "dpc": "03023233601",
            "name": "មាង យ៉ុង"
        },
        {
            "barcode": "171114267",
            "dpc": "03023233701",
            "name": "មាស ទី"
        },
        {
            "barcode": "171114268",
            "dpc": "03023233801",
            "name": "ហ៊ូ ង៉ុយ"
        },
        {
            "barcode": "171114269",
            "dpc": "03023233901",
            "name": "ស ហ៊ួន"
        },
        {
            "barcode": "171114270",
            "dpc": "03023234001",
            "name": "ឈួង សាន់"
        },
        {
            "barcode": "171114271",
            "dpc": "03023234101",
            "name": "អីវ វ៉ៅ"
        },
        {
            "barcode": "171114272",
            "dpc": "03023234201",
            "name": "ចាន់ ប៉ច៉ូ"
        },
        {
            "barcode": "171114273",
            "dpc": "03023234301",
            "name": "សួន សុគុណ"
        },
        {
            "barcode": "171114274",
            "dpc": "03023234501",
            "name": "ឡាច ពេជ្រ"
        },
        {
            "barcode": "171114275",
            "dpc": "03023234601",
            "name": "ដាង ចាន់ណា"
        },
        {
            "barcode": "171114276",
            "dpc": "03023234701",
            "name": "ង៉ូវ ហ្គិចទៀង"
        },
        {
            "barcode": "171114277",
            "dpc": "03023234801",
            "name": "ដាន ផេង"
        },
        {
            "barcode": "171114278",
            "dpc": "03023234901",
            "name": "ចាន់ ដារ៉ា"
        },
        {
            "barcode": "171114279",
            "dpc": "03023235001",
            "name": "ផ្លុង ឆាយ៉ា"
        },
        {
            "barcode": "171114280",
            "dpc": "03023235101",
            "name": "សុខ យីម"
        },
        {
            "barcode": "171114281",
            "dpc": "03023235201",
            "name": "សាយ សំណាង"
        },
        {
            "barcode": "171114282",
            "dpc": "03023235301",
            "name": "ប៉ង ធី"
        },
        {
            "barcode": "171114283",
            "dpc": "03023235401",
            "name": "ហួន ស៊ុន"
        },
        {
            "barcode": "171114284",
            "dpc": "03023235501",
            "name": "ប៊ុត វីរិៈ"
        },
        {
            "barcode": "171114285",
            "dpc": "03023235601",
            "name": "ប៊ិន ចន្ថា"
        },
        {
            "barcode": "171114286",
            "dpc": "03023235701",
            "name": "កា ប៉ូឡុង"
        },
        {
            "barcode": "171114287",
            "dpc": "03023235801",
            "name": "មិន វី"
        },
        {
            "barcode": "171114288",
            "dpc": "03023235901",
            "name": "គឹម សោភា"
        },
        {
            "barcode": "171114289",
            "dpc": "03023236001",
            "name": "ជុន កក"
        },
        {
            "barcode": "171114290",
            "dpc": "03023236101",
            "name": "នូ ជីវ៉ា"
        },
        {
            "barcode": "171114291",
            "dpc": "03023236201",
            "name": "ជុំ គូរ៉ា"
        },
        {
            "barcode": "171114292",
            "dpc": "03023236301",
            "name": "ទៀ បាក់ស្រេ់ង"
        },
        {
            "barcode": "171114293",
            "dpc": "03023236401",
            "name": "លី វិមាន"
        },
        {
            "barcode": "171114294",
            "dpc": "03023236501",
            "name": "លី វិល័យ"
        },
        {
            "barcode": "171114295",
            "dpc": "03023236601",
            "name": "ហាច ចុង"
        },
        {
            "barcode": "171114296",
            "dpc": "03023236701",
            "name": "ង៉ុយ ហ៊រហុង"
        },
        {
            "barcode": "171114297",
            "dpc": "03023236801",
            "name": "ង៉ុយ វ៊រម៉េង"
        },
        {
            "barcode": "171114298",
            "dpc": "03023236901",
            "name": "ចៅ  ធី"
        },
        {
            "barcode": "171114299",
            "dpc": "03023237001",
            "name": "ទីវ រី"
        },
        {
            "barcode": "171114300",
            "dpc": "03023237101",
            "name": "រឿត សារុន"
        },
        {
            "barcode": "171114301",
            "dpc": "03023237201",
            "name": "ឡុច រ៉ា"
        },
        {
            "barcode": "171114302",
            "dpc": "03023237301",
            "name": "សឿ  ឃឿត"
        },
        {
            "barcode": "171114303",
            "dpc": "03023237401",
            "name": "តាន់ តុង"
        },
        {
            "barcode": "171114304",
            "dpc": "03023237501",
            "name": "រឿន សំអឿន"
        },
        {
            "barcode": "171114305",
            "dpc": "03023237601",
            "name": "អ៊ិត ប៉ូន"
        },
        {
            "barcode": "171114306",
            "dpc": "03023237701",
            "name": "តាន់  ម៉ៅ"
        },
        {
            "barcode": "171114307",
            "dpc": "03023237801",
            "name": "គណៈបក្សប្រជាជនឃុំជ្រៃ"
        },
        {
            "barcode": "171114308",
            "dpc": "03023237901",
            "name": "ហ៊ី ជា ដើមឬស្ស៊ី"
        },
        {
            "barcode": "171114309",
            "dpc": "03023238001",
            "name": "ខោ ប្រផា"
        },
        {
            "barcode": "171114310",
            "dpc": "03023238101",
            "name": "សុខ សំអាង"
        },
        {
            "barcode": "171114311",
            "dpc": "03023238301",
            "name": "ពុំ  យឿត"
        },
        {
            "barcode": "171114312",
            "dpc": "03023238401",
            "name": "ប្រុក យ៉ាន"
        },
        {
            "barcode": "171114313",
            "dpc": "03023238501",
            "name": "អឿម ស៊្រីម"
        },
        {
            "barcode": "171114314",
            "dpc": "03023238601",
            "name": "ជៀប សឿប"
        },
        {
            "barcode": "171114315",
            "dpc": "03023238801",
            "name": "ឡឹក លាភ"
        },
        {
            "barcode": "171114316",
            "dpc": "03023238901",
            "name": "ហ៊ុល សុខន"
        },
        {
            "barcode": "171114317",
            "dpc": "03023239001",
            "name": "ឆែម សាវ័ន្ត"
        },
        {
            "barcode": "171114318",
            "dpc": "03023239101",
            "name": "ព្រឿង សុទី"
        },
        {
            "barcode": "171114319",
            "dpc": "03023239201",
            "name": "ស៊ុំ ស៊ីណាក់"
        },
        {
            "barcode": "171114320",
            "dpc": "03023239301",
            "name": "ស៊ុំ ឌី"
        },
        {
            "barcode": "171114321",
            "dpc": "03023239401",
            "name": "ម៉ន សាមឿត"
        },
        {
            "barcode": "171114322",
            "dpc": "03023239501",
            "name": "ឡឹក លឿត"
        },
        {
            "barcode": "171114323",
            "dpc": "03023239601",
            "name": "រឿន ភីង"
        },
        {
            "barcode": "171114324",
            "dpc": "03023239701",
            "name": "ចយ ជឿន"
        },
        {
            "barcode": "171114325",
            "dpc": "03023239801",
            "name": "សន សំ"
        },
        {
            "barcode": "171114326",
            "dpc": "03023239901",
            "name": "ជួនូ ពេជ្រ"
        },
        {
            "barcode": "171114327",
            "dpc": "03023240001",
            "name": "ចាន់ សាវី"
        },
        {
            "barcode": "171114328",
            "dpc": "03023240101",
            "name": "លេម ធី"
        },
        {
            "barcode": "171114329",
            "dpc": "03023240201",
            "name": "កៅ សាវេន"
        },
        {
            "barcode": "171114330",
            "dpc": "03023240301",
            "name": "នា វ៉ាត់"
        },
        {
            "barcode": "171114331",
            "dpc": "03023240501",
            "name": "ឡាក់ ម៉េងវិបុល"
        },
        {
            "barcode": "171114332",
            "dpc": "03023240601",
            "name": "លី ប៊ុនធឿន"
        },
        {
            "barcode": "171114333",
            "dpc": "03023240701",
            "name": "កុយ សាម៉ៃ"
        },
        {
            "barcode": "171114334",
            "dpc": "03023240801",
            "name": "ជា ងឿម"
        },
        {
            "barcode": "171114335",
            "dpc": "03023240901",
            "name": "យ៉ន គីមអឿន"
        },
        {
            "barcode": "171114336",
            "dpc": "03023241001",
            "name": "ប៊ុន សារឿន"
        },
        {
            "barcode": "171114337",
            "dpc": "03023241101",
            "name": "ប៉ាត់ សុខែម"
        },
        {
            "barcode": "171114338",
            "dpc": "03023241201",
            "name": "សាន់  វេន"
        },
        {
            "barcode": "171114339",
            "dpc": "03023241301",
            "name": "ទឹម ដែន"
        },
        {
            "barcode": "171114340",
            "dpc": "03023241401",
            "name": "កែវ ភីរក្ស"
        },
        {
            "barcode": "171114341",
            "dpc": "03023241501",
            "name": "សៅ យន់"
        },
        {
            "barcode": "171114342",
            "dpc": "03023241601",
            "name": "ជា នង់"
        },
        {
            "barcode": "171114343",
            "dpc": "03023241701",
            "name": "ស៊ាង អឿន"
        },
        {
            "barcode": "171114344",
            "dpc": "03023241801",
            "name": "គង់ អេង"
        },
        {
            "barcode": "171114345",
            "dpc": "03023241901",
            "name": "ម៉ុង ស៊ុយ"
        },
        {
            "barcode": "171114346",
            "dpc": "03023242001",
            "name": "ពីវ ហូយ"
        },
        {
            "barcode": "171114347",
            "dpc": "03023242101",
            "name": "ស៊ឹម សាលីន"
        },
        {
            "barcode": "171114348",
            "dpc": "03023242201",
            "name": "ស៊ឹម សាឡី"
        },
        {
            "barcode": "171114349",
            "dpc": "03023242301",
            "name": "យូ សាវ៉ន"
        },
        {
            "barcode": "171114350",
            "dpc": "03023242501",
            "name": "គង់ ឆេងលួត"
        },
        {
            "barcode": "171114351",
            "dpc": "03023242601",
            "name": "យៀង សាវ៉ុង"
        },
        {
            "barcode": "171114352",
            "dpc": "03023242701",
            "name": "សាលា ឆទាន"
        },
        {
            "barcode": "171114353",
            "dpc": "03023242801",
            "name": "យឹម យ៉ង់"
        },
        {
            "barcode": "171114354",
            "dpc": "03023242901",
            "name": "ហេង សាលី"
        },
        {
            "barcode": "171114355",
            "dpc": "03023243001",
            "name": "ប៊ូ សាលីម"
        },
        {
            "barcode": "171114356",
            "dpc": "03023243101",
            "name": "ងួន យឺន"
        },
        {
            "barcode": "171114357",
            "dpc": "03023243201",
            "name": "ឆម  ឈុន"
        },
        {
            "barcode": "171114358",
            "dpc": "03023243401",
            "name": "ប៊ុន សាវី"
        },
        {
            "barcode": "171114359",
            "dpc": "03023243501",
            "name": "សួង ចាន់សុន"
        },
        {
            "barcode": "171114360",
            "dpc": "03023243601",
            "name": "គឹម វ៉ាន់ធី"
        },
        {
            "barcode": "171114361",
            "dpc": "03023243701",
            "name": "ងួន  ស៊ាងហេង"
        },
        {
            "barcode": "171114362",
            "dpc": "03023243801",
            "name": "ងួន រឿន"
        },
        {
            "barcode": "171114363",
            "dpc": "03023243901",
            "name": "ឈា ឈាន"
        },
        {
            "barcode": "171114364",
            "dpc": "03023244001",
            "name": "ថាប់  សាវ័ន្ត"
        },
        {
            "barcode": "171114365",
            "dpc": "03023244101",
            "name": "ភូមិ មូលីកា"
        },
        {
            "barcode": "171114366",
            "dpc": "03023244201",
            "name": "ស៊ឹម ទូច"
        },
        {
            "barcode": "171114367",
            "dpc": "03023244301",
            "name": "ទី សារិទ្ធ"
        },
        {
            "barcode": "171114368",
            "dpc": "03023244401",
            "name": "ស៊ឹម ឈឿត"
        },
        {
            "barcode": "171114369",
            "dpc": "03023244601",
            "name": "គុជ ឈិន"
        },
        {
            "barcode": "171114370",
            "dpc": "03023244701",
            "name": "សុង គឹមសួរ២"
        },
        {
            "barcode": "171114371",
            "dpc": "03023244801",
            "name": "អឿន សារឿន"
        },
        {
            "barcode": "171114372",
            "dpc": "03023244901",
            "name": "សេង មុំ"
        },
        {
            "barcode": "171114373",
            "dpc": "03023245001",
            "name": "សេង ធី"
        },
        {
            "barcode": "171114374",
            "dpc": "03023245101",
            "name": "ចន ញាណ"
        },
        {
            "barcode": "171114375",
            "dpc": "03023245301",
            "name": "ឌុក ស្រីសក្ខ"
        },
        {
            "barcode": "171114376",
            "dpc": "03023245401",
            "name": "មាន កុសល់"
        },
        {
            "barcode": "171114377",
            "dpc": "03023245501",
            "name": "សន យ៉ាន"
        },
        {
            "barcode": "171114378",
            "dpc": "03023245601",
            "name": "ខាត់ យឿន"
        },
        {
            "barcode": "171114379",
            "dpc": "03023245701",
            "name": "ខាត់ ប៉ូយ"
        },
        {
            "barcode": "171114380",
            "dpc": "03023245801",
            "name": "នូ គឹមនាង"
        },
        {
            "barcode": "171114381",
            "dpc": "03023245901",
            "name": "លន់ រ៉ា"
        },
        {
            "barcode": "171114382",
            "dpc": "03023246001",
            "name": "ហម សារ៉ាត់"
        },
        {
            "barcode": "171114383",
            "dpc": "03023246101",
            "name": "ជា វិបុល"
        },
        {
            "barcode": "171114384",
            "dpc": "03023246201",
            "name": "អ៊ឹង គីមងួន"
        },
        {
            "barcode": "171114385",
            "dpc": "03023246301",
            "name": "សុខ រតនា"
        },
        {
            "barcode": "171114386",
            "dpc": "03023246401",
            "name": "ងួន យឿន"
        },
        {
            "barcode": "171114387",
            "dpc": "03023246501",
            "name": "ស្វាយ ឈុនលឿន"
        },
        {
            "barcode": "171114388",
            "dpc": "03023246601",
            "name": "សំ ពិសី"
        },
        {
            "barcode": "171114389",
            "dpc": "03023246701",
            "name": "អឿន ចំរើន"
        },
        {
            "barcode": "171114390",
            "dpc": "03023246801",
            "name": "សុខ ថាវរី"
        },
        {
            "barcode": "171114391",
            "dpc": "03023246901",
            "name": "ពាន់ អឿន"
        },
        {
            "barcode": "171114392",
            "dpc": "03023247001",
            "name": "ប៉ែន នុយ"
        },
        {
            "barcode": "171114393",
            "dpc": "03023247101",
            "name": "ផុន លីមសេង"
        },
        {
            "barcode": "171114394",
            "dpc": "03023247201",
            "name": "ទី សុភាព"
        },
        {
            "barcode": "171114395",
            "dpc": "03023247301",
            "name": "ឡាក់ ឈួម"
        },
        {
            "barcode": "171114396",
            "dpc": "03023247401",
            "name": "ខន សុផាត"
        },
        {
            "barcode": "171114397",
            "dpc": "03023247501",
            "name": "ភឿន វ៉ាន់ដា"
        },
        {
            "barcode": "171114398",
            "dpc": "03023247601",
            "name": "សៅ សឿត"
        },
        {
            "barcode": "171114399",
            "dpc": "03023247701",
            "name": "អ៊ឹម វ៉ាន់ឌី"
        },
        {
            "barcode": "171114400",
            "dpc": "03023247801",
            "name": "គឹម វ៉ាន់ថា"
        },
        {
            "barcode": "171114401",
            "dpc": "03023247901",
            "name": "ចាន់ សាមឿន"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});


