let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=

    [
        {
            "barcode": "171112184",
            "dpc": "03033347601",
            "name": "ពា សុផាន"
        },
        {
            "barcode": "171112185",
            "dpc": "03033347701",
            "name": "ប្រុស សារឿន"
        },
        {
            "barcode": "171112186",
            "dpc": "03033347801",
            "name": "បេ ផល"
        },
        {
            "barcode": "171112187",
            "dpc": "03033347901",
            "name": "នួន ចន្ធូ"
        },
        {
            "barcode": "171112188",
            "dpc": "03033346301",
            "name": "អ៊ុន សុជាតិ"
        },
        {
            "barcode": "171112189",
            "dpc": "03033346401",
            "name": "លី វ៉ាននី"
        },
        {
            "barcode": "171112190",
            "dpc": "03033346501",
            "name": "ប៊ី ចាន់ថា"
        },
        {
            "barcode": "171112191",
            "dpc": "03033346601",
            "name": "យ៉ាង ស៊ត"
        },
        {
            "barcode": "171112192",
            "dpc": "03033346701",
            "name": "នុត ហឿម"
        },
        {
            "barcode": "171112193",
            "dpc": "03033346801",
            "name": "គឹម ផល"
        },
        {
            "barcode": "171112194",
            "dpc": "03033347001",
            "name": "អ៊ុង មិនា"
        },
        {
            "barcode": "171112195",
            "dpc": "03033346901",
            "name": "ថាច់ ចិន្តា"
        },
        {
            "barcode": "171112196",
            "dpc": "03033347101",
            "name": "សែមដា"
        },
        {
            "barcode": "171112197",
            "dpc": "03033347201",
            "name": "លាង ធារី"
        },
        {
            "barcode": "171112198",
            "dpc": "03033347301",
            "name": "ជា ផែន"
        },
        {
            "barcode": "171112199",
            "dpc": "03033347401",
            "name": "ពា ចាន់បូរី"
        },
        {
            "barcode": "171112200",
            "dpc": "03033348001",
            "name": "ស៊ិន សទ្ធី"
        },
        {
            "barcode": "171112201",
            "dpc": "03033347501",
            "name": "ស៊ន ចំណាន"
        },
        {
            "barcode": "171112202",
            "dpc": "03033325801",
            "name": "លន់ សុខចំរើន"
        },
        {
            "barcode": "171112203",
            "dpc": "03033303601",
            "name": "អ៊ឹម ថា"
        },
        {
            "barcode": "171112204",
            "dpc": "03033325501",
            "name": "អែប ភិរុណ"
        },
        {
            "barcode": "171112205",
            "dpc": "03033303301",
            "name": "ឡេង សេងលាង"
        },
        {
            "barcode": "171112206",
            "dpc": "03033303201",
            "name": "លួត សំបូ"
        },
        {
            "barcode": "171112207",
            "dpc": "03033303101",
            "name": "វង្ស វិចិត្រ"
        },
        {
            "barcode": "171112208",
            "dpc": "03033302501",
            "name": "ប៉ាង មារិទ្ធ"
        },
        {
            "barcode": "171112209",
            "dpc": "03033302401",
            "name": "យ៉ត គៀវ"
        },
        {
            "barcode": "171112210",
            "dpc": "03033302301",
            "name": "ហ៊ុន ហ៊ី"
        },
        {
            "barcode": "171112211",
            "dpc": "03033302101",
            "name": "អ៊ុំ សុខឡាយ"
        },
        {
            "barcode": "171112212",
            "dpc": "03033302001",
            "name": "ផៃ បុប្ផា"
        },
        {
            "barcode": "171112213",
            "dpc": "03033301901",
            "name": "មាន  សាលវ័ន្ត"
        },
        {
            "barcode": "171112214",
            "dpc": "03033301801",
            "name": "សុខ  ពុធ"
        },
        {
            "barcode": "171112215",
            "dpc": "03033301701",
            "name": "រត្ន័  ចន្ធូ"
        },
        {
            "barcode": "171112216",
            "dpc": "03033301601",
            "name": "ហិញ  រដ្ឋា"
        },
        {
            "barcode": "171112217",
            "dpc": "03033301501",
            "name": "កាន់  ស៊ីចន្ទ័តូ"
        },
        {
            "barcode": "171112218",
            "dpc": "03033301401",
            "name": "ងី  វណ្ណះ"
        },
        {
            "barcode": "171112219",
            "dpc": "03033301301",
            "name": "អ៊ឹម  ផល្លា"
        },
        {
            "barcode": "171112220",
            "dpc": "03033301201",
            "name": "សុខ  សុវណ្ណ"
        },
        {
            "barcode": "171112221",
            "dpc": "03033301101",
            "name": "អ៊ឹង  ចិន្តា"
        },
        {
            "barcode": "171112222",
            "dpc": "03033301001",
            "name": "សេង  ម៉េង"
        },
        {
            "barcode": "171112223",
            "dpc": "03033300901",
            "name": "យ៉ាន  ស្រអែម"
        },
        {
            "barcode": "171112224",
            "dpc": "03033300801",
            "name": "លី  សុភាព"
        },
        {
            "barcode": "171112225",
            "dpc": "03033300701",
            "name": "ផន  វិចិត្រ"
        },
        {
            "barcode": "171112226",
            "dpc": "03033300601",
            "name": "លីម  ស៊ីចេង"
        },
        {
            "barcode": "171112227",
            "dpc": "03033300501",
            "name": "រិន រ៉ាត់"
        },
        {
            "barcode": "171112228",
            "dpc": "03033300401",
            "name": "កែ សៅ"
        },
        {
            "barcode": "171112229",
            "dpc": "03033300201",
            "name": "ឈន វៃ"
        },
        {
            "barcode": "171112230",
            "dpc": "03033300101",
            "name": "តាំង បេងគុណ"
        },
        {
            "barcode": "171112231",
            "dpc": "03033326001",
            "name": "ស្រី ទិព្វសម្បត្តិ"
        },
        {
            "barcode": "171112232",
            "dpc": "03033326101",
            "name": "ញ៉េប វ៉ន"
        },
        {
            "barcode": "171112233",
            "dpc": "03033325901",
            "name": "សុខ នី"
        },
        {
            "barcode": "171112234",
            "dpc": "03033307501",
            "name": "ជ  គាង"
        },
        {
            "barcode": "171112235",
            "dpc": "03033303501",
            "name": "ប៉ោ ស៊ីនួន"
        },
        {
            "barcode": "171112236",
            "dpc": "03033303401",
            "name": "គឹម ឡៃ"
        },
        {
            "barcode": "171112237",
            "dpc": "03033326201",
            "name": "រិន សារី"
        },
        {
            "barcode": "171112238",
            "dpc": "03033307101",
            "name": "ឡោ វ៉ាន់សាយ"
        },
        {
            "barcode": "171112239",
            "dpc": "03033303801",
            "name": "ម៉ី ផល្លា"
        },
        {
            "barcode": "171112240",
            "dpc": "03033326301",
            "name": "យិន  ចិត្រា ១"
        },
        {
            "barcode": "171112241",
            "dpc": "03033308401",
            "name": "យឹម ចិត្រា"
        },
        {
            "barcode": "171112242",
            "dpc": "03033326501",
            "name": "យូ សាន"
        },
        {
            "barcode": "171112243",
            "dpc": "03033326601",
            "name": "មាស សារុន"
        },
        {
            "barcode": "171112244",
            "dpc": "03033307801",
            "name": "ហុង កុសល"
        },
        {
            "barcode": "171112245",
            "dpc": "03033307901",
            "name": "ឈាងអៀង"
        },
        {
            "barcode": "171112246",
            "dpc": "03033308001",
            "name": "ជា សិទ្ធ"
        },
        {
            "barcode": "171112247",
            "dpc": "03033308101",
            "name": "ខេង សៀកហួត"
        },
        {
            "barcode": "171112248",
            "dpc": "03033326701",
            "name": "តោ សាលីន"
        },
        {
            "barcode": "171112249",
            "dpc": "03033307001",
            "name": "ជឺ ពុំ"
        },
        {
            "barcode": "171112250",
            "dpc": "03033306901",
            "name": "លឹម ម៉ី"
        },
        {
            "barcode": "171112251",
            "dpc": "03033306801",
            "name": "អៀម ម៉េងគង់"
        },
        {
            "barcode": "171112252",
            "dpc": "03033308301",
            "name": "នូវ គឹមណៃ"
        },
        {
            "barcode": "171112253",
            "dpc": "03033308501",
            "name": "ជឺ ពុំ"
        },
        {
            "barcode": "171112254",
            "dpc": "03033302601",
            "name": "ញ៉េប  ចាន់នី"
        },
        {
            "barcode": "171112255",
            "dpc": "03033302701",
            "name": "នី  យ៉ារី"
        },
        {
            "barcode": "171112256",
            "dpc": "03033302801",
            "name": "គុណ  យឿន"
        },
        {
            "barcode": "171112257",
            "dpc": "03033302901",
            "name": "ប៊ុន   វន្នី"
        },
        {
            "barcode": "171112258",
            "dpc": "03033303001",
            "name": "ចៅ  ចេកអាំង"
        },
        {
            "barcode": "171112259",
            "dpc": "03033303701",
            "name": "មាស  ធន"
        },
        {
            "barcode": "171112260",
            "dpc": "03033303901",
            "name": "ចាន់  សាវ៉ៃ"
        },
        {
            "barcode": "171112261",
            "dpc": "03033304001",
            "name": "ជុំ  ចាន់ថន"
        },
        {
            "barcode": "171112262",
            "dpc": "03033304101",
            "name": "ឆន  សុភ័ស្ត"
        },
        {
            "barcode": "171112263",
            "dpc": "03033304201",
            "name": "លី  ស៊ុក"
        },
        {
            "barcode": "171112264",
            "dpc": "03033304301",
            "name": "ប៉ែ  សារៀម"
        },
        {
            "barcode": "171112265",
            "dpc": "03033304401",
            "name": "ឡុក  ចាន់ធី"
        },
        {
            "barcode": "171112266",
            "dpc": "03033304501",
            "name": "ខៀវ  ឈឿត"
        },
        {
            "barcode": "171112267",
            "dpc": "03033304601",
            "name": "សុង   កង"
        },
        {
            "barcode": "171112268",
            "dpc": "03033304701",
            "name": "យក់  លីវ"
        },
        {
            "barcode": "171112269",
            "dpc": "03033304801",
            "name": "ស៊ឹម ស៊ីថា"
        },
        {
            "barcode": "171112270",
            "dpc": "03033304901",
            "name": "សុខ  ផាន់"
        },
        {
            "barcode": "171112271",
            "dpc": "03033305001",
            "name": "អ៊ុក អ៊ូច"
        },
        {
            "barcode": "171112272",
            "dpc": "03033305101",
            "name": "កុល  ប្រពៃ"
        },
        {
            "barcode": "171112273",
            "dpc": "03033305201",
            "name": "អ៊ឹម  ផល្លា"
        },
        {
            "barcode": "171112274",
            "dpc": "03033305301",
            "name": "រស់  សាបឿន"
        },
        {
            "barcode": "171112275",
            "dpc": "03033305401",
            "name": "រស់  ទីណាល់"
        },
        {
            "barcode": "171112276",
            "dpc": "03033305501",
            "name": "សេង  សុថុន"
        },
        {
            "barcode": "171112277",
            "dpc": "03033305601",
            "name": "មាឃ  រចនា"
        },
        {
            "barcode": "171112278",
            "dpc": "03033305701",
            "name": "សៅ  ឆុន"
        },
        {
            "barcode": "171112279",
            "dpc": "03033305801",
            "name": "កែវ  ធី"
        },
        {
            "barcode": "171112280",
            "dpc": "03033305901",
            "name": "សំ  សាវន"
        },
        {
            "barcode": "171112281",
            "dpc": "03033306001",
            "name": "ស៊ីន   យ៉ែម"
        },
        {
            "barcode": "171112282",
            "dpc": "03033306101",
            "name": "អ៊ុំ  សុធីតា"
        },
        {
            "barcode": "171112283",
            "dpc": "03033306201",
            "name": "សន  សុផល"
        },
        {
            "barcode": "171112284",
            "dpc": "03033306301",
            "name": "ចាន់  ក្រេប"
        },
        {
            "barcode": "171112285",
            "dpc": "03033306401",
            "name": "លន់  ចាន់អុង"
        },
        {
            "barcode": "171112286",
            "dpc": "03033306501",
            "name": "ធួន  វណ្ណី"
        },
        {
            "barcode": "171112287",
            "dpc": "03033306601",
            "name": "ផាន់   ស៊ុនបុប្ជា"
        },
        {
            "barcode": "171112288",
            "dpc": "03033306701",
            "name": "គីវ  វ៉ាន់នី"
        },
        {
            "barcode": "171112289",
            "dpc": "03033307201",
            "name": "ចាន់  ទូច"
        },
        {
            "barcode": "171112290",
            "dpc": "03033307401",
            "name": "ប៉ុល  ឃួន"
        },
        {
            "barcode": "171112291",
            "dpc": "03033307701",
            "name": "បេង ស៊ីណាត ២"
        },
        {
            "barcode": "171112292",
            "dpc": "03033308601",
            "name": "បាន  ហួត"
        },
        {
            "barcode": "171112293",
            "dpc": "03033308701",
            "name": "ឃួន ម៉ាឡា"
        },
        {
            "barcode": "171112294",
            "dpc": "03033308801",
            "name": "ហង្ស សីណា"
        },
        {
            "barcode": "171112295",
            "dpc": "03033308901",
            "name": "ម៉ៅ  សាវុន"
        },
        {
            "barcode": "171112296",
            "dpc": "03033309001",
            "name": "ចាន់  ណារី"
        },
        {
            "barcode": "171112297",
            "dpc": "03033309101",
            "name": "ចាន់  រដ្ឋា"
        },
        {
            "barcode": "171112298",
            "dpc": "03033309201",
            "name": "លី   ហុង"
        },
        {
            "barcode": "171112299",
            "dpc": "03033309301",
            "name": "សុខ  ណារ៉ា"
        },
        {
            "barcode": "171112300",
            "dpc": "03033309401",
            "name": "សេង  សុខឃាង"
        },
        {
            "barcode": "171112301",
            "dpc": "03033309501",
            "name": "សួស  ភីរុន"
        },
        {
            "barcode": "171112302",
            "dpc": "03033309601",
            "name": "មណ្ឌលសុខភាពជ្រៃ"
        },
        {
            "barcode": "171112303",
            "dpc": "03033309701",
            "name": "ហ៊ន  សាមិត"
        },
        {
            "barcode": "171112304",
            "dpc": "03033309901",
            "name": "ឆយ  ចាន់ណា"
        },
        {
            "barcode": "171112305",
            "dpc": "03033310001",
            "name": "លី  ឆាយ"
        },
        {
            "barcode": "171112306",
            "dpc": "03033310101",
            "name": "ជ្រិន  សុភស្ត័"
        },
        {
            "barcode": "171112307",
            "dpc": "03033310201",
            "name": "សៀង  វីរៈ"
        },
        {
            "barcode": "171112308",
            "dpc": "03033310301",
            "name": "រ៉េត  រិន"
        },
        {
            "barcode": "171112309",
            "dpc": "03033310401",
            "name": "ខាត់  គីមលាង"
        },
        {
            "barcode": "171112310",
            "dpc": "03033310501",
            "name": "ហ៊ូ  ឡាយឡូវ"
        },
        {
            "barcode": "171112311",
            "dpc": "03033310601",
            "name": "ងួន  រ៉ាឌី"
        },
        {
            "barcode": "171112312",
            "dpc": "03033310701",
            "name": "ហាស់  ស៊ីណេម"
        },
        {
            "barcode": "171112313",
            "dpc": "03033310801",
            "name": "គឹម  សំអុល"
        },
        {
            "barcode": "171112314",
            "dpc": "03033310901",
            "name": "សុត  សុខុម"
        },
        {
            "barcode": "171112315",
            "dpc": "03033311001",
            "name": "វ៉ាត  សុភាព"
        },
        {
            "barcode": "171112316",
            "dpc": "03033311101",
            "name": "ពិន  ចាន់ធី"
        },
        {
            "barcode": "171112317",
            "dpc": "03033311201",
            "name": "ច័ន្ទ  សុថុន"
        },
        {
            "barcode": "171112318",
            "dpc": "03033311301",
            "name": "ត្រាន់  ធីហឿង"
        },
        {
            "barcode": "171112319",
            "dpc": "03033311401",
            "name": "ឃុន  សារឿន"
        },
        {
            "barcode": "171112320",
            "dpc": "03033311501",
            "name": "តាន់  ធុច"
        },
        {
            "barcode": "171112321",
            "dpc": "03033311601",
            "name": "ហ៊ន  សាមិត"
        },
        {
            "barcode": "171112322",
            "dpc": "03033311701",
            "name": "ស៊ុន  ឈុន"
        },
        {
            "barcode": "171112323",
            "dpc": "03033311801",
            "name": "យុង  សម្បត្តិ"
        },
        {
            "barcode": "171112324",
            "dpc": "03033311901",
            "name": "ហួ  កុយ"
        },
        {
            "barcode": "171112325",
            "dpc": "03033312001",
            "name": "រិទ្ធ  វុទ្ធី"
        },
        {
            "barcode": "171112326",
            "dpc": "03033312101",
            "name": "ទូច  នាង"
        },
        {
            "barcode": "171112327",
            "dpc": "03033312201",
            "name": "ហឿង  ពៅ"
        },
        {
            "barcode": "171112328",
            "dpc": "03033312401",
            "name": "ស្រី  ពេញ"
        },
        {
            "barcode": "171112329",
            "dpc": "03033312501",
            "name": "វ៉ាន់  ធី"
        },
        {
            "barcode": "171112330",
            "dpc": "03033312601",
            "name": "មាឃ  ឆាយ"
        },
        {
            "barcode": "171112331",
            "dpc": "03033312701",
            "name": "យ៉ា  គឹ់មលី"
        },
        {
            "barcode": "171112332",
            "dpc": "03033312801",
            "name": "ផាន់  សារិ"
        },
        {
            "barcode": "171112333",
            "dpc": "03033312901",
            "name": "សៅ  សំណាង"
        },
        {
            "barcode": "171112334",
            "dpc": "03033313001",
            "name": "ទេស  សុន"
        },
        {
            "barcode": "171112335",
            "dpc": "03033313101",
            "name": "វ័រ  វឌ្ឍនះ"
        },
        {
            "barcode": "171112336",
            "dpc": "03033313201",
            "name": "នួន  ឡាំ"
        },
        {
            "barcode": "171112337",
            "dpc": "03033313301",
            "name": "ម៉ៃ  យីមហ៊ាង"
        },
        {
            "barcode": "171112338",
            "dpc": "03033313401",
            "name": "ហោ  ឌីម៉ង់"
        },
        {
            "barcode": "171112339",
            "dpc": "03033313501",
            "name": "ត្រេស  សាវឿង"
        },
        {
            "barcode": "171112340",
            "dpc": "03033313601",
            "name": "ម៉ៃ  អ៊ាន"
        },
        {
            "barcode": "171112341",
            "dpc": "03033313701",
            "name": "ឆឹង  វ៉ន"
        },
        {
            "barcode": "171112342",
            "dpc": "03033313801",
            "name": "ម៉ុក  សាលៀម"
        },
        {
            "barcode": "171112343",
            "dpc": "03033313901",
            "name": "រឿង ឌេតតេជពល"
        },
        {
            "barcode": "171112344",
            "dpc": "03033314001",
            "name": "ហេង  សូវៀត"
        },
        {
            "barcode": "171112345",
            "dpc": "03033314101",
            "name": "ហាន  សំអាត"
        },
        {
            "barcode": "171112346",
            "dpc": "03033314201",
            "name": "ប៊ុន  លីម"
        },
        {
            "barcode": "171112347",
            "dpc": "03033314301",
            "name": "តាន់  ឃឿន"
        },
        {
            "barcode": "171112348",
            "dpc": "03033314401",
            "name": "រត្ន័  សាវី"
        },
        {
            "barcode": "171112349",
            "dpc": "03033314501",
            "name": "អឿន  គីណាល់"
        },
        {
            "barcode": "171112350",
            "dpc": "03033314601",
            "name": "រើន  ភាព"
        },
        {
            "barcode": "171112351",
            "dpc": "03033314701",
            "name": "ម៉ៅ  សារុន"
        },
        {
            "barcode": "171112352",
            "dpc": "03033314801",
            "name": "ស៊ីវ  ទ្រី"
        },
        {
            "barcode": "171112353",
            "dpc": "03033314901",
            "name": "ស៊ិន  សារ៉ែន"
        },
        {
            "barcode": "171112354",
            "dpc": "03033315001",
            "name": "ស៊ិន  សារ៉ន"
        },
        {
            "barcode": "171112355",
            "dpc": "03033315101",
            "name": "ស៊ិន  សារិ"
        },
        {
            "barcode": "171112356",
            "dpc": "03033315201",
            "name": "សេង  រ៉ុន"
        },
        {
            "barcode": "171112357",
            "dpc": "03033315301",
            "name": "ណៃ   សុខន"
        },
        {
            "barcode": "171112358",
            "dpc": "03033315401",
            "name": "េឃ្លាក  មុន្នី"
        },
        {
            "barcode": "171112359",
            "dpc": "03033315501",
            "name": "ព្រិល  វាសនា"
        },
        {
            "barcode": "171112360",
            "dpc": "03033315601",
            "name": "កែន  ប៊ុនយ៉េង"
        },
        {
            "barcode": "171112361",
            "dpc": "03033315701",
            "name": "ចៀម  វណ្ណា"
        },
        {
            "barcode": "171112362",
            "dpc": "03033315801",
            "name": "អេង  លិញ"
        },
        {
            "barcode": "171112363",
            "dpc": "03033315901",
            "name": "ភួង  សម្ឆស្ស"
        },
        {
            "barcode": "171112364",
            "dpc": "03033316001",
            "name": "សេង  ពិសិដ្ឋ"
        },
        {
            "barcode": "171112365",
            "dpc": "03033316101",
            "name": "សាយ  សុខ"
        },
        {
            "barcode": "171112366",
            "dpc": "03033316201",
            "name": "ឆឹង  វ៉ាត"
        },
        {
            "barcode": "171112367",
            "dpc": "03033316301",
            "name": "ងួន  សារឿប"
        },
        {
            "barcode": "171112368",
            "dpc": "03033316401",
            "name": "ណាក់  សាវុធ"
        },
        {
            "barcode": "171112369",
            "dpc": "03033316501",
            "name": "ងិន  សំអាត"
        },
        {
            "barcode": "171112370",
            "dpc": "03033316601",
            "name": "សេង  ពិសិដ្ធ"
        },
        {
            "barcode": "171112371",
            "dpc": "03033316701",
            "name": "នន  នាង"
        },
        {
            "barcode": "171112372",
            "dpc": "03033316801",
            "name": "វ៉ា  ចន្ទ័ពិសិដ្ឋ"
        },
        {
            "barcode": "171112373",
            "dpc": "03033316901",
            "name": "វ៉ាន់ វ៉ាត"
        },
        {
            "barcode": "171112374",
            "dpc": "03033317001",
            "name": "សាន់  សាន"
        },
        {
            "barcode": "171112375",
            "dpc": "03033317101",
            "name": "ឆាយ  ជឿន"
        },
        {
            "barcode": "171112376",
            "dpc": "03033317201",
            "name": "ឆាយ  សែ"
        },
        {
            "barcode": "171112377",
            "dpc": "03033317301",
            "name": "ផ្ទះ. ក. ភ.អណ្តូងចេញ"
        },
        {
            "barcode": "171112378",
            "dpc": "03033317401",
            "name": "ងី  សៀកមួយ"
        },
        {
            "barcode": "171112379",
            "dpc": "03033317501",
            "name": "វ៉ែន  ស៊ីន"
        },
        {
            "barcode": "171112380",
            "dpc": "03033317601",
            "name": "ផាន់  ស្រីផុន"
        },
        {
            "barcode": "171112381",
            "dpc": "03033317701",
            "name": "វ៉ើត  ហ៊ួយ"
        },
        {
            "barcode": "171112382",
            "dpc": "03033317801",
            "name": "ប្រាក់  សម្បត្តិ"
        },
        {
            "barcode": "171112383",
            "dpc": "03033317901",
            "name": "ឡាត  សាលី"
        },
        {
            "barcode": "171112384",
            "dpc": "03033318001",
            "name": "ផ្ទះ. ក. ភ.អណ្តូងចេញ"
        },
        {
            "barcode": "171112385",
            "dpc": "03033318101",
            "name": "សាន  យ៉ន"
        },
        {
            "barcode": "171112386",
            "dpc": "03033318201",
            "name": "ផ្ទះ. ក. ភ.អណ្តូងចេញ"
        },
        {
            "barcode": "171112387",
            "dpc": "03033318301",
            "name": "សឿន  ចាន់ណា"
        },
        {
            "barcode": "171112388",
            "dpc": "03033318401",
            "name": "អ៊ុក  ហឿន"
        },
        {
            "barcode": "171112389",
            "dpc": "03033318501",
            "name": "ទេព  ជួន"
        },
        {
            "barcode": "171112390",
            "dpc": "03033318601",
            "name": "ឡេង  ហេង"
        },
        {
            "barcode": "171112391",
            "dpc": "03033318701",
            "name": "សន  សុខរ៉ា"
        },
        {
            "barcode": "171112392",
            "dpc": "03033318801",
            "name": "ដួង  ផន"
        },
        {
            "barcode": "171112393",
            "dpc": "03033318901",
            "name": "មឹក  ប៊ែ"
        },
        {
            "barcode": "171112394",
            "dpc": "03033319001",
            "name": "កែវ  យ៉ាត"
        },
        {
            "barcode": "171112395",
            "dpc": "03033319101",
            "name": "គឹម  ឃន"
        },
        {
            "barcode": "171112396",
            "dpc": "03033319201",
            "name": "ឡុង  ចាន់ថា"
        },
        {
            "barcode": "171112397",
            "dpc": "03033319301",
            "name": "យិន  សង់"
        },
        {
            "barcode": "171112398",
            "dpc": "03033319501",
            "name": "ចៅ  ធន់"
        },
        {
            "barcode": "171112399",
            "dpc": "03033319601",
            "name": "ចៅ  វណ្ណនី"
        },
        {
            "barcode": "171112400",
            "dpc": "03033319701",
            "name": "គឹម   ស៊ាន"
        },
        {
            "barcode": "171112401",
            "dpc": "03033319801",
            "name": "មិត  យ៉ុន"
        },
        {
            "barcode": "171112402",
            "dpc": "03033319901",
            "name": "សេង  ភូមិន្ទ"
        },
        {
            "barcode": "171112403",
            "dpc": "03033320001",
            "name": "ទូច សុខហេង"
        },
        {
            "barcode": "171112404",
            "dpc": "03033320101",
            "name": "ម៉ៅ  ឌីណេត"
        },
        {
            "barcode": "171112405",
            "dpc": "03033320201",
            "name": "ប៊ាន  សំណាង"
        },
        {
            "barcode": "171112406",
            "dpc": "03033320301",
            "name": "គង់  ចិន្តា"
        },
        {
            "barcode": "171112407",
            "dpc": "03033320401",
            "name": "ស៊ុន  ពិសិដ្ឋ"
        },
        {
            "barcode": "171112408",
            "dpc": "03033320501",
            "name": "យ៉ាត  ឈួម"
        },
        {
            "barcode": "171112409",
            "dpc": "03033320601",
            "name": "ភួន  ម៉ៅ"
        },
        {
            "barcode": "171112410",
            "dpc": "03033320801",
            "name": "អ៊ួន  ចំរើន"
        },
        {
            "barcode": "171112411",
            "dpc": "03033320901",
            "name": "គង់  សាវី"
        },
        {
            "barcode": "171112412",
            "dpc": "03033321001",
            "name": "កុយ  កញ្ចនា"
        },
        {
            "barcode": "171112413",
            "dpc": "03033321101",
            "name": "សាយ រីយ៉ា"
        },
        {
            "barcode": "171112414",
            "dpc": "03033321201",
            "name": "តឹង  ចៃ"
        },
        {
            "barcode": "171112415",
            "dpc": "03033321301",
            "name": "វុធ  ធាន"
        },
        {
            "barcode": "171112416",
            "dpc": "03033321401",
            "name": "ហៃម  សឺន"
        },
        {
            "barcode": "171112417",
            "dpc": "03033321501",
            "name": "សេស  សាវ៉ាត"
        },
        {
            "barcode": "171112418",
            "dpc": "03033321601",
            "name": "ចេង  ចំរើន"
        },
        {
            "barcode": "171112419",
            "dpc": "03033321701",
            "name": "អេង សារឿន"
        },
        {
            "barcode": "171112420",
            "dpc": "03033321801",
            "name": "កែវ  ស្រី"
        },
        {
            "barcode": "171112421",
            "dpc": "03033321901",
            "name": "លុយ  ឡី"
        },
        {
            "barcode": "171112422",
            "dpc": "03033322001",
            "name": "លី  ប៊ុនយីន"
        },
        {
            "barcode": "171112423",
            "dpc": "03033322101",
            "name": "ហ៊ុន  យ៉ាន"
        },
        {
            "barcode": "171112424",
            "dpc": "03033322201",
            "name": "យុន  សាវឿន"
        },
        {
            "barcode": "171112425",
            "dpc": "03033322301",
            "name": "សែម  ប៊ុនធឿន"
        },
        {
            "barcode": "171112426",
            "dpc": "03033322401",
            "name": "រស់  វណ្ណរដ្ឋ"
        },
        {
            "barcode": "171112427",
            "dpc": "03033322501",
            "name": "ហ៊ួ  ចណ្ណា"
        },
        {
            "barcode": "171112428",
            "dpc": "03033322601",
            "name": "អ៊ិន  តន"
        },
        {
            "barcode": "171112429",
            "dpc": "03033322701",
            "name": "ហែម  សំអាត"
        },
        {
            "barcode": "171112430",
            "dpc": "03033322801",
            "name": "ស៊ុន  រិទ្ធ"
        },
        {
            "barcode": "171112431",
            "dpc": "03033322901",
            "name": "ឡុង  ប៊ុនថន"
        },
        {
            "barcode": "171112432",
            "dpc": "03033323001",
            "name": "ប៊ូ   សុគុណ"
        },
        {
            "barcode": "171112433",
            "dpc": "03033323101",
            "name": "ហៀង  គីមងិន"
        },
        {
            "barcode": "171112434",
            "dpc": "03033323201",
            "name": "តែ  លីដា"
        },
        {
            "barcode": "171112435",
            "dpc": "03033323301",
            "name": "វ៉ង លីហ៊ាង"
        },
        {
            "barcode": "171112436",
            "dpc": "03033323401",
            "name": "ហ៊ាន  មេត្រី"
        },
        {
            "barcode": "171112437",
            "dpc": "03033323501",
            "name": "ជុំ  សុខខេង"
        },
        {
            "barcode": "171112438",
            "dpc": "03033323601",
            "name": "សាន  សារ៉ន"
        },
        {
            "barcode": "171112439",
            "dpc": "03033323701",
            "name": "ទេស  ចំរើន"
        },
        {
            "barcode": "171112440",
            "dpc": "03033323801",
            "name": "លឹម  ដុល្លា"
        },
        {
            "barcode": "171112441",
            "dpc": "03033323901",
            "name": "សុខ  ធី"
        },
        {
            "barcode": "171112442",
            "dpc": "03033324001",
            "name": "ញ៉ែម  ពង់"
        },
        {
            "barcode": "171112443",
            "dpc": "03033324101",
            "name": "ម៉ៅ  រ៉េត"
        },
        {
            "barcode": "171112444",
            "dpc": "03033324201",
            "name": "ងនិ  សារ៉េត"
        },
        {
            "barcode": "171112445",
            "dpc": "03033324301",
            "name": "ឆន  កាក់"
        },
        {
            "barcode": "171112446",
            "dpc": "03033324401",
            "name": "សារ៉េត  វាសនា"
        },
        {
            "barcode": "171112447",
            "dpc": "03033324501",
            "name": "ហួត  ចិន្តា"
        },
        {
            "barcode": "171112448",
            "dpc": "03033324601",
            "name": "តុប  ឌឿន"
        },
        {
            "barcode": "171112449",
            "dpc": "03033324701",
            "name": "វី  សុខចំរើន"
        },
        {
            "barcode": "171112450",
            "dpc": "03033324801",
            "name": "ជៀម  ផែ"
        },
        {
            "barcode": "171112451",
            "dpc": "03033324901",
            "name": "អ៊ុយ  សារ៉ម"
        },
        {
            "barcode": "171112452",
            "dpc": "03033325001",
            "name": "លុយ  ចន្ថា"
        },
        {
            "barcode": "171112453",
            "dpc": "03033325101",
            "name": "ពេជ្រ  វណ្ណះ"
        },
        {
            "barcode": "171112454",
            "dpc": "03033325201",
            "name": "ធូ  សច្ចនា"
        },
        {
            "barcode": "171112455",
            "dpc": "03033325301",
            "name": "ឆេង  លុយ"
        },
        {
            "barcode": "171112456",
            "dpc": "03033325401",
            "name": "ជា  ពៅ"
        },
        {
            "barcode": "171112457",
            "dpc": "03033325601",
            "name": "ទូច  ឆេង"
        },
        {
            "barcode": "171112458",
            "dpc": "03033325701",
            "name": "វី  នាង"
        },
        {
            "barcode": "171112459",
            "dpc": "03033326801",
            "name": "ម៉ន  ឌឿន"
        },
        {
            "barcode": "171112460",
            "dpc": "03033327001",
            "name": "ជោតិ ច័ន្ទចរិយា"
        },
        {
            "barcode": "171112461",
            "dpc": "03033327101",
            "name": "អ៊ីង ចាន់ថាច"
        },
        {
            "barcode": "171112462",
            "dpc": "03033327201",
            "name": "ស ស៊ុយ"
        },
        {
            "barcode": "171112463",
            "dpc": "03033327301",
            "name": "ម៉ម សុខែមរិ"
        },
        {
            "barcode": "171112464",
            "dpc": "03033327401",
            "name": "កែវ គឹមអាយ"
        },
        {
            "barcode": "171112465",
            "dpc": "03033327501",
            "name": "គ្រួច សារើយ"
        },
        {
            "barcode": "171112466",
            "dpc": "03033327601",
            "name": "ពុធ សានី"
        },
        {
            "barcode": "171112467",
            "dpc": "03033327701",
            "name": "ឯម សាម៉េត"
        },
        {
            "barcode": "171112468",
            "dpc": "03033327801",
            "name": "សែម ដា"
        },
        {
            "barcode": "171112469",
            "dpc": "03033327901",
            "name": "កង សុផានី"
        },
        {
            "barcode": "171112470",
            "dpc": "03033328001",
            "name": "ទូច ណារី"
        },
        {
            "barcode": "171112471",
            "dpc": "03033328101",
            "name": "ឡេង សានឿត"
        },
        {
            "barcode": "171112472",
            "dpc": "03033328201",
            "name": "ពេជ្រ វាន់ឌី"
        },
        {
            "barcode": "171112473",
            "dpc": "03033328301",
            "name": "ឃឹម សុជាតិ"
        },
        {
            "barcode": "171112474",
            "dpc": "03033328401",
            "name": "ឃួន ខូឌីន"
        },
        {
            "barcode": "171112475",
            "dpc": "03033328501",
            "name": "វង្ស សុវណ្ណា"
        },
        {
            "barcode": "171112476",
            "dpc": "03033328601",
            "name": "ឃួន ឆិកា"
        },
        {
            "barcode": "171112477",
            "dpc": "03033328701",
            "name": "ឃួន ថុនា"
        },
        {
            "barcode": "171112478",
            "dpc": "03033328801",
            "name": "សែម កៅ"
        },
        {
            "barcode": "171112479",
            "dpc": "03033328901",
            "name": "ហែម ចំរើន"
        },
        {
            "barcode": "171112480",
            "dpc": "03033329001",
            "name": "ឯក កាន"
        },
        {
            "barcode": "171112481",
            "dpc": "03033329201",
            "name": "ឡុង ចិន្តា"
        },
        {
            "barcode": "171112482",
            "dpc": "03033329301",
            "name": "លី ណាវី"
        },
        {
            "barcode": "171112483",
            "dpc": "03033329401",
            "name": "ពង្ស រតន:"
        },
        {
            "barcode": "171112484",
            "dpc": "03033329501",
            "name": "ប៊ិត សារួម"
        },
        {
            "barcode": "171112485",
            "dpc": "03033329601",
            "name": "មុំ ទូច"
        },
        {
            "barcode": "171112486",
            "dpc": "03033329701",
            "name": "កា ចន្ទ័វុទ្ធី"
        },
        {
            "barcode": "171112487",
            "dpc": "03033329801",
            "name": "កា ហុន"
        },
        {
            "barcode": "171112488",
            "dpc": "03033329901",
            "name": "ឡេង ផេង"
        },
        {
            "barcode": "171112489",
            "dpc": "03033330001",
            "name": "គឹម សុប"
        },
        {
            "barcode": "171112490",
            "dpc": "03033330101",
            "name": "អុំ ព្រឿង"
        },
        {
            "barcode": "171112491",
            "dpc": "03033330201",
            "name": "អុំ សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171112492",
            "dpc": "03033330301",
            "name": "សែន ណារ៉ុង"
        },
        {
            "barcode": "171112493",
            "dpc": "03033330401",
            "name": "ងិន សុខុន"
        },
        {
            "barcode": "171112494",
            "dpc": "03033330501",
            "name": "ប៉ិល ចាន់ណារ៉ា"
        },
        {
            "barcode": "171112495",
            "dpc": "03033330601",
            "name": "ឈូក ឆាយា"
        },
        {
            "barcode": "171112496",
            "dpc": "03033330701",
            "name": "លាង ចន្ធូ"
        },
        {
            "barcode": "171112497",
            "dpc": "03033330801",
            "name": "កែវ មុន្នី"
        },
        {
            "barcode": "171112498",
            "dpc": "03033330901",
            "name": "យិន សុផាន"
        },
        {
            "barcode": "171112499",
            "dpc": "03033331001",
            "name": "រ៉ុង ពន្លក"
        },
        {
            "barcode": "171112500",
            "dpc": "03033331101",
            "name": "ហួន ហាន"
        },
        {
            "barcode": "171112501",
            "dpc": "03033331201",
            "name": "គី ប៊ុណ្ណារ៉ា"
        },
        {
            "barcode": "171112502",
            "dpc": "03033331301",
            "name": "ចិត្រ សុវណ្ណនី"
        },
        {
            "barcode": "171112503",
            "dpc": "03033331401",
            "name": "អ៊ូ មីនា"
        },
        {
            "barcode": "171112504",
            "dpc": "03033331501",
            "name": "ហាច យ៉ា"
        },
        {
            "barcode": "171112505",
            "dpc": "03033331601",
            "name": "ស៊ីន ឃីម"
        },
        {
            "barcode": "171112506",
            "dpc": "03033331701",
            "name": "ម៉ក់ សាវុធ"
        },
        {
            "barcode": "171112507",
            "dpc": "03033331801",
            "name": "ឃីវ សុវត្តិ"
        },
        {
            "barcode": "171112508",
            "dpc": "03033331901",
            "name": "ភាជ ឆុន"
        },
        {
            "barcode": "171112509",
            "dpc": "03033332001",
            "name": "ពិន ឌី"
        },
        {
            "barcode": "171112510",
            "dpc": "03033332101",
            "name": "ជាង មនីលីដា"
        },
        {
            "barcode": "171112511",
            "dpc": "03033332201",
            "name": "នួន លៀង"
        },
        {
            "barcode": "171112512",
            "dpc": "03033332301",
            "name": "តឿម ឃ៉ឺត"
        },
        {
            "barcode": "171112513",
            "dpc": "03033332401",
            "name": "យស់ សុផល"
        },
        {
            "barcode": "171112514",
            "dpc": "03033332501",
            "name": "ភួន ឃឿន"
        },
        {
            "barcode": "171112515",
            "dpc": "03033332601",
            "name": "គុយ ធារិន"
        },
        {
            "barcode": "171112516",
            "dpc": "03033332701",
            "name": "សោ វិចិត្រ"
        },
        {
            "barcode": "171112517",
            "dpc": "03033332801",
            "name": "ជា ថូន"
        },
        {
            "barcode": "171112518",
            "dpc": "03033332901",
            "name": "ឈិន ភារុន"
        },
        {
            "barcode": "171112519",
            "dpc": "03033333001",
            "name": "សុខ ឆវី"
        },
        {
            "barcode": "171112520",
            "dpc": "03033333101",
            "name": "ព្រាក់ ដាវី"
        },
        {
            "barcode": "171112521",
            "dpc": "03033333201",
            "name": "ជា វិដេ"
        },
        {
            "barcode": "171112522",
            "dpc": "03033333301",
            "name": "លាង ហាវ"
        },
        {
            "barcode": "171112523",
            "dpc": "03033333601",
            "name": "ព្រហ្ម សុផល"
        },
        {
            "barcode": "171112524",
            "dpc": "03033333701",
            "name": "ឡុង ស៊ីរ៉ាវុធ"
        },
        {
            "barcode": "171112525",
            "dpc": "03033333801",
            "name": "ឆៃ វណ្ណះ"
        },
        {
            "barcode": "171112526",
            "dpc": "03033333901",
            "name": "ហុក កុសល"
        },
        {
            "barcode": "171112527",
            "dpc": "03033334001",
            "name": "អូន សុគន្ធា"
        },
        {
            "barcode": "171112528",
            "dpc": "03033334101",
            "name": "ភិន សារុន"
        },
        {
            "barcode": "171112529",
            "dpc": "03033334201",
            "name": "ចៅ សុខកឿន"
        },
        {
            "barcode": "171112530",
            "dpc": "03033334301",
            "name": "កែវ សម្បត"
        },
        {
            "barcode": "171112531",
            "dpc": "03033334701",
            "name": "សោម សាវ៉ុង"
        },
        {
            "barcode": "171112532",
            "dpc": "03033334801",
            "name": "ខឹម ចៅសែន"
        },
        {
            "barcode": "171112533",
            "dpc": "03033334901",
            "name": "យឿម ចាន់ធី"
        },
        {
            "barcode": "171112534",
            "dpc": "03033335001",
            "name": "យិប វ៉ាន់"
        },
        {
            "barcode": "171112535",
            "dpc": "03033335101",
            "name": "ណាយ នឿន"
        },
        {
            "barcode": "171112536",
            "dpc": "03033335201",
            "name": "ហៀង លីណា"
        },
        {
            "barcode": "171112537",
            "dpc": "03033335301",
            "name": "ឈឿង គឹមសេង"
        },
        {
            "barcode": "171112538",
            "dpc": "03033335401",
            "name": "ឈុន រដ្ឋា"
        },
        {
            "barcode": "171112539",
            "dpc": "03033335501",
            "name": "ប៉ិច រីដា"
        },
        {
            "barcode": "171112540",
            "dpc": "03033335601",
            "name": "សុខ ចន្នី"
        },
        {
            "barcode": "171112541",
            "dpc": "03033335701",
            "name": "សាយ ចន្ធូ"
        },
        {
            "barcode": "171112542",
            "dpc": "03033335801",
            "name": "ហែម សុទ"
        },
        {
            "barcode": "171112543",
            "dpc": "03033335901",
            "name": "គិត សុចន្ទ័ដាវី"
        },
        {
            "barcode": "171112544",
            "dpc": "03033336101",
            "name": "ឆែម សាវន"
        },
        {
            "barcode": "171112545",
            "dpc": "03033336201",
            "name": "ញ៉ែម សុគន្ធា"
        },
        {
            "barcode": "171112546",
            "dpc": "03033336301",
            "name": "មឿន សារ៉ន់"
        },
        {
            "barcode": "171112547",
            "dpc": "03033336401",
            "name": "ផាន់ ចន្រ្ដា"
        },
        {
            "barcode": "171112548",
            "dpc": "03033336501",
            "name": "ឆាន់ រឿន"
        },
        {
            "barcode": "171112549",
            "dpc": "03033336601",
            "name": "ប៉ែន ធិតា"
        },
        {
            "barcode": "171112550",
            "dpc": "03033336701",
            "name": "នូ ចំណុច"
        },
        {
            "barcode": "171112551",
            "dpc": "03033336801",
            "name": "ជា សារ៉ុន"
        },
        {
            "barcode": "171112552",
            "dpc": "03033337001",
            "name": "យ៉ាន បូផៃ"
        },
        {
            "barcode": "171112553",
            "dpc": "03033337101",
            "name": "រិន រ៉ា"
        },
        {
            "barcode": "171112554",
            "dpc": "03033337201",
            "name": "រិទ្ធ សារវន"
        },
        {
            "barcode": "171112555",
            "dpc": "03033337301",
            "name": "ចែត យ៉ុម"
        },
        {
            "barcode": "171112556",
            "dpc": "03033337401",
            "name": "ពៅ ចរិយា"
        },
        {
            "barcode": "171112557",
            "dpc": "03033337501",
            "name": "ណន វណ្ណនឿន"
        },
        {
            "barcode": "171112558",
            "dpc": "03033337601",
            "name": "ឈឹម សុតា"
        },
        {
            "barcode": "171112559",
            "dpc": "03033337701",
            "name": "ភោគ សុខាត់"
        },
        {
            "barcode": "171112560",
            "dpc": "03033337801",
            "name": "សោម ប្រុស"
        },
        {
            "barcode": "171112561",
            "dpc": "03033337901",
            "name": "ឈិន ណារិទ"
        },
        {
            "barcode": "171112562",
            "dpc": "03033338001",
            "name": "គឹម ភិន"
        },
        {
            "barcode": "171112563",
            "dpc": "03033338101",
            "name": "សាក់ ស"
        },
        {
            "barcode": "171112564",
            "dpc": "03033338201",
            "name": "ទាវ សុផាត"
        },
        {
            "barcode": "171112565",
            "dpc": "03033338301",
            "name": "លី វ៉ានថេត"
        },
        {
            "barcode": "171112566",
            "dpc": "03033338401",
            "name": "រស់ ទីណាល"
        },
        {
            "barcode": "171112567",
            "dpc": "03033338501",
            "name": "យ៉ុង ចិន"
        },
        {
            "barcode": "171112568",
            "dpc": "03033338601",
            "name": "យ៉ា ម៉ៅ"
        },
        {
            "barcode": "171112569",
            "dpc": "03033338701",
            "name": "លឹម ចន្ធី"
        },
        {
            "barcode": "171112570",
            "dpc": "03033338801",
            "name": "ទិត រដ្ឋា"
        },
        {
            "barcode": "171112571",
            "dpc": "03033338901",
            "name": "វ៉ាន់ វ៉ន"
        },
        {
            "barcode": "171112572",
            "dpc": "03033339001",
            "name": "ហុង សៅលន់"
        },
        {
            "barcode": "171112573",
            "dpc": "03033339101",
            "name": "សួន ជៀប"
        },
        {
            "barcode": "171112574",
            "dpc": "03033339201",
            "name": "ទុំ សោផង់"
        },
        {
            "barcode": "171112575",
            "dpc": "03033339301",
            "name": "ស្រៀង គឹមទី"
        },
        {
            "barcode": "171112576",
            "dpc": "03033339401",
            "name": "សូ សារ៉េន"
        },
        {
            "barcode": "171112577",
            "dpc": "03033339501",
            "name": "សៅ ប៊ុនឡា"
        },
        {
            "barcode": "171112578",
            "dpc": "03033339601",
            "name": "ង៉ែត ចន្ធី"
        },
        {
            "barcode": "171112579",
            "dpc": "03033339701",
            "name": "ប៉ុក រុន"
        },
        {
            "barcode": "171112580",
            "dpc": "03033339801",
            "name": "សឿ សារី"
        },
        {
            "barcode": "171112581",
            "dpc": "03033339901",
            "name": "ឡាក់ ម៉ានី"
        },
        {
            "barcode": "171112582",
            "dpc": "03033340101",
            "name": "សន វ៉ាន់"
        },
        {
            "barcode": "171112583",
            "dpc": "03033340201",
            "name": "រិន សំអុល"
        },
        {
            "barcode": "171112584",
            "dpc": "03033340301",
            "name": "អ៊ឹង អ៊ិត១"
        },
        {
            "barcode": "171112585",
            "dpc": "03033340501",
            "name": "ជឺ ពុំ"
        },
        {
            "barcode": "171112586",
            "dpc": "03033340601",
            "name": "ហៃ សាខន"
        },
        {
            "barcode": "171112587",
            "dpc": "03033340701",
            "name": "បៀច សុផល"
        },
        {
            "barcode": "171112588",
            "dpc": "03033340801",
            "name": "ធូ រើន"
        },
        {
            "barcode": "171112589",
            "dpc": "03033340901",
            "name": "គីម យឿប"
        },
        {
            "barcode": "171112590",
            "dpc": "03033341001",
            "name": "សំ ឡុង"
        },
        {
            "barcode": "171112591",
            "dpc": "03033341101",
            "name": "ត្រាំង ចាន់ទួង"
        },
        {
            "barcode": "171112592",
            "dpc": "03033341201",
            "name": "ពុធ វ៉ាន់មុន្នី"
        },
        {
            "barcode": "171112593",
            "dpc": "03033341301",
            "name": "ជីង ហ៊ុយគួង"
        },
        {
            "barcode": "171112594",
            "dpc": "03033341401",
            "name": "យី គក់"
        },
        {
            "barcode": "171112595",
            "dpc": "03033341501",
            "name": "សុខ គង់"
        },
        {
            "barcode": "171112596",
            "dpc": "03033341801",
            "name": "ចាយ ធានី"
        },
        {
            "barcode": "171112597",
            "dpc": "03033341901",
            "name": "វី សាវេន"
        },
        {
            "barcode": "171112598",
            "dpc": "03033342101",
            "name": "ស៊ុត អ៊ួច"
        },
        {
            "barcode": "171112599",
            "dpc": "03033342201",
            "name": "សុត លាភា"
        },
        {
            "barcode": "171112600",
            "dpc": "03033342301",
            "name": "ទី  ឈឿត"
        },
        {
            "barcode": "171112601",
            "dpc": "03033342401",
            "name": "យិន ម៉ាច"
        },
        {
            "barcode": "171112602",
            "dpc": "03033342501",
            "name": "ឈឹម ម៉ារឌី"
        },
        {
            "barcode": "171112603",
            "dpc": "03033342601",
            "name": "ប៉ែន  ម៉ាន"
        },
        {
            "barcode": "171112604",
            "dpc": "03033342701",
            "name": "គឹម ឆវី"
        },
        {
            "barcode": "171112605",
            "dpc": "03033342801",
            "name": "សាំង សុគន្ធា"
        },
        {
            "barcode": "171112606",
            "dpc": "03033342901",
            "name": "សយ មៅ"
        },
        {
            "barcode": "171112607",
            "dpc": "03033343001",
            "name": "ផន ខេម"
        },
        {
            "barcode": "171112608",
            "dpc": "03033343101",
            "name": "រឿន សុធារ៉ា"
        },
        {
            "barcode": "171112609",
            "dpc": "03033343201",
            "name": "សៀង ចន្ធី"
        },
        {
            "barcode": "171112610",
            "dpc": "03033343301",
            "name": "អេ ផល្លា"
        },
        {
            "barcode": "171112611",
            "dpc": "03033343401",
            "name": "តា លិន"
        },
        {
            "barcode": "171112612",
            "dpc": "03033343501",
            "name": "ព្រឿង ចិន្តា"
        },
        {
            "barcode": "171112613",
            "dpc": "03033343601",
            "name": "វ៉ាន់ ចាន់ណូ"
        },
        {
            "barcode": "171112614",
            "dpc": "03033343701",
            "name": "ផល សុវណ្ណ"
        },
        {
            "barcode": "171112615",
            "dpc": "03033343801",
            "name": "អ៊ុំ ពន្លឺ"
        },
        {
            "barcode": "171112616",
            "dpc": "03033343901",
            "name": "ឡឹង បុប្ជា"
        },
        {
            "barcode": "171112617",
            "dpc": "03033344001",
            "name": "ឈឿង ជុំ"
        },
        {
            "barcode": "171112618",
            "dpc": "03033344101",
            "name": "ឈឿត សារួន"
        },
        {
            "barcode": "171112619",
            "dpc": "03033344201",
            "name": "ភន ភាព"
        },
        {
            "barcode": "171112620",
            "dpc": "03033344301",
            "name": "សៀម វុន"
        },
        {
            "barcode": "171112621",
            "dpc": "03033344401",
            "name": "ហូន វ៉ានឌឿន"
        },
        {
            "barcode": "171112622",
            "dpc": "03033344501",
            "name": "ជា កក្តដា"
        },
        {
            "barcode": "171112623",
            "dpc": "03033344601",
            "name": "មាន អក្ខរា"
        },
        {
            "barcode": "171112624",
            "dpc": "03033344701",
            "name": "អ៊ុច រដ្ឋា"
        },
        {
            "barcode": "171112625",
            "dpc": "03033344801",
            "name": "ប៊ុន ទូច"
        },
        {
            "barcode": "171112626",
            "dpc": "03033344901",
            "name": "សួ វណ្ណថន"
        },
        {
            "barcode": "171112627",
            "dpc": "03033345001",
            "name": "ង៉ុយ សុងហ៉ុយ"
        },
        {
            "barcode": "171112628",
            "dpc": "03033345101",
            "name": "ក្រៀល សុភាព"
        },
        {
            "barcode": "171112629",
            "dpc": "03033345201",
            "name": "ខាត់ ថង"
        },
        {
            "barcode": "171112630",
            "dpc": "03033345301",
            "name": "ញ៉ក់ ពីវ"
        },
        {
            "barcode": "171112631",
            "dpc": "03033345401",
            "name": "ស៊ិន យ៉ែម"
        },
        {
            "barcode": "171112632",
            "dpc": "03033345501",
            "name": "អ៊ុំ សុឃឿន"
        },
        {
            "barcode": "171112633",
            "dpc": "03033345601",
            "name": "លី សុធី"
        },
        {
            "barcode": "171112634",
            "dpc": "03033345701",
            "name": "អ៊ុំ ប៊ុនណយ"
        },
        {
            "barcode": "171112635",
            "dpc": "03033345801",
            "name": "ជា ពៅ"
        },
        {
            "barcode": "171112636",
            "dpc": "03033345901",
            "name": "មុំ ឆិល"
        },
        {
            "barcode": "171112637",
            "dpc": "03033346001",
            "name": "ហង្ថ វណ្ណា"
        },
        {
            "barcode": "171112638",
            "dpc": "03033346101",
            "name": "កែវ ខន"
        },
        {
            "barcode": "171112639",
            "dpc": "03033346201",
            "name": "ក្រុមហ៊ុនមិសុតា"
        }
    ];
    barcodes.forEach(function(bar){
        let customer=db.wb_customer.findOne({dpc:bar.dpc});
        db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
    });
