
let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=
    [
    {
        "barcode": "171109518",
        "dpc": "03043660001",
        "name": "ហួយ ចិត្រា"
    },
    {
        "barcode": "171109519",
        "dpc": "03043659901",
        "name": "សួស សារឿន"
    },
    {
        "barcode": "171109520",
        "dpc": "03043659801",
        "name": "គឹម ភឿន"
    },
    {
        "barcode": "171109521",
        "dpc": "03043659701",
        "name": "ស្រ៊ីង រតនា"
    },
    {
        "barcode": "171109522",
        "dpc": "03043659601",
        "name": "សរ សារិទ្ទ"
    },
    {
        "barcode": "171109523",
        "dpc": "03043659501",
        "name": "ជី តុងងួន"
    },
    {
        "barcode": "171109524",
        "dpc": "03043659401",
        "name": "រស់ ចំរើន"
    },
    {
        "barcode": "171109525",
        "dpc": "03043659301",
        "name": "គង់ សំណាង"
    },
    {
        "barcode": "171109526",
        "dpc": "03043659201",
        "name": "ប៊ុន សំនៀង"
    },
    {
        "barcode": "171109527",
        "dpc": "03043659101",
        "name": "គង់ រតនៈសម្បត្តិ"
    },
    {
        "barcode": "171109528",
        "dpc": "03043659001",
        "name": "អ៊ឹង ឡេងហ៊ាង"
    },
    {
        "barcode": "171109529",
        "dpc": "03043658901",
        "name": "គង់ ដាវីម៉ូណ៉ែត"
    },
    {
        "barcode": "171109530",
        "dpc": "03043658701",
        "name": "រ៉ាន់ រ៉ឿត"
    },
    {
        "barcode": "171109531",
        "dpc": "03043658601",
        "name": "ព្រឿង សារ៉ាន"
    },
    {
        "barcode": "171109532",
        "dpc": "03043658501",
        "name": "ស៊ីន សុភ័ក្រ្ត"
    },
    {
        "barcode": "171109533",
        "dpc": "03043658301",
        "name": "សន ស៊ីផាត"
    },
    {
        "barcode": "171109534",
        "dpc": "03043658201",
        "name": "ស្រឿ គឹមជួរ"
    },
    {
        "barcode": "171109535",
        "dpc": "03043658101",
        "name": "ស្រឿ គឹមស៊ា"
    },
    {
        "barcode": "171109536",
        "dpc": "03043658001",
        "name": "ជន សុភក្រ័"
    },
    {
        "barcode": "171109537",
        "dpc": "03043657901",
        "name": "សំ ផាណន"
    },
    {
        "barcode": "171109538",
        "dpc": "03043657801",
        "name": "ទុយ ជា"
    },
    {
        "barcode": "171109539",
        "dpc": "03043657701",
        "name": "ឡាយ វន"
    },
    {
        "barcode": "171109540",
        "dpc": "03043657601",
        "name": "រ៉ែម រ៉ាន់"
    },
    {
        "barcode": "171109541",
        "dpc": "03043657401",
        "name": "យី វិរៈ"
    },
    {
        "barcode": "171109542",
        "dpc": "03043657301",
        "name": "ឆូត ឆុង"
    },
    {
        "barcode": "171109543",
        "dpc": "03043657201",
        "name": "ជួប វុតថា"
    },
    {
        "barcode": "171109544",
        "dpc": "03043657101",
        "name": "ឆាយ សាវន"
    },
    {
        "barcode": "171109545",
        "dpc": "03043657001",
        "name": "ពេទ្យ សាវិន"
    },
    {
        "barcode": "171109546",
        "dpc": "03043656901",
        "name": "រើន វុឌ្ឃី"
    },
    {
        "barcode": "171109547",
        "dpc": "03043656801",
        "name": "រ៉ាវុធ អូលិវីយ៉េ"
    },
    {
        "barcode": "171109548",
        "dpc": "03043656701",
        "name": "ឈិត ចាន់ថន"
    },
    {
        "barcode": "171109549",
        "dpc": "03043656601",
        "name": "ឈឿម សភាព"
    },
    {
        "barcode": "171109550",
        "dpc": "03043656501",
        "name": "គង់ ហេងងួន"
    },
    {
        "barcode": "171109551",
        "dpc": "03043656401",
        "name": "អតិថិជនថ្មី"
    },
    {
        "barcode": "171109552",
        "dpc": "03043656301",
        "name": "សេង ងយ"
    },
    {
        "barcode": "171109553",
        "dpc": "03043656201",
        "name": "គង់ លក្ខិណា"
    },
    {
        "barcode": "171109554",
        "dpc": "03043656101",
        "name": "ជាតិ"
    },
    {
        "barcode": "171109555",
        "dpc": "03043656001",
        "name": "សុង ចាន់"
    },
    {
        "barcode": "171109556",
        "dpc": "03043655901",
        "name": "លន់ ម៉ាប់"
    },
    {
        "barcode": "171109557",
        "dpc": "03043655701",
        "name": "ណ ណាវ"
    },
    {
        "barcode": "171109558",
        "dpc": "03043655601",
        "name": "ជិន រៀប"
    },
    {
        "barcode": "171109559",
        "dpc": "03043655501",
        "name": "ផាន់ ពីសី"
    },
    {
        "barcode": "171109560",
        "dpc": "03043655401",
        "name": "សេង សំអុល"
    },
    {
        "barcode": "171109561",
        "dpc": "03043655301",
        "name": "អង វើន"
    },
    {
        "barcode": "171109562",
        "dpc": "03043655201",
        "name": "សោម សិលា"
    },
    {
        "barcode": "171109563",
        "dpc": "03043655101",
        "name": "អ៊ិត សុផានី"
    },
    {
        "barcode": "171109564",
        "dpc": "03043655001",
        "name": "មាស់ សឿត"
    },
    {
        "barcode": "171109565",
        "dpc": "03043654901",
        "name": "ណ ណាល់"
    },
    {
        "barcode": "171109566",
        "dpc": "03043654801",
        "name": "ឌិត ណូក"
    },
    {
        "barcode": "171109567",
        "dpc": "03043654701",
        "name": "កោ សេរីវឌ្ឍន៍"
    },
    {
        "barcode": "171109568",
        "dpc": "03043654601",
        "name": "ហ៊ឹម ហ៊ីង"
    },
    {
        "barcode": "171109569",
        "dpc": "03043654501",
        "name": "ស្រី សំអឿន"
    },
    {
        "barcode": "171109570",
        "dpc": "03043654401",
        "name": "វ៉ាត ឆាត"
    },
    {
        "barcode": "171109571",
        "dpc": "03043654001",
        "name": "ណយ សាន់"
    },
    {
        "barcode": "171109572",
        "dpc": "03043654101",
        "name": "ណយ សុភី"
    },
    {
        "barcode": "171109573",
        "dpc": "03043653901",
        "name": "យ៉ែម សាវី"
    },
    {
        "barcode": "171109574",
        "dpc": "03043653801",
        "name": "យឹម ស៊ាប"
    },
    {
        "barcode": "171109575",
        "dpc": "03043653701",
        "name": "ភាជ សំបូរ"
    },
    {
        "barcode": "171109576",
        "dpc": "03043653601",
        "name": "ផិត ផាន់ណា"
    },
    {
        "barcode": "171109577",
        "dpc": "03043653501",
        "name": "សួង តារ៉ា"
    },
    {
        "barcode": "171109578",
        "dpc": "03043653401",
        "name": "អៀង ណារិន"
    },
    {
        "barcode": "171109579",
        "dpc": "03043653301",
        "name": "ភាជ ភឿត"
    },
    {
        "barcode": "171109580",
        "dpc": "03043653201",
        "name": "ហម ថង"
    },
    {
        "barcode": "171109581",
        "dpc": "03043653101",
        "name": "ឆោម ឆន"
    },
    {
        "barcode": "171109582",
        "dpc": "03043653001",
        "name": "យិន ប៉ុន"
    },
    {
        "barcode": "171109583",
        "dpc": "03043652901",
        "name": "ហេង ទ្រី"
    },
    {
        "barcode": "171109584",
        "dpc": "03043652801",
        "name": "ហេង ស៊ីម"
    },
    {
        "barcode": "171109585",
        "dpc": "03043652701",
        "name": "ឈឿ សភាសិត"
    },
    {
        "barcode": "171109586",
        "dpc": "03043652601",
        "name": "ចាន់ រ៉ាត់"
    },
    {
        "barcode": "171109587",
        "dpc": "03043652501",
        "name": "វុន វុទ្ធី"
    },
    {
        "barcode": "171109588",
        "dpc": "03043652401",
        "name": "ញ៉ន គង្គា"
    },
    {
        "barcode": "171109589",
        "dpc": "03043652301",
        "name": "ង៉ា រៀង"
    },
    {
        "barcode": "171109590",
        "dpc": "03043652201",
        "name": "កែវ សារៀន"
    },
    {
        "barcode": "171109591",
        "dpc": "03043652101",
        "name": "មុត ស៊ីណា"
    },
    {
        "barcode": "171109592",
        "dpc": "03043652001",
        "name": "ចាន់ សំណាង"
    },
    {
        "barcode": "171109593",
        "dpc": "03043651901",
        "name": "ចាន់ រឿន"
    },
    {
        "barcode": "171109594",
        "dpc": "03043651801",
        "name": "ឈឿម ម៉ារី"
    },
    {
        "barcode": "171109595",
        "dpc": "03043651701",
        "name": "អុំ ធីម"
    },
    {
        "barcode": "171109596",
        "dpc": "03043651601",
        "name": "ស្រូច ចាន់ណា"
    },
    {
        "barcode": "171109597",
        "dpc": "03043651501",
        "name": "ស្រូច ចាន់នី"
    },
    {
        "barcode": "171109598",
        "dpc": "03043651401",
        "name": "ប៉ន សុផានី"
    },
    {
        "barcode": "171109599",
        "dpc": "03043651301",
        "name": "ងួន សុជាតា"
    },
    {
        "barcode": "171109600",
        "dpc": "03043651201",
        "name": "ប៉ន សាវុន"
    },
    {
        "barcode": "171109601",
        "dpc": "03043651101",
        "name": "ប៉ន ស្រីឡុច"
    },
    {
        "barcode": "171109602",
        "dpc": "03043651001",
        "name": "ប៉ន វិចិត្រ"
    },
    {
        "barcode": "171109603",
        "dpc": "03043650901",
        "name": "សយ សារេម"
    },
    {
        "barcode": "171109604",
        "dpc": "03043650801",
        "name": "ប៉ា សុហេង"
    },
    {
        "barcode": "171109605",
        "dpc": "03043650701",
        "name": "រ៉ាយ ចិន្តា"
    },
    {
        "barcode": "171109606",
        "dpc": "03043650601",
        "name": "នក់ សុភាន់"
    },
    {
        "barcode": "171109607",
        "dpc": "03043650501",
        "name": "ចាន់ នី"
    },
    {
        "barcode": "171109608",
        "dpc": "03043650401",
        "name": "សំ ចន្តិា"
    },
    {
        "barcode": "171109609",
        "dpc": "03043650301",
        "name": "ឈុំ ភាន់"
    },
    {
        "barcode": "171109610",
        "dpc": "03043650201",
        "name": "ចាន់ សាវី"
    },
    {
        "barcode": "171109611",
        "dpc": "03043650101",
        "name": "ស៊ិន មុំ"
    },
    {
        "barcode": "171109612",
        "dpc": "03043650001",
        "name": "ណាវ អមរិណ"
    },
    {
        "barcode": "171109613",
        "dpc": "03043649801",
        "name": "ពិន ចាន់រី"
    },
    {
        "barcode": "171109614",
        "dpc": "03043649601",
        "name": "ពិន សាម៉ន"
    },
    {
        "barcode": "171109615",
        "dpc": "03043649501",
        "name": "ខេម រៈ"
    },
    {
        "barcode": "171109616",
        "dpc": "03043649401",
        "name": "យ៉ន សៅលី"
    },
    {
        "barcode": "171109617",
        "dpc": "03043649301",
        "name": "ពិន ទួច"
    },
    {
        "barcode": "171109618",
        "dpc": "03043649201",
        "name": "ពិន វុធ"
    },
    {
        "barcode": "171109619",
        "dpc": "03043649101",
        "name": "ស៊ីម សេង"
    },
    {
        "barcode": "171109620",
        "dpc": "03043649001",
        "name": "ស៊ិន រាត់"
    },
    {
        "barcode": "171109621",
        "dpc": "03043648901",
        "name": "ពិន ព្រែក"
    },
    {
        "barcode": "171109622",
        "dpc": "03043648801",
        "name": "ពិន រឿត"
    },
    {
        "barcode": "171109623",
        "dpc": "03043648701",
        "name": "ជូន ញឹប"
    },
    {
        "barcode": "171109624",
        "dpc": "03043648601",
        "name": "ខៀវ សុផាន"
    },
    {
        "barcode": "171109625",
        "dpc": "03043648501",
        "name": "គង់ ចាន់ទី"
    },
    {
        "barcode": "171109626",
        "dpc": "03043648401",
        "name": "គង់ រ៉ាត់"
    },
    {
        "barcode": "171109627",
        "dpc": "03043648301",
        "name": "គង់ ចាន់ធី"
    },
    {
        "barcode": "171109628",
        "dpc": "03043648201",
        "name": "ហឹម ភឿត"
    },
    {
        "barcode": "171109629",
        "dpc": "03043648101",
        "name": "គង់ សម្បត្តិ"
    },
    {
        "barcode": "171109630",
        "dpc": "03043648001",
        "name": "សម្បត្តិ រ៉ា"
    },
    {
        "barcode": "171109631",
        "dpc": "03043647901",
        "name": "សុខ លីន"
    },
    {
        "barcode": "171109632",
        "dpc": "03043647701",
        "name": "ហូ សុខហេង"
    },
    {
        "barcode": "171109633",
        "dpc": "03043647501",
        "name": "វ៉ាន់ សុខា"
    },
    {
        "barcode": "171109634",
        "dpc": "03043647401",
        "name": "ដាំ ឈឿយ"
    },
    {
        "barcode": "171109635",
        "dpc": "03043647301",
        "name": "យ៉ម សារិន"
    },
    {
        "barcode": "171109636",
        "dpc": "03043647201",
        "name": "យ៉ង សំនៀង"
    },
    {
        "barcode": "171109637",
        "dpc": "03043647101",
        "name": "ជា ប៊ុនលី"
    },
    {
        "barcode": "171109638",
        "dpc": "03043647001",
        "name": "ឡាយ តូច"
    },
    {
        "barcode": "171109639",
        "dpc": "03043646801",
        "name": "ចាន់ តុន"
    },
    {
        "barcode": "171109640",
        "dpc": "03043646601",
        "name": "រស់ ពៅ"
    },
    {
        "barcode": "171109641",
        "dpc": "03043646501",
        "name": "អ៊ឺង គឹមស៊ន"
    },
    {
        "barcode": "171109642",
        "dpc": "03043646401",
        "name": "យន់ គឹមយ៉ុន"
    },
    {
        "barcode": "171109643",
        "dpc": "03043646301",
        "name": "យ៉ម ពៅ"
    },
    {
        "barcode": "171109644",
        "dpc": "03043646201",
        "name": "ហ្ស៊ី ហ្គេ"
    },
    {
        "barcode": "171109645",
        "dpc": "03043646101",
        "name": "គឹម ហ៊ួ"
    },
    {
        "barcode": "171109646",
        "dpc": "03043646001",
        "name": "រដ្ឋ ធានី"
    },
    {
        "barcode": "171109647",
        "dpc": "03043645801",
        "name": "កែវ ហួយ"
    },
    {
        "barcode": "171109648",
        "dpc": "03043645701",
        "name": "សានិត វិសាល"
    },
    {
        "barcode": "171109649",
        "dpc": "03043645601",
        "name": "ឃុត សុខុន"
    },
    {
        "barcode": "171109650",
        "dpc": "03043645501",
        "name": "កើ ម៉ាត់សេត"
    },
    {
        "barcode": "171109651",
        "dpc": "03043645401",
        "name": "យុន យីម"
    },
    {
        "barcode": "171109652",
        "dpc": "03043645301",
        "name": "សោះ អាពីឌះ"
    },
    {
        "barcode": "171109653",
        "dpc": "03043645201",
        "name": "ម៉ិល ខុម"
    },
    {
        "barcode": "171109654",
        "dpc": "03043645101",
        "name": "កូប តាស់"
    },
    {
        "barcode": "171109655",
        "dpc": "03043645001",
        "name": "តូន ហ្វាឌីឡាស់"
    },
    {
        "barcode": "171109656",
        "dpc": "03043644901",
        "name": "សេន ស្មារី"
    },
    {
        "barcode": "171109657",
        "dpc": "03043644701",
        "name": "នាក់ រ៉ូសេត"
    },
    {
        "barcode": "171109658",
        "dpc": "03043644601",
        "name": "រ៉ិត រ៉ូសេត"
    },
    {
        "barcode": "171109659",
        "dpc": "03043644501",
        "name": "ម៉ាន សុខា"
    },
    {
        "barcode": "171109660",
        "dpc": "03043644401",
        "name": "ឡោះ ហាំ"
    },
    {
        "barcode": "171109661",
        "dpc": "03043644301",
        "name": "ម៉ី ពោ"
    },
    {
        "barcode": "171109662",
        "dpc": "03043644201",
        "name": "រស់ ម៉ារី"
    },
    {
        "barcode": "171109663",
        "dpc": "03043644101",
        "name": "នី អាស់ម៉ាត់"
    },
    {
        "barcode": "171109664",
        "dpc": "03043644001",
        "name": "ម៉ាត់ សារីហាស់"
    },
    {
        "barcode": "171109665",
        "dpc": "03043643901",
        "name": "ឡឹប ខឡេស"
    },
    {
        "barcode": "171109666",
        "dpc": "03043643801",
        "name": "មីន ទីកាស់"
    },
    {
        "barcode": "171109667",
        "dpc": "03043643701",
        "name": "យួប ហាប់ស្រស់"
    },
    {
        "barcode": "171109668",
        "dpc": "03043643601",
        "name": "កែវ យើ"
    },
    {
        "barcode": "171109669",
        "dpc": "03043643501",
        "name": "លី ស៊ូគី"
    },
    {
        "barcode": "171109670",
        "dpc": "03043643401",
        "name": "ស្មាន ហ្សារី"
    },
    {
        "barcode": "171109671",
        "dpc": "03043643301",
        "name": "ម៉ាន ហាលី"
    },
    {
        "barcode": "171109672",
        "dpc": "03043643201",
        "name": "ការទ័រហ្វាស៊ី"
    },
    {
        "barcode": "171109673",
        "dpc": "03043643101",
        "name": "ម៉ក់ ហឿម"
    },
    {
        "barcode": "171109674",
        "dpc": "03043643001",
        "name": "ទេស ពៅ"
    },
    {
        "barcode": "171109675",
        "dpc": "03043642801",
        "name": "ទេស ប៉ិច"
    },
    {
        "barcode": "171109676",
        "dpc": "03043642701",
        "name": "ឡុច វ៉ាន"
    },
    {
        "barcode": "171109677",
        "dpc": "03043642601",
        "name": "អ៊ុក ធា"
    },
    {
        "barcode": "171109678",
        "dpc": "03043642501",
        "name": "រិទ្ធ សុវណ្ណារ៉ា"
    },
    {
        "barcode": "171109679",
        "dpc": "03043642401",
        "name": "ជីម សារ៉ាយ"
    },
    {
        "barcode": "171109680",
        "dpc": "03043642301",
        "name": "ឌុច ឌឿន"
    },
    {
        "barcode": "171109681",
        "dpc": "03043642201",
        "name": "តាត តឿម"
    },
    {
        "barcode": "171109682",
        "dpc": "03043642001",
        "name": "ឡប សារ៉ាត់"
    },
    {
        "barcode": "171109683",
        "dpc": "03043641901",
        "name": "ម៉ាត់ ប៉ាកៀត"
    },
    {
        "barcode": "171109684",
        "dpc": "03043641601",
        "name": "អតិថិជនថ្មី"
    },
    {
        "barcode": "171109685",
        "dpc": "03043641501",
        "name": "លន់ សំណាង"
    },
    {
        "barcode": "171109686",
        "dpc": "03043641401",
        "name": "ធុយ ធី"
    },
    {
        "barcode": "171109687",
        "dpc": "03043641301",
        "name": "ប៉ិល សារិម"
    },
    {
        "barcode": "171109688",
        "dpc": "03043641201",
        "name": "សៅ សុធា"
    },
    {
        "barcode": "171109689",
        "dpc": "03043641101",
        "name": "លន់ វ៉ា"
    },
    {
        "barcode": "171109690",
        "dpc": "03043641001",
        "name": "អ៊ួ សុវណ្ណារ៉ា"
    },
    {
        "barcode": "171109691",
        "dpc": "03043640901",
        "name": "រាជ យន់"
    },
    {
        "barcode": "171109692",
        "dpc": "03043640801",
        "name": "ចក់ យូវ"
    },
    {
        "barcode": "171109693",
        "dpc": "03043640701",
        "name": "ផាន់ ផារី"
    },
    {
        "barcode": "171109694",
        "dpc": "03043640601",
        "name": "ប្រាក់ ដារីន"
    },
    {
        "barcode": "171109695",
        "dpc": "03043640501",
        "name": "ក្រិច ឡុង"
    },
    {
        "barcode": "171109696",
        "dpc": "03043640401",
        "name": "ហ៊ីង សារឿន"
    },
    {
        "barcode": "171109697",
        "dpc": "03043640301",
        "name": "លន់ សុខុន"
    },
    {
        "barcode": "171109698",
        "dpc": "03043640201",
        "name": "ប្រឹង បី"
    },
    {
        "barcode": "171109699",
        "dpc": "03043640101",
        "name": "ពឿន ធី"
    },
    {
        "barcode": "171109700",
        "dpc": "03043640001",
        "name": "ទុំ ផាន់ណា"
    },
    {
        "barcode": "171109701",
        "dpc": "03043639901",
        "name": "ងិន ភន"
    },
    {
        "barcode": "171109702",
        "dpc": "03043639701",
        "name": "ផាត់ ផារិម"
    },
    {
        "barcode": "171109703",
        "dpc": "03043639601",
        "name": "រិន រចនា"
    },
    {
        "barcode": "171109704",
        "dpc": "03043639501",
        "name": "ពុំ វណ្ណរ័ត្ន"
    },
    {
        "barcode": "171109705",
        "dpc": "03043639401",
        "name": "ថោង រី"
    },
    {
        "barcode": "171109706",
        "dpc": "03043639301",
        "name": "ម៉ុន ម៉ុត"
    },
    {
        "barcode": "171109707",
        "dpc": "03043639201",
        "name": "ចាន់ សុមាលី"
    },
    {
        "barcode": "171109708",
        "dpc": "03043639101",
        "name": "ខុន សុខេន"
    },
    {
        "barcode": "171109709",
        "dpc": "03043639001",
        "name": "អែម ពុធថា"
    },
    {
        "barcode": "171109710",
        "dpc": "03043638801",
        "name": "កែវ នេត"
    },
    {
        "barcode": "171109711",
        "dpc": "03043638701",
        "name": "កែវ ចន្ថា"
    },
    {
        "barcode": "171109712",
        "dpc": "03043638501",
        "name": "គីម វ៉ាន់"
    },
    {
        "barcode": "171109713",
        "dpc": "03043638401",
        "name": "កាន់ ទ្រី"
    },
    {
        "barcode": "171109714",
        "dpc": "03043638301",
        "name": "ម៉ី ឡុញ"
    },
    {
        "barcode": "171109715",
        "dpc": "03043638201",
        "name": "ស៊ុន ទូច"
    },
    {
        "barcode": "171109716",
        "dpc": "03043638101",
        "name": "ថោ ចាន់ណា"
    },
    {
        "barcode": "171109717",
        "dpc": "03043638001",
        "name": "ជិន ឆន"
    },
    {
        "barcode": "171109718",
        "dpc": "03043637901",
        "name": "ស្រី សោភណ័្ឌ"
    },
    {
        "barcode": "171109719",
        "dpc": "03043637801",
        "name": "សុះ មីន"
    },
    {
        "barcode": "171109720",
        "dpc": "03043637701",
        "name": "ម៉ារិន ឧត្តមឆៃ"
    },
    {
        "barcode": "171109721",
        "dpc": "03043637601",
        "name": "គង់ ឡេង"
    },
    {
        "barcode": "171109722",
        "dpc": "03043637501",
        "name": "ណុប សាមិ"
    },
    {
        "barcode": "171109723",
        "dpc": "03043637301",
        "name": "នៅ សុធា"
    },
    {
        "barcode": "171109724",
        "dpc": "03043637201",
        "name": "ម៉ម សំណាង"
    },
    {
        "barcode": "171109725",
        "dpc": "03043637101",
        "name": "អុំ រ៉ា"
    },
    {
        "barcode": "171109726",
        "dpc": "03043637001",
        "name": "អុំ លន់អេង"
    },
    {
        "barcode": "171109727",
        "dpc": "03043636901",
        "name": "ជិន យឿន"
    },
    {
        "barcode": "171109728",
        "dpc": "03043636801",
        "name": "ភួង ស៊ីយ៉ុន"
    },
    {
        "barcode": "171109729",
        "dpc": "03043636701",
        "name": "ហង្ស ហេង"
    },
    {
        "barcode": "171109730",
        "dpc": "03043636601",
        "name": "មួន សរិទ្ធ"
    },
    {
        "barcode": "171109731",
        "dpc": "03043636501",
        "name": "កូវ សាវ៉ន"
    },
    {
        "barcode": "171109732",
        "dpc": "03043636301",
        "name": "ថោង ចន្ថា"
    },
    {
        "barcode": "171109733",
        "dpc": "03043636201",
        "name": "ស្រី ចិន្តា"
    },
    {
        "barcode": "171109734",
        "dpc": "03043636101",
        "name": "ស្រី ចន្ធូ"
    },
    {
        "barcode": "171109735",
        "dpc": "03043636001",
        "name": "អ៊ុយ យូន"
    },
    {
        "barcode": "171109736",
        "dpc": "03043635801",
        "name": "មាស ផល្លា"
    },
    {
        "barcode": "171109737",
        "dpc": "03043635701",
        "name": "ម៉ុត សួន"
    },
    {
        "barcode": "171109738",
        "dpc": "03043635601",
        "name": "តាម វៃ២"
    },
    {
        "barcode": "171109739",
        "dpc": "03043635501",
        "name": "ណែត"
    },
    {
        "barcode": "171109740",
        "dpc": "03043635401",
        "name": "ឈុន ប៊ុនសុវណ្ណ"
    },
    {
        "barcode": "171109741",
        "dpc": "03043635301",
        "name": "ហែម នីម"
    },
    {
        "barcode": "171109742",
        "dpc": "03043635201",
        "name": "គឹម ផារុណ"
    },
    {
        "barcode": "171109743",
        "dpc": "03043635101",
        "name": "ស្រី ម៉ៅ"
    },
    {
        "barcode": "171109744",
        "dpc": "03043634901",
        "name": "សួស ផល្លី"
    },
    {
        "barcode": "171109745",
        "dpc": "03043634801",
        "name": "ឌិប សាតុន"
    },
    {
        "barcode": "171109746",
        "dpc": "03043634501",
        "name": "ជា សំអាត"
    },
    {
        "barcode": "171109747",
        "dpc": "03043634401",
        "name": "សុគន្ធ ណារី"
    },
    {
        "barcode": "171109748",
        "dpc": "03043634301",
        "name": "ធី ចាន់ភា"
    },
    {
        "barcode": "171109749",
        "dpc": "03043634201",
        "name": "ចាន់ សុភី"
    },
    {
        "barcode": "171109750",
        "dpc": "03043634101",
        "name": "ចាយ​ ពៅ"
    },
    {
        "barcode": "171109751",
        "dpc": "03043634001",
        "name": "សឹង មុំ"
    },
    {
        "barcode": "171109752",
        "dpc": "03043633901",
        "name": "អុំ ណាវុធ"
    },
    {
        "barcode": "171109753",
        "dpc": "03043633801",
        "name": "សិន ផល្លី"
    },
    {
        "barcode": "171109754",
        "dpc": "03043633701",
        "name": "ម៉ៃ ភុ"
    },
    {
        "barcode": "171109755",
        "dpc": "03043633601",
        "name": "លិវ សារ៉ូ"
    },
    {
        "barcode": "171109756",
        "dpc": "03043633401",
        "name": "លឿង សុឃីម"
    },
    {
        "barcode": "171109757",
        "dpc": "03043633301",
        "name": "សែម សាវ៉ាត"
    },
    {
        "barcode": "171109758",
        "dpc": "03043633201",
        "name": "ប៉ុល សុភា"
    },
    {
        "barcode": "171109759",
        "dpc": "03043633101",
        "name": "សុង សាយ"
    },
    {
        "barcode": "171109760",
        "dpc": "03043633001",
        "name": "ចែម ស៊ីនួន"
    },
    {
        "barcode": "171109761",
        "dpc": "03043632901",
        "name": "មិត្ត តាំ"
    },
    {
        "barcode": "171109762",
        "dpc": "03043632801",
        "name": "ភិន ភេន"
    },
    {
        "barcode": "171109763",
        "dpc": "03043632601",
        "name": "នន់ ណង់"
    },
    {
        "barcode": "171109764",
        "dpc": "03043632501",
        "name": "យី ជាល"
    },
    {
        "barcode": "171109765",
        "dpc": "03043632401",
        "name": "មេត សុធី"
    },
    {
        "barcode": "171109766",
        "dpc": "03043632201",
        "name": "សុខ ឡេង"
    },
    {
        "barcode": "171109767",
        "dpc": "03043632101",
        "name": "ចេក លួង"
    },
    {
        "barcode": "171109768",
        "dpc": "03043632001",
        "name": "អីវ ឡុញ"
    },
    {
        "barcode": "171109769",
        "dpc": "03043631901",
        "name": "ង៉ោល សឿង"
    },
    {
        "barcode": "171109770",
        "dpc": "03043631601",
        "name": "វ៉ាន់ នៅ"
    },
    {
        "barcode": "171109771",
        "dpc": "03043631501",
        "name": "ហែម សារ៉ន"
    },
    {
        "barcode": "171109772",
        "dpc": "03043631401",
        "name": "យើ មាន"
    },
    {
        "barcode": "171109773",
        "dpc": "03043631301",
        "name": "អិន វីរ៉ា"
    },
    {
        "barcode": "171109774",
        "dpc": "03043631201",
        "name": "ប៉ាល សុភឿត"
    },
    {
        "barcode": "171109775",
        "dpc": "03043631001",
        "name": "ឃីន សឿន"
    },
    {
        "barcode": "171109776",
        "dpc": "03043630701",
        "name": "យឺន បុប្ឋា"
    },
    {
        "barcode": "171109777",
        "dpc": "03043630601",
        "name": "នឿន រិទ្ជ"
    },
    {
        "barcode": "171109778",
        "dpc": "03043630501",
        "name": "លួម ណារី"
    },
    {
        "barcode": "171109779",
        "dpc": "03043630401",
        "name": "រៀប សារៀង"
    },
    {
        "barcode": "171109780",
        "dpc": "03043630301",
        "name": "ឯល ដា"
    },
    {
        "barcode": "171109781",
        "dpc": "03043630201",
        "name": "ស៊ន​ លី"
    },
    {
        "barcode": "171109782",
        "dpc": "03043630101",
        "name": "បឿន ភាព"
    },
    {
        "barcode": "171109783",
        "dpc": "03043630001",
        "name": "យឿម ដារ៉ា"
    },
    {
        "barcode": "171109784",
        "dpc": "03043629901",
        "name": "ឡម គង់"
    },
    {
        "barcode": "171109785",
        "dpc": "03043629801",
        "name": "ជូន សុភាព"
    },
    {
        "barcode": "171109786",
        "dpc": "03043629701",
        "name": "ស៊ីវន ខេមរុន"
    },
    {
        "barcode": "171109787",
        "dpc": "03043629601",
        "name": "ហុក វុទ្ធី"
    },
    {
        "barcode": "171109788",
        "dpc": "03043629501",
        "name": "អ៊ឹង ផល្គុន"
    },
    {
        "barcode": "171109789",
        "dpc": "03043629301",
        "name": "មៀច ចំរើន"
    },
    {
        "barcode": "171109790",
        "dpc": "03043629201",
        "name": "ម៉ែន ប៊ុនហឿន"
    },
    {
        "barcode": "171109791",
        "dpc": "03043629101",
        "name": "ទេព ស៊ឹម"
    },
    {
        "barcode": "171109792",
        "dpc": "03043629001",
        "name": "ផាន ម៉ាលី"
    },
    {
        "barcode": "171109793",
        "dpc": "03043628801",
        "name": "តេង វឿត"
    },
    {
        "barcode": "171109794",
        "dpc": "03043628701",
        "name": "រស់ សេងហុង"
    },
    {
        "barcode": "171109795",
        "dpc": "03043628601",
        "name": "សរ ណាវី"
    },
    {
        "barcode": "171109796",
        "dpc": "03043628501",
        "name": "លុយ សុវណ្ណ"
    },
    {
        "barcode": "171109797",
        "dpc": "03043628201",
        "name": "អែម សុខា"
    },
    {
        "barcode": "171109798",
        "dpc": "03043628101",
        "name": "គីម សេង"
    },
    {
        "barcode": "171109799",
        "dpc": "03043628001",
        "name": "ឡី តង"
    },
    {
        "barcode": "171109800",
        "dpc": "03043627901",
        "name": "វ៉ាន់ សម្បត្តិ"
    },
    {
        "barcode": "171109801",
        "dpc": "03043627701",
        "name": "រិទ្ធ បុណ្ណា"
    },
    {
        "barcode": "171109802",
        "dpc": "03043627601",
        "name": "សូ ជា"
    },
    {
        "barcode": "171109803",
        "dpc": "03043627401",
        "name": "នីន សោភ័ណ្ឌ"
    },
    {
        "barcode": "171109804",
        "dpc": "03043627301",
        "name": "អ៊ុយ ហួន"
    },
    {
        "barcode": "171109805",
        "dpc": "03043627101",
        "name": "រឿម សាវៃ"
    },
    {
        "barcode": "171109806",
        "dpc": "03043627001",
        "name": "សុខ ប៊ុនដារ៉ា"
    },
    {
        "barcode": "171109807",
        "dpc": "03043626901",
        "name": "ឈិន ចន្ថា"
    },
    {
        "barcode": "171109808",
        "dpc": "03043626801",
        "name": "កុប តុលា"
    },
    {
        "barcode": "171109809",
        "dpc": "03043626701",
        "name": "សួន ពៅ"
    },
    {
        "barcode": "171109810",
        "dpc": "03043626501",
        "name": "ឌុក វន"
    },
    {
        "barcode": "171109811",
        "dpc": "03043626401",
        "name": "ផាន សំអុល"
    },
    {
        "barcode": "171109812",
        "dpc": "03043626301",
        "name": "ជន សារេន"
    },
    {
        "barcode": "171109813",
        "dpc": "03043626201",
        "name": "ជន សារ៉េត"
    },
    {
        "barcode": "171109814",
        "dpc": "03043626101",
        "name": "ជន គ្រី"
    },
    {
        "barcode": "171109815",
        "dpc": "03043626001",
        "name": "ថាំង សុផា"
    },
    {
        "barcode": "171109816",
        "dpc": "03043625901",
        "name": "ញាំ សាវេត"
    },
    {
        "barcode": "171109817",
        "dpc": "03043625801",
        "name": "អឿន រី"
    },
    {
        "barcode": "171109818",
        "dpc": "03043625701",
        "name": "ហែម ភីរម្យ"
    },
    {
        "barcode": "171109819",
        "dpc": "03043625601",
        "name": "ពត ភាព"
    },
    {
        "barcode": "171109820",
        "dpc": "03043625501",
        "name": "អេ ភាព"
    },
    {
        "barcode": "171109821",
        "dpc": "03043625401",
        "name": "រី រ៉ូន"
    },
    {
        "barcode": "171109822",
        "dpc": "03043625301",
        "name": "ហេង ប៉ិច"
    },
    {
        "barcode": "171109823",
        "dpc": "03043625201",
        "name": "រិទ្ធ សួម"
    },
    {
        "barcode": "171109824",
        "dpc": "03043625101",
        "name": "កង សុធា"
    },
    {
        "barcode": "171109825",
        "dpc": "03043625001",
        "name": "កង សុខា"
    },
    {
        "barcode": "171109826",
        "dpc": "03043624801",
        "name": "សៅរ សម្បូណ៍"
    },
    {
        "barcode": "171109827",
        "dpc": "03043624701",
        "name": "ទែន រស្មី"
    },
    {
        "barcode": "171109828",
        "dpc": "03043624601",
        "name": "អ៊ិត ធីតា"
    },
    {
        "barcode": "171109829",
        "dpc": "03043624401",
        "name": "ឡាច រដ្ឋ"
    },
    {
        "barcode": "171109830",
        "dpc": "03043624301",
        "name": "ឡុច រស្មី"
    },
    {
        "barcode": "171109831",
        "dpc": "03043624201",
        "name": "ស៊ុម សុគន្ធ"
    },
    {
        "barcode": "171109832",
        "dpc": "03043624101",
        "name": "រេន សុខារ៉ា"
    },
    {
        "barcode": "171109833",
        "dpc": "03043624001",
        "name": "ហុង ស្រេង"
    },
    {
        "barcode": "171109834",
        "dpc": "03043623901",
        "name": "រុន សារី"
    },
    {
        "barcode": "171109835",
        "dpc": "03043623701",
        "name": "ញ៉ុក សុខា"
    },
    {
        "barcode": "171109836",
        "dpc": "03043623401",
        "name": "សិម សារីយ៉ាស់"
    },
    {
        "barcode": "171109837",
        "dpc": "03043623301",
        "name": "ផែ សុគុម"
    },
    {
        "barcode": "171109838",
        "dpc": "03043623101",
        "name": "ម៉ាន សារី"
    },
    {
        "barcode": "171109839",
        "dpc": "03043623001",
        "name": "ដារី"
    },
    {
        "barcode": "171109840",
        "dpc": "03043622901",
        "name": "ឡោះ យ៉ាន"
    },
    {
        "barcode": "171109841",
        "dpc": "03043622801",
        "name": "ឡោះ ហ៊ឺ"
    },
    {
        "barcode": "171109842",
        "dpc": "03043622701",
        "name": "ហ្វារ៉ុម មីយ៉ាន"
    },
    {
        "barcode": "171109843",
        "dpc": "03043622601",
        "name": "ធៀន សុធា"
    },
    {
        "barcode": "171109844",
        "dpc": "03043622501",
        "name": "អឿ ភាព"
    },
    {
        "barcode": "171109845",
        "dpc": "03043622401",
        "name": "អ៊ី សុផល"
    },
    {
        "barcode": "171109846",
        "dpc": "03043622301",
        "name": "វិន រស់"
    },
    {
        "barcode": "171109847",
        "dpc": "03043622201",
        "name": "មិត្ត សាខន"
    },
    {
        "barcode": "171109848",
        "dpc": "03043622101",
        "name": "កែន សារ៉ុន"
    },
    {
        "barcode": "171109849",
        "dpc": "03043622001",
        "name": "សារួន"
    },
    {
        "barcode": "171109850",
        "dpc": "03043621901",
        "name": "ឈឹម សុភា"
    },
    {
        "barcode": "171109851",
        "dpc": "03043621801",
        "name": "ឈឹម សុធា"
    },
    {
        "barcode": "171109852",
        "dpc": "03043621501",
        "name": "ហួត គឿន"
    },
    {
        "barcode": "171109853",
        "dpc": "03043621401",
        "name": "សួន ចិន្តា"
    },
    {
        "barcode": "171109854",
        "dpc": "03043621301",
        "name": "សែម ខុំ"
    },
    {
        "barcode": "171109855",
        "dpc": "03043621201",
        "name": "ស៊ុត រ៉ូន"
    },
    {
        "barcode": "171109856",
        "dpc": "03043621101",
        "name": "ចាន់ ឈឹមសុវណ្ណរិទ្ធ"
    },
    {
        "barcode": "171109857",
        "dpc": "03043621001",
        "name": "តាន់ សឺឡាង"
    },
    {
        "barcode": "171109858",
        "dpc": "03043620901",
        "name": "ចាន់ សុភាព"
    },
    {
        "barcode": "171109859",
        "dpc": "03043620801",
        "name": "ជុំ ចាន់ហ៊ន"
    },
    {
        "barcode": "171109860",
        "dpc": "03043620701",
        "name": "ប្រាក់ ម៉ាល័យ"
    },
    {
        "barcode": "171109861",
        "dpc": "03043620601",
        "name": "សួ ខេង"
    },
    {
        "barcode": "171109862",
        "dpc": "03043620501",
        "name": "ធាន កុយ"
    },
    {
        "barcode": "171109863",
        "dpc": "03043620401",
        "name": "ធី សារ៉េន"
    },
    {
        "barcode": "171109864",
        "dpc": "03043620301",
        "name": "ហូត សម្ជស្ស"
    },
    {
        "barcode": "171109865",
        "dpc": "03043620201",
        "name": "ប្រក ណារេត"
    },
    {
        "barcode": "171109866",
        "dpc": "03043620101",
        "name": "សេន អេសអារី"
    },
    {
        "barcode": "171109867",
        "dpc": "03043620001",
        "name": "ខ្វា សាយ"
    },
    {
        "barcode": "171109868",
        "dpc": "03043619901",
        "name": "បាន សល់"
    },
    {
        "barcode": "171109869",
        "dpc": "03043619701",
        "name": "នូវ ឆេន"
    },
    {
        "barcode": "171109870",
        "dpc": "03043619601",
        "name": "ជុំ បណ្តូរ"
    },
    {
        "barcode": "171109871",
        "dpc": "03043619501",
        "name": "អូច សុខន"
    },
    {
        "barcode": "171109872",
        "dpc": "03043619201",
        "name": "ហាន ឆឺត"
    },
    {
        "barcode": "171109873",
        "dpc": "03043619101",
        "name": "វ៉ាត សុវណ្ណ"
    },
    {
        "barcode": "171109874",
        "dpc": "03043619001",
        "name": "នង សារិទ្ធ"
    },
    {
        "barcode": "171109875",
        "dpc": "03043618901",
        "name": "សាំង ចន្ថា"
    },
    {
        "barcode": "171109876",
        "dpc": "03043618801",
        "name": "កែវ ប៊ុនធៀន"
    },
    {
        "barcode": "171109877",
        "dpc": "03043618701",
        "name": "ហ៊ុន ហុក"
    },
    {
        "barcode": "171109878",
        "dpc": "03043618601",
        "name": "ម្លិះ គឹមបេង"
    },
    {
        "barcode": "171109879",
        "dpc": "03043618401",
        "name": "ឯក វណ្ណថុន"
    },
    {
        "barcode": "171109880",
        "dpc": "03043618301",
        "name": "ចាន់ សេងលី"
    },
    {
        "barcode": "171109881",
        "dpc": "03043618201",
        "name": "អៀប សារ៉ាន់"
    },
    {
        "barcode": "171109882",
        "dpc": "03043618101",
        "name": "អៀប សាវ៊ើន"
    },
    {
        "barcode": "171109883",
        "dpc": "03043618001",
        "name": "ជូ មុនី"
    },
    {
        "barcode": "171109884",
        "dpc": "03043617901",
        "name": "ចាន់ ម៉េង"
    },
    {
        "barcode": "171109885",
        "dpc": "03043617801",
        "name": "ពៅ ណាសៀ"
    },
    {
        "barcode": "171109886",
        "dpc": "03043617701",
        "name": "ជឹង សុគន្ធ"
    },
    {
        "barcode": "171109887",
        "dpc": "03043617601",
        "name": "នៅ នឿត"
    },
    {
        "barcode": "171109888",
        "dpc": "03043617501",
        "name": "ឡាច ឡុង"
    },
    {
        "barcode": "171109889",
        "dpc": "03043617401",
        "name": "ឃុត សាឡន"
    },
    {
        "barcode": "171109890",
        "dpc": "03043617301",
        "name": "សឿ សាវ៉ុង"
    },
    {
        "barcode": "171109891",
        "dpc": "03043617201",
        "name": "ភាព រតនា"
    },
    {
        "barcode": "171109892",
        "dpc": "03043617101",
        "name": "រស់ សុខឿន"
    },
    {
        "barcode": "171109893",
        "dpc": "03043617001",
        "name": "សឿ សាម៉ៃ"
    },
    {
        "barcode": "171109894",
        "dpc": "03043616901",
        "name": "ម៉ម ម៉ុត"
    },
    {
        "barcode": "171109895",
        "dpc": "03043616801",
        "name": "ម៉ៃ ចន្ថា"
    },
    {
        "barcode": "171109896",
        "dpc": "03043616701",
        "name": "សិន គន្ធា"
    },
    {
        "barcode": "171109897",
        "dpc": "03043616601",
        "name": "នាល ភី"
    },
    {
        "barcode": "171109898",
        "dpc": "03043616501",
        "name": "ហៃ តាវ"
    },
    {
        "barcode": "171109899",
        "dpc": "03043616401",
        "name": "នួន គីមស៊ត"
    },
    {
        "barcode": "171109900",
        "dpc": "03043616301",
        "name": "ឡុង ណាត"
    },
    {
        "barcode": "171109901",
        "dpc": "03043616201",
        "name": "នួន បំរ៉ុង"
    },
    {
        "barcode": "171109902",
        "dpc": "03043616101",
        "name": "ជា សេតថារី"
    },
    {
        "barcode": "171109903",
        "dpc": "03043616001",
        "name": "ជា សុវណ្ណ"
    },
    {
        "barcode": "171109904",
        "dpc": "03043615801",
        "name": "ផែន សុធា"
    },
    {
        "barcode": "171109905",
        "dpc": "03043615601",
        "name": "វណ្ណា"
    },
    {
        "barcode": "171109906",
        "dpc": "03043615501",
        "name": "ព្រំ វិបុល"
    },
    {
        "barcode": "171109907",
        "dpc": "03043615401",
        "name": "ឡាំ វិញ"
    },
    {
        "barcode": "171109908",
        "dpc": "03043615301",
        "name": "សាន សិន"
    },
    {
        "barcode": "171109909",
        "dpc": "03043615201",
        "name": "ប៊ុន សុផល"
    },
    {
        "barcode": "171109910",
        "dpc": "03043615101",
        "name": "កង ចាន់ធី"
    },
    {
        "barcode": "171109911",
        "dpc": "03043615001",
        "name": "ឡៅ កង"
    },
    {
        "barcode": "171109912",
        "dpc": "03043614901",
        "name": "រិនវណ្ណា"
    },
    {
        "barcode": "171109913",
        "dpc": "03043614801",
        "name": "វង់ រដ្ខា"
    },
    {
        "barcode": "171109914",
        "dpc": "03043614701",
        "name": "ឃិត ប៊ុនរិទ្ធ"
    },
    {
        "barcode": "171109915",
        "dpc": "03043614601",
        "name": "ម៉ា សុខអេង"
    },
    {
        "barcode": "171109916",
        "dpc": "03043614501",
        "name": "យូ គីមហួន"
    },
    {
        "barcode": "171109917",
        "dpc": "03043614301",
        "name": "សំ សុខហួន"
    },
    {
        "barcode": "171109918",
        "dpc": "03043614201",
        "name": "ងិន ពេញ"
    },
    {
        "barcode": "171109919",
        "dpc": "03043614101",
        "name": "តឿ តាឡាប់"
    },
    {
        "barcode": "171109920",
        "dpc": "03043614001",
        "name": "ពាង ឆលៀត"
    },
    {
        "barcode": "171109921",
        "dpc": "03043613801",
        "name": "អតិថិជនថ្មី"
    },
    {
        "barcode": "171109922",
        "dpc": "03043613701",
        "name": "យាន ធី"
    },
    {
        "barcode": "171109923",
        "dpc": "03043613601",
        "name": "តុល ផន"
    },
    {
        "barcode": "171109924",
        "dpc": "03043613501",
        "name": "យាន គន្ធា"
    },
    {
        "barcode": "171109925",
        "dpc": "03043613301",
        "name": "ឌឹម សំណាង"
    },
    {
        "barcode": "171109926",
        "dpc": "03043613201",
        "name": "សេង សុខឡាង"
    },
    {
        "barcode": "171109927",
        "dpc": "03043613101",
        "name": "ម៉ៅ សារ៉ាត់"
    },
    {
        "barcode": "171109928",
        "dpc": "03043613001",
        "name": "ណុប មករា"
    },
    {
        "barcode": "171109929",
        "dpc": "03043612901",
        "name": "ឆាំ សារឿត"
    },
    {
        "barcode": "171109930",
        "dpc": "03043612801",
        "name": "គីន ចំរ៉ុង"
    },
    {
        "barcode": "171109931",
        "dpc": "03043612701",
        "name": "ឈីវ ស្រេង"
    },
    {
        "barcode": "171109932",
        "dpc": "03043612601",
        "name": "ផន ភឿត១"
    },
    {
        "barcode": "171109933",
        "dpc": "03043612501",
        "name": "ផន ភឿត២"
    },
    {
        "barcode": "171109934",
        "dpc": "03043612401",
        "name": "ឈឹម ភិរម្យ"
    },
    {
        "barcode": "171109935",
        "dpc": "03043612301",
        "name": "សោ សារិន"
    },
    {
        "barcode": "171109936",
        "dpc": "03043612201",
        "name": "ទ្រឿង ឈួ"
    },
    {
        "barcode": "171109937",
        "dpc": "03043612101",
        "name": "លឿង សល់"
    },
    {
        "barcode": "171109938",
        "dpc": "03043612001",
        "name": "លី ចាន់ថន"
    },
    {
        "barcode": "171109939",
        "dpc": "03043611901",
        "name": "ប៉ែន ខឿង២"
    },
    {
        "barcode": "171109940",
        "dpc": "03043611801",
        "name": "ប៉ែន ខឿង១"
    },
    {
        "barcode": "171109941",
        "dpc": "03043611701",
        "name": "ឈួន ខឿន"
    },
    {
        "barcode": "171109942",
        "dpc": "03043611601",
        "name": "សុខ សាន្ត"
    },
    {
        "barcode": "171109943",
        "dpc": "03043611501",
        "name": "ទូច កែវ"
    },
    {
        "barcode": "171109944",
        "dpc": "03043611401",
        "name": "ទូច សាវឿត"
    },
    {
        "barcode": "171109945",
        "dpc": "03043611301",
        "name": "យោគ ធី"
    },
    {
        "barcode": "171109946",
        "dpc": "03043611201",
        "name": "លឿម ប៉ក់"
    },
    {
        "barcode": "171109947",
        "dpc": "03043611101",
        "name": "អ៊ូច សារៀង"
    },
    {
        "barcode": "171109948",
        "dpc": "03043611001",
        "name": "ម៉ៅ គន្ធា"
    },
    {
        "barcode": "171109949",
        "dpc": "03043610901",
        "name": "ឈៀង ចំរើន"
    },
    {
        "barcode": "171109950",
        "dpc": "03043610801",
        "name": "ពុន ស៊ីឡុង"
    },
    {
        "barcode": "171109951",
        "dpc": "03043610701",
        "name": "លឿង ពៅ"
    },
    {
        "barcode": "171109952",
        "dpc": "03043610601",
        "name": "លឿង លឿប"
    },
    {
        "barcode": "171109953",
        "dpc": "03043610501",
        "name": "តេង ឆាវស៊ិញ"
    },
    {
        "barcode": "171109954",
        "dpc": "03043610401",
        "name": "សឿន ហ៊ីង"
    },
    {
        "barcode": "171109955",
        "dpc": "03043610301",
        "name": "សុខ រើន"
    },
    {
        "barcode": "171109956",
        "dpc": "03043610201",
        "name": "ប៉ិ ឆួត"
    },
    {
        "barcode": "171109957",
        "dpc": "03043610101",
        "name": "រស់ ហ៊ីម"
    },
    {
        "barcode": "171109958",
        "dpc": "03043610001",
        "name": "សែម រុន"
    },
    {
        "barcode": "171109959",
        "dpc": "03043609901",
        "name": "ផេង សុវណ្ណា"
    },
    {
        "barcode": "171109960",
        "dpc": "03043609801",
        "name": "រស់ ស្រីមុំ"
    },
    {
        "barcode": "171109961",
        "dpc": "03043609701",
        "name": "ចាប សៀន"
    },
    {
        "barcode": "171109962",
        "dpc": "03043609601",
        "name": "ហ៊ូ ហេង"
    },
    {
        "barcode": "171109963",
        "dpc": "03043609501",
        "name": "ភុំ លាភ"
    },
    {
        "barcode": "171109964",
        "dpc": "03043609401",
        "name": "ភី ណារី"
    },
    {
        "barcode": "171109965",
        "dpc": "03043609301",
        "name": "សែ សុភក្រ័"
    },
    {
        "barcode": "171109966",
        "dpc": "03043609201",
        "name": "ញិប វុទ្ធី"
    },
    {
        "barcode": "171109967",
        "dpc": "03043609101",
        "name": "ឈិន សាមឿន"
    },
    {
        "barcode": "171109968",
        "dpc": "03043609001",
        "name": "ប៉ិច ឆាត"
    },
    {
        "barcode": "171109969",
        "dpc": "03043608801",
        "name": "ឆាត ង៉ា"
    },
    {
        "barcode": "171109970",
        "dpc": "03043608701",
        "name": "ចន រចនា"
    },
    {
        "barcode": "171109971",
        "dpc": "03043608601",
        "name": "លឿម ម៉ៃ"
    },
    {
        "barcode": "171109972",
        "dpc": "03043608501",
        "name": "តាំង ចាន់ធី"
    },
    {
        "barcode": "171109973",
        "dpc": "03043608401",
        "name": "ផន ផៃ"
    },
    {
        "barcode": "171109974",
        "dpc": "03043608301",
        "name": "ភោគ សំអ៊ុន"
    },
    {
        "barcode": "171109975",
        "dpc": "03043608201",
        "name": "ម៉ៅ វ៉ាន់"
    },
    {
        "barcode": "171109976",
        "dpc": "03043608101",
        "name": "ឈឿម ឈាលី"
    },
    {
        "barcode": "171109977",
        "dpc": "03043608001",
        "name": "ឈឿម ឈិន"
    },
    {
        "barcode": "171109978",
        "dpc": "03043607901",
        "name": "ឈឹម សារេត"
    },
    {
        "barcode": "171109979",
        "dpc": "03043607801",
        "name": "ប៉ាវ សៀ"
    },
    {
        "barcode": "171109980",
        "dpc": "03043607701",
        "name": "សុខ សេរីឃីម ២"
    },
    {
        "barcode": "171109981",
        "dpc": "03043607501",
        "name": "អ៊ឹង ឈុនទ្រី"
    },
    {
        "barcode": "171109982",
        "dpc": "03043607401",
        "name": "ប្រម រដ្ឋា"
    },
    {
        "barcode": "171109983",
        "dpc": "03043607301",
        "name": "សេង លី"
    },
    {
        "barcode": "171109984",
        "dpc": "03043607201",
        "name": "សែម ផល្លី"
    },
    {
        "barcode": "171109985",
        "dpc": "03043607101",
        "name": "ហៀង ដារ៉ាវុទ្ធ"
    },
    {
        "barcode": "171109986",
        "dpc": "03043607001",
        "name": "វ៉ា គន្ធា"
    },
    {
        "barcode": "171109987",
        "dpc": "03043606901",
        "name": "ប៉ែន ធុច"
    },
    {
        "barcode": "171109988",
        "dpc": "03043606801",
        "name": "ស្រី សម្បត្តិ"
    },
    {
        "barcode": "171109989",
        "dpc": "03043606701",
        "name": "ជា លក្ខិណា"
    },
    {
        "barcode": "171109990",
        "dpc": "03043606601",
        "name": "ប៉ុល សាវុធ"
    },
    {
        "barcode": "171109991",
        "dpc": "03043606501",
        "name": "លឹម ប៊ុនឈៀង"
    },
    {
        "barcode": "171109992",
        "dpc": "03043606301",
        "name": "យិន ទី"
    },
    {
        "barcode": "171109993",
        "dpc": "03043606101",
        "name": "លី អ៊ន"
    },
    {
        "barcode": "171109994",
        "dpc": "03043606001",
        "name": "គីម កុសល់"
    },
    {
        "barcode": "171109995",
        "dpc": "03043605901",
        "name": "សៅ ដេន"
    },
    {
        "barcode": "171109996",
        "dpc": "03043605801",
        "name": "ប៉ូ ឡូ"
    },
    {
        "barcode": "171109997",
        "dpc": "03043605701",
        "name": "ញ៉ែម កេត"
    },
    {
        "barcode": "171109998",
        "dpc": "03043605601",
        "name": "ស៊ីវ ថាច"
    },
    {
        "barcode": "171109999",
        "dpc": "03043605401",
        "name": "គីម ស៊ីវ៉ុង"
    },
    {
        "barcode": "171110000",
        "dpc": "03043605301",
        "name": "វណ្ណ ឌី"
    },
    {
        "barcode": "171110001",
        "dpc": "03043605201",
        "name": "វ៉ាន់ ថន"
    },
    {
        "barcode": "171110002",
        "dpc": "03043604901",
        "name": "ថេង សុធៀន"
    },
    {
        "barcode": "171110003",
        "dpc": "03043604701",
        "name": "ចិន ឆន"
    },
    {
        "barcode": "171110004",
        "dpc": "03043604601",
        "name": "ឡេង សុផល្លី"
    },
    {
        "barcode": "171110005",
        "dpc": "03043604501",
        "name": "ធ្យូង ទូច"
    },
    {
        "barcode": "171110006",
        "dpc": "03043604401",
        "name": "ប្រុក រី"
    },
    {
        "barcode": "171110007",
        "dpc": "03043604301",
        "name": "ជៀម សាវឿន"
    },
    {
        "barcode": "171110008",
        "dpc": "03043604201",
        "name": "ង៉ែត វ៉ែន"
    },
    {
        "barcode": "171110009",
        "dpc": "03043604101",
        "name": "ធូ ចន្ថា"
    },
    {
        "barcode": "171110010",
        "dpc": "03043604001",
        "name": "សំអុន ធារិទ្ធ"
    },
    {
        "barcode": "171110011",
        "dpc": "03043603901",
        "name": "យិន សុខុម"
    },
    {
        "barcode": "171110012",
        "dpc": "03043603801",
        "name": "អ៊ុត នាង"
    },
    {
        "barcode": "171110013",
        "dpc": "03043603701",
        "name": "ប៊ុន ចានមុន្មី"
    },
    {
        "barcode": "171110014",
        "dpc": "03043603601",
        "name": "លី វ៉ាន់ណូ"
    },
    {
        "barcode": "171110015",
        "dpc": "03043603401",
        "name": "សារ៉ាឌី"
    },
    {
        "barcode": "171110016",
        "dpc": "03043603301",
        "name": "លាង សុខហៃ"
    },
    {
        "barcode": "171110017",
        "dpc": "03043603101",
        "name": "រ៉ុង សុភ័ក្រ"
    },
    {
        "barcode": "171110018",
        "dpc": "03043603001",
        "name": "កែវ ធានី"
    },
    {
        "barcode": "171110019",
        "dpc": "03043602901",
        "name": "នូ ចិន្តា"
    },
    {
        "barcode": "171110020",
        "dpc": "03043602801",
        "name": "រស់ សុនាថ"
    },
    {
        "barcode": "171110021",
        "dpc": "03043602701",
        "name": "មឿន ស៊ីថា"
    },
    {
        "barcode": "171110022",
        "dpc": "03043602601",
        "name": "អោ សំង៉ា"
    },
    {
        "barcode": "171110023",
        "dpc": "03043602501",
        "name": "ឆៃ ង៉ា"
    },
    {
        "barcode": "171110024",
        "dpc": "03043602301",
        "name": "ម៉ុល ឌន"
    },
    {
        "barcode": "171110025",
        "dpc": "03043602201",
        "name": "ផាន់ ពន្លឺ"
    },
    {
        "barcode": "171110026",
        "dpc": "03043602101",
        "name": "ភួង សា"
    },
    {
        "barcode": "171110027",
        "dpc": "03043602001",
        "name": "យន់ គុំ"
    },
    {
        "barcode": "171110028",
        "dpc": "03043601901",
        "name": "នូ អេងសំរិទ្ធ"
    },
    {
        "barcode": "171110029",
        "dpc": "03043601801",
        "name": "សៅ សុចិត្រ"
    },
    {
        "barcode": "171110030",
        "dpc": "03043601701",
        "name": "ឈន ចិត្រា"
    },
    {
        "barcode": "171110031",
        "dpc": "03043601601",
        "name": "ភោគ វង្ស"
    },
    {
        "barcode": "171110032",
        "dpc": "03043601501",
        "name": "ម៉ុក យ៉ុន"
    },
    {
        "barcode": "171110033",
        "dpc": "03043601301",
        "name": "ទូច ហេង"
    },
    {
        "barcode": "171110034",
        "dpc": "03043601201",
        "name": "ឃុត ពៅ"
    },
    {
        "barcode": "171110035",
        "dpc": "03043601101",
        "name": "ទ៉ុត សារ៉ាន់"
    },
    {
        "barcode": "171110036",
        "dpc": "03043601001",
        "name": "ទាវ លក្ខីណា"
    },
    {
        "barcode": "171110037",
        "dpc": "03043600901",
        "name": "អ៊ី សីហា"
    },
    {
        "barcode": "171110038",
        "dpc": "03043600801",
        "name": "អ៊ឹង សុខុម"
    },
    {
        "barcode": "171110039",
        "dpc": "03043600701",
        "name": "ហឿន សំរិទ្ធ"
    },
    {
        "barcode": "171110040",
        "dpc": "03043600301",
        "name": "ធួន រ៉ាវុធ"
    },
    {
        "barcode": "171110041",
        "dpc": "03043600101",
        "name": "ព្រាប ជាដា"
    },
    {
        "barcode": "171110042",
        "dpc": "03043618501",
        "name": "វិន សាវឹង"
    }
]
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});