

let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=
    [
        {
            "barcode": "171116095",
            "dpc": "03052200201",
            "name": "សណ្ឋាគារប៉ារីស"
        },
        {
            "barcode": "171116096",
            "dpc": "03052200301",
            "name": "សណ្ឋាគារប៉ារីស"
        },
        {
            "barcode": "171116097",
            "dpc": "03052200401",
            "name": "សណ្ឋាគាររ៉ូយ៉ាល់"
        },
        {
            "barcode": "171116098",
            "dpc": "03052200501",
            "name": "សណ្ឋាគាររ៉ូយ៉ាល់"
        },
        {
            "barcode": "171116099",
            "dpc": "03052200701",
            "name": "សណ្ឋាគារអន្តរជាតិ"
        },
        {
            "barcode": "171116100",
            "dpc": "03052200801",
            "name": "សណ្ឋាគារតេអូ"
        },
        {
            "barcode": "171116101",
            "dpc": "03052200901",
            "name": "សណ្ឋាគារតេអូ"
        },
        {
            "barcode": "171116102",
            "dpc": "03052201001",
            "name": "គ្លីនិកបាត់ដំបង"
        },
        {
            "barcode": "171116103",
            "dpc": "03052201101",
            "name": "ផ្ទះ.សំណាក់មនោរម្យ"
        },
        {
            "barcode": "171116104",
            "dpc": "03052201201",
            "name": "ភោជនីយដ្ឋានសប្បាយណាស់"
        },
        {
            "barcode": "171116105",
            "dpc": "03052201301",
            "name": "សួន សារុន ត្បូងវត្តសង្កែ"
        },
        {
            "barcode": "171116106",
            "dpc": "03052201501",
            "name": "ប៊ុត គឹមស៊ាន"
        },
        {
            "barcode": "171116107",
            "dpc": "03052201601",
            "name": "យ៉ម ចំរើន ១"
        },
        {
            "barcode": "171116108",
            "dpc": "03052201701",
            "name": "វែង  ស៊្រុន ៣"
        },
        {
            "barcode": "171116109",
            "dpc": "03052201801",
            "name": "សុខ សុខុន  ពន្ឋនាគារ"
        },
        {
            "barcode": "171116110",
            "dpc": "03052201901",
            "name": "រោងចក្រអគ្គិសនី(ក្រោមសាតូដូ)"
        },
        {
            "barcode": "171116111",
            "dpc": "03052202001",
            "name": "រោងចក្រអគ្គិសនី ២"
        },
        {
            "barcode": "171116112",
            "dpc": "03052202101",
            "name": "មណ្ឌលកុមារកំព្រា SOS"
        },
        {
            "barcode": "171116113",
            "dpc": "03052202201",
            "name": "យ៉ម ចំរើន ១"
        },
        {
            "barcode": "171116114",
            "dpc": "03052202301",
            "name": "អាជីវកម្មទឹកបរិសុទ្ធបន្ទាយស្រី"
        },
        {
            "barcode": "171116115",
            "dpc": "03052202401",
            "name": "សមាគមជនជាតិចិនលាងហួ"
        },
        {
            "barcode": "171116116",
            "dpc": "03052202501",
            "name": "លឹម ឆាយ ១"
        },
        {
            "barcode": "171116117",
            "dpc": "03052202601",
            "name": "សាខាគយនិងរដ្ឋាករខេត្ត"
        },
        {
            "barcode": "171116118",
            "dpc": "03052202701",
            "name": "អង្គការ ឃែ រំចេក៤"
        },
        {
            "barcode": "171116119",
            "dpc": "03052202801",
            "name": "សណ្ឋាគារ វិមានមាស"
        },
        {
            "barcode": "171116120",
            "dpc": "03052202901",
            "name": "តែ តៃលី ផ្សារលើ"
        },
        {
            "barcode": "171116121",
            "dpc": "03052203001",
            "name": "អ៊ុន ម៉េង​ សណ្ឋាគារអាស៊ី"
        },
        {
            "barcode": "171116122",
            "dpc": "03052203101",
            "name": "ស្ថានអគ្គកុងស៊ុលវៀតណាម"
        },
        {
            "barcode": "171116123",
            "dpc": "03052203201",
            "name": "ហម ចិត្រ"
        },
        {
            "barcode": "171116124",
            "dpc": "03052203301",
            "name": "ឃឹម វុទ្ធី"
        },
        {
            "barcode": "171116125",
            "dpc": "03052203401",
            "name": "សេង វ៉ាឡាត់"
        },
        {
            "barcode": "171116126",
            "dpc": "03052203501",
            "name": "ប្រព័ន្ធទឹកចូលផ្សារណាត់"
        },
        {
            "barcode": "171116127",
            "dpc": "03052203601",
            "name": "ស៊ុន សារ៉េត"
        },
        {
            "barcode": "171116128",
            "dpc": "03052203701",
            "name": "យ៉ាន បូផៃ សាច់អាំង២"
        },
        {
            "barcode": "171116129",
            "dpc": "03052203801",
            "name": "សុខ សុខុន ពីស៊ីនទឹក"
        },
        {
            "barcode": "171116130",
            "dpc": "03052203901",
            "name": "សៀ ស៊ិន"
        },
        {
            "barcode": "171116131",
            "dpc": "03052204001",
            "name": "អាហារដ្ឋានសន្តិភាព"
        },
        {
            "barcode": "171116132",
            "dpc": "03052204101",
            "name": "ឡេន រ៉ា លក់ពោះគោ២កន្លៈ"
        },
        {
            "barcode": "171116133",
            "dpc": "03052204201",
            "name": "ងួន ហួត (ថៃលី)"
        },
        {
            "barcode": "171116134",
            "dpc": "03052204301",
            "name": "ឈុន លីម"
        },
        {
            "barcode": "171116135",
            "dpc": "03052204401",
            "name": "ជា ថូន ផ្លូវលេខ៣"
        },
        {
            "barcode": "171116136",
            "dpc": "03052204501",
            "name": "ភោជនីយដ្ឋាន សួនយុវ័ន"
        },
        {
            "barcode": "171116137",
            "dpc": "03052204601",
            "name": "ទាន់សម័យម៉ាស្សាខារ៉ាអូខេ"
        },
        {
            "barcode": "171116138",
            "dpc": "03052204701",
            "name": "ទូច   លាងខេង"
        },
        {
            "barcode": "171116139",
            "dpc": "03052204801",
            "name": "ពៅ គឹមហាន(លក់គុយទាវ)"
        },
        {
            "barcode": "171116140",
            "dpc": "03052204901",
            "name": "ជឹម  ចំណាន(ឥន្ទ្រីយ៍មាស)"
        },
        {
            "barcode": "171116141",
            "dpc": "03052205001",
            "name": "អ៊ុយ លីវ(ប្រេងឥន្ទនៈឡាអេ)"
        },
        {
            "barcode": "171116142",
            "dpc": "03052205201",
            "name": "អាជីវកម្មសាណាត់២ (សេងហ៊ួ)"
        },
        {
            "barcode": "171116143",
            "dpc": "03052205301",
            "name": "ផិត ផៃណុង"
        },
        {
            "barcode": "171116144",
            "dpc": "03052205401",
            "name": "ណៃ គឹមសុន ប៉ៃលិន"
        },
        {
            "barcode": "171116145",
            "dpc": "03052205501",
            "name": "សោម  សាឃឿង"
        },
        {
            "barcode": "171116146",
            "dpc": "03052205601",
            "name": "សឿ រតនា"
        },
        {
            "barcode": "171116147",
            "dpc": "03052205701",
            "name": "ស្ថានីយ៏ តូតាល់"
        },
        {
            "barcode": "171116148",
            "dpc": "03052205801",
            "name": "ឃន ណារិទ្ធ"
        },
        {
            "barcode": "171116149",
            "dpc": "03052205901",
            "name": "សណ្ឋាគារស្តារ អ៊ុន ផល្លា"
        },
        {
            "barcode": "171116150",
            "dpc": "03052206001",
            "name": "សណ្ឋាគារ ឃីង"
        },
        {
            "barcode": "171116151",
            "dpc": "03052206101",
            "name": "ឡេង ហេង(សណ្ឋាគារ)"
        },
        {
            "barcode": "171116152",
            "dpc": "03052206201",
            "name": "វិច តូរីយ៉ា(សណ្ឋាគារ)"
        },
        {
            "barcode": "171116153",
            "dpc": "03052206301",
            "name": "ប៊ុន ពៅ រតនៈ(សណ្ឋាគារ)"
        },
        {
            "barcode": "171116154",
            "dpc": "03052206401",
            "name": "ជុក គឹមហ៊ាប់"
        },
        {
            "barcode": "171116155",
            "dpc": "03052206601",
            "name": "ហូ លីដេ(ផ្ទះសំណាក់)"
        },
        {
            "barcode": "171116156",
            "dpc": "03052206701",
            "name": "គុយ ទ្រី"
        },
        {
            "barcode": "171116157",
            "dpc": "03052206801",
            "name": "សោ ថាលី  កូលាបស"
        },
        {
            "barcode": "171116158",
            "dpc": "03052206901",
            "name": "ង៉ែត សុគន្ធ   (លក់បាយ )"
        },
        {
            "barcode": "171116159",
            "dpc": "03052207001",
            "name": "ប៉ោ  វណ្ណះ ១"
        },
        {
            "barcode": "171116160",
            "dpc": "03052207101",
            "name": "វត្តពោវាល"
        },
        {
            "barcode": "171116161",
            "dpc": "03052207201",
            "name": "ស៊ុន  ប៊ុនតារា(ផ្សារលើ)"
        },
        {
            "barcode": "171116162",
            "dpc": "03052207301",
            "name": "ប្រេង តេលា"
        },
        {
            "barcode": "171116163",
            "dpc": "03052207401",
            "name": "ជា  ពលរិទ្ធ    ខារ៉ាអូឃេ"
        },
        {
            "barcode": "171116164",
            "dpc": "03052207501",
            "name": "ឃេ អូ  ភោជនីយដ្ឋាន"
        },
        {
            "barcode": "171116165",
            "dpc": "03052207601",
            "name": "ហួន ហៀង  ភោជនីយដ្ឋានអាស៊ានបៀរ"
        },
        {
            "barcode": "171116166",
            "dpc": "03052207701",
            "name": "ជឹម  ពៅ"
        },
        {
            "barcode": "171116167",
            "dpc": "03052207901",
            "name": "ឡុង សុធី  ភោជនីយដ្ឋាន"
        },
        {
            "barcode": "171116168",
            "dpc": "03052208001",
            "name": "ម៉ៅ ហួរ  បណ្តុះសណ្តែក"
        },
        {
            "barcode": "171116169",
            "dpc": "03052208101",
            "name": "នូវ សាវុធ មៃមៃ ភោជនីយដ្ឋាន"
        },
        {
            "barcode": "171116170",
            "dpc": "03052208201",
            "name": "វី  ឆែ"
        },
        {
            "barcode": "171116171",
            "dpc": "03052208301",
            "name": "ញ៉ែម វណ្ណា  លាង ឡាន"
        },
        {
            "barcode": "171116172",
            "dpc": "03052208401",
            "name": "ម៉ៅ សេងថៃ   ភរំចេក៤"
        },
        {
            "barcode": "171116173",
            "dpc": "03052208501",
            "name": "សណ្ឋាគារ បាណន់"
        },
        {
            "barcode": "171116174",
            "dpc": "03052208601",
            "name": "យូ ចាន់ទី"
        },
        {
            "barcode": "171116175",
            "dpc": "03052208801",
            "name": "ផ្សារ ក្រណាត់ បឹងឈូក"
        },
        {
            "barcode": "171116176",
            "dpc": "03052208901",
            "name": "ព្រៈវិហារកាតូលិក ១"
        },
        {
            "barcode": "171116177",
            "dpc": "03052209001",
            "name": "គីម វែង  លាង ឡាន"
        },
        {
            "barcode": "171116178",
            "dpc": "03052209101",
            "name": "យ៉ុន តូរ៉ាត់ ឃេអូរ"
        },
        {
            "barcode": "171116179",
            "dpc": "03052209201",
            "name": "ស៊ីន ឃន   (សាច់គោអាំង )"
        },
        {
            "barcode": "171116180",
            "dpc": "03052209301",
            "name": "សមាគមគុយទាវ"
        },
        {
            "barcode": "171116181",
            "dpc": "03052209401",
            "name": "វិញ  សាន់"
        },
        {
            "barcode": "171116182",
            "dpc": "03052209501",
            "name": "នរោត្តម ចក្រាវុធ"
        },
        {
            "barcode": "171116183",
            "dpc": "03052209601",
            "name": "ណា ណៃ"
        },
        {
            "barcode": "171116184",
            "dpc": "03052209801",
            "name": "ឯ.ឧ. ងិន ឃន ៣"
        },
        {
            "barcode": "171116185",
            "dpc": "03052209901",
            "name": "ជ្រិន ញ៉"
        },
        {
            "barcode": "171116186",
            "dpc": "03052210001",
            "name": "សកលវិទ្យាល័យ ប្រជាជាតិ"
        },
        {
            "barcode": "171116187",
            "dpc": "03052210101",
            "name": "អា  មួយ"
        },
        {
            "barcode": "171116188",
            "dpc": "03052210201",
            "name": "កែវ វ៉ាន់ទី"
        },
        {
            "barcode": "171116189",
            "dpc": "03052210301",
            "name": "សណ្នាគារ ជយ័ជំនៈ"
        },
        {
            "barcode": "171116190",
            "dpc": "03052210401",
            "name": "ខៀវ ផុន"
        },
        {
            "barcode": "171116191",
            "dpc": "03052210501",
            "name": "នូ ណូរ៉ា"
        },
        {
            "barcode": "171116192",
            "dpc": "03052210601",
            "name": "ថាច់ សង្វាត"
        },
        {
            "barcode": "171116193",
            "dpc": "03052210701",
            "name": "គឹម សារី"
        },
        {
            "barcode": "171116194",
            "dpc": "03052210801",
            "name": "ចំណតរថយន្ត"
        },
        {
            "barcode": "171116195",
            "dpc": "03052210901",
            "name": "ប៊ុន សេង (គ្លីនិកសុខភាព)"
        },
        {
            "barcode": "171116196",
            "dpc": "03052211001",
            "name": "សុខ  សុខុម"
        },
        {
            "barcode": "171116197",
            "dpc": "03052211101",
            "name": "ផ្សារលក់ត្រី"
        },
        {
            "barcode": "171116198",
            "dpc": "03052211201",
            "name": "ជា   សង្វាសេរីវឌ្ឍន៏"
        },
        {
            "barcode": "171116199",
            "dpc": "03052211301",
            "name": "ព្រៈវិហារកាតូលិក ២"
        },
        {
            "barcode": "171116200",
            "dpc": "03052211401",
            "name": "អ៊ី ផេង"
        },
        {
            "barcode": "171116201",
            "dpc": "03052211501",
            "name": "វែង ស៊្រុន"
        },
        {
            "barcode": "171116202",
            "dpc": "03052211601",
            "name": "អេង ពេញ"
        },
        {
            "barcode": "171116203",
            "dpc": "03052211701",
            "name": "គង់ យឿម ផ្ទ.  ក.  ភ."
        },
        {
            "barcode": "171116204",
            "dpc": "03052211901",
            "name": "ប៊ុន សេង ១"
        },
        {
            "barcode": "171116205",
            "dpc": "03052212001",
            "name": "អង្កការ អេ អ អឹម"
        },
        {
            "barcode": "171116206",
            "dpc": "03052212101",
            "name": "គិត   រ៉ាវី"
        },
        {
            "barcode": "171116207",
            "dpc": "03052212201",
            "name": "ហេង យាន (ហាងអ៊ិចហ្គោល )"
        },
        {
            "barcode": "171116208",
            "dpc": "03052212301",
            "name": "ផ្ទះ.សំណាក់ភ្នំខៀវ"
        },
        {
            "barcode": "171116209",
            "dpc": "03052212401",
            "name": "សំ  កុល"
        },
        {
            "barcode": "171116210",
            "dpc": "03052212501",
            "name": "សេង សុម៉ាឡៃ (ខារាអូខេហេបភី )"
        },
        {
            "barcode": "171116211",
            "dpc": "03052212601",
            "name": "ណង  ណារ័ត្ន"
        },
        {
            "barcode": "171116212",
            "dpc": "03052212701",
            "name": "លឹម ភិចហួរ"
        },
        {
            "barcode": "171116213",
            "dpc": "03052212801",
            "name": "លឹម ឆាយ ២"
        },
        {
            "barcode": "171116214",
            "dpc": "03052212901",
            "name": "លឹម ឆាយ ៣"
        },
        {
            "barcode": "171116215",
            "dpc": "03052213001",
            "name": "លឹម ឆាយ ៤"
        },
        {
            "barcode": "171116216",
            "dpc": "03052213101",
            "name": "ជី អែស ធី"
        },
        {
            "barcode": "171116217",
            "dpc": "03052213201",
            "name": "ហួន សាយ"
        },
        {
            "barcode": "171116218",
            "dpc": "03052213301",
            "name": "ក្រុម ជុំនុំ ប៊ី អែស ធី"
        },
        {
            "barcode": "171116219",
            "dpc": "03052213401",
            "name": "អេង សុខនេត"
        },
        {
            "barcode": "171116911",
            "dpc": "03052213601",
            "name": "លឹម  ឈួងសៀ"
        },
        {
            "barcode": "171116912",
            "dpc": "03052213701",
            "name": "យ៉ា សារឿន"
        },
        {
            "barcode": "171116913",
            "dpc": "03052213801",
            "name": "រស់ ពិសិដ្ឋ"
        },
        {
            "barcode": "171116914",
            "dpc": "03052213901",
            "name": "វែង ស៊្រុន ២"
        },
        {
            "barcode": "171116915",
            "dpc": "03052214001",
            "name": "រិន វិសាល ១"
        },
        {
            "barcode": "171116916",
            "dpc": "03052214101",
            "name": "ស៊ិន ហួរ"
        },
        {
            "barcode": "171116917",
            "dpc": "03052214201",
            "name": "ហែម សុធា"
        },
        {
            "barcode": "171116918",
            "dpc": "03052214301",
            "name": "សាលារៀន យូ.អ៊ឹម.អ៊ី"
        },
        {
            "barcode": "171116919",
            "dpc": "03052214401",
            "name": "គឹម សុខ"
        },
        {
            "barcode": "171116920",
            "dpc": "03052214501",
            "name": "ការ៉ាស់សាំង តេលា (អន្លង់វិល )"
        },
        {
            "barcode": "171116921",
            "dpc": "03052214601",
            "name": "កុមារឥតព្រំដែន"
        },
        {
            "barcode": "171116922",
            "dpc": "03052214701",
            "name": "ហុង ឆាយ"
        },
        {
            "barcode": "171116923",
            "dpc": "03052214801",
            "name": "ហៃ ភួង"
        },
        {
            "barcode": "171116924",
            "dpc": "03052214901",
            "name": "អ៊ារ ថៃភួង"
        },
        {
            "barcode": "171116925",
            "dpc": "03052215001",
            "name": "វិទ្យាល័យបៀលប្រាយ ១"
        },
        {
            "barcode": "171116926",
            "dpc": "03052215101",
            "name": "កូវ ជីងប៊ុង"
        },
        {
            "barcode": "171116927",
            "dpc": "03052215201",
            "name": "សួន ឆៀត (ស្ទួន២៣ )"
        },
        {
            "barcode": "171116928",
            "dpc": "03052215301",
            "name": "ធា   លឹម"
        },
        {
            "barcode": "171116929",
            "dpc": "03052215401",
            "name": "សត្តឃាត"
        },
        {
            "barcode": "171116930",
            "dpc": "03052215501",
            "name": "សំ   គីម ២"
        },
        {
            "barcode": "171116931",
            "dpc": "03052215601",
            "name": "ព្រឿន  សឿត"
        },
        {
            "barcode": "171116932",
            "dpc": "03052215701",
            "name": "អ៊ុត   មួយ ១"
        },
        {
            "barcode": "171116933",
            "dpc": "03052215801",
            "name": "អ៊ុត   មួយ ២"
        },
        {
            "barcode": "171116934",
            "dpc": "03052215901",
            "name": "ថាំ   ស៊ុនថូ"
        },
        {
            "barcode": "171116935",
            "dpc": "03052216001",
            "name": "វែង   សុផល"
        },
        {
            "barcode": "171116936",
            "dpc": "03052216101",
            "name": "ប៉ា   សុជាតិវង្ស"
        },
        {
            "barcode": "171116937",
            "dpc": "03052216301",
            "name": "ចាន់   សម្ជស្ស"
        },
        {
            "barcode": "171116938",
            "dpc": "03052216401",
            "name": "តាំង  ជុងខេង"
        },
        {
            "barcode": "171116939",
            "dpc": "03052216501",
            "name": "ឡូ   សុផល"
        },
        {
            "barcode": "171116940",
            "dpc": "03052216601",
            "name": "សាប៊ូ  អូហ្សាណូ"
        },
        {
            "barcode": "171116941",
            "dpc": "03052216701",
            "name": "នក់   ម៉ង់"
        },
        {
            "barcode": "171116942",
            "dpc": "03052216801",
            "name": "សយ បូរ៉ា"
        },
        {
            "barcode": "171116943",
            "dpc": "03052216901",
            "name": "ហ៊ុយុ ហេង"
        },
        {
            "barcode": "171116944",
            "dpc": "03052217101",
            "name": "ហុង  សារិន"
        },
        {
            "barcode": "171116945",
            "dpc": "03052217201",
            "name": "ឌុក អៀក"
        },
        {
            "barcode": "171116946",
            "dpc": "03052217401",
            "name": "សេរី ចរិយា ១"
        },
        {
            "barcode": "171116947",
            "dpc": "03052217501",
            "name": "សេរី ចរិយា ២"
        },
        {
            "barcode": "171116948",
            "dpc": "03052217601",
            "name": "ណៃ គឹមសុន ២"
        },
        {
            "barcode": "171116949",
            "dpc": "03052217701",
            "name": "សេង សុទ្ធី"
        },
        {
            "barcode": "171116950",
            "dpc": "03052217801",
            "name": "មាស សុភាព"
        },
        {
            "barcode": "171116951",
            "dpc": "03052217901",
            "name": "ប៊ន សោ ភ័ណ"
        },
        {
            "barcode": "171116952",
            "dpc": "03052218001",
            "name": "ជា  តេកស្រេង (ជិប ស្រេង )"
        },
        {
            "barcode": "171116953",
            "dpc": "03052218101",
            "name": "វិទ្យាល័យបៀលប្រាយ ២"
        },
        {
            "barcode": "171116954",
            "dpc": "03052218201",
            "name": "ងិន ឃន ១"
        },
        {
            "barcode": "171116955",
            "dpc": "03052218301",
            "name": "ងិន ឃន ៤"
        },
        {
            "barcode": "171116956",
            "dpc": "03052218401",
            "name": "ងិន ឃន ៥"
        },
        {
            "barcode": "171116957",
            "dpc": "03052218501",
            "name": "ងិន ឃន ៦"
        },
        {
            "barcode": "171116958",
            "dpc": "03052218601",
            "name": "យ៉ម   ចំរើន ៤"
        },
        {
            "barcode": "171116959",
            "dpc": "03052218701",
            "name": "សណ្ឋាគារស្ទឹងសង្កែ"
        },
        {
            "barcode": "171116960",
            "dpc": "03052218801",
            "name": "ហេង លាប"
        },
        {
            "barcode": "171116961",
            "dpc": "03052218901",
            "name": "វ៉ាន់  ហម"
        },
        {
            "barcode": "171116962",
            "dpc": "03052219001",
            "name": "រស់ យាន"
        },
        {
            "barcode": "171116963",
            "dpc": "03052219101",
            "name": "ភោជនីយដ្ឋាន វិមានរៀម"
        },
        {
            "barcode": "171116964",
            "dpc": "03052219301",
            "name": "សួន  រើន"
        },
        {
            "barcode": "171116965",
            "dpc": "03052219401",
            "name": "លឹម  ទៀហេង"
        },
        {
            "barcode": "171116966",
            "dpc": "03052219501",
            "name": "បេង  ភី ១"
        },
        {
            "barcode": "171116967",
            "dpc": "03052219601",
            "name": "កាកបាទក្រហម"
        },
        {
            "barcode": "171116968",
            "dpc": "03052219701",
            "name": "ប៊ុន  សេង ២"
        },
        {
            "barcode": "171116969",
            "dpc": "03052219801",
            "name": "តូ  មិត"
        },
        {
            "barcode": "171116970",
            "dpc": "03052219901",
            "name": "ហេង តុលា"
        },
        {
            "barcode": "171116971",
            "dpc": "03052220101",
            "name": "តូតាល់អន្លងវិល"
        },
        {
            "barcode": "171116972",
            "dpc": "03052220201",
            "name": "សាឌុន  សារិទ្ធ"
        },
        {
            "barcode": "171116973",
            "dpc": "03052220301",
            "name": "ជាម ចាន់សោភ័ណ"
        },
        {
            "barcode": "171116974",
            "dpc": "03052220401",
            "name": "ម៉ៅ  អេង"
        },
        {
            "barcode": "171116975",
            "dpc": "03052220501",
            "name": "ឡុង  សុធី ២"
        },
        {
            "barcode": "171116976",
            "dpc": "03052220601",
            "name": "ហត្ថ  ធី"
        },
        {
            "barcode": "171116977",
            "dpc": "03052220701",
            "name": "យិន  គិតឡេង"
        },
        {
            "barcode": "171116978",
            "dpc": "03052220901",
            "name": "អ៊ឹង  គឹមលី"
        },
        {
            "barcode": "171116979",
            "dpc": "03052221001",
            "name": "មាស ចាន់ធឿន"
        },
        {
            "barcode": "171116980",
            "dpc": "03052221101",
            "name": "រី  រឿន"
        },
        {
            "barcode": "171116981",
            "dpc": "03052221201",
            "name": "ណាំ  ទុំ (រ៉ាក់ )"
        },
        {
            "barcode": "171116982",
            "dpc": "03052221301",
            "name": "ហួយ ចន្ធី"
        },
        {
            "barcode": "171116983",
            "dpc": "03052221401",
            "name": "រាជ  សុវណ្ណារិទ្ធ (ហូលីដេ ២ )"
        },
        {
            "barcode": "171116984",
            "dpc": "03052221501",
            "name": "អ៊ឹង  គីរីរ័ត្ន"
        },
        {
            "barcode": "171116985",
            "dpc": "03052221601",
            "name": "ប៉ាត់  ផលបុត្រ"
        },
        {
            "barcode": "171116986",
            "dpc": "03052221701",
            "name": "ប៊ុន  សុវណ្ណ"
        },
        {
            "barcode": "171116987",
            "dpc": "03052221801",
            "name": "យន់  ណូរ៉ាត"
        },
        {
            "barcode": "171116988",
            "dpc": "03052221901",
            "name": "ង៉ូវ  វែងហុក"
        },
        {
            "barcode": "171116989",
            "dpc": "03052222001",
            "name": "ខេមរាបាត់ដំបង ១"
        },
        {
            "barcode": "171116990",
            "dpc": "03052222101",
            "name": "ខេមរាបាត់ដំបង ២"
        },
        {
            "barcode": "171116991",
            "dpc": "03052222201",
            "name": "រាត្រីស្ទឹងសង្គែ"
        },
        {
            "barcode": "171116992",
            "dpc": "03052222301",
            "name": "អាហារដ្ឋានរីករាយ"
        },
        {
            "barcode": "171116993",
            "dpc": "03052222401",
            "name": "ប៉ោ  វណ្ណះ"
        },
        {
            "barcode": "171116994",
            "dpc": "03052222601",
            "name": "សុខ  រ៉ាថន (ការ៉ាស់សាំង សូគីម៉ិច  )"
        },
        {
            "barcode": "171116995",
            "dpc": "03052222701",
            "name": "ឈឹម  ស៊ួ"
        },
        {
            "barcode": "171116996",
            "dpc": "03052222801",
            "name": "មឹក  ហេង"
        },
        {
            "barcode": "171116997",
            "dpc": "03052222901",
            "name": "តាំង  ឈុន (ប៉ូលីស )"
        },
        {
            "barcode": "171116998",
            "dpc": "03052223001",
            "name": "សុខ  ឡាវ"
        },
        {
            "barcode": "171116999",
            "dpc": "03052223101",
            "name": "លឹម  សេងហ៊ួរ"
        },
        {
            "barcode": "171117000",
            "dpc": "03052223201",
            "name": "ជា  អេង ១"
        },
        {
            "barcode": "171117001",
            "dpc": "03052223401",
            "name": "ហោ  តុងហាប់"
        },
        {
            "barcode": "171117002",
            "dpc": "03052223501",
            "name": "បេង  ភី"
        },
        {
            "barcode": "171117003",
            "dpc": "03052223601",
            "name": "បេ  សារឿន"
        },
        {
            "barcode": "171117004",
            "dpc": "03052223801",
            "name": "ហម  សាម៉ុន"
        },
        {
            "barcode": "171117005",
            "dpc": "03052223901",
            "name": "បង្គន់អនាម័យសាធាណះ"
        },
        {
            "barcode": "171117006",
            "dpc": "03052224001",
            "name": "តុក  សុងសួ"
        },
        {
            "barcode": "171117007",
            "dpc": "03052224101",
            "name": "សិប្បកម្មលូ"
        },
        {
            "barcode": "171117008",
            "dpc": "03052224201",
            "name": "បួន  សៀ"
        },
        {
            "barcode": "171117009",
            "dpc": "03052224301",
            "name": "ដៃដែក"
        },
        {
            "barcode": "171117010",
            "dpc": "03052224401",
            "name": "ស  ឌឿ"
        },
        {
            "barcode": "171117011",
            "dpc": "03052224501",
            "name": "អ៊ុំ  ចំរើន"
        },
        {
            "barcode": "171117012",
            "dpc": "03052224601",
            "name": "ហ៊ូ  រតនា"
        },
        {
            "barcode": "171117013",
            "dpc": "03052224701",
            "name": "ឌុក  ឆវេត"
        },
        {
            "barcode": "171117014",
            "dpc": "03052224801",
            "name": "អ៊ុំ  អេង"
        },
        {
            "barcode": "171117015",
            "dpc": "03052224901",
            "name": "សាលា អ៊ី.ស៊ី.ស៊ី"
        },
        {
            "barcode": "171117016",
            "dpc": "03052225001",
            "name": "ហួន  ហេង"
        },
        {
            "barcode": "171117017",
            "dpc": "03052225101",
            "name": "ស៊ុន លីនណា"
        },
        {
            "barcode": "171117018",
            "dpc": "03052225201",
            "name": "នៅ  យូរឡុង (វត្តសូភី )"
        },
        {
            "barcode": "171117019",
            "dpc": "03052225301",
            "name": "វត្តពោធិក្នុង"
        },
        {
            "barcode": "171117020",
            "dpc": "03052225401",
            "name": "កុង  យក់"
        },
        {
            "barcode": "171117021",
            "dpc": "03052225501",
            "name": "តាំង  ឡាយ"
        },
        {
            "barcode": "171117022",
            "dpc": "03052225601",
            "name": "ឈិត  សុក"
        },
        {
            "barcode": "171117023",
            "dpc": "03052225701",
            "name": "អែម  សុផល"
        },
        {
            "barcode": "171117024",
            "dpc": "03052225801",
            "name": "សន  និល"
        },
        {
            "barcode": "171117025",
            "dpc": "03052225901",
            "name": "គឹម  មុន្នី"
        },
        {
            "barcode": "171117026",
            "dpc": "03052226001",
            "name": "អ៊ុក  ស៊ីណយ"
        },
        {
            "barcode": "171117027",
            "dpc": "03052226101",
            "name": "ប្រាក់  ព្រី"
        },
        {
            "barcode": "171117028",
            "dpc": "03052226201",
            "name": "ងួន  ពន្លក"
        },
        {
            "barcode": "171117029",
            "dpc": "03052226301",
            "name": "សេង  ប៊ូ"
        },
        {
            "barcode": "171117030",
            "dpc": "03052226501",
            "name": "ផ្សារថ្មី"
        },
        {
            "barcode": "171117031",
            "dpc": "03052226601",
            "name": "តាំង  ម៉េងគង់"
        },
        {
            "barcode": "171117032",
            "dpc": "03052226701",
            "name": "វត្តផ្សារថ្មី"
        },
        {
            "barcode": "171117033",
            "dpc": "03052226801",
            "name": "ចេង  អឿន"
        },
        {
            "barcode": "171117034",
            "dpc": "03052226901",
            "name": "ក្រុមហ៊ុន អិលឌីអែស"
        },
        {
            "barcode": "171117035",
            "dpc": "03052227001",
            "name": "តុប  ថូលីណា ១"
        },
        {
            "barcode": "171117036",
            "dpc": "03052227101",
            "name": "តុប  ថូលីណា ២"
        },
        {
            "barcode": "171117037",
            "dpc": "03052227201",
            "name": "ឡាំ  ឆៃលីន"
        },
        {
            "barcode": "171117038",
            "dpc": "03052227301",
            "name": "វ៉ាន់  ណារ៉េត"
        },
        {
            "barcode": "171117039",
            "dpc": "03052227401",
            "name": "នៅ  សិទ្ធិគុណ"
        },
        {
            "barcode": "171117040",
            "dpc": "03052227501",
            "name": "សួន  វណ្ណនេត"
        },
        {
            "barcode": "171117041",
            "dpc": "03052227601",
            "name": "សៀ   ស៊ិន ១"
        },
        {
            "barcode": "171117042",
            "dpc": "03052227701",
            "name": "គាន  ថៃ ១"
        },
        {
            "barcode": "171117043",
            "dpc": "03052227801",
            "name": "ឃុន  ងួនហុង"
        },
        {
            "barcode": "171117044",
            "dpc": "03052227901",
            "name": "វិទ្យាល័យបៀលប្រាយ ៣"
        },
        {
            "barcode": "171117045",
            "dpc": "03052228001",
            "name": "សន  សុភ័ក្រ"
        },
        {
            "barcode": "171117046",
            "dpc": "03052228101",
            "name": "ឡុង  ចន្ថា"
        },
        {
            "barcode": "171117047",
            "dpc": "03052228201",
            "name": "ម៉ម  បណ្ឌិត"
        },
        {
            "barcode": "171117048",
            "dpc": "03052228301",
            "name": "គង់  ធី"
        },
        {
            "barcode": "171117049",
            "dpc": "03052228501",
            "name": "លក  វណ្ណ"
        },
        {
            "barcode": "171117050",
            "dpc": "03052228601",
            "name": "វ៉ាត់   ស៊ីម"
        },
        {
            "barcode": "171117051",
            "dpc": "03052228701",
            "name": "ហ៊ាង  រ៉ាវុធ"
        },
        {
            "barcode": "171117052",
            "dpc": "03052228801",
            "name": "ទៀប  រី ២"
        },
        {
            "barcode": "171117053",
            "dpc": "03052228901",
            "name": "លឹម  ហូ"
        },
        {
            "barcode": "171117054",
            "dpc": "03052229001",
            "name": "ខឹម  សាឃឿន"
        },
        {
            "barcode": "171117055",
            "dpc": "03052229201",
            "name": "សឹង  លី"
        },
        {
            "barcode": "171117056",
            "dpc": "03052229301",
            "name": "ឯម  សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171117057",
            "dpc": "03052229401",
            "name": "ទឹម  វណ្ណា"
        },
        {
            "barcode": "171117058",
            "dpc": "03052229501",
            "name": "ផុន  ផាវុធ"
        },
        {
            "barcode": "171117059",
            "dpc": "03052229601",
            "name": "ឈុំ  ចាន់"
        },
        {
            "barcode": "171117060",
            "dpc": "03052229701",
            "name": "វត្តកណ្តាល"
        },
        {
            "barcode": "171117061",
            "dpc": "03052229801",
            "name": "ឌិត  ជិន"
        },
        {
            "barcode": "171117062",
            "dpc": "03052229901",
            "name": "ជួប  យ៉ុម"
        }
    ]
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});