let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=

    [
        {
            "barcode": "171112640",
            "dpc": "03013103101",
            "name": "ឆម  ធឿន"
        },
        {
            "barcode": "171112641",
            "dpc": "03013110401",
            "name": "សែម  ឃន"
        },
        {
            "barcode": "171112642",
            "dpc": "03013111801",
            "name": "ញ៉  លីម៉ា"
        },
        {
            "barcode": "171112643",
            "dpc": "03013136501",
            "name": "ដែង សុវណ្ណរ៉ា"
        },
        {
            "barcode": "171112644",
            "dpc": "03013136201",
            "name": "ហួត  កប"
        },
        {
            "barcode": "171112645",
            "dpc": "03013100101",
            "name": "ឈន   ណាវី"
        },
        {
            "barcode": "171112646",
            "dpc": "03013100201",
            "name": "អ៊ុក  សុធា"
        },
        {
            "barcode": "171112647",
            "dpc": "03013100301",
            "name": "មុត  សាវន្ត័"
        },
        {
            "barcode": "171112648",
            "dpc": "03013100401",
            "name": "យស  យឿន"
        },
        {
            "barcode": "171112649",
            "dpc": "03013100601",
            "name": "អ៊ូ  សាវ័ន្ត"
        },
        {
            "barcode": "171112650",
            "dpc": "03013100701",
            "name": "សឹង  សុផាត"
        },
        {
            "barcode": "171112651",
            "dpc": "03013100801",
            "name": "តេន  ឡេន"
        },
        {
            "barcode": "171112652",
            "dpc": "03013100901",
            "name": "ធូ  មុន្នីរិទ្ធិ"
        },
        {
            "barcode": "171112653",
            "dpc": "03013101001",
            "name": "កែវ   តាំង"
        },
        {
            "barcode": "171112654",
            "dpc": "03013101101",
            "name": "ស  ស៊ីម"
        },
        {
            "barcode": "171112655",
            "dpc": "03013101201",
            "name": "ឈិន  សារុំ"
        },
        {
            "barcode": "171112656",
            "dpc": "03013101301",
            "name": "ជា  ជួម"
        },
        {
            "barcode": "171112657",
            "dpc": "03013101401",
            "name": "ផែន  ហ៊ីម"
        },
        {
            "barcode": "171112658",
            "dpc": "03013101501",
            "name": "ម៉ិត  ឃន"
        },
        {
            "barcode": "171112659",
            "dpc": "03013101601",
            "name": "ឃុំ  ជ្រា"
        },
        {
            "barcode": "171112660",
            "dpc": "03013101701",
            "name": "ចៅ  ធឿន"
        },
        {
            "barcode": "171112661",
            "dpc": "03013101901",
            "name": "អ៊ុំ  សាឡាត"
        },
        {
            "barcode": "171112662",
            "dpc": "03013102001",
            "name": "វ៉ាត  ស៊ីម"
        },
        {
            "barcode": "171112663",
            "dpc": "03013102101",
            "name": "ស៊ុន  គីមអូន"
        },
        {
            "barcode": "171112664",
            "dpc": "03013102201",
            "name": "ទី  កុសល់"
        },
        {
            "barcode": "171112665",
            "dpc": "03013102301",
            "name": "វ៉ាត់  ចិន្តា"
        },
        {
            "barcode": "171112666",
            "dpc": "03013102401",
            "name": "ឡូ  ប៊ុនប៉ា"
        },
        {
            "barcode": "171112667",
            "dpc": "03013102501",
            "name": "ងិន  សុផល"
        },
        {
            "barcode": "171112668",
            "dpc": "03013102601",
            "name": "លឹម  ខេង"
        },
        {
            "barcode": "171112669",
            "dpc": "03013102801",
            "name": "អ៊ុច  អឿន"
        },
        {
            "barcode": "171112670",
            "dpc": "03013102901",
            "name": "ថៃ  យ៉ុន"
        },
        {
            "barcode": "171112671",
            "dpc": "03013103201",
            "name": "ព្រឿង  ឆៀប"
        },
        {
            "barcode": "171112672",
            "dpc": "03013103601",
            "name": "តាំង  ហ័ត"
        },
        {
            "barcode": "171112673",
            "dpc": "03013103801",
            "name": "សុក  រតនះ"
        },
        {
            "barcode": "171112674",
            "dpc": "03013103901",
            "name": "កែ  ផល្លា"
        },
        {
            "barcode": "171112675",
            "dpc": "03013104101",
            "name": "អៀវ  វ៉ាន់ដេត"
        },
        {
            "barcode": "171112676",
            "dpc": "03013104201",
            "name": "យ៉ាំ  ចាន់"
        },
        {
            "barcode": "171112677",
            "dpc": "03013104301",
            "name": "វ៉ាន់  សារិទ្ធិ"
        },
        {
            "barcode": "171112678",
            "dpc": "03013104401",
            "name": "អ៊ឹម  សុខចំរើន"
        },
        {
            "barcode": "171112679",
            "dpc": "03013104501",
            "name": "សាយ  ចន្ថា"
        },
        {
            "barcode": "171112680",
            "dpc": "03013104701",
            "name": "ផន  សាវឿង"
        },
        {
            "barcode": "171112681",
            "dpc": "03013104801",
            "name": "ទូច  ស៊ីណាត"
        },
        {
            "barcode": "171112682",
            "dpc": "03013104901",
            "name": "ទូច"
        },
        {
            "barcode": "171112683",
            "dpc": "03013105001",
            "name": "អាន  សំណាង"
        },
        {
            "barcode": "171112684",
            "dpc": "03013105101",
            "name": "គៀង  ប៊ុនលី"
        },
        {
            "barcode": "171112685",
            "dpc": "03013105201",
            "name": "ផាន់  ផល្លី"
        },
        {
            "barcode": "171112686",
            "dpc": "03013105301",
            "name": "យ៉េន  យឿត"
        },
        {
            "barcode": "171112687",
            "dpc": "03013105401",
            "name": "ចាន់ រី"
        },
        {
            "barcode": "171112688",
            "dpc": "03013105501",
            "name": "ង៉ា  ផារី"
        },
        {
            "barcode": "171112689",
            "dpc": "03013105601",
            "name": "គៀង  ចាន់ណា"
        },
        {
            "barcode": "171112690",
            "dpc": "03013105701",
            "name": "គឹង  វឿង"
        },
        {
            "barcode": "171112691",
            "dpc": "03013105801",
            "name": "ហង់  ឈឿយ"
        },
        {
            "barcode": "171112692",
            "dpc": "03013105901",
            "name": "ថោង  សាេវត"
        },
        {
            "barcode": "171112693",
            "dpc": "03013106101",
            "name": "ជិន  ធារី"
        },
        {
            "barcode": "171112694",
            "dpc": "03013106201",
            "name": "ប៊យ  ពូន"
        },
        {
            "barcode": "171112695",
            "dpc": "03013106301",
            "name": "ហ៊ុន  យ៉ត"
        },
        {
            "barcode": "171112696",
            "dpc": "03013106401",
            "name": "វ៉ិត  កំសាន្ត"
        },
        {
            "barcode": "171112697",
            "dpc": "03013106501",
            "name": "យួម  ស៊ីយ៉េត"
        },
        {
            "barcode": "171112698",
            "dpc": "03013106601",
            "name": "យ៉ុង  វុធ"
        },
        {
            "barcode": "171112699",
            "dpc": "03013106701",
            "name": "ហ៊ុន  សាម៉េត"
        },
        {
            "barcode": "171112700",
            "dpc": "03013106801",
            "name": "ស៊ុន  សាខាត"
        },
        {
            "barcode": "171112701",
            "dpc": "03013106901",
            "name": "ហេង  ឈឿ"
        },
        {
            "barcode": "171112702",
            "dpc": "03013107001",
            "name": "ញឹក  ពុំ"
        },
        {
            "barcode": "171112703",
            "dpc": "03013107101",
            "name": "សោម  សឺនឺ"
        },
        {
            "barcode": "171112704",
            "dpc": "03013107201",
            "name": "ហេង  ហ៊ាង"
        },
        {
            "barcode": "171112705",
            "dpc": "03013107401",
            "name": "លឿង  លុយ"
        },
        {
            "barcode": "171112706",
            "dpc": "03013107601",
            "name": "ទេព  សាវឿន"
        },
        {
            "barcode": "171112707",
            "dpc": "03013107701",
            "name": "ញឹក  សាវ៉ង"
        },
        {
            "barcode": "171112708",
            "dpc": "03013107801",
            "name": "ឡោ  ឈឿត"
        },
        {
            "barcode": "171112709",
            "dpc": "03013107901",
            "name": "ព្រីង  យ៉េត"
        },
        {
            "barcode": "171112710",
            "dpc": "03013108001",
            "name": "ស៊ុម  វ៉ុង"
        },
        {
            "barcode": "171112711",
            "dpc": "03013108101",
            "name": "ហេង  ថុល"
        },
        {
            "barcode": "171112712",
            "dpc": "03013108201",
            "name": "ស៊ុន  យូណាន"
        },
        {
            "barcode": "171112713",
            "dpc": "03013108301",
            "name": "វាន់   សុខា"
        },
        {
            "barcode": "171112714",
            "dpc": "03013108501",
            "name": "ង៉ាត់  នឿត"
        },
        {
            "barcode": "171112715",
            "dpc": "03013108601",
            "name": "ចិន  រើត"
        },
        {
            "barcode": "171112716",
            "dpc": "03013108701",
            "name": "ឡាត់  លី"
        },
        {
            "barcode": "171112717",
            "dpc": "03013108801",
            "name": "គឹម  សេង"
        },
        {
            "barcode": "171112718",
            "dpc": "03013109001",
            "name": "ម៉ឹង  សាវ៉ាត់"
        },
        {
            "barcode": "171112719",
            "dpc": "03013109101",
            "name": "វ៉ាត  សុខា"
        },
        {
            "barcode": "171112720",
            "dpc": "03013109201",
            "name": "ឈៀង  ឆវន្ត័"
        },
        {
            "barcode": "171112721",
            "dpc": "03013109301",
            "name": "ជាស  សម្បត្តិ"
        },
        {
            "barcode": "171112722",
            "dpc": "03013109401",
            "name": "គៀង  យ៉ា"
        },
        {
            "barcode": "171112723",
            "dpc": "03013109501",
            "name": "ស៊ុំ  សំអ៊ុល"
        },
        {
            "barcode": "171112724",
            "dpc": "03013109701",
            "name": "តុង  មារីកា"
        },
        {
            "barcode": "171112725",
            "dpc": "03013109801",
            "name": "ជា  វ៉ាន់ណូ"
        },
        {
            "barcode": "171112726",
            "dpc": "03013109901",
            "name": "ឈិត  គន្ធី"
        },
        {
            "barcode": "171112727",
            "dpc": "03013110001",
            "name": "ថេត  សុធា"
        },
        {
            "barcode": "171112728",
            "dpc": "03013110101",
            "name": "សេង  ហ៊ាង"
        },
        {
            "barcode": "171112729",
            "dpc": "03013110201",
            "name": "មាន  សុភ័ក្រ"
        },
        {
            "barcode": "171112730",
            "dpc": "03013110301",
            "name": "មាន  ផាវ"
        },
        {
            "barcode": "171112731",
            "dpc": "03013110501",
            "name": "ម៉ី  ជា"
        },
        {
            "barcode": "171112732",
            "dpc": "03013110601",
            "name": "ទឹតលី ចំរើន"
        },
        {
            "barcode": "171112733",
            "dpc": "03013110701",
            "name": "ថាច់  កូដាវី"
        },
        {
            "barcode": "171112734",
            "dpc": "03013110801",
            "name": "ឆេង  ឌី"
        },
        {
            "barcode": "171112735",
            "dpc": "03013110901",
            "name": "ព្រំ  សុភិន"
        },
        {
            "barcode": "171112736",
            "dpc": "03013111101",
            "name": "ចំរើន វិច្ឆិកា"
        },
        {
            "barcode": "171112737",
            "dpc": "03013111301",
            "name": "តឹង  នៅ"
        },
        {
            "barcode": "171112738",
            "dpc": "03013111401",
            "name": "ប៉ុល  ពេជ្រ"
        },
        {
            "barcode": "171112739",
            "dpc": "03013111501",
            "name": "ចាន់   សាវិត"
        },
        {
            "barcode": "171112740",
            "dpc": "03013111601",
            "name": "ឈៀង  លីណា"
        },
        {
            "barcode": "171112741",
            "dpc": "03013111701",
            "name": "ឃួន  វិច្ឆិកា"
        },
        {
            "barcode": "171112742",
            "dpc": "03013111901",
            "name": "ហេង  សុភាព"
        },
        {
            "barcode": "171112743",
            "dpc": "03013112001",
            "name": "គង់  ចាន់ណាត"
        },
        {
            "barcode": "171112744",
            "dpc": "03013112101",
            "name": "ប៉ុង  សុផាត"
        },
        {
            "barcode": "171112745",
            "dpc": "03013112201",
            "name": "សំ  រិតកង"
        },
        {
            "barcode": "171112746",
            "dpc": "03013112301",
            "name": "សឿម  ទ្រី"
        },
        {
            "barcode": "171112747",
            "dpc": "03013112401",
            "name": "ជឿម ណារិន"
        },
        {
            "barcode": "171112748",
            "dpc": "03013112501",
            "name": "ឡុង  វិចិត្រ"
        },
        {
            "barcode": "171112749",
            "dpc": "03013112601",
            "name": "ង៉ែត  ជឿង"
        },
        {
            "barcode": "171112750",
            "dpc": "03013112701",
            "name": "ស្ងួន  សឿម"
        },
        {
            "barcode": "171112751",
            "dpc": "03013112801",
            "name": "អ៊ិត  ដាវុធ"
        },
        {
            "barcode": "171112752",
            "dpc": "03013112901",
            "name": "ចាន់  សុវណ្ណ"
        },
        {
            "barcode": "171112753",
            "dpc": "03013113101",
            "name": "ប៉ែន  សុខា"
        },
        {
            "barcode": "171112754",
            "dpc": "03013113201",
            "name": "សួ  មិញ"
        },
        {
            "barcode": "171112755",
            "dpc": "03013113301",
            "name": "ប៊ុត សេរី"
        },
        {
            "barcode": "171112756",
            "dpc": "03013113401",
            "name": "ទូច ផល្លី"
        },
        {
            "barcode": "171112757",
            "dpc": "03013113501",
            "name": "វ៉ាន់  វណ្ណា"
        },
        {
            "barcode": "171112758",
            "dpc": "03013113601",
            "name": "សោម  ស៊ាន"
        },
        {
            "barcode": "171112759",
            "dpc": "03013113801",
            "name": "ស៊ឹម  សំប៊ួ"
        },
        {
            "barcode": "171112760",
            "dpc": "03013114001",
            "name": "ឈួន  ឈូរ៉ា"
        },
        {
            "barcode": "171112761",
            "dpc": "03013114201",
            "name": "គឹម  វណ្ណា"
        },
        {
            "barcode": "171112762",
            "dpc": "03013114301",
            "name": "ងឿន  ចាន់សុជាតិ"
        },
        {
            "barcode": "171112763",
            "dpc": "03013114401",
            "name": "ឡម  មៀង"
        },
        {
            "barcode": "171112764",
            "dpc": "03013114501",
            "name": "ឆើត  កន្យាណ"
        },
        {
            "barcode": "171112765",
            "dpc": "03013114601",
            "name": "ផែង  សាវរី"
        },
        {
            "barcode": "171112766",
            "dpc": "03013114701",
            "name": "គី  គាន"
        },
        {
            "barcode": "171112767",
            "dpc": "03013114801",
            "name": "សោម  សាន្ត"
        },
        {
            "barcode": "171112768",
            "dpc": "03013114901",
            "name": "ហួច  ចន្នី"
        },
        {
            "barcode": "171112769",
            "dpc": "03013115001",
            "name": "មុត  ភារម្យ"
        },
        {
            "barcode": "171112770",
            "dpc": "03013115101",
            "name": "ស្រី  សុភក្រ័"
        },
        {
            "barcode": "171112771",
            "dpc": "03013115201",
            "name": "ឆាត  កាម៉ាច"
        },
        {
            "barcode": "171112772",
            "dpc": "03013115301",
            "name": "ភឿក  អ៊ីង"
        },
        {
            "barcode": "171112773",
            "dpc": "03013115501",
            "name": "អូច  ភាព"
        },
        {
            "barcode": "171112774",
            "dpc": "03013115601",
            "name": "អ៊ុច  សាវុន"
        },
        {
            "barcode": "171112775",
            "dpc": "03013115701",
            "name": "រ៉េត  ប៊ុនថង"
        },
        {
            "barcode": "171112776",
            "dpc": "03013115801",
            "name": "អាង  អានីតា"
        },
        {
            "barcode": "171112777",
            "dpc": "03013115901",
            "name": "ឆាន   ស៊ីភន"
        },
        {
            "barcode": "171112778",
            "dpc": "03013116001",
            "name": "ឆាន  សារឿន"
        },
        {
            "barcode": "171112779",
            "dpc": "03013116101",
            "name": "អ៊ុំ  គុំភឿន"
        },
        {
            "barcode": "171112780",
            "dpc": "03013116201",
            "name": "ភិន  សារ៉ុន"
        },
        {
            "barcode": "171112781",
            "dpc": "03013116301",
            "name": "វើយ  ថា"
        },
        {
            "barcode": "171112782",
            "dpc": "03013116401",
            "name": "រ៉េន  ដារត្ន័"
        },
        {
            "barcode": "171112783",
            "dpc": "03013116501",
            "name": "ថាប់  ចាន់ដាវី"
        },
        {
            "barcode": "171112784",
            "dpc": "03013116601",
            "name": "កាន់  សាម៉េត"
        },
        {
            "barcode": "171112785",
            "dpc": "03013116701",
            "name": "រាជ  ឈិន"
        },
        {
            "barcode": "171112786",
            "dpc": "03013116801",
            "name": "សំ  រីណា"
        },
        {
            "barcode": "171112787",
            "dpc": "03013116901",
            "name": "សេក  ភី"
        },
        {
            "barcode": "171112788",
            "dpc": "03013117001",
            "name": "សាន់  វ៉ុន"
        },
        {
            "barcode": "171112789",
            "dpc": "03013117101",
            "name": "ហុង  សុខេន"
        },
        {
            "barcode": "171112790",
            "dpc": "03013117201",
            "name": "បួ  ផានិត"
        },
        {
            "barcode": "171112791",
            "dpc": "03013117401",
            "name": "អ៊ូច  សាវុធ"
        },
        {
            "barcode": "171112792",
            "dpc": "03013117501",
            "name": "ចាន់  ស៊ត"
        },
        {
            "barcode": "171112793",
            "dpc": "03013117601",
            "name": "ទូច  សម្បត្តិ"
        },
        {
            "barcode": "171112794",
            "dpc": "03013117701",
            "name": "ទូច  សំបូរ"
        },
        {
            "barcode": "171112795",
            "dpc": "03013117801",
            "name": "ទូច  រំចេក"
        },
        {
            "barcode": "171112796",
            "dpc": "03013117901",
            "name": "អៀង  ចិន្តា"
        },
        {
            "barcode": "171112797",
            "dpc": "03013118001",
            "name": "យ៉ាង  ឈួម"
        },
        {
            "barcode": "171112798",
            "dpc": "03013118101",
            "name": "យូ  លីន"
        },
        {
            "barcode": "171112799",
            "dpc": "03013118201",
            "name": "សាលារៀនបោះពោធិ"
        },
        {
            "barcode": "171112800",
            "dpc": "03013118301",
            "name": "ថាច់  ដុក"
        },
        {
            "barcode": "171112801",
            "dpc": "03013118401",
            "name": "លឹម  គឹមអេង"
        },
        {
            "barcode": "171112802",
            "dpc": "03013118501",
            "name": "ម៉ៅ  វឿង"
        },
        {
            "barcode": "171112803",
            "dpc": "03013118601",
            "name": "លុច  លី"
        },
        {
            "barcode": "171112804",
            "dpc": "03013118801",
            "name": "នៅ  សាលឹម"
        },
        {
            "barcode": "171112805",
            "dpc": "03013118901",
            "name": "គឹម  រិទ្ធ"
        },
        {
            "barcode": "171112806",
            "dpc": "03013119001",
            "name": "ហួត  សំបាន"
        },
        {
            "barcode": "171112807",
            "dpc": "03013119101",
            "name": "យ៉ែម  គឹមស៊ុន"
        },
        {
            "barcode": "171112808",
            "dpc": "03013119201",
            "name": "ញឹក  ផល"
        },
        {
            "barcode": "171112809",
            "dpc": "03013119301",
            "name": "ហម  រតនា"
        },
        {
            "barcode": "171112810",
            "dpc": "03013119401",
            "name": "នង  ប៊ុនធឿន"
        },
        {
            "barcode": "171112811",
            "dpc": "03013119501",
            "name": "កែវ  អូន"
        },
        {
            "barcode": "171112812",
            "dpc": "03013119601",
            "name": "អែប  សាវេត"
        },
        {
            "barcode": "171112813",
            "dpc": "03013119801",
            "name": "សឿន   សុខា"
        },
        {
            "barcode": "171112814",
            "dpc": "03013119901",
            "name": "ង៉ុល  ងួន"
        },
        {
            "barcode": "171112815",
            "dpc": "03013120001",
            "name": "ងើយ  សំបូរ"
        },
        {
            "barcode": "171112816",
            "dpc": "03013120101",
            "name": "ឈុន  សៅយ៉ុត"
        },
        {
            "barcode": "171112817",
            "dpc": "03013120201",
            "name": "លឹម  ដារ៉ា"
        },
        {
            "barcode": "171112818",
            "dpc": "03013120301",
            "name": "ហុង  ហេង"
        },
        {
            "barcode": "171112819",
            "dpc": "03013120401",
            "name": "ផន  សុខុម"
        },
        {
            "barcode": "171112820",
            "dpc": "03013120501",
            "name": "ភួង  ភណ័្ឌ"
        },
        {
            "barcode": "171112821",
            "dpc": "03013120701",
            "name": "ង៉ូវ  សារិទ្ធ"
        },
        {
            "barcode": "171112822",
            "dpc": "03013120901",
            "name": "ជា  រស់"
        },
        {
            "barcode": "171112823",
            "dpc": "03013121001",
            "name": "សម  ម៉េត"
        },
        {
            "barcode": "171112824",
            "dpc": "03013121101",
            "name": "ប៉ែន  សុផល"
        },
        {
            "barcode": "171112825",
            "dpc": "03013121201",
            "name": "ស៊ុយ អ៊ឹង"
        },
        {
            "barcode": "171112826",
            "dpc": "03013121301",
            "name": "ម៉ៅ  រើន"
        },
        {
            "barcode": "171112827",
            "dpc": "03013121501",
            "name": "ហួត  ឈើយ"
        },
        {
            "barcode": "171112828",
            "dpc": "03013121601",
            "name": "សៀន  ជុំ"
        },
        {
            "barcode": "171112829",
            "dpc": "03013121701",
            "name": "អុង  ដារ៉ា"
        },
        {
            "barcode": "171112830",
            "dpc": "03013121801",
            "name": "ទៀវ  យូហឿល"
        },
        {
            "barcode": "171112831",
            "dpc": "03013121901",
            "name": "សាំង  សុខា"
        },
        {
            "barcode": "171112832",
            "dpc": "03013122001",
            "name": "ប៉ែន  មី"
        },
        {
            "barcode": "171112833",
            "dpc": "03013122101",
            "name": "មាស  នឿន"
        },
        {
            "barcode": "171112834",
            "dpc": "03013122201",
            "name": "ហេង  ឃន"
        },
        {
            "barcode": "171112835",
            "dpc": "03013122301",
            "name": "ហេង  គឹម"
        },
        {
            "barcode": "171112836",
            "dpc": "03013122401",
            "name": "ទៀវ  គឹមវ៉ាន់"
        },
        {
            "barcode": "171112837",
            "dpc": "03013122501",
            "name": "គី  ឡុង"
        },
        {
            "barcode": "171112838",
            "dpc": "03013122601",
            "name": "តាំង  ប៊ុនធឿយ"
        },
        {
            "barcode": "171112839",
            "dpc": "03013122701",
            "name": "សោ  ចន្ទ័រី"
        },
        {
            "barcode": "171112840",
            "dpc": "03013122801",
            "name": "សៀង  កាំងហ៊ុន"
        },
        {
            "barcode": "171112841",
            "dpc": "03013122901",
            "name": "សៀង  ម៉ាប់"
        },
        {
            "barcode": "171112842",
            "dpc": "03013123001",
            "name": "សៀង  ខុន"
        },
        {
            "barcode": "171112843",
            "dpc": "03013123101",
            "name": "សៀង  ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171112844",
            "dpc": "03013123201",
            "name": "មិត  យ៉ត"
        },
        {
            "barcode": "171112845",
            "dpc": "03013123301",
            "name": "អ៊ិត  ហ៊ុំ"
        },
        {
            "barcode": "171112846",
            "dpc": "03013123401",
            "name": "ឃុន  លក្ខិណា"
        },
        {
            "barcode": "171112847",
            "dpc": "03013123501",
            "name": "វ៉ន លឿត"
        },
        {
            "barcode": "171112848",
            "dpc": "03013123601",
            "name": "ចាយ  ផល្លី"
        },
        {
            "barcode": "171112849",
            "dpc": "03013123701",
            "name": "តូច  ប៊ុនធី"
        },
        {
            "barcode": "171112850",
            "dpc": "03013123801",
            "name": "តូច  ធីណូ"
        },
        {
            "barcode": "171112851",
            "dpc": "03013123901",
            "name": "គីរី  សត្យា"
        },
        {
            "barcode": "171112852",
            "dpc": "03013124001",
            "name": "យ៉ក់  តាំងលី"
        },
        {
            "barcode": "171112853",
            "dpc": "03013124101",
            "name": "ផាត់  ភីវីរៈ"
        },
        {
            "barcode": "171112854",
            "dpc": "03013124201",
            "name": "តាត់  ហ៊ន"
        },
        {
            "barcode": "171112855",
            "dpc": "03013124401",
            "name": "វឹង  មួច"
        },
        {
            "barcode": "171112856",
            "dpc": "03013124601",
            "name": "រ៉េន  វឿន"
        },
        {
            "barcode": "171112857",
            "dpc": "03013124701",
            "name": "វិត  មូណូ"
        },
        {
            "barcode": "171112858",
            "dpc": "03013124801",
            "name": "រ៉ន  ណាន"
        },
        {
            "barcode": "171112859",
            "dpc": "03013124901",
            "name": "មួង  មន៉"
        },
        {
            "barcode": "171112860",
            "dpc": "03013125001",
            "name": "ផុន  មុំ"
        },
        {
            "barcode": "171112861",
            "dpc": "03013125201",
            "name": "ប៉ូលី  ង៉ាន់"
        },
        {
            "barcode": "171112862",
            "dpc": "03013125401",
            "name": "ហម  សាម"
        },
        {
            "barcode": "171112863",
            "dpc": "03013125501",
            "name": "នួន  ផាត"
        },
        {
            "barcode": "171112864",
            "dpc": "03013125601",
            "name": "អ៊ឹង សុគន្ធ"
        },
        {
            "barcode": "171112865",
            "dpc": "03013125701",
            "name": "វង្ស  សុផា"
        },
        {
            "barcode": "171112866",
            "dpc": "03013125801",
            "name": "ប៉ិច  ប៉ូ"
        },
        {
            "barcode": "171112867",
            "dpc": "03013125901",
            "name": "នួន  វាសនា"
        },
        {
            "barcode": "171112868",
            "dpc": "03013126001",
            "name": "ភ័ក្រ"
        },
        {
            "barcode": "171112869",
            "dpc": "03013126101",
            "name": "ប្រាក់ ថា"
        },
        {
            "barcode": "171112870",
            "dpc": "03013126201",
            "name": "កាយ  ចាន់ថន់"
        },
        {
            "barcode": "171112871",
            "dpc": "03013126301",
            "name": "អ៊ុល  សុផល"
        },
        {
            "barcode": "171112872",
            "dpc": "03013126401",
            "name": "អៀ  វេងម៉ុង"
        },
        {
            "barcode": "171112873",
            "dpc": "03013126501",
            "name": "ធូ  សុខណា"
        },
        {
            "barcode": "171112874",
            "dpc": "03013126601",
            "name": "កែវ  ចំចន្ទ័"
        },
        {
            "barcode": "171112875",
            "dpc": "03013126701",
            "name": "អ៊ីវ  វេងម៉ុង"
        },
        {
            "barcode": "171112876",
            "dpc": "03013126801",
            "name": "តាំង  ណាំសែ"
        },
        {
            "barcode": "171112877",
            "dpc": "03013126901",
            "name": "ឈុន  លក្ខិណា"
        },
        {
            "barcode": "171112878",
            "dpc": "03013127001",
            "name": "វ៉ាត  ស៊ីម"
        },
        {
            "barcode": "171112879",
            "dpc": "03013127101",
            "name": "តាំង  ប៊ូហេង"
        },
        {
            "barcode": "171112880",
            "dpc": "03013127201",
            "name": "សួស  យ៉ុតថាណូ"
        },
        {
            "barcode": "171112881",
            "dpc": "03013127301",
            "name": "ជា  ពិសិទ្ធ"
        },
        {
            "barcode": "171112882",
            "dpc": "03013127501",
            "name": "សៀម សុន"
        },
        {
            "barcode": "171112883",
            "dpc": "03013127601",
            "name": "សុខ  ឈៀន"
        },
        {
            "barcode": "171112884",
            "dpc": "03013127701",
            "name": "ឆៃ   ណារិទ្ធ"
        },
        {
            "barcode": "171112885",
            "dpc": "03013127801",
            "name": "អ៊ូ  វឿត"
        },
        {
            "barcode": "171112886",
            "dpc": "03013127901",
            "name": "អ៊ូ  ចំរើន"
        },
        {
            "barcode": "171112887",
            "dpc": "03013128001",
            "name": "យ៉ាំ  នុយ"
        },
        {
            "barcode": "171112888",
            "dpc": "03013128101",
            "name": "សុខ  ធី"
        },
        {
            "barcode": "171112889",
            "dpc": "03013128301",
            "name": "វែន  សុខុម"
        },
        {
            "barcode": "171112890",
            "dpc": "03013128401",
            "name": "ប្រស់  សឿប"
        },
        {
            "barcode": "171112891",
            "dpc": "03013128601",
            "name": "វង់   សាវ៉ុង"
        },
        {
            "barcode": "171112892",
            "dpc": "03013128701",
            "name": "សុក  រតនា"
        },
        {
            "barcode": "171112893",
            "dpc": "03013128801",
            "name": "ស៊ីន  ថា"
        },
        {
            "barcode": "171112894",
            "dpc": "03013128901",
            "name": "ស៊ីម  ស៊ាន"
        },
        {
            "barcode": "171112895",
            "dpc": "03013129001",
            "name": "ភិន  ប៊ុនណ្ណាត"
        },
        {
            "barcode": "171112896",
            "dpc": "03013129201",
            "name": "ភទ្ធ  មុន្នី"
        },
        {
            "barcode": "171112897",
            "dpc": "03013129301",
            "name": "ពេជ្រ  ឆោមឆវណ្ណ"
        },
        {
            "barcode": "171112898",
            "dpc": "03013129401",
            "name": "សំ   នៅ"
        },
        {
            "barcode": "171112899",
            "dpc": "03013129501",
            "name": "មឿន  ពុយ"
        },
        {
            "barcode": "171112900",
            "dpc": "03013129601",
            "name": "ហែម  សុធា"
        },
        {
            "barcode": "171112901",
            "dpc": "03013129701",
            "name": "នួន  ផន"
        },
        {
            "barcode": "171112902",
            "dpc": "03013129801",
            "name": "សុខ  សំណាង"
        },
        {
            "barcode": "171112903",
            "dpc": "03013129901",
            "name": "ចេត យី"
        },
        {
            "barcode": "171112904",
            "dpc": "03013130001",
            "name": "វង្ស  ប៉ោលី"
        },
        {
            "barcode": "171112905",
            "dpc": "03013130101",
            "name": "ភុំ  រក្សា ​"
        },
        {
            "barcode": "171112906",
            "dpc": "03013130201",
            "name": "សុច  សូនី"
        },
        {
            "barcode": "171112907",
            "dpc": "03013130301",
            "name": "ឡុង  ហុង"
        },
        {
            "barcode": "171112908",
            "dpc": "03013130401",
            "name": "សឿន  ធី"
        },
        {
            "barcode": "171112909",
            "dpc": "03013130501",
            "name": "ក្រេម  សាវ៉ាង"
        },
        {
            "barcode": "171112910",
            "dpc": "03013130601",
            "name": "សែស  រ៉ា"
        },
        {
            "barcode": "171112911",
            "dpc": "03013130701",
            "name": "សាន  សម្បត្តិ"
        },
        {
            "barcode": "171112912",
            "dpc": "03013130801",
            "name": "ចាន់  សុធា"
        },
        {
            "barcode": "171112913",
            "dpc": "03013130901",
            "name": "ម៉េត  មករា"
        },
        {
            "barcode": "171112914",
            "dpc": "03013131101",
            "name": "មុំ  សុភាព"
        },
        {
            "barcode": "171112915",
            "dpc": "03013131301",
            "name": "ម៉ី  វាសនា"
        },
        {
            "barcode": "171112916",
            "dpc": "03013131401",
            "name": "យឹម  សុជាតិ"
        },
        {
            "barcode": "171112917",
            "dpc": "03013131501",
            "name": "ជឿង  បូណា"
        },
        {
            "barcode": "171112918",
            "dpc": "03013131601",
            "name": "សុខ  តណ"
        },
        {
            "barcode": "171112919",
            "dpc": "03013131701",
            "name": "ផន  ផល្លា"
        },
        {
            "barcode": "171112920",
            "dpc": "03013132001",
            "name": "ជា  មឿត"
        },
        {
            "barcode": "171112921",
            "dpc": "03013132101",
            "name": "ហ៊ត  ពឿត"
        },
        {
            "barcode": "171112922",
            "dpc": "03013132201",
            "name": "ទូត  កក្កដា"
        },
        {
            "barcode": "171112923",
            "dpc": "03013132301",
            "name": "វ័រ  វ៉ាត"
        },
        {
            "barcode": "171112924",
            "dpc": "03013132401",
            "name": "ជា  សាវៀង"
        },
        {
            "barcode": "171112925",
            "dpc": "03013132501",
            "name": "ឈៀន  សុភាព"
        },
        {
            "barcode": "171112926",
            "dpc": "03013132801",
            "name": "រៀន  ហាប"
        },
        {
            "barcode": "171112927",
            "dpc": "03013133001",
            "name": "មាន សុវណ្ណធីតា"
        },
        {
            "barcode": "171112928",
            "dpc": "03013133101",
            "name": "មាន  សុវណ្ណសូនី"
        },
        {
            "barcode": "171112929",
            "dpc": "03013133201",
            "name": "ព្រូ  ដា"
        },
        {
            "barcode": "171112930",
            "dpc": "03013133401",
            "name": "តុល  ចាប"
        },
        {
            "barcode": "171112931",
            "dpc": "03013133501",
            "name": "ឈុន  ប៊ុនឈួង"
        },
        {
            "barcode": "171112932",
            "dpc": "03013133601",
            "name": "ហែល  ហម"
        },
        {
            "barcode": "171112933",
            "dpc": "03013133701",
            "name": "ប៊ុន  សាឃឹន"
        },
        {
            "barcode": "171112934",
            "dpc": "03013133801",
            "name": "មិត្ត  ឆើន"
        },
        {
            "barcode": "171112935",
            "dpc": "03013133901",
            "name": "រ៉ន  សារ៉េន"
        },
        {
            "barcode": "171112936",
            "dpc": "03013134001",
            "name": "ឈុន  ធី"
        },
        {
            "barcode": "171112937",
            "dpc": "03013134201",
            "name": "កិៈ  ចិន្តា"
        },
        {
            "barcode": "171112938",
            "dpc": "03013134301",
            "name": "ផន  ស្រីដា"
        },
        {
            "barcode": "171112939",
            "dpc": "03013134401",
            "name": "ហេង  វណ្ណា"
        },
        {
            "barcode": "171112940",
            "dpc": "03013134501",
            "name": "ឡាច  វីរៈ"
        },
        {
            "barcode": "171112941",
            "dpc": "03013134601",
            "name": "ម៉ែន  បូរី"
        },
        {
            "barcode": "171112942",
            "dpc": "03013134701",
            "name": "ឈាង  ចន្ធូ"
        },
        {
            "barcode": "171112943",
            "dpc": "03013134801",
            "name": "សុទ្ថ  សុផារត្ន័"
        },
        {
            "barcode": "171112944",
            "dpc": "03013134901",
            "name": "ថុក  ហ៊ឺ"
        },
        {
            "barcode": "171112945",
            "dpc": "03013135001",
            "name": "អ៊ុក  សុផល"
        },
        {
            "barcode": "171112946",
            "dpc": "03013135101",
            "name": "គង់  សម្ជស្ស"
        },
        {
            "barcode": "171112947",
            "dpc": "03013135201",
            "name": "សៅ  រ៉ា"
        },
        {
            "barcode": "171112948",
            "dpc": "03013135301",
            "name": "ឡែម  ដូត"
        },
        {
            "barcode": "171112949",
            "dpc": "03013135401",
            "name": "អ៊ុង  សុវណ្ណ"
        },
        {
            "barcode": "171112950",
            "dpc": "03013135501",
            "name": "ទេព  គឹមសា"
        },
        {
            "barcode": "171112951",
            "dpc": "03013135601",
            "name": "អ៊ិង  កុច"
        },
        {
            "barcode": "171112952",
            "dpc": "03013135801",
            "name": "សៅ  សេក"
        },
        {
            "barcode": "171112953",
            "dpc": "03013135901",
            "name": "សុខ  យ៉េត"
        },
        {
            "barcode": "171112954",
            "dpc": "03013136001",
            "name": "យិន  វណ្ណារី"
        },
        {
            "barcode": "171112955",
            "dpc": "03013136101",
            "name": "ឈួម"
        },
        {
            "barcode": "171112956",
            "dpc": "03013136301",
            "name": "ថោង ប្រានី"
        },
        {
            "barcode": "171112957",
            "dpc": "03013136401",
            "name": "ប្រា កូណាល"
        },
        {
            "barcode": "171112958",
            "dpc": "03013136601",
            "name": "ឡុង  វឿត"
        },
        {
            "barcode": "171112959",
            "dpc": "03013136701",
            "name": "សុផានី"
        },
        {
            "barcode": "171112960",
            "dpc": "03013136801",
            "name": "ហម  ប៊ុនរិទ្ឋ"
        },
        {
            "barcode": "171112961",
            "dpc": "03013136901",
            "name": "ប្រាក់ គីណា"
        },
        {
            "barcode": "171112962",
            "dpc": "03013137001",
            "name": "កោ  ចិត្ត្រា"
        },
        {
            "barcode": "171112963",
            "dpc": "03013137101",
            "name": "អ៊ិត  មាលា"
        },
        {
            "barcode": "171112964",
            "dpc": "03013137201",
            "name": "រុំ  វ៉ាន់ធី"
        },
        {
            "barcode": "171112965",
            "dpc": "03013137301",
            "name": "ទូត រុំម្លាស់"
        },
        {
            "barcode": "171112966",
            "dpc": "03013137401",
            "name": "សោម មុនី"
        },
        {
            "barcode": "171112967",
            "dpc": "03013137501",
            "name": "ខែម  ខេន"
        },
        {
            "barcode": "171112968",
            "dpc": "03013137601",
            "name": "ជាំ  ចាន់"
        },
        {
            "barcode": "171112969",
            "dpc": "03013137701",
            "name": "ម៉  ឈៀប"
        },
        {
            "barcode": "171112970",
            "dpc": "03013137801",
            "name": "ហ៊ីម  ឈួប"
        },
        {
            "barcode": "171112971",
            "dpc": "03013137901",
            "name": "សេង  ចាន់"
        },
        {
            "barcode": "171112972",
            "dpc": "03013138001",
            "name": "យ៉ុង  យ៉ាន់"
        },
        {
            "barcode": "171112973",
            "dpc": "03013138101",
            "name": "គ្រី  ហ៊ាង"
        },
        {
            "barcode": "171112974",
            "dpc": "03013138201",
            "name": "សោម ឆាន់"
        },
        {
            "barcode": "171112975",
            "dpc": "03013138301",
            "name": "តិច  គឹមស៊ា"
        },
        {
            "barcode": "171112976",
            "dpc": "03013138401",
            "name": "ងិន សុវណ្ណ"
        },
        {
            "barcode": "171112977",
            "dpc": "03013138501",
            "name": "ម៉ាន់  អ៊ុំមី"
        },
        {
            "barcode": "171112978",
            "dpc": "03013138601",
            "name": "ម៉ាន់  អ៊ុលឡាវី"
        },
        {
            "barcode": "171112979",
            "dpc": "03013138701",
            "name": "គា​​  ឡៃ"
        },
        {
            "barcode": "171112980",
            "dpc": "03013138801",
            "name": "មួន  ម៉ាប់"
        },
        {
            "barcode": "171112981",
            "dpc": "03013138901",
            "name": "ជា និស្ស័យ"
        },
        {
            "barcode": "171112982",
            "dpc": "03013139001",
            "name": "ហួយ  គឹមឈរ"
        },
        {
            "barcode": "171112983",
            "dpc": "03013139101",
            "name": "ម៉េង  សុផៃ"
        },
        {
            "barcode": "171112984",
            "dpc": "03013139501",
            "name": "អ៊ន សារិទ្ឋិ"
        },
        {
            "barcode": "171112985",
            "dpc": "03013139701",
            "name": "រ៉ាត ស៊ុនណារី"
        },
        {
            "barcode": "171112986",
            "dpc": "03013139801",
            "name": "គា  ធូន"
        },
        {
            "barcode": "171112987",
            "dpc": "03013139901",
            "name": "សៀវ មន្ថា"
        },
        {
            "barcode": "171112988",
            "dpc": "03013140001",
            "name": "លី លន់"
        },
        {
            "barcode": "171112989",
            "dpc": "03013140101",
            "name": "ហម ផារី"
        },
        {
            "barcode": "171112990",
            "dpc": "03013140201",
            "name": "សុត ចន្ថា"
        },
        {
            "barcode": "171112991",
            "dpc": "03013140301",
            "name": "សេន  ផល្លា"
        },
        {
            "barcode": "171112992",
            "dpc": "03013140501",
            "name": "ស៊ូ  រឿន"
        },
        {
            "barcode": "171112993",
            "dpc": "03013140601",
            "name": "ឆុន វណ្ណឌឿន"
        },
        {
            "barcode": "171112994",
            "dpc": "03013140701",
            "name": "លីន ស៊ីណាត"
        },
        {
            "barcode": "171112995",
            "dpc": "03013140801",
            "name": "ទុយ គី"
        },
        {
            "barcode": "171112996",
            "dpc": "03013140901",
            "name": "ញៀន សុភាព"
        },
        {
            "barcode": "171112997",
            "dpc": "03013141001",
            "name": "គុយ ឆោមរ័ត្ន"
        },
        {
            "barcode": "171112998",
            "dpc": "03013141101",
            "name": "បេង ចេង"
        },
        {
            "barcode": "171112999",
            "dpc": "03013141201",
            "name": "ពៅ រី"
        },
        {
            "barcode": "171113000",
            "dpc": "03013141301",
            "name": "ណាំ រ៉ាវ័ន្ត"
        },
        {
            "barcode": "171113001",
            "dpc": "03013141501",
            "name": "ប៉ែន សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171113002",
            "dpc": "03013141601",
            "name": "កៅ  ចំរើន"
        },
        {
            "barcode": "171113003",
            "dpc": "03013141701",
            "name": "ស្រូច លឹម២"
        },
        {
            "barcode": "171113004",
            "dpc": "03013141801",
            "name": "វ៉ាន់  ខូវ"
        },
        {
            "barcode": "171113005",
            "dpc": "03013141901",
            "name": "វ៉ាន់ សាវី"
        },
        {
            "barcode": "171113006",
            "dpc": "03013142001",
            "name": "ឈិត  ពីវ"
        },
        {
            "barcode": "171113007",
            "dpc": "03013142101",
            "name": "ស្រី សុខឃាង"
        },
        {
            "barcode": "171113008",
            "dpc": "03013142201",
            "name": "ស៊ុន សុវណ្ណារិទ្ឋ"
        },
        {
            "barcode": "171113009",
            "dpc": "03013142301",
            "name": "រីន វណ្ណារ័ត្ន"
        },
        {
            "barcode": "171113010",
            "dpc": "03013142401",
            "name": "គង់ ទុំ"
        },
        {
            "barcode": "171113011",
            "dpc": "03013142501",
            "name": "ស៊ាង សឿន"
        },
        {
            "barcode": "171113012",
            "dpc": "03013142601",
            "name": "រិ ធាវី"
        },
        {
            "barcode": "171113013",
            "dpc": "03013142701",
            "name": "ហ៊ុយ សំផន"
        },
        {
            "barcode": "171113014",
            "dpc": "03013142801",
            "name": "ទុំ  ឈឿត"
        },
        {
            "barcode": "171113015",
            "dpc": "03013142901",
            "name": "វង្ស  ទូច"
        },
        {
            "barcode": "171113016",
            "dpc": "03013143001",
            "name": "មិត្ត  ឡៃហួយ"
        },
        {
            "barcode": "171113017",
            "dpc": "03013143101",
            "name": "មិត្ត សំណាង"
        },
        {
            "barcode": "171113018",
            "dpc": "03013143201",
            "name": "សុខ សាត់"
        },
        {
            "barcode": "171113019",
            "dpc": "03013143301",
            "name": "ណឹប តាវ"
        },
        {
            "barcode": "171113020",
            "dpc": "03013143601",
            "name": "សាម រិទ្ឋ"
        },
        {
            "barcode": "171113021",
            "dpc": "03013143701",
            "name": "ប៉ែន សយ"
        },
        {
            "barcode": "171113022",
            "dpc": "03013143801",
            "name": "នួន  វេន"
        },
        {
            "barcode": "171113023",
            "dpc": "03013143901",
            "name": "អ៊ុន សុវណ្ណ"
        },
        {
            "barcode": "171113024",
            "dpc": "03013144001",
            "name": "សាញ់ កាំង"
        },
        {
            "barcode": "171113025",
            "dpc": "03013144101",
            "name": "ស្រី ចិន្តា"
        },
        {
            "barcode": "171113026",
            "dpc": "03013144201",
            "name": "ម៉ម សុខា"
        },
        {
            "barcode": "171113027",
            "dpc": "03013144301",
            "name": "ភួង សុនិតា"
        },
        {
            "barcode": "171113028",
            "dpc": "03013144401",
            "name": "ទេព កុសល់"
        },
        {
            "barcode": "171113029",
            "dpc": "03013144501",
            "name": "ឯក  ស្រីមុំ"
        },
        {
            "barcode": "171113030",
            "dpc": "03013144601",
            "name": "យ៉ត សាវឿត១"
        },
        {
            "barcode": "171113031",
            "dpc": "03013144701",
            "name": "យ៉ត វុទ្ឋី"
        },
        {
            "barcode": "171113032",
            "dpc": "03013144901",
            "name": "នង ចាន់ថាល់"
        },
        {
            "barcode": "171113033",
            "dpc": "03013145001",
            "name": "យាំ ចាន់ត្រា"
        },
        {
            "barcode": "171113034",
            "dpc": "03013145101",
            "name": "ឡាំ ណើយ"
        },
        {
            "barcode": "171113035",
            "dpc": "03013145201",
            "name": "ទេស សារឿន"
        },
        {
            "barcode": "171113036",
            "dpc": "03013145301",
            "name": "វិន សុធាវី"
        },
        {
            "barcode": "171113037",
            "dpc": "03013145401",
            "name": "តន សុខា"
        },
        {
            "barcode": "171113038",
            "dpc": "03013145501",
            "name": "រឿន រើក"
        },
        {
            "barcode": "171113039",
            "dpc": "03013145601",
            "name": "វ៉ុង សារុន"
        },
        {
            "barcode": "171113040",
            "dpc": "03013145701",
            "name": "រឹម សារុំ"
        },
        {
            "barcode": "171113041",
            "dpc": "03013145801",
            "name": "ឆាំ  សារ៉ា"
        },
        {
            "barcode": "171113042",
            "dpc": "03013145901",
            "name": "វ៉ាន់ ង៉ែត"
        },
        {
            "barcode": "171113043",
            "dpc": "03013146001",
            "name": "សាន្ត សារ៉ា"
        },
        {
            "barcode": "171113044",
            "dpc": "03013146101",
            "name": "តុល គីម"
        },
        {
            "barcode": "171113045",
            "dpc": "03013146201",
            "name": "នង  រដ្ឋា"
        },
        {
            "barcode": "171113046",
            "dpc": "03013146301",
            "name": "ឈួយ  ទឺ"
        },
        {
            "barcode": "171113047",
            "dpc": "03013146401",
            "name": "មុក វាសនា"
        },
        {
            "barcode": "171113048",
            "dpc": "03013146501",
            "name": "សឿ សុភា"
        },
        {
            "barcode": "171113049",
            "dpc": "03013146601",
            "name": "សឿ  សុភ័ណ"
        },
        {
            "barcode": "171113050",
            "dpc": "03013146701",
            "name": "វ៉ាន  វ៉ុន"
        },
        {
            "barcode": "171113051",
            "dpc": "03013146801",
            "name": "ជួន សារឿម"
        },
        {
            "barcode": "171113052",
            "dpc": "03013146901",
            "name": "ទេព ជឿន"
        },
        {
            "barcode": "171113053",
            "dpc": "03013147001",
            "name": "ទុំ  ខ្លេត"
        },
        {
            "barcode": "171113054",
            "dpc": "03013147101",
            "name": "តូ ផានិត"
        },
        {
            "barcode": "171113055",
            "dpc": "03013147401",
            "name": "សាយ  ចំនាន"
        },
        {
            "barcode": "171113056",
            "dpc": "03013147501",
            "name": "មឿត សុគន្ធ"
        },
        {
            "barcode": "171113057",
            "dpc": "03013147601",
            "name": "ទេព  ចាន់ដារ៉ា"
        },
        {
            "barcode": "171113058",
            "dpc": "03013147701",
            "name": "អៀវ សារឿន"
        },
        {
            "barcode": "171113059",
            "dpc": "03013147801",
            "name": "លី សាឡែន"
        },
        {
            "barcode": "171113060",
            "dpc": "03013147901",
            "name": "ផេង សាវឹង"
        },
        {
            "barcode": "171113061",
            "dpc": "03013148001",
            "name": "សុខ សារ៉ាត់"
        }
    ];
    barcodes.forEach(function(bar){
        let customer=db.wb_customer.findOne({dpc:bar.dpc});
        db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
    });
