

let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=
    [
        {
            "barcode": "171114543",
            "dpc": "03013444901",
            "name": "យឿង សាវី"
        },
        {
            "barcode": "171114544",
            "dpc": "03013400101",
            "name": "ជា គឹមឆេង"
        },
        {
            "barcode": "171114545",
            "dpc": "03013400201",
            "name": "ជីយ សំណាង"
        },
        {
            "barcode": "171114546",
            "dpc": "03013400301",
            "name": "ជ័យ គឹមឈុន"
        },
        {
            "barcode": "171114547",
            "dpc": "03013400401",
            "name": "ញ៉ា គឹមលី"
        },
        {
            "barcode": "171114548",
            "dpc": "03013400501",
            "name": "ឌី សូភី"
        },
        {
            "barcode": "171114549",
            "dpc": "03013400601",
            "name": "ហ៊ឺម ចន្ទធី"
        },
        {
            "barcode": "171114550",
            "dpc": "03013400701",
            "name": "តៅ គឹមវែង"
        },
        {
            "barcode": "171114551",
            "dpc": "03013400801",
            "name": "ឈឹត ចន្ថា"
        },
        {
            "barcode": "171114552",
            "dpc": "03013400901",
            "name": "ឈឹត សៀវបេង"
        },
        {
            "barcode": "171114553",
            "dpc": "03013401001",
            "name": "ឈុត សុជា"
        },
        {
            "barcode": "171114554",
            "dpc": "03013401101",
            "name": "ជ រ៉ែន"
        },
        {
            "barcode": "171114555",
            "dpc": "03013401201",
            "name": "ឈុត សាឃូម"
        },
        {
            "barcode": "171114556",
            "dpc": "03013401301",
            "name": "សេក វាសនា"
        },
        {
            "barcode": "171114557",
            "dpc": "03013401401",
            "name": "សេក វីបុល"
        },
        {
            "barcode": "171114558",
            "dpc": "03013401501",
            "name": "ផូ សុវណ្ណរិទ្ធ"
        },
        {
            "barcode": "171114559",
            "dpc": "03013401601",
            "name": "ហូ នរ៉ា"
        },
        {
            "barcode": "171114560",
            "dpc": "03013401701",
            "name": "ជា ប៊ុននី"
        },
        {
            "barcode": "171114561",
            "dpc": "03013401801",
            "name": "កង សារៀប"
        },
        {
            "barcode": "171114562",
            "dpc": "03013401901",
            "name": "ជេត ម៉ារ៉ាឌី"
        },
        {
            "barcode": "171114563",
            "dpc": "03013402001",
            "name": "ឈឹត សំផុន"
        },
        {
            "barcode": "171114564",
            "dpc": "03013402101",
            "name": "ឈឿន សុវណ្ណរិទ្ធ"
        },
        {
            "barcode": "171114565",
            "dpc": "03013402201",
            "name": "ទៀង ពត"
        },
        {
            "barcode": "171114566",
            "dpc": "03013402301",
            "name": "ហេង សារឿត"
        },
        {
            "barcode": "171114567",
            "dpc": "03013402401",
            "name": "លាង វិច្ឆិកា"
        },
        {
            "barcode": "171114568",
            "dpc": "03013402501",
            "name": "ពុំ ប្រុស"
        },
        {
            "barcode": "171114569",
            "dpc": "03013402601",
            "name": "ពិន សារ៉ែត"
        },
        {
            "barcode": "171114570",
            "dpc": "03013402701",
            "name": "ពិន សំបូររាសី"
        },
        {
            "barcode": "171114571",
            "dpc": "03013402801",
            "name": "ជុំ មិថុនា"
        },
        {
            "barcode": "171114572",
            "dpc": "03013402901",
            "name": "ឡុង សត្យា"
        },
        {
            "barcode": "171114573",
            "dpc": "03013403001",
            "name": "សុង សុភ័ក្រ្ត"
        },
        {
            "barcode": "171114574",
            "dpc": "03013403101",
            "name": "មឹក ចន្ថា"
        },
        {
            "barcode": "171114575",
            "dpc": "03013403201",
            "name": "មឹក មករា"
        },
        {
            "barcode": "171114576",
            "dpc": "03013403301",
            "name": "យួន ចាន់យ៉ា"
        },
        {
            "barcode": "171114577",
            "dpc": "03013403401",
            "name": "ហេង សុភារី"
        },
        {
            "barcode": "171114578",
            "dpc": "03013403501",
            "name": "សៅ ម៉េង"
        },
        {
            "barcode": "171114579",
            "dpc": "03013403601",
            "name": "ធៀម ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171114580",
            "dpc": "03013403701",
            "name": "គី គឿម"
        },
        {
            "barcode": "171114581",
            "dpc": "03013403901",
            "name": "ប៉ុក ចាន់រស្មី"
        },
        {
            "barcode": "171114582",
            "dpc": "03013404101",
            "name": "គ្រុយ ចាន់រិទ្ធិ"
        },
        {
            "barcode": "171114583",
            "dpc": "03013404201",
            "name": "សៅ សុភាព"
        },
        {
            "barcode": "171114585",
            "dpc": "03013404401",
            "name": "ឈឿ វាសនា"
        },
        {
            "barcode": "171114586",
            "dpc": "03013404501",
            "name": "រួម ហេង"
        },
        {
            "barcode": "171114587",
            "dpc": "03013404601",
            "name": "កែវ វណ្ណា"
        },
        {
            "barcode": "171114588",
            "dpc": "03013404701",
            "name": "អង់ មុន្នីរត័្ន"
        },
        {
            "barcode": "171114589",
            "dpc": "03013404801",
            "name": "នង បូរណា"
        },
        {
            "barcode": "171114590",
            "dpc": "03013404901",
            "name": "នង ចន្ថា"
        },
        {
            "barcode": "171114591",
            "dpc": "03013405001",
            "name": "សេក បូរណ"
        },
        {
            "barcode": "171114592",
            "dpc": "03013405101",
            "name": "ជា អាង"
        },
        {
            "barcode": "171114593",
            "dpc": "03013405201",
            "name": "នង ចាន់នី"
        },
        {
            "barcode": "171114594",
            "dpc": "03013405301",
            "name": "ឆៃ វណ្ណរិទ្ធ"
        },
        {
            "barcode": "171114595",
            "dpc": "03013405401",
            "name": "ឆេង ប៉េងលន់"
        },
        {
            "barcode": "171114596",
            "dpc": "03013405501",
            "name": "នង សារ៉ាន"
        },
        {
            "barcode": "171114597",
            "dpc": "03013405601",
            "name": "អ៊ាម ណៃ"
        },
        {
            "barcode": "171114598",
            "dpc": "03013405701",
            "name": "ដេត អេងលី"
        },
        {
            "barcode": "171114599",
            "dpc": "03013405801",
            "name": "កឹម ឈួយ"
        },
        {
            "barcode": "171114600",
            "dpc": "03013405901",
            "name": "សិន ធី"
        },
        {
            "barcode": "171114601",
            "dpc": "03013406101",
            "name": "លុត ផល្លា"
        },
        {
            "barcode": "171114602",
            "dpc": "03013406201",
            "name": "ផូ មុំ"
        },
        {
            "barcode": "171114603",
            "dpc": "03013406301",
            "name": "ផូ វណ្ណ"
        },
        {
            "barcode": "171114604",
            "dpc": "03013406401",
            "name": "ឃី ឆេងសុកសាន្ត"
        },
        {
            "barcode": "171114606",
            "dpc": "03013406601",
            "name": "អុន លីវីណា"
        },
        {
            "barcode": "171114607",
            "dpc": "03013406701",
            "name": "វ៉ាត ហឹង"
        },
        {
            "barcode": "171114608",
            "dpc": "03013406801",
            "name": "វ៉ាត វ៉ាន់ថា"
        },
        {
            "barcode": "171114609",
            "dpc": "03013406901",
            "name": "ប៉ុក សុជាតិ"
        },
        {
            "barcode": "171114610",
            "dpc": "03013407001",
            "name": "ទឹម ហ៊ុច"
        },
        {
            "barcode": "171114611",
            "dpc": "03013407101",
            "name": "លឹម ហួត"
        },
        {
            "barcode": "171114612",
            "dpc": "03013407201",
            "name": "អាង គឹមឈាន"
        },
        {
            "barcode": "171114613",
            "dpc": "03013407301",
            "name": "ខឹម វឿត"
        },
        {
            "barcode": "171114614",
            "dpc": "03013407401",
            "name": "ផាវ សុផានី"
        },
        {
            "barcode": "171114615",
            "dpc": "03013407501",
            "name": "យី ស៊ុយ"
        },
        {
            "barcode": "171114616",
            "dpc": "03013407601",
            "name": "គឹម ហុង"
        },
        {
            "barcode": "171114617",
            "dpc": "03013407701",
            "name": "ស្រុន លាងវូច"
        },
        {
            "barcode": "171114618",
            "dpc": "03013407801",
            "name": "សេង រដ្ខា"
        },
        {
            "barcode": "171114619",
            "dpc": "03013407901",
            "name": "យុយ ប៉ា"
        },
        {
            "barcode": "171114620",
            "dpc": "03013408001",
            "name": "ទូច គុណណែ"
        },
        {
            "barcode": "171114621",
            "dpc": "03013408201",
            "name": "ណាំ សុវណ្ណរ៉ា"
        },
        {
            "barcode": "171114622",
            "dpc": "03013408301",
            "name": "ជាម ជម្ពរត័្ន"
        },
        {
            "barcode": "171114623",
            "dpc": "03013408401",
            "name": "បេង ស៊ុយ"
        },
        {
            "barcode": "171114624",
            "dpc": "03013408501",
            "name": "ហ៊ិន សឿម"
        },
        {
            "barcode": "171114625",
            "dpc": "03013408601",
            "name": "ឆ្លាម សម្បត្តិ"
        },
        {
            "barcode": "171114626",
            "dpc": "03013408701",
            "name": "យាន ឡងឌី"
        },
        {
            "barcode": "171114627",
            "dpc": "03013408801",
            "name": "ឈុំ វ័ន"
        },
        {
            "barcode": "171114628",
            "dpc": "03013408901",
            "name": "យិន ជួយ"
        },
        {
            "barcode": "171114629",
            "dpc": "03013409101",
            "name": "រៀន សម្បត្តិ"
        },
        {
            "barcode": "171114630",
            "dpc": "03013409201",
            "name": "រិត សុឃិន"
        },
        {
            "barcode": "171114631",
            "dpc": "03013409301",
            "name": "ខៀវ ហួន"
        },
        {
            "barcode": "171114633",
            "dpc": "03013409601",
            "name": "រិត សុខាន់"
        },
        {
            "barcode": "171114634",
            "dpc": "03013409701",
            "name": "អ៊ិត សំណាង"
        },
        {
            "barcode": "171114635",
            "dpc": "03013409801",
            "name": "ចៅ សៅ"
        },
        {
            "barcode": "171114636",
            "dpc": "03013409901",
            "name": "ចៀម រត័្ន"
        },
        {
            "barcode": "171114637",
            "dpc": "03013410001",
            "name": "មិល សាវិន"
        },
        {
            "barcode": "171114638",
            "dpc": "03013410101",
            "name": "អ៊ឹម សារូន"
        },
        {
            "barcode": "171114639",
            "dpc": "03013410201",
            "name": "សាមី សាវែង"
        },
        {
            "barcode": "171114640",
            "dpc": "03013410301",
            "name": "ចៅ ជៀវ"
        },
        {
            "barcode": "171114641",
            "dpc": "03013410401",
            "name": "សំ លីង"
        },
        {
            "barcode": "171114642",
            "dpc": "03013410501",
            "name": "ហុក ហេង"
        },
        {
            "barcode": "171114644",
            "dpc": "03013410701",
            "name": "នី សុខឃៀង"
        },
        {
            "barcode": "171114645",
            "dpc": "03013410801",
            "name": "គីម វណ្ណា"
        },
        {
            "barcode": "171114646",
            "dpc": "03013410901",
            "name": "យាំង សុវណ្ណារា"
        },
        {
            "barcode": "171114647",
            "dpc": "03013411001",
            "name": "ទ្រី វុត្ថា"
        },
        {
            "barcode": "171114648",
            "dpc": "03013411101",
            "name": "ទិព្វ សុហេង"
        },
        {
            "barcode": "171114649",
            "dpc": "03013411201",
            "name": "តូច កុសល់"
        },
        {
            "barcode": "171114650",
            "dpc": "03013411301",
            "name": "រី រ៉ាន"
        },
        {
            "barcode": "171114651",
            "dpc": "03013411401",
            "name": "លី សុវណ្ណ"
        },
        {
            "barcode": "171114652",
            "dpc": "03013411501",
            "name": "សំ យ៉េត"
        },
        {
            "barcode": "171114653",
            "dpc": "03013411601",
            "name": "ឃួន សារ៉ាន់"
        },
        {
            "barcode": "171114654",
            "dpc": "03013411701",
            "name": "សំ សុខុម"
        },
        {
            "barcode": "171114655",
            "dpc": "03013411801",
            "name": "ញៀវ ប៊ូរ"
        },
        {
            "barcode": "171114656",
            "dpc": "03013411901",
            "name": "មាស សាអែម"
        },
        {
            "barcode": "171114657",
            "dpc": "03013412001",
            "name": "តូច សុខុម"
        },
        {
            "barcode": "171114658",
            "dpc": "03013412101",
            "name": "រ៉ម យឹង"
        },
        {
            "barcode": "171114659",
            "dpc": "03013412201",
            "name": "ធូន ពេជ្រ"
        },
        {
            "barcode": "171114660",
            "dpc": "03013412301",
            "name": "ហុង សេដ្ឋា"
        },
        {
            "barcode": "171114661",
            "dpc": "03013412401",
            "name": "សៀន វើន"
        },
        {
            "barcode": "171114662",
            "dpc": "03013412501",
            "name": "ជឹង ជីវន័្ត"
        },
        {
            "barcode": "171114663",
            "dpc": "03013412601",
            "name": "នីរត័្ន"
        },
        {
            "barcode": "171114664",
            "dpc": "03013412801",
            "name": "ហង់​ លឿត"
        },
        {
            "barcode": "171114665",
            "dpc": "03013413001",
            "name": "យោក ស្វាង"
        },
        {
            "barcode": "171114666",
            "dpc": "03013413201",
            "name": "យាំ ទូច"
        },
        {
            "barcode": "171114667",
            "dpc": "03013413301",
            "name": "ចៅ ទយ"
        },
        {
            "barcode": "171114668",
            "dpc": "03013413401",
            "name": "យាំ ខាន់"
        },
        {
            "barcode": "171114669",
            "dpc": "03013413501",
            "name": "លី តឹក"
        },
        {
            "barcode": "171114670",
            "dpc": "03013413701",
            "name": "យូម ធារ៉ា"
        },
        {
            "barcode": "171114671",
            "dpc": "03013413801",
            "name": "ប៊ុន លឹមអេង"
        },
        {
            "barcode": "171114672",
            "dpc": "03013413901",
            "name": "សុខ បាន"
        },
        {
            "barcode": "171114673",
            "dpc": "03013414001",
            "name": "ថា សំរិត"
        },
        {
            "barcode": "171114674",
            "dpc": "03013414101",
            "name": "ជូម ប៊ុនទៀង"
        },
        {
            "barcode": "171114675",
            "dpc": "03013414201",
            "name": "សាន្ត ពីសី"
        },
        {
            "barcode": "171114676",
            "dpc": "03013414301",
            "name": "ហឿង ហ្វូ"
        },
        {
            "barcode": "171114677",
            "dpc": "03013414401",
            "name": "នូម ចក់"
        },
        {
            "barcode": "171114678",
            "dpc": "03013414501",
            "name": "ម៊ុយ"
        },
        {
            "barcode": "171114679",
            "dpc": "03013414601",
            "name": "ហឿង ទី"
        },
        {
            "barcode": "171114680",
            "dpc": "03013414701",
            "name": "ហូម ខ្វែក"
        },
        {
            "barcode": "171114681",
            "dpc": "03013414801",
            "name": "យឹម ផងឌី"
        },
        {
            "barcode": "171114682",
            "dpc": "03013414901",
            "name": "ស៊ុន រតនា"
        },
        {
            "barcode": "171114683",
            "dpc": "03013415001",
            "name": "ប៉ន យើន"
        },
        {
            "barcode": "171114684",
            "dpc": "03013415101",
            "name": "អ៊ុច សាវង"
        },
        {
            "barcode": "171114685",
            "dpc": "03013415301",
            "name": "ញឹក ឃុន្នី"
        },
        {
            "barcode": "171114686",
            "dpc": "03013415401",
            "name": "ញឹក សំណាង"
        },
        {
            "barcode": "171114687",
            "dpc": "03013415501",
            "name": "ញឹក ពន្លឹ"
        },
        {
            "barcode": "171114688",
            "dpc": "03013415601",
            "name": "នុត ប្រណិត"
        },
        {
            "barcode": "171114689",
            "dpc": "03013415701",
            "name": "មឿន ស្រីលក្ខណ៌"
        },
        {
            "barcode": "171114690",
            "dpc": "03013415801",
            "name": "មាន ឡាយ"
        },
        {
            "barcode": "171114691",
            "dpc": "03013415901",
            "name": "សៀក ពិសិដ្ខ"
        },
        {
            "barcode": "171114692",
            "dpc": "03013416001",
            "name": "សង ប៊ុនលត"
        },
        {
            "barcode": "171114693",
            "dpc": "03013416101",
            "name": "ស្រី សុភក្រ័"
        },
        {
            "barcode": "171114694",
            "dpc": "03013416201",
            "name": "ម៉ិល បោះ"
        },
        {
            "barcode": "171114695",
            "dpc": "03013416301",
            "name": "ឆឿម ឈឿយ"
        },
        {
            "barcode": "171114696",
            "dpc": "03013416401",
            "name": "សិត រិត"
        },
        {
            "barcode": "171114697",
            "dpc": "03013416801",
            "name": "ខៀក វណ្ណស៊ី"
        },
        {
            "barcode": "171114698",
            "dpc": "03013416901",
            "name": "ស៊ុន រ៉ែម"
        },
        {
            "barcode": "171114699",
            "dpc": "03013417001",
            "name": "ជា សារ៉ាតឌី"
        },
        {
            "barcode": "171114700",
            "dpc": "03013417101",
            "name": "ផាត វុទ្ធី"
        },
        {
            "barcode": "171114701",
            "dpc": "03013417301",
            "name": "សូន ភេន"
        },
        {
            "barcode": "171114702",
            "dpc": "03013417401",
            "name": "អាត ប៊ុនរត័្ន"
        },
        {
            "barcode": "171114703",
            "dpc": "03013417501",
            "name": "ដូ ម៉េងអង់"
        },
        {
            "barcode": "171114704",
            "dpc": "03013417601",
            "name": "បាន ចន្ធី"
        },
        {
            "barcode": "171114705",
            "dpc": "03013417701",
            "name": "ម៉ម មាន"
        },
        {
            "barcode": "171114706",
            "dpc": "03013417801",
            "name": "ណាល់ ពៅ"
        },
        {
            "barcode": "171114707",
            "dpc": "03013418001",
            "name": "គឹម ថង"
        },
        {
            "barcode": "171114708",
            "dpc": "03013418101",
            "name": "ជា យឹន"
        },
        {
            "barcode": "171114709",
            "dpc": "03013418201",
            "name": "កែង រ៉ា"
        },
        {
            "barcode": "171114710",
            "dpc": "03013418301",
            "name": "សេង សាត"
        },
        {
            "barcode": "171114711",
            "dpc": "03013418401",
            "name": "អែម សៀ"
        },
        {
            "barcode": "171114712",
            "dpc": "03013418501",
            "name": "ចៅ ឈឿត"
        },
        {
            "barcode": "171114713",
            "dpc": "03013418601",
            "name": "សំ សុធា"
        },
        {
            "barcode": "171114714",
            "dpc": "03013418701",
            "name": "ឃឹម កន្យាណ"
        },
        {
            "barcode": "171114716",
            "dpc": "03013418901",
            "name": "ណម គង់"
        },
        {
            "barcode": "171114717",
            "dpc": "03013419001",
            "name": "សឹម កំណត់"
        },
        {
            "barcode": "171114719",
            "dpc": "03013419201",
            "name": "យូ ចន្ថា"
        },
        {
            "barcode": "171114720",
            "dpc": "03013419301",
            "name": "ហាច គឹមហុង"
        },
        {
            "barcode": "171114721",
            "dpc": "03013419401",
            "name": "ស្រី បេង"
        },
        {
            "barcode": "171114722",
            "dpc": "03013419501",
            "name": "ចៅ កាំចាន់"
        },
        {
            "barcode": "171114723",
            "dpc": "03013419701",
            "name": "ចៅ លី"
        },
        {
            "barcode": "171114724",
            "dpc": "03013419801",
            "name": "ឃួយ ស៊ីម"
        },
        {
            "barcode": "171114725",
            "dpc": "03013419901",
            "name": "វ័រ ហេង"
        },
        {
            "barcode": "171114726",
            "dpc": "03013420001",
            "name": "យ៉ាំ បូ"
        },
        {
            "barcode": "171114727",
            "dpc": "03013420101",
            "name": "ចុង ជួយ"
        },
        {
            "barcode": "171114728",
            "dpc": "03013420201",
            "name": "ឈឿង សំណាង"
        },
        {
            "barcode": "171114729",
            "dpc": "03013420301",
            "name": "អំ សំអុន"
        },
        {
            "barcode": "171114730",
            "dpc": "03013420401",
            "name": "ឡោ រង់"
        },
        {
            "barcode": "171114731",
            "dpc": "03013420501",
            "name": "ហោ លី"
        },
        {
            "barcode": "171114732",
            "dpc": "03013420601",
            "name": "ស សុវណ្ណ"
        },
        {
            "barcode": "171114733",
            "dpc": "03013420701",
            "name": "ហោ គឹមតុល"
        },
        {
            "barcode": "171114734",
            "dpc": "03013420801",
            "name": "ចាន់ គឹមអន"
        },
        {
            "barcode": "171114735",
            "dpc": "03013420901",
            "name": "អេង មួយលី"
        },
        {
            "barcode": "171114736",
            "dpc": "03013421001",
            "name": "យឹន វុតធី"
        },
        {
            "barcode": "171114737",
            "dpc": "03013421101",
            "name": "ថែ  ឡាន់"
        },
        {
            "barcode": "171114738",
            "dpc": "03013421201",
            "name": "ផាន  ជៀម"
        },
        {
            "barcode": "171114739",
            "dpc": "03013421301",
            "name": "កោ  សុថា"
        },
        {
            "barcode": "171114740",
            "dpc": "03013421501",
            "name": "ឡាយ  រត្ន័"
        },
        {
            "barcode": "171114741",
            "dpc": "03013421601",
            "name": "ផាន  ភឿន"
        },
        {
            "barcode": "171114742",
            "dpc": "03013421701",
            "name": "ឆាន  កឹង"
        },
        {
            "barcode": "171114744",
            "dpc": "03013422001",
            "name": "កេវ  រីជុំ"
        },
        {
            "barcode": "171114745",
            "dpc": "03013422101",
            "name": "ជែ  ជង់"
        },
        {
            "barcode": "171114746",
            "dpc": "03013422201",
            "name": "ប៉ោង  ម៉េង"
        },
        {
            "barcode": "171114747",
            "dpc": "03013422301",
            "name": "អនុវិទ្យាល័យ អូរដំបង ១"
        },
        {
            "barcode": "171114748",
            "dpc": "03013422401",
            "name": "ជិន  ចាន់រស្មី"
        },
        {
            "barcode": "171114749",
            "dpc": "03013422501",
            "name": "ចាន់  នូ"
        },
        {
            "barcode": "171114750",
            "dpc": "03013422601",
            "name": "យិង  កាង"
        },
        {
            "barcode": "171114751",
            "dpc": "03013422801",
            "name": "ចៅ  សាន់ហ្វាត"
        },
        {
            "barcode": "171114752",
            "dpc": "03013422901",
            "name": "ឡាច  វឌ្ឍនៈ"
        },
        {
            "barcode": "171114753",
            "dpc": "03013423001",
            "name": "ជា  ហេង"
        },
        {
            "barcode": "171114754",
            "dpc": "03013423101",
            "name": "ជិន សាម៊ុយ"
        },
        {
            "barcode": "171114755",
            "dpc": "03013423201",
            "name": "ថ្លាង  សាវឿត"
        },
        {
            "barcode": "171114756",
            "dpc": "03013423301",
            "name": "កឹម  ឡុង"
        },
        {
            "barcode": "171114757",
            "dpc": "03013423401",
            "name": "ឈុន  ហុង"
        },
        {
            "barcode": "171114758",
            "dpc": "03013423501",
            "name": "សឹង  គឹមលន់"
        },
        {
            "barcode": "171114759",
            "dpc": "03013423601",
            "name": "ហម  គឹមឈួយ"
        },
        {
            "barcode": "171114760",
            "dpc": "03013423701",
            "name": "ឡាច  តូច"
        },
        {
            "barcode": "171114761",
            "dpc": "03013423801",
            "name": "ស្វាយ  ចំរ៉ាត់"
        },
        {
            "barcode": "171114762",
            "dpc": "03013423901",
            "name": "ជុំ  សំបូរ"
        },
        {
            "barcode": "171114763",
            "dpc": "03013424001",
            "name": "ណៃ  ហេង"
        },
        {
            "barcode": "171114764",
            "dpc": "03013424101",
            "name": "វឿន  សុផុន"
        },
        {
            "barcode": "171114766",
            "dpc": "03013424401",
            "name": "សួន  ឈៀង"
        },
        {
            "barcode": "171114767",
            "dpc": "03013424501",
            "name": "ហុង  គង់"
        },
        {
            "barcode": "171114768",
            "dpc": "03013424601",
            "name": "ឡុច  ហួរលាង"
        },
        {
            "barcode": "171114769",
            "dpc": "03013424701",
            "name": "ព្រឿង  ពៅ"
        },
        {
            "barcode": "171114770",
            "dpc": "03013424801",
            "name": "មឿន  ពុយ ៣"
        },
        {
            "barcode": "171114771",
            "dpc": "03013424901",
            "name": "មឿន  ពុយ ២"
        },
        {
            "barcode": "171114772",
            "dpc": "03013425001",
            "name": "ហម  រដ្ឋា"
        },
        {
            "barcode": "171114773",
            "dpc": "03013425101",
            "name": "និន  រិន"
        },
        {
            "barcode": "171114774",
            "dpc": "03013425201",
            "name": "យិម  ប៊ុនឆប"
        },
        {
            "barcode": "171114775",
            "dpc": "03013425301",
            "name": "ម៉ាក  ចិន"
        },
        {
            "barcode": "171114776",
            "dpc": "03013425401",
            "name": "ហៀង  សាវ៉ន"
        },
        {
            "barcode": "171114777",
            "dpc": "03013425501",
            "name": "ចាន់  អាន"
        },
        {
            "barcode": "171114778",
            "dpc": "03013425601",
            "name": "ជុំ  ណារិទ្ធ"
        },
        {
            "barcode": "171114779",
            "dpc": "03013425701",
            "name": "ហាក  ចំរើន"
        },
        {
            "barcode": "171114780",
            "dpc": "03013425801",
            "name": "ឌុច  គន្ធា"
        },
        {
            "barcode": "171114781",
            "dpc": "03013426001",
            "name": "ឡុច  ស៊ុន"
        },
        {
            "barcode": "171114782",
            "dpc": "03013426101",
            "name": "មាស  សាវឿត"
        },
        {
            "barcode": "171114783",
            "dpc": "03013426201",
            "name": "សួន  ហឿង"
        },
        {
            "barcode": "171114784",
            "dpc": "03013426301",
            "name": "លី  អូន"
        },
        {
            "barcode": "171114785",
            "dpc": "03013426401",
            "name": "ឡៅ  ហុង"
        },
        {
            "barcode": "171114786",
            "dpc": "03013426501",
            "name": "ឈីវ គង់"
        },
        {
            "barcode": "171114787",
            "dpc": "03013426601",
            "name": "ស៊ុយ  សុវត្ថារ៉ា"
        },
        {
            "barcode": "171114788",
            "dpc": "03013426701",
            "name": "កុយ  ម៉េង"
        },
        {
            "barcode": "171114789",
            "dpc": "03013426801",
            "name": "វរ័  ដារ៉ា"
        },
        {
            "barcode": "171114790",
            "dpc": "03013426901",
            "name": "លឹម  ស៊ីណា"
        },
        {
            "barcode": "171114791",
            "dpc": "03013427001",
            "name": "ហេង   សេត្ថា"
        },
        {
            "barcode": "171114792",
            "dpc": "03013427101",
            "name": "ដុស  ម៉ៅ"
        },
        {
            "barcode": "171114793",
            "dpc": "03013427201",
            "name": "ដុស  ផល"
        },
        {
            "barcode": "171114794",
            "dpc": "03013427301",
            "name": "គឹម  សុវណ្ណ"
        },
        {
            "barcode": "171114795",
            "dpc": "03013427401",
            "name": "ឈី  គឹមឆៃ"
        },
        {
            "barcode": "171114802",
            "dpc": "03013428201",
            "name": "ឌី  តុលា"
        },
        {
            "barcode": "171114803",
            "dpc": "03013428301",
            "name": "សៅ  ពិសិដ្ឋ"
        },
        {
            "barcode": "171114805",
            "dpc": "03013428501",
            "name": "ដាំ  សុង"
        },
        {
            "barcode": "171114806",
            "dpc": "03013428601",
            "name": "តាំង  ប៊ុនហឿម"
        },
        {
            "barcode": "171114812",
            "dpc": "03013429201",
            "name": "កែវ  ភិរុណ"
        },
        {
            "barcode": "171114813",
            "dpc": "03013429301",
            "name": "ឈឿន  ភេង"
        },
        {
            "barcode": "171114814",
            "dpc": "03013429401",
            "name": "ឌី  ចិន្តា"
        },
        {
            "barcode": "171114816",
            "dpc": "03013429601",
            "name": "អូច  ចាន់លី"
        },
        {
            "barcode": "171114817",
            "dpc": "03013429701",
            "name": "ផល  សុធា"
        },
        {
            "barcode": "171114818",
            "dpc": "03013429801",
            "name": "ប្រាក់  កូណាល់"
        },
        {
            "barcode": "171114819",
            "dpc": "03013429901",
            "name": "ជូន  លឿត"
        },
        {
            "barcode": "171114820",
            "dpc": "03013430001",
            "name": "ដុស  ពេញ"
        },
        {
            "barcode": "171114821",
            "dpc": "03013430101",
            "name": "ហាក់  ឡឹង"
        },
        {
            "barcode": "171114822",
            "dpc": "03013430201",
            "name": "អូច  ភី"
        },
        {
            "barcode": "171114823",
            "dpc": "03013430301",
            "name": "ស៊ឹម  ប៊ុនវី"
        },
        {
            "barcode": "171114824",
            "dpc": "03013430401",
            "name": "ញឹក  ផល្លា"
        },
        {
            "barcode": "171114825",
            "dpc": "03013430501",
            "name": "ហឹម  សុភាព"
        },
        {
            "barcode": "171114826",
            "dpc": "03013430601",
            "name": "សេង  ហ៊ត"
        },
        {
            "barcode": "171114827",
            "dpc": "03013430701",
            "name": "ហ៊ាន  ម៉ុនសុវណ្ណ"
        },
        {
            "barcode": "171114828",
            "dpc": "03013430801",
            "name": "យឿត  ប៊ុនយីម"
        },
        {
            "barcode": "171114829",
            "dpc": "03013430901",
            "name": "ធឿម  ធឿន"
        },
        {
            "barcode": "171114830",
            "dpc": "03013431001",
            "name": "ចាន់  ឌីភិរម្យ"
        },
        {
            "barcode": "171114831",
            "dpc": "03013431101",
            "name": "ខុង  សុវណ្ណ"
        },
        {
            "barcode": "171114832",
            "dpc": "03013431401",
            "name": "ស៊ុម  សាន្ត"
        },
        {
            "barcode": "171114833",
            "dpc": "03013431501",
            "name": "តោ   ចន្ធូ"
        },
        {
            "barcode": "171114834",
            "dpc": "03013431601",
            "name": "ម៉ៅ  វិជិត"
        },
        {
            "barcode": "171114835",
            "dpc": "03013431701",
            "name": "ហែម  សុជាតិ"
        },
        {
            "barcode": "171114836",
            "dpc": "03013431901",
            "name": "េព្រឿង  ឃាន"
        },
        {
            "barcode": "171114837",
            "dpc": "03013432001",
            "name": "ជាង  លី"
        },
        {
            "barcode": "171114838",
            "dpc": "03013432101",
            "name": "ជា  វណ្ណា"
        },
        {
            "barcode": "171114839",
            "dpc": "03013432301",
            "name": "មិន  ណូយ"
        },
        {
            "barcode": "171114840",
            "dpc": "03013432401",
            "name": "ឈុត  សំណាង"
        },
        {
            "barcode": "171114841",
            "dpc": "03013432501",
            "name": "ហ៊ុល  គឹមហៀង"
        },
        {
            "barcode": "171114842",
            "dpc": "03013432601",
            "name": "ម៉ុក  យឿម"
        },
        {
            "barcode": "171114843",
            "dpc": "03013432901",
            "name": "ព្រំ  ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171114844",
            "dpc": "03013433001",
            "name": "ឃី  សុភាព"
        },
        {
            "barcode": "171114845",
            "dpc": "03013433101",
            "name": "យូ  មេត្តា"
        },
        {
            "barcode": "171114846",
            "dpc": "03013433201",
            "name": "ព្រំ  មាសគ្រឹះស្នា"
        },
        {
            "barcode": "171114847",
            "dpc": "03013433501",
            "name": "ឈុត  យ៉ាន"
        },
        {
            "barcode": "171114848",
            "dpc": "03013433801",
            "name": "ម៉ៅ  ណារិន"
        },
        {
            "barcode": "171114849",
            "dpc": "03013434001",
            "name": "កើត  ប៊ុនុឈើន"
        },
        {
            "barcode": "171114850",
            "dpc": "03013434201",
            "name": "ជូប  ប៊ុនទៀង"
        },
        {
            "barcode": "171114851",
            "dpc": "03013434301",
            "name": "សោម  ហ៊ុន"
        },
        {
            "barcode": "171114852",
            "dpc": "03013434401",
            "name": "ប៉ូ  អូន"
        },
        {
            "barcode": "171114853",
            "dpc": "03013434501",
            "name": "ប៉ូ  សឿត"
        },
        {
            "barcode": "171114854",
            "dpc": "03013434601",
            "name": "ពុំ  នឹម"
        },
        {
            "barcode": "171114855",
            "dpc": "03013434701",
            "name": "គង់  សុខ"
        },
        {
            "barcode": "171114857",
            "dpc": "03013434901",
            "name": "កើត  សារិន"
        },
        {
            "barcode": "171114858",
            "dpc": "03013435001",
            "name": "ញឹក  ស៊ត"
        },
        {
            "barcode": "171114859",
            "dpc": "03013435201",
            "name": "សឿង  ទី"
        },
        {
            "barcode": "171114860",
            "dpc": "03013435301",
            "name": "ឡាំ  មឿន"
        },
        {
            "barcode": "171114861",
            "dpc": "03013435401",
            "name": "យាយ អូស្ត្រាលី"
        },
        {
            "barcode": "171114862",
            "dpc": "03013435501",
            "name": "ថាច់  ចិន្តា"
        },
        {
            "barcode": "171114863",
            "dpc": "03013435601",
            "name": "ហ៊ឹម  សុខុម"
        },
        {
            "barcode": "171114864",
            "dpc": "03013435701",
            "name": "យឹន  ឃុន"
        },
        {
            "barcode": "171114865",
            "dpc": "03013435801",
            "name": "យឹន ចាន់ណា"
        },
        {
            "barcode": "171114866",
            "dpc": "03013435901",
            "name": "ឆែម  ប៊ុនឈឹន"
        },
        {
            "barcode": "171114867",
            "dpc": "03013436001",
            "name": "ទ្រី  គឹមសួន"
        },
        {
            "barcode": "171114868",
            "dpc": "03013436101",
            "name": "ឡោះ  សាវុធ"
        },
        {
            "barcode": "171114869",
            "dpc": "03013436301",
            "name": "ឡុញ  ឌឿន"
        },
        {
            "barcode": "171114870",
            "dpc": "03013436501",
            "name": "សី  ស៊ី"
        },
        {
            "barcode": "171114871",
            "dpc": "03013436601",
            "name": "ហឹម  ប៊ុនហឿន"
        },
        {
            "barcode": "171114872",
            "dpc": "03013436701",
            "name": "ប៊ុត  ស៊ីណា"
        },
        {
            "barcode": "171114873",
            "dpc": "03013436801",
            "name": "គឹម  ប៊ុនឈៀប ២"
        },
        {
            "barcode": "171114874",
            "dpc": "03013436901",
            "name": "ញ៉ែម  សំអឿន"
        },
        {
            "barcode": "171114875",
            "dpc": "03013437001",
            "name": "សេង  សុវណ្ណ"
        },
        {
            "barcode": "171114876",
            "dpc": "03013437101",
            "name": "ឡេង  បូរ៉ា"
        },
        {
            "barcode": "171114877",
            "dpc": "03013437201",
            "name": "ឡោ  ស៊ីនួន"
        },
        {
            "barcode": "171114878",
            "dpc": "03013437301",
            "name": "គង់  ឈួន"
        },
        {
            "barcode": "171114879",
            "dpc": "03013437401",
            "name": "សៀវ  រឿប"
        },
        {
            "barcode": "171114880",
            "dpc": "03013437501",
            "name": "សៅ  ស៊ីណា"
        },
        {
            "barcode": "171114881",
            "dpc": "03013437701",
            "name": "ហ៊ីន  រ៉ែម"
        },
        {
            "barcode": "171114882",
            "dpc": "03013437801",
            "name": "ឡោ  ណាល់"
        },
        {
            "barcode": "171114883",
            "dpc": "03013437901",
            "name": "សែន  ចំរើន"
        },
        {
            "barcode": "171114884",
            "dpc": "03013438001",
            "name": "សឹម  លី"
        },
        {
            "barcode": "171114885",
            "dpc": "03013438101",
            "name": "អេង  សុគន្ធា"
        },
        {
            "barcode": "171114886",
            "dpc": "03013438301",
            "name": "លឿង  បូ"
        },
        {
            "barcode": "171114887",
            "dpc": "03013438401",
            "name": "ផល  សេងហ៊ួន"
        },
        {
            "barcode": "171114888",
            "dpc": "03013438501",
            "name": "ជុំំ  ណារិន"
        },
        {
            "barcode": "171114889",
            "dpc": "03013438601",
            "name": "ហ៊ឹម  យ៉ាន់"
        },
        {
            "barcode": "171114890",
            "dpc": "03013438701",
            "name": "ប៉ៅ  សបិន"
        },
        {
            "barcode": "171114891",
            "dpc": "03013438901",
            "name": "សេន  សុធី"
        },
        {
            "barcode": "171114892",
            "dpc": "03013439001",
            "name": "ហួត  ប៊ុនធឿន"
        },
        {
            "barcode": "171114893",
            "dpc": "03013439101",
            "name": "យឹប   គង់"
        },
        {
            "barcode": "171114894",
            "dpc": "03013439201",
            "name": "មឿត  ស្រីមុំ"
        },
        {
            "barcode": "171114895",
            "dpc": "03013439301",
            "name": "ស  សារ៉ុន"
        },
        {
            "barcode": "171114896",
            "dpc": "03013439401",
            "name": "ម៉ៅ  មឿត"
        },
        {
            "barcode": "171114897",
            "dpc": "03013439501",
            "name": "តិ  ហុង"
        },
        {
            "barcode": "171114898",
            "dpc": "03013439601",
            "name": "តិ  ហ៊ុយ"
        },
        {
            "barcode": "171114899",
            "dpc": "03013439701",
            "name": "អ៊ុំ  មៀន"
        },
        {
            "barcode": "171114900",
            "dpc": "03013439801",
            "name": "សារុំ  ចាន់ថា"
        },
        {
            "barcode": "171114901",
            "dpc": "03013439901",
            "name": "នួម  ណារី"
        },
        {
            "barcode": "171114902",
            "dpc": "03013440001",
            "name": "តូច  ជុំ"
        },
        {
            "barcode": "171114903",
            "dpc": "03013440101",
            "name": "ម៉ៅ  វណ្ណនី"
        },
        {
            "barcode": "171114904",
            "dpc": "03013440201",
            "name": "ញ៉ែម  ជាបឡេង"
        },
        {
            "barcode": "171114905",
            "dpc": "03013440301",
            "name": "ឈន   វណ្ណឌី"
        },
        {
            "barcode": "171114906",
            "dpc": "03013440401",
            "name": "ហូរ  ឈុន"
        },
        {
            "barcode": "171114907",
            "dpc": "03013440501",
            "name": "លី  រដ្ឋា"
        },
        {
            "barcode": "171114908",
            "dpc": "03013440601",
            "name": "យ៉ាត  ជឿត"
        },
        {
            "barcode": "171114909",
            "dpc": "03013440701",
            "name": "គង់  ស៊ីយ៉ូន"
        },
        {
            "barcode": "171114910",
            "dpc": "03013440801",
            "name": "វ៉ាន  ប៊ុនឆៃ"
        },
        {
            "barcode": "171114911",
            "dpc": "03013440901",
            "name": "ផាត  ភារៈ"
        },
        {
            "barcode": "171114912",
            "dpc": "03013441001",
            "name": "ផាត  សាន្តប៉ា"
        },
        {
            "barcode": "171114913",
            "dpc": "03013441101",
            "name": "សាន់  ចិត្ត"
        },
        {
            "barcode": "171114914",
            "dpc": "03013441201",
            "name": "គង់  សុគន្ធី"
        },
        {
            "barcode": "171114915",
            "dpc": "03013441301",
            "name": "ចាប  ជេតនា"
        },
        {
            "barcode": "171114916",
            "dpc": "03013441401",
            "name": "គង់  សំណាង"
        },
        {
            "barcode": "171114917",
            "dpc": "03013441501",
            "name": "សុខ  អេង"
        },
        {
            "barcode": "171114918",
            "dpc": "03013441601",
            "name": "ឆាយ  កុសល"
        },
        {
            "barcode": "171114919",
            "dpc": "03013441701",
            "name": "ចែ  សៀកគីម"
        },
        {
            "barcode": "171114920",
            "dpc": "03013441801",
            "name": "ហេង  ហម"
        },
        {
            "barcode": "171114921",
            "dpc": "03013441901",
            "name": "ឡុច  វន"
        },
        {
            "barcode": "171114922",
            "dpc": "03013442001",
            "name": "វឿត  សម្ផស្ស"
        },
        {
            "barcode": "171114923",
            "dpc": "03013442101",
            "name": "មាស  សំអឿន"
        },
        {
            "barcode": "171114924",
            "dpc": "03013442201",
            "name": "ហ៊ុន  ធើន"
        },
        {
            "barcode": "171114925",
            "dpc": "03013442301",
            "name": "មាស  ប៊ុនធឿន"
        },
        {
            "barcode": "171114926",
            "dpc": "03013442401",
            "name": "សើ  ប៊ុននឿន"
        },
        {
            "barcode": "171114927",
            "dpc": "03013442501",
            "name": "ព្រហ្ម  ស៊ីណាត"
        },
        {
            "barcode": "171114928",
            "dpc": "03013442601",
            "name": "ផា  សូវ"
        },
        {
            "barcode": "171114929",
            "dpc": "03013442701",
            "name": "រស់  សារ៉ុន"
        },
        {
            "barcode": "171114930",
            "dpc": "03013442801",
            "name": "តាន់  ហុងលឹម"
        },
        {
            "barcode": "171114931",
            "dpc": "03013442901",
            "name": "លឹម  ហឿម"
        },
        {
            "barcode": "171114932",
            "dpc": "03013443001",
            "name": "កេត  សារិទ្ធ"
        },
        {
            "barcode": "171114933",
            "dpc": "03013443201",
            "name": "រ៉ាយ ភីរម្យ"
        },
        {
            "barcode": "171114934",
            "dpc": "03013443301",
            "name": "ម៉ា  ទីនេ"
        },
        {
            "barcode": "171114935",
            "dpc": "03013443401",
            "name": "រឿន   ប៊ុនរ៉ាត់"
        },
        {
            "barcode": "171114936",
            "dpc": "03013443501",
            "name": "ប៊ូ  ថា"
        },
        {
            "barcode": "171114937",
            "dpc": "03013443601",
            "name": "ឈ  សាវ៉ុន"
        },
        {
            "barcode": "171114938",
            "dpc": "03013443701",
            "name": "លឹម ចាន់ដារ៉ា"
        },
        {
            "barcode": "171114939",
            "dpc": "03013443801",
            "name": "គឹម  វ៉ានថា"
        },
        {
            "barcode": "171114940",
            "dpc": "03013443901",
            "name": "ថុន  បាន"
        },
        {
            "barcode": "171114941",
            "dpc": "03013444101",
            "name": "វ៉ាន  តារ៉ា"
        },
        {
            "barcode": "171114942",
            "dpc": "03013444201",
            "name": "ផាន  សំណាង"
        },
        {
            "barcode": "171114943",
            "dpc": "03013444301",
            "name": "ផាន  រ៉ា"
        },
        {
            "barcode": "171114944",
            "dpc": "03013444501",
            "name": "ជៀម  សេង"
        },
        {
            "barcode": "171114945",
            "dpc": "03013444601",
            "name": "តូយ  ស្រីមុំ"
        },
        {
            "barcode": "171114946",
            "dpc": "03013444701",
            "name": "ណាត  ចិន្តា"
        },
        {
            "barcode": "171114947",
            "dpc": "03013444801",
            "name": "ថើន  ដួងចន្ទ័"
        },
        {
            "barcode": "171114948",
            "dpc": "03013445001",
            "name": "ម៉ាប់  កេត"
        },
        {
            "barcode": "171114950",
            "dpc": "03013445201",
            "name": "ម៉ក ប៊ុនទិត្យ"
        },
        {
            "barcode": "171114951",
            "dpc": "03013445301",
            "name": "ទេន  ប៊ុនហឹង"
        },
        {
            "barcode": "171114953",
            "dpc": "03013445501",
            "name": "លាស់  ហាង"
        },
        {
            "barcode": "171114954",
            "dpc": "03013445601",
            "name": "ជា  ម៉េង"
        },
        {
            "barcode": "171114956",
            "dpc": "03013445801",
            "name": "លី  ខ្លឿន"
        },
        {
            "barcode": "171114957",
            "dpc": "03013445901",
            "name": "តឹក  សាវង្ស"
        },
        {
            "barcode": "171114958",
            "dpc": "03013446201",
            "name": "ហូរ   ផានី"
        },
        {
            "barcode": "171114959",
            "dpc": "03013446401",
            "name": "ខួញ  សាម៉េត"
        },
        {
            "barcode": "171114960",
            "dpc": "03013446501",
            "name": "ញ៉ែម  សំណាង"
        },
        {
            "barcode": "171114961",
            "dpc": "03013446601",
            "name": "ប៊ុត  សុធី"
        },
        {
            "barcode": "171114962",
            "dpc": "03013446701",
            "name": "ហាយ  សំណាង"
        },
        {
            "barcode": "171114963",
            "dpc": "03013446801",
            "name": "ណន  ម៉ៅ"
        },
        {
            "barcode": "171114964",
            "dpc": "03013446901",
            "name": "តឿ  សាវុន"
        },
        {
            "barcode": "171114965",
            "dpc": "03013447001",
            "name": "ភោ ស៊ីថា"
        },
        {
            "barcode": "171114966",
            "dpc": "03013447101",
            "name": "ភោ សម្បត្តិ"
        },
        {
            "barcode": "171114967",
            "dpc": "03013447201",
            "name": "នី អេង"
        },
        {
            "barcode": "171114968",
            "dpc": "03013447301",
            "name": "មឿន  ម៉ារ័ត្ន"
        },
        {
            "barcode": "171114970",
            "dpc": "03013447501",
            "name": "រឿន ទឿម"
        },
        {
            "barcode": "171114972",
            "dpc": "03013447701",
            "name": "ខិល លឿ"
        },
        {
            "barcode": "171114973",
            "dpc": "03013447801",
            "name": "មឿន សិត"
        },
        {
            "barcode": "171114974",
            "dpc": "03013447901",
            "name": "វ៉ាត សុហេង"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});