

let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=
    [
        {
            "barcode": "171114976",
            "dpc": "03023500101",
            "name": "រិន ណូក"
        },
        {
            "barcode": "171114977",
            "dpc": "03023500201",
            "name": "យូ ថៃ"
        },
        {
            "barcode": "171114978",
            "dpc": "03023500301",
            "name": "អ៊ុក រ៉ាន់"
        },
        {
            "barcode": "171114979",
            "dpc": "03023500401",
            "name": "ន៉ូ ចាន់ណារី"
        },
        {
            "barcode": "171114980",
            "dpc": "03023500601",
            "name": "ហេង គឹមសួ"
        },
        {
            "barcode": "171114981",
            "dpc": "03023500701",
            "name": "ហុក គីម"
        },
        {
            "barcode": "171114982",
            "dpc": "03023500801",
            "name": "ហ៊ួន ឃុត"
        },
        {
            "barcode": "171114983",
            "dpc": "03023500901",
            "name": "ទ្រី ភក្តី"
        },
        {
            "barcode": "171114984",
            "dpc": "03023501001",
            "name": "សៀង មុំ"
        },
        {
            "barcode": "171114985",
            "dpc": "03023501101",
            "name": "សែម សំអាត"
        },
        {
            "barcode": "171114986",
            "dpc": "03023501201",
            "name": "សយ សម្ជស្ស"
        },
        {
            "barcode": "171114987",
            "dpc": "03023501301",
            "name": "ម៉ៅ សាម៉ុយ"
        },
        {
            "barcode": "171114988",
            "dpc": "03023501401",
            "name": "ម៉ៅ វិចិត្រ"
        },
        {
            "barcode": "171114989",
            "dpc": "03023501501",
            "name": "លី រ៉ាសាត"
        },
        {
            "barcode": "171114990",
            "dpc": "03023501701",
            "name": "ឆាយ ផាត"
        },
        {
            "barcode": "171114991",
            "dpc": "03023501801",
            "name": "ឃឿន សំ"
        },
        {
            "barcode": "171114992",
            "dpc": "03023501901",
            "name": "អ៊ួច ឪរ៉ាល់"
        },
        {
            "barcode": "171114993",
            "dpc": "03023502001",
            "name": "គង់ ប៊ុនលី"
        },
        {
            "barcode": "171114994",
            "dpc": "03023502101",
            "name": "ហេង ឡុង"
        },
        {
            "barcode": "171114995",
            "dpc": "03023502201",
            "name": "សាត សុខា"
        },
        {
            "barcode": "171114996",
            "dpc": "03023502301",
            "name": "ផុន សំ"
        },
        {
            "barcode": "171114997",
            "dpc": "03023502401",
            "name": "ញ៉ឹក សាគុណ"
        },
        {
            "barcode": "171114998",
            "dpc": "03023502601",
            "name": "ពេជ្រ ចាន់ដារ៉ា"
        },
        {
            "barcode": "171114999",
            "dpc": "03023502701",
            "name": "ឯក កុសល់"
        },
        {
            "barcode": "171115000",
            "dpc": "03023502801",
            "name": "កែវ សុខសាន្ត"
        },
        {
            "barcode": "171115001",
            "dpc": "03023502901",
            "name": "ដាំ សារុន"
        },
        {
            "barcode": "171115002",
            "dpc": "03023503001",
            "name": "នង មាសរិទ្ធិ"
        },
        {
            "barcode": "171115003",
            "dpc": "03023503101",
            "name": "ឈិត ឆោម"
        },
        {
            "barcode": "171115004",
            "dpc": "03023503201",
            "name": "ណន នី"
        },
        {
            "barcode": "171115005",
            "dpc": "03023503301",
            "name": "កុក ហាន"
        },
        {
            "barcode": "171115006",
            "dpc": "03023503401",
            "name": "យ៉ូ អាលីស្សា"
        },
        {
            "barcode": "171115007",
            "dpc": "03023503601",
            "name": "ដិប គឹមនី"
        },
        {
            "barcode": "171115008",
            "dpc": "03023503701",
            "name": "ទៀប វិរ:"
        },
        {
            "barcode": "171115009",
            "dpc": "03023503801",
            "name": "វង្ស ចំរើន"
        },
        {
            "barcode": "171115010",
            "dpc": "03023503901",
            "name": "ចាន់ វិច្ចិកា"
        },
        {
            "barcode": "171115011",
            "dpc": "03023504001",
            "name": "វ៉ាន់ ហម"
        },
        {
            "barcode": "171115012",
            "dpc": "03023504101",
            "name": "គី យូឡុង"
        },
        {
            "barcode": "171115013",
            "dpc": "03023504201",
            "name": "ព្រហ្ម សេរីបុត្រ"
        },
        {
            "barcode": "171115014",
            "dpc": "03023504301",
            "name": "សោម ពិសិដ្ធ"
        },
        {
            "barcode": "171115015",
            "dpc": "03023504401",
            "name": "ទេស ឈមុសាម៉ុន"
        },
        {
            "barcode": "171115016",
            "dpc": "03023504501",
            "name": "ជ័យ សារី"
        },
        {
            "barcode": "171115017",
            "dpc": "03023504601",
            "name": "សួន សានិត"
        },
        {
            "barcode": "171115018",
            "dpc": "03023504701",
            "name": "ម៉ុម សឿន"
        },
        {
            "barcode": "171115019",
            "dpc": "03023504801",
            "name": "ស៊ុន គង់"
        },
        {
            "barcode": "171115020",
            "dpc": "03023504901",
            "name": "ស្តង់ លេខ៧១"
        },
        {
            "barcode": "171115021",
            "dpc": "03023505001",
            "name": "ប៉ាល ស្រីលក្ខ"
        },
        {
            "barcode": "171115022",
            "dpc": "03023505101",
            "name": "សឿត តឿ"
        },
        {
            "barcode": "171115023",
            "dpc": "03023505201",
            "name": "​ប្រាក់ សុទ្ទដារ៉ា"
        },
        {
            "barcode": "171115024",
            "dpc": "03023505301",
            "name": "វ៉ាន់ រត្ន័"
        },
        {
            "barcode": "171115025",
            "dpc": "03023505601",
            "name": "យ៉ាត ពៅ"
        },
        {
            "barcode": "171115026",
            "dpc": "03023505701",
            "name": "ពោធិ មានរិទ្ធ"
        },
        {
            "barcode": "171115027",
            "dpc": "03023505801",
            "name": "តុន សុគុណ"
        },
        {
            "barcode": "171115028",
            "dpc": "03023505901",
            "name": "ប្រាក់ ណាវី"
        },
        {
            "barcode": "171115029",
            "dpc": "03023506001",
            "name": "ឡង អឿន"
        },
        {
            "barcode": "171115030",
            "dpc": "03023506101",
            "name": "ប្រាក់ ឌារ៉ា"
        },
        {
            "barcode": "171115031",
            "dpc": "03023506201",
            "name": "សុខ សឿន"
        },
        {
            "barcode": "171115032",
            "dpc": "03023506301",
            "name": "ប៉ា យ៉ន"
        },
        {
            "barcode": "171115033",
            "dpc": "03023506501",
            "name": "សារ ភក្តី"
        },
        {
            "barcode": "171115034",
            "dpc": "03023506601",
            "name": "ហៀង ហ៊ុច"
        },
        {
            "barcode": "171115035",
            "dpc": "03023506701",
            "name": "ពេញ សុន"
        },
        {
            "barcode": "171115036",
            "dpc": "03023506801",
            "name": "ខោល ពៅ"
        },
        {
            "barcode": "171115037",
            "dpc": "03023506901",
            "name": "ខោល មីឌី"
        },
        {
            "barcode": "171115038",
            "dpc": "03023507001",
            "name": "គឹម ស្រ៊ុន"
        },
        {
            "barcode": "171115039",
            "dpc": "03023507101",
            "name": "ឃួន ចំរើន"
        },
        {
            "barcode": "171115040",
            "dpc": "03023507201",
            "name": "ចាន់ សួរ"
        },
        {
            "barcode": "171115041",
            "dpc": "03023507301",
            "name": "ញ៊ឹក សុខា"
        },
        {
            "barcode": "171115042",
            "dpc": "03023507401",
            "name": "ថុល ស៊ីថាត"
        },
        {
            "barcode": "171115043",
            "dpc": "03023507501",
            "name": "បូ ភី២"
        },
        {
            "barcode": "171115044",
            "dpc": "03023507601",
            "name": "ឈឹម ស៊ី"
        },
        {
            "barcode": "171115045",
            "dpc": "03023507701",
            "name": "បាន ឡង"
        },
        {
            "barcode": "171115046",
            "dpc": "03023507801",
            "name": "ណី ស្រីដា"
        },
        {
            "barcode": "171115047",
            "dpc": "03023507901",
            "name": "គីម សុខនី"
        },
        {
            "barcode": "171115048",
            "dpc": "03023508001",
            "name": "សុខ សាវ៉ាត"
        },
        {
            "barcode": "171115049",
            "dpc": "03023508201",
            "name": "សុះ សុខគី"
        },
        {
            "barcode": "171115050",
            "dpc": "03023508301",
            "name": "សេន រ៉ាវី"
        },
        {
            "barcode": "171115051",
            "dpc": "03023508401",
            "name": "ហង ម៉ាន់"
        },
        {
            "barcode": "171115052",
            "dpc": "03023508501",
            "name": "លឿន ម៉ាទីនី"
        },
        {
            "barcode": "171115053",
            "dpc": "03023508601",
            "name": "សំ អូន"
        },
        {
            "barcode": "171115054",
            "dpc": "03023508701",
            "name": "ជុំ ផល្លី"
        },
        {
            "barcode": "171115055",
            "dpc": "03023508801",
            "name": "សាវី ម៉ូហាំម៉ាត"
        },
        {
            "barcode": "171115056",
            "dpc": "03023508901",
            "name": "ហក់ សាហ្វី"
        },
        {
            "barcode": "171115057",
            "dpc": "03023509001",
            "name": "ឡោះ អ៊ីសើ"
        },
        {
            "barcode": "171115058",
            "dpc": "03023509101",
            "name": "ឯល សាហ្វី"
        },
        {
            "barcode": "171115059",
            "dpc": "03023509201",
            "name": "សារ៉ូ សាលី"
        },
        {
            "barcode": "171115060",
            "dpc": "03023509301",
            "name": "ម៉ាត់ លី"
        },
        {
            "barcode": "171115061",
            "dpc": "03023509401",
            "name": "ស៊ុប រីម"
        },
        {
            "barcode": "171115062",
            "dpc": "03023509501",
            "name": "រ៉េះ ជា"
        },
        {
            "barcode": "171115063",
            "dpc": "03023509601",
            "name": "ទូច អាស៊ីយ៉ាល់"
        },
        {
            "barcode": "171115064",
            "dpc": "03023509701",
            "name": "ហ៊ីម សាលី"
        },
        {
            "barcode": "171115065",
            "dpc": "03023509801",
            "name": "ស៊ុប ហ្វាត់"
        },
        {
            "barcode": "171115066",
            "dpc": "03023509901",
            "name": "គង់ សុវណ្ណ"
        },
        {
            "barcode": "171115067",
            "dpc": "03023510001",
            "name": "ទី ម៉ារីសា"
        },
        {
            "barcode": "171115068",
            "dpc": "03023510101",
            "name": "ម៉ាត់ អ៊ីសើ"
        },
        {
            "barcode": "171115069",
            "dpc": "03023510201",
            "name": "ឡេះ ម៉ាត់តែម"
        },
        {
            "barcode": "171115070",
            "dpc": "03023510301",
            "name": "ឡោ វណ្ណដា"
        },
        {
            "barcode": "171115071",
            "dpc": "03023510401",
            "name": "លី រ៉ូហ្សាល"
        },
        {
            "barcode": "171115072",
            "dpc": "03023510501",
            "name": "អ៊ឹង ធៀនប៉ាវ"
        },
        {
            "barcode": "171115073",
            "dpc": "03023510601",
            "name": "ឡឹប យើ"
        },
        {
            "barcode": "171115074",
            "dpc": "03023510701",
            "name": "យល់ វុទ្ធី"
        },
        {
            "barcode": "171115075",
            "dpc": "03023510901",
            "name": "សុទ្ធ វាសនា"
        },
        {
            "barcode": "171115076",
            "dpc": "03023511001",
            "name": "ធឿម គឹមលាង"
        },
        {
            "barcode": "171115077",
            "dpc": "03023511101",
            "name": "កឹម ផល្លា"
        },
        {
            "barcode": "171115078",
            "dpc": "03023511201",
            "name": "ធឿន ចាន់ថា"
        },
        {
            "barcode": "171115079",
            "dpc": "03023511301",
            "name": "កែវ សិទ្ធ"
        },
        {
            "barcode": "171115080",
            "dpc": "03023511401",
            "name": "ស៊ីន ស៊ីវន"
        },
        {
            "barcode": "171115081",
            "dpc": "03023511501",
            "name": "ស៊ុន ស្នា"
        },
        {
            "barcode": "171115082",
            "dpc": "03023511601",
            "name": "ស្មាន់ វីរ៉ូ"
        },
        {
            "barcode": "171115083",
            "dpc": "03023511701",
            "name": "ខ្លូត សារ៉ាត់"
        },
        {
            "barcode": "171115084",
            "dpc": "03023511801",
            "name": "ប៉ិល វិសារ"
        },
        {
            "barcode": "171115085",
            "dpc": "03023511901",
            "name": "សុខ ប៊ិន"
        },
        {
            "barcode": "171115086",
            "dpc": "03023512001",
            "name": "ម៉ោញ ណាល់"
        },
        {
            "barcode": "171115087",
            "dpc": "03023512101",
            "name": "លី ហេងណាំអេង"
        },
        {
            "barcode": "171115088",
            "dpc": "03023512201",
            "name": "តែល នុច"
        },
        {
            "barcode": "171115089",
            "dpc": "03023512301",
            "name": "ហម សុធី"
        },
        {
            "barcode": "171115090",
            "dpc": "03023512401",
            "name": "សាប់ សារេត"
        },
        {
            "barcode": "171115091",
            "dpc": "03023512501",
            "name": "លឿម ភេន"
        },
        {
            "barcode": "171115092",
            "dpc": "03023512601",
            "name": "យិប ភី"
        },
        {
            "barcode": "171115093",
            "dpc": "03023512701",
            "name": "ងួន ឃាន"
        },
        {
            "barcode": "171115094",
            "dpc": "03023512901",
            "name": "លឹម ធិចហ៊ុន"
        },
        {
            "barcode": "171115095",
            "dpc": "03023513101",
            "name": "ជួន សាវង្ស"
        },
        {
            "barcode": "171115096",
            "dpc": "03023513201",
            "name": "សួង រី"
        },
        {
            "barcode": "171115097",
            "dpc": "03023513301",
            "name": "អ៊ឹម ផល្លី"
        },
        {
            "barcode": "171115098",
            "dpc": "03023513401",
            "name": "មាន និច្ច"
        },
        {
            "barcode": "171115099",
            "dpc": "03023513701",
            "name": "ណូ សេន"
        },
        {
            "barcode": "171115100",
            "dpc": "03023513801",
            "name": "ឌុច ផន"
        },
        {
            "barcode": "171115101",
            "dpc": "03023513901",
            "name": "ប្រាក់ ផាន់នី"
        },
        {
            "barcode": "171115102",
            "dpc": "03023514001",
            "name": "កាន់ កង"
        },
        {
            "barcode": "171115103",
            "dpc": "03023514101",
            "name": "មុន មុំ"
        },
        {
            "barcode": "171115104",
            "dpc": "03023514201",
            "name": "អ៊ុន សុគុណ"
        },
        {
            "barcode": "171115105",
            "dpc": "03023514301",
            "name": "ហ៊ួន នៅ"
        },
        {
            "barcode": "171115106",
            "dpc": "03023514401",
            "name": "យ៉ន សារុន"
        },
        {
            "barcode": "171115107",
            "dpc": "03023514501",
            "name": "ឃុន ថាវ"
        },
        {
            "barcode": "171115108",
            "dpc": "03023514601",
            "name": "ផ្លោក សាវ៉ាង"
        },
        {
            "barcode": "171115109",
            "dpc": "03023514701",
            "name": "មុត វ៉ាន់"
        },
        {
            "barcode": "171115110",
            "dpc": "03023514801",
            "name": "វិន ដា"
        },
        {
            "barcode": "171115111",
            "dpc": "03023514901",
            "name": "ប្រាក់ សន"
        },
        {
            "barcode": "171115112",
            "dpc": "03023515001",
            "name": "កោះ ផៃ"
        },
        {
            "barcode": "171115113",
            "dpc": "03023515101",
            "name": "ជា​ ដារ៉ា"
        },
        {
            "barcode": "171115114",
            "dpc": "03023515301",
            "name": "យ៉ុន រឿត"
        },
        {
            "barcode": "171115115",
            "dpc": "03023515401",
            "name": "ជា ជឿន"
        },
        {
            "barcode": "171115116",
            "dpc": "03023515501",
            "name": "គង់ សុខ"
        },
        {
            "barcode": "171115117",
            "dpc": "03023515701",
            "name": "លី នានិត"
        },
        {
            "barcode": "171115118",
            "dpc": "03023515801",
            "name": "ស៊ី រីវណ្ណី"
        },
        {
            "barcode": "171115119",
            "dpc": "03023515901",
            "name": "ថោ វណ្ណ"
        },
        {
            "barcode": "171115120",
            "dpc": "03023516001",
            "name": "ស៊ុត សុវណ្ណ"
        },
        {
            "barcode": "171115121",
            "dpc": "03023516101",
            "name": "ស៊ុត គីមលីន"
        },
        {
            "barcode": "171115122",
            "dpc": "03023516201",
            "name": "លី ដាវី"
        },
        {
            "barcode": "171115123",
            "dpc": "03023516301",
            "name": "លី ដា"
        },
        {
            "barcode": "171115124",
            "dpc": "03023516401",
            "name": "ប៉ុល ង៉ូវ"
        },
        {
            "barcode": "171115125",
            "dpc": "03023516501",
            "name": "សែម ពន្លក"
        },
        {
            "barcode": "171115126",
            "dpc": "03023516601",
            "name": "ស៊ិន កីនី"
        },
        {
            "barcode": "171115127",
            "dpc": "03023516701",
            "name": "ប៉ីច ថងនី"
        },
        {
            "barcode": "171115128",
            "dpc": "03023516801",
            "name": "យឿប វីរះ"
        },
        {
            "barcode": "171115129",
            "dpc": "03023516901",
            "name": "ឡុង ស៊ីថា"
        },
        {
            "barcode": "171115130",
            "dpc": "03023517001",
            "name": "កុយ ណាឫទ្ធិ"
        },
        {
            "barcode": "171115131",
            "dpc": "03023517101",
            "name": "ម៉ូត សារីយ៉ា"
        },
        {
            "barcode": "171115132",
            "dpc": "03023517201",
            "name": "មឿន រ័នណា"
        },
        {
            "barcode": "171115133",
            "dpc": "03023517301",
            "name": "មឿន សុម៉ាត្រា"
        },
        {
            "barcode": "171115134",
            "dpc": "03023517401",
            "name": "ឯម សំអឿន"
        },
        {
            "barcode": "171115135",
            "dpc": "03023517501",
            "name": "សំ រ៉ាត់"
        },
        {
            "barcode": "171115136",
            "dpc": "03023517601",
            "name": "ឃឹម ចំរើន"
        },
        {
            "barcode": "171115137",
            "dpc": "03023517701",
            "name": "ចាន់ អេង"
        },
        {
            "barcode": "171115138",
            "dpc": "03023517801",
            "name": "មាស សារុន"
        },
        {
            "barcode": "171115139",
            "dpc": "03023517901",
            "name": "ងឿប ណាត"
        },
        {
            "barcode": "171115140",
            "dpc": "03023518001",
            "name": "សា សើរ"
        },
        {
            "barcode": "171115141",
            "dpc": "03023518101",
            "name": "លឹម​ ប៊ូឡា"
        },
        {
            "barcode": "171115142",
            "dpc": "03023518201",
            "name": "មល់ បុប្ជា"
        },
        {
            "barcode": "171115143",
            "dpc": "03023518301",
            "name": "ជា សិទ្ធិ១"
        },
        {
            "barcode": "171115144",
            "dpc": "03023518401",
            "name": "ជា ឆនណារិទ្ធ"
        },
        {
            "barcode": "171115145",
            "dpc": "03023518601",
            "name": "ជា ណារិន"
        },
        {
            "barcode": "171115146",
            "dpc": "03023518701",
            "name": "ឡុង សីលា"
        },
        {
            "barcode": "171115147",
            "dpc": "03023519001",
            "name": "ឈួ ហាក់គាង"
        },
        {
            "barcode": "171115148",
            "dpc": "03023519101",
            "name": "វណ្ណា ចំរើន"
        },
        {
            "barcode": "171115149",
            "dpc": "03023519201",
            "name": "នូ ធារឿន"
        },
        {
            "barcode": "171115150",
            "dpc": "03023519301",
            "name": "ទិត្យ សុផាន"
        },
        {
            "barcode": "171115151",
            "dpc": "03023519501",
            "name": "ប៉ាង ភីរម្យ"
        },
        {
            "barcode": "171115152",
            "dpc": "03023519701",
            "name": "ហ៊ិន សំរ៉ង"
        },
        {
            "barcode": "171115153",
            "dpc": "03023519801",
            "name": "ឯក ខាំ"
        },
        {
            "barcode": "171115154",
            "dpc": "03023520101",
            "name": "ផាន់ សុផុន"
        },
        {
            "barcode": "171115155",
            "dpc": "03023520201",
            "name": "ឈូក ឆុន"
        },
        {
            "barcode": "171115156",
            "dpc": "03023520301",
            "name": "សយ អ៊ី"
        },
        {
            "barcode": "171115157",
            "dpc": "03023520501",
            "name": "យី សាវឿន"
        },
        {
            "barcode": "171115158",
            "dpc": "03023520601",
            "name": "សារ៉ង សារ:សិន្ធុ"
        },
        {
            "barcode": "171115159",
            "dpc": "03023520701",
            "name": "កែវ សារ៉េត"
        },
        {
            "barcode": "171115160",
            "dpc": "03023520801",
            "name": "នឹម សោភា"
        },
        {
            "barcode": "171115161",
            "dpc": "03023520901",
            "name": "ម៉ៅ ពឿន"
        },
        {
            "barcode": "171115162",
            "dpc": "03023521001",
            "name": "ងួន ចិន្តា"
        },
        {
            "barcode": "171115163",
            "dpc": "03023521101",
            "name": "ង៉ែត យានី"
        },
        {
            "barcode": "171115164",
            "dpc": "03023521301",
            "name": "ញ៉ឹក ថេត"
        },
        {
            "barcode": "171115165",
            "dpc": "03023521501",
            "name": "គង់ សុខុម"
        },
        {
            "barcode": "171115166",
            "dpc": "03023521601",
            "name": "ភាច ផល"
        },
        {
            "barcode": "171115167",
            "dpc": "03023521701",
            "name": "លី​ សាមឌី"
        },
        {
            "barcode": "171115168",
            "dpc": "03023521801",
            "name": "ប៊ុត សៃ"
        },
        {
            "barcode": "171115169",
            "dpc": "03023522001",
            "name": "យី សារឿត"
        },
        {
            "barcode": "171115170",
            "dpc": "03023522201",
            "name": "អ៊ុយ សារឿប"
        },
        {
            "barcode": "171115171",
            "dpc": "03023522301",
            "name": "អ៊ុក គឹមហេង"
        },
        {
            "barcode": "171115172",
            "dpc": "03023522401",
            "name": "កន ផល"
        },
        {
            "barcode": "171115173",
            "dpc": "03023522501",
            "name": "សាំង វួចគាង"
        },
        {
            "barcode": "171115174",
            "dpc": "03023522601",
            "name": "សៀង ចាន់សេថា"
        },
        {
            "barcode": "171115175",
            "dpc": "03023522701",
            "name": "រឹន គឹមហ៊ន"
        },
        {
            "barcode": "171115176",
            "dpc": "03023522801",
            "name": "ប៉ែន បុប្ផា"
        },
        {
            "barcode": "171115177",
            "dpc": "03023522901",
            "name": "ប្រាក់ ច័ន្ទសេរី"
        },
        {
            "barcode": "171115178",
            "dpc": "03023523001",
            "name": "ហ៊ន សុវណ្ណ"
        },
        {
            "barcode": "171115179",
            "dpc": "03023523101",
            "name": "និន សុភ័ក្រ"
        },
        {
            "barcode": "171115180",
            "dpc": "03023523301",
            "name": "ឌី សុនថុល"
        },
        {
            "barcode": "171115181",
            "dpc": "03023523401",
            "name": "កុយ ឆាយ"
        },
        {
            "barcode": "171115182",
            "dpc": "03023523501",
            "name": "ស៊ីវ ស៊ីណែត"
        },
        {
            "barcode": "171115183",
            "dpc": "03023523601",
            "name": "ប៊ុន ឈន"
        },
        {
            "barcode": "171115184",
            "dpc": "03023523701",
            "name": "ប៊ុន ឈឿត"
        },
        {
            "barcode": "171115185",
            "dpc": "03023523801",
            "name": "វត្តក្តុល១"
        },
        {
            "barcode": "171115186",
            "dpc": "03023524101",
            "name": "វិទ្យាល័យក្តុលដូនទាវ"
        },
        {
            "barcode": "171115187",
            "dpc": "03023524201",
            "name": "ជា ឡង់"
        },
        {
            "barcode": "171115188",
            "dpc": "03023524301",
            "name": "លឹម សំណាង"
        },
        {
            "barcode": "171115189",
            "dpc": "03023524401",
            "name": "សាយ ពិសិទ្ធ"
        },
        {
            "barcode": "171115190",
            "dpc": "03023524501",
            "name": "ឡឹង សេរី"
        },
        {
            "barcode": "171115191",
            "dpc": "03023524601",
            "name": "អន មិនា"
        },
        {
            "barcode": "171115192",
            "dpc": "03023524701",
            "name": "ឈុំ សោហ៉ា"
        },
        {
            "barcode": "171115193",
            "dpc": "03023524801",
            "name": "ឡឹង ហ៊ួរ"
        },
        {
            "barcode": "171115194",
            "dpc": "03023524901",
            "name": "ណយ ណារ៉ុង"
        },
        {
            "barcode": "171115195",
            "dpc": "03023525101",
            "name": "ឃឹម ប៊ុនឈឿម"
        },
        {
            "barcode": "171115196",
            "dpc": "03023525201",
            "name": "ហ៊ន វុទ្ទី"
        },
        {
            "barcode": "171115197",
            "dpc": "03023525301",
            "name": "ឡោ ឈៀង"
        },
        {
            "barcode": "171115198",
            "dpc": "03023525501",
            "name": "សី យិច"
        },
        {
            "barcode": "171115199",
            "dpc": "03023525701",
            "name": "លឹម ខេ"
        },
        {
            "barcode": "171115200",
            "dpc": "03023525801",
            "name": "ភាព សុផាត"
        },
        {
            "barcode": "171115201",
            "dpc": "03023526001",
            "name": "ញឹម ប្រាង"
        },
        {
            "barcode": "171115202",
            "dpc": "03023526201",
            "name": "សុខ ហុង"
        },
        {
            "barcode": "171115203",
            "dpc": "03023526501",
            "name": "ហេង តិល"
        },
        {
            "barcode": "171115204",
            "dpc": "03023526701",
            "name": "ឈុំ ឈួម"
        },
        {
            "barcode": "171115205",
            "dpc": "03023526901",
            "name": "ខឹម យ៉ូន"
        },
        {
            "barcode": "171115206",
            "dpc": "03023527001",
            "name": "នង ប៊ឺន"
        },
        {
            "barcode": "171115207",
            "dpc": "03023527101",
            "name": "ឡែប សុផែ"
        },
        {
            "barcode": "171115208",
            "dpc": "03023527201",
            "name": "ឃឹម សាវុធ"
        },
        {
            "barcode": "171115209",
            "dpc": "03023527301",
            "name": "សុខ លីដានី"
        },
        {
            "barcode": "171115210",
            "dpc": "03023527501",
            "name": "ស្ងៀម សុខា"
        },
        {
            "barcode": "171115211",
            "dpc": "03023527601",
            "name": "ប៉យ សាវ៉ាន"
        },
        {
            "barcode": "171115212",
            "dpc": "03023527801",
            "name": "ជុន គឹមហ៊ួរ"
        },
        {
            "barcode": "171115213",
            "dpc": "03023527901",
            "name": "ចាន់ ផល្លា"
        },
        {
            "barcode": "171115214",
            "dpc": "03023528001",
            "name": "សឿម រិន"
        },
        {
            "barcode": "171115215",
            "dpc": "03023528101",
            "name": "អេង ឆែម១"
        },
        {
            "barcode": "171115216",
            "dpc": "03023528601",
            "name": "ពេជ្រ ច័ន្ទមុនី"
        },
        {
            "barcode": "171115217",
            "dpc": "03023528701",
            "name": "ម៉ៅ ចាន់លី"
        },
        {
            "barcode": "171115218",
            "dpc": "03023528801",
            "name": "គង់ សុន"
        },
        {
            "barcode": "171115219",
            "dpc": "03023528901",
            "name": "ហៀក ពុទ្ធី"
        },
        {
            "barcode": "171115220",
            "dpc": "03023529001",
            "name": "ទន់ ខេន"
        },
        {
            "barcode": "171115221",
            "dpc": "03023529101",
            "name": "ជុំ លក្ខណា"
        },
        {
            "barcode": "171115222",
            "dpc": "03023529201",
            "name": "ញ៉េប ភីរម្យ"
        },
        {
            "barcode": "171115223",
            "dpc": "03023529601",
            "name": "ប៉ុល ណារ៉ែន"
        },
        {
            "barcode": "171115224",
            "dpc": "03023529701",
            "name": "អ៊ាន ណារៀង"
        },
        {
            "barcode": "171115225",
            "dpc": "03023529801",
            "name": "ផាវី ភី"
        },
        {
            "barcode": "171115226",
            "dpc": "03023529901",
            "name": "លៀង គឹមស៊ា"
        },
        {
            "barcode": "171115227",
            "dpc": "03023530001",
            "name": "រ៉ែម ណារ៉ុង"
        },
        {
            "barcode": "171115228",
            "dpc": "03023530101",
            "name": "រិទ្ថ សារី"
        },
        {
            "barcode": "171115229",
            "dpc": "03023530201",
            "name": "ម៉ ចាន់"
        },
        {
            "barcode": "171115230",
            "dpc": "03023530301",
            "name": "ជុំ សារីណា"
        },
        {
            "barcode": "171115231",
            "dpc": "03023530501",
            "name": "ឪក សាមៀន"
        },
        {
            "barcode": "171115232",
            "dpc": "03023530601",
            "name": "ថាត រុន"
        },
        {
            "barcode": "171115233",
            "dpc": "03023530701",
            "name": "ចេក សារិទ្ធ"
        },
        {
            "barcode": "171115234",
            "dpc": "03023530801",
            "name": "ហុង ស៊ីវ"
        },
        {
            "barcode": "171115235",
            "dpc": "03023530901",
            "name": "សួន ឆុន"
        },
        {
            "barcode": "171115236",
            "dpc": "03023531001",
            "name": "ញៀប សារុន"
        },
        {
            "barcode": "171115237",
            "dpc": "03023531101",
            "name": "ឡង់ វុទ្ទី"
        },
        {
            "barcode": "171115238",
            "dpc": "03023531201",
            "name": "សៀង ចយ"
        },
        {
            "barcode": "171115239",
            "dpc": "03023531301",
            "name": "ថ្លុង សឹរី"
        },
        {
            "barcode": "171115240",
            "dpc": "03023531501",
            "name": "ឈឿង ឆែម"
        },
        {
            "barcode": "171115241",
            "dpc": "03023531601",
            "name": "ម៉ក់ សុធា"
        },
        {
            "barcode": "171115242",
            "dpc": "03023531701",
            "name": "សាន ហ៊ុន"
        },
        {
            "barcode": "171115243",
            "dpc": "03023531801",
            "name": "ច្រែង ឈឿម"
        },
        {
            "barcode": "171115244",
            "dpc": "03023531901",
            "name": "ពៅ ប៊ុន ថា"
        },
        {
            "barcode": "171115245",
            "dpc": "03023532001",
            "name": "ហ៊ន យក់ហៀប"
        },
        {
            "barcode": "171115246",
            "dpc": "03023532101",
            "name": "ហាក់ សន"
        },
        {
            "barcode": "171115247",
            "dpc": "03023532201",
            "name": "តោ ឈូក"
        },
        {
            "barcode": "171115248",
            "dpc": "03023532301",
            "name": "រួម បូរី"
        },
        {
            "barcode": "171115249",
            "dpc": "03023532401",
            "name": "ឈិន សំអឿន"
        },
        {
            "barcode": "171115250",
            "dpc": "03023532501",
            "name": "ម៉ៅ សំបុណ្យ"
        },
        {
            "barcode": "171115251",
            "dpc": "03023532601",
            "name": "សុខ ស៊ីម"
        },
        {
            "barcode": "171115252",
            "dpc": "03023532701",
            "name": "កែម ស៊ីណៃ"
        },
        {
            "barcode": "171115253",
            "dpc": "03023532801",
            "name": "ឈួន ផាត"
        },
        {
            "barcode": "171115254",
            "dpc": "03023532901",
            "name": "យឹម យុន"
        },
        {
            "barcode": "171115255",
            "dpc": "03023533001",
            "name": "ស៊ឹម សៃនី"
        },
        {
            "barcode": "171115256",
            "dpc": "03023533101",
            "name": "ម៉ន រឿត"
        },
        {
            "barcode": "171115257",
            "dpc": "03023533201",
            "name": "ហេង វាសនា"
        },
        {
            "barcode": "171115258",
            "dpc": "03023533301",
            "name": "សំ ចាន់"
        },
        {
            "barcode": "171115259",
            "dpc": "03023533401",
            "name": "សួន ម៉ាប់"
        },
        {
            "barcode": "171115260",
            "dpc": "03023533501",
            "name": "គង់ វាសនា"
        },
        {
            "barcode": "171115261",
            "dpc": "03023533601",
            "name": "ហាក់ ឈឿន"
        },
        {
            "barcode": "171115262",
            "dpc": "03023533701",
            "name": "ម៉ង សុធី"
        },
        {
            "barcode": "171115263",
            "dpc": "03023533801",
            "name": "សេង ញឹម"
        },
        {
            "barcode": "171115264",
            "dpc": "03023533901",
            "name": "សួន នឹម"
        },
        {
            "barcode": "171115265",
            "dpc": "03023534001",
            "name": "ម៉ូត សេរី"
        },
        {
            "barcode": "171115266",
            "dpc": "03023534101",
            "name": "ជី សុជាតិ"
        },
        {
            "barcode": "171115267",
            "dpc": "03023534301",
            "name": "ម៉ូត ខន"
        },
        {
            "barcode": "171115268",
            "dpc": "03023534401",
            "name": "ម៉ូ ប៊ុន"
        },
        {
            "barcode": "171115269",
            "dpc": "03023534501",
            "name": "ជី សុខរ៉ន"
        },
        {
            "barcode": "171115270",
            "dpc": "03023534801",
            "name": "មុត ម៉ុច"
        },
        {
            "barcode": "171115271",
            "dpc": "03023534901",
            "name": "ព្រុំ មុនី"
        },
        {
            "barcode": "171115272",
            "dpc": "03023535001",
            "name": "លឹម គី"
        },
        {
            "barcode": "171115273",
            "dpc": "03023535301",
            "name": "អ៊ាន សុធី"
        },
        {
            "barcode": "171115274",
            "dpc": "03023535601",
            "name": "ពេជ្រ ណូក"
        },
        {
            "barcode": "171115275",
            "dpc": "03023535801",
            "name": "លឹម គឹមស៊ុន"
        },
        {
            "barcode": "171115276",
            "dpc": "03023536201",
            "name": "ហុង ដារ៉ា"
        },
        {
            "barcode": "171115277",
            "dpc": "03023536401",
            "name": "ឪ ដែន"
        },
        {
            "barcode": "171115278",
            "dpc": "03023536701",
            "name": "ជា ញាន"
        },
        {
            "barcode": "171115279",
            "dpc": "03023536901",
            "name": "យ៉ង់ យឿត"
        },
        {
            "barcode": "171115280",
            "dpc": "03023537001",
            "name": "សណ្តែក ម៉ុច"
        },
        {
            "barcode": "171115281",
            "dpc": "03023537401",
            "name": "យ៉ង់ សារេន"
        },
        {
            "barcode": "171115282",
            "dpc": "03023537501",
            "name": "អ៊ិត ហឿត"
        },
        {
            "barcode": "171115283",
            "dpc": "03023537601",
            "name": "នៅ តាំង"
        },
        {
            "barcode": "171115284",
            "dpc": "03023537701",
            "name": "ឈា សិលា"
        },
        {
            "barcode": "171115285",
            "dpc": "03023537801",
            "name": "ព្រុំ  ស៊ីថុល"
        },
        {
            "barcode": "171115286",
            "dpc": "03023538101",
            "name": "ឈា សុផានី"
        },
        {
            "barcode": "171115287",
            "dpc": "03023538201",
            "name": "លឹម នាង"
        },
        {
            "barcode": "171115288",
            "dpc": "03023538301",
            "name": "សែម សុខុម"
        },
        {
            "barcode": "171115289",
            "dpc": "03023538401",
            "name": "ចន សុផាណា"
        },
        {
            "barcode": "171115290",
            "dpc": "03023538501",
            "name": "ង៉ោ ប៉ុនពេជ្រ"
        },
        {
            "barcode": "171115291",
            "dpc": "03023538701",
            "name": "ប៉ូច សុភណ្ណារិទ្ធ"
        },
        {
            "barcode": "171115292",
            "dpc": "03023538801",
            "name": "អុំ រដ្ធា"
        },
        {
            "barcode": "171115293",
            "dpc": "03023538901",
            "name": "ទី ថា"
        },
        {
            "barcode": "171115294",
            "dpc": "03023539001",
            "name": "ជេត កុសល់"
        },
        {
            "barcode": "171115295",
            "dpc": "03023539101",
            "name": "ឡាប វណ្ណឌី"
        },
        {
            "barcode": "171115296",
            "dpc": "03023539201",
            "name": "យុន តៃអាន"
        },
        {
            "barcode": "171115297",
            "dpc": "03023539301",
            "name": "ផេង សំប៊ូន"
        },
        {
            "barcode": "171115298",
            "dpc": "03023539401",
            "name": "ហាន ហ៊ីង"
        },
        {
            "barcode": "171115299",
            "dpc": "03023539501",
            "name": "ហេង សុវណ្ណ"
        },
        {
            "barcode": "171115300",
            "dpc": "03023539601",
            "name": "សោម ទីន"
        },
        {
            "barcode": "171115301",
            "dpc": "03023539701",
            "name": "យ៉ត សាង"
        },
        {
            "barcode": "171115302",
            "dpc": "03023539801",
            "name": "គង់ សុផន"
        },
        {
            "barcode": "171115303",
            "dpc": "03023539901",
            "name": "ទឹម រី​"
        },
        {
            "barcode": "171115304",
            "dpc": "03023540001",
            "name": "ហឿន នាង"
        },
        {
            "barcode": "171115305",
            "dpc": "03023540101",
            "name": "ឡាច ព្រីន"
        },
        {
            "barcode": "171115306",
            "dpc": "03023540201",
            "name": "ប៉ាន សុខា"
        },
        {
            "barcode": "171115307",
            "dpc": "03023540301",
            "name": "មុំ សុភាព"
        },
        {
            "barcode": "171115308",
            "dpc": "03023540401",
            "name": "ព្រីង ចាប"
        },
        {
            "barcode": "171115309",
            "dpc": "03023540501",
            "name": "ពៅ ប៊ុនថា"
        },
        {
            "barcode": "171115310",
            "dpc": "03023540801",
            "name": "ពេជ្រ ណារ៉ាន់"
        },
        {
            "barcode": "171115311",
            "dpc": "03023540901",
            "name": "ហែម សារ៉េត"
        },
        {
            "barcode": "171115312",
            "dpc": "03023541001",
            "name": "ឆៃ សារ៉ា"
        },
        {
            "barcode": "171115313",
            "dpc": "03023541201",
            "name": "ឡត ប៊ុនថុន១"
        },
        {
            "barcode": "171115314",
            "dpc": "03023541301",
            "name": "ពេជ្រ ថោងលឿម"
        },
        {
            "barcode": "171115315",
            "dpc": "03023541401",
            "name": "នៅ នី"
        },
        {
            "barcode": "171115316",
            "dpc": "03023541601",
            "name": "ទិត្យ សុខុម"
        },
        {
            "barcode": "171115317",
            "dpc": "03023541701",
            "name": "តុល ថុល"
        },
        {
            "barcode": "171115318",
            "dpc": "03023541801",
            "name": "ជុំ នឿម"
        },
        {
            "barcode": "171115319",
            "dpc": "03023542101",
            "name": "វ៉ាន វ៉ៃ"
        },
        {
            "barcode": "171115321",
            "dpc": "03023542301",
            "name": "ញ៉ុក យ៉េន"
        },
        {
            "barcode": "171115322",
            "dpc": "03023542701",
            "name": "សោរ ទូច"
        },
        {
            "barcode": "171115323",
            "dpc": "03023542801",
            "name": "យុន ឡៅស៊ិត"
        },
        {
            "barcode": "171115324",
            "dpc": "03023542901",
            "name": "យ៉ុន ឡៅសត្តិ១"
        },
        {
            "barcode": "171115325",
            "dpc": "03023543001",
            "name": "ព្រុំ  វុទ្ធី"
        },
        {
            "barcode": "171115326",
            "dpc": "03023543101",
            "name": "ថេត រីឆាន"
        },
        {
            "barcode": "171115327",
            "dpc": "03023543201",
            "name": "រៀល ថងសឺត"
        },
        {
            "barcode": "171115328",
            "dpc": "03023543301",
            "name": "ចាន់ ឆឿង"
        },
        {
            "barcode": "171115329",
            "dpc": "03023543401",
            "name": "សោម វណ្ណី"
        },
        {
            "barcode": "171115330",
            "dpc": "03023543501",
            "name": "ប្រាក់ យស់ផា"
        },
        {
            "barcode": "171115331",
            "dpc": "03023543601",
            "name": "ផាន ហ៊ុន"
        },
        {
            "barcode": "171115332",
            "dpc": "03023543701",
            "name": "អ៊ិន សេរី"
        },
        {
            "barcode": "171115333",
            "dpc": "03023543801",
            "name": "អេង លីសាលុយ"
        },
        {
            "barcode": "171115334",
            "dpc": "03023543901",
            "name": "ទិត្យ អាន"
        },
        {
            "barcode": "171115335",
            "dpc": "03023544101",
            "name": "ឡេង ធារី"
        },
        {
            "barcode": "171115336",
            "dpc": "03023544301",
            "name": "សយ យ៉េត"
        },
        {
            "barcode": "171115337",
            "dpc": "03023544501",
            "name": "ហោ លឿប"
        },
        {
            "barcode": "171115338",
            "dpc": "03023544601",
            "name": "ឡេង ប៊ុនរ៉ុង"
        },
        {
            "barcode": "171115339",
            "dpc": "03023544701",
            "name": "សាលាបឋមសិក្សាថ្កូវ"
        },
        {
            "barcode": "171115340",
            "dpc": "03023544801",
            "name": "យ៉ុង ទី"
        },
        {
            "barcode": "171115341",
            "dpc": "03023544901",
            "name": "ផុន ភឿត"
        },
        {
            "barcode": "171115342",
            "dpc": "03023545001",
            "name": "ផុន សុខ"
        },
        {
            "barcode": "171115343",
            "dpc": "03023545101",
            "name": "អ៊ុច រ៉ាត់"
        },
        {
            "barcode": "171115344",
            "dpc": "03023545201",
            "name": "សោម ស៊ួរ"
        },
        {
            "barcode": "171115345",
            "dpc": "03023545301",
            "name": "ហែម វត្តី"
        },
        {
            "barcode": "171115346",
            "dpc": "03023545401",
            "name": "ទិត្យ ផេង"
        },
        {
            "barcode": "171115347",
            "dpc": "03023545501",
            "name": "វ៉ាត សារ៉ាត់"
        },
        {
            "barcode": "171115348",
            "dpc": "03023545601",
            "name": "ឡេង សុខុម"
        },
        {
            "barcode": "171115349",
            "dpc": "03023545701",
            "name": "សៅ យ៉ា"
        },
        {
            "barcode": "171115350",
            "dpc": "03023546101",
            "name": "ឆែម ឆន"
        },
        {
            "barcode": "171115351",
            "dpc": "03023546201",
            "name": "រឿន ឈូក"
        },
        {
            "barcode": "171115352",
            "dpc": "03023546301",
            "name": "អេង ចាន់ថង"
        },
        {
            "barcode": "171115353",
            "dpc": "03023546401",
            "name": "យឿត ហ៊ាង"
        },
        {
            "barcode": "171115354",
            "dpc": "03023546501",
            "name": "យឿត ហាង១"
        },
        {
            "barcode": "171115355",
            "dpc": "03023546701",
            "name": "យឿត ហ៊ាង៣"
        },
        {
            "barcode": "171115356",
            "dpc": "03023546801",
            "name": "ងួន រ៉ានី"
        },
        {
            "barcode": "171115357",
            "dpc": "03023547001",
            "name": "ហ៊ន ហឿន"
        },
        {
            "barcode": "171115358",
            "dpc": "03023547101",
            "name": "វូ គិញ"
        },
        {
            "barcode": "171115359",
            "dpc": "03023547201",
            "name": "ឈាន ភីរ៉ា"
        },
        {
            "barcode": "171115360",
            "dpc": "03023547301",
            "name": "យូរ សាយ៍ណ្ត"
        },
        {
            "barcode": "171115361",
            "dpc": "03023547401",
            "name": "សាំង សុវត្តិ"
        },
        {
            "barcode": "171115362",
            "dpc": "03023547601",
            "name": "ប៊ុន តុងបូរ៉ារិទ្ធ"
        },
        {
            "barcode": "171115363",
            "dpc": "03023547701",
            "name": "ជួង ចន្ជី"
        },
        {
            "barcode": "171115364",
            "dpc": "03023547801",
            "name": "លី សម្បត្តិ"
        },
        {
            "barcode": "171115365",
            "dpc": "03023502501",
            "name": "យន់ សាវ័ន្ត"
        },
        {
            "barcode": "171115366",
            "dpc": "03023548001",
            "name": "នូរ ប៊ុណ្ណារ៉ា"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});