

let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=
    [
        {
            "barcode": "171115367",
            "dpc": "03013700101",
            "name": "ហុក សុខា"
        },
        {
            "barcode": "171115368",
            "dpc": "03013700201",
            "name": "ជុំ សុគុណ"
        },
        {
            "barcode": "171115369",
            "dpc": "03013700301",
            "name": "ភួង ចន្ថា"
        },
        {
            "barcode": "171115370",
            "dpc": "03013700401",
            "name": "ទី ប៊ុនរឿង"
        },
        {
            "barcode": "171115371",
            "dpc": "03013700501",
            "name": "ឈូក សាមឿន"
        },
        {
            "barcode": "171115372",
            "dpc": "03013700601",
            "name": "ជី វុទ្ទី"
        },
        {
            "barcode": "171115373",
            "dpc": "03013700701",
            "name": "លឹម សន្ទនា"
        },
        {
            "barcode": "171115374",
            "dpc": "03013700801",
            "name": "ក្រួច ឈួន"
        },
        {
            "barcode": "171115375",
            "dpc": "03013701001",
            "name": "រួត ចន្ទ័សុហា"
        },
        {
            "barcode": "171115376",
            "dpc": "03013701101",
            "name": "សេង ណាវី"
        },
        {
            "barcode": "171115377",
            "dpc": "03013701201",
            "name": "លាង ប៊ុន"
        },
        {
            "barcode": "171115378",
            "dpc": "03013701301",
            "name": "មឹង ខុម"
        },
        {
            "barcode": "171115379",
            "dpc": "03013701401",
            "name": "ឆែក សាវន្ត័"
        },
        {
            "barcode": "171115380",
            "dpc": "03013701501",
            "name": "សួន ចិត្រ"
        },
        {
            "barcode": "171115381",
            "dpc": "03013701601",
            "name": "ហាក រ៉ាវី"
        },
        {
            "barcode": "171115382",
            "dpc": "03013701701",
            "name": "ស្រី សំបាន"
        },
        {
            "barcode": "171115383",
            "dpc": "03013701801",
            "name": "អ៊ឹម ផារ៉ា"
        },
        {
            "barcode": "171115384",
            "dpc": "03013701901",
            "name": "តាប់ កឿន"
        },
        {
            "barcode": "171115385",
            "dpc": "03013702001",
            "name": "ឯក សុវណ្ណ២"
        },
        {
            "barcode": "171115386",
            "dpc": "03013702101",
            "name": "ផាត់ ម៉ូវ"
        },
        {
            "barcode": "171115387",
            "dpc": "03013702201",
            "name": "ឃុត សារ៉ែត"
        },
        {
            "barcode": "171115388",
            "dpc": "03013702301",
            "name": "សៀវ គឹមសាន្ត"
        },
        {
            "barcode": "171115389",
            "dpc": "03013702401",
            "name": "វី ម៉ៅ"
        },
        {
            "barcode": "171115390",
            "dpc": "03013702601",
            "name": "ប្លង់ សុជាតិ"
        },
        {
            "barcode": "171115391",
            "dpc": "03013702701",
            "name": "រ៉ន និន"
        },
        {
            "barcode": "171115392",
            "dpc": "03013702801",
            "name": "សួង សុភា"
        },
        {
            "barcode": "171115393",
            "dpc": "03013702901",
            "name": "ប៉ុក ថេង"
        },
        {
            "barcode": "171115394",
            "dpc": "03013703001",
            "name": "ឈឹម សំអុល"
        },
        {
            "barcode": "171115395",
            "dpc": "03013703101",
            "name": "សុខ ផល្លី"
        },
        {
            "barcode": "171115396",
            "dpc": "03013703201",
            "name": "ជា រដ្ឋា"
        },
        {
            "barcode": "171115397",
            "dpc": "03013703301",
            "name": "សាលាបឋមសិក្សា ស្វាយធំ"
        },
        {
            "barcode": "171115398",
            "dpc": "03013703501",
            "name": "តូច សៅវ៉ារ៉ា"
        },
        {
            "barcode": "171115399",
            "dpc": "03013703601",
            "name": "ប៉ួត វុន"
        },
        {
            "barcode": "171115400",
            "dpc": "03013703701",
            "name": "ហោម មន្នី"
        },
        {
            "barcode": "171115401",
            "dpc": "03013703901",
            "name": "សៀង សុគន្ធ"
        },
        {
            "barcode": "171115402",
            "dpc": "03013704001",
            "name": "អេង ស៊ីណា"
        },
        {
            "barcode": "171115403",
            "dpc": "03013704101",
            "name": "នី អេង"
        },
        {
            "barcode": "171115404",
            "dpc": "03013704201",
            "name": "អោក ភាព"
        },
        {
            "barcode": "171115405",
            "dpc": "03013704301",
            "name": "កែង គឹមតេង"
        },
        {
            "barcode": "171115406",
            "dpc": "03013704401",
            "name": "អាង កែវ"
        },
        {
            "barcode": "171115407",
            "dpc": "03013704601",
            "name": "ជី ស៊ង"
        },
        {
            "barcode": "171115408",
            "dpc": "03013704801",
            "name": "វឿន វ៉ាន់"
        },
        {
            "barcode": "171115409",
            "dpc": "03013704901",
            "name": "ហ៊ា កង់"
        },
        {
            "barcode": "171115410",
            "dpc": "03013705001",
            "name": "ហេង ម៉ៅ"
        },
        {
            "barcode": "171115411",
            "dpc": "03013705201",
            "name": "ស្រស់ គីមហាក់"
        },
        {
            "barcode": "171115412",
            "dpc": "03013705301",
            "name": "រឿង ឆាន"
        },
        {
            "barcode": "171115413",
            "dpc": "03013705401",
            "name": "លិញ សុផល"
        },
        {
            "barcode": "171115414",
            "dpc": "03013705501",
            "name": "ជៀប រីណា"
        },
        {
            "barcode": "171115415",
            "dpc": "03013705601",
            "name": "ឈុំ ស្រីអូន"
        },
        {
            "barcode": "171115416",
            "dpc": "03013705701",
            "name": "ប៊ុន រើន"
        },
        {
            "barcode": "171115417",
            "dpc": "03013705801",
            "name": "តុប ចាន់ផល្លា"
        },
        {
            "barcode": "171115418",
            "dpc": "03013705901",
            "name": "យឹម ទ្រី"
        },
        {
            "barcode": "171115419",
            "dpc": "03013706001",
            "name": "រស់ ចាន់ដារ៉ា"
        },
        {
            "barcode": "171115420",
            "dpc": "03013706101",
            "name": "គា សុខ"
        },
        {
            "barcode": "171115421",
            "dpc": "03013706201",
            "name": "អ៊ូ វុទ្ធី"
        },
        {
            "barcode": "171115422",
            "dpc": "03013706301",
            "name": "ហែម ឡាប"
        },
        {
            "barcode": "171115423",
            "dpc": "03013706401",
            "name": "អូច ម៉ៅ"
        },
        {
            "barcode": "171115424",
            "dpc": "03013706601",
            "name": "ជៀម ចិន្តា"
        },
        {
            "barcode": "171115425",
            "dpc": "03013706801",
            "name": "អ៊ុក ឆនន្ត័"
        },
        {
            "barcode": "171115426",
            "dpc": "03013706901",
            "name": "អ៊ុក ណាវុធ"
        },
        {
            "barcode": "171115427",
            "dpc": "03013707001",
            "name": "ជុំ សុភា"
        },
        {
            "barcode": "171115428",
            "dpc": "03013707101",
            "name": "អៀម រិននឿត"
        },
        {
            "barcode": "171115429",
            "dpc": "03013707201",
            "name": "នេត មុំ"
        },
        {
            "barcode": "171115430",
            "dpc": "03013707401",
            "name": "ឆេង ចាន់រ៉ា"
        },
        {
            "barcode": "171115431",
            "dpc": "03013707601",
            "name": "ព្រំ ក្រាញ់"
        },
        {
            "barcode": "171115432",
            "dpc": "03013707701",
            "name": "មុំ ណូក"
        },
        {
            "barcode": "171115433",
            "dpc": "03013708001",
            "name": "គង់ ពីណា"
        },
        {
            "barcode": "171115434",
            "dpc": "03013708101",
            "name": "ឆាយ រិទ្វី"
        },
        {
            "barcode": "171115435",
            "dpc": "03013708201",
            "name": "ផា សុភាវី"
        },
        {
            "barcode": "171115436",
            "dpc": "03013708301",
            "name": "ចេង សុខហៀង"
        },
        {
            "barcode": "171115437",
            "dpc": "03013708501",
            "name": "ឈឿម ឆៃយ៉ា"
        },
        {
            "barcode": "171115438",
            "dpc": "03013708601",
            "name": "គង់ អៀប"
        },
        {
            "barcode": "171115439",
            "dpc": "03013708801",
            "name": "ជឿន សុជា"
        },
        {
            "barcode": "171115440",
            "dpc": "03013708901",
            "name": "ទីង ហាកហ៊ុច"
        },
        {
            "barcode": "171115441",
            "dpc": "03013709001",
            "name": "ឌុង សំណាង"
        },
        {
            "barcode": "171115442",
            "dpc": "03013709101",
            "name": "ទឹម វុន"
        },
        {
            "barcode": "171115443",
            "dpc": "03013709201",
            "name": "ធឿន សោភា"
        },
        {
            "barcode": "171115444",
            "dpc": "03013709301",
            "name": "ហ៊ីម ហួច"
        },
        {
            "barcode": "171115445",
            "dpc": "03013709501",
            "name": "ហឹង សាវើន"
        },
        {
            "barcode": "171115446",
            "dpc": "03013709601",
            "name": "ឡុង វុន"
        },
        {
            "barcode": "171115447",
            "dpc": "03013709701",
            "name": "ឌៀប រិទ្ធស្យា"
        },
        {
            "barcode": "171115448",
            "dpc": "03013709801",
            "name": "ប៉ា សារ៉ា"
        },
        {
            "barcode": "171115449",
            "dpc": "03013709901",
            "name": "ឡយ លី"
        },
        {
            "barcode": "171115450",
            "dpc": "03013710001",
            "name": "ឌូង សូត្រ"
        },
        {
            "barcode": "171115451",
            "dpc": "03013710101",
            "name": "លី ស្រីអេង"
        },
        {
            "barcode": "171115452",
            "dpc": "03013710201",
            "name": "ស៊ុន សារី"
        },
        {
            "barcode": "171115453",
            "dpc": "03013710301",
            "name": "នៅ រតនា"
        },
        {
            "barcode": "171115454",
            "dpc": "03013710401",
            "name": "ណាត ហឿន"
        },
        {
            "barcode": "171115455",
            "dpc": "03013710501",
            "name": "សាំង សុគន្ធារិទ្ធ"
        },
        {
            "barcode": "171115456",
            "dpc": "03013710601",
            "name": "ង៉ែត សុខ"
        },
        {
            "barcode": "171115457",
            "dpc": "03013710701",
            "name": "ឃ្លាំង អៀន"
        },
        {
            "barcode": "171115458",
            "dpc": "03013710801",
            "name": "ស៊ន កឺ"
        },
        {
            "barcode": "171115459",
            "dpc": "03013710901",
            "name": "ហ៊ត ដារៀង"
        },
        {
            "barcode": "171115460",
            "dpc": "03013711001",
            "name": "ហ៊ត សារឿប"
        },
        {
            "barcode": "171115461",
            "dpc": "03013711301",
            "name": "លី ចិន្តា"
        },
        {
            "barcode": "171115462",
            "dpc": "03013711401",
            "name": "កូន ផល្លា"
        },
        {
            "barcode": "171115463",
            "dpc": "03013711501",
            "name": "ឆេង ឆន"
        },
        {
            "barcode": "171115464",
            "dpc": "03013711601",
            "name": "រៀប សុពណ៏"
        },
        {
            "barcode": "171115465",
            "dpc": "03013711801",
            "name": "វ៉ាន សៅរិទ្ទ"
        },
        {
            "barcode": "171115466",
            "dpc": "03013712001",
            "name": "កែវ វុទ្ធី"
        },
        {
            "barcode": "171115467",
            "dpc": "03013712101",
            "name": "ខៀវ ពៅ"
        },
        {
            "barcode": "171115468",
            "dpc": "03013712201",
            "name": "ចាន់ សុភ័ណ្ឌ"
        },
        {
            "barcode": "171115469",
            "dpc": "03013712301",
            "name": "សិន ភេន"
        },
        {
            "barcode": "171115470",
            "dpc": "03013712401",
            "name": "ទូច ចន្ថា"
        },
        {
            "barcode": "171115471",
            "dpc": "03013712501",
            "name": "ភុំ លី"
        },
        {
            "barcode": "171115472",
            "dpc": "03013712601",
            "name": "ជា ឡេង"
        },
        {
            "barcode": "171115473",
            "dpc": "03013712701",
            "name": "ទេព លឿប"
        },
        {
            "barcode": "171115474",
            "dpc": "03013712801",
            "name": "និត ជីវន័្ត"
        },
        {
            "barcode": "171115475",
            "dpc": "03013712901",
            "name": "ប៊ុននាង សុនន្ទ"
        },
        {
            "barcode": "171115476",
            "dpc": "03013713101",
            "name": "ទិត្យ សេរីយស"
        },
        {
            "barcode": "171115477",
            "dpc": "03013713201",
            "name": "បាង រ៉ា"
        },
        {
            "barcode": "171115478",
            "dpc": "03013713301",
            "name": "លី ជីអ៊ី"
        },
        {
            "barcode": "171115479",
            "dpc": "03013713401",
            "name": "តែម គឹមសួង"
        },
        {
            "barcode": "171115480",
            "dpc": "03013713501",
            "name": "ហុង ឃឿត"
        },
        {
            "barcode": "171115481",
            "dpc": "03013713601",
            "name": "ឡាប រិខា"
        },
        {
            "barcode": "171115482",
            "dpc": "03013713701",
            "name": "រ៉ុង រតនៈ"
        },
        {
            "barcode": "171115483",
            "dpc": "03013713801",
            "name": "ផា ជៀវ"
        },
        {
            "barcode": "171115484",
            "dpc": "03013714001",
            "name": "ស៊ុយ សូវៀត"
        },
        {
            "barcode": "171115485",
            "dpc": "03013714101",
            "name": "អ៊ឹង តាំងហេង"
        },
        {
            "barcode": "171115486",
            "dpc": "03013714201",
            "name": "អ៊ី វិច្ឋិកា"
        },
        {
            "barcode": "171115487",
            "dpc": "03013714301",
            "name": "សេក ណារ៉េត"
        },
        {
            "barcode": "171115488",
            "dpc": "03013714401",
            "name": "ហួត ភ័ណ្ឌ"
        },
        {
            "barcode": "171115489",
            "dpc": "03013714501",
            "name": "ហង្ស វណ្ណសុទ្ធ"
        },
        {
            "barcode": "171115490",
            "dpc": "03013714601",
            "name": "ទន់ ភក្តី"
        },
        {
            "barcode": "171115491",
            "dpc": "03013714701",
            "name": "កង់ រឿត"
        },
        {
            "barcode": "171115492",
            "dpc": "03013714801",
            "name": "ឈីវ ខុម"
        },
        {
            "barcode": "171115493",
            "dpc": "03013714901",
            "name": "ម៉ម ឈន"
        },
        {
            "barcode": "171115494",
            "dpc": "03013715001",
            "name": "ហេង មុន្នីចិន្តា"
        },
        {
            "barcode": "171115495",
            "dpc": "03013715101",
            "name": "ប៉ោ សុវណ្ណ:"
        },
        {
            "barcode": "171115496",
            "dpc": "03013715301",
            "name": "យឿន សុជាតិ"
        },
        {
            "barcode": "171115497",
            "dpc": "03013715401",
            "name": "រៀម ធាត់"
        },
        {
            "barcode": "171115498",
            "dpc": "03013715601",
            "name": "យូ រ៉ាដេត"
        },
        {
            "barcode": "171115499",
            "dpc": "03013715701",
            "name": "កិន អង់ផល្លា"
        },
        {
            "barcode": "171115500",
            "dpc": "03013715801",
            "name": "កិន គីនណារិន"
        },
        {
            "barcode": "171115501",
            "dpc": "03013715901",
            "name": "កិន គីរំដួល"
        },
        {
            "barcode": "171115502",
            "dpc": "03013716001",
            "name": "កិន គីរ៉ានី"
        },
        {
            "barcode": "171115503",
            "dpc": "03013716101",
            "name": "កិន សាខាឌី"
        },
        {
            "barcode": "171115504",
            "dpc": "03013716201",
            "name": "ជា ហេង"
        },
        {
            "barcode": "171115505",
            "dpc": "03013716301",
            "name": "ជ័យ ឆាយ"
        },
        {
            "barcode": "171115506",
            "dpc": "03013716401",
            "name": "ចេង ទ្រី"
        },
        {
            "barcode": "171115507",
            "dpc": "03013716501",
            "name": "លាប គាវ"
        },
        {
            "barcode": "171115508",
            "dpc": "03013716601",
            "name": "ប៉ែន ឃីម"
        },
        {
            "barcode": "171115509",
            "dpc": "03013716801",
            "name": "វិទ្យាល័យ អន្លង់វិល"
        },
        {
            "barcode": "171115510",
            "dpc": "03013716901",
            "name": "ប៊ុនឈឿយ សុម៉ាលី"
        },
        {
            "barcode": "171115511",
            "dpc": "03013717001",
            "name": "ប៊ុនឈឿយ ចាន់មុន្នី"
        },
        {
            "barcode": "171115512",
            "dpc": "03013717101",
            "name": "ឈឺត សួម"
        },
        {
            "barcode": "171115513",
            "dpc": "03013717201",
            "name": "ណុប ពោល២"
        },
        {
            "barcode": "171115514",
            "dpc": "03013717301",
            "name": "ណុប ស៊ីន"
        },
        {
            "barcode": "171115515",
            "dpc": "03013717401",
            "name": "យិប គង់"
        },
        {
            "barcode": "171115516",
            "dpc": "03013717501",
            "name": "ស៊ុយ សុវណ្ណា"
        },
        {
            "barcode": "171115517",
            "dpc": "03013717601",
            "name": "លឹម គឹមហេង"
        },
        {
            "barcode": "171115518",
            "dpc": "03013717701",
            "name": "​ហឺសេរីលក្ខណ មន្នី"
        },
        {
            "barcode": "171115519",
            "dpc": "03013717801",
            "name": "រុំ ឈាងលី"
        },
        {
            "barcode": "171115520",
            "dpc": "03013717901",
            "name": "ស៊ាន នី"
        },
        {
            "barcode": "171115521",
            "dpc": "03013718001",
            "name": "ហុក រៀង"
        },
        {
            "barcode": "171115522",
            "dpc": "03013718101",
            "name": "ពយ ឈាន"
        },
        {
            "barcode": "171115523",
            "dpc": "03013718201",
            "name": "ចែម សៀន"
        },
        {
            "barcode": "171115524",
            "dpc": "03013718301",
            "name": "ព្រីម ណាត"
        },
        {
            "barcode": "171115525",
            "dpc": "03013718401",
            "name": "ហ៊ុន ផាន់ណា"
        },
        {
            "barcode": "171115526",
            "dpc": "03013718801",
            "name": "គឹម ហ៊រ"
        },
        {
            "barcode": "171115527",
            "dpc": "03013718901",
            "name": "តែង ឡឹម"
        },
        {
            "barcode": "171115528",
            "dpc": "03013719001",
            "name": "ម៉ម មួន"
        },
        {
            "barcode": "171115529",
            "dpc": "03013719101",
            "name": "ឈួយ យ៉ុន"
        },
        {
            "barcode": "171115530",
            "dpc": "03013719201",
            "name": "ចាន់ ឈួក"
        },
        {
            "barcode": "171115531",
            "dpc": "03013719301",
            "name": "ភឿង សាវុធ"
        },
        {
            "barcode": "171115532",
            "dpc": "03013719401",
            "name": "សំ បូណា"
        },
        {
            "barcode": "171115533",
            "dpc": "03013719501",
            "name": "សំ សុជី"
        },
        {
            "barcode": "171115534",
            "dpc": "03013719601",
            "name": "គង់ គឿត"
        },
        {
            "barcode": "171115535",
            "dpc": "03013719701",
            "name": "អ៊ាន សុខអេង"
        },
        {
            "barcode": "171115536",
            "dpc": "03013719901",
            "name": "កេន សាវី"
        },
        {
            "barcode": "171115537",
            "dpc": "03013720001",
            "name": "ប៉ុច សុឃឿន"
        },
        {
            "barcode": "171115538",
            "dpc": "03013720201",
            "name": "ប៊ុន សារុន"
        },
        {
            "barcode": "171115539",
            "dpc": "03013720301",
            "name": "កែវ ភាវី"
        },
        {
            "barcode": "171115540",
            "dpc": "03013720401",
            "name": "អាន បឿន"
        },
        {
            "barcode": "171115541",
            "dpc": "03013720501",
            "name": "ដន មែងជា"
        },
        {
            "barcode": "171115542",
            "dpc": "03013720601",
            "name": "ហេង ឆាយ"
        },
        {
            "barcode": "171115543",
            "dpc": "03013720701",
            "name": "អាន ចិន្ថា"
        },
        {
            "barcode": "171115544",
            "dpc": "03013720801",
            "name": "ជួ កែវពិសិដ្ឋ"
        },
        {
            "barcode": "171115545",
            "dpc": "03013720901",
            "name": "នួរ សារ៉ាត់ធី"
        },
        {
            "barcode": "171115546",
            "dpc": "03013721001",
            "name": "យ៉ន ចន្ធួ"
        },
        {
            "barcode": "171115547",
            "dpc": "03013721101",
            "name": "ម៉ៅ ម៉ាលីលី"
        },
        {
            "barcode": "171115548",
            "dpc": "03013721201",
            "name": "ឌី សុខលីម"
        },
        {
            "barcode": "171115549",
            "dpc": "03013721301",
            "name": "ដោ ដារ៉ាវី"
        },
        {
            "barcode": "171115550",
            "dpc": "03013721401",
            "name": "ទេព សាម៉ុន"
        },
        {
            "barcode": "171115551",
            "dpc": "03013721501",
            "name": "យឹម ប៉ូលីន"
        },
        {
            "barcode": "171115552",
            "dpc": "03013721601",
            "name": "មាន សុវណ្នធីតា"
        },
        {
            "barcode": "171115553",
            "dpc": "03013721701",
            "name": "អ៊ឹត ភឿន"
        },
        {
            "barcode": "171115554",
            "dpc": "03013721801",
            "name": "រុន សុភាព"
        },
        {
            "barcode": "171115555",
            "dpc": "03013721901",
            "name": "សយ ធឿន"
        },
        {
            "barcode": "171115556",
            "dpc": "03013722101",
            "name": "សៀង វ៉ន់ថា"
        },
        {
            "barcode": "171115557",
            "dpc": "03013722201",
            "name": "សៀងអែម មរកត"
        },
        {
            "barcode": "171115558",
            "dpc": "03013722301",
            "name": "សៀង វ៉ាន"
        },
        {
            "barcode": "171115559",
            "dpc": "03013722401",
            "name": "ឈុន សាវុត"
        },
        {
            "barcode": "171115560",
            "dpc": "03013722501",
            "name": "លុក ចាន់រ៉ាស៊ី"
        },
        {
            "barcode": "171115561",
            "dpc": "03013722601",
            "name": "អាង សំអ៊ុន"
        },
        {
            "barcode": "171115562",
            "dpc": "03013722701",
            "name": "អៀង សារឿន"
        },
        {
            "barcode": "171115563",
            "dpc": "03013722801",
            "name": "ខាវ អ៊ាង"
        },
        {
            "barcode": "171115564",
            "dpc": "03013722901",
            "name": "ស សុភ័ក្រ"
        },
        {
            "barcode": "171115565",
            "dpc": "03013723001",
            "name": "ពឿត រិន"
        },
        {
            "barcode": "171115566",
            "dpc": "03013723301",
            "name": "ហាត ម៉ាប់"
        },
        {
            "barcode": "171115567",
            "dpc": "03013723401",
            "name": "ធឿន សុផាន់នី"
        },
        {
            "barcode": "171115568",
            "dpc": "03013723501",
            "name": "ឈុន សាវើន"
        },
        {
            "barcode": "171115569",
            "dpc": "03013723601",
            "name": "ឈុន សាខុម"
        },
        {
            "barcode": "171115570",
            "dpc": "03013723701",
            "name": "ឈុត ប៊ុនលឿត"
        },
        {
            "barcode": "171115571",
            "dpc": "03013723801",
            "name": "សាម ម៉ារិន"
        },
        {
            "barcode": "171115572",
            "dpc": "03013724001",
            "name": "អៀង លួត"
        },
        {
            "barcode": "171115573",
            "dpc": "03013724101",
            "name": "ឈួយ សុធី"
        },
        {
            "barcode": "171115574",
            "dpc": "03013724201",
            "name": "អែម រ៉ាឌី"
        },
        {
            "barcode": "171115575",
            "dpc": "03013724301",
            "name": "លឹម ហូង"
        },
        {
            "barcode": "171115576",
            "dpc": "03013724401",
            "name": "លន គ្រួច"
        },
        {
            "barcode": "171115577",
            "dpc": "03013724501",
            "name": "វ៉ន កំសត់"
        },
        {
            "barcode": "171115578",
            "dpc": "03013724601",
            "name": "មឿន ពៅ"
        },
        {
            "barcode": "171115579",
            "dpc": "03013724701",
            "name": "ង៉ូវ ឌៀប"
        },
        {
            "barcode": "171115580",
            "dpc": "03013724801",
            "name": "ស គ្រីម៉ុត"
        },
        {
            "barcode": "171115581",
            "dpc": "03013724901",
            "name": "យឹម វិចិត្រ"
        },
        {
            "barcode": "171115582",
            "dpc": "03013725001",
            "name": "ឆៃ ប៊ុនយៀន"
        },
        {
            "barcode": "171115583",
            "dpc": "03013725101",
            "name": "ឌឿន ណាវី"
        },
        {
            "barcode": "171115584",
            "dpc": "03013725201",
            "name": "ឌឿន ណារ៉ុង"
        },
        {
            "barcode": "171115585",
            "dpc": "03013725301",
            "name": "រុណ វណ្ណរ៉ា"
        },
        {
            "barcode": "171115586",
            "dpc": "03013725401",
            "name": "អ៊ូរ សាវ៉ុង"
        },
        {
            "barcode": "171115587",
            "dpc": "03013725501",
            "name": "សុខ នរិន្ទ"
        },
        {
            "barcode": "171115588",
            "dpc": "03013725601",
            "name": "សួ គឹមឡាង"
        },
        {
            "barcode": "171115589",
            "dpc": "03013725701",
            "name": "ឆោម រ៉ាន់"
        },
        {
            "barcode": "171115590",
            "dpc": "03013725901",
            "name": "អ៊ុន វណ្ណា"
        },
        {
            "barcode": "171115591",
            "dpc": "03013726001",
            "name": "មុន ហ៊ុំ"
        },
        {
            "barcode": "171115592",
            "dpc": "03013726101",
            "name": "ស្រស់ អូន"
        },
        {
            "barcode": "171115593",
            "dpc": "03013726201",
            "name": "ឆឺត នេត"
        },
        {
            "barcode": "171115594",
            "dpc": "03013726301",
            "name": "ម៉ី ដារ៉ា"
        },
        {
            "barcode": "171115595",
            "dpc": "03013726401",
            "name": "នង បណ្ណា"
        },
        {
            "barcode": "171115596",
            "dpc": "03013726501",
            "name": "ឈួន សំណាង"
        },
        {
            "barcode": "171115597",
            "dpc": "03013726601",
            "name": "គង់ ណារិន"
        },
        {
            "barcode": "171115598",
            "dpc": "03013726701",
            "name": "ភឿត រ៉េត"
        },
        {
            "barcode": "171115599",
            "dpc": "03013726801",
            "name": "យិន តូ"
        },
        {
            "barcode": "171115600",
            "dpc": "03013726901",
            "name": "ឡេង បាន"
        },
        {
            "barcode": "171115601",
            "dpc": "03013727201",
            "name": "សុខ សុផល"
        },
        {
            "barcode": "171115602",
            "dpc": "03013727301",
            "name": "ឈិត បុទុម"
        },
        {
            "barcode": "171115603",
            "dpc": "03013727401",
            "name": "សុង សុភាព"
        },
        {
            "barcode": "171115604",
            "dpc": "03013727701",
            "name": "ម៉ែន ភារុណ"
        },
        {
            "barcode": "171115605",
            "dpc": "03013727801",
            "name": "ប៊ី ម៉េងស៊"
        },
        {
            "barcode": "171115606",
            "dpc": "03013727901",
            "name": "ឌួង វាសនា"
        },
        {
            "barcode": "171115607",
            "dpc": "03013728001",
            "name": "តូច ប៊ុនថន"
        },
        {
            "barcode": "171115608",
            "dpc": "03013728101",
            "name": "យិ ល្មម"
        },
        {
            "barcode": "171115609",
            "dpc": "03013728201",
            "name": "សេង ហឺ"
        },
        {
            "barcode": "171115610",
            "dpc": "03013728301",
            "name": "ស៊ុម វុធ"
        },
        {
            "barcode": "171115611",
            "dpc": "03013728501",
            "name": "ធូគឹម លន់"
        },
        {
            "barcode": "171115612",
            "dpc": "03013728601",
            "name": "ប៉ុល សុភេង"
        },
        {
            "barcode": "171115613",
            "dpc": "03013728701",
            "name": "កៅ ធារ៉ា"
        },
        {
            "barcode": "171115614",
            "dpc": "03013728801",
            "name": "ឌុច វាសនា"
        },
        {
            "barcode": "171115615",
            "dpc": "03013728901",
            "name": "ម៉ៅ ប៊ុនថន"
        },
        {
            "barcode": "171115616",
            "dpc": "03013729001",
            "name": "ម៉ី មន្តា"
        },
        {
            "barcode": "171115617",
            "dpc": "03013729101",
            "name": "ហេង ប៊ុនឡាយ"
        },
        {
            "barcode": "171115618",
            "dpc": "03013729201",
            "name": "ហេង វិចិត្រ"
        },
        {
            "barcode": "171115619",
            "dpc": "03013729301",
            "name": "ស៊ីម ផល្លី"
        },
        {
            "barcode": "171115620",
            "dpc": "03013729401",
            "name": "ឡោ ប៊ុនទួន"
        },
        {
            "barcode": "171115621",
            "dpc": "03013729501",
            "name": "សាក់ ស៊ុន"
        },
        {
            "barcode": "171115622",
            "dpc": "03013729601",
            "name": "ម៉ុត ចន្ជី"
        },
        {
            "barcode": "171115623",
            "dpc": "03013729801",
            "name": "ចក សុខុម"
        },
        {
            "barcode": "171115624",
            "dpc": "03013729901",
            "name": "ឡង វាសនា"
        },
        {
            "barcode": "171115625",
            "dpc": "03013730201",
            "name": "វិញ ហង់"
        },
        {
            "barcode": "171115626",
            "dpc": "03013730301",
            "name": "គា ពេជ្រនេត្រា"
        },
        {
            "barcode": "171115627",
            "dpc": "03013730401",
            "name": "គា មករា"
        },
        {
            "barcode": "171115628",
            "dpc": "03013730501",
            "name": "តន ចន្ទី"
        },
        {
            "barcode": "171115629",
            "dpc": "03013730601",
            "name": "តន ចាន់ទុំ"
        },
        {
            "barcode": "171115630",
            "dpc": "03013730701",
            "name": "តូច ណម"
        },
        {
            "barcode": "171115631",
            "dpc": "03013730801",
            "name": "លូង ស្រីរ៏ត្ន"
        },
        {
            "barcode": "171115632",
            "dpc": "03013730901",
            "name": "តូច តែម"
        },
        {
            "barcode": "171115633",
            "dpc": "03013731001",
            "name": "ឈុំ ប៉ិច"
        },
        {
            "barcode": "171115634",
            "dpc": "03013731101",
            "name": "ផន ផល្លី"
        },
        {
            "barcode": "171115635",
            "dpc": "03013731201",
            "name": "ស្រេង សេងហ៊ា"
        },
        {
            "barcode": "171115636",
            "dpc": "03013731301",
            "name": "ចាន់ សុធី"
        },
        {
            "barcode": "171115637",
            "dpc": "03013731601",
            "name": "ញ៉ែ ឡាយ"
        },
        {
            "barcode": "171115638",
            "dpc": "03013731701",
            "name": "មាន នី"
        },
        {
            "barcode": "171115639",
            "dpc": "03013731801",
            "name": "ឆាន់ កែម"
        },
        {
            "barcode": "171115640",
            "dpc": "03013731901",
            "name": "ឈិត លំអង"
        },
        {
            "barcode": "171115641",
            "dpc": "03013732001",
            "name": "ពេជ្រ ខាន់"
        },
        {
            "barcode": "171115642",
            "dpc": "03013732101",
            "name": "ប៉ែន ស្រីលីន"
        },
        {
            "barcode": "171115643",
            "dpc": "03013732201",
            "name": "អាង រ៉េន"
        },
        {
            "barcode": "171115644",
            "dpc": "03013732301",
            "name": "រ៉េត សត្តារតន៏"
        },
        {
            "barcode": "171115645",
            "dpc": "03013732401",
            "name": "ជិន វីរៈ"
        },
        {
            "barcode": "171115646",
            "dpc": "03013732501",
            "name": "វ៉ើន ផល្លី"
        },
        {
            "barcode": "171115647",
            "dpc": "03013732601",
            "name": "និត សោភា"
        },
        {
            "barcode": "171115648",
            "dpc": "03013732701",
            "name": "ហ៊ីម ប៊ុនទិត្យ"
        },
        {
            "barcode": "171115649",
            "dpc": "03013732801",
            "name": "ងួន រដ្ឋា"
        },
        {
            "barcode": "171115650",
            "dpc": "03013732901",
            "name": "ង៉ែត សាវុធ"
        },
        {
            "barcode": "171115651",
            "dpc": "03013733001",
            "name": "ទេព វុទ្ទី"
        },
        {
            "barcode": "171115652",
            "dpc": "03013733101",
            "name": "សាតា​ ហ៊រ"
        },
        {
            "barcode": "171115653",
            "dpc": "03013733201",
            "name": "ស សារឿន"
        },
        {
            "barcode": "171115654",
            "dpc": "03013733301",
            "name": "អូច និល"
        },
        {
            "barcode": "171115655",
            "dpc": "03013733401",
            "name": "ជា ស្រ៊ុន"
        },
        {
            "barcode": "171115656",
            "dpc": "03013733501",
            "name": "ម៉ៅ ស្រស់"
        },
        {
            "barcode": "171115657",
            "dpc": "03013733701",
            "name": "ងួន អាដាមស៊ី"
        },
        {
            "barcode": "171115658",
            "dpc": "03013733801",
            "name": "លី គឹមសាន្ត"
        },
        {
            "barcode": "171115659",
            "dpc": "03013733901",
            "name": "កែវ សារុំ"
        },
        {
            "barcode": "171115660",
            "dpc": "03013734001",
            "name": "សែម គឹមហ៊ិន"
        },
        {
            "barcode": "171115661",
            "dpc": "03013734101",
            "name": "អន អៀម"
        },
        {
            "barcode": "171115662",
            "dpc": "03013734201",
            "name": "ធឿម ប៊ុនធីម"
        },
        {
            "barcode": "171115663",
            "dpc": "03013734301",
            "name": "ស៊ូ ភល្លិយ៉ា"
        },
        {
            "barcode": "171115664",
            "dpc": "03013734401",
            "name": "ជោក រស្មី"
        },
        {
            "barcode": "171115665",
            "dpc": "03013734501",
            "name": "កុក ឡៃយាន"
        },
        {
            "barcode": "171115666",
            "dpc": "03013734601",
            "name": "រួន វណ្ណះ"
        },
        {
            "barcode": "171115667",
            "dpc": "03013734701",
            "name": "ឡឹក ស្រីលក្ខ័"
        },
        {
            "barcode": "171115668",
            "dpc": "03013734801",
            "name": "ខា ផាន"
        },
        {
            "barcode": "171115669",
            "dpc": "03013734901",
            "name": "សយ សារ៉ាក់"
        },
        {
            "barcode": "171115670",
            "dpc": "03013735001",
            "name": "សូរ​ សុភក្ត្រា"
        },
        {
            "barcode": "171115671",
            "dpc": "03013735101",
            "name": "តង ចិន្តា"
        },
        {
            "barcode": "171115672",
            "dpc": "03013735201",
            "name": "រើន ម៉ាឡា"
        },
        {
            "barcode": "171115673",
            "dpc": "03013735301",
            "name": "អេង សោភា"
        },
        {
            "barcode": "171115674",
            "dpc": "03013735401",
            "name": "អ៊ូ វណ្ណារ៉ា"
        },
        {
            "barcode": "171115675",
            "dpc": "03013735501",
            "name": "ឈឹម ចាន់ចរិយា"
        },
        {
            "barcode": "171115676",
            "dpc": "03013735601",
            "name": "ឈីវ រចនា"
        },
        {
            "barcode": "171115677",
            "dpc": "03013735801",
            "name": "ចាយ អាន"
        },
        {
            "barcode": "171115678",
            "dpc": "03013735901",
            "name": "កែន ឆើយ"
        },
        {
            "barcode": "171115679",
            "dpc": "03013736001",
            "name": "ចង់ រឿត"
        },
        {
            "barcode": "171115680",
            "dpc": "03013736201",
            "name": "ឈឿន ភូ"
        },
        {
            "barcode": "171115681",
            "dpc": "03013736301",
            "name": "ណាន់ ចិន្តា"
        },
        {
            "barcode": "171115682",
            "dpc": "03013736401",
            "name": "តូស សុផុន"
        },
        {
            "barcode": "171115683",
            "dpc": "03013736501",
            "name": "ម៉ន ផាន់ណា"
        },
        {
            "barcode": "171115684",
            "dpc": "03013736601",
            "name": "កែវ ណារត្ន័"
        },
        {
            "barcode": "171115685",
            "dpc": "03013736701",
            "name": "ព្រីង វណ្ណនី"
        },
        {
            "barcode": "171115686",
            "dpc": "03013736901",
            "name": "វ៉ាន់ សឿន"
        },
        {
            "barcode": "171115687",
            "dpc": "03013737001",
            "name": "ខឹង សំណាង"
        },
        {
            "barcode": "171115688",
            "dpc": "03013737101",
            "name": "ម៉ា វ៉ុង"
        },
        {
            "barcode": "171115689",
            "dpc": "03013737201",
            "name": "ឡាច វ៉ុង"
        },
        {
            "barcode": "171115690",
            "dpc": "03013737301",
            "name": "ឆែម សារឿត"
        },
        {
            "barcode": "171115691",
            "dpc": "03013737401",
            "name": "ខេង ពិសី"
        },
        {
            "barcode": "171115692",
            "dpc": "03013737501",
            "name": "ឆឺន ណាន់"
        },
        {
            "barcode": "171115693",
            "dpc": "03013737701",
            "name": "ផុន សាលីម"
        },
        {
            "barcode": "171115694",
            "dpc": "03013737801",
            "name": "ប៉ិច ស៊ីហា"
        },
        {
            "barcode": "171115695",
            "dpc": "03013737901",
            "name": "សោម សុធា"
        },
        {
            "barcode": "171115696",
            "dpc": "03013738001",
            "name": "អុំ សៅរ៉ានី"
        },
        {
            "barcode": "171115697",
            "dpc": "03013738101",
            "name": "សាវ៉ាត ទីណា"
        },
        {
            "barcode": "171115698",
            "dpc": "03013738201",
            "name": "ឆែម រី"
        },
        {
            "barcode": "171115699",
            "dpc": "03013738301",
            "name": "ជា ប៉ូឡូ"
        },
        {
            "barcode": "171115700",
            "dpc": "03013738501",
            "name": "នៅ សេដ្ឋា"
        },
        {
            "barcode": "171115701",
            "dpc": "03013738601",
            "name": "នួម សំរិទ្ទ"
        },
        {
            "barcode": "171115702",
            "dpc": "03013738701",
            "name": "ខុម សុឃឿន"
        },
        {
            "barcode": "171115703",
            "dpc": "03013738801",
            "name": "សុខ ធីតា"
        },
        {
            "barcode": "171115704",
            "dpc": "03013738901",
            "name": "ជឹម ឈន"
        },
        {
            "barcode": "171115705",
            "dpc": "03013739001",
            "name": "អ៊ុន រី"
        },
        {
            "barcode": "171115706",
            "dpc": "03013739101",
            "name": "ជិន រិន"
        },
        {
            "barcode": "171115707",
            "dpc": "03013739301",
            "name": "អៀរ ងឹម"
        },
        {
            "barcode": "171115708",
            "dpc": "03013739401",
            "name": "ហូត​ វិច្ចិកា"
        },
        {
            "barcode": "171115709",
            "dpc": "03013739501",
            "name": "ម៉ាត ម៉ារីយ៉ង"
        },
        {
            "barcode": "171115710",
            "dpc": "03013739601",
            "name": "ជន រី"
        },
        {
            "barcode": "171115711",
            "dpc": "03013739901",
            "name": "ទ្រឿង រដ្ខតេវី"
        },
        {
            "barcode": "171115712",
            "dpc": "03013740001",
            "name": "ប៉ាច ចិន្តា"
        },
        {
            "barcode": "171115713",
            "dpc": "03013740401",
            "name": "ព្រហ្ម ស៊ីនណាត"
        },
        {
            "barcode": "171115714",
            "dpc": "03013740501",
            "name": "ញូង ចំរើន"
        },
        {
            "barcode": "171115715",
            "dpc": "03013740601",
            "name": "វ៉ាន ធៀវ"
        },
        {
            "barcode": "171115716",
            "dpc": "03013740701",
            "name": "នុត នាង ៣"
        },
        {
            "barcode": "171115717",
            "dpc": "03013740801",
            "name": "ង៉ែត វ៉ានថាវ"
        },
        {
            "barcode": "171115718",
            "dpc": "03013740901",
            "name": "គឹម សុខា"
        },
        {
            "barcode": "171115719",
            "dpc": "03013741001",
            "name": "ចាន់ ហួយ"
        },
        {
            "barcode": "171115720",
            "dpc": "03013741101",
            "name": "ណន សុនាថ"
        },
        {
            "barcode": "171115721",
            "dpc": "03013741201",
            "name": "សុខ សុវណ្ណសឿន"
        },
        {
            "barcode": "171115722",
            "dpc": "03013741301",
            "name": "រស វណ្ណរ៉ា"
        },
        {
            "barcode": "171115723",
            "dpc": "03013741401",
            "name": "ផា បាណូ"
        },
        {
            "barcode": "171115724",
            "dpc": "03013741501",
            "name": "រើយ រឿត"
        },
        {
            "barcode": "171115725",
            "dpc": "03013741601",
            "name": "មុត សម្បត្តិ"
        },
        {
            "barcode": "171115726",
            "dpc": "03013741701",
            "name": "ថេត ណាវ៉ាន់នី"
        },
        {
            "barcode": "171115727",
            "dpc": "03013741801",
            "name": "រៀម សុធា"
        },
        {
            "barcode": "171115728",
            "dpc": "03013741901",
            "name": "ម៉ៅ គន្ធា"
        },
        {
            "barcode": "171115729",
            "dpc": "03013742001",
            "name": "ជួន ប៊ុនធួក"
        },
        {
            "barcode": "171115730",
            "dpc": "03013742101",
            "name": "វុត ណៃ"
        },
        {
            "barcode": "171115731",
            "dpc": "03013742201",
            "name": "អឿម ជីម"
        },
        {
            "barcode": "171115732",
            "dpc": "03013742401",
            "name": "មឿន ពុយ"
        },
        {
            "barcode": "171115733",
            "dpc": "03013742501",
            "name": "ហឿង សារ៉ាត់៣"
        },
        {
            "barcode": "171115734",
            "dpc": "03013742601",
            "name": "ទេព សុខុម"
        },
        {
            "barcode": "171115735",
            "dpc": "03013742701",
            "name": "ប៊ុន រិទ្ធលួន"
        },
        {
            "barcode": "171115736",
            "dpc": "03013742801",
            "name": "សូ សាវឿត"
        },
        {
            "barcode": "171115737",
            "dpc": "03013742901",
            "name": "សៀក ស៊ីណយ"
        },
        {
            "barcode": "171115738",
            "dpc": "03013743101",
            "name": "ឆំ ជី"
        },
        {
            "barcode": "171115739",
            "dpc": "03013743201",
            "name": "ទុយ ពៅ"
        },
        {
            "barcode": "171115740",
            "dpc": "03013743401",
            "name": "ទុយ ហាន"
        },
        {
            "barcode": "171115741",
            "dpc": "03013743901",
            "name": "សួ ស្រីលីន"
        },
        {
            "barcode": "171115742",
            "dpc": "03013744001",
            "name": "ផៃ មុន្នី"
        },
        {
            "barcode": "171115743",
            "dpc": "03013744101",
            "name": "កែវ វណ្ណារី"
        },
        {
            "barcode": "171115744",
            "dpc": "03013744201",
            "name": "ម៉ឹង វិត្ត"
        },
        {
            "barcode": "171115745",
            "dpc": "03013744301",
            "name": "ជៀម ទ្រា"
        },
        {
            "barcode": "171115746",
            "dpc": "03013744401",
            "name": "សួន ដារ៉ា"
        },
        {
            "barcode": "171115747",
            "dpc": "03013744501",
            "name": "ហួន ថូយ"
        },
        {
            "barcode": "171115748",
            "dpc": "03013744601",
            "name": "ជៀម ប៉ិ"
        },
        {
            "barcode": "171115749",
            "dpc": "03013744701",
            "name": "មាន ចិន្តាមុន្នី"
        },
        {
            "barcode": "171115750",
            "dpc": "03013744801",
            "name": "នូ ដាលីន"
        },
        {
            "barcode": "171115751",
            "dpc": "03013744901",
            "name": "ពេជ្រ វណ្ណី"
        },
        {
            "barcode": "171115752",
            "dpc": "03013745001",
            "name": "ហេង សុខន"
        },
        {
            "barcode": "171115753",
            "dpc": "03013745101",
            "name": "សឿង ប៊ុនធឿន"
        },
        {
            "barcode": "171115754",
            "dpc": "03013745201",
            "name": "សៀវ យី"
        },
        {
            "barcode": "171115755",
            "dpc": "03013745301",
            "name": "ប៉ែន សោភ័ណ្ឌ"
        },
        {
            "barcode": "171115756",
            "dpc": "03013745401",
            "name": "ប៊ុ​ន ជ្រឹង"
        },
        {
            "barcode": "171115757",
            "dpc": "03013745501",
            "name": "មុំ ចាន់នីតា"
        },
        {
            "barcode": "171115758",
            "dpc": "03013745601",
            "name": "ទុំ លីដា"
        },
        {
            "barcode": "171115759",
            "dpc": "03013745701",
            "name": "តៀត ស្រស់"
        },
        {
            "barcode": "171115760",
            "dpc": "03013745801",
            "name": "សេន បូរី"
        },
        {
            "barcode": "171115761",
            "dpc": "03013745901",
            "name": "ញ៉ែម សារឿន"
        },
        {
            "barcode": "171115762",
            "dpc": "03013746001",
            "name": "រឿន ប៊ុនរ័ត្ន"
        },
        {
            "barcode": "171115763",
            "dpc": "03013746101",
            "name": "ម៉ាត ថាន់"
        },
        {
            "barcode": "171115764",
            "dpc": "03013746301",
            "name": "កុយ ថន"
        },
        {
            "barcode": "171115765",
            "dpc": "03013746401",
            "name": "ឈឹន ចំរើន"
        },
        {
            "barcode": "171115766",
            "dpc": "03013746501",
            "name": "លី កៀត"
        },
        {
            "barcode": "171115767",
            "dpc": "03013746701",
            "name": "សុខ ពឿន"
        },
        {
            "barcode": "171115768",
            "dpc": "03013746901",
            "name": "យ៉េន សាម៉ុន"
        },
        {
            "barcode": "171115769",
            "dpc": "03013747001",
            "name": "ទេព ហុង"
        },
        {
            "barcode": "171115770",
            "dpc": "03013747101",
            "name": "ទូច ចុះ"
        },
        {
            "barcode": "171115771",
            "dpc": "03013747201",
            "name": "យឿន ច្រឹប"
        },
        {
            "barcode": "171115772",
            "dpc": "03013747301",
            "name": "អឿង សុឆាន់"
        },
        {
            "barcode": "171115773",
            "dpc": "03013747401",
            "name": "ឆេង ឆៃលី"
        },
        {
            "barcode": "171115774",
            "dpc": "03013747501",
            "name": "ទី គីមហួង"
        },
        {
            "barcode": "171115775",
            "dpc": "03013747601",
            "name": "ម៉េង ផល្លីន"
        },
        {
            "barcode": "171115776",
            "dpc": "03013747701",
            "name": "ទេស ហុង"
        },
        {
            "barcode": "171115777",
            "dpc": "03013747801",
            "name": "មុំ ចំរើន"
        },
        {
            "barcode": "171115778",
            "dpc": "03013747901",
            "name": "ស៊ីម ស៊ីត្រា"
        },
        {
            "barcode": "171115779",
            "dpc": "03013748001",
            "name": "ជួប ស្រីរត្ន័"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});