

let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=
    [
        {
            "barcode": "171115780",
            "dpc": "03023800101",
            "name": "ហ៊ឹម ម៉ានី"
        },
        {
            "barcode": "171115781",
            "dpc": "03023800401",
            "name": "ប៊ុត ចន្ធី"
        },
        {
            "barcode": "171115782",
            "dpc": "03023800701",
            "name": "ផាត រឿន"
        },
        {
            "barcode": "171115783",
            "dpc": "03023800801",
            "name": "អ៊ឹង ចាន់សុខា"
        },
        {
            "barcode": "171115784",
            "dpc": "03023801101",
            "name": "ហុង ចានរី"
        },
        {
            "barcode": "171115785",
            "dpc": "03023801301",
            "name": "អ៊ឹម ឈត"
        },
        {
            "barcode": "171115786",
            "dpc": "03023801501",
            "name": "អន បូណា"
        },
        {
            "barcode": "171115787",
            "dpc": "03023801601",
            "name": "ហម រដ្ឋ"
        },
        {
            "barcode": "171115788",
            "dpc": "03023801801",
            "name": "ហម លាង"
        },
        {
            "barcode": "171115789",
            "dpc": "03023801901",
            "name": "ហម សមរំ"
        },
        {
            "barcode": "171115790",
            "dpc": "03023802101",
            "name": "រឿង មិត្ត"
        },
        {
            "barcode": "171115791",
            "dpc": "03023802701",
            "name": "ស៊ីម សាខន"
        },
        {
            "barcode": "171115792",
            "dpc": "03023803501",
            "name": "អ៊ុក មន្ថា"
        },
        {
            "barcode": "171115793",
            "dpc": "03023803601",
            "name": "សាយ អួម"
        },
        {
            "barcode": "171115794",
            "dpc": "03023803701",
            "name": "លឹម នាង"
        },
        {
            "barcode": "171115795",
            "dpc": "03023803801",
            "name": "ហួត រី"
        },
        {
            "barcode": "171115796",
            "dpc": "03023803901",
            "name": "ស្រី សមសិទ្ធ"
        },
        {
            "barcode": "171115797",
            "dpc": "03023804201",
            "name": "ហាក់ លី"
        },
        {
            "barcode": "171115798",
            "dpc": "03023804301",
            "name": "សេង ថា"
        },
        {
            "barcode": "171115799",
            "dpc": "03023804501",
            "name": "កូយ វិបុល"
        },
        {
            "barcode": "171115800",
            "dpc": "03023804701",
            "name": "ឈិញ លយ"
        },
        {
            "barcode": "171115801",
            "dpc": "03023804801",
            "name": "រិន ភួង"
        },
        {
            "barcode": "171115802",
            "dpc": "03023805101",
            "name": "យ៉ន វុទ្ធី"
        },
        {
            "barcode": "171115803",
            "dpc": "03023805301",
            "name": "អ៊ុង កាចរ"
        },
        {
            "barcode": "171115804",
            "dpc": "03023805501",
            "name": "ណម លីន"
        },
        {
            "barcode": "171115805",
            "dpc": "03023805601",
            "name": "ចេង អូន"
        },
        {
            "barcode": "171115806",
            "dpc": "03023805701",
            "name": "មុត សោភ័ណ្ឌ"
        },
        {
            "barcode": "171115807",
            "dpc": "03023805801",
            "name": "នួ បូរី"
        },
        {
            "barcode": "171115808",
            "dpc": "03023805901",
            "name": "ឡុញ សុវណ្ណ"
        },
        {
            "barcode": "171115809",
            "dpc": "03023806101",
            "name": "វុន ហ៊ូវ"
        },
        {
            "barcode": "171115810",
            "dpc": "03023806301",
            "name": "ឈឹម គីមស្រីម"
        },
        {
            "barcode": "171115811",
            "dpc": "03023806501",
            "name": "ភិន ចាន់សេដា"
        },
        {
            "barcode": "171115812",
            "dpc": "03023806601",
            "name": "នួន វៃ"
        },
        {
            "barcode": "171115813",
            "dpc": "03023806901",
            "name": "គង់ ហេង"
        },
        {
            "barcode": "171115814",
            "dpc": "03023807101",
            "name": "រិន វ៉ាន់ថា"
        },
        {
            "barcode": "171115815",
            "dpc": "03023807301",
            "name": "សយ សុគន្ធា"
        },
        {
            "barcode": "171115816",
            "dpc": "03023807401",
            "name": "យី ហេង"
        },
        {
            "barcode": "171115817",
            "dpc": "03023807601",
            "name": "ផន សុភា"
        },
        {
            "barcode": "171115818",
            "dpc": "03023807701",
            "name": "ផន ផា"
        },
        {
            "barcode": "171115819",
            "dpc": "03023808001",
            "name": "អ៊ុំ ប៊ុនធឿន"
        },
        {
            "barcode": "171115820",
            "dpc": "03023808201",
            "name": "ម៉ៅ មឿន"
        },
        {
            "barcode": "171115821",
            "dpc": "03023808401",
            "name": "ព្រហ្ម វិចិត្រ"
        },
        {
            "barcode": "171115822",
            "dpc": "03023808601",
            "name": "លី ប៊ុនឡេង"
        },
        {
            "barcode": "171115823",
            "dpc": "03023809201",
            "name": "ឡុច រ៉ា"
        },
        {
            "barcode": "171115824",
            "dpc": "03023809301",
            "name": "សាប់ សុត"
        },
        {
            "barcode": "171115825",
            "dpc": "03023809401",
            "name": "យិប ចំរើន"
        },
        {
            "barcode": "171115826",
            "dpc": "03023809701",
            "name": "ប្រម សឺន"
        },
        {
            "barcode": "171115827",
            "dpc": "03023809801",
            "name": "ស៊ឹម ចន្ធី"
        },
        {
            "barcode": "171115828",
            "dpc": "03023810001",
            "name": "សេង ហ៊ូវ"
        },
        {
            "barcode": "171115829",
            "dpc": "03023810101",
            "name": "អ៊ន ឌី"
        },
        {
            "barcode": "171115830",
            "dpc": "03023810201",
            "name": "អៀង សាខន"
        },
        {
            "barcode": "171115831",
            "dpc": "03023810401",
            "name": "លី ថារ៉ា"
        },
        {
            "barcode": "171115832",
            "dpc": "03023810501",
            "name": "រី រ៉ា"
        },
        {
            "barcode": "171115833",
            "dpc": "03023810601",
            "name": "ថៃ សាវី"
        },
        {
            "barcode": "171115834",
            "dpc": "03023810801",
            "name": "ឡុង សារុន"
        },
        {
            "barcode": "171115835",
            "dpc": "03023810901",
            "name": "យ៉ាន រ៉ហ្វាន់"
        },
        {
            "barcode": "171115836",
            "dpc": "03023811001",
            "name": "សើរ និល"
        },
        {
            "barcode": "171115837",
            "dpc": "03023811101",
            "name": "ស៊ត ម៉ាត់ឃីត"
        },
        {
            "barcode": "171115838",
            "dpc": "03023811201",
            "name": "សើរ មីន"
        },
        {
            "barcode": "171115839",
            "dpc": "03023811401",
            "name": "ណុស ជា"
        },
        {
            "barcode": "171115840",
            "dpc": "03023811501",
            "name": "រ៉ូន ម៉ៅ"
        },
        {
            "barcode": "171115841",
            "dpc": "03023811601",
            "name": "ខឹម ភាព"
        },
        {
            "barcode": "171115842",
            "dpc": "03023811701",
            "name": "ឡុង ស៊ុនថារ៉ា"
        },
        {
            "barcode": "171115843",
            "dpc": "03023811901",
            "name": "យី ម៉ាតស៊ត"
        },
        {
            "barcode": "171115844",
            "dpc": "03023812001",
            "name": "ឡោះ រី"
        },
        {
            "barcode": "171115845",
            "dpc": "03023812101",
            "name": "ហា សាន់"
        },
        {
            "barcode": "171115846",
            "dpc": "03023812201",
            "name": "ហឿង សុឃាង"
        },
        {
            "barcode": "171115847",
            "dpc": "03023812401",
            "name": "វឿត ដារ៉ា"
        },
        {
            "barcode": "171115848",
            "dpc": "03023812501",
            "name": "វឿត ណាសៀត"
        },
        {
            "barcode": "171115849",
            "dpc": "03023812601",
            "name": "អ៊ុច វណ្ណះ"
        },
        {
            "barcode": "171115850",
            "dpc": "03023812701",
            "name": "ម៉ើ ប៉ែល"
        },
        {
            "barcode": "171115851",
            "dpc": "03023812801",
            "name": "ចៅ សម្បត្តិ"
        },
        {
            "barcode": "171115852",
            "dpc": "03023812901",
            "name": "សន រិត"
        },
        {
            "barcode": "171115853",
            "dpc": "03023813401",
            "name": "ទ្រី ប៊ុនតុង"
        },
        {
            "barcode": "171115854",
            "dpc": "03023813501",
            "name": "វណ្ណ សំអាត"
        },
        {
            "barcode": "171115855",
            "dpc": "03023813601",
            "name": "រិទ្ធិ សម្ភា"
        },
        {
            "barcode": "171115856",
            "dpc": "03023813801",
            "name": "វុធ វណ្ណា"
        },
        {
            "barcode": "171115857",
            "dpc": "03023814001",
            "name": "ញ៉ែម ម៉េងគា១"
        },
        {
            "barcode": "171115858",
            "dpc": "03023814101",
            "name": "ធិន ទី"
        },
        {
            "barcode": "171115859",
            "dpc": "03023814301",
            "name": "ភាជ សឿត"
        },
        {
            "barcode": "171115860",
            "dpc": "03023814401",
            "name": "ផ្លុង ចំរើន១"
        },
        {
            "barcode": "171115861",
            "dpc": "03023814501",
            "name": "ព្រំ មន្និរិទ្ធ"
        },
        {
            "barcode": "171115862",
            "dpc": "03023814701",
            "name": "ជ័យ សេងហាប់"
        },
        {
            "barcode": "171115863",
            "dpc": "03023814801",
            "name": "ហួន បណ្ឌិត"
        },
        {
            "barcode": "171115864",
            "dpc": "03023814901",
            "name": "តាន់ គឹមទៀង"
        },
        {
            "barcode": "171115865",
            "dpc": "03023815001",
            "name": "កៀន យឿង"
        },
        {
            "barcode": "171115866",
            "dpc": "03023815101",
            "name": "ម៉ក់ សុវណ្ណ"
        },
        {
            "barcode": "171115867",
            "dpc": "03023815201",
            "name": "ជីង ម៉ូលីរតន៏"
        },
        {
            "barcode": "171115868",
            "dpc": "03023815801",
            "name": "ឈូក ចំរើនរត័្ន"
        },
        {
            "barcode": "171115869",
            "dpc": "03023815901",
            "name": "ព្រេង ចិន្តា"
        },
        {
            "barcode": "171115870",
            "dpc": "03023816001",
            "name": "ប្រេង ប្រសិទ្ធ"
        },
        {
            "barcode": "171115871",
            "dpc": "03023816101",
            "name": "ចាប សាមឿន"
        },
        {
            "barcode": "171115872",
            "dpc": "03023816201",
            "name": "សុខ វុទ្ធី"
        },
        {
            "barcode": "171115873",
            "dpc": "03023816301",
            "name": "សៀង វន្នី"
        },
        {
            "barcode": "171115874",
            "dpc": "03023816401",
            "name": "ញ៉ែម មេងគាង២"
        },
        {
            "barcode": "171115875",
            "dpc": "03023816601",
            "name": "ឌឿន សារី"
        },
        {
            "barcode": "171115876",
            "dpc": "03023816901",
            "name": "អុំ សារ៉ឹម"
        },
        {
            "barcode": "171115877",
            "dpc": "03023817001",
            "name": "អ៊ុំ ជីម"
        },
        {
            "barcode": "171115878",
            "dpc": "03023817101",
            "name": "រស់ គឹមឡេង"
        },
        {
            "barcode": "171115879",
            "dpc": "03023817501",
            "name": "ណុប សុខុនណី"
        },
        {
            "barcode": "171115880",
            "dpc": "03023817601",
            "name": "ណុប សុខុន"
        },
        {
            "barcode": "171115881",
            "dpc": "03023817701",
            "name": "នង ហូវ"
        },
        {
            "barcode": "171115882",
            "dpc": "03023817801",
            "name": "ជឿន ហេង"
        },
        {
            "barcode": "171115883",
            "dpc": "03023818001",
            "name": "ហម សុវណ្ណ"
        },
        {
            "barcode": "171115884",
            "dpc": "03023818501",
            "name": "ឡាក សុភី"
        },
        {
            "barcode": "171115885",
            "dpc": "03023818601",
            "name": "អ៊ឹង ម៉ាលី"
        },
        {
            "barcode": "171115886",
            "dpc": "03023818701",
            "name": "ឌុក បូរ៉ុម"
        },
        {
            "barcode": "171115887",
            "dpc": "03023818801",
            "name": "សុខ ភូសិត"
        },
        {
            "barcode": "171115888",
            "dpc": "03023818901",
            "name": "ផេង ចំរិត"
        },
        {
            "barcode": "171115889",
            "dpc": "03023819201",
            "name": "មឿន រូម"
        },
        {
            "barcode": "171115890",
            "dpc": "03023819301",
            "name": "សួន សារិន"
        },
        {
            "barcode": "171115891",
            "dpc": "03023819401",
            "name": "ហៀន ណារី"
        },
        {
            "barcode": "171115892",
            "dpc": "03023819801",
            "name": "រឿត សាវ៉ើន"
        },
        {
            "barcode": "171115893",
            "dpc": "03023819901",
            "name": "ពេជ្រ ចន្ធី"
        },
        {
            "barcode": "171115894",
            "dpc": "03023820001",
            "name": "វែង សុភ័ណ"
        },
        {
            "barcode": "171115895",
            "dpc": "03023820701",
            "name": "ធិប ច្រិប"
        },
        {
            "barcode": "171115896",
            "dpc": "03023820801",
            "name": "ឌី រិត"
        },
        {
            "barcode": "171115897",
            "dpc": "03023820901",
            "name": "ម៉ូ ចាន់ថង"
        },
        {
            "barcode": "171115898",
            "dpc": "03023821201",
            "name": "ផា ចំរើន"
        },
        {
            "barcode": "171115899",
            "dpc": "03023821301",
            "name": "ផ្លុង សុខ"
        },
        {
            "barcode": "171115900",
            "dpc": "03023821601",
            "name": "ទូច ប៊ុនអឿត"
        },
        {
            "barcode": "171115901",
            "dpc": "03023821801",
            "name": "នៅ សារឿង"
        },
        {
            "barcode": "171115902",
            "dpc": "03023821901",
            "name": "ជា សារ៉ាត់"
        },
        {
            "barcode": "171115903",
            "dpc": "03023822301",
            "name": "យ៉ាន់ លង"
        },
        {
            "barcode": "171115904",
            "dpc": "03023822401",
            "name": "យ៉ាន់ ជីម៉ុយ"
        },
        {
            "barcode": "171115905",
            "dpc": "03023822501",
            "name": "មុត សំណាង"
        },
        {
            "barcode": "171115906",
            "dpc": "03023822701",
            "name": "ធា ភីរម្យ"
        },
        {
            "barcode": "171115907",
            "dpc": "03023823101",
            "name": "អ៊ុន សឿង"
        },
        {
            "barcode": "171115908",
            "dpc": "03023823201",
            "name": "សុខ ភឿន"
        },
        {
            "barcode": "171115909",
            "dpc": "03023823601",
            "name": "សែម ប៊ុនសេង"
        },
        {
            "barcode": "171115910",
            "dpc": "03023823701",
            "name": "យឿន ជឿង"
        },
        {
            "barcode": "171115911",
            "dpc": "03023823801",
            "name": "ហ៊ាង ម៉ាលីន"
        },
        {
            "barcode": "171115912",
            "dpc": "03023823901",
            "name": "ជា សវី"
        },
        {
            "barcode": "171115913",
            "dpc": "03023824101",
            "name": "មឿន បូរី"
        },
        {
            "barcode": "171115914",
            "dpc": "03023824201",
            "name": "ខ្លូត ប៉ាន"
        },
        {
            "barcode": "171115915",
            "dpc": "03023824301",
            "name": "ប៊ុន គន្ធា"
        },
        {
            "barcode": "171115916",
            "dpc": "03023824401",
            "name": "ប៉ិច ឃន"
        },
        {
            "barcode": "171115917",
            "dpc": "03023824501",
            "name": "ពុធ ទ្រី"
        },
        {
            "barcode": "171115918",
            "dpc": "03023824601",
            "name": "អ៊ុំ សាវែន"
        },
        {
            "barcode": "171115919",
            "dpc": "03023824701",
            "name": "ខ្លួត ផាន់ណា"
        },
        {
            "barcode": "171115920",
            "dpc": "03023824901",
            "name": "ប៉ិ រុន"
        },
        {
            "barcode": "171115921",
            "dpc": "03023825301",
            "name": "លាង​ ហេង"
        },
        {
            "barcode": "171115922",
            "dpc": "03023825601",
            "name": "មឿន ឡា"
        },
        {
            "barcode": "171115923",
            "dpc": "03023825701",
            "name": "មឿន លឿត"
        },
        {
            "barcode": "171115924",
            "dpc": "03023825801",
            "name": "វ៉ន ឈ្នាង"
        },
        {
            "barcode": "171115925",
            "dpc": "03023826001",
            "name": "នូ សុខុម"
        },
        {
            "barcode": "171115926",
            "dpc": "03023826401",
            "name": "រស់ អឿន"
        },
        {
            "barcode": "171115927",
            "dpc": "03023826501",
            "name": "កុយ ចំរើន"
        },
        {
            "barcode": "171115928",
            "dpc": "03023826601",
            "name": "គឹម ផល្លា"
        },
        {
            "barcode": "171115929",
            "dpc": "03023826701",
            "name": "កុយ សាន"
        },
        {
            "barcode": "171115930",
            "dpc": "03023826801",
            "name": "ព្រំ វី"
        },
        {
            "barcode": "171115931",
            "dpc": "03023826901",
            "name": "ឌី ស៊ីណា"
        },
        {
            "barcode": "171115932",
            "dpc": "03023827201",
            "name": "អ៊ុច ពៅ"
        },
        {
            "barcode": "171115933",
            "dpc": "03023827401",
            "name": "ប៉ិច សុខុម"
        },
        {
            "barcode": "171115934",
            "dpc": "03023827501",
            "name": "រឿន កែប"
        },
        {
            "barcode": "171115935",
            "dpc": "03023827601",
            "name": "យស អុន"
        },
        {
            "barcode": "171115936",
            "dpc": "03023827701",
            "name": "លាង ផាងហេង"
        },
        {
            "barcode": "171115937",
            "dpc": "03023828201",
            "name": "ព្រាប សឿម"
        },
        {
            "barcode": "171115938",
            "dpc": "03023828301",
            "name": "វ៉ឹង សុផុស"
        },
        {
            "barcode": "171115939",
            "dpc": "03023828401",
            "name": "វ៉ឹង សាន"
        },
        {
            "barcode": "171115940",
            "dpc": "03023828501",
            "name": "វ៉ឹង វ៉ាន់ស៊ីន"
        },
        {
            "barcode": "171115941",
            "dpc": "03023828801",
            "name": "ថុក វុទ្ធា"
        },
        {
            "barcode": "171115942",
            "dpc": "03023828901",
            "name": "ផៃ មិថុនា"
        },
        {
            "barcode": "171115943",
            "dpc": "03023829101",
            "name": "ហេ​ វ៉ា"
        },
        {
            "barcode": "171115944",
            "dpc": "03023829201",
            "name": "ភិន សរ៉េត"
        },
        {
            "barcode": "171115945",
            "dpc": "03023829301",
            "name": "លោត ស្រួន"
        },
        {
            "barcode": "171115946",
            "dpc": "03023829701",
            "name": "សយ លឿប"
        },
        {
            "barcode": "171115947",
            "dpc": "03023829901",
            "name": "សា ចន្ថា"
        },
        {
            "barcode": "171115948",
            "dpc": "03023830001",
            "name": "យូ ស៊ីភឿន"
        },
        {
            "barcode": "171115949",
            "dpc": "03023830201",
            "name": "សុំ ចាន់សេរី"
        },
        {
            "barcode": "171115950",
            "dpc": "03023830501",
            "name": "ភាជ ម៉ិ"
        },
        {
            "barcode": "171115951",
            "dpc": "03023830601",
            "name": "សេង មឿន"
        },
        {
            "barcode": "171115952",
            "dpc": "03023830701",
            "name": "លី វណ្ណី"
        },
        {
            "barcode": "171115953",
            "dpc": "03023831001",
            "name": "យ៉ា ប៊ុនរឿន"
        },
        {
            "barcode": "171115954",
            "dpc": "03023831101",
            "name": "ខ្លូត នី"
        },
        {
            "barcode": "171115955",
            "dpc": "03023831401",
            "name": "មឿន លក"
        },
        {
            "barcode": "171115956",
            "dpc": "03023831501",
            "name": "យ៉ាត វ័យ"
        },
        {
            "barcode": "171115957",
            "dpc": "03023831701",
            "name": "សឿម គឹមអេង"
        },
        {
            "barcode": "171115958",
            "dpc": "03023831801",
            "name": "ឡុច សារ៉េត"
        },
        {
            "barcode": "171115959",
            "dpc": "03023831901",
            "name": "ផ្លុង សាមិន"
        },
        {
            "barcode": "171115960",
            "dpc": "03023832101",
            "name": "ឡាំង ឃន"
        },
        {
            "barcode": "171115961",
            "dpc": "03023832401",
            "name": "វ៉ាន់ ពន្លីរិទ្ធ"
        },
        {
            "barcode": "171115962",
            "dpc": "03023832601",
            "name": "គង់ វ៉ាន់ឌី"
        },
        {
            "barcode": "171115963",
            "dpc": "03023832701",
            "name": "ទុយ ឆៃយ៉ា"
        },
        {
            "barcode": "171115964",
            "dpc": "03023832801",
            "name": "ស៊ាន សាវឿត"
        },
        {
            "barcode": "171115965",
            "dpc": "03023833001",
            "name": "ឈុត យ៉ាត់"
        },
        {
            "barcode": "171115966",
            "dpc": "03023833201",
            "name": "ផាត់ សុភាព"
        },
        {
            "barcode": "171115967",
            "dpc": "03023833301",
            "name": "ហែម សិលា"
        },
        {
            "barcode": "171115968",
            "dpc": "03023833401",
            "name": "សៅ សឺន"
        },
        {
            "barcode": "171115969",
            "dpc": "03023833701",
            "name": "ខូវ ស៊ាងវី"
        },
        {
            "barcode": "171115970",
            "dpc": "03023833801",
            "name": "ស៊ន កុក"
        },
        {
            "barcode": "171115971",
            "dpc": "03023833901",
            "name": "ហ៊ វ៉ា"
        },
        {
            "barcode": "171115972",
            "dpc": "03023834001",
            "name": "លី អាន"
        },
        {
            "barcode": "171115973",
            "dpc": "03023834201",
            "name": "ញ៉េប អៀក"
        },
        {
            "barcode": "171115974",
            "dpc": "03023834401",
            "name": "ទូច សំអឿន"
        },
        {
            "barcode": "171115975",
            "dpc": "03023834501",
            "name": "ទូច អឿម"
        },
        {
            "barcode": "171115976",
            "dpc": "03023834601",
            "name": "ហួន កក្កដា"
        },
        {
            "barcode": "171115977",
            "dpc": "03023834701",
            "name": "សៀង ថូ"
        },
        {
            "barcode": "171115978",
            "dpc": "03023834901",
            "name": "សុច សាង"
        },
        {
            "barcode": "171115979",
            "dpc": "03023835101",
            "name": "ក្រាន់ ដូប"
        },
        {
            "barcode": "171115980",
            "dpc": "03023835301",
            "name": "ប្រិម ភឿត"
        },
        {
            "barcode": "171115981",
            "dpc": "03023835401",
            "name": "ប្រិម សារិន"
        },
        {
            "barcode": "171115982",
            "dpc": "03023835501",
            "name": "ប្រិម លេង"
        },
        {
            "barcode": "171115983",
            "dpc": "03023835601",
            "name": "ដុំ រុំ"
        },
        {
            "barcode": "171115984",
            "dpc": "03023835701",
            "name": "ឈន ផល្លី"
        },
        {
            "barcode": "171115985",
            "dpc": "03023835901",
            "name": "ស៊ុយ ជិត"
        },
        {
            "barcode": "171115986",
            "dpc": "03023836001",
            "name": "អ៊ុច យឿត"
        },
        {
            "barcode": "171115987",
            "dpc": "03023836201",
            "name": "ឈឿន ដារ៉ា"
        },
        {
            "barcode": "171115988",
            "dpc": "03023836901",
            "name": "ប៉ែន នាង"
        },
        {
            "barcode": "171115989",
            "dpc": "03023837001",
            "name": "លៀង សំអុល"
        },
        {
            "barcode": "171115990",
            "dpc": "03023837101",
            "name": "សឿន សួម"
        },
        {
            "barcode": "171115991",
            "dpc": "03023837301",
            "name": "និត ចាន់រ៉ា"
        },
        {
            "barcode": "171115992",
            "dpc": "03023837401",
            "name": "នេតា លៀង"
        },
        {
            "barcode": "171115993",
            "dpc": "03023837601",
            "name": "ភាព សុភ័ក្រ"
        },
        {
            "barcode": "171115994",
            "dpc": "03023838001",
            "name": "ឆន យ៉េត"
        },
        {
            "barcode": "171115995",
            "dpc": "03023838101",
            "name": "ធឿង ឈឿត"
        },
        {
            "barcode": "171115996",
            "dpc": "03023838201",
            "name": "លៀប ជឿត"
        },
        {
            "barcode": "171115997",
            "dpc": "03023838601",
            "name": "វិន រៀម"
        },
        {
            "barcode": "171115998",
            "dpc": "03023839101",
            "name": "ប៊ិច ឡូញ"
        },
        {
            "barcode": "171115999",
            "dpc": "03023839201",
            "name": "ម៉ុត វុន"
        },
        {
            "barcode": "171116000",
            "dpc": "03023839301",
            "name": "ម៉ុត សំណាង"
        },
        {
            "barcode": "171116001",
            "dpc": "03023839401",
            "name": "បេង ហឿត"
        },
        {
            "barcode": "171116002",
            "dpc": "03023839801",
            "name": "ខុម ធឿន"
        },
        {
            "barcode": "171116003",
            "dpc": "03023839901",
            "name": "រីម ម៉ាត"
        },
        {
            "barcode": "171116004",
            "dpc": "03023840101",
            "name": "ផេង សិទ្ធី"
        },
        {
            "barcode": "171116005",
            "dpc": "03023840301",
            "name": "មឿន សាវន"
        },
        {
            "barcode": "171116006",
            "dpc": "03023840401",
            "name": "យឹម ហ៊ីង"
        },
        {
            "barcode": "171116007",
            "dpc": "03023840501",
            "name": "លីណា"
        },
        {
            "barcode": "171116008",
            "dpc": "03023840601",
            "name": "លីម លីណា"
        },
        {
            "barcode": "171116009",
            "dpc": "03023840701",
            "name": "រិន ដារិត"
        },
        {
            "barcode": "171116010",
            "dpc": "03023841001",
            "name": "សាន ស៊ា"
        },
        {
            "barcode": "171116011",
            "dpc": "03023841301",
            "name": "គូ សាឡន"
        },
        {
            "barcode": "171116012",
            "dpc": "03023841701",
            "name": "ណង ចំណាន"
        },
        {
            "barcode": "171116013",
            "dpc": "03023842101",
            "name": "ឆេង លឿត"
        },
        {
            "barcode": "171116014",
            "dpc": "03023842201",
            "name": "មុត វាសនា"
        },
        {
            "barcode": "171116015",
            "dpc": "03023842501",
            "name": "ហួង សំណាង"
        },
        {
            "barcode": "171116016",
            "dpc": "03023842601",
            "name": "ឃឹម យឿប"
        },
        {
            "barcode": "171116017",
            "dpc": "03023842701",
            "name": "ឡុង លឿង"
        },
        {
            "barcode": "171116018",
            "dpc": "03023842801",
            "name": "ហួន ហ៊ត"
        },
        {
            "barcode": "171116019",
            "dpc": "03023843001",
            "name": "រឿម ស៊ន"
        },
        {
            "barcode": "171116020",
            "dpc": "03023843101",
            "name": "យ៉ាន់ សេរីរត្ន័"
        },
        {
            "barcode": "171116021",
            "dpc": "03023843301",
            "name": "តុល អួន"
        },
        {
            "barcode": "171116022",
            "dpc": "03023843501",
            "name": "អ៊ឹង សឿត"
        },
        {
            "barcode": "171116023",
            "dpc": "03023843601",
            "name": "ចាន់ សារ៉េន"
        },
        {
            "barcode": "171116024",
            "dpc": "03023843701",
            "name": "ជី សៀន"
        },
        {
            "barcode": "171116025",
            "dpc": "03023844001",
            "name": "វុន សាវើន"
        },
        {
            "barcode": "171116026",
            "dpc": "03023844101",
            "name": "ផាត អាន"
        },
        {
            "barcode": "171116027",
            "dpc": "03023844201",
            "name": "លឹម សុខយ៉ែម"
        },
        {
            "barcode": "171116028",
            "dpc": "03023845201",
            "name": "យួម វ៉ាគី"
        },
        {
            "barcode": "171116029",
            "dpc": "03023845301",
            "name": "សែម ជន"
        },
        {
            "barcode": "171116030",
            "dpc": "03023845401",
            "name": "ណែម រិទ្ទ"
        },
        {
            "barcode": "171116031",
            "dpc": "03023845501",
            "name": "យ៉ែម ឈឿប"
        },
        {
            "barcode": "171116032",
            "dpc": "03023845601",
            "name": "តាន់ យូរ៉ា"
        },
        {
            "barcode": "171116033",
            "dpc": "03023845801",
            "name": "ឈាន គឹមម្លិះ"
        },
        {
            "barcode": "171116034",
            "dpc": "03023847801",
            "name": "សុង ម៉ុន"
        },
        {
            "barcode": "171116035",
            "dpc": "03023848001",
            "name": "ឈឿង សុធីម"
        },
        {
            "barcode": "171116036",
            "dpc": "03023800301",
            "name": "ម៉ក់ ម៉េងហុង"
        },
        {
            "barcode": "171116037",
            "dpc": "03023800601",
            "name": "ផាត់ ម៉ៅ"
        },
        {
            "barcode": "171116038",
            "dpc": "03023800901",
            "name": "អ៊ាត ណារ៉ែន"
        },
        {
            "barcode": "171116039",
            "dpc": "03023801001",
            "name": "ហ៊ឹម ប៉េងគា"
        },
        {
            "barcode": "171116040",
            "dpc": "03023801701",
            "name": "ឡុញ សុវណ្ណ"
        },
        {
            "barcode": "171116041",
            "dpc": "03023802001",
            "name": "រើន សាវុធ"
        },
        {
            "barcode": "171116042",
            "dpc": "03023802201",
            "name": "កែវ លឿត"
        },
        {
            "barcode": "171116043",
            "dpc": "03023802801",
            "name": "ផេង សុខហេង"
        },
        {
            "barcode": "171116044",
            "dpc": "03023803001",
            "name": "ភឹម ថង"
        },
        {
            "barcode": "171116045",
            "dpc": "03023803301",
            "name": "ផុង ឆឹង"
        },
        {
            "barcode": "171116046",
            "dpc": "03023803401",
            "name": "ឡេង ព្រំមាល័យ"
        },
        {
            "barcode": "171116047",
            "dpc": "03023804401",
            "name": "យ៉ន ពៅ"
        },
        {
            "barcode": "171116048",
            "dpc": "03023804601",
            "name": "លី វណ្ណា"
        },
        {
            "barcode": "171116049",
            "dpc": "03023805001",
            "name": "តិច សារ៉ាវុធ"
        },
        {
            "barcode": "171116050",
            "dpc": "03023807201",
            "name": "អ៊ុង ចាន់ផល"
        },
        {
            "barcode": "171116051",
            "dpc": "03023807501",
            "name": "ផាត សុផល"
        },
        {
            "barcode": "171116052",
            "dpc": "03023807801",
            "name": "បូរ សក្កិវណ្ណា"
        },
        {
            "barcode": "171116053",
            "dpc": "03023807901",
            "name": "ថុក ប៊ុនរីវ"
        },
        {
            "barcode": "171116054",
            "dpc": "03023808101",
            "name": "យី អ៊ី"
        },
        {
            "barcode": "171116055",
            "dpc": "03023808701",
            "name": "សុត លាប"
        },
        {
            "barcode": "171116056",
            "dpc": "03023808801",
            "name": "ប្រាក់ ស្រ៊ូ"
        },
        {
            "barcode": "171116057",
            "dpc": "03023809501",
            "name": "យិប ដាវី"
        },
        {
            "barcode": "171116058",
            "dpc": "03023809601",
            "name": "គង់ គន្ធា"
        },
        {
            "barcode": "171116059",
            "dpc": "03023812301",
            "name": "ម៉ាត់ ស្មានឯល"
        },
        {
            "barcode": "171116060",
            "dpc": "03023813001",
            "name": "សើ គុជ"
        },
        {
            "barcode": "171116061",
            "dpc": "03023813701",
            "name": "ណាង លីណា"
        },
        {
            "barcode": "171116062",
            "dpc": "03023815301",
            "name": "នៅ ចិនរ៉ាត់"
        },
        {
            "barcode": "171116063",
            "dpc": "03023815501",
            "name": "សឿន សុរិទ្ធ"
        },
        {
            "barcode": "171116064",
            "dpc": "03023817401",
            "name": "នង ចិន្តា"
        },
        {
            "barcode": "171116065",
            "dpc": "03023819101",
            "name": "ដិប សារឿន"
        },
        {
            "barcode": "171116066",
            "dpc": "03023819501",
            "name": "ហៀន ណារ៉ាត"
        },
        {
            "barcode": "171116067",
            "dpc": "03023820201",
            "name": "ខ្លូត ចន្ថា"
        },
        {
            "barcode": "171116068",
            "dpc": "03023821701",
            "name": "ម៉ូ សឿម"
        },
        {
            "barcode": "171116069",
            "dpc": "03023822101",
            "name": "វ៉ាន់ សុភា"
        },
        {
            "barcode": "171116070",
            "dpc": "03023823501",
            "name": "សំ ចាន់រិទ្ធ"
        },
        {
            "barcode": "171116071",
            "dpc": "03023824001",
            "name": "ហេង ដាលីស"
        },
        {
            "barcode": "171116072",
            "dpc": "03023825901",
            "name": "រ៉ា ធីណា"
        },
        {
            "barcode": "171116073",
            "dpc": "03023826301",
            "name": "ព្រេង ដារ៉ា"
        },
        {
            "barcode": "171116074",
            "dpc": "03023827001",
            "name": "ប៉ិច ទូច"
        },
        {
            "barcode": "171116075",
            "dpc": "03023827301",
            "name": "ជា សុគន្ធា"
        },
        {
            "barcode": "171116076",
            "dpc": "03023827801",
            "name": "ដៅ សាំងអ៊ាត"
        },
        {
            "barcode": "171116077",
            "dpc": "03023829801",
            "name": "តឹង សុវណ្ណ"
        },
        {
            "barcode": "171116078",
            "dpc": "03023830301",
            "name": "ភាជ ចំរើន"
        },
        {
            "barcode": "171116079",
            "dpc": "03023832301",
            "name": "ឆន រ៉េត"
        },
        {
            "barcode": "171116080",
            "dpc": "03023832901",
            "name": "ដាំ ចំរើន"
        },
        {
            "barcode": "171116081",
            "dpc": "03023833101",
            "name": "នៅ សំណាង"
        },
        {
            "barcode": "171116082",
            "dpc": "03023833601",
            "name": "ទៀង សុផាន់ណា"
        },
        {
            "barcode": "171116083",
            "dpc": "03023837701",
            "name": "ជឹម សាវេត"
        },
        {
            "barcode": "171116084",
            "dpc": "03023838901",
            "name": "គឹម គឹមជឿន"
        },
        {
            "barcode": "171116085",
            "dpc": "03023839001",
            "name": "ទូច មឿន"
        },
        {
            "barcode": "171116086",
            "dpc": "03023839601",
            "name": "ស៊ីវ សារឿង"
        },
        {
            "barcode": "171116087",
            "dpc": "03023840001",
            "name": "សោម ឡុងឌី"
        },
        {
            "barcode": "171116088",
            "dpc": "03023841201",
            "name": "ឡុង ស៊ីណារ៉េត"
        },
        {
            "barcode": "171116089",
            "dpc": "03023842301",
            "name": "ស៊ឹម សុខលាង"
        },
        {
            "barcode": "171116090",
            "dpc": "03023842401",
            "name": "វួច លីម"
        },
        {
            "barcode": "171116091",
            "dpc": "03023843201",
            "name": "ផ្លុង រ៉ាត់"
        },
        {
            "barcode": "171116092",
            "dpc": "03023843901",
            "name": "ឆាត គាន"
        },
        {
            "barcode": "171116093",
            "dpc": "03023847001",
            "name": "ទួច សារឿត"
        },
        {
            "barcode": "171116094",
            "dpc": "03023847301",
            "name": "ស្រែ ទិន"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});