

let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=
    [
        {
            "barcode": "171116220",
            "dpc": "03023909301",
            "name": "សេក សារ៉ុម"
        },
        {
            "barcode": "171116221",
            "dpc": "03023900201",
            "name": "សាគុណ ប្រាកដ"
        },
        {
            "barcode": "171116222",
            "dpc": "03023900301",
            "name": "ចក់ ចន្ថា"
        },
        {
            "barcode": "171116223",
            "dpc": "03023900401",
            "name": "ថោង សេរីវត្ស"
        },
        {
            "barcode": "171116224",
            "dpc": "03023900601",
            "name": "ចក់ ចន្ថា"
        },
        {
            "barcode": "171116225",
            "dpc": "03023900701",
            "name": "ហេង លាង"
        },
        {
            "barcode": "171116226",
            "dpc": "03023900801",
            "name": "ហួម ហាប់"
        },
        {
            "barcode": "171116227",
            "dpc": "03023901201",
            "name": "ឆឹម សម្បត្តិ"
        },
        {
            "barcode": "171116228",
            "dpc": "03023901301",
            "name": "សាង លាងគីម"
        },
        {
            "barcode": "171116229",
            "dpc": "03023901601",
            "name": "គឹម សុឃី"
        },
        {
            "barcode": "171116230",
            "dpc": "03023901801",
            "name": "ណៃ ប៊ុននីន"
        },
        {
            "barcode": "171116231",
            "dpc": "03023901901",
            "name": "លៀប ប៊ុនជឿន"
        },
        {
            "barcode": "171116232",
            "dpc": "03023902001",
            "name": "សួស មករា"
        },
        {
            "barcode": "171116233",
            "dpc": "03023902301",
            "name": "ឆេង ប៊ុនសួ"
        },
        {
            "barcode": "171116234",
            "dpc": "03023902401",
            "name": "ឈឿន សារួត"
        },
        {
            "barcode": "171116235",
            "dpc": "03023902501",
            "name": "អ៊ន ឈឿន"
        },
        {
            "barcode": "171116236",
            "dpc": "03023902701",
            "name": "ដាំ ភាព"
        },
        {
            "barcode": "171116237",
            "dpc": "03023902801",
            "name": "សេង សុន"
        },
        {
            "barcode": "171116238",
            "dpc": "03023902901",
            "name": "ម៉ៅ សារឿត"
        },
        {
            "barcode": "171116239",
            "dpc": "03023903101",
            "name": "ឈៀង ឈាន"
        },
        {
            "barcode": "171116240",
            "dpc": "03023903201",
            "name": "ជ័យ ម៉ារឌី"
        },
        {
            "barcode": "171116241",
            "dpc": "03023903401",
            "name": "ណាង ថង"
        },
        {
            "barcode": "171116242",
            "dpc": "03023903801",
            "name": "ឆៀង លឿត"
        },
        {
            "barcode": "171116243",
            "dpc": "03023903901",
            "name": "ឌិត ភាព"
        },
        {
            "barcode": "171116244",
            "dpc": "03023904001",
            "name": "បួន ពៅ"
        },
        {
            "barcode": "171116245",
            "dpc": "03023904101",
            "name": "វេត ចំណាន"
        },
        {
            "barcode": "171116246",
            "dpc": "03023904201",
            "name": "ហ៊ន ហូ"
        },
        {
            "barcode": "171116247",
            "dpc": "03023904301",
            "name": "ស៊ីម ប៉ន"
        },
        {
            "barcode": "171116248",
            "dpc": "03023904401",
            "name": "ផាន សុខ"
        },
        {
            "barcode": "171116249",
            "dpc": "03023904501",
            "name": "ធឿន សារិន"
        },
        {
            "barcode": "171116250",
            "dpc": "03023904601",
            "name": "សុខ ទេនពិសិដ្ឋ"
        },
        {
            "barcode": "171116251",
            "dpc": "03023904701",
            "name": "សុខ សុផល"
        },
        {
            "barcode": "171116252",
            "dpc": "03023904801",
            "name": "ស៊ូ សុភី"
        },
        {
            "barcode": "171116253",
            "dpc": "03023904901",
            "name": "ឡុង ម៉ាលី"
        },
        {
            "barcode": "171116254",
            "dpc": "03023905201",
            "name": "វ៉ាន់ ណយ"
        },
        {
            "barcode": "171116255",
            "dpc": "03023905301",
            "name": "ឆន សុផល"
        },
        {
            "barcode": "171116256",
            "dpc": "03023905501",
            "name": "ទូច សានិត"
        },
        {
            "barcode": "171116257",
            "dpc": "03023905601",
            "name": "យ៉ាត ម៉ៅ"
        },
        {
            "barcode": "171116258",
            "dpc": "03023905701",
            "name": "ថាប់ ឆម"
        },
        {
            "barcode": "171116259",
            "dpc": "03023905801",
            "name": "ទេព ហ៊ីំម"
        },
        {
            "barcode": "171116260",
            "dpc": "03023905901",
            "name": "ម៉ក់ ឈួន"
        },
        {
            "barcode": "171116261",
            "dpc": "03023906001",
            "name": "ឆឿន រដ្ឋា"
        },
        {
            "barcode": "171116262",
            "dpc": "03023906101",
            "name": "សយ សត្យា"
        },
        {
            "barcode": "171116263",
            "dpc": "03023906201",
            "name": "ថុល ចាន់ណា"
        },
        {
            "barcode": "171116264",
            "dpc": "03023906301",
            "name": "សឿន អឿន"
        },
        {
            "barcode": "171116265",
            "dpc": "03023906401",
            "name": "សំ សុខ"
        },
        {
            "barcode": "171116266",
            "dpc": "03023906501",
            "name": "សៀង សំ"
        },
        {
            "barcode": "171116267",
            "dpc": "03023906601",
            "name": "គឹម សុភារម្យ"
        },
        {
            "barcode": "171116268",
            "dpc": "03023906701",
            "name": "ចេង សុផល"
        },
        {
            "barcode": "171116269",
            "dpc": "03023906801",
            "name": "ប៉ោ គឹមសុង"
        },
        {
            "barcode": "171116270",
            "dpc": "03023906901",
            "name": "លក ចេក"
        },
        {
            "barcode": "171116271",
            "dpc": "03023907001",
            "name": "ប៉ុន សំអាត"
        },
        {
            "barcode": "171116272",
            "dpc": "03023907201",
            "name": "សាយ វណ្ណះ"
        },
        {
            "barcode": "171116273",
            "dpc": "03023907301",
            "name": "ហម ឆា"
        },
        {
            "barcode": "171116274",
            "dpc": "03023907401",
            "name": "ទុយ កុសល់"
        },
        {
            "barcode": "171116275",
            "dpc": "03023907501",
            "name": "ខៀវ ម៉ាលី"
        },
        {
            "barcode": "171116276",
            "dpc": "03023907601",
            "name": "ឆួត ហ៊ាប"
        },
        {
            "barcode": "171116277",
            "dpc": "03023907701",
            "name": "បេង សុគន្ធា"
        },
        {
            "barcode": "171116278",
            "dpc": "03023907801",
            "name": "ចាន់ វណ្ណា"
        },
        {
            "barcode": "171116279",
            "dpc": "03023907901",
            "name": "ហ៊ួ ផុនវិចិត្រ"
        },
        {
            "barcode": "171116280",
            "dpc": "03023908001",
            "name": "ហេង ស្រីរ័ត្ន"
        },
        {
            "barcode": "171116281",
            "dpc": "03023908101",
            "name": "សោម រិទ្ធ"
        },
        {
            "barcode": "171116282",
            "dpc": "03023908201",
            "name": "សំ វណ្ណាក់"
        },
        {
            "barcode": "171116283",
            "dpc": "03023908301",
            "name": "ខេង បញ្ញា"
        },
        {
            "barcode": "171116284",
            "dpc": "03023908501",
            "name": "ជួន សុខហេង"
        },
        {
            "barcode": "171116285",
            "dpc": "03023908601",
            "name": "ផាត់ ទៀង"
        },
        {
            "barcode": "171116286",
            "dpc": "03023908801",
            "name": "អឿន ចាន់នី"
        },
        {
            "barcode": "171116287",
            "dpc": "03023908901",
            "name": "ប៊ន ខន"
        },
        {
            "barcode": "171116288",
            "dpc": "03023909101",
            "name": "កុល សំណាង"
        },
        {
            "barcode": "171116289",
            "dpc": "03023909201",
            "name": "ភឿក វីរៈ"
        },
        {
            "barcode": "171116290",
            "dpc": "03023909401",
            "name": "ហ៊ីម ហ្វារីត"
        },
        {
            "barcode": "171116291",
            "dpc": "03023909501",
            "name": "ទត ហ្វា"
        },
        {
            "barcode": "171116292",
            "dpc": "03023909601",
            "name": "ស៊ុន ធី"
        },
        {
            "barcode": "171116293",
            "dpc": "03023909701",
            "name": "បូ វឿត"
        },
        {
            "barcode": "171116294",
            "dpc": "03023909801",
            "name": "ស៊ិន សុភាព"
        },
        {
            "barcode": "171116295",
            "dpc": "03023909901",
            "name": "បេង សុខ ណា"
        },
        {
            "barcode": "171116296",
            "dpc": "03023910001",
            "name": "ម៉ម វណ្ណា"
        },
        {
            "barcode": "171116297",
            "dpc": "03023910101",
            "name": "ម៉ៅ លន់"
        },
        {
            "barcode": "171116298",
            "dpc": "03023910201",
            "name": "ឡឹប សាមឿន"
        },
        {
            "barcode": "171116299",
            "dpc": "03023910301",
            "name": "ហុក គឹមហួង"
        },
        {
            "barcode": "171116300",
            "dpc": "03023910401",
            "name": "ឈឹម រ៉ៃម៉ុង"
        },
        {
            "barcode": "171116301",
            "dpc": "03023910501",
            "name": "ខាត់ វ៉ិត"
        },
        {
            "barcode": "171116302",
            "dpc": "03023910601",
            "name": "អុំ កៅ"
        },
        {
            "barcode": "171116303",
            "dpc": "03023910701",
            "name": "គ្រួច សុវណ្ណ"
        },
        {
            "barcode": "171116304",
            "dpc": "03023910801",
            "name": "សេង ថេង"
        },
        {
            "barcode": "171116305",
            "dpc": "03023910901",
            "name": "គុយ គា"
        },
        {
            "barcode": "171116306",
            "dpc": "03023911001",
            "name": "ម៉ម ស៊ីម៉ុន"
        },
        {
            "barcode": "171116307",
            "dpc": "03023911101",
            "name": "ទេស សុភាព"
        },
        {
            "barcode": "171116308",
            "dpc": "03023911201",
            "name": "ហេង សុដាលីន"
        },
        {
            "barcode": "171116309",
            "dpc": "03023911301",
            "name": "ជួប រិទ្ធី"
        },
        {
            "barcode": "171116310",
            "dpc": "03023911401",
            "name": "ម៉ា សល់"
        },
        {
            "barcode": "171116311",
            "dpc": "03023911501",
            "name": "អៀង ខាន់យ៉ា"
        },
        {
            "barcode": "171116312",
            "dpc": "03023911601",
            "name": "មាស សុខុម"
        },
        {
            "barcode": "171116313",
            "dpc": "03023911701",
            "name": "ទី សុផល"
        },
        {
            "barcode": "171116314",
            "dpc": "03023911801",
            "name": "ម៉ៅ ដាលី"
        },
        {
            "barcode": "171116315",
            "dpc": "03023911901",
            "name": "រដ្ឋ រឿន"
        },
        {
            "barcode": "171116316",
            "dpc": "03023912001",
            "name": "ហេង រ៉ា"
        },
        {
            "barcode": "171116317",
            "dpc": "03023912101",
            "name": "ដួង ចាន់ថន"
        },
        {
            "barcode": "171116318",
            "dpc": "03023912201",
            "name": "អ៊ឹម រិន"
        },
        {
            "barcode": "171116319",
            "dpc": "03023912301",
            "name": "វីរះ សុណ្ណារ៉ុង"
        },
        {
            "barcode": "171116320",
            "dpc": "03023912401",
            "name": "ប្រាក់ សាមឿន"
        },
        {
            "barcode": "171116321",
            "dpc": "03023912501",
            "name": "អ៊ួង ម៉ានី"
        },
        {
            "barcode": "171116322",
            "dpc": "03023912601",
            "name": "ឡុង វី"
        },
        {
            "barcode": "171116323",
            "dpc": "03023912701",
            "name": "រត័្ន សាវី"
        },
        {
            "barcode": "171116324",
            "dpc": "03023912801",
            "name": "អុន រ៉ាណ"
        },
        {
            "barcode": "171116325",
            "dpc": "03023912901",
            "name": "រៀម យន"
        },
        {
            "barcode": "171116326",
            "dpc": "03023913001",
            "name": "មាស វ៉ុន"
        },
        {
            "barcode": "171116327",
            "dpc": "03023913101",
            "name": "ព្រំ ភូរ៉ាត់"
        },
        {
            "barcode": "171116328",
            "dpc": "03023913201",
            "name": "យិន ប៊ុនតេន"
        },
        {
            "barcode": "171116329",
            "dpc": "03023913301",
            "name": "ឡាម សារ៉ុម"
        },
        {
            "barcode": "171116330",
            "dpc": "03023913501",
            "name": "រស់ រីម"
        },
        {
            "barcode": "171116331",
            "dpc": "03023913601",
            "name": "គីម សម្បត្តិ"
        },
        {
            "barcode": "171116332",
            "dpc": "03023913701",
            "name": "ស៊ិន ឈុនលី"
        },
        {
            "barcode": "171116333",
            "dpc": "03023913801",
            "name": "គូរ ខ្លា"
        },
        {
            "barcode": "171116334",
            "dpc": "03023913901",
            "name": "ស៊ុន ចិន្តា"
        },
        {
            "barcode": "171116335",
            "dpc": "03023914001",
            "name": "អ៊ូ យ៉ាន"
        },
        {
            "barcode": "171116336",
            "dpc": "03023914101",
            "name": "តី ដានី"
        },
        {
            "barcode": "171116337",
            "dpc": "03023914201",
            "name": "សែម សុខជា"
        },
        {
            "barcode": "171116338",
            "dpc": "03023914301",
            "name": "ឈុន លី"
        },
        {
            "barcode": "171116339",
            "dpc": "03023914401",
            "name": "សី សារី"
        },
        {
            "barcode": "171116340",
            "dpc": "03023914501",
            "name": "លី ហ៊ើស"
        },
        {
            "barcode": "171116341",
            "dpc": "03023914601",
            "name": "លី ប៊ិត"
        },
        {
            "barcode": "171116342",
            "dpc": "03023914701",
            "name": "ពេជ្រ សាខន"
        },
        {
            "barcode": "171116343",
            "dpc": "03023914801",
            "name": "លឹម ចន័្ទ"
        },
        {
            "barcode": "171116344",
            "dpc": "03023914901",
            "name": "ហម ភឿន"
        },
        {
            "barcode": "171116345",
            "dpc": "03023915001",
            "name": "ឈន កំសត់"
        },
        {
            "barcode": "171116346",
            "dpc": "03023915101",
            "name": "ប៉ិច ញ៉ាក់"
        },
        {
            "barcode": "171116347",
            "dpc": "03023915201",
            "name": "សី រិទ្ធី"
        },
        {
            "barcode": "171116348",
            "dpc": "03023915301",
            "name": "ប៉ែន កិ"
        },
        {
            "barcode": "171116349",
            "dpc": "03023915401",
            "name": "ជិន សុវណ្ណដា"
        },
        {
            "barcode": "171116350",
            "dpc": "03023915501",
            "name": "សួស សុផល"
        },
        {
            "barcode": "171116351",
            "dpc": "03023915601",
            "name": "សៅ សុភឿន"
        },
        {
            "barcode": "171116352",
            "dpc": "03023915701",
            "name": "មូល សុវត្តិ"
        },
        {
            "barcode": "171116353",
            "dpc": "03023915801",
            "name": "គង់ សុឃន"
        },
        {
            "barcode": "171116354",
            "dpc": "03023915901",
            "name": "ម៉ាង គា"
        },
        {
            "barcode": "171116355",
            "dpc": "03023916001",
            "name": "ប៉ុក ស៊ិប"
        },
        {
            "barcode": "171116356",
            "dpc": "03023916101",
            "name": "ណុប ចាន់បូរ៉ា"
        },
        {
            "barcode": "171116357",
            "dpc": "03023916201",
            "name": "ធួន រ៉ាវុធ"
        },
        {
            "barcode": "171116358",
            "dpc": "03023916301",
            "name": "ណុប ណារ៉ា១"
        },
        {
            "barcode": "171116359",
            "dpc": "03023916401",
            "name": "ណុប ណារ៉ា២"
        },
        {
            "barcode": "171116360",
            "dpc": "03023916501",
            "name": "ណុប ណារ៉ា៣"
        },
        {
            "barcode": "171116361",
            "dpc": "03023916601",
            "name": "ណុប ណារ៉ា២៤"
        },
        {
            "barcode": "171116362",
            "dpc": "03023916701",
            "name": "សួង យ៉ាន់"
        },
        {
            "barcode": "171116363",
            "dpc": "03023916801",
            "name": "តាំង ស៊ូគៀវ"
        },
        {
            "barcode": "171116364",
            "dpc": "03023916901",
            "name": "ញ៉ែម ឡា"
        },
        {
            "barcode": "171116365",
            "dpc": "03023917001",
            "name": "ឈិន ឃឿន"
        },
        {
            "barcode": "171116366",
            "dpc": "03023917101",
            "name": "នៅ ចាន់ណា"
        },
        {
            "barcode": "171116367",
            "dpc": "03023917201",
            "name": "ឈឿន សុភឿត"
        },
        {
            "barcode": "171116368",
            "dpc": "03023917401",
            "name": "យិន លាងឆេង"
        },
        {
            "barcode": "171116369",
            "dpc": "03023917501",
            "name": "សម្ព័នយុវជនម៉ូស្លីម"
        },
        {
            "barcode": "171116370",
            "dpc": "03023917601",
            "name": "ឡៅ ប៉ោជូ"
        },
        {
            "barcode": "171116371",
            "dpc": "03023917701",
            "name": "ពៅ សុខជា"
        },
        {
            "barcode": "171116372",
            "dpc": "03023917801",
            "name": "សំ សំណាង"
        },
        {
            "barcode": "171116373",
            "dpc": "03023917901",
            "name": "ស្លេះ ម៉ារីយ៉ាន"
        },
        {
            "barcode": "171116374",
            "dpc": "03023918001",
            "name": "ណៃ ណាម"
        },
        {
            "barcode": "171116375",
            "dpc": "03023918101",
            "name": "ព្រឿង ផារ៉ាត់"
        },
        {
            "barcode": "171116376",
            "dpc": "03023918201",
            "name": "ហេង តេង"
        },
        {
            "barcode": "171116377",
            "dpc": "03023918301",
            "name": "ភុន ហ៊ួង"
        },
        {
            "barcode": "171116378",
            "dpc": "03023918401",
            "name": "វឹង វុទ្ធី១"
        },
        {
            "barcode": "171116379",
            "dpc": "03023918501",
            "name": "គង់ រដ្ឋា"
        },
        {
            "barcode": "171116380",
            "dpc": "03023918701",
            "name": "ជ័យ ចក់២"
        },
        {
            "barcode": "171116381",
            "dpc": "03023918801",
            "name": "ឈុន អូន"
        },
        {
            "barcode": "171116382",
            "dpc": "03023918901",
            "name": "ឃិន អឿន"
        },
        {
            "barcode": "171116383",
            "dpc": "03023919101",
            "name": "ឃឹម ម៉ន"
        },
        {
            "barcode": "171116384",
            "dpc": "03023919201",
            "name": "ញឹម គន្ធា"
        },
        {
            "barcode": "171116385",
            "dpc": "03023919401",
            "name": "ឯក ជីវ័ន"
        },
        {
            "barcode": "171116386",
            "dpc": "03023919501",
            "name": "សាន់ ម៉ាត់លី"
        },
        {
            "barcode": "171116387",
            "dpc": "03023919601",
            "name": "យើ នូរី"
        },
        {
            "barcode": "171116388",
            "dpc": "03023919701",
            "name": "នូ សំណាង"
        },
        {
            "barcode": "171116389",
            "dpc": "03023919801",
            "name": "ណា រ៉ាមនោរិទ្ទ"
        },
        {
            "barcode": "171116390",
            "dpc": "03023919901",
            "name": "ស៊ុប ហ្វារីត"
        },
        {
            "barcode": "171116391",
            "dpc": "03023920001",
            "name": "គុណ សុវណ្ណដា"
        },
        {
            "barcode": "171116392",
            "dpc": "03023920101",
            "name": "សុន ចាន់ធា"
        },
        {
            "barcode": "171116393",
            "dpc": "03023920201",
            "name": "តឿង តុន"
        },
        {
            "barcode": "171116394",
            "dpc": "03023920301",
            "name": "ម៉េត រី"
        },
        {
            "barcode": "171116395",
            "dpc": "03023920401",
            "name": "ណាស់ ឡោះ"
        },
        {
            "barcode": "171116396",
            "dpc": "03023920501",
            "name": "ឡស់ លីម"
        },
        {
            "barcode": "171116397",
            "dpc": "03023920601",
            "name": "ប្រាក់ ស៊ុន"
        },
        {
            "barcode": "171116398",
            "dpc": "03023920701",
            "name": "សុខ រឿត"
        },
        {
            "barcode": "171116399",
            "dpc": "03023920801",
            "name": "ស៊ុន ណង"
        },
        {
            "barcode": "171116400",
            "dpc": "03023920901",
            "name": "ស៊ុន សំបូរ"
        },
        {
            "barcode": "171116401",
            "dpc": "03023921001",
            "name": "សុខ ពូក"
        },
        {
            "barcode": "171116402",
            "dpc": "03023921101",
            "name": "ឯល យើ"
        },
        {
            "barcode": "171116403",
            "dpc": "03023921201",
            "name": "សូ ពេជ្រ"
        },
        {
            "barcode": "171116404",
            "dpc": "03023921301",
            "name": "វិន វីឆៃ"
        },
        {
            "barcode": "171116405",
            "dpc": "03023921401",
            "name": "ភឿន សម្ជស្ស"
        },
        {
            "barcode": "171116406",
            "dpc": "03023921501",
            "name": "ផេង សេរី"
        },
        {
            "barcode": "171116407",
            "dpc": "03023921601",
            "name": "អ៊ិន នៅ"
        },
        {
            "barcode": "171116408",
            "dpc": "03023921701",
            "name": "សួស រ៉ន"
        },
        {
            "barcode": "171116409",
            "dpc": "03023921801",
            "name": "អឿន សម្បត្តិ"
        },
        {
            "barcode": "171116410",
            "dpc": "03023921901",
            "name": "ខឹម សេង"
        },
        {
            "barcode": "171116411",
            "dpc": "03023922001",
            "name": "វិន រ៉ានី"
        },
        {
            "barcode": "171116412",
            "dpc": "03023922101",
            "name": "ហ៊ីម ណារិទ្ធ"
        },
        {
            "barcode": "171116413",
            "dpc": "03023922201",
            "name": "វណ្ណ យន"
        },
        {
            "barcode": "171116414",
            "dpc": "03023922301",
            "name": "លឹម វ៉េងគៀង"
        },
        {
            "barcode": "171116415",
            "dpc": "03023922401",
            "name": "ផ្លុង ដារ៉ា"
        },
        {
            "barcode": "171116416",
            "dpc": "03023922501",
            "name": "វ៉ាន់ ស្រីទូច"
        },
        {
            "barcode": "171116417",
            "dpc": "03023922601",
            "name": "ចែម ដាណា"
        },
        {
            "barcode": "171116418",
            "dpc": "03023922701",
            "name": "ហ៊ុត ផារិទ្ធ"
        },
        {
            "barcode": "171116419",
            "dpc": "03023922801",
            "name": "ស៊ី សំប៊ុន"
        },
        {
            "barcode": "171116420",
            "dpc": "03023922901",
            "name": "សុខ សុគុណ"
        },
        {
            "barcode": "171116421",
            "dpc": "03023923001",
            "name": "អ៊ុន វណ្ណះ"
        },
        {
            "barcode": "171116422",
            "dpc": "03023923101",
            "name": "លក ឆាយលី"
        },
        {
            "barcode": "171116423",
            "dpc": "03023923201",
            "name": "ឈ ហ៊ូ"
        },
        {
            "barcode": "171116424",
            "dpc": "03023923301",
            "name": "អ៊ុក សុភានាថ"
        },
        {
            "barcode": "171116425",
            "dpc": "03023923401",
            "name": "ជិន សម័យ"
        },
        {
            "barcode": "171116426",
            "dpc": "03023923501",
            "name": "មឿន សុទ្ធ"
        },
        {
            "barcode": "171116427",
            "dpc": "03023923601",
            "name": "ហេង កន្និកា"
        },
        {
            "barcode": "171116428",
            "dpc": "03023923701",
            "name": "ចាន់ ប៊ុនធឿន"
        },
        {
            "barcode": "171116429",
            "dpc": "03023923801",
            "name": "ណូត ស៊ីនួន"
        },
        {
            "barcode": "171116430",
            "dpc": "03023923901",
            "name": "ជា សំអូន"
        },
        {
            "barcode": "171116431",
            "dpc": "03023924001",
            "name": "បុង រិទ្ធីរ៉េន"
        },
        {
            "barcode": "171116432",
            "dpc": "03023924101",
            "name": "ប្រាក់ ចាន់ឌី"
        },
        {
            "barcode": "171116433",
            "dpc": "03023924201",
            "name": "សឹង ចំរើន"
        },
        {
            "barcode": "171116434",
            "dpc": "03023924401",
            "name": "ចន្ទ សុភាព"
        },
        {
            "barcode": "171116435",
            "dpc": "03023924601",
            "name": "គូ ចន្ទ្រា"
        },
        {
            "barcode": "171116436",
            "dpc": "03023924701",
            "name": "ជី គីមីសៀង"
        },
        {
            "barcode": "171116437",
            "dpc": "03023924801",
            "name": "ហួត ឈុន"
        },
        {
            "barcode": "171116438",
            "dpc": "03023924901",
            "name": "ស៊ុត លីម"
        },
        {
            "barcode": "171116439",
            "dpc": "03023925001",
            "name": "ឌឿន រ៉េត"
        },
        {
            "barcode": "171116440",
            "dpc": "03023925101",
            "name": "ស៊ិន សាវុធ"
        },
        {
            "barcode": "171116441",
            "dpc": "03023925201",
            "name": "ប៊ុន ឆឿន"
        },
        {
            "barcode": "171116442",
            "dpc": "03023925401",
            "name": "ឯម សុវណ្ណារី"
        },
        {
            "barcode": "171116443",
            "dpc": "03023925501",
            "name": "អ៊ឹង ហេងគ្រុប២"
        },
        {
            "barcode": "171116444",
            "dpc": "03023925601",
            "name": "យ៉េង កុសល់"
        },
        {
            "barcode": "171116445",
            "dpc": "03023925701",
            "name": "ព្រំ​ ផន"
        },
        {
            "barcode": "171116446",
            "dpc": "03023925801",
            "name": "យ៉ែម ទូច"
        },
        {
            "barcode": "171116447",
            "dpc": "03023925901",
            "name": "អឿន សុវណ្ណរ៉ា"
        },
        {
            "barcode": "171116448",
            "dpc": "03023926001",
            "name": "ហ៊ុន វណ្ណា"
        },
        {
            "barcode": "171116449",
            "dpc": "03023926101",
            "name": "លី ឃុនរ៉ាត់"
        },
        {
            "barcode": "171116450",
            "dpc": "03023926201",
            "name": "ផាន ចាន់ថន"
        },
        {
            "barcode": "171116451",
            "dpc": "03023926301",
            "name": "រស់ មឿត"
        },
        {
            "barcode": "171116452",
            "dpc": "03023926401",
            "name": "កូន ហ៊ិម"
        },
        {
            "barcode": "171116453",
            "dpc": "03023926801",
            "name": "សួស ផល្លា"
        },
        {
            "barcode": "171116454",
            "dpc": "03023926901",
            "name": "នូវ សំណាង"
        },
        {
            "barcode": "171116455",
            "dpc": "03023927001",
            "name": "មៃ ខេម"
        },
        {
            "barcode": "171116456",
            "dpc": "03023927101",
            "name": "ជា សូរិយា"
        },
        {
            "barcode": "171116457",
            "dpc": "03023927201",
            "name": "វ៉ាន់ ថា"
        },
        {
            "barcode": "171116458",
            "dpc": "03023927301",
            "name": "ហេង សិរីវឌ្ឍនះ"
        },
        {
            "barcode": "171116459",
            "dpc": "03023927401",
            "name": "តាំង ប៊ុនណាន"
        },
        {
            "barcode": "171116460",
            "dpc": "03023927601",
            "name": "កា សាលី"
        },
        {
            "barcode": "171116461",
            "dpc": "03023927701",
            "name": "អែល រ៉ូស្សា"
        },
        {
            "barcode": "171116462",
            "dpc": "03023927801",
            "name": "លឹម កេស្មី"
        },
        {
            "barcode": "171116463",
            "dpc": "03023927901",
            "name": "ម៉ាន់ ព្រីត"
        },
        {
            "barcode": "171116464",
            "dpc": "03023928001",
            "name": "សុះ ម៉ៅ"
        },
        {
            "barcode": "171116465",
            "dpc": "03023928201",
            "name": "ម៉ាន លី"
        },
        {
            "barcode": "171116466",
            "dpc": "03023928301",
            "name": "ឡោះ ម៉ាត់"
        },
        {
            "barcode": "171116467",
            "dpc": "03023928401",
            "name": "ម៉ុន សុខុម"
        },
        {
            "barcode": "171116468",
            "dpc": "03023928501",
            "name": "បឋមសិក្សាក្តុល"
        },
        {
            "barcode": "171116469",
            "dpc": "03023928601",
            "name": "ឃ្លោក ម៉ក់"
        },
        {
            "barcode": "171116470",
            "dpc": "03023928801",
            "name": "លី សារី"
        },
        {
            "barcode": "171116471",
            "dpc": "03023928901",
            "name": "ហ៊ាង រស្មី"
        },
        {
            "barcode": "171116472",
            "dpc": "03023929001",
            "name": "ពិន យ៉ា"
        },
        {
            "barcode": "171116473",
            "dpc": "03023929101",
            "name": "ឃូ លីមជីវ"
        },
        {
            "barcode": "171116474",
            "dpc": "03023929201",
            "name": "ប៉ិច សុផល"
        },
        {
            "barcode": "171116475",
            "dpc": "03023929301",
            "name": "សួង សាវ៉េត"
        },
        {
            "barcode": "171116476",
            "dpc": "03023929401",
            "name": "តែម ធានី"
        },
        {
            "barcode": "171116477",
            "dpc": "03023929501",
            "name": "អោម ពន្លក"
        },
        {
            "barcode": "171116478",
            "dpc": "03023929601",
            "name": "សួង គាន"
        },
        {
            "barcode": "171116479",
            "dpc": "03023929701",
            "name": "សក់ ជេម"
        },
        {
            "barcode": "171116480",
            "dpc": "03023929901",
            "name": "ឃ្ងិន សុម៉ាលី"
        },
        {
            "barcode": "171116481",
            "dpc": "03023930001",
            "name": "សឹម សុខ"
        },
        {
            "barcode": "171116482",
            "dpc": "03023930101",
            "name": "ជា អាន"
        },
        {
            "barcode": "171116483",
            "dpc": "03023930201",
            "name": "ឡោក ហឿម"
        },
        {
            "barcode": "171116484",
            "dpc": "03023930401",
            "name": "ឌិន វណ្ណា"
        },
        {
            "barcode": "171116485",
            "dpc": "03023930501",
            "name": "ឌិន វ៉ាន់ឌី"
        },
        {
            "barcode": "171116486",
            "dpc": "03023930601",
            "name": "ជួប សុខុម"
        },
        {
            "barcode": "171116487",
            "dpc": "03023930701",
            "name": "ឌិន វ៉ាន់ដា"
        },
        {
            "barcode": "171116488",
            "dpc": "03023930801",
            "name": "សាន មករា"
        },
        {
            "barcode": "171116489",
            "dpc": "03023930901",
            "name": "ឃ្លិន និវឌ្ឍន៍"
        },
        {
            "barcode": "171116490",
            "dpc": "03023931101",
            "name": "ហ៊ួត សំបូរ"
        },
        {
            "barcode": "171116491",
            "dpc": "03023931301",
            "name": "ហួត ចន្ថា"
        },
        {
            "barcode": "171116492",
            "dpc": "03023931401",
            "name": "ហ៊ួត ចាន់ឌី"
        },
        {
            "barcode": "171116493",
            "dpc": "03023931501",
            "name": "ហ៊ួត ចាន់ដេត"
        },
        {
            "barcode": "171116494",
            "dpc": "03023931601",
            "name": "ហ៊ុន ចៅសម្បត្តិ"
        },
        {
            "barcode": "171116495",
            "dpc": "03023931701",
            "name": "ព ពៅ"
        },
        {
            "barcode": "171116496",
            "dpc": "03023931901",
            "name": "រុន ចាន់និត"
        },
        {
            "barcode": "171116497",
            "dpc": "03023932001",
            "name": "ហ៊ិន វ៉ាន់នាងសូលីដា"
        },
        {
            "barcode": "171116498",
            "dpc": "03023932101",
            "name": "ឃឿន ខឿត"
        },
        {
            "barcode": "171116499",
            "dpc": "03023932201",
            "name": "ហ៊ួត សុផល"
        },
        {
            "barcode": "171116500",
            "dpc": "03023932301",
            "name": "គង់ គូររុន"
        },
        {
            "barcode": "171116501",
            "dpc": "03023932501",
            "name": "ឡោក ហឿត"
        },
        {
            "barcode": "171116502",
            "dpc": "03023932601",
            "name": "ហ៊ន ឈុនលី"
        },
        {
            "barcode": "171116503",
            "dpc": "03023932701",
            "name": "ចែត្រ ឌឿន"
        },
        {
            "barcode": "171116504",
            "dpc": "03023932801",
            "name": "ប៊ុន សុខេង"
        },
        {
            "barcode": "171116505",
            "dpc": "03023932901",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "171116506",
            "dpc": "03023933001",
            "name": "ពេជ្រ សាវរ៉ា"
        },
        {
            "barcode": "171116507",
            "dpc": "03023933201",
            "name": "វ៉ាន់ ថន"
        },
        {
            "barcode": "171116508",
            "dpc": "03023933301",
            "name": "ឯម សោភ័ណ្ឌ"
        },
        {
            "barcode": "171116509",
            "dpc": "03023933401",
            "name": "ឈូក សុភាព"
        },
        {
            "barcode": "171116510",
            "dpc": "03023933501",
            "name": "រស់ សានិត"
        },
        {
            "barcode": "171116511",
            "dpc": "03023933601",
            "name": "ធឿន សំណាង"
        },
        {
            "barcode": "171116512",
            "dpc": "03023933701",
            "name": "អិត ធឿន"
        },
        {
            "barcode": "171116513",
            "dpc": "03023933801",
            "name": "កង សុខា"
        },
        {
            "barcode": "171116514",
            "dpc": "03023933901",
            "name": "ពិន ចាន់ឡា"
        },
        {
            "barcode": "171116515",
            "dpc": "03023934001",
            "name": "ពិន ថាវរិន"
        },
        {
            "barcode": "171116516",
            "dpc": "03023934101",
            "name": "បូ មុំ"
        },
        {
            "barcode": "171116517",
            "dpc": "03023934201",
            "name": "បូ សុខខូ"
        },
        {
            "barcode": "171116518",
            "dpc": "03023934301",
            "name": "កង រំ"
        },
        {
            "barcode": "171116519",
            "dpc": "03023934401",
            "name": "សំ រិន"
        },
        {
            "barcode": "171116520",
            "dpc": "03023934501",
            "name": "ខេង សំនៀង"
        },
        {
            "barcode": "171116521",
            "dpc": "03023934601",
            "name": "ជា ឆុន"
        },
        {
            "barcode": "171116522",
            "dpc": "03023934701",
            "name": "ថោង សារឿន"
        },
        {
            "barcode": "171116523",
            "dpc": "03023934801",
            "name": "ស្រី​ សុភី"
        },
        {
            "barcode": "171116524",
            "dpc": "03023934901",
            "name": "សាត គឿន"
        },
        {
            "barcode": "171116525",
            "dpc": "03023935001",
            "name": "ចាន់ អៃ"
        },
        {
            "barcode": "171116526",
            "dpc": "03023935101",
            "name": "គង់ កង"
        },
        {
            "barcode": "171116527",
            "dpc": "03023935201",
            "name": "គង់ សុភា"
        },
        {
            "barcode": "171116528",
            "dpc": "03023935301",
            "name": "អុល អឿន"
        },
        {
            "barcode": "171116529",
            "dpc": "03023935401",
            "name": "សំ ណារិទ្ថ"
        },
        {
            "barcode": "171116530",
            "dpc": "03023935501",
            "name": "សឿន សុខា"
        },
        {
            "barcode": "171116531",
            "dpc": "03023935601",
            "name": "ផន រឿម"
        },
        {
            "barcode": "171116532",
            "dpc": "03023935701",
            "name": "ម៉ន សារ៉ង"
        },
        {
            "barcode": "171116533",
            "dpc": "03023935801",
            "name": "ស ច្រិប"
        },
        {
            "barcode": "171116534",
            "dpc": "03023935901",
            "name": "ប៉ាន យឿត"
        },
        {
            "barcode": "171116535",
            "dpc": "03023936001",
            "name": "មល់ សក្ត័"
        },
        {
            "barcode": "171116536",
            "dpc": "03023936101",
            "name": "ទី កី"
        },
        {
            "barcode": "171116537",
            "dpc": "03023936201",
            "name": "ថ្លាង សឹម"
        },
        {
            "barcode": "171116538",
            "dpc": "03023936301",
            "name": "ហុក វណ្ណី"
        },
        {
            "barcode": "171116539",
            "dpc": "03023936501",
            "name": "ប៉ែន វុទ្ធី"
        },
        {
            "barcode": "171116540",
            "dpc": "03023936601",
            "name": "ញ៉ក ភាន"
        },
        {
            "barcode": "171116541",
            "dpc": "03023936701",
            "name": "ហម មឿន"
        },
        {
            "barcode": "171116542",
            "dpc": "03023936801",
            "name": "ឈឿន ឈឿត"
        },
        {
            "barcode": "171116543",
            "dpc": "03023936901",
            "name": "រឿន ហុក"
        },
        {
            "barcode": "171116544",
            "dpc": "03023937101",
            "name": "រ៉ែម មុំ"
        },
        {
            "barcode": "171116545",
            "dpc": "03023937201",
            "name": "រ៉ែម រ៉ាន់"
        },
        {
            "barcode": "171116546",
            "dpc": "03023937301",
            "name": "ផន ប៊ុនថន"
        },
        {
            "barcode": "171116547",
            "dpc": "03023937401",
            "name": "គីម សុខវណ្ណា"
        },
        {
            "barcode": "171116548",
            "dpc": "03023937501",
            "name": "ហ៊រ យ៉ៃ"
        },
        {
            "barcode": "171116549",
            "dpc": "03023937601",
            "name": "ហ៊រ ជួប"
        },
        {
            "barcode": "171116550",
            "dpc": "03023937701",
            "name": "ញ៉ែម សារ៉េត"
        },
        {
            "barcode": "171116551",
            "dpc": "03023937801",
            "name": "ជេស គឹមសល់"
        },
        {
            "barcode": "171116552",
            "dpc": "03023937901",
            "name": "ខ្លូត សៀក"
        },
        {
            "barcode": "171116553",
            "dpc": "03023938101",
            "name": "ម៉ែន វី"
        },
        {
            "barcode": "171116554",
            "dpc": "03023938201",
            "name": "ផឹក ផាន់នេ"
        },
        {
            "barcode": "171116555",
            "dpc": "03023938301",
            "name": "ស្វាយ រចនា"
        },
        {
            "barcode": "171116556",
            "dpc": "03023938401",
            "name": "រ័ត្ន វាន់យ៉ា"
        },
        {
            "barcode": "171116557",
            "dpc": "03023938501",
            "name": "គង់ ផ្លសា"
        },
        {
            "barcode": "171116558",
            "dpc": "03023938601",
            "name": "វ៉ាត់ សឺត"
        },
        {
            "barcode": "171116559",
            "dpc": "03023938701",
            "name": "វុន សំណាង"
        },
        {
            "barcode": "171116560",
            "dpc": "03023938801",
            "name": "ភី ចាន់ដារ៉ា"
        },
        {
            "barcode": "171116561",
            "dpc": "03023938901",
            "name": "ខាវ វីរ៉ា"
        },
        {
            "barcode": "171116562",
            "dpc": "03023939001",
            "name": "រ៉េត ច្រិប"
        },
        {
            "barcode": "171116563",
            "dpc": "03023939101",
            "name": "សេង ប៊ុនសុង"
        },
        {
            "barcode": "171116564",
            "dpc": "03023939201",
            "name": "ប៊ុន ហុង"
        },
        {
            "barcode": "171116565",
            "dpc": "03023939301",
            "name": "ប៉ិច យូហាក់"
        },
        {
            "barcode": "171116566",
            "dpc": "03023939401",
            "name": "ឡោះ តាំ"
        },
        {
            "barcode": "171116567",
            "dpc": "03023939501",
            "name": "រិន សារ៉ន"
        },
        {
            "barcode": "171116568",
            "dpc": "03023939601",
            "name": "ផាន់ សច្ចា"
        },
        {
            "barcode": "171116569",
            "dpc": "03023939701",
            "name": "លី ចាន់ថា"
        },
        {
            "barcode": "171116570",
            "dpc": "03023939801",
            "name": "ស្រស់ មៃសុំ"
        },
        {
            "barcode": "171116571",
            "dpc": "03023939901",
            "name": "ម៉ាត់ ម៉ាស់"
        },
        {
            "barcode": "171116572",
            "dpc": "03023940001",
            "name": "អ៊ុង វត្ថា"
        },
        {
            "barcode": "171116573",
            "dpc": "03023940201",
            "name": "លី ឆេង"
        },
        {
            "barcode": "171116574",
            "dpc": "03023940301",
            "name": "អ៊ិត ឆា"
        },
        {
            "barcode": "171116575",
            "dpc": "03023940401",
            "name": "ឈុន សារ៉ន"
        },
        {
            "barcode": "171116576",
            "dpc": "03023940501",
            "name": "ហឿត សុដារី"
        },
        {
            "barcode": "171116577",
            "dpc": "03023940601",
            "name": "យុន ខ្ចៅ"
        },
        {
            "barcode": "171116578",
            "dpc": "03023940701",
            "name": "ជៀម ថោង"
        },
        {
            "barcode": "171116579",
            "dpc": "03023940901",
            "name": "អ៊ុត ភក្តី"
        },
        {
            "barcode": "171116580",
            "dpc": "03023941001",
            "name": "សុង សុភាព"
        },
        {
            "barcode": "171116581",
            "dpc": "03023941101",
            "name": "កៅ កង"
        },
        {
            "barcode": "171116582",
            "dpc": "03023941201",
            "name": "សួង សាវុទ្ទ"
        },
        {
            "barcode": "171116583",
            "dpc": "03023941301",
            "name": "សារិន ឃីម"
        },
        {
            "barcode": "171116584",
            "dpc": "03023941401",
            "name": "មេត ដារី"
        },
        {
            "barcode": "171116585",
            "dpc": "03023941601",
            "name": "កឹម រ៉េត"
        },
        {
            "barcode": "171116586",
            "dpc": "03023941701",
            "name": "តឹក ពា"
        },
        {
            "barcode": "171116587",
            "dpc": "03023941801",
            "name": "សាលាបាយវត្តពោធិវង្ស"
        },
        {
            "barcode": "171116588",
            "dpc": "03023941901",
            "name": "សុខ សុភី"
        },
        {
            "barcode": "171116589",
            "dpc": "03023942001",
            "name": "សឹម ចន្នី"
        },
        {
            "barcode": "171116590",
            "dpc": "03023942101",
            "name": "សៅ សុធា"
        },
        {
            "barcode": "171116591",
            "dpc": "03023942201",
            "name": "សយ ផាត"
        },
        {
            "barcode": "171116592",
            "dpc": "03023942301",
            "name": "មួង សុខវាសនា"
        },
        {
            "barcode": "171116593",
            "dpc": "03023942401",
            "name": "ហេង លាង"
        },
        {
            "barcode": "171116594",
            "dpc": "03023942501",
            "name": "សេង សឿម"
        },
        {
            "barcode": "171116595",
            "dpc": "03023942601",
            "name": "សុង សំឡី"
        },
        {
            "barcode": "171116596",
            "dpc": "03023942701",
            "name": "សុច សាវឿង"
        },
        {
            "barcode": "171116597",
            "dpc": "03023942801",
            "name": "រឿត បូរ"
        },
        {
            "barcode": "171116598",
            "dpc": "03023942901",
            "name": "ង៉ុយ រឿត"
        },
        {
            "barcode": "171116599",
            "dpc": "03023943001",
            "name": "ឌួង សាវុធ"
        },
        {
            "barcode": "171116600",
            "dpc": "03023943201",
            "name": "កៀត សុជាតិ"
        },
        {
            "barcode": "171116601",
            "dpc": "03023943401",
            "name": "លាយ រៀម"
        },
        {
            "barcode": "171116602",
            "dpc": "03023943501",
            "name": "អ៊ីត ម៉ុន"
        },
        {
            "barcode": "171116603",
            "dpc": "03023943601",
            "name": "វ៉ាន់ សុផាត"
        },
        {
            "barcode": "171116604",
            "dpc": "03023943701",
            "name": "ឡុង ស៊ីថា"
        },
        {
            "barcode": "171116605",
            "dpc": "03023943801",
            "name": "អាន់ មុំ"
        },
        {
            "barcode": "171116606",
            "dpc": "03023943901",
            "name": "ស៊ត ឡុង"
        },
        {
            "barcode": "171116607",
            "dpc": "03023944001",
            "name": "ខន ត្រប់"
        },
        {
            "barcode": "171116608",
            "dpc": "03023944101",
            "name": "សៀ សៅលីន"
        },
        {
            "barcode": "171116609",
            "dpc": "03023944201",
            "name": "វិន វ៉ិត"
        },
        {
            "barcode": "171116610",
            "dpc": "03023944301",
            "name": "ទូច សុភាព"
        },
        {
            "barcode": "171116611",
            "dpc": "03023944401",
            "name": "រួន រិត"
        },
        {
            "barcode": "171116612",
            "dpc": "03023944501",
            "name": "មាជ មាន"
        },
        {
            "barcode": "171116613",
            "dpc": "03023944601",
            "name": "ណក់ សារួង"
        },
        {
            "barcode": "171116614",
            "dpc": "03023944701",
            "name": "គីវ ពុជ"
        },
        {
            "barcode": "171116615",
            "dpc": "03023944801",
            "name": "សន កំសត់"
        },
        {
            "barcode": "171116616",
            "dpc": "03023944901",
            "name": "វ៉ន អូន"
        },
        {
            "barcode": "171116617",
            "dpc": "03023945001",
            "name": "ឯក បូរ៉ា"
        },
        {
            "barcode": "171116618",
            "dpc": "03023945101",
            "name": "យឿន យ៉ិត"
        },
        {
            "barcode": "171116619",
            "dpc": "03023945301",
            "name": "ឡុង សាលីំម"
        },
        {
            "barcode": "171116620",
            "dpc": "03023945401",
            "name": "សេង សុសាង"
        },
        {
            "barcode": "171116621",
            "dpc": "03023945501",
            "name": "ផែង ចំរើន"
        },
        {
            "barcode": "171116622",
            "dpc": "03023945601",
            "name": "ហឿន ធា"
        },
        {
            "barcode": "171116623",
            "dpc": "03023945701",
            "name": "កែម កាក់"
        },
        {
            "barcode": "171116624",
            "dpc": "03023945801",
            "name": "ឆាយ សំណាង"
        },
        {
            "barcode": "171116625",
            "dpc": "03023946001",
            "name": "រ៉ាត់ រ៉ូ"
        },
        {
            "barcode": "171116626",
            "dpc": "03023946101",
            "name": "សោម មករា"
        },
        {
            "barcode": "171116627",
            "dpc": "03023946201",
            "name": "រ៉ុម គុំ"
        },
        {
            "barcode": "171116628",
            "dpc": "03023946301",
            "name": "ឡុង សារឿន"
        },
        {
            "barcode": "171116629",
            "dpc": "03023946401",
            "name": "ប៉េង ប៊ាន"
        },
        {
            "barcode": "171116630",
            "dpc": "03023946501",
            "name": "ខន សារឿន"
        },
        {
            "barcode": "171116631",
            "dpc": "03023946601",
            "name": "ខន មករា"
        },
        {
            "barcode": "171116632",
            "dpc": "03023946701",
            "name": "តុប សុផល"
        },
        {
            "barcode": "171116633",
            "dpc": "03023946801",
            "name": "សេង សារិន"
        },
        {
            "barcode": "171116634",
            "dpc": "03023946901",
            "name": "ម៉ៅ រួប"
        },
        {
            "barcode": "171116635",
            "dpc": "03023947001",
            "name": "ស្មី"
        },
        {
            "barcode": "171116636",
            "dpc": "03023947101",
            "name": "ផា ឆឿប"
        },
        {
            "barcode": "171116637",
            "dpc": "03023947301",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "171116638",
            "dpc": "03023947701",
            "name": "សែន សារីទ្ធ"
        },
        {
            "barcode": "171116639",
            "dpc": "03023948001",
            "name": "ឃឹម សាវ៉ឺន"
        }
    ]
;
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});