

let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=
    [
        {
            "barcode": "171116640",
            "dpc": "03034000101",
            "name": "ជិន សុខុន"
        },
        {
            "barcode": "171116641",
            "dpc": "03034000201",
            "name": "ញ៉ាន វឿត"
        },
        {
            "barcode": "171116642",
            "dpc": "03034000301",
            "name": "សេក ចាន់ដារ៉ា"
        },
        {
            "barcode": "171116643",
            "dpc": "03034000401",
            "name": "ស៊ិន សុផល"
        },
        {
            "barcode": "171116644",
            "dpc": "03034000501",
            "name": "ស៊ាន សេត"
        },
        {
            "barcode": "171116645",
            "dpc": "03034000601",
            "name": "រួម ផន"
        },
        {
            "barcode": "171116646",
            "dpc": "03034000701",
            "name": "ជិន ពៅ"
        },
        {
            "barcode": "171116647",
            "dpc": "03034000801",
            "name": "ឆឹង មិន"
        },
        {
            "barcode": "171116648",
            "dpc": "03034000901",
            "name": "ថង ឡុង"
        },
        {
            "barcode": "171116649",
            "dpc": "03034001001",
            "name": "ង៉ែត ងិន"
        },
        {
            "barcode": "171116650",
            "dpc": "03034001201",
            "name": "ធន ថារី"
        },
        {
            "barcode": "171116651",
            "dpc": "03034001301",
            "name": "ងិន សំបូរ"
        },
        {
            "barcode": "171116652",
            "dpc": "03034001401",
            "name": "សុខ វ៉ាត់ធី"
        },
        {
            "barcode": "171116653",
            "dpc": "03034001501",
            "name": "ហួន ចិន្តា"
        },
        {
            "barcode": "171116654",
            "dpc": "03034001601",
            "name": "ឆាយ ចំណង់"
        },
        {
            "barcode": "171116655",
            "dpc": "03034001701",
            "name": "នឹង សុភាព"
        },
        {
            "barcode": "171116656",
            "dpc": "03034001801",
            "name": "ហុក វាសនា"
        },
        {
            "barcode": "171116657",
            "dpc": "03034001901",
            "name": "ប៊ិន វ៉ាន់នី"
        },
        {
            "barcode": "171116658",
            "dpc": "03034002001",
            "name": "យ៉ង់ វ៉ុន"
        },
        {
            "barcode": "171116659",
            "dpc": "03034002101",
            "name": "ចាប ស៊ីថា"
        },
        {
            "barcode": "171116660",
            "dpc": "03034002201",
            "name": "ហង្ស សីហា"
        },
        {
            "barcode": "171116661",
            "dpc": "03034002301",
            "name": "សុខ សំណាង"
        },
        {
            "barcode": "171116662",
            "dpc": "03034002401",
            "name": "កាន់ វិសេដ្ឋ"
        },
        {
            "barcode": "171116663",
            "dpc": "03034002501",
            "name": "ស៊ុន សុខុន"
        },
        {
            "barcode": "171116664",
            "dpc": "03034002601",
            "name": "ឈឿ រុក្ខា"
        },
        {
            "barcode": "171116665",
            "dpc": "03034002701",
            "name": "ឈឿត វុទ្ធី"
        },
        {
            "barcode": "171116666",
            "dpc": "03034002801",
            "name": "ឡេង គឹមទៀង"
        },
        {
            "barcode": "171116667",
            "dpc": "03034002901",
            "name": "ឃឿម សាវិញ"
        },
        {
            "barcode": "171116668",
            "dpc": "03034003001",
            "name": "កង ចាន់លី"
        },
        {
            "barcode": "171116669",
            "dpc": "03034003101",
            "name": "ជួន សុផុន"
        },
        {
            "barcode": "171116670",
            "dpc": "03034003201",
            "name": "ជួប ជឿប"
        },
        {
            "barcode": "171116671",
            "dpc": "03034003301",
            "name": "ភុំ សុជាតិ"
        },
        {
            "barcode": "171116672",
            "dpc": "03034003401",
            "name": "ប៊ី ឌឿន"
        },
        {
            "barcode": "171116673",
            "dpc": "03034003501",
            "name": "ជួប សុខណាំ"
        },
        {
            "barcode": "171116674",
            "dpc": "03034003601",
            "name": "ម៉េង ហុង"
        },
        {
            "barcode": "171116675",
            "dpc": "03034003701",
            "name": "វ៉ន សាវ័ន្ត"
        },
        {
            "barcode": "171116676",
            "dpc": "03034003801",
            "name": "ភុន ភៀង"
        },
        {
            "barcode": "171116677",
            "dpc": "03034003901",
            "name": "សេង សុខនី"
        },
        {
            "barcode": "171116678",
            "dpc": "03034004001",
            "name": "អុប វណ្ណី"
        },
        {
            "barcode": "171116679",
            "dpc": "03034004201",
            "name": "ស៊ីម សឿន"
        },
        {
            "barcode": "171116680",
            "dpc": "03034004301",
            "name": "ឆម រដ្ឋា"
        },
        {
            "barcode": "171116681",
            "dpc": "03034004401",
            "name": "សឿត វ៉ាត"
        },
        {
            "barcode": "171116682",
            "dpc": "03034004501",
            "name": "យឿម សុភា"
        },
        {
            "barcode": "171116683",
            "dpc": "03034004601",
            "name": "បណ្ណាគារសន្តិភាព"
        },
        {
            "barcode": "171116684",
            "dpc": "03034004701",
            "name": "ងិន ម៉ាប់"
        },
        {
            "barcode": "171116685",
            "dpc": "03034004801",
            "name": "ហម សាវេត"
        },
        {
            "barcode": "171116686",
            "dpc": "03034004901",
            "name": "យឿន រ៉ម"
        },
        {
            "barcode": "171116687",
            "dpc": "03034005001",
            "name": "យឹម សោម"
        },
        {
            "barcode": "171116688",
            "dpc": "03034005101",
            "name": "សោម ភក្តី"
        },
        {
            "barcode": "171116689",
            "dpc": "03034005201",
            "name": "រ៉ុត សារ៉ូ"
        },
        {
            "barcode": "171116690",
            "dpc": "03034005301",
            "name": "ជួន ឆុត"
        },
        {
            "barcode": "171116691",
            "dpc": "03034005501",
            "name": "ឆុន ព្រុំ"
        },
        {
            "barcode": "171116692",
            "dpc": "03034005601",
            "name": "ខូវ វួតហៀង"
        },
        {
            "barcode": "171116693",
            "dpc": "03034005701",
            "name": "ហួ រដ្ឋា"
        },
        {
            "barcode": "171116694",
            "dpc": "03034005801",
            "name": "ជា ដារ៉ា"
        },
        {
            "barcode": "171116695",
            "dpc": "03034005901",
            "name": "នួន សិលា"
        },
        {
            "barcode": "171116696",
            "dpc": "03034006001",
            "name": "យុន ខេន"
        },
        {
            "barcode": "171116697",
            "dpc": "03034006101",
            "name": "សៀង សុគ្គន្ធ"
        },
        {
            "barcode": "171116698",
            "dpc": "03034006201",
            "name": "ណម សយ"
        },
        {
            "barcode": "171116699",
            "dpc": "03034006301",
            "name": "នុង ឡឹង"
        },
        {
            "barcode": "171116700",
            "dpc": "03034006501",
            "name": "គីម ចំរើន"
        },
        {
            "barcode": "171116701",
            "dpc": "03034006601",
            "name": "ខេង ទី"
        },
        {
            "barcode": "171116702",
            "dpc": "03034006701",
            "name": "ជិន សុដានី"
        },
        {
            "barcode": "171116703",
            "dpc": "03034007101",
            "name": "ឡុង ពិសី"
        },
        {
            "barcode": "171116704",
            "dpc": "03034007201",
            "name": "ហាយ ប៉ូឡូ"
        },
        {
            "barcode": "171116705",
            "dpc": "03034007301",
            "name": "ប៉ាញ ហឿន"
        },
        {
            "barcode": "171116706",
            "dpc": "03034007401",
            "name": "ជុំ គង"
        },
        {
            "barcode": "171116707",
            "dpc": "03034007501",
            "name": "ហួន វិជ័យ"
        },
        {
            "barcode": "171116708",
            "dpc": "03034007601",
            "name": "ជា អេង"
        },
        {
            "barcode": "171116709",
            "dpc": "03034008001",
            "name": "ម៉ា​ លីយ៉ា"
        },
        {
            "barcode": "171116710",
            "dpc": "03034008201",
            "name": "ឆាត់ សុធា"
        },
        {
            "barcode": "171116711",
            "dpc": "03034009401",
            "name": "ហួត សុជាតិ"
        },
        {
            "barcode": "171116712",
            "dpc": "03034010001",
            "name": "ឈិន ណាតុង"
        },
        {
            "barcode": "171116713",
            "dpc": "03034010201",
            "name": "ជាន ណូរ៉ា"
        },
        {
            "barcode": "171116714",
            "dpc": "03034010301",
            "name": "រឿន សារុំ"
        },
        {
            "barcode": "171116715",
            "dpc": "03034010401",
            "name": "ផន ចាន់ថារិទ្ធ"
        },
        {
            "barcode": "171116716",
            "dpc": "03034010501",
            "name": "អ៊ឹម សាញ"
        },
        {
            "barcode": "171116717",
            "dpc": "03034010601",
            "name": "ហេង សុខឡេង"
        },
        {
            "barcode": "171116718",
            "dpc": "03034010701",
            "name": "សោម សុផល"
        },
        {
            "barcode": "171116719",
            "dpc": "03034010801",
            "name": "លឹម ចេង"
        },
        {
            "barcode": "171116720",
            "dpc": "03034022701",
            "name": "រ៉ាត់ ស្រីយ៉ា"
        },
        {
            "barcode": "171116721",
            "dpc": "03034010901",
            "name": "កំ ហ៊ីង"
        },
        {
            "barcode": "171116722",
            "dpc": "03034011001",
            "name": "ប៉ក់ រស់"
        },
        {
            "barcode": "171116723",
            "dpc": "03034011101",
            "name": "ឈិន សាលី"
        },
        {
            "barcode": "171116724",
            "dpc": "03034011201",
            "name": "ស៊ុម នឿន"
        },
        {
            "barcode": "171116725",
            "dpc": "03034011301",
            "name": "កំ ស៊ត"
        },
        {
            "barcode": "171116726",
            "dpc": "03034011401",
            "name": "សេង ហួរ"
        },
        {
            "barcode": "171116727",
            "dpc": "03034011501",
            "name": "សុខ ហេន"
        },
        {
            "barcode": "171116728",
            "dpc": "03034011601",
            "name": "ហួយ សុខរឿន"
        },
        {
            "barcode": "171116729",
            "dpc": "03034011701",
            "name": "ស៊ឹម រួម"
        },
        {
            "barcode": "171116730",
            "dpc": "03034011801",
            "name": "ទិត្យ តែម"
        },
        {
            "barcode": "171116731",
            "dpc": "03034011901",
            "name": "ប្រិម សារិន"
        },
        {
            "barcode": "171116732",
            "dpc": "03034022801",
            "name": "ញឹម ប៉ុន"
        },
        {
            "barcode": "171116733",
            "dpc": "03034012001",
            "name": "ថន ប៊ុនធឿន"
        },
        {
            "barcode": "171116734",
            "dpc": "03034012101",
            "name": "បេន លាង"
        },
        {
            "barcode": "171116735",
            "dpc": "03034012201",
            "name": "សេក សារវឿន"
        },
        {
            "barcode": "171116736",
            "dpc": "03034012301",
            "name": "ឆុន ចាន់ថុល"
        },
        {
            "barcode": "171116737",
            "dpc": "03034012401",
            "name": "មុំ ផាត"
        },
        {
            "barcode": "171116738",
            "dpc": "03034012501",
            "name": "អោម ពីសី"
        },
        {
            "barcode": "171116739",
            "dpc": "03034012601",
            "name": "សួន សំណាង"
        },
        {
            "barcode": "171116740",
            "dpc": "03034012701",
            "name": "ហ៊ន សុខឃួន"
        },
        {
            "barcode": "171116741",
            "dpc": "03034012901",
            "name": "ច្រែង រិទ្ធ"
        },
        {
            "barcode": "171116742",
            "dpc": "03034013001",
            "name": "តិ មាស"
        },
        {
            "barcode": "171116743",
            "dpc": "03034013101",
            "name": "រឿន ចំរើន"
        },
        {
            "barcode": "171116744",
            "dpc": "03034013201",
            "name": "ម៉ក់ សាវុធ"
        },
        {
            "barcode": "171116745",
            "dpc": "03034013301",
            "name": "ស៊ូ ប៊ូ"
        },
        {
            "barcode": "171116746",
            "dpc": "03034013401",
            "name": "ថៃ ប៊ុនណៃ"
        },
        {
            "barcode": "171116747",
            "dpc": "03034013501",
            "name": "អេង គន្ធា"
        },
        {
            "barcode": "171116748",
            "dpc": "03034013601",
            "name": "ខាត់ ថេត"
        },
        {
            "barcode": "171116749",
            "dpc": "03034013701",
            "name": "ទី ចាន់ដារ៉ា"
        },
        {
            "barcode": "171116750",
            "dpc": "03034013901",
            "name": "ឈឹម សុភ័ណ្ណា"
        },
        {
            "barcode": "171116751",
            "dpc": "03034013801",
            "name": "ប្រាក់ បូរាណ"
        },
        {
            "barcode": "171116752",
            "dpc": "03034014001",
            "name": "ឃី សុផា"
        },
        {
            "barcode": "171116753",
            "dpc": "03034014101",
            "name": "ឃី សុផល"
        },
        {
            "barcode": "171116754",
            "dpc": "03034014501",
            "name": "នូ អេងសំរិទ្ធ"
        },
        {
            "barcode": "171116755",
            "dpc": "03034014601",
            "name": "សុខ អ៊ីម"
        },
        {
            "barcode": "171116756",
            "dpc": "03034014801",
            "name": "ស៊ីម គឹមណា"
        },
        {
            "barcode": "171116757",
            "dpc": "03034014901",
            "name": "វង់ នីកា"
        },
        {
            "barcode": "171116758",
            "dpc": "03034015001",
            "name": "សុខ ធីតា"
        },
        {
            "barcode": "171116759",
            "dpc": "03034015701",
            "name": "ហង់ លីលី"
        },
        {
            "barcode": "171116760",
            "dpc": "03034015801",
            "name": "ឯក ពៅ"
        },
        {
            "barcode": "171116761",
            "dpc": "03034015901",
            "name": "សម្បត្តិ សោភ័ណ្ខ"
        },
        {
            "barcode": "171116762",
            "dpc": "03034016001",
            "name": "ហ៊ុន គា"
        },
        {
            "barcode": "171116763",
            "dpc": "03034016101",
            "name": "ម៉េង លី"
        },
        {
            "barcode": "171116764",
            "dpc": "03034016201",
            "name": "ងិន ម៉ៅ"
        },
        {
            "barcode": "171116765",
            "dpc": "03034016301",
            "name": "ផុស សុគា"
        },
        {
            "barcode": "171116766",
            "dpc": "03034016401",
            "name": "រាជ សុវណ្ណារិទ្ធ"
        },
        {
            "barcode": "171116767",
            "dpc": "03034016501",
            "name": "តាំង ឡាយហ៊ាង"
        },
        {
            "barcode": "171116768",
            "dpc": "03034016601",
            "name": "ប៉ែន កុលវុធ"
        },
        {
            "barcode": "171116769",
            "dpc": "03034016701",
            "name": "ឡុង ធារី"
        },
        {
            "barcode": "171116770",
            "dpc": "03034016801",
            "name": "ជៀវ វុធន"
        },
        {
            "barcode": "171116771",
            "dpc": "03034016901",
            "name": "ប៊ាន ហុកតេ"
        },
        {
            "barcode": "171116772",
            "dpc": "03034017001",
            "name": "ខន សោភា"
        },
        {
            "barcode": "171116773",
            "dpc": "03034017101",
            "name": "សៅ ប៊ុនធឿន"
        },
        {
            "barcode": "171116774",
            "dpc": "03034017501",
            "name": "ប៊ិន សុផាត"
        },
        {
            "barcode": "171116775",
            "dpc": "03034017601",
            "name": "សុខ ជា"
        },
        {
            "barcode": "171116776",
            "dpc": "03034017701",
            "name": "ផែន វេត"
        },
        {
            "barcode": "171116777",
            "dpc": "03034017801",
            "name": "គី ជុនអេង"
        },
        {
            "barcode": "171116778",
            "dpc": "03034017901",
            "name": "គឹម សុវឌ្ឍនា"
        },
        {
            "barcode": "171116779",
            "dpc": "03034018001",
            "name": "ឆាយ បូរ៉ា"
        },
        {
            "barcode": "171116780",
            "dpc": "03034018101",
            "name": "ឆាន់ ពៅ"
        },
        {
            "barcode": "171116781",
            "dpc": "03034018201",
            "name": "ឃុន ហេង"
        },
        {
            "barcode": "171116782",
            "dpc": "03034018301",
            "name": "គក គីម"
        },
        {
            "barcode": "171116783",
            "dpc": "03034018401",
            "name": "ហុក ចាន់កញ្ញា"
        },
        {
            "barcode": "171116784",
            "dpc": "03034018501",
            "name": "ឆ អ៊ីង"
        },
        {
            "barcode": "171116785",
            "dpc": "03034018601",
            "name": "ជា សុជាតិ"
        },
        {
            "barcode": "171116786",
            "dpc": "03034018701",
            "name": "ញ៉ែម ចាន់ថន"
        },
        {
            "barcode": "171116787",
            "dpc": "03034018801",
            "name": "វ៉ុង សារ៉ាត់"
        },
        {
            "barcode": "171116788",
            "dpc": "03034018901",
            "name": "សុខ ងិ"
        },
        {
            "barcode": "171116789",
            "dpc": "03034019001",
            "name": "ស៊ន ហួត"
        },
        {
            "barcode": "171116790",
            "dpc": "03034019101",
            "name": "អឿន ព្រំ"
        },
        {
            "barcode": "171116791",
            "dpc": "03034019201",
            "name": "ចិន សន"
        },
        {
            "barcode": "171116792",
            "dpc": "03034019301",
            "name": "ឆូ គង់ម៉េង"
        },
        {
            "barcode": "171116793",
            "dpc": "03034019401",
            "name": "ហេង យាន"
        },
        {
            "barcode": "171116794",
            "dpc": "03034019501",
            "name": "កៅ សាវិន"
        },
        {
            "barcode": "171116795",
            "dpc": "03034019601",
            "name": "នួន សុភា"
        },
        {
            "barcode": "171116796",
            "dpc": "03034019701",
            "name": "ឃុំ សួម"
        },
        {
            "barcode": "171116797",
            "dpc": "03034019801",
            "name": "ណែម សុខសាន"
        },
        {
            "barcode": "171116798",
            "dpc": "03034019901",
            "name": "ស៊ុំ សុវណ្ណា"
        },
        {
            "barcode": "171116799",
            "dpc": "03034020101",
            "name": "សឿម សារិទ្ធ"
        },
        {
            "barcode": "171116800",
            "dpc": "03034020201",
            "name": "ព្រឿង សាវុន"
        },
        {
            "barcode": "171116801",
            "dpc": "03034020301",
            "name": "មាឃ ស្រូយ"
        },
        {
            "barcode": "171116802",
            "dpc": "03034020401",
            "name": "សាន សាហ៊ុន"
        },
        {
            "barcode": "171116803",
            "dpc": "03034020501",
            "name": "ផា ស៊ីណា"
        },
        {
            "barcode": "171116804",
            "dpc": "03034020601",
            "name": "កេត ផាន"
        },
        {
            "barcode": "171116805",
            "dpc": "03034020701",
            "name": "មាស នីតា"
        },
        {
            "barcode": "171116806",
            "dpc": "03034020801",
            "name": "ស្រឹង ប៊ុនសឿន"
        },
        {
            "barcode": "171116807",
            "dpc": "03034020901",
            "name": "ជុំ ចំណាន"
        },
        {
            "barcode": "171116808",
            "dpc": "03034021001",
            "name": "រ៉េន ផល្លា"
        },
        {
            "barcode": "171116809",
            "dpc": "03034021101",
            "name": "ជុន និមល៏"
        },
        {
            "barcode": "171116810",
            "dpc": "03034021201",
            "name": "សួ ចំរើន"
        },
        {
            "barcode": "171116811",
            "dpc": "03034021301",
            "name": "លាង​​​ មុំ"
        },
        {
            "barcode": "171116812",
            "dpc": "03034021401",
            "name": "អៀង សេងលី"
        },
        {
            "barcode": "171116813",
            "dpc": "03034021501",
            "name": "ហេង ស៊ុនវេង"
        },
        {
            "barcode": "171116814",
            "dpc": "03034021601",
            "name": "សំ សុខ"
        },
        {
            "barcode": "171116815",
            "dpc": "03034021701",
            "name": "ញឹម ញ៉ុន"
        },
        {
            "barcode": "171116816",
            "dpc": "03034021801",
            "name": "ហោ សុខលន់"
        },
        {
            "barcode": "171116817",
            "dpc": "03034021901",
            "name": "អា ស្រី"
        },
        {
            "barcode": "171116818",
            "dpc": "03034022001",
            "name": "លី ស៊ីវហួយ"
        },
        {
            "barcode": "171116819",
            "dpc": "03034022101",
            "name": "ម៉ៅ សំកុល"
        },
        {
            "barcode": "171116820",
            "dpc": "03034022301",
            "name": "ចាន់ យាត្រា"
        },
        {
            "barcode": "171116821",
            "dpc": "03034022401",
            "name": "អ៊ុក យឹម"
        },
        {
            "barcode": "171116822",
            "dpc": "03034022501",
            "name": "កែវ កុសល"
        },
        {
            "barcode": "171116823",
            "dpc": "03034022601",
            "name": "សេក សាន្ត"
        },
        {
            "barcode": "171116824",
            "dpc": "03034022901",
            "name": "គង់ លី"
        },
        {
            "barcode": "171116825",
            "dpc": "03034023201",
            "name": "សៅ កុសល"
        },
        {
            "barcode": "171116826",
            "dpc": "03034023101",
            "name": "គា សុគន្ធី"
        },
        {
            "barcode": "171116827",
            "dpc": "03034023301",
            "name": "ផាន់ វ៉ាត់"
        },
        {
            "barcode": "171116828",
            "dpc": "03034023501",
            "name": "ឯម សុផល"
        },
        {
            "barcode": "171116829",
            "dpc": "03034023601",
            "name": "ជួន កក្តដា"
        },
        {
            "barcode": "171116830",
            "dpc": "03034023701",
            "name": "ជួន រីន"
        },
        {
            "barcode": "171116831",
            "dpc": "03034023801",
            "name": "ជួន វណ្ណា"
        },
        {
            "barcode": "171116832",
            "dpc": "03034023901",
            "name": "ហ៊ី គឹមលាង"
        },
        {
            "barcode": "171116833",
            "dpc": "03034024101",
            "name": "សួន សុទ្ទស្រីតា"
        },
        {
            "barcode": "171116834",
            "dpc": "03034024201",
            "name": "ពៅ ថាវតី"
        },
        {
            "barcode": "171116835",
            "dpc": "03034024301",
            "name": "ចាន់ មករា"
        },
        {
            "barcode": "171116836",
            "dpc": "03034024401",
            "name": "ចាន់ សុវណ្ណរ័ត្ន"
        },
        {
            "barcode": "171116837",
            "dpc": "03034024501",
            "name": "លឹម យ៉ុង"
        },
        {
            "barcode": "171116838",
            "dpc": "03034024601",
            "name": "លាង ដាឡាត់"
        },
        {
            "barcode": "171116839",
            "dpc": "03034024701",
            "name": "ឈៀង សុផល"
        },
        {
            "barcode": "171116840",
            "dpc": "03034024801",
            "name": "សាមុត ប៉ិច"
        },
        {
            "barcode": "171116841",
            "dpc": "03034024901",
            "name": "អ៊ុក ចិន្តា"
        },
        {
            "barcode": "171116842",
            "dpc": "03034025001",
            "name": "ហែម សំណាង"
        },
        {
            "barcode": "171116843",
            "dpc": "03034025101",
            "name": "នួន សីលា"
        },
        {
            "barcode": "171116844",
            "dpc": "03034025201",
            "name": "ហួត ម៉ាន់"
        },
        {
            "barcode": "171116845",
            "dpc": "03034025301",
            "name": "ម៉ៅ ឈឿន"
        },
        {
            "barcode": "171116846",
            "dpc": "03034025501",
            "name": "ឡាយ សុខន"
        },
        {
            "barcode": "171116847",
            "dpc": "03034025601",
            "name": "ឡុង ស៊ីណា"
        },
        {
            "barcode": "171116848",
            "dpc": "03034025701",
            "name": "ជន ចាន់ស្រី"
        },
        {
            "barcode": "171116849",
            "dpc": "03034025801",
            "name": "លី សូរិយា"
        },
        {
            "barcode": "171116850",
            "dpc": "03034025901",
            "name": "ហេង ឆាយលី"
        },
        {
            "barcode": "171116851",
            "dpc": "03034026001",
            "name": "វត្តដំរីសកុដិលេខ១០"
        },
        {
            "barcode": "171116852",
            "dpc": "03034026101",
            "name": "ឌុក ឆវុត"
        },
        {
            "barcode": "171116853",
            "dpc": "03034026201",
            "name": "ញ៉ែម ហឿន"
        }
    ]
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});