

let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=
    [
        {
            "barcode": "171118832",
            "dpc": "03024300101",
            "name": "កែម រតនា"
        },
        {
            "barcode": "171118833",
            "dpc": "03024300201",
            "name": "ស៊ិន សុទ្ធ"
        },
        {
            "barcode": "171118834",
            "dpc": "03024300301",
            "name": "តុក ស៊ីវគៀង"
        },
        {
            "barcode": "171118835",
            "dpc": "03024300401",
            "name": "ទាវ កៅ"
        },
        {
            "barcode": "171118836",
            "dpc": "03024300501",
            "name": "ឡុង ស៊ាងអេន"
        },
        {
            "barcode": "171118837",
            "dpc": "03024300601",
            "name": "ជៀម រ៉ាន់"
        },
        {
            "barcode": "171118838",
            "dpc": "03024300701",
            "name": "យីវ វណ្ណ:"
        },
        {
            "barcode": "171118839",
            "dpc": "03024300801",
            "name": "ប៊ូ ពេជ្រ"
        },
        {
            "barcode": "171118840",
            "dpc": "03024300901",
            "name": "ឈឺន សារឿន"
        },
        {
            "barcode": "171118841",
            "dpc": "03024301001",
            "name": "សឿន កុសល់"
        },
        {
            "barcode": "171118842",
            "dpc": "03024301101",
            "name": "ងូន ភា"
        },
        {
            "barcode": "171118843",
            "dpc": "03024301201",
            "name": "អ៊ុំ ឡុញ"
        },
        {
            "barcode": "171118844",
            "dpc": "03024301301",
            "name": "ប៊ូ ម៉ាច"
        },
        {
            "barcode": "171118845",
            "dpc": "03024301601",
            "name": "ស៊ុប ម៉ាន"
        },
        {
            "barcode": "171118846",
            "dpc": "03024301701",
            "name": "ស្រី យ៉ាត"
        },
        {
            "barcode": "171118847",
            "dpc": "03024301801",
            "name": "ម៉ម សុផា"
        },
        {
            "barcode": "171118848",
            "dpc": "03024302001",
            "name": "ហ៊ុន ធីម"
        },
        {
            "barcode": "171118849",
            "dpc": "03024302101",
            "name": "វ៉ន សុវណ្ណ"
        },
        {
            "barcode": "171118850",
            "dpc": "03024302201",
            "name": "ភាជ សុខុម"
        },
        {
            "barcode": "171118851",
            "dpc": "03024302301",
            "name": "មឿក សុភា"
        },
        {
            "barcode": "171118852",
            "dpc": "03024302401",
            "name": "មាស សាម៉ុន"
        },
        {
            "barcode": "171118853",
            "dpc": "03024302501",
            "name": "សុះ ហុង"
        },
        {
            "barcode": "171118854",
            "dpc": "03024302801",
            "name": "ផាត់ ទីម៉ាស"
        },
        {
            "barcode": "171118855",
            "dpc": "03024302901",
            "name": "អួន ឡាត់"
        },
        {
            "barcode": "171118856",
            "dpc": "03024303001",
            "name": "លី ទូច"
        },
        {
            "barcode": "171118857",
            "dpc": "03024303101",
            "name": "សូន សារិន"
        },
        {
            "barcode": "171118858",
            "dpc": "03024303301",
            "name": "លី ឡាយ"
        },
        {
            "barcode": "171118859",
            "dpc": "03024303401",
            "name": "ឡម ផាន"
        },
        {
            "barcode": "171118860",
            "dpc": "03024303601",
            "name": "យក់ រ៉េន"
        },
        {
            "barcode": "171118861",
            "dpc": "03024303701",
            "name": "ចាន់ សុផាវី"
        },
        {
            "barcode": "171118862",
            "dpc": "03024303901",
            "name": "ប៉ិច សួស"
        },
        {
            "barcode": "171118863",
            "dpc": "03024304001",
            "name": "ភួង អឿន"
        },
        {
            "barcode": "171118864",
            "dpc": "03024304101",
            "name": "គីម សំអុល"
        },
        {
            "barcode": "171118865",
            "dpc": "03024304201",
            "name": "សំរិទ្ធ លុច"
        },
        {
            "barcode": "171118866",
            "dpc": "03024304301",
            "name": "វី រ៉ាវ៉ាត់"
        },
        {
            "barcode": "171118867",
            "dpc": "03024304401",
            "name": "យ័ន ណាត"
        },
        {
            "barcode": "171118868",
            "dpc": "03024304501",
            "name": "សាន់ ស៊ីន"
        },
        {
            "barcode": "171118869",
            "dpc": "03024304601",
            "name": "រីម លន់"
        },
        {
            "barcode": "171118870",
            "dpc": "03024304901",
            "name": "នឹម ចំណាន"
        },
        {
            "barcode": "171118871",
            "dpc": "03024305001",
            "name": "រុន វុទ្ទី"
        },
        {
            "barcode": "171118872",
            "dpc": "03024305101",
            "name": "ណុម រ៉េត"
        },
        {
            "barcode": "171118873",
            "dpc": "03024305201",
            "name": "ឈិន ឡា"
        },
        {
            "barcode": "171118874",
            "dpc": "03024305301",
            "name": "ជា សំហុន"
        },
        {
            "barcode": "171118875",
            "dpc": "03024305401",
            "name": "សេង រីហ៊"
        },
        {
            "barcode": "171118876",
            "dpc": "03024305501",
            "name": "ភឿក រ៉ាត"
        },
        {
            "barcode": "171118877",
            "dpc": "03024305601",
            "name": "លួត ចាន់ថុល"
        },
        {
            "barcode": "171118878",
            "dpc": "03024305701",
            "name": "សុត ស៊ីណា"
        },
        {
            "barcode": "171118879",
            "dpc": "03024305801",
            "name": "សឿន សំអាន"
        },
        {
            "barcode": "171118880",
            "dpc": "03024305901",
            "name": "រឿម មុំ"
        },
        {
            "barcode": "171118881",
            "dpc": "03024306001",
            "name": "ខែក ឡាង"
        },
        {
            "barcode": "171118882",
            "dpc": "03024306101",
            "name": "ភាជ ឈាន"
        },
        {
            "barcode": "171118883",
            "dpc": "03024306201",
            "name": "តូច វួចហួយ"
        },
        {
            "barcode": "171118884",
            "dpc": "03024306301",
            "name": "ថាវ ឌឿក"
        },
        {
            "barcode": "171118885",
            "dpc": "03024306401",
            "name": "ផាន់ ប៊ុនធួន"
        },
        {
            "barcode": "171118886",
            "dpc": "03024306501",
            "name": "ផាន សុភា"
        },
        {
            "barcode": "171118887",
            "dpc": "03024306601",
            "name": "ឈន ឆាន"
        },
        {
            "barcode": "171118888",
            "dpc": "03024306701",
            "name": "ប៊ុត សាម៉េត"
        },
        {
            "barcode": "171118889",
            "dpc": "03024306801",
            "name": "ឈិន កក្កដា"
        },
        {
            "barcode": "171118890",
            "dpc": "03024307001",
            "name": "រ៉ាត់ ចិត្រា"
        },
        {
            "barcode": "171118891",
            "dpc": "03024307201",
            "name": "ហម លាភី"
        },
        {
            "barcode": "171118892",
            "dpc": "03024307401",
            "name": "ប៊ួ រ៉ាធីម"
        },
        {
            "barcode": "171118893",
            "dpc": "03024307501",
            "name": "ម៉ុត ស្រីរដ្ឋ"
        },
        {
            "barcode": "171118894",
            "dpc": "03024307801",
            "name": "ផ្ទះលេខ214"
        },
        {
            "barcode": "171118895",
            "dpc": "03024307901",
            "name": "ផ្ទះលេខ139"
        },
        {
            "barcode": "171118896",
            "dpc": "03024308001",
            "name": "ម៉ាលីស"
        },
        {
            "barcode": "171118897",
            "dpc": "03024308301",
            "name": "សាន សោភា"
        },
        {
            "barcode": "171118898",
            "dpc": "03024308401",
            "name": "ហម សុជាតិ"
        },
        {
            "barcode": "171118899",
            "dpc": "03024308501",
            "name": "ប៊ុន សុវណ្ណ"
        },
        {
            "barcode": "171118900",
            "dpc": "03024308601",
            "name": "អឹម ប៊ីន"
        },
        {
            "barcode": "171118901",
            "dpc": "03024308701",
            "name": "ទ្រិញ សម្បត្តិ"
        },
        {
            "barcode": "171118902",
            "dpc": "03024308801",
            "name": "ឆាយ បូរ៉ាទីន"
        },
        {
            "barcode": "171118903",
            "dpc": "03024308901",
            "name": "ឌឹម រិទ្ធិ"
        },
        {
            "barcode": "171118904",
            "dpc": "03024309001",
            "name": "ចាន់ ផល្លា"
        },
        {
            "barcode": "171118905",
            "dpc": "03024309101",
            "name": "ឈុន សាន"
        },
        {
            "barcode": "171118906",
            "dpc": "03024309201",
            "name": "បាន ឡង២"
        },
        {
            "barcode": "171118907",
            "dpc": "03024309301",
            "name": "ម៉ៅ សារ៉ាវុធ"
        },
        {
            "barcode": "171118908",
            "dpc": "03024309401",
            "name": "ហ៊ីង គីរីរ័ត្ន"
        },
        {
            "barcode": "171118909",
            "dpc": "03024309801",
            "name": "ជឺ តុងសួរ"
        },
        {
            "barcode": "171118910",
            "dpc": "03024310301",
            "name": "ឡុង រ័ត្នមុន្នី"
        },
        {
            "barcode": "171118911",
            "dpc": "03024310401",
            "name": "នូន ផល្លី"
        },
        {
            "barcode": "171118912",
            "dpc": "03024310501",
            "name": "ហេង លី"
        },
        {
            "barcode": "171118913",
            "dpc": "03024310801",
            "name": "ហូរ ទិត្យ"
        },
        {
            "barcode": "171118914",
            "dpc": "03024310901",
            "name": "ហេង យាន"
        },
        {
            "barcode": "171118915",
            "dpc": "03024311001",
            "name": "ភួ ហុកហ៊ី១"
        },
        {
            "barcode": "171118916",
            "dpc": "03024311101",
            "name": "ភួ ហុកហ៊ី២"
        },
        {
            "barcode": "171118917",
            "dpc": "03024311201",
            "name": "ភួ ហុកហ៊ី៣"
        },
        {
            "barcode": "171118918",
            "dpc": "03024311301",
            "name": "ផាត សុផានិត"
        },
        {
            "barcode": "171118919",
            "dpc": "03024311401",
            "name": "សាយ ស៊ីណា"
        },
        {
            "barcode": "171118920",
            "dpc": "03024311501",
            "name": "សៅ ឆម"
        },
        {
            "barcode": "171118921",
            "dpc": "03024311601",
            "name": "ឈាង សារ៉ន"
        },
        {
            "barcode": "171118922",
            "dpc": "03024311701",
            "name": "ជា កែវ"
        },
        {
            "barcode": "171118923",
            "dpc": "03024311801",
            "name": "នួន បុប្ភា"
        },
        {
            "barcode": "171118924",
            "dpc": "03024311901",
            "name": "អ៊ុន ចន្ថា"
        },
        {
            "barcode": "171118925",
            "dpc": "03024312001",
            "name": "អឿន គីមសេង"
        },
        {
            "barcode": "171118926",
            "dpc": "03024312101",
            "name": "គង់ ថេត"
        },
        {
            "barcode": "171118927",
            "dpc": "03024312201",
            "name": "ច័ន្ទ ដារ៉ា"
        },
        {
            "barcode": "171118928",
            "dpc": "03024312301",
            "name": "សេង ឡេង"
        },
        {
            "barcode": "171118929",
            "dpc": "03024312401",
            "name": "សាំ ប៊ី"
        },
        {
            "barcode": "171118930",
            "dpc": "03024312501",
            "name": "ដួង សុភ័ក្រ"
        },
        {
            "barcode": "171118931",
            "dpc": "03024312801",
            "name": "គី ជិនតូ"
        },
        {
            "barcode": "171118932",
            "dpc": "03024312901",
            "name": "ផាន់ វុទ្ទី"
        },
        {
            "barcode": "171118933",
            "dpc": "03024313001",
            "name": "ជា វន្ថា"
        },
        {
            "barcode": "171118934",
            "dpc": "03024313101",
            "name": "យាន យុន"
        },
        {
            "barcode": "171118935",
            "dpc": "03024313201",
            "name": "រ៉ាត សុភ័ក"
        },
        {
            "barcode": "171118936",
            "dpc": "03024313301",
            "name": "ធឿន ចេក"
        },
        {
            "barcode": "171118937",
            "dpc": "03024313401",
            "name": "សុក ហ៊"
        },
        {
            "barcode": "171118938",
            "dpc": "03024313501",
            "name": "ជា យ៉ាន"
        },
        {
            "barcode": "171118939",
            "dpc": "03024313601",
            "name": "ម៉ៅ ឡា"
        },
        {
            "barcode": "171118940",
            "dpc": "03024313701",
            "name": "ពត សុខេន"
        },
        {
            "barcode": "171118941",
            "dpc": "03024313801",
            "name": "វឹង រ័ត្ន"
        },
        {
            "barcode": "171118942",
            "dpc": "03024313901",
            "name": "ចាន់ ត្រា"
        },
        {
            "barcode": "171118943",
            "dpc": "03024314001",
            "name": "កប គិន"
        },
        {
            "barcode": "171118944",
            "dpc": "03024314201",
            "name": "ភី ជន"
        },
        {
            "barcode": "171118945",
            "dpc": "03024314301",
            "name": "យ៉ៅ វ៉ា"
        },
        {
            "barcode": "171118946",
            "dpc": "03024314401",
            "name": "យ៉ៅ អូន"
        },
        {
            "barcode": "171118947",
            "dpc": "03024314601",
            "name": "ទូច ព្រឿន"
        },
        {
            "barcode": "171118948",
            "dpc": "03024314701",
            "name": "ទី"
        },
        {
            "barcode": "171118949",
            "dpc": "03024314801",
            "name": "គី សុជាតិ"
        },
        {
            "barcode": "171118950",
            "dpc": "03024314901",
            "name": "ឡេង ណាល់"
        },
        {
            "barcode": "171118951",
            "dpc": "03024315001",
            "name": "គី សាវិញ"
        },
        {
            "barcode": "171118952",
            "dpc": "03024315101",
            "name": "ហុង វណ្ណដេត"
        },
        {
            "barcode": "171118953",
            "dpc": "03024315201",
            "name": "ញ៉េន ញ៉ាវ"
        },
        {
            "barcode": "171118954",
            "dpc": "03024315301",
            "name": "ហេង គុណ"
        },
        {
            "barcode": "171118955",
            "dpc": "03024315401",
            "name": "ជុំ សារ័ត្ន"
        },
        {
            "barcode": "171118956",
            "dpc": "03024315501",
            "name": "ហេង បូរី"
        },
        {
            "barcode": "171118957",
            "dpc": "03024315601",
            "name": "នី អាន"
        },
        {
            "barcode": "171118958",
            "dpc": "03024315701",
            "name": "សឺន ម៉ៅ"
        },
        {
            "barcode": "171118959",
            "dpc": "03024315801",
            "name": "សុខ សុភ័ក្រ"
        },
        {
            "barcode": "171118960",
            "dpc": "03024316001",
            "name": "ហ៊ត សុធីណា"
        },
        {
            "barcode": "171118961",
            "dpc": "03024316101",
            "name": "សេង សុយ៉ាដា"
        },
        {
            "barcode": "171118962",
            "dpc": "03024316201",
            "name": "អឹម ដារ៉ា"
        },
        {
            "barcode": "171118963",
            "dpc": "03024316301",
            "name": "ជា សុធាវី"
        },
        {
            "barcode": "171118964",
            "dpc": "03024316401",
            "name": "មាង ឡែន"
        },
        {
            "barcode": "171118965",
            "dpc": "03024316501",
            "name": "សេង ប៊ុនសួរ"
        },
        {
            "barcode": "171118966",
            "dpc": "03024316601",
            "name": "សៅ លឹមស្រៀង"
        },
        {
            "barcode": "171118967",
            "dpc": "03024316701",
            "name": "ហាប់ គឹមហាក់"
        },
        {
            "barcode": "171118968",
            "dpc": "03024316901",
            "name": "រស់ សុផល"
        },
        {
            "barcode": "171118969",
            "dpc": "03024317101",
            "name": "ចាន់ ប៊ុនធឿន"
        },
        {
            "barcode": "171118970",
            "dpc": "03024317201",
            "name": "ហ៊ុច សុវណ្ណ"
        },
        {
            "barcode": "171118971",
            "dpc": "03024317301",
            "name": "ប៉ិញ ឈាងហាក់"
        },
        {
            "barcode": "171118972",
            "dpc": "03024317401",
            "name": "កែវ ធានី"
        },
        {
            "barcode": "171118973",
            "dpc": "03024317501",
            "name": "ផាន់ ស្រស់"
        },
        {
            "barcode": "171118974",
            "dpc": "03024317601",
            "name": "លឹម លេងអៀង"
        },
        {
            "barcode": "171118975",
            "dpc": "03024317701",
            "name": "ញ៉ឹម ដារ៉ា"
        },
        {
            "barcode": "171118976",
            "dpc": "03024318001",
            "name": "ប៉ិច ភៅ"
        },
        {
            "barcode": "171118977",
            "dpc": "03024318101",
            "name": "ប៉ុក សុផារី"
        },
        {
            "barcode": "171118978",
            "dpc": "03024318201",
            "name": "សែ ធារិទ្ធ"
        },
        {
            "barcode": "171118979",
            "dpc": "03024318301",
            "name": "ចាន់ លាភ"
        },
        {
            "barcode": "171118980",
            "dpc": "03024318401",
            "name": "សុខ សុវណ្ណរិទ្ធ"
        },
        {
            "barcode": "171118981",
            "dpc": "03024318501",
            "name": "ឈិន ស"
        },
        {
            "barcode": "171118982",
            "dpc": "03024318601",
            "name": "ទួន ចំរើន"
        },
        {
            "barcode": "171118983",
            "dpc": "03024318701",
            "name": "សុខ កុសល់"
        },
        {
            "barcode": "171118984",
            "dpc": "03024318801",
            "name": "ឆៃ សុភាព"
        },
        {
            "barcode": "171118985",
            "dpc": "03024318901",
            "name": "អ៊ួក រ៉េន"
        },
        {
            "barcode": "171118986",
            "dpc": "03024319001",
            "name": "លី ខន"
        },
        {
            "barcode": "171118987",
            "dpc": "03024319101",
            "name": "សុខ ពឿន"
        },
        {
            "barcode": "171118988",
            "dpc": "03024319201",
            "name": "គឹម ហ៊ុន"
        },
        {
            "barcode": "171118989",
            "dpc": "03024319301",
            "name": "ឆម សាង"
        },
        {
            "barcode": "171118990",
            "dpc": "03024319401",
            "name": "សេក សាលី"
        },
        {
            "barcode": "171118991",
            "dpc": "03024319501",
            "name": "ជ័យ វណ្ណី"
        },
        {
            "barcode": "171118992",
            "dpc": "03024319701",
            "name": "សន សុផល"
        },
        {
            "barcode": "171118993",
            "dpc": "03024319801",
            "name": "ជួន ស៊ីវន្ថា"
        },
        {
            "barcode": "171118994",
            "dpc": "03024319901",
            "name": "រិន រំដួល"
        },
        {
            "barcode": "171118995",
            "dpc": "03024320001",
            "name": "គង់ ទ្រី"
        },
        {
            "barcode": "171118996",
            "dpc": "03024320101",
            "name": "សុខ នា"
        },
        {
            "barcode": "171118997",
            "dpc": "03024320201",
            "name": "ក្នាន សម្ផស្ស"
        },
        {
            "barcode": "171118998",
            "dpc": "03024320301",
            "name": "តឹក សារ៉េត"
        },
        {
            "barcode": "171118999",
            "dpc": "03024320401",
            "name": "ចិន ឡៃប៉ាល់"
        },
        {
            "barcode": "171119000",
            "dpc": "03024320501",
            "name": "ឆេង លី"
        },
        {
            "barcode": "171119001",
            "dpc": "03024320701",
            "name": "ឯក សុផល"
        },
        {
            "barcode": "171119002",
            "dpc": "03024320801",
            "name": "ហេង ហោ"
        },
        {
            "barcode": "171119003",
            "dpc": "03024320901",
            "name": "ម៉ែត ពេញ"
        },
        {
            "barcode": "171119004",
            "dpc": "03024321001",
            "name": "ឈឿម សុភាព"
        },
        {
            "barcode": "171119005",
            "dpc": "03024321101",
            "name": "ហួន សាយ័ន្ត"
        },
        {
            "barcode": "171119006",
            "dpc": "03024321201",
            "name": "តាំង សុខអេង"
        },
        {
            "barcode": "171119007",
            "dpc": "03024321301",
            "name": "ចាន់ ធឿន"
        },
        {
            "barcode": "171119008",
            "dpc": "03024321401",
            "name": "រឿន សុឃឿន"
        },
        {
            "barcode": "171119009",
            "dpc": "03024321501",
            "name": "ម៉ៅ វុទ្ធី"
        },
        {
            "barcode": "171119010",
            "dpc": "03024321601",
            "name": "រ័ត្ន ស៊ុននារី"
        },
        {
            "barcode": "171119011",
            "dpc": "03024321701",
            "name": "សៅ ឈី"
        },
        {
            "barcode": "171119012",
            "dpc": "03024321801",
            "name": "នី សំអាត"
        },
        {
            "barcode": "171119013",
            "dpc": "03024321901",
            "name": "ស៊ីម ស៊ីន"
        },
        {
            "barcode": "171119014",
            "dpc": "03024322001",
            "name": "សុខ សំ"
        },
        {
            "barcode": "171119015",
            "dpc": "03024322101",
            "name": "រ៉ូវ អ៊ី"
        },
        {
            "barcode": "171119016",
            "dpc": "03024322201",
            "name": "រស់ ហាន"
        },
        {
            "barcode": "171119017",
            "dpc": "03024322301",
            "name": "រស់ ហៀង"
        },
        {
            "barcode": "171119018",
            "dpc": "03024322401",
            "name": "យិន កុសល់"
        },
        {
            "barcode": "171119019",
            "dpc": "03024322601",
            "name": "ហៀក គ្រី"
        },
        {
            "barcode": "171119020",
            "dpc": "03024322701",
            "name": "ជា សឿន"
        },
        {
            "barcode": "171119021",
            "dpc": "03024322801",
            "name": "ប៊ុន លី"
        },
        {
            "barcode": "171119022",
            "dpc": "03024323001",
            "name": "លិម ផៃអេង"
        },
        {
            "barcode": "171119023",
            "dpc": "03024323101",
            "name": "ម៉ក់ សុឆេប"
        },
        {
            "barcode": "171119024",
            "dpc": "03024323201",
            "name": "តូច សារិទ្ធ"
        },
        {
            "barcode": "171119025",
            "dpc": "03024323301",
            "name": "ជា សុបិន"
        },
        {
            "barcode": "171119026",
            "dpc": "03024323501",
            "name": "គីម លី"
        },
        {
            "barcode": "171119027",
            "dpc": "03024323601",
            "name": "ចេវ នាង"
        },
        {
            "barcode": "171119028",
            "dpc": "03024323701",
            "name": "ប៉ូច វឌ្ឍនា"
        },
        {
            "barcode": "171119029",
            "dpc": "03024323801",
            "name": "ទឹម សុភា"
        },
        {
            "barcode": "171119030",
            "dpc": "03024323901",
            "name": "អ៊ុយ ឈាន"
        },
        {
            "barcode": "171119031",
            "dpc": "03024324001",
            "name": "ភោគ សុភី"
        },
        {
            "barcode": "171119032",
            "dpc": "03024324101",
            "name": "ហេង បូរ៉ា"
        },
        {
            "barcode": "171119033",
            "dpc": "03024324201",
            "name": "ម៉ែន សារិន"
        },
        {
            "barcode": "171119034",
            "dpc": "03024324301",
            "name": "ផេង សុភា"
        },
        {
            "barcode": "171119035",
            "dpc": "03024324401",
            "name": "លី សុខា"
        },
        {
            "barcode": "171119036",
            "dpc": "03024324501",
            "name": "ខឹម វណ្ណារី"
        },
        {
            "barcode": "171119037",
            "dpc": "03024324801",
            "name": "ហេង គឹមលាង"
        },
        {
            "barcode": "171119038",
            "dpc": "03024324901",
            "name": "គឹម ផេងអាន"
        },
        {
            "barcode": "171119039",
            "dpc": "03024325001",
            "name": "យាន តិ"
        },
        {
            "barcode": "171119040",
            "dpc": "03024325101",
            "name": "ប៊ូ ម៉ាប់"
        },
        {
            "barcode": "171119041",
            "dpc": "03024325201",
            "name": "ស្រ៊ាង ស្រីទូច"
        },
        {
            "barcode": "171119042",
            "dpc": "03024325301",
            "name": "ហាត ហាក់"
        },
        {
            "barcode": "171119043",
            "dpc": "03024325401",
            "name": "អ៊ុន ឈួន"
        },
        {
            "barcode": "171119044",
            "dpc": "03024325501",
            "name": "ប៉ិច ម៉ៅ"
        },
        {
            "barcode": "171119045",
            "dpc": "03024325601",
            "name": "លឹម លីណា"
        },
        {
            "barcode": "171119046",
            "dpc": "03024325701",
            "name": "អឿន សំអាត"
        },
        {
            "barcode": "171119047",
            "dpc": "03024325801",
            "name": "សោម ណារិន"
        },
        {
            "barcode": "171119048",
            "dpc": "03024325901",
            "name": "ប៉ោក ចាន់ថន"
        },
        {
            "barcode": "171119049",
            "dpc": "03024326101",
            "name": "ណុប ណារ៉ា ៧"
        },
        {
            "barcode": "171119050",
            "dpc": "03024326201",
            "name": "ហង់ រស់"
        },
        {
            "barcode": "171119051",
            "dpc": "03024326301",
            "name": "ណុប ណារ៉ា ៨"
        },
        {
            "barcode": "171119052",
            "dpc": "03024326401",
            "name": "តឿន ពិសាល"
        },
        {
            "barcode": "171119053",
            "dpc": "03024326501",
            "name": "ឈឿន ញ៉ិល"
        },
        {
            "barcode": "171119054",
            "dpc": "03024326601",
            "name": "ឡុង សាវ៉េត"
        },
        {
            "barcode": "171119055",
            "dpc": "03024326701",
            "name": "សំ ដូង ១៧៣"
        },
        {
            "barcode": "171119056",
            "dpc": "03024327201",
            "name": "យ៉ាក ដៀត"
        },
        {
            "barcode": "171119057",
            "dpc": "03024327301",
            "name": "មាត់ លី"
        },
        {
            "barcode": "171119058",
            "dpc": "03024327801",
            "name": "សៀវ រតនា"
        },
        {
            "barcode": "171119059",
            "dpc": "03024327901",
            "name": "ចាន់ ស៊ីថា"
        },
        {
            "barcode": "171119060",
            "dpc": "03024328001",
            "name": "ឯក គេន"
        },
        {
            "barcode": "171119061",
            "dpc": "03024328101",
            "name": "និច ម៉ានី"
        },
        {
            "barcode": "171119062",
            "dpc": "03024328201",
            "name": "វិទ្យាល័យដុងបូសូរ"
        },
        {
            "barcode": "171119063",
            "dpc": "03024328401",
            "name": "ឡាយ ចិន្ដា"
        },
        {
            "barcode": "171119064",
            "dpc": "03024328501",
            "name": "អ៊ុច យួម"
        },
        {
            "barcode": "171119065",
            "dpc": "03024328601",
            "name": "ដន ឌី"
        },
        {
            "barcode": "171119066",
            "dpc": "03024328701",
            "name": "ច័ន្ទ ថា"
        },
        {
            "barcode": "171119067",
            "dpc": "03024328801",
            "name": "នៅ យុង"
        },
        {
            "barcode": "171119068",
            "dpc": "03024328901",
            "name": "ស៊ុក វាសនា"
        },
        {
            "barcode": "171119069",
            "dpc": "03024329001",
            "name": "សួម ចាន់រស្មី"
        },
        {
            "barcode": "171119070",
            "dpc": "03024329101",
            "name": "ចាន់ សារ៉ន"
        },
        {
            "barcode": "171119071",
            "dpc": "03024329201",
            "name": "សុខ រ៉ាន់"
        },
        {
            "barcode": "171119072",
            "dpc": "03024329301",
            "name": "អ៊ុន ទៀហេង"
        },
        {
            "barcode": "171119073",
            "dpc": "03024329401",
            "name": "នី សំអាន"
        },
        {
            "barcode": "171119074",
            "dpc": "03024329501",
            "name": "វ៉ាយ សារ"
        },
        {
            "barcode": "171119075",
            "dpc": "03024329601",
            "name": "ប៉េង លីគឹមឡាយ"
        },
        {
            "barcode": "171119076",
            "dpc": "03024329701",
            "name": "ហេង ដួងចន្ថាដាមុនី"
        },
        {
            "barcode": "171119077",
            "dpc": "03024329801",
            "name": "ឆាយ សុភាព"
        },
        {
            "barcode": "171119078",
            "dpc": "03024329901",
            "name": "ជា សុខគង់"
        },
        {
            "barcode": "171119079",
            "dpc": "03024330001",
            "name": "ប៉ូ រ៉ោស៊ីហាស់"
        },
        {
            "barcode": "171119080",
            "dpc": "03024330101",
            "name": "សួស ឆិន"
        },
        {
            "barcode": "171119081",
            "dpc": "03024330201",
            "name": "អាត់ សាឌី"
        },
        {
            "barcode": "171119082",
            "dpc": "03024330301",
            "name": "ឆឹង ឆុន"
        },
        {
            "barcode": "171119083",
            "dpc": "03024330401",
            "name": "លឿត លឿប"
        },
        {
            "barcode": "171119084",
            "dpc": "03024330501",
            "name": "សឿន សិទ្ធិ"
        },
        {
            "barcode": "171119085",
            "dpc": "03024330601",
            "name": "ខេង ហឿន"
        },
        {
            "barcode": "171119086",
            "dpc": "03024330701",
            "name": "ង៉ែត វ៉ាន់នី"
        },
        {
            "barcode": "171119087",
            "dpc": "03024330801",
            "name": "ម៉ៅ ច័ន្ទដាណា"
        },
        {
            "barcode": "171119088",
            "dpc": "03024330901",
            "name": "តូ សេង ២"
        },
        {
            "barcode": "171119089",
            "dpc": "03024331001",
            "name": "ច្រែង ឌូវ៉ាន់"
        },
        {
            "barcode": "171119090",
            "dpc": "03024331101",
            "name": "មេ អូន"
        },
        {
            "barcode": "171119091",
            "dpc": "03024331201",
            "name": "ឡាង ហឿន"
        },
        {
            "barcode": "171119092",
            "dpc": "03024331301",
            "name": "ក្លឹង បាន់នឿត"
        },
        {
            "barcode": "171119093",
            "dpc": "03024331401",
            "name": "គឹម ចាន់ធី"
        },
        {
            "barcode": "171119094",
            "dpc": "03024331501",
            "name": "ស័រ សំណាង"
        },
        {
            "barcode": "171119095",
            "dpc": "03024331601",
            "name": "ឡោ អ៊ិតលៀ"
        },
        {
            "barcode": "171119096",
            "dpc": "03024331701",
            "name": "ភី សុខ"
        },
        {
            "barcode": "171119097",
            "dpc": "03024331801",
            "name": "ង៉ូវ សុខ"
        },
        {
            "barcode": "171119098",
            "dpc": "03024331901",
            "name": "សោម ណាវី"
        },
        {
            "barcode": "171119099",
            "dpc": "03024332001",
            "name": "ភួ ពុយ"
        },
        {
            "barcode": "171119100",
            "dpc": "03024332101",
            "name": "ហេង យាន"
        },
        {
            "barcode": "171119101",
            "dpc": "03024332201",
            "name": "សាន ពលៈ"
        },
        {
            "barcode": "171119102",
            "dpc": "03024302601",
            "name": "ស៊ីវ សុផល"
        },
        {
            "barcode": "171119103",
            "dpc": "03024302701",
            "name": "ឃឿប បូរិន"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});