

let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=
    [
        {
            "barcode": "171116854",
            "dpc": "03014400101",
            "name": "ម៉ៅ សារ៉ាត"
        },
        {
            "barcode": "171116855",
            "dpc": "03014400201",
            "name": "ឌួង វាសនា១"
        },
        {
            "barcode": "171116856",
            "dpc": "03014400301",
            "name": "ឌួង វាសនា២"
        },
        {
            "barcode": "171116857",
            "dpc": "03014400401",
            "name": "រ៉ូ រ៉ស់ហ្វី"
        },
        {
            "barcode": "171116858",
            "dpc": "03014400501",
            "name": "មែ តេង"
        },
        {
            "barcode": "171116859",
            "dpc": "03014400601",
            "name": "ឆោម ឡងឌី"
        },
        {
            "barcode": "171116860",
            "dpc": "03014400701",
            "name": "ម៉ម លីន"
        },
        {
            "barcode": "171116861",
            "dpc": "03014400801",
            "name": "សុត បញ្ញា"
        },
        {
            "barcode": "171116862",
            "dpc": "03014400901",
            "name": "មុំ ស្រីពៅ"
        },
        {
            "barcode": "171116863",
            "dpc": "03014401101",
            "name": "យឹម ចាន់ណារី"
        },
        {
            "barcode": "171116864",
            "dpc": "03014401201",
            "name": "រី សុខគាន"
        },
        {
            "barcode": "171116865",
            "dpc": "03014401301",
            "name": "រស់ ផលសម្បត្តិ"
        },
        {
            "barcode": "171116866",
            "dpc": "03014401401",
            "name": "ហេង សៅយ៉ាត"
        },
        {
            "barcode": "171116867",
            "dpc": "03014401601",
            "name": "ម៉ៅ សារ៉ាត២"
        },
        {
            "barcode": "171116868",
            "dpc": "03014401801",
            "name": "យ៉ុត យ៉ាន់"
        },
        {
            "barcode": "171116869",
            "dpc": "03014401901",
            "name": "ឆុម វ៊ិត"
        },
        {
            "barcode": "171116870",
            "dpc": "03014402001",
            "name": "ប៉ូ ពៅ"
        },
        {
            "barcode": "171116871",
            "dpc": "03014402101",
            "name": "លី លី"
        },
        {
            "barcode": "171116872",
            "dpc": "03014402201",
            "name": "សេង សុខធារី"
        },
        {
            "barcode": "171116873",
            "dpc": "03014402301",
            "name": "សំ និមល់"
        },
        {
            "barcode": "171116874",
            "dpc": "03014402401",
            "name": "អាន គឹមឡាយ"
        },
        {
            "barcode": "171116875",
            "dpc": "03014402501",
            "name": "លី ផានី"
        },
        {
            "barcode": "171116876",
            "dpc": "03014402601",
            "name": "ហម សំណុំ"
        },
        {
            "barcode": "171116877",
            "dpc": "03014402701",
            "name": "ឆាំ មារ៉ា"
        },
        {
            "barcode": "171116878",
            "dpc": "03014402801",
            "name": "សំ អាងសត្យា"
        },
        {
            "barcode": "171116879",
            "dpc": "03014402901",
            "name": "ពេជ្រ គន្ធា"
        },
        {
            "barcode": "171116880",
            "dpc": "03014403001",
            "name": "អ៊ុន សុវិុត"
        },
        {
            "barcode": "171116881",
            "dpc": "03014403101",
            "name": "ទុំ ក្លឹង"
        },
        {
            "barcode": "171116882",
            "dpc": "03014403301",
            "name": "ជា សារាន"
        },
        {
            "barcode": "171116883",
            "dpc": "03014403401",
            "name": "លី ចាន់ណា"
        },
        {
            "barcode": "171116884",
            "dpc": "03014403701",
            "name": "ព្រំ ផាន"
        },
        {
            "barcode": "171116885",
            "dpc": "03014403901",
            "name": "អៀប ប៊ុន"
        },
        {
            "barcode": "171116886",
            "dpc": "03014404001",
            "name": "ដួង លីដា"
        },
        {
            "barcode": "171116887",
            "dpc": "03014404101",
            "name": "យឹម ស្រស់"
        },
        {
            "barcode": "171116888",
            "dpc": "03014404201",
            "name": "ហ៊ាន សុធា"
        },
        {
            "barcode": "171116889",
            "dpc": "03014404301",
            "name": "ញាណ ផុន"
        },
        {
            "barcode": "171116890",
            "dpc": "03014404401",
            "name": "ទាវ សុផល"
        },
        {
            "barcode": "171116891",
            "dpc": "03014404501",
            "name": "កយ វី"
        },
        {
            "barcode": "171116892",
            "dpc": "03014401001",
            "name": "ថាច់ វណ្ណអុន"
        },
        {
            "barcode": "171116893",
            "dpc": "03014404601",
            "name": "ឡៃ  ឡាត់"
        },
        {
            "barcode": "171116894",
            "dpc": "03014404701",
            "name": "ស៊ុន ភឿត"
        },
        {
            "barcode": "171116895",
            "dpc": "03014404801",
            "name": "តឿ រ៉ុង"
        },
        {
            "barcode": "171116896",
            "dpc": "03014404901",
            "name": "យោក ហ៊ុន"
        },
        {
            "barcode": "171116897",
            "dpc": "03014405001",
            "name": "យោក ធី"
        },
        {
            "barcode": "171116898",
            "dpc": "03014405101",
            "name": "ឌី សុភាវី"
        },
        {
            "barcode": "171116899",
            "dpc": "03014405201",
            "name": "ទុយ ស្រស់"
        },
        {
            "barcode": "171116900",
            "dpc": "03014405301",
            "name": "ចៅ ហ្វឹង២"
        },
        {
            "barcode": "171116901",
            "dpc": "03014405401",
            "name": "តែ គី"
        },
        {
            "barcode": "171116902",
            "dpc": "03014405501",
            "name": "ស្ដើង ឌី"
        },
        {
            "barcode": "171116903",
            "dpc": "03014405601",
            "name": "អូច ទូច"
        },
        {
            "barcode": "171116904",
            "dpc": "03014405701",
            "name": "ហឿន សុធា"
        },
        {
            "barcode": "171116905",
            "dpc": "03014405801",
            "name": "អាង ហ៊ុយ"
        },
        {
            "barcode": "171116906",
            "dpc": "03014405901",
            "name": "សុខ ហ៊ុន"
        },
        {
            "barcode": "171116907",
            "dpc": "03014406001",
            "name": "ញឹក ចំរើន"
        },
        {
            "barcode": "171116908",
            "dpc": "03014406101",
            "name": "សុខ ភាង"
        },
        {
            "barcode": "171116909",
            "dpc": "03014406201",
            "name": "គុយ ស្រីណូ"
        },
        {
            "barcode": "171116910",
            "dpc": "03014403801",
            "name": "ចៅ ហ្វឹង"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});