
let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=
[
        {
            "barcode": "171107766",
            "dpc": "03010505001",
            "name": "ជីវ សុខា"
        },
        {
            "barcode": "171107767",
            "dpc": "03010504901",
            "name": "មាន ឡាយ"
        },
        {
            "barcode": "171107768",
            "dpc": "03010504801",
            "name": "សេង ហ៊ាង"
        },
        {
            "barcode": "171107769",
            "dpc": "03010504701",
            "name": "ម៉ូវ អាន"
        },
        {
            "barcode": "171107770",
            "dpc": "03010504601",
            "name": "សឹង ហ៊ង"
        },
        {
            "barcode": "171107771",
            "dpc": "03010504501",
            "name": "យ៉ែម ម៉េង"
        },
        {
            "barcode": "171107772",
            "dpc": "03010504401",
            "name": "ចាប ជួង"
        },
        {
            "barcode": "171107773",
            "dpc": "03010504301",
            "name": "សេង ប៊ូ ២"
        },
        {
            "barcode": "171107774",
            "dpc": "03010504201",
            "name": "ប៊ុន លី"
        },
        {
            "barcode": "171107775",
            "dpc": "03010504001",
            "name": "សេង ប៊ូ ១"
        },
        {
            "barcode": "171107776",
            "dpc": "03010503901",
            "name": "តាំង ទ្រី"
        },
        {
            "barcode": "171107777",
            "dpc": "03010503801",
            "name": "ប៊ុន ថា"
        },
        {
            "barcode": "171107778",
            "dpc": "03010503701",
            "name": "ជា ប៊ូ"
        },
        {
            "barcode": "171107779",
            "dpc": "03010503601",
            "name": "ញៀវ វ៉ាន់ណារ៉ា"
        },
        {
            "barcode": "171107780",
            "dpc": "03010503501",
            "name": "កៅ យ៉ៅ"
        },
        {
            "barcode": "171107781",
            "dpc": "03010503401",
            "name": "ជា បានហេង"
        },
        {
            "barcode": "171107782",
            "dpc": "03010503301",
            "name": "ផុន នាង ១"
        },
        {
            "barcode": "171107783",
            "dpc": "03010503201",
            "name": "សុខ ចំណាប់"
        },
        {
            "barcode": "171107784",
            "dpc": "03010503101",
            "name": "លី ហួន"
        },
        {
            "barcode": "171107785",
            "dpc": "03010503001",
            "name": "នាង ធី"
        },
        {
            "barcode": "171107786",
            "dpc": "03010502901",
            "name": "ហេង អ៊ូរ"
        },
        {
            "barcode": "171107787",
            "dpc": "03010502801",
            "name": "ហេង ចាន់ធា"
        },
        {
            "barcode": "171107788",
            "dpc": "03010502701",
            "name": "វៀន ហាន់"
        },
        {
            "barcode": "171107789",
            "dpc": "03010502601",
            "name": "ខឹម សាម៉ុន"
        },
        {
            "barcode": "171107790",
            "dpc": "03010502501",
            "name": "ឡេង សុផល"
        },
        {
            "barcode": "171107791",
            "dpc": "03010502301",
            "name": "ឡាយ សាន"
        },
        {
            "barcode": "171107792",
            "dpc": "03010502201",
            "name": "ចៃ គង់"
        },
        {
            "barcode": "171107793",
            "dpc": "03010502101",
            "name": "ឃុន ព្រីង"
        },
        {
            "barcode": "171107794",
            "dpc": "03010502001",
            "name": "យី ប៊ុនខន ២"
        },
        {
            "barcode": "171107795",
            "dpc": "03010501901",
            "name": "ថៃ រ៉ន"
        },
        {
            "barcode": "171107796",
            "dpc": "03010501801",
            "name": "គី ខេង"
        },
        {
            "barcode": "171107797",
            "dpc": "03010501701",
            "name": "ឈួន ឆាយ"
        },
        {
            "barcode": "171107798",
            "dpc": "03010501501",
            "name": "លី ម៉ៅ"
        },
        {
            "barcode": "171107799",
            "dpc": "03010501401",
            "name": "ឡុង សុខន"
        },
        {
            "barcode": "171107800",
            "dpc": "03010501201",
            "name": "អ៊ឹង ហ៊ីម"
        },
        {
            "barcode": "171107801",
            "dpc": "03010501101",
            "name": "អ៊ឹង សុភា"
        },
        {
            "barcode": "171107802",
            "dpc": "03010501001",
            "name": "ឡេង សំអាត"
        },
        {
            "barcode": "171107803",
            "dpc": "03010500901",
            "name": "ចុង ស៊ីម"
        },
        {
            "barcode": "171107804",
            "dpc": "03010500801",
            "name": "ធូ ពៅ ២"
        },
        {
            "barcode": "171107805",
            "dpc": "03010500701",
            "name": "ធូ ពៅ ១"
        },
        {
            "barcode": "171107806",
            "dpc": "03010500601",
            "name": "សេង ហៃ"
        },
        {
            "barcode": "171107807",
            "dpc": "03010500501",
            "name": "យិន ញ៉ាង"
        },
        {
            "barcode": "171107808",
            "dpc": "03010500401",
            "name": "យ៉ង ស៊ុន"
        },
        {
            "barcode": "171107809",
            "dpc": "03010500301",
            "name": "ផាត សុផាត ២"
        },
        {
            "barcode": "171107810",
            "dpc": "03010500101",
            "name": "ឆេង ឡុង"
        },
        {
            "barcode": "171107811",
            "dpc": "03010508301",
            "name": "រ៉ម វីរៈ"
        },
        {
            "barcode": "171107812",
            "dpc": "03010508401",
            "name": "រ៉ម ញឹម"
        },
        {
            "barcode": "171107813",
            "dpc": "03010508501",
            "name": "ខ ស៊ីវ"
        },
        {
            "barcode": "171107814",
            "dpc": "03010508601",
            "name": "លឹម ឡេង"
        },
        {
            "barcode": "171107815",
            "dpc": "03010508701",
            "name": "ខ សុខុម"
        },
        {
            "barcode": "171107816",
            "dpc": "03010508801",
            "name": "ហុក សុវិចិត្រ"
        },
        {
            "barcode": "171107817",
            "dpc": "03010526801",
            "name": "តា ថាំ"
        },
        {
            "barcode": "171107818",
            "dpc": "03010526901",
            "name": "កញ្ញា សំបូរ"
        },
        {
            "barcode": "171107819",
            "dpc": "03010527501",
            "name": "ឆុង សុភាព"
        },
        {
            "barcode": "171107820",
            "dpc": "03010527001",
            "name": "ឈុំ ឌី"
        },
        {
            "barcode": "171107821",
            "dpc": "03010527101",
            "name": "ចែ ម៉ៅ ២"
        },
        {
            "barcode": "171107822",
            "dpc": "03010527201",
            "name": "ឆុន សុភាព"
        },
        {
            "barcode": "171107823",
            "dpc": "03010528801",
            "name": "ចែ ម៉ៅ ៣"
        },
        {
            "barcode": "171107824",
            "dpc": "03010527301",
            "name": "ឈួន ឆុន"
        },
        {
            "barcode": "171107825",
            "dpc": "03010527901",
            "name": "គង់ វត្ថា"
        },
        {
            "barcode": "171107826",
            "dpc": "03010528001",
            "name": "ចៅ ហុង"
        },
        {
            "barcode": "171107827",
            "dpc": "03010528301",
            "name": "កែវ សាវ៉ែ"
        },
        {
            "barcode": "171107828",
            "dpc": "03010528401",
            "name": "សេង លាង"
        },
        {
            "barcode": "171107829",
            "dpc": "03010528501",
            "name": "គឹម ស៊ា"
        },
        {
            "barcode": "171107830",
            "dpc": "03010528701",
            "name": "សេង លាំង"
        },
        {
            "barcode": "171107831",
            "dpc": "03010528901",
            "name": "កែវ រតនា"
        },
        {
            "barcode": "171107832",
            "dpc": "03010529001",
            "name": "គួច លាប"
        },
        {
            "barcode": "171107833",
            "dpc": "03010529101",
            "name": "មុំ លាងស្រូយ"
        },
        {
            "barcode": "171107834",
            "dpc": "03010529201",
            "name": "អ៊ុល វេ"
        },
        {
            "barcode": "171107835",
            "dpc": "03010529301",
            "name": "ងូវ  វេងហុក"
        },
        {
            "barcode": "171107836",
            "dpc": "03010523201",
            "name": "គង់ វត្ត"
        },
        {
            "barcode": "171107837",
            "dpc": "03010523301",
            "name": "គឹម ម៉េង"
        },
        {
            "barcode": "171107838",
            "dpc": "03010523401",
            "name": "លឹម សុភាព"
        },
        {
            "barcode": "171107839",
            "dpc": "03010523501",
            "name": "ពុធ ទ្រី"
        },
        {
            "barcode": "171107840",
            "dpc": "03010523601",
            "name": "លឹម ឆាយ ១"
        },
        {
            "barcode": "171107841",
            "dpc": "03010523701",
            "name": "ងួន ហៃ"
        },
        {
            "barcode": "171107842",
            "dpc": "03010523801",
            "name": "ឈុន ឈួន"
        },
        {
            "barcode": "171107843",
            "dpc": "03010523901",
            "name": "លឹម ឆាយ ២"
        },
        {
            "barcode": "171107844",
            "dpc": "03010524001",
            "name": "គឹម សានគាន"
        },
        {
            "barcode": "171107845",
            "dpc": "03010524101",
            "name": "ឈុំ ឆើត"
        },
        {
            "barcode": "171107846",
            "dpc": "03010524201",
            "name": "បេ គឹមវែង"
        },
        {
            "barcode": "171107847",
            "dpc": "03010524301",
            "name": "អ៊ឹង ងួន"
        },
        {
            "barcode": "171107848",
            "dpc": "03010524401",
            "name": "អ៊ឹង សៀកឡេង"
        },
        {
            "barcode": "171107849",
            "dpc": "03010524501",
            "name": "វ៉ាន់ ឌី"
        },
        {
            "barcode": "171107850",
            "dpc": "03010524601",
            "name": "មុត វ៉ាន់នី"
        },
        {
            "barcode": "171107851",
            "dpc": "03010524701",
            "name": "គឹម សាន"
        },
        {
            "barcode": "171107852",
            "dpc": "03010524801",
            "name": "ជន ជុន"
        },
        {
            "barcode": "171107853",
            "dpc": "03010524901",
            "name": "គ្រុយ ឈុន"
        },
        {
            "barcode": "171107854",
            "dpc": "03010525001",
            "name": "សុខ សាន្ត"
        },
        {
            "barcode": "171107855",
            "dpc": "03010525201",
            "name": "មៀវ ទាវ"
        },
        {
            "barcode": "171107856",
            "dpc": "03010525301",
            "name": "ហេង សុខម៉េង"
        },
        {
            "barcode": "171107857",
            "dpc": "03010525401",
            "name": "សេង គីម"
        },
        {
            "barcode": "171107858",
            "dpc": "03010525501",
            "name": "សម្បត្តិ ផល្លី"
        },
        {
            "barcode": "171107859",
            "dpc": "03010525701",
            "name": "ហោ ទ្រី"
        },
        {
            "barcode": "171107860",
            "dpc": "03010525801",
            "name": "លឹម មួយហ៊ាង"
        },
        {
            "barcode": "171107861",
            "dpc": "03010525901",
            "name": "ហេង គឹមទី"
        },
        {
            "barcode": "171107862",
            "dpc": "03010526001",
            "name": "លី សាលី"
        },
        {
            "barcode": "171107863",
            "dpc": "03010526201",
            "name": "ចាន់ ប៊ុនឡេង"
        },
        {
            "barcode": "171107864",
            "dpc": "03010526301",
            "name": "សម្បត្តិ សោភា"
        },
        {
            "barcode": "171107865",
            "dpc": "03010526401",
            "name": "ដួង មាច"
        },
        {
            "barcode": "171107866",
            "dpc": "03010526501",
            "name": "យឿន តូច ២"
        },
        {
            "barcode": "171107867",
            "dpc": "03010526601",
            "name": "ផៃ ប៊ុនធឿន"
        },
        {
            "barcode": "171107868",
            "dpc": "03010526701",
            "name": "ជឹង វែងអ៊ាវ"
        },
        {
            "barcode": "171107869",
            "dpc": "03010519401",
            "name": "សន ប៊ុនណា"
        },
        {
            "barcode": "171107870",
            "dpc": "03010522001",
            "name": "ឈួន អួក"
        },
        {
            "barcode": "171107871",
            "dpc": "03010522601",
            "name": "សេង ប៊ូ ៤"
        },
        {
            "barcode": "171107872",
            "dpc": "03010522701",
            "name": "ប៊ុន ពៅ"
        },
        {
            "barcode": "171107873",
            "dpc": "03010522801",
            "name": "លី អៀក"
        },
        {
            "barcode": "171107874",
            "dpc": "03010522901",
            "name": "លី ប៊ុនធឿន"
        },
        {
            "barcode": "171107875",
            "dpc": "03010523101",
            "name": "ហេង គុណ"
        },
        {
            "barcode": "171107876",
            "dpc": "03010522501",
            "name": "ភឿក ប៉ូ"
        },
        {
            "barcode": "171107877",
            "dpc": "03010522401",
            "name": "ខៃ សំបូ"
        },
        {
            "barcode": "171107878",
            "dpc": "03010522301",
            "name": "លី វ័ន្ត"
        },
        {
            "barcode": "171107879",
            "dpc": "03010522201",
            "name": "ប៊ុត ហួត"
        },
        {
            "barcode": "171107880",
            "dpc": "03010522101",
            "name": "សៀម ភក្តី ១"
        },
        {
            "barcode": "171107881",
            "dpc": "03010521801",
            "name": "សុខ ណាត"
        },
        {
            "barcode": "171107882",
            "dpc": "03010521701",
            "name": "ហួត អឿង"
        },
        {
            "barcode": "171107883",
            "dpc": "03010521601",
            "name": "ធូរ៉េ វត្តី ១"
        },
        {
            "barcode": "171107884",
            "dpc": "03010521501",
            "name": "ខា វណ្ណ"
        },
        {
            "barcode": "171107885",
            "dpc": "03010521401",
            "name": "គួយ ឆេងលី"
        },
        {
            "barcode": "171107886",
            "dpc": "03010521301",
            "name": "សម្បត្តិ ញ៉ ២"
        },
        {
            "barcode": "171107887",
            "dpc": "03010521101",
            "name": "លឹម វេង"
        },
        {
            "barcode": "171107888",
            "dpc": "03010521001",
            "name": "លាង ហ៊ាងផេង"
        },
        {
            "barcode": "171107889",
            "dpc": "03010520801",
            "name": "លីវ ហៀក"
        },
        {
            "barcode": "171107890",
            "dpc": "03010520601",
            "name": "យស វិន"
        },
        {
            "barcode": "171107891",
            "dpc": "03010520501",
            "name": "អែមបាន"
        },
        {
            "barcode": "171107892",
            "dpc": "03010520401",
            "name": "លឹម ហ្តូរ"
        },
        {
            "barcode": "171107893",
            "dpc": "03010520301",
            "name": "ជា ហ៊ុយ"
        },
        {
            "barcode": "171107894",
            "dpc": "03010520201",
            "name": "ឡៅ ម៉េង"
        },
        {
            "barcode": "171107895",
            "dpc": "03010520101",
            "name": "គិត ញ៉ុល"
        },
        {
            "barcode": "171107896",
            "dpc": "03010520001",
            "name": "សុខ ថេង"
        },
        {
            "barcode": "171107897",
            "dpc": "03010519901",
            "name": "ឯម សេក"
        },
        {
            "barcode": "171107898",
            "dpc": "03010519801",
            "name": "សៀក សន"
        },
        {
            "barcode": "171107899",
            "dpc": "03010519701",
            "name": "អ៊ឹម ឡេង"
        },
        {
            "barcode": "171107900",
            "dpc": "03010519601",
            "name": "ឡេង ណាង"
        },
        {
            "barcode": "171107901",
            "dpc": "03010519501",
            "name": "ង៉ូវ មួយអ៊ី"
        },
        {
            "barcode": "171107902",
            "dpc": "03010519301",
            "name": "មិន លីហួរ ២"
        },
        {
            "barcode": "171107903",
            "dpc": "03010519201",
            "name": "ជា សុរដ្ឋ"
        },
        {
            "barcode": "171107904",
            "dpc": "03010519101",
            "name": "ម៉ាក វ៉ាន្នី"
        },
        {
            "barcode": "171107905",
            "dpc": "03010519001",
            "name": "ផួន សារ៉ូ"
        },
        {
            "barcode": "171107906",
            "dpc": "03010518901",
            "name": "ឈុន ឆាង"
        },
        {
            "barcode": "171107907",
            "dpc": "03010518801",
            "name": "ជីវ គឹមស៊ាន"
        },
        {
            "barcode": "171107908",
            "dpc": "03010518501",
            "name": "ដែក សេង"
        },
        {
            "barcode": "171107909",
            "dpc": "03010518401",
            "name": "លឹម ឆេង"
        },
        {
            "barcode": "171107910",
            "dpc": "03010518301",
            "name": "ឃុត លីសុង"
        },
        {
            "barcode": "171107911",
            "dpc": "03010518201",
            "name": "សឿន សុផល"
        },
        {
            "barcode": "171107912",
            "dpc": "03010518101",
            "name": "ហា ធៀង"
        },
        {
            "barcode": "171107913",
            "dpc": "03010518001",
            "name": "យូ សន"
        },
        {
            "barcode": "171107914",
            "dpc": "03010517901",
            "name": "តាន់ វណ្ឌី"
        },
        {
            "barcode": "171107915",
            "dpc": "03010517701",
            "name": "ជា សារិទ្ធ"
        },
        {
            "barcode": "171107916",
            "dpc": "03010517801",
            "name": "ស៊្រុន   ហុក"
        },
        {
            "barcode": "171107917",
            "dpc": "03010517601",
            "name": "ប៉ា ឡុងហៃ ១"
        },
        {
            "barcode": "171107918",
            "dpc": "03010517501",
            "name": "ហ៊ឹម ហ៊"
        },
        {
            "barcode": "171107919",
            "dpc": "03010517401",
            "name": "អ៊ឹម សារិន"
        },
        {
            "barcode": "171107920",
            "dpc": "03010517301",
            "name": "ផន គឹមយី"
        },
        {
            "barcode": "171107921",
            "dpc": "03010517201",
            "name": "គឹម សាន"
        },
        {
            "barcode": "171107922",
            "dpc": "03010517101",
            "name": "ឃុន នាង"
        },
        {
            "barcode": "171107923",
            "dpc": "03010517001",
            "name": "ទួត ផាន់"
        },
        {
            "barcode": "171107924",
            "dpc": "03010516801",
            "name": "ឆាំង សំ"
        },
        {
            "barcode": "171107925",
            "dpc": "03010516701",
            "name": "ឈៀរ ងី"
        },
        {
            "barcode": "171107926",
            "dpc": "03010516601",
            "name": "កាំង ឡាយ"
        },
        {
            "barcode": "171107927",
            "dpc": "03010516501",
            "name": "គ្រុយ ឈុនអ៊ឹង ២"
        },
        {
            "barcode": "171107928",
            "dpc": "03010516401",
            "name": "ថា ផល្លី"
        },
        {
            "barcode": "171107929",
            "dpc": "03010516301",
            "name": "ម៉ាក់ ហ៊ាង"
        },
        {
            "barcode": "171107930",
            "dpc": "03010515801",
            "name": "តាំង គឹមឆេង ២"
        },
        {
            "barcode": "171107931",
            "dpc": "03010508901",
            "name": "ផួង គឿង"
        },
        {
            "barcode": "171107932",
            "dpc": "03010509001",
            "name": "ស៊ិន ប៊ុនសឿន"
        },
        {
            "barcode": "171107933",
            "dpc": "03010509101",
            "name": "លឹម ម៉េង"
        },
        {
            "barcode": "171107934",
            "dpc": "03010509201",
            "name": "យាំង ប៊ុននី"
        },
        {
            "barcode": "171107935",
            "dpc": "03010509301",
            "name": "សួន នាង"
        },
        {
            "barcode": "171107936",
            "dpc": "03010509401",
            "name": "សុខ គៀង"
        },
        {
            "barcode": "171107937",
            "dpc": "03010509501",
            "name": "អ៊ួម រ៉ម"
        },
        {
            "barcode": "171107938",
            "dpc": "03010509601",
            "name": "សឹម សុង"
        },
        {
            "barcode": "171107939",
            "dpc": "03010509801",
            "name": "រឿង សារ៉ាត់"
        },
        {
            "barcode": "171107940",
            "dpc": "03010510101",
            "name": "ជឺ ណៃហ៊ាង"
        },
        {
            "barcode": "171107941",
            "dpc": "03010510201",
            "name": "លឹម ប៉ិច"
        },
        {
            "barcode": "171107942",
            "dpc": "03010510301",
            "name": "សុខ បីស៊ូ"
        },
        {
            "barcode": "171107943",
            "dpc": "03010510401",
            "name": "ហាក់ ណារិន"
        },
        {
            "barcode": "171107944",
            "dpc": "03010510501",
            "name": "គឹ ចាន់ធី"
        },
        {
            "barcode": "171107945",
            "dpc": "03010510601",
            "name": "លឹម ខេង"
        },
        {
            "barcode": "171107946",
            "dpc": "03010510701",
            "name": "សោម សារឿន"
        },
        {
            "barcode": "171107947",
            "dpc": "03010510801",
            "name": "ដាង សារឿន"
        },
        {
            "barcode": "171107948",
            "dpc": "03010510901",
            "name": "សែស សារឹម"
        },
        {
            "barcode": "171107949",
            "dpc": "03010511001",
            "name": "រស់ ដារ៉ា"
        },
        {
            "barcode": "171107950",
            "dpc": "03010511101",
            "name": "ហែម ដារ៉ា"
        },
        {
            "barcode": "171107951",
            "dpc": "03010511201",
            "name": "ណុល នឿន"
        },
        {
            "barcode": "171107952",
            "dpc": "03010511301",
            "name": "តាំង ថៃ"
        },
        {
            "barcode": "171107953",
            "dpc": "03010511401",
            "name": "ព្រំ គឿន"
        },
        {
            "barcode": "171107954",
            "dpc": "03010511501",
            "name": "អូន ណារ៉ុង"
        },
        {
            "barcode": "171107955",
            "dpc": "03010511601",
            "name": "ហា ហួរ"
        },
        {
            "barcode": "171107956",
            "dpc": "03010511701",
            "name": "លឹម ឆាយ"
        },
        {
            "barcode": "171107957",
            "dpc": "03010512001",
            "name": "មាស សុភាព"
        },
        {
            "barcode": "171107958",
            "dpc": "03010512101",
            "name": "ពៅ សំបូរ"
        },
        {
            "barcode": "171107959",
            "dpc": "03010512301",
            "name": "លេង លាប"
        },
        {
            "barcode": "171107960",
            "dpc": "03010512401",
            "name": "អឿន ឆេង"
        },
        {
            "barcode": "171107961",
            "dpc": "03010512801",
            "name": "តាន់ ទេវី"
        },
        {
            "barcode": "171107962",
            "dpc": "03010512901",
            "name": "ឆែម សេង"
        },
        {
            "barcode": "171107963",
            "dpc": "03010513001",
            "name": "កាន់ រិទ្ធី"
        },
        {
            "barcode": "171107964",
            "dpc": "03010513101",
            "name": "សួស ហួត"
        },
        {
            "barcode": "171107965",
            "dpc": "03010515001",
            "name": "ចាន់ សាវ័ន្ត"
        },
        {
            "barcode": "171107966",
            "dpc": "03010515101",
            "name": "តាំង គឹមឆេង ១"
        },
        {
            "barcode": "171107967",
            "dpc": "03010515201",
            "name": "រៀម សារ៉េត"
        },
        {
            "barcode": "171107968",
            "dpc": "03010515301",
            "name": "គ្រូ ជា"
        },
        {
            "barcode": "171107969",
            "dpc": "03010515401",
            "name": "គី វិរិន្ទ"
        },
        {
            "barcode": "171107970",
            "dpc": "03010515501",
            "name": "ព្រំ វ៉ែយ៉ា ១"
        },
        {
            "barcode": "171107971",
            "dpc": "03010515601",
            "name": "ធា ឈីវកាង"
        },
        {
            "barcode": "171107972",
            "dpc": "03010515701",
            "name": "ព្រំ វ៉ែយ៉ា ២"
        },
        {
            "barcode": "171107973",
            "dpc": "03010505101",
            "name": "អៀង សុខា"
        },
        {
            "barcode": "171107974",
            "dpc": "03010505201",
            "name": "ទូច ប៉ុយ"
        },
        {
            "barcode": "171107975",
            "dpc": "03010505301",
            "name": "ម៉ិញ ម៉ារ៉ា"
        },
        {
            "barcode": "171107976",
            "dpc": "03010505401",
            "name": "ប៊ូ   ដាណា"
        },
        {
            "barcode": "171107977",
            "dpc": "03010505601",
            "name": "លី គ្រុយ"
        },
        {
            "barcode": "171107978",
            "dpc": "03010505701",
            "name": "ទឹម រី"
        },
        {
            "barcode": "171107979",
            "dpc": "03010505801",
            "name": "ឈួន អួក"
        },
        {
            "barcode": "171107980",
            "dpc": "03010505901",
            "name": "ស៊ុំ ប៉ន"
        },
        {
            "barcode": "171107981",
            "dpc": "03010506001",
            "name": "នួន ភឿន"
        },
        {
            "barcode": "171107982",
            "dpc": "03010506201",
            "name": "ប៊ូ   ជីម"
        },
        {
            "barcode": "171107983",
            "dpc": "03010506301",
            "name": "វេង តាំងលី"
        },
        {
            "barcode": "171107984",
            "dpc": "03010506401",
            "name": "សេង ប៊ូ ៣"
        },
        {
            "barcode": "171107985",
            "dpc": "03010506501",
            "name": "នូ សាវង្ស"
        },
        {
            "barcode": "171107986",
            "dpc": "03010506601",
            "name": "ជា ប៊ូ"
        },
        {
            "barcode": "171107987",
            "dpc": "03010506701",
            "name": "មាស វ៉ាន់ធី"
        },
        {
            "barcode": "171107988",
            "dpc": "03010506801",
            "name": "ជា ធារី"
        },
        {
            "barcode": "171107989",
            "dpc": "03010506901",
            "name": "ផុន នាង ១"
        },
        {
            "barcode": "171107990",
            "dpc": "03010507001",
            "name": "ផុន សុផល"
        },
        {
            "barcode": "171107991",
            "dpc": "03010507101",
            "name": "ប៊ុន វណ្ណារ៉ា"
        },
        {
            "barcode": "171107992",
            "dpc": "03010507201",
            "name": "ប្លុង សាន"
        },
        {
            "barcode": "171107993",
            "dpc": "03010507301",
            "name": "ឆែត សៀង"
        },
        {
            "barcode": "171107994",
            "dpc": "03010507401",
            "name": "អ៊ី ភិរុណ"
        },
        {
            "barcode": "171107995",
            "dpc": "03010507501",
            "name": "សុខ ភារ៉ា"
        },
        {
            "barcode": "171107996",
            "dpc": "03010507701",
            "name": "ម៉ន ណាវី"
        },
        {
            "barcode": "171107997",
            "dpc": "03010507901",
            "name": "ស៊ិន សម្បត្តិ"
        },
        {
            "barcode": "171107998",
            "dpc": "03010508001",
            "name": "ពេជ្រ កុសល"
        },
        {
            "barcode": "171107999",
            "dpc": "03010508101",
            "name": "អឿង សំ"
        },
        {
            "barcode": "171108000",
            "dpc": "03010508201",
            "name": "មាស ទឿម"
        },
        {
            "barcode": "171108001",
            "dpc": "03010513201",
            "name": "សេក គារ"
        },
        {
            "barcode": "171108002",
            "dpc": "03010513301",
            "name": "ស្រស់ សារុន"
        },
        {
            "barcode": "171108003",
            "dpc": "03010511901",
            "name": "នឿន វុទ្ធី"
        },
        {
            "barcode": "171108004",
            "dpc": "03010513401",
            "name": "ជា សុខឃីម"
        },
        {
            "barcode": "171108005",
            "dpc": "03010513501",
            "name": "ផុន ទូច"
        },
        {
            "barcode": "171108006",
            "dpc": "03010513601",
            "name": "គង់ ផុន"
        },
        {
            "barcode": "171108007",
            "dpc": "03010513701",
            "name": "ជឺ គ្រី"
        },
        {
            "barcode": "171108008",
            "dpc": "03010513801",
            "name": "ឡាច សុធី"
        },
        {
            "barcode": "171108009",
            "dpc": "03010513901",
            "name": "ចេង គី"
        },
        {
            "barcode": "171108010",
            "dpc": "03010514001",
            "name": "ប៊ុន ភាច"
        },
        {
            "barcode": "171108011",
            "dpc": "03010514101",
            "name": "ឯម ស៊ីថា"
        },
        {
            "barcode": "171108012",
            "dpc": "03010514201",
            "name": "ស្រេង ប៊ុនថា"
        },
        {
            "barcode": "171108013",
            "dpc": "03010514301",
            "name": "ភឹម ប៊ុនលឿត"
        },
        {
            "barcode": "171108014",
            "dpc": "03010514401",
            "name": "យឹម ង៉ែត"
        },
        {
            "barcode": "171108015",
            "dpc": "03010514501",
            "name": "ស៊ាង ឈឿត"
        },
        {
            "barcode": "171108016",
            "dpc": "03010514601",
            "name": "មាន វីរៈ"
        },
        {
            "barcode": "171108017",
            "dpc": "03010514701",
            "name": "អ៊ុគ គឹមលន់"
        },
        {
            "barcode": "171108018",
            "dpc": "03010514801",
            "name": "ស័ក្ក លី"
        },
        {
            "barcode": "171108019",
            "dpc": "03010514901",
            "name": "ជិន សានិត"
        },
        {
            "barcode": "171108020",
            "dpc": "03010531001",
            "name": "តាន់ បូណា"
        },
        {
            "barcode": "171108021",
            "dpc": "03010531101",
            "name": "សៀក គឹមសាន"
        },
        {
            "barcode": "171108022",
            "dpc": "03010530901",
            "name": "ឆាង សន"
        },
        {
            "barcode": "171108023",
            "dpc": "03010530801",
            "name": "អេង ស៊ីផា"
        },
        {
            "barcode": "171108024",
            "dpc": "03010530701",
            "name": "ទន់ ទៀង"
        },
        {
            "barcode": "171108025",
            "dpc": "03010530601",
            "name": "ទន់ ឈួត"
        },
        {
            "barcode": "171108026",
            "dpc": "03010530501",
            "name": "ប៉ែន សោភ័ណ្ឌ"
        },
        {
            "barcode": "171108027",
            "dpc": "03010530401",
            "name": "ឆោង វីវីយ៉ា"
        },
        {
            "barcode": "171108028",
            "dpc": "03010530301",
            "name": "ណាល់ ស៊ីនួន"
        },
        {
            "barcode": "171108029",
            "dpc": "03010530201",
            "name": "វ៉ាយ គឹមហៀក"
        },
        {
            "barcode": "171108030",
            "dpc": "03010530101",
            "name": "វ៉ាយ គឹមហឿង"
        },
        {
            "barcode": "171108031",
            "dpc": "03010530001",
            "name": "ពិន ប៊ុនថន"
        },
        {
            "barcode": "171108032",
            "dpc": "03010529901",
            "name": "ទ្រី សាវុធ"
        },
        {
            "barcode": "171108033",
            "dpc": "03010529801",
            "name": "ផាត់ គង់"
        },
        {
            "barcode": "171108034",
            "dpc": "03010529701",
            "name": "ប៉ាត ពយ"
        },
        {
            "barcode": "171108035",
            "dpc": "03010529601",
            "name": "ប្រាក់ សម្បត្តិ"
        },
        {
            "barcode": "171108036",
            "dpc": "03010529501",
            "name": "ខ្លូត សម្បត្តិ"
        },
        {
            "barcode": "171108037",
            "dpc": "03010529401",
            "name": "ប៉ុញ ឧត្តម"
        },
        {
            "barcode": "171108038",
            "dpc": "03010518601",
            "name": "យីវ  គឹមស៊ាន"
        },
        {
            "barcode": "171108039",
            "dpc": "03010539201",
            "name": "តាំង ទៀង"
        },
        {
            "barcode": "171108040",
            "dpc": "03010547501",
            "name": "ភា ស៊ុយ"
        },
        {
            "barcode": "171108041",
            "dpc": "03010547601",
            "name": "កោ គឹមសួង"
        },
        {
            "barcode": "171108042",
            "dpc": "03010547701",
            "name": "ហេង ងី"
        },
        {
            "barcode": "171108043",
            "dpc": "03010547801",
            "name": "គង ម៉ាលី"
        },
        {
            "barcode": "171108044",
            "dpc": "03010547401",
            "name": "ភួយ លាងអេង"
        },
        {
            "barcode": "171108045",
            "dpc": "03010547301",
            "name": "ណុប ពោល"
        },
        {
            "barcode": "171108046",
            "dpc": "03010546401",
            "name": "ឈឹម រី"
        },
        {
            "barcode": "171108047",
            "dpc": "03010547201",
            "name": "សេង ហួត"
        },
        {
            "barcode": "171108048",
            "dpc": "03010547101",
            "name": "ឡុង ម៉ៅ"
        },
        {
            "barcode": "171108049",
            "dpc": "03010547001",
            "name": "យិន ហឺ"
        },
        {
            "barcode": "171108050",
            "dpc": "03010546901",
            "name": "វៃ សាវន"
        },
        {
            "barcode": "171108051",
            "dpc": "03010546701",
            "name": "ហ៊ិន ហ៊ុន"
        },
        {
            "barcode": "171108052",
            "dpc": "03010546601",
            "name": "វ៉ាន វាន"
        },
        {
            "barcode": "171108053",
            "dpc": "03010546301",
            "name": "ស៊ុន ភិរុណ"
        },
        {
            "barcode": "171108054",
            "dpc": "03010546201",
            "name": "លឿង ហ៊រ"
        },
        {
            "barcode": "171108055",
            "dpc": "03010546101",
            "name": "ពូ ពេជ្រ"
        },
        {
            "barcode": "171108056",
            "dpc": "03010546001",
            "name": "ព្រឿង លាង"
        },
        {
            "barcode": "171108057",
            "dpc": "03010545901",
            "name": "ស៊ុន ប៊ុនរើត"
        },
        {
            "barcode": "171108058",
            "dpc": "03010545801",
            "name": "ប៊ុន ណារី"
        },
        {
            "barcode": "171108059",
            "dpc": "03010545701",
            "name": "គ្រី ស៊ាង"
        },
        {
            "barcode": "171108060",
            "dpc": "03010545601",
            "name": "ម៉ៅ សុភាព"
        },
        {
            "barcode": "171108061",
            "dpc": "03010536301",
            "name": "វ៉ាន ណយ"
        },
        {
            "barcode": "171108062",
            "dpc": "03010536501",
            "name": "ទុំ ឡៃហួយ"
        },
        {
            "barcode": "171108063",
            "dpc": "03010536601",
            "name": "ឡុំ សោម"
        },
        {
            "barcode": "171108064",
            "dpc": "03010536701",
            "name": "សួស តឿ"
        },
        {
            "barcode": "171108065",
            "dpc": "03010536801",
            "name": "អង្គការជំនួយផ្នែកច្បាប់"
        },
        {
            "barcode": "171108066",
            "dpc": "03010536901",
            "name": "ងួន ជីវ័ន្ត"
        },
        {
            "barcode": "171108067",
            "dpc": "03010537001",
            "name": "ងួន ពិសិទ្ធ"
        },
        {
            "barcode": "171108068",
            "dpc": "03010536401",
            "name": "ប្រុក គឿន ៤"
        },
        {
            "barcode": "171108069",
            "dpc": "03010537101",
            "name": "ប៊ូ សុផល"
        },
        {
            "barcode": "171108070",
            "dpc": "03010537201",
            "name": "ហ៊ី ឆៃហ៊ាង"
        },
        {
            "barcode": "171108071",
            "dpc": "03010538201",
            "name": "ប៊ុត សុខា ១"
        },
        {
            "barcode": "171108072",
            "dpc": "03010538301",
            "name": "ផាត ចន្ធី"
        },
        {
            "barcode": "171108073",
            "dpc": "03010538101",
            "name": "ជា សុខុម"
        },
        {
            "barcode": "171108074",
            "dpc": "03010538001",
            "name": "សំ ហឿម"
        },
        {
            "barcode": "171108075",
            "dpc": "03010544101",
            "name": "អ៊ាង គឹមហ៊ាក"
        },
        {
            "barcode": "171108076",
            "dpc": "03010538401",
            "name": "រឿន ម៉ាន ១"
        },
        {
            "barcode": "171108077",
            "dpc": "03010538501",
            "name": "ទន់ សំណាង"
        },
        {
            "barcode": "171108078",
            "dpc": "03010538601",
            "name": "កែវ ណារី"
        },
        {
            "barcode": "171108079",
            "dpc": "03010538701",
            "name": "ស្រី ម៉ៅ"
        },
        {
            "barcode": "171108080",
            "dpc": "03010538801",
            "name": "ទូច សារុំ"
        },
        {
            "barcode": "171108081",
            "dpc": "03010544001",
            "name": "ទឹត ចាន់ហន"
        },
        {
            "barcode": "171108082",
            "dpc": "03010539001",
            "name": "មុត សាឃឿន"
        },
        {
            "barcode": "171108083",
            "dpc": "03010542801",
            "name": "អេង តុល"
        },
        {
            "barcode": "171108084",
            "dpc": "03010540001",
            "name": "អឿន វណ្ណៈ"
        },
        {
            "barcode": "171108085",
            "dpc": "03010539901",
            "name": "ផាត សុខា"
        },
        {
            "barcode": "171108086",
            "dpc": "03010539801",
            "name": "ហេង ប៊ុនធី"
        },
        {
            "barcode": "171108087",
            "dpc": "03010540601",
            "name": "អេង កែវ"
        },
        {
            "barcode": "171108088",
            "dpc": "03010539601",
            "name": "ឆាំ វុឌ្ឍី"
        },
        {
            "barcode": "171108089",
            "dpc": "03010539101",
            "name": "តិ ម៉ុង"
        },
        {
            "barcode": "171108090",
            "dpc": "03010540101",
            "name": "ភិន សុវណ្ណ"
        },
        {
            "barcode": "171108091",
            "dpc": "03010540401",
            "name": "សូ សាវង្ស"
        },
        {
            "barcode": "171108092",
            "dpc": "03010540501",
            "name": "ឡឹក សារ៉ាត"
        },
        {
            "barcode": "171108093",
            "dpc": "03010540701",
            "name": "តាំង ម៉ៃ"
        },
        {
            "barcode": "171108094",
            "dpc": "03010540801",
            "name": "ព្រឿន លាន"
        },
        {
            "barcode": "171108095",
            "dpc": "03010540901",
            "name": "គិន អង្គផល្លា"
        },
        {
            "barcode": "171108096",
            "dpc": "03010541101",
            "name": "គឹម ម៉ុន"
        },
        {
            "barcode": "171108097",
            "dpc": "03010541201",
            "name": "ប្រាក់ តឿប"
        },
        {
            "barcode": "171108098",
            "dpc": "03010541301",
            "name": "លី ណូ ១"
        },
        {
            "barcode": "171108099",
            "dpc": "03010541501",
            "name": "សួន  ចាន់នឿន"
        },
        {
            "barcode": "171108100",
            "dpc": "03010541701",
            "name": "ធម្ម សុផល"
        },
        {
            "barcode": "171108101",
            "dpc": "03010541801",
            "name": "ស៊ុយ ជំនឿ ១"
        },
        {
            "barcode": "171108102",
            "dpc": "03010541901",
            "name": "ទ្រី វណ្ណស"
        },
        {
            "barcode": "171108103",
            "dpc": "03010542001",
            "name": "និត សុភាព"
        },
        {
            "barcode": "171108104",
            "dpc": "03010542101",
            "name": "ធិន ធូ"
        },
        {
            "barcode": "171108105",
            "dpc": "03010537301",
            "name": "សែម ឈី"
        },
        {
            "barcode": "171108106",
            "dpc": "03010537401",
            "name": "សាន សាខន"
        },
        {
            "barcode": "171108107",
            "dpc": "03010537701",
            "name": "ម៉ាង សុង"
        },
        {
            "barcode": "171108108",
            "dpc": "03010537601",
            "name": "គឹម សុខុម"
        },
        {
            "barcode": "171108109",
            "dpc": "03010537501",
            "name": "ទួន សុផល"
        },
        {
            "barcode": "171108110",
            "dpc": "03010537801",
            "name": "សាន ជ័យរិទ្ធ"
        },
        {
            "barcode": "171108111",
            "dpc": "03010537901",
            "name": "ប៊ុន សារុន"
        },
        {
            "barcode": "171108112",
            "dpc": "03010541001",
            "name": "រ៉ាយ លាងស"
        },
        {
            "barcode": "171108113",
            "dpc": "03010541401",
            "name": "ឡេង ច័ន្ទដារ៉ា"
        },
        {
            "barcode": "171108114",
            "dpc": "03010541601",
            "name": "យិន ឆុងវិន"
        },
        {
            "barcode": "171108115",
            "dpc": "03010542201",
            "name": "ព្រី ថា"
        },
        {
            "barcode": "171108116",
            "dpc": "03010542301",
            "name": "សុខ ផល្លី"
        },
        {
            "barcode": "171108117",
            "dpc": "03010542601",
            "name": "ស៊ុយ ជំនឿ ២"
        },
        {
            "barcode": "171108118",
            "dpc": "03010545501",
            "name": "សែម គង់"
        },
        {
            "barcode": "171108119",
            "dpc": "03010545401",
            "name": "លឹម គឹមហៀវ"
        },
        {
            "barcode": "171108120",
            "dpc": "03010545301",
            "name": "លឹម សេងលី"
        },
        {
            "barcode": "171108121",
            "dpc": "03010545201",
            "name": "លឹម គឹហង្ស"
        },
        {
            "barcode": "171108122",
            "dpc": "03010544901",
            "name": "ទេស សម្បត្តិ"
        },
        {
            "barcode": "171108123",
            "dpc": "03010545101",
            "name": "យី ស៊ុយ"
        },
        {
            "barcode": "171108124",
            "dpc": "03010545001",
            "name": "គឹម ឡេង"
        },
        {
            "barcode": "171108125",
            "dpc": "03010544801",
            "name": "អ៊ុំ ឡេង"
        },
        {
            "barcode": "171108126",
            "dpc": "03010544601",
            "name": "អៀង ផាន"
        },
        {
            "barcode": "171108127",
            "dpc": "03010544401",
            "name": "តាំង សារី១"
        },
        {
            "barcode": "171108128",
            "dpc": "03010544301",
            "name": "ហាត់ លី"
        },
        {
            "barcode": "171108129",
            "dpc": "03010543301",
            "name": "មជ្ឈមណ្ឌលក្តីនិមិត្តធីម៉ូថេ"
        },
        {
            "barcode": "171108130",
            "dpc": "03010543201",
            "name": "ប៊ុក សុខា ២"
        },
        {
            "barcode": "171108131",
            "dpc": "03010543001",
            "name": "ឃុត មុត"
        },
        {
            "barcode": "171108132",
            "dpc": "03010543101",
            "name": "ហាក គឹមហេង"
        },
        {
            "barcode": "171108133",
            "dpc": "03010542901",
            "name": "ហួត ជា"
        },
        {
            "barcode": "171108134",
            "dpc": "03010543801",
            "name": "ធម្ម សុផល"
        },
        {
            "barcode": "171108135",
            "dpc": "03010543401",
            "name": "ខាត់ នី"
        },
        {
            "barcode": "171108136",
            "dpc": "03010543501",
            "name": "ជួន នី"
        },
        {
            "barcode": "171108137",
            "dpc": "03010543701",
            "name": "ឡុង សំណាង"
        },
        {
            "barcode": "171108138",
            "dpc": "03010543901",
            "name": "រិន យាន"
        },
        {
            "barcode": "171108139",
            "dpc": "03010531201",
            "name": "ឈុន សារិទ្ធ"
        },
        {
            "barcode": "171108140",
            "dpc": "03010531301",
            "name": "គឹម វុទ្ធី"
        },
        {
            "barcode": "171108141",
            "dpc": "03010531401",
            "name": "នួន ប៊ុនធឿន"
        },
        {
            "barcode": "171108142",
            "dpc": "03010531701",
            "name": "ព្រំ សាខន"
        },
        {
            "barcode": "171108143",
            "dpc": "03010531601",
            "name": "វី នេត"
        },
        {
            "barcode": "171108144",
            "dpc": "03010531501",
            "name": "មាស រ៉ានី"
        },
        {
            "barcode": "171108145",
            "dpc": "03010531801",
            "name": "តាំង ម៉េងគង់ ១"
        },
        {
            "barcode": "171108146",
            "dpc": "03010531901",
            "name": "តាំង ម៉េងគង់ ២"
        },
        {
            "barcode": "171108147",
            "dpc": "03010532001",
            "name": "អ៊ុំ គឹមឡេង"
        },
        {
            "barcode": "171108148",
            "dpc": "03010532101",
            "name": "គង់ សំរិត"
        },
        {
            "barcode": "171108149",
            "dpc": "03010532201",
            "name": "ព្រំ ចានថន"
        },
        {
            "barcode": "171108150",
            "dpc": "03010532801",
            "name": "តូត គីម"
        },
        {
            "barcode": "171108151",
            "dpc": "03010532701",
            "name": "មូល ប៊ុនធឿន"
        },
        {
            "barcode": "171108152",
            "dpc": "03010532601",
            "name": "ហ៊ុន យូ"
        },
        {
            "barcode": "171108153",
            "dpc": "03010532501",
            "name": "ញឹម សុខុម"
        },
        {
            "barcode": "171108154",
            "dpc": "03010532401",
            "name": "នៅ សុខចំរើន"
        },
        {
            "barcode": "171108155",
            "dpc": "03010532301",
            "name": "រ៉ា រ៉ានី"
        },
        {
            "barcode": "171108156",
            "dpc": "03010532901",
            "name": "សុខហេង"
        },
        {
            "barcode": "171108157",
            "dpc": "03010533001",
            "name": "តូ សុផាត"
        },
        {
            "barcode": "171108158",
            "dpc": "03010533201",
            "name": "សោម សុផុន"
        },
        {
            "barcode": "171108159",
            "dpc": "03010533301",
            "name": "អ៊ុង  សាម"
        },
        {
            "barcode": "171108160",
            "dpc": "03010533401",
            "name": "ទ្រី សុខឃីម"
        },
        {
            "barcode": "171108161",
            "dpc": "03010533501",
            "name": "ក្រុមហ៊ុនរិទ្ធីមន្នី"
        },
        {
            "barcode": "171108162",
            "dpc": "03010533601",
            "name": "សុខ ចាន់មន្នី"
        },
        {
            "barcode": "171108163",
            "dpc": "03010533701",
            "name": "សុខ សំអាត"
        },
        {
            "barcode": "171108164",
            "dpc": "03010533801",
            "name": "ងួន ចន្ធូ"
        },
        {
            "barcode": "171108165",
            "dpc": "03010533901",
            "name": "យឹក ចាន់"
        },
        {
            "barcode": "171108166",
            "dpc": "03010534001",
            "name": "ឈឹម នួន"
        },
        {
            "barcode": "171108167",
            "dpc": "03010534101",
            "name": "ប៊ុន សេងហាក"
        },
        {
            "barcode": "171108168",
            "dpc": "03010534201",
            "name": "គឹម ស្រ៊ុន"
        },
        {
            "barcode": "171108169",
            "dpc": "03010534301",
            "name": "រឿន ឡោ"
        },
        {
            "barcode": "171108170",
            "dpc": "03010534401",
            "name": "ទួត សុខុម"
        },
        {
            "barcode": "171108171",
            "dpc": "03010534501",
            "name": "តិច វែង"
        },
        {
            "barcode": "171108172",
            "dpc": "03010534601",
            "name": "លី ផេង"
        },
        {
            "barcode": "171108173",
            "dpc": "03010534701",
            "name": "គឹម ញ៉ាង"
        },
        {
            "barcode": "171108174",
            "dpc": "03010534801",
            "name": "វ៉ាង យ៉ុង"
        },
        {
            "barcode": "171108175",
            "dpc": "03010534901",
            "name": "វិន អ៊ាន"
        },
        {
            "barcode": "171108176",
            "dpc": "03010535001",
            "name": "គង់ សុផល"
        },
        {
            "barcode": "171108177",
            "dpc": "03010535101",
            "name": "នាត តាក"
        },
        {
            "barcode": "171108178",
            "dpc": "03010535201",
            "name": "សួង មឿន"
        },
        {
            "barcode": "171108179",
            "dpc": "03010535301",
            "name": "ណាង ប៊ុនរឿន"
        },
        {
            "barcode": "171108180",
            "dpc": "03010535401",
            "name": "នឹប ណេរ៉ា"
        },
        {
            "barcode": "171108181",
            "dpc": "03010535501",
            "name": "ឈួន ហ្គីតា"
        },
        {
            "barcode": "171108182",
            "dpc": "03010535601",
            "name": "ហេង ឃាង"
        },
        {
            "barcode": "171108183",
            "dpc": "03010535701",
            "name": "ជា សឿន"
        },
        {
            "barcode": "171108184",
            "dpc": "03010535801",
            "name": "ឈុំ ឈៀង"
        },
        {
            "barcode": "171108185",
            "dpc": "03010535901",
            "name": "ទួត រិន"
        },
        {
            "barcode": "171108186",
            "dpc": "03010536101",
            "name": "ស៊ូ វិចិត្រ"
        },
        {
            "barcode": "171108187",
            "dpc": "03010536201",
            "name": "ទិវ ផាវី"
        },
        {
            "barcode": "171108188",
            "dpc": "03010538901",
            "name": "ទាវ  សារ៉ូ"
        },
        {
            "barcode": "171108189",
            "dpc": "03010539301",
            "name": "ពេជ្រ  រើន"
        },
        {
            "barcode": "171108190",
            "dpc": "03010539701",
            "name": "ហួន  សុខា"
        },
        {
            "barcode": "171108191",
            "dpc": "03010533101",
            "name": "ប្រាក់  ណន"
        },
        {
            "barcode": "171108192",
            "dpc": "03010536001",
            "name": "ផា  សុផល"
        },
        {
            "barcode": "171108193",
            "dpc": "03010539401",
            "name": "ហាក់  ឡាយ"
        },
        {
            "barcode": "171108194",
            "dpc": "03010539501",
            "name": "ពេជ្រ  ឌី"
        },
        {
            "barcode": "171108195",
            "dpc": "03010542401",
            "name": "ហម  សាវ៉ុន"
        },
        {
            "barcode": "171108196",
            "dpc": "03010542501",
            "name": "ឆៃ  វណ្ណះ"
        },
        {
            "barcode": "171108197",
            "dpc": "03010542701",
            "name": "តឹក  សំអឿន"
        },
        {
            "barcode": "171108198",
            "dpc": "03010543601",
            "name": "គឿន  អឿប"
        },
        {
            "barcode": "171108199",
            "dpc": "03010544201",
            "name": "សាលារៀនសូបាណា"
        },
        {
            "barcode": "171109504",
            "dpc": "03010548001",
            "name": "ស៊ាង សាលី"
        }
    ]
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});