
let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=
    [
        {
            "barcode": "171106486",
            "dpc": "03021020201",
            "name": "យាយ ឡាប"
        },
        {
            "barcode": "171106487",
            "dpc": "03021020301",
            "name": "យូ សំអាត"
        },
        {
            "barcode": "171106488",
            "dpc": "03021020701",
            "name": "សុខ ចន្ធី"
        },
        {
            "barcode": "171106489",
            "dpc": "03021020601",
            "name": "ម៉ិល យួង"
        },
        {
            "barcode": "171106490",
            "dpc": "03021020801",
            "name": "ស៊ិន សំ"
        },
        {
            "barcode": "171106491",
            "dpc": "03021020901",
            "name": "មាស សិទ្ធិដារ៉ារិទ្ធ"
        },
        {
            "barcode": "171106492",
            "dpc": "03021021001",
            "name": "យូ ណារ៉ា"
        },
        {
            "barcode": "171106493",
            "dpc": "03021021101",
            "name": "វឿត ដារ៉ា"
        },
        {
            "barcode": "171106494",
            "dpc": "03021021201",
            "name": "សួស យឹង"
        },
        {
            "barcode": "171106495",
            "dpc": "03021021301",
            "name": "រី សារ៉ាន"
        },
        {
            "barcode": "171106496",
            "dpc": "03021021401",
            "name": "រួត ប៊ូន"
        },
        {
            "barcode": "171106497",
            "dpc": "03021021501",
            "name": "ស៊ិន សំបូ ១"
        },
        {
            "barcode": "171106498",
            "dpc": "03021021601",
            "name": "តៅ ទូច"
        },
        {
            "barcode": "171106499",
            "dpc": "03021021701",
            "name": "អ៊ឹម ចិន្ត្រា"
        },
        {
            "barcode": "171106500",
            "dpc": "03021021801",
            "name": "ឈុំ ឆាត"
        },
        {
            "barcode": "171106501",
            "dpc": "03021021901",
            "name": "សុខ នាង"
        },
        {
            "barcode": "171106502",
            "dpc": "03021022001",
            "name": "ស៊ិន សំប៊ួន ២"
        },
        {
            "barcode": "171106503",
            "dpc": "03021022101",
            "name": "ពេទ្យ និច"
        },
        {
            "barcode": "171106504",
            "dpc": "03021022201",
            "name": "ផាន់ សច្ចា"
        },
        {
            "barcode": "171106505",
            "dpc": "03021022301",
            "name": "ទ័រ វ៉ាន"
        },
        {
            "barcode": "171106506",
            "dpc": "03021022401",
            "name": "កុយ សារឿ"
        },
        {
            "barcode": "171106507",
            "dpc": "03021017201",
            "name": "ជួន ណារ៉េត"
        },
        {
            "barcode": "171106508",
            "dpc": "03021017301",
            "name": "គី រី"
        },
        {
            "barcode": "171106509",
            "dpc": "03021017401",
            "name": "ហង្ស ញ្ច៉ុក"
        },
        {
            "barcode": "171106510",
            "dpc": "03021017501",
            "name": "វ៉ាន់ សល់"
        },
        {
            "barcode": "171106511",
            "dpc": "03021017601",
            "name": "សាន នី"
        },
        {
            "barcode": "171106512",
            "dpc": "03021017701",
            "name": "នុត វទ្ធី"
        },
        {
            "barcode": "171106513",
            "dpc": "03021017801",
            "name": "ឯល សុម៉ាលីន"
        },
        {
            "barcode": "171106514",
            "dpc": "03021017901",
            "name": "សេង អ៊ុន"
        },
        {
            "barcode": "171106515",
            "dpc": "03021018001",
            "name": "ភី ភុំ"
        },
        {
            "barcode": "171106516",
            "dpc": "03021018101",
            "name": "ស៊ុន សុវន្តា"
        },
        {
            "barcode": "171106517",
            "dpc": "03021018201",
            "name": "សាម ម៉ាត់ស"
        },
        {
            "barcode": "171106518",
            "dpc": "03021018301",
            "name": "ណាន លីន"
        },
        {
            "barcode": "171106519",
            "dpc": "03021018401",
            "name": "ម៉េត នូរីយៈ"
        },
        {
            "barcode": "171106520",
            "dpc": "03021018501",
            "name": "ឡិប អះម៉ាត់"
        },
        {
            "barcode": "171106521",
            "dpc": "03021018601",
            "name": "ឯក ស៊ីនួន"
        },
        {
            "barcode": "171106522",
            "dpc": "03021018701",
            "name": "ម៉ាន ហាសាណាល់"
        },
        {
            "barcode": "171106523",
            "dpc": "03021018801",
            "name": "ចាន់ ចំណាន"
        },
        {
            "barcode": "171106524",
            "dpc": "03021018901",
            "name": "សេង សម្បត្តិ"
        },
        {
            "barcode": "171106525",
            "dpc": "03021019001",
            "name": "ម៉ាត់ យ៉ាន"
        },
        {
            "barcode": "171106526",
            "dpc": "03021019201",
            "name": "លី ឆេង"
        },
        {
            "barcode": "171106527",
            "dpc": "03021019301",
            "name": "ឡឹប រីណា"
        },
        {
            "barcode": "171106528",
            "dpc": "03021019401",
            "name": "អ៊ុន លីម"
        },
        {
            "barcode": "171106529",
            "dpc": "03021019501",
            "name": "សំរិត កាទ័រ"
        },
        {
            "barcode": "171106530",
            "dpc": "03021019701",
            "name": "លី សុវណ្ណ"
        },
        {
            "barcode": "171106531",
            "dpc": "03021019801",
            "name": "សួស សាវ៉ាត"
        },
        {
            "barcode": "171106532",
            "dpc": "03021020001",
            "name": "ឡាំ ប៊ុនកែវ"
        },
        {
            "barcode": "171106533",
            "dpc": "03021020101",
            "name": "ស៊ិន សុខ"
        },
        {
            "barcode": "171106534",
            "dpc": "03021022601",
            "name": "ឡុង សារី"
        },
        {
            "barcode": "171106535",
            "dpc": "03021022701",
            "name": "ជា ចាន់សាវុធ"
        },
        {
            "barcode": "171106536",
            "dpc": "03021022801",
            "name": "ស្មាន់ ហ្វាស់"
        },
        {
            "barcode": "171106537",
            "dpc": "03021022901",
            "name": "ស្មាន់ កាស់"
        },
        {
            "barcode": "171106538",
            "dpc": "03021023001",
            "name": "សោ ប៊ុនម៉ី"
        },
        {
            "barcode": "171106539",
            "dpc": "03021023101",
            "name": "សាន ឡឹក"
        },
        {
            "barcode": "171106540",
            "dpc": "03021023201",
            "name": "ស៊ាង ដំ"
        },
        {
            "barcode": "171106541",
            "dpc": "03021023301",
            "name": "បូ ស្រ៊ុយ"
        },
        {
            "barcode": "171106542",
            "dpc": "03021023401",
            "name": "ហាន ហ៊ួន"
        },
        {
            "barcode": "171106543",
            "dpc": "03021023601",
            "name": "អាត់ ចំរើន"
        },
        {
            "barcode": "171106544",
            "dpc": "03021023701",
            "name": "ផាន់ សាម៉ន"
        },
        {
            "barcode": "171106545",
            "dpc": "03021023801",
            "name": "ចំរើន សេរីវឌ្ឍន៍"
        },
        {
            "barcode": "171106546",
            "dpc": "03021023901",
            "name": "ស្វឺយ ប៊ុនរឿន"
        },
        {
            "barcode": "171106547",
            "dpc": "03021024101",
            "name": "ប៉ិល សារុន"
        },
        {
            "barcode": "171106548",
            "dpc": "03021024201",
            "name": "គង់ ថា"
        },
        {
            "barcode": "171106549",
            "dpc": "03021024401",
            "name": "ឡាយ យ៉េប"
        },
        {
            "barcode": "171106550",
            "dpc": "03021024501",
            "name": "សេង លាងហេង"
        },
        {
            "barcode": "171106551",
            "dpc": "03021024601",
            "name": "វង្ស សុផា"
        },
        {
            "barcode": "171106552",
            "dpc": "03021024701",
            "name": "កែវ សមុទ្រ"
        },
        {
            "barcode": "171106553",
            "dpc": "03021024801",
            "name": "យឿន ចិនជូ"
        },
        {
            "barcode": "171106554",
            "dpc": "03021024901",
            "name": "យស់ សារ៉ាត់"
        },
        {
            "barcode": "171106555",
            "dpc": "03021025001",
            "name": "គា សឿន"
        },
        {
            "barcode": "171106556",
            "dpc": "03021025101",
            "name": "ជា សេង"
        },
        {
            "barcode": "171106557",
            "dpc": "03021025201",
            "name": "សៅ យ៉ុត"
        },
        {
            "barcode": "171106558",
            "dpc": "03021025301",
            "name": "ប៉ិល ហុង"
        },
        {
            "barcode": "171106559",
            "dpc": "03021025401",
            "name": "អ៊ុច សាវី"
        },
        {
            "barcode": "171106560",
            "dpc": "03021025501",
            "name": "យ៉ិន សូវៀត"
        },
        {
            "barcode": "171106561",
            "dpc": "03021025601",
            "name": "ប៉ុក វាសនា"
        },
        {
            "barcode": "171106562",
            "dpc": "03021025701",
            "name": "ពេជ្ររិន"
        },
        {
            "barcode": "171106563",
            "dpc": "03021038201",
            "name": "តាត កុសល់"
        },
        {
            "barcode": "171106564",
            "dpc": "03021038401",
            "name": "ធូ ភី"
        },
        {
            "barcode": "171106565",
            "dpc": "03021038501",
            "name": "ចាន់ សារុំ"
        },
        {
            "barcode": "171106566",
            "dpc": "03021038601",
            "name": "ឡុង បូរី"
        },
        {
            "barcode": "171106567",
            "dpc": "03021038701",
            "name": "ញឹម  គន្ធា"
        },
        {
            "barcode": "171106568",
            "dpc": "03021038901",
            "name": "ឃឹម ហុក"
        },
        {
            "barcode": "171106569",
            "dpc": "03021039001",
            "name": "ឃឹម លាង"
        },
        {
            "barcode": "171106570",
            "dpc": "03021039101",
            "name": "សំ គឹមជុយ"
        },
        {
            "barcode": "171106571",
            "dpc": "03021039201",
            "name": "រួន សឿន"
        },
        {
            "barcode": "171106572",
            "dpc": "03021039301",
            "name": "ដួង គន្ធា"
        },
        {
            "barcode": "171106573",
            "dpc": "03021039401",
            "name": "ឆេង សំអាត"
        },
        {
            "barcode": "171106574",
            "dpc": "03021039501",
            "name": "ទេព សារ៉ាត់"
        },
        {
            "barcode": "171106575",
            "dpc": "03021039801",
            "name": "ញឹក  សុខាន"
        },
        {
            "barcode": "171106576",
            "dpc": "03021039901",
            "name": "ឌុក សូដា"
        },
        {
            "barcode": "171106577",
            "dpc": "03021040001",
            "name": "សៅ សាម៉ុន"
        },
        {
            "barcode": "171106578",
            "dpc": "03021040201",
            "name": "អៀង សុភី"
        },
        {
            "barcode": "171106579",
            "dpc": "03021040401",
            "name": "ភេក ជារៈ"
        },
        {
            "barcode": "171106580",
            "dpc": "03021040501",
            "name": "ទឹង សំបូរ"
        },
        {
            "barcode": "171106581",
            "dpc": "03021040701",
            "name": "អៀង យិត"
        },
        {
            "barcode": "171106582",
            "dpc": "03021040801",
            "name": "នៅ ដារីទ្ធ"
        },
        {
            "barcode": "171106583",
            "dpc": "03021040901",
            "name": "ទឹង អាង"
        },
        {
            "barcode": "171106584",
            "dpc": "03021041001",
            "name": "ឆន ហុង"
        },
        {
            "barcode": "171106585",
            "dpc": "03021041101",
            "name": "ទេស សារុន"
        },
        {
            "barcode": "171106586",
            "dpc": "03021041201",
            "name": "ញ៉ែម សុខចាន់"
        },
        {
            "barcode": "171106587",
            "dpc": "03021041301",
            "name": "កុយ ធីតា"
        },
        {
            "barcode": "171106588",
            "dpc": "03021041401",
            "name": "សោម វណ្ណី"
        },
        {
            "barcode": "171106589",
            "dpc": "03021041501",
            "name": "ជិន បូរ៉ា"
        },
        {
            "barcode": "171106590",
            "dpc": "03021041601",
            "name": "ស្រី ឈឿន"
        },
        {
            "barcode": "171106591",
            "dpc": "03021041701",
            "name": "លេ តាល់"
        },
        {
            "barcode": "171106592",
            "dpc": "03021041801",
            "name": "កុយ សាម៉ន"
        },
        {
            "barcode": "171106593",
            "dpc": "03021041901",
            "name": "ហ៊ុន សាន"
        },
        {
            "barcode": "171106594",
            "dpc": "03021042001",
            "name": "ហុង សុខន"
        },
        {
            "barcode": "171106595",
            "dpc": "03021042101",
            "name": "កុយ គីម"
        },
        {
            "barcode": "171106596",
            "dpc": "03021042201",
            "name": "សាត សាលី"
        },
        {
            "barcode": "171106597",
            "dpc": "03021042301",
            "name": "ណាប់ ឈន"
        },
        {
            "barcode": "171106598",
            "dpc": "03021042401",
            "name": "ផាន់ វីរៈពង្ស"
        },
        {
            "barcode": "171106599",
            "dpc": "03021042501",
            "name": "វ៉ាន់ ស៊ឹមវ៉ា"
        },
        {
            "barcode": "171106600",
            "dpc": "03021042601",
            "name": "បាន នី"
        },
        {
            "barcode": "171106601",
            "dpc": "03021042701",
            "name": "កឹម  ធា"
        },
        {
            "barcode": "171106602",
            "dpc": "03021042801",
            "name": "ផាន់ ចាន់សេរី"
        },
        {
            "barcode": "171106603",
            "dpc": "03021042901",
            "name": "កិម  ឈឿន"
        },
        {
            "barcode": "171106604",
            "dpc": "03021043001",
            "name": "ខេង សុខុន"
        },
        {
            "barcode": "171106605",
            "dpc": "03021043101",
            "name": "ម៉ែន ហម"
        },
        {
            "barcode": "171106606",
            "dpc": "03021043201",
            "name": "ឈាង ង៉ែត"
        },
        {
            "barcode": "171106607",
            "dpc": "03021043301",
            "name": "ហ៊ុន សាន"
        },
        {
            "barcode": "171106608",
            "dpc": "03021043401",
            "name": "ទូច សុទ្ធី"
        },
        {
            "barcode": "171106609",
            "dpc": "03021043501",
            "name": "ឆន ប៊ុនឈឿន"
        },
        {
            "barcode": "171106610",
            "dpc": "03021043601",
            "name": "ថោ សាន"
        },
        {
            "barcode": "171106611",
            "dpc": "03021043701",
            "name": "រី សារ៉េត"
        },
        {
            "barcode": "171106612",
            "dpc": "03021043801",
            "name": "ជុំ សុខុន"
        },
        {
            "barcode": "171106613",
            "dpc": "03021044001",
            "name": "តំ  សុផល"
        },
        {
            "barcode": "171106614",
            "dpc": "03021047901",
            "name": "អ៊ុក ចាន់ម៉ាលី ២"
        },
        {
            "barcode": "171106615",
            "dpc": "03021047701",
            "name": "យិន សុទ្ធ"
        },
        {
            "barcode": "171106616",
            "dpc": "03021047601",
            "name": "ហេង រដ្ឋា"
        },
        {
            "barcode": "171106617",
            "dpc": "03021047301",
            "name": "ឡាច ម៉ាន់"
        },
        {
            "barcode": "171106618",
            "dpc": "03021047401",
            "name": "ឡោ វ៉ា"
        },
        {
            "barcode": "171106619",
            "dpc": "03021047201",
            "name": "ម៉ាន់ ឃៀង ២"
        },
        {
            "barcode": "171106620",
            "dpc": "03021047001",
            "name": "សេក សុន"
        },
        {
            "barcode": "171106621",
            "dpc": "03021046901",
            "name": "ម៉ាន់ ឃៀង ១"
        },
        {
            "barcode": "171106622",
            "dpc": "03021045201",
            "name": "អ៊ឹម ឈុន"
        },
        {
            "barcode": "171106623",
            "dpc": "03021045101",
            "name": "ប៉ិច ឌឿន"
        },
        {
            "barcode": "171106624",
            "dpc": "03021044901",
            "name": "អ៊ុក ប៊ុនរ៉ាស៊ី"
        },
        {
            "barcode": "171106625",
            "dpc": "03021044501",
            "name": "គឹម លាង"
        },
        {
            "barcode": "171106626",
            "dpc": "03021044201",
            "name": "អៅ តុង"
        },
        {
            "barcode": "171106627",
            "dpc": "03021044101",
            "name": "ប៊ិន សាវ៉ាត់"
        },
        {
            "barcode": "171106628",
            "dpc": "03021046801",
            "name": "អ៊ិន ឆុន"
        },
        {
            "barcode": "171106629",
            "dpc": "03021046701",
            "name": "អាន រ៉េត"
        },
        {
            "barcode": "171106630",
            "dpc": "03021046501",
            "name": "វង្ស រ៉ាវី"
        },
        {
            "barcode": "171106631",
            "dpc": "03021046401",
            "name": "សុខ ហៀង"
        },
        {
            "barcode": "171106632",
            "dpc": "03021046201",
            "name": "មាស សាឯម"
        },
        {
            "barcode": "171106633",
            "dpc": "03021046101",
            "name": "កៅ សេក"
        },
        {
            "barcode": "171106634",
            "dpc": "03021046001",
            "name": "ប៊ុន ណាន"
        },
        {
            "barcode": "171106635",
            "dpc": "03021045901",
            "name": "ថោង គឹមលាន"
        },
        {
            "barcode": "171106636",
            "dpc": "03021045801",
            "name": "គឺម   ចន្ថា"
        },
        {
            "barcode": "171106637",
            "dpc": "03021045701",
            "name": "ភោគ ថន"
        },
        {
            "barcode": "171106638",
            "dpc": "03021045501",
            "name": "កិម  ខាន"
        },
        {
            "barcode": "171106639",
            "dpc": "03021045401",
            "name": "សុខ ឈឿន"
        },
        {
            "barcode": "171106640",
            "dpc": "03021045301",
            "name": "ញ៉ា វុទ្ធី"
        },
        {
            "barcode": "171106641",
            "dpc": "03021046601",
            "name": "វ័រ សោភ័ណ្ឌ"
        },
        {
            "barcode": "171106642",
            "dpc": "03021025801",
            "name": "ឡាវ ថៃ"
        },
        {
            "barcode": "171106643",
            "dpc": "03021025901",
            "name": "អៀង សិលា"
        },
        {
            "barcode": "171106644",
            "dpc": "03021026001",
            "name": "សុខ សីរីវឌ្ឍនា"
        },
        {
            "barcode": "171106645",
            "dpc": "03021026301",
            "name": "វិន ស៊ាប"
        },
        {
            "barcode": "171106646",
            "dpc": "03021026401",
            "name": "តៅ លី"
        },
        {
            "barcode": "171106647",
            "dpc": "03021026501",
            "name": "ម៉ាត់ សុខគ្រី"
        },
        {
            "barcode": "171106648",
            "dpc": "03021026601",
            "name": "ឡឹម វ៉ាន់នី"
        },
        {
            "barcode": "171106649",
            "dpc": "03021026801",
            "name": "អៀម សុធា"
        },
        {
            "barcode": "171106650",
            "dpc": "03021026901",
            "name": "ឡាយ រិទ្ធវង្ស"
        },
        {
            "barcode": "171106651",
            "dpc": "03021026201",
            "name": "ប៊ុត សារ៉េត"
        },
        {
            "barcode": "171106652",
            "dpc": "03021026101",
            "name": "មៀច ឈាន"
        },
        {
            "barcode": "171106653",
            "dpc": "03021027101",
            "name": "ឃួន ហួយលាង"
        },
        {
            "barcode": "171106654",
            "dpc": "03021027001",
            "name": "ចាន់ ថាវី"
        },
        {
            "barcode": "171106655",
            "dpc": "03021027201",
            "name": "កុង ស៊ីវ"
        },
        {
            "barcode": "171106656",
            "dpc": "03021027301",
            "name": "មៀវ សុងនី"
        },
        {
            "barcode": "171106657",
            "dpc": "03021027501",
            "name": "ទឹង អេង"
        },
        {
            "barcode": "171106658",
            "dpc": "03021027701",
            "name": "គឹម ឃោ"
        },
        {
            "barcode": "171106659",
            "dpc": "03021027801",
            "name": "សុខ ហេង"
        },
        {
            "barcode": "171106660",
            "dpc": "03021027901",
            "name": "អ៊ុង ស៊ីថា"
        },
        {
            "barcode": "171106661",
            "dpc": "03021028001",
            "name": "ហូ រចនា"
        },
        {
            "barcode": "171106662",
            "dpc": "03021028101",
            "name": "វ៉ាន់ រីម"
        },
        {
            "barcode": "171106663",
            "dpc": "03021028301",
            "name": "អ៊ី ធិន"
        },
        {
            "barcode": "171106664",
            "dpc": "03021028401",
            "name": "សៀង គាង"
        },
        {
            "barcode": "171106665",
            "dpc": "03021028501",
            "name": "មេត សាមីត"
        },
        {
            "barcode": "171106666",
            "dpc": "03021028601",
            "name": "គេវ ទៀង"
        },
        {
            "barcode": "171106667",
            "dpc": "03021028701",
            "name": "អាប់ ម៉ាប់"
        },
        {
            "barcode": "171106668",
            "dpc": "03021028801",
            "name": "អ៊ុយ ឈាន"
        },
        {
            "barcode": "171106669",
            "dpc": "03021028901",
            "name": "ជា ផូ"
        },
        {
            "barcode": "171106670",
            "dpc": "03021029001",
            "name": "លីវ ហ៊ួរ"
        },
        {
            "barcode": "171106671",
            "dpc": "03021029101",
            "name": "សាន លួន"
        },
        {
            "barcode": "171106672",
            "dpc": "03021029201",
            "name": "សួន ឃឿន"
        },
        {
            "barcode": "171106673",
            "dpc": "03021029301",
            "name": "សំ ឡេង"
        },
        {
            "barcode": "171106674",
            "dpc": "03021029401",
            "name": "លី សានផូ"
        },
        {
            "barcode": "171106675",
            "dpc": "03021019101",
            "name": "កៃ  សុខុម"
        },
        {
            "barcode": "171106676",
            "dpc": "03021023501",
            "name": "គង់ សុភ័ណ្ឌ"
        },
        {
            "barcode": "171106677",
            "dpc": "03021034801",
            "name": "អ៊ឹម ផាត់"
        },
        {
            "barcode": "171106678",
            "dpc": "03021034901",
            "name": "អឿន ប៊ុនថុល"
        },
        {
            "barcode": "171106679",
            "dpc": "03021044401",
            "name": "យុន   រ៉ាអ៊ូល"
        },
        {
            "barcode": "171106680",
            "dpc": "03021029601",
            "name": "អឿង  ជឿន"
        },
        {
            "barcode": "171106681",
            "dpc": "03021029501",
            "name": "អៀង សុកខន"
        },
        {
            "barcode": "171106682",
            "dpc": "03021029701",
            "name": "ពឹង ថៃហេង"
        },
        {
            "barcode": "171106683",
            "dpc": "03021029801",
            "name": "ពិន សាន"
        },
        {
            "barcode": "171106684",
            "dpc": "03021029901",
            "name": "ខោ វិរៈ"
        },
        {
            "barcode": "171106685",
            "dpc": "03021030001",
            "name": "សុខ ញ៉"
        },
        {
            "barcode": "171106686",
            "dpc": "03021030101",
            "name": "លឹម លី"
        },
        {
            "barcode": "171106687",
            "dpc": "03021030201",
            "name": "ម៉ាត់ ឯល"
        },
        {
            "barcode": "171106688",
            "dpc": "03021030301",
            "name": "មិន ណី"
        },
        {
            "barcode": "171106689",
            "dpc": "03021030401",
            "name": "ផាន់ អ៊ឹសេរី"
        },
        {
            "barcode": "171106690",
            "dpc": "03021030501",
            "name": "សឿន ស៊ីថា"
        },
        {
            "barcode": "171106691",
            "dpc": "03021030601",
            "name": "ព្រំ ភួង"
        },
        {
            "barcode": "171106692",
            "dpc": "03021030701",
            "name": "ហាំង ឡេង"
        },
        {
            "barcode": "171106693",
            "dpc": "03021030801",
            "name": "ចាន់ មៀន"
        },
        {
            "barcode": "171106694",
            "dpc": "03021030901",
            "name": "ម៉ក់ ឆៃរិទ្ធ"
        },
        {
            "barcode": "171106695",
            "dpc": "03021031101",
            "name": "យ៉ាំ វុទ្ធានី"
        },
        {
            "barcode": "171106696",
            "dpc": "03021031301",
            "name": "ចាន់ គឹមឡេង"
        },
        {
            "barcode": "171106697",
            "dpc": "03021031401",
            "name": "ហួត វ៉ាន់ថន"
        },
        {
            "barcode": "171106698",
            "dpc": "03021031801",
            "name": "ដួង សារឿន"
        },
        {
            "barcode": "171106699",
            "dpc": "03021032001",
            "name": "ម៉ៅ សាវ៉ាត"
        },
        {
            "barcode": "171106700",
            "dpc": "03021032101",
            "name": "ហុត សុភាព"
        },
        {
            "barcode": "171106701",
            "dpc": "03021032301",
            "name": "ស៊ីម សាម៉ន"
        },
        {
            "barcode": "171106702",
            "dpc": "03021032401",
            "name": "ព្រំ វិបុល"
        },
        {
            "barcode": "171106703",
            "dpc": "03021032501",
            "name": "អ៊ុង ជឿន"
        },
        {
            "barcode": "171106704",
            "dpc": "03021031901",
            "name": "ទុយ ចិន្តា"
        },
        {
            "barcode": "171106705",
            "dpc": "03021032601",
            "name": "អ៊ុង សារុំ"
        },
        {
            "barcode": "171106706",
            "dpc": "03021032701",
            "name": "វ៉ាន់ ចាន់នី"
        },
        {
            "barcode": "171106707",
            "dpc": "03021032901",
            "name": "ភឹង ផាសិទ្ធ"
        },
        {
            "barcode": "171106708",
            "dpc": "03021033101",
            "name": "យាន  បូរិន"
        },
        {
            "barcode": "171106709",
            "dpc": "03021033201",
            "name": "ទួន ភាព"
        },
        {
            "barcode": "171106710",
            "dpc": "03021033401",
            "name": "ឆាយ សុភាព"
        },
        {
            "barcode": "171106711",
            "dpc": "03021033501",
            "name": "ចាន់ សារី"
        },
        {
            "barcode": "171106712",
            "dpc": "03021033601",
            "name": "សេង សៀន"
        },
        {
            "barcode": "171106713",
            "dpc": "03021033701",
            "name": "ហែម ផល្លី"
        },
        {
            "barcode": "171106714",
            "dpc": "03021033801",
            "name": "ឡោ ស៊ីណយ"
        },
        {
            "barcode": "171106715",
            "dpc": "03021033901",
            "name": "សែម សុំ"
        },
        {
            "barcode": "171106716",
            "dpc": "03021034001",
            "name": "ចាន់ ស្រីមុំ"
        },
        {
            "barcode": "171106717",
            "dpc": "03021034101",
            "name": "ឆាយ ស៊ីណា"
        },
        {
            "barcode": "171106718",
            "dpc": "03021034301",
            "name": "កែម វង្ស"
        },
        {
            "barcode": "171106719",
            "dpc": "03021034401",
            "name": "កើង ស៊ីណែត"
        },
        {
            "barcode": "171106720",
            "dpc": "03021034501",
            "name": "ព្រួញ វល័ក្ខ"
        },
        {
            "barcode": "171106721",
            "dpc": "03021034601",
            "name": "ទេស សុផាត"
        },
        {
            "barcode": "171106722",
            "dpc": "03021034701",
            "name": "ទូច សារ៉ន"
        },
        {
            "barcode": "171106723",
            "dpc": "03021035101",
            "name": "លឿង ធីលី"
        },
        {
            "barcode": "171106724",
            "dpc": "03021035201",
            "name": "អ៊ិត ឆម"
        },
        {
            "barcode": "171106725",
            "dpc": "03021035701",
            "name": "ដៀប កែវមុន្នី"
        },
        {
            "barcode": "171106726",
            "dpc": "03021035801",
            "name": "ដៀប ចិន្តា"
        },
        {
            "barcode": "171106727",
            "dpc": "03021035401",
            "name": "ផេង អេង"
        },
        {
            "barcode": "171106728",
            "dpc": "03021035501",
            "name": "គឹម ហេង"
        },
        {
            "barcode": "171106729",
            "dpc": "03021035601",
            "name": "សុង គា"
        },
        {
            "barcode": "171106730",
            "dpc": "03021035901",
            "name": "អេង ខេង"
        },
        {
            "barcode": "171106731",
            "dpc": "03021036001",
            "name": "ង៉ែត សុវណ្ណ"
        },
        {
            "barcode": "171106732",
            "dpc": "03021036101",
            "name": "លាង ហ៊ាង"
        },
        {
            "barcode": "171106733",
            "dpc": "03021037001",
            "name": "ឃិន សូរិយា"
        },
        {
            "barcode": "171106734",
            "dpc": "03021036901",
            "name": "សោម សុធា"
        },
        {
            "barcode": "171106735",
            "dpc": "03021036801",
            "name": "សោម សិទ្ធគុណ"
        },
        {
            "barcode": "171106736",
            "dpc": "03021036701",
            "name": "ស៊  គឹមហាក់"
        },
        {
            "barcode": "171106737",
            "dpc": "03021036501",
            "name": "មាស សារ៉េត"
        },
        {
            "barcode": "171106738",
            "dpc": "03021036401",
            "name": "សោម សុវត្តិ"
        },
        {
            "barcode": "171106739",
            "dpc": "03021036301",
            "name": "សោម អូន"
        },
        {
            "barcode": "171106740",
            "dpc": "03021036201",
            "name": "សុខ វង្ស"
        },
        {
            "barcode": "171106741",
            "dpc": "03021037101",
            "name": "គឹម ខេង"
        },
        {
            "barcode": "171106742",
            "dpc": "03021037201",
            "name": "គឿង ហុង ១"
        },
        {
            "barcode": "171106743",
            "dpc": "03021037301",
            "name": "គឿង ហុង ២"
        },
        {
            "barcode": "171106744",
            "dpc": "03021037401",
            "name": "ឈួន ឆៃលី"
        },
        {
            "barcode": "171106745",
            "dpc": "03021037501",
            "name": "លឹម ប៉ិច ២"
        },
        {
            "barcode": "171106746",
            "dpc": "03021037601",
            "name": "ឈាន ប៊ុនហាប់"
        },
        {
            "barcode": "171106747",
            "dpc": "03021037701",
            "name": "ឈាន ប៊ុនហ៊ីម"
        },
        {
            "barcode": "171106748",
            "dpc": "03021037801",
            "name": "ហូ ឡាវ"
        },
        {
            "barcode": "171106749",
            "dpc": "03021037901",
            "name": "ហេង ប៊ុនលឿត"
        },
        {
            "barcode": "171106750",
            "dpc": "03021038001",
            "name": "ខៀវ សំអុល"
        },
        {
            "barcode": "171106751",
            "dpc": "03021038101",
            "name": "លឹម គឹមសុង"
        },
        {
            "barcode": "171106752",
            "dpc": "03021000101",
            "name": "តាំង ពេជ្រ"
        },
        {
            "barcode": "171106753",
            "dpc": "03021000201",
            "name": "ហេង ឆៃវែង"
        },
        {
            "barcode": "171106754",
            "dpc": "03021000301",
            "name": "ឌួង វុទ្ធី"
        },
        {
            "barcode": "171106755",
            "dpc": "03021002701",
            "name": "ប៊ុន ងិន"
        },
        {
            "barcode": "171106756",
            "dpc": "03021002501",
            "name": "តាំង ប៊ុនហោរ"
        },
        {
            "barcode": "171106757",
            "dpc": "03021002801",
            "name": "កាំង ឡេង"
        },
        {
            "barcode": "171106758",
            "dpc": "03021003101",
            "name": "សី តាំងអោ"
        },
        {
            "barcode": "171106759",
            "dpc": "03021003201",
            "name": "យូ ម៉េង"
        },
        {
            "barcode": "171106760",
            "dpc": "03021003301",
            "name": "ឈូ គា"
        },
        {
            "barcode": "171106761",
            "dpc": "03021003401",
            "name": "ហេង ចេង"
        },
        {
            "barcode": "171106762",
            "dpc": "03021003501",
            "name": "វែង ឡាយ"
        },
        {
            "barcode": "171106763",
            "dpc": "03021003601",
            "name": "យូ ហុង"
        },
        {
            "barcode": "171106764",
            "dpc": "03021003701",
            "name": "គង់ ខេង"
        },
        {
            "barcode": "171106765",
            "dpc": "03021003801",
            "name": "រ៉េត ប៊ុនម៉ៅ"
        },
        {
            "barcode": "171106766",
            "dpc": "03021004001",
            "name": "ទន់ សុផល"
        },
        {
            "barcode": "171106767",
            "dpc": "03021004101",
            "name": "គឹម ណារី"
        },
        {
            "barcode": "171106768",
            "dpc": "03021004201",
            "name": "ជាតិ ប៉ែត"
        },
        {
            "barcode": "171106769",
            "dpc": "03021004301",
            "name": "សុខ ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171106770",
            "dpc": "03021004401",
            "name": "សួន សុលី"
        },
        {
            "barcode": "171106771",
            "dpc": "03021004501",
            "name": "គា ឡាយ"
        },
        {
            "barcode": "171106772",
            "dpc": "03021004801",
            "name": "សោម ឡេង"
        },
        {
            "barcode": "171106773",
            "dpc": "03021004901",
            "name": "ឡុង ហ៊ាង"
        },
        {
            "barcode": "171106774",
            "dpc": "03021005001",
            "name": "ឡុង ជីវ"
        },
        {
            "barcode": "171106775",
            "dpc": "03021005101",
            "name": "យិន កុឡាប"
        },
        {
            "barcode": "171106776",
            "dpc": "03021005201",
            "name": "សេក សារុន"
        },
        {
            "barcode": "171106777",
            "dpc": "03021005301",
            "name": "តា តោ"
        },
        {
            "barcode": "171106778",
            "dpc": "03021005401",
            "name": "ឆាយ សាមេត"
        },
        {
            "barcode": "171106779",
            "dpc": "03021005501",
            "name": "យូ រ៉ានី"
        },
        {
            "barcode": "171106780",
            "dpc": "03021005601",
            "name": "អ៊ិត សាវុធ"
        },
        {
            "barcode": "171106781",
            "dpc": "03021005701",
            "name": "ឡោ ម៉េងគង"
        },
        {
            "barcode": "171106782",
            "dpc": "03021005801",
            "name": "ស៊ីវ តិច"
        },
        {
            "barcode": "171106783",
            "dpc": "03021001301",
            "name": "ស្រេង ងួន"
        },
        {
            "barcode": "171106784",
            "dpc": "03021001701",
            "name": "យូ រ៉ាណេ"
        },
        {
            "barcode": "171106785",
            "dpc": "03021001801",
            "name": "ឃួន គង់"
        },
        {
            "barcode": "171106786",
            "dpc": "03021002101",
            "name": "អេង ធិន"
        },
        {
            "barcode": "171106787",
            "dpc": "03021002201",
            "name": "សាយ ពេក"
        },
        {
            "barcode": "171106788",
            "dpc": "03021002601",
            "name": "ធា លីម"
        },
        {
            "barcode": "171106789",
            "dpc": "03021002401",
            "name": "ហ្វង់ ឌ័រ"
        },
        {
            "barcode": "171106790",
            "dpc": "03021002001",
            "name": "ម៉ក់ មិត្ត"
        },
        {
            "barcode": "171106791",
            "dpc": "03021001901",
            "name": "អាង អេងសួរ"
        },
        {
            "barcode": "171106792",
            "dpc": "03021001601",
            "name": "ឈូ គា"
        },
        {
            "barcode": "171106793",
            "dpc": "03021001201",
            "name": "ស្រេង សៀន"
        },
        {
            "barcode": "171106794",
            "dpc": "03021001101",
            "name": "សេង ស៊្រុន"
        },
        {
            "barcode": "171106795",
            "dpc": "03021001001",
            "name": "សាយ ញឹប"
        },
        {
            "barcode": "171106796",
            "dpc": "03021000901",
            "name": "ឡុង ប៉េងសៀត"
        },
        {
            "barcode": "171106797",
            "dpc": "03021000801",
            "name": "សុខ សុជាតិ"
        },
        {
            "barcode": "171106798",
            "dpc": "03021000701",
            "name": "ប៉ិច ចាន់ធឿន"
        },
        {
            "barcode": "171106799",
            "dpc": "03021000501",
            "name": "បុត ផល្លី"
        },
        {
            "barcode": "171106800",
            "dpc": "03021000401",
            "name": "យិន  ស៊ុនណារី"
        },
        {
            "barcode": "171106801",
            "dpc": "03021005901",
            "name": "សៀក អូន"
        },
        {
            "barcode": "171106802",
            "dpc": "03021006001",
            "name": "ហេង ហៀង"
        },
        {
            "barcode": "171106803",
            "dpc": "03021006101",
            "name": "សុង ហេង"
        },
        {
            "barcode": "171106804",
            "dpc": "03021006201",
            "name": "អ៊ូច ចំណាន"
        },
        {
            "barcode": "171106805",
            "dpc": "03021006301",
            "name": "លឹម សៀង"
        },
        {
            "barcode": "171106806",
            "dpc": "03021006401",
            "name": "ប្រាក់ សារ៉ូ"
        },
        {
            "barcode": "171106807",
            "dpc": "03021006501",
            "name": "គឹម ចាន់លី"
        },
        {
            "barcode": "171106808",
            "dpc": "03021006601",
            "name": "តុង សារុន"
        },
        {
            "barcode": "171106809",
            "dpc": "03021006701",
            "name": "ងួន លី"
        },
        {
            "barcode": "171106810",
            "dpc": "03021006801",
            "name": "ហោ អ៊ូ"
        },
        {
            "barcode": "171106811",
            "dpc": "03021006901",
            "name": "អ៊ិត សុផល"
        },
        {
            "barcode": "171106812",
            "dpc": "03021007001",
            "name": "ឆែ អ៊ាប"
        },
        {
            "barcode": "171106813",
            "dpc": "03021007101",
            "name": "សេង ទៀង"
        },
        {
            "barcode": "171106814",
            "dpc": "03021007201",
            "name": "សេង ពីវ"
        },
        {
            "barcode": "171106815",
            "dpc": "03021007401",
            "name": "និន សានិត"
        },
        {
            "barcode": "171106816",
            "dpc": "03021007501",
            "name": "តោ គង់"
        },
        {
            "barcode": "171106817",
            "dpc": "03021007601",
            "name": "យ៉ុន ម៉ៅ"
        },
        {
            "barcode": "171106818",
            "dpc": "03021007701",
            "name": "រិន  ឡេង"
        },
        {
            "barcode": "171106819",
            "dpc": "03021007801",
            "name": "ជាតិ ហុង"
        },
        {
            "barcode": "171106820",
            "dpc": "03021007901",
            "name": "តាំង ទីគា"
        },
        {
            "barcode": "171106821",
            "dpc": "03021008001",
            "name": "គា ឆេង"
        },
        {
            "barcode": "171106822",
            "dpc": "03021008201",
            "name": "ផូ ផុន"
        },
        {
            "barcode": "171106823",
            "dpc": "03021008301",
            "name": "សុខ ទី"
        },
        {
            "barcode": "171106824",
            "dpc": "03021008401",
            "name": "វៀច ហ៊ុន"
        },
        {
            "barcode": "171106825",
            "dpc": "03021008701",
            "name": "ខ្លូត សាង៉ែត"
        },
        {
            "barcode": "171106826",
            "dpc": "03021008801",
            "name": "ជិង វ៉ាន់ស៊ី"
        },
        {
            "barcode": "171106827",
            "dpc": "03021008901",
            "name": "កែវ ផៃរោត"
        },
        {
            "barcode": "171106828",
            "dpc": "03021009101",
            "name": "សយ វណ្ណី"
        },
        {
            "barcode": "171106829",
            "dpc": "03021009201",
            "name": "អ៊ុក ផល្លា"
        },
        {
            "barcode": "171106830",
            "dpc": "03021009301",
            "name": "វ៉ាន់ គីរី"
        },
        {
            "barcode": "171106831",
            "dpc": "03021009401",
            "name": "ហង្ស គាន"
        },
        {
            "barcode": "171106832",
            "dpc": "03021009501",
            "name": "សៅ ភីណា"
        },
        {
            "barcode": "171106833",
            "dpc": "03021009601",
            "name": "កោ ឈុនឡេង"
        },
        {
            "barcode": "171106834",
            "dpc": "03021009801",
            "name": "ឈុន សៀក"
        },
        {
            "barcode": "171106835",
            "dpc": "03021009901",
            "name": "ឡុង ឡាយ"
        },
        {
            "barcode": "171106836",
            "dpc": "03021010001",
            "name": "ប៊ិន ប៉ូច"
        },
        {
            "barcode": "171106837",
            "dpc": "03021010101",
            "name": "មូល សុភី"
        },
        {
            "barcode": "171106838",
            "dpc": "03021010301",
            "name": "ឆ វិកុល"
        },
        {
            "barcode": "171106839",
            "dpc": "03021010401",
            "name": "ហោ ហួយ"
        },
        {
            "barcode": "171106840",
            "dpc": "03021010501",
            "name": "អ៊ិន ណារ៉ុង"
        },
        {
            "barcode": "171106841",
            "dpc": "03021010601",
            "name": "ឆេង គឹមឆាយ"
        },
        {
            "barcode": "171106842",
            "dpc": "03021010701",
            "name": "ឡោ ឌី"
        },
        {
            "barcode": "171106843",
            "dpc": "03021010801",
            "name": "ឡោ ឌៀន"
        },
        {
            "barcode": "171106844",
            "dpc": "03021010901",
            "name": "ទួន ទ្រី"
        },
        {
            "barcode": "171106845",
            "dpc": "03021011101",
            "name": "គឹម ពេញ"
        },
        {
            "barcode": "171106846",
            "dpc": "03021011201",
            "name": "អ៊ឹង រ៉ែកប៉ា"
        },
        {
            "barcode": "171106847",
            "dpc": "03021011301",
            "name": "សៀង ប៊ុនធី"
        },
        {
            "barcode": "171106848",
            "dpc": "03021011401",
            "name": "យក់ វណ្ណឆវី"
        },
        {
            "barcode": "171106849",
            "dpc": "03021011501",
            "name": "គង់ ឆេង"
        },
        {
            "barcode": "171106850",
            "dpc": "03021011601",
            "name": "តាំង ប៉ាក់ស្រេង"
        },
        {
            "barcode": "171106851",
            "dpc": "03021011701",
            "name": "ហែម លី"
        },
        {
            "barcode": "171106852",
            "dpc": "03021011901",
            "name": "លី ឡុង"
        },
        {
            "barcode": "171106853",
            "dpc": "03021012101",
            "name": "អ៊ឹង ម៉េងទី"
        },
        {
            "barcode": "171106854",
            "dpc": "03021012201",
            "name": "ឡាយ គីម"
        },
        {
            "barcode": "171106855",
            "dpc": "03021012301",
            "name": "តាំង ស៊ូងួន"
        },
        {
            "barcode": "171106856",
            "dpc": "03021012401",
            "name": "គឹម សេង"
        },
        {
            "barcode": "171106857",
            "dpc": "03021012501",
            "name": "យក់ វណ្ណឆវី ២"
        },
        {
            "barcode": "171106858",
            "dpc": "03021012601",
            "name": "ឡុង សាន"
        },
        {
            "barcode": "171106859",
            "dpc": "03021012701",
            "name": "សិទ្ធិ សារ៉ាយ"
        },
        {
            "barcode": "171106860",
            "dpc": "03021012801",
            "name": "ស៊ុន សិត"
        },
        {
            "barcode": "171106861",
            "dpc": "03021012901",
            "name": "ភា ភាព"
        },
        {
            "barcode": "171106862",
            "dpc": "03021013001",
            "name": "ថុង គឹមហេង"
        },
        {
            "barcode": "171106863",
            "dpc": "03021013101",
            "name": "សៅ សុខន"
        },
        {
            "barcode": "171106864",
            "dpc": "03021013201",
            "name": "ទុយ ផា"
        },
        {
            "barcode": "171106865",
            "dpc": "03021013401",
            "name": "អ៊ុក មុនី"
        },
        {
            "barcode": "171106866",
            "dpc": "03021013601",
            "name": "ឆាយ ស៊ីណា"
        },
        {
            "barcode": "171106867",
            "dpc": "03021013701",
            "name": "ពេជ្រ ឡា"
        },
        {
            "barcode": "171106868",
            "dpc": "03021013801",
            "name": "យ៉ង ធី"
        },
        {
            "barcode": "171106869",
            "dpc": "03021013901",
            "name": "ជឹម គឹមសៀង"
        },
        {
            "barcode": "171106870",
            "dpc": "03021014001",
            "name": "ម៉ក់ សុថេប"
        },
        {
            "barcode": "171106871",
            "dpc": "03021014101",
            "name": "ឃួន វ៉ិច"
        },
        {
            "barcode": "171106872",
            "dpc": "03021014201",
            "name": "ហួត  ហ៊ន"
        },
        {
            "barcode": "171106873",
            "dpc": "03021014301",
            "name": "ស្រី ហ៊ុច"
        },
        {
            "barcode": "171106874",
            "dpc": "03021014401",
            "name": "ស៊ឹម សុវណ្ណ"
        },
        {
            "barcode": "171106875",
            "dpc": "03021014501",
            "name": "រឿប សាមឿត"
        },
        {
            "barcode": "171106876",
            "dpc": "03021014601",
            "name": "ឡុង ចន្ថា"
        },
        {
            "barcode": "171106877",
            "dpc": "03021014701",
            "name": "ហាំង យូរ"
        },
        {
            "barcode": "171106878",
            "dpc": "03021014801",
            "name": "ស្រី សាម៉េត"
        },
        {
            "barcode": "171106879",
            "dpc": "03021014901",
            "name": "សាវ រ៉ន"
        },
        {
            "barcode": "171106880",
            "dpc": "03021015001",
            "name": "គង់ សាន"
        },
        {
            "barcode": "171106881",
            "dpc": "03021015101",
            "name": "គុជ លី"
        },
        {
            "barcode": "171106882",
            "dpc": "03021015201",
            "name": "ឡាយ កុសល់"
        },
        {
            "barcode": "171106883",
            "dpc": "03021015301",
            "name": "ម៉ែន សូរ"
        },
        {
            "barcode": "171106884",
            "dpc": "03021015401",
            "name": "សាន់ សាម៉ន"
        },
        {
            "barcode": "171106885",
            "dpc": "03021015501",
            "name": "នូវ  កៀវ"
        },
        {
            "barcode": "171106886",
            "dpc": "03021015601",
            "name": "សេង ហុង"
        },
        {
            "barcode": "171106887",
            "dpc": "03021015701",
            "name": "ខាត់ សារ៉េត"
        },
        {
            "barcode": "171106888",
            "dpc": "03021015801",
            "name": "ឡេង វាសនា"
        },
        {
            "barcode": "171106889",
            "dpc": "03021015901",
            "name": "តាន់ អេង"
        },
        {
            "barcode": "171106890",
            "dpc": "03021016001",
            "name": "សេង ណាវី"
        },
        {
            "barcode": "171106891",
            "dpc": "03021016101",
            "name": "គង់ ពៅ"
        },
        {
            "barcode": "171106892",
            "dpc": "03021016301",
            "name": "មាស វ៉ាន់ណន"
        },
        {
            "barcode": "171106893",
            "dpc": "03021016401",
            "name": "ទូច គឹមហេង"
        },
        {
            "barcode": "171106894",
            "dpc": "03021016601",
            "name": "យឹម ឡៃ"
        },
        {
            "barcode": "171106895",
            "dpc": "03021016701",
            "name": "យឹម ភ័ណ្ឌ"
        },
        {
            "barcode": "171106896",
            "dpc": "03021016801",
            "name": "ជ័យ ភី"
        },
        {
            "barcode": "171106897",
            "dpc": "03021016901",
            "name": "ផេង ភើយ"
        },
        {
            "barcode": "171106898",
            "dpc": "03021017001",
            "name": "ឡោ ហៀង"
        },
        {
            "barcode": "171106899",
            "dpc": "03021035001",
            "name": "ផល   មី"
        },
        {
            "barcode": "171106900",
            "dpc": "03021035301",
            "name": "ងិន   សួម"
        },
        {
            "barcode": "171106901",
            "dpc": "03021043901",
            "name": "ប៊ុន  ស្រីម៉ៅ"
        },
        {
            "barcode": "171106902",
            "dpc": "03021044601",
            "name": "ហ៊ិន  វ៉ាន់"
        },
        {
            "barcode": "171106903",
            "dpc": "03021044701",
            "name": "ចៅ  សម្បត្តិ"
        },
        {
            "barcode": "171106904",
            "dpc": "03021044801",
            "name": "ជុំ  រោយ"
        }
    ]
   barcodes.forEach(function(bar){
     let customer=db.wb_customer.findOne({dpc:bar.dpc});
   db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
   });