
let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=
    [
        {
            "barcode": "171102124",
            "dpc": "03031305801",
            "name": "សាន សុផល"
        },
        {
            "barcode": "171102125",
            "dpc": "03031305901",
            "name": "សុខ រ៉ុង"
        },
        {
            "barcode": "171102126",
            "dpc": "03031306001",
            "name": "ឡាំ ធៀន ១"
        },
        {
            "barcode": "171102127",
            "dpc": "03031306101",
            "name": "ឡាំ ធៀន ២"
        },
        {
            "barcode": "171102128",
            "dpc": "03031306201",
            "name": "អៀង សុគន្ធ"
        },
        {
            "barcode": "171102129",
            "dpc": "03031306401",
            "name": "ម៉េង អ៊ីវ"
        },
        {
            "barcode": "171102130",
            "dpc": "03031306501",
            "name": "កុលាប កណិកា"
        },
        {
            "barcode": "171102131",
            "dpc": "03031306601",
            "name": "ហួត ទុយ"
        },
        {
            "barcode": "171102132",
            "dpc": "03031306701",
            "name": "គង់ ឌី"
        },
        {
            "barcode": "171102133",
            "dpc": "03031306801",
            "name": "សោម សារិទ្ធ"
        },
        {
            "barcode": "171102134",
            "dpc": "03031306901",
            "name": "ដាញ់ ធឹង"
        },
        {
            "barcode": "171102135",
            "dpc": "03031307001",
            "name": "សោម សុន"
        },
        {
            "barcode": "171102136",
            "dpc": "03031307101",
            "name": "អ៊ុក ម៉ៅ"
        },
        {
            "barcode": "171102137",
            "dpc": "03031307201",
            "name": "សិច ផល្លី"
        },
        {
            "barcode": "171102138",
            "dpc": "03031307301",
            "name": "គឹម រ៉ា"
        },
        {
            "barcode": "171102139",
            "dpc": "03031307401",
            "name": "ឈុន ហេង"
        },
        {
            "barcode": "171102140",
            "dpc": "03031307501",
            "name": "ហ៊ិន ចំរើន"
        },
        {
            "barcode": "171102141",
            "dpc": "03031307601",
            "name": "ងិន យីម"
        },
        {
            "barcode": "171102142",
            "dpc": "03031307701",
            "name": "យក់ អឿ"
        },
        {
            "barcode": "171102143",
            "dpc": "03031307801",
            "name": "អ៊ុច សុន"
        },
        {
            "barcode": "171102144",
            "dpc": "03031307901",
            "name": "ហ៊ាង ម៉េង"
        },
        {
            "barcode": "171102145",
            "dpc": "03031308001",
            "name": "សាន សុផល"
        },
        {
            "barcode": "171102146",
            "dpc": "03031308101",
            "name": "ចៅ កី"
        },
        {
            "barcode": "171102147",
            "dpc": "03031308201",
            "name": "សោ ភីនី"
        },
        {
            "barcode": "171102148",
            "dpc": "03031308301",
            "name": "ម៉េង វណ្ណារី"
        },
        {
            "barcode": "171102149",
            "dpc": "03031308401",
            "name": "ហេង ប៊ន"
        },
        {
            "barcode": "171102150",
            "dpc": "03031308501",
            "name": "តាំង ជុងខេង"
        },
        {
            "barcode": "171102151",
            "dpc": "03031308601",
            "name": "នង ស៊ុំ"
        },
        {
            "barcode": "171102152",
            "dpc": "03031308701",
            "name": "ធួន សាយ"
        },
        {
            "barcode": "171102153",
            "dpc": "03031308801",
            "name": "ណាំ ផេង"
        },
        {
            "barcode": "171102154",
            "dpc": "03031308901",
            "name": "លេង សាវុធ"
        },
        {
            "barcode": "171102155",
            "dpc": "03031309001",
            "name": "ឆាយ សារ៉េត"
        },
        {
            "barcode": "171102156",
            "dpc": "03031309101",
            "name": "ហុង ជ្រិន"
        },
        {
            "barcode": "171102157",
            "dpc": "03031309201",
            "name": "តែ ម៉ូវិធូន"
        },
        {
            "barcode": "171102158",
            "dpc": "03031309301",
            "name": "អៀង ហ៊ាង"
        },
        {
            "barcode": "171102159",
            "dpc": "03031309401",
            "name": "គឹម សឹង"
        },
        {
            "barcode": "171102160",
            "dpc": "03031309501",
            "name": "ជា សុផល"
        },
        {
            "barcode": "171102161",
            "dpc": "03031309601",
            "name": "ឈួន ហុង"
        },
        {
            "barcode": "171102162",
            "dpc": "03031309701",
            "name": "ជីវ ជា"
        },
        {
            "barcode": "171102163",
            "dpc": "03031309801",
            "name": "ហេង ជុង"
        },
        {
            "barcode": "171102164",
            "dpc": "03031309901",
            "name": "ឡៅ ឆាយទ្រី ១"
        },
        {
            "barcode": "171102165",
            "dpc": "03031310001",
            "name": "ឡៅ ឆាយទ្រី ២"
        },
        {
            "barcode": "171102166",
            "dpc": "03031310101",
            "name": "ចាន់ ទី"
        },
        {
            "barcode": "171102167",
            "dpc": "03031310201",
            "name": "ជី សារ៉េត"
        },
        {
            "barcode": "171102168",
            "dpc": "03031310301",
            "name": "វឹង ឡុង"
        },
        {
            "barcode": "171102169",
            "dpc": "03031310401",
            "name": "ម៉ុន មីកា"
        },
        {
            "barcode": "171102170",
            "dpc": "03031310501",
            "name": "ហួន ហ៊ន"
        },
        {
            "barcode": "171102171",
            "dpc": "03031310601",
            "name": "អ៊ឹង ងួន"
        },
        {
            "barcode": "171102172",
            "dpc": "03031310701",
            "name": "រី រឿន"
        },
        {
            "barcode": "171102173",
            "dpc": "03031310801",
            "name": "គង់ វុត្ថា"
        },
        {
            "barcode": "171102174",
            "dpc": "03031310901",
            "name": "ស៊ិក សុរ័ត្នន៍"
        },
        {
            "barcode": "171102175",
            "dpc": "03031311001",
            "name": "ជាប លាង"
        },
        {
            "barcode": "171102176",
            "dpc": "03031311101",
            "name": "យូ គឹមជូ"
        },
        {
            "barcode": "171102177",
            "dpc": "03031311201",
            "name": "ចាន់ គឹមហ៊ាង"
        },
        {
            "barcode": "171102178",
            "dpc": "03031311301",
            "name": "យ៉ម ចំរើន"
        },
        {
            "barcode": "171102179",
            "dpc": "03031311401",
            "name": "ម៉ម ម៉ាច"
        },
        {
            "barcode": "171102180",
            "dpc": "03031311501",
            "name": "គឹម ឡេង"
        },
        {
            "barcode": "171102181",
            "dpc": "03031311601",
            "name": "ជា ពិសិដ្ឋ"
        },
        {
            "barcode": "171102182",
            "dpc": "03031311701",
            "name": "ម៉ង់ ស្វាយគីរី"
        },
        {
            "barcode": "171102183",
            "dpc": "03031311801",
            "name": "គី គឹមហឿង ១"
        },
        {
            "barcode": "171102184",
            "dpc": "03031311901",
            "name": "គី គឹមហឿង ២"
        },
        {
            "barcode": "171102185",
            "dpc": "03031300101",
            "name": "ភូ ស៊ន់"
        },
        {
            "barcode": "171102186",
            "dpc": "03031300201",
            "name": "ឡុង សុខា"
        },
        {
            "barcode": "171102187",
            "dpc": "03031300301",
            "name": "ស៊ឹម វណ្ណៈ"
        },
        {
            "barcode": "171102188",
            "dpc": "03031300501",
            "name": "ពៅ ជ្រុន"
        },
        {
            "barcode": "171102189",
            "dpc": "03031300601",
            "name": "ជា ផេង"
        },
        {
            "barcode": "171102190",
            "dpc": "03031300701",
            "name": "លី ឡាង"
        },
        {
            "barcode": "171102191",
            "dpc": "03031300801",
            "name": "នូ សុខុន"
        },
        {
            "barcode": "171102192",
            "dpc": "03031301201",
            "name": "នក់ ហ្វួយ"
        },
        {
            "barcode": "171102193",
            "dpc": "03031300901",
            "name": "នង ប៊ុនធឿន"
        },
        {
            "barcode": "171102194",
            "dpc": "03031301001",
            "name": "អ៊ូច សុផៃ"
        },
        {
            "barcode": "171102195",
            "dpc": "03031301101",
            "name": "សូ ប៉ូឃន"
        },
        {
            "barcode": "171102196",
            "dpc": "03031301401",
            "name": "កែវ កាមីន"
        },
        {
            "barcode": "171102197",
            "dpc": "03031301501",
            "name": "គី ងួន"
        },
        {
            "barcode": "171102198",
            "dpc": "03031301601",
            "name": "តែ ម៉េងសួរ"
        },
        {
            "barcode": "171102199",
            "dpc": "03031301701",
            "name": "ភូ ប៉ូយ"
        },
        {
            "barcode": "171102200",
            "dpc": "03031301801",
            "name": "តាន់ កុសល"
        },
        {
            "barcode": "171102201",
            "dpc": "03031301901",
            "name": "ហេង យ៉ាត"
        },
        {
            "barcode": "171102202",
            "dpc": "03031302001",
            "name": "តាំង លីងួន"
        },
        {
            "barcode": "171102203",
            "dpc": "03031302101",
            "name": "កែវ នីម"
        },
        {
            "barcode": "171102204",
            "dpc": "03031302201",
            "name": "ពេជ្រ អៀម"
        },
        {
            "barcode": "171102205",
            "dpc": "03031302301",
            "name": "យូ សាង"
        },
        {
            "barcode": "171102206",
            "dpc": "03031302401",
            "name": "លាវ សុខម៉េង"
        },
        {
            "barcode": "171102207",
            "dpc": "03031302501",
            "name": "ចៅ កាំឈិញ"
        },
        {
            "barcode": "171102208",
            "dpc": "03031302601",
            "name": "នី ចំរើន"
        },
        {
            "barcode": "171102209",
            "dpc": "03031302701",
            "name": "ហ៊ុន វិបុល"
        },
        {
            "barcode": "171102210",
            "dpc": "03031302801",
            "name": "ខៀវ ចៃ"
        },
        {
            "barcode": "171102211",
            "dpc": "03031302901",
            "name": "លី ម៉េង"
        },
        {
            "barcode": "171102212",
            "dpc": "03031303001",
            "name": "អោម ផេង"
        },
        {
            "barcode": "171102213",
            "dpc": "03031303101",
            "name": "លក់ គ្រី"
        },
        {
            "barcode": "171102214",
            "dpc": "03031303201",
            "name": "តាំង ឈុន"
        },
        {
            "barcode": "171102215",
            "dpc": "03031303301",
            "name": "ម៉ក់ ហុង"
        },
        {
            "barcode": "171102216",
            "dpc": "03031303401",
            "name": "សៅ សោន"
        },
        {
            "barcode": "171102217",
            "dpc": "03031303501",
            "name": "ព្រំ ឡាក់"
        },
        {
            "barcode": "171102218",
            "dpc": "03031303801",
            "name": "ឡុច តង"
        },
        {
            "barcode": "171102219",
            "dpc": "03031303901",
            "name": "គឹម វ៉ាន់"
        },
        {
            "barcode": "171102220",
            "dpc": "03031304001",
            "name": "ខ្ចៅ ទូច"
        },
        {
            "barcode": "171102221",
            "dpc": "03031304101",
            "name": "ជឹម ជឿន"
        },
        {
            "barcode": "171102222",
            "dpc": "03031304201",
            "name": "យ៉ាន់ សារឿន"
        },
        {
            "barcode": "171102223",
            "dpc": "03031304301",
            "name": "អ៊ឹម យិន"
        },
        {
            "barcode": "171102224",
            "dpc": "03031304401",
            "name": "ដួង លី"
        },
        {
            "barcode": "171102225",
            "dpc": "03031304501",
            "name": "ទីម យេត"
        },
        {
            "barcode": "171102226",
            "dpc": "03031304601",
            "name": "ឈឹម សួរ"
        },
        {
            "barcode": "171102227",
            "dpc": "03031304701",
            "name": "សេង សុន"
        },
        {
            "barcode": "171102228",
            "dpc": "03031304801",
            "name": "សាន់ ហាក់"
        },
        {
            "barcode": "171102229",
            "dpc": "03031304901",
            "name": "គង់ កុសល"
        },
        {
            "barcode": "171102230",
            "dpc": "03031305001",
            "name": "ពុន សែ"
        },
        {
            "barcode": "171102231",
            "dpc": "03031305201",
            "name": "សាន ផល្លីន"
        },
        {
            "barcode": "171102232",
            "dpc": "03031305301",
            "name": "គឹម អេង"
        },
        {
            "barcode": "171102233",
            "dpc": "03031305501",
            "name": "ឡុង ខេន"
        },
        {
            "barcode": "171102234",
            "dpc": "03031305601",
            "name": "សក់ ចន្ទ្រាវុធ"
        },
        {
            "barcode": "171102235",
            "dpc": "03031305701",
            "name": "តូច  សារិន"
        },
        {
            "barcode": "171102236",
            "dpc": "03031326201",
            "name": "ទេព  បេងសួរ"
        },
        {
            "barcode": "171102237",
            "dpc": "03031326001",
            "name": "ម៉េង  លាង"
        },
        {
            "barcode": "171102238",
            "dpc": "03031325901",
            "name": "អ៊ុយ  គង់"
        },
        {
            "barcode": "171102239",
            "dpc": "03031325801",
            "name": "តាន់  សាន់"
        },
        {
            "barcode": "171102240",
            "dpc": "03031325701",
            "name": "យស់  បាន"
        },
        {
            "barcode": "171102241",
            "dpc": "03031325601",
            "name": "អ៊ុយ  ជុំ"
        },
        {
            "barcode": "171102242",
            "dpc": "03031325501",
            "name": "អ៊ឹម  កោវិត"
        },
        {
            "barcode": "171102243",
            "dpc": "03031325401",
            "name": "អួង  ខេង"
        },
        {
            "barcode": "171102244",
            "dpc": "03031325301",
            "name": "ហុក  ឈួន"
        },
        {
            "barcode": "171102245",
            "dpc": "03031325201",
            "name": "កែវ  ប៉ក់"
        },
        {
            "barcode": "171102246",
            "dpc": "03031325101",
            "name": "អេង  ង៉ោ"
        },
        {
            "barcode": "171102247",
            "dpc": "03031325001",
            "name": "នូ  ហានី"
        },
        {
            "barcode": "171102248",
            "dpc": "03031324901",
            "name": "ឆាយ  ទូច"
        },
        {
            "barcode": "171102249",
            "dpc": "03031324801",
            "name": "ឆា  ស៊ីសុវត្ថា"
        },
        {
            "barcode": "171102250",
            "dpc": "03031324701",
            "name": "ស៊ុន   ប៊ុនឡេង"
        },
        {
            "barcode": "171102251",
            "dpc": "03031324601",
            "name": "ឡោ  សារឹម"
        },
        {
            "barcode": "171102252",
            "dpc": "03031330901",
            "name": "សោ  គឹមកូយ"
        },
        {
            "barcode": "171102253",
            "dpc": "03031330801",
            "name": "ហ៊ុល  សុមុន្នី"
        },
        {
            "barcode": "171102254",
            "dpc": "03031330701",
            "name": "មាស  ប៊ុនថេន"
        },
        {
            "barcode": "171102255",
            "dpc": "03031330601",
            "name": "ហា  សេង"
        },
        {
            "barcode": "171102256",
            "dpc": "03031330401",
            "name": "លី  គឹមលាង"
        },
        {
            "barcode": "171102257",
            "dpc": "03031330301",
            "name": "ធម្ម  សុផា"
        },
        {
            "barcode": "171102258",
            "dpc": "03031330201",
            "name": "ឡុង  គឹមតេង"
        },
        {
            "barcode": "171102259",
            "dpc": "03031330101",
            "name": "ម៉ឺន  យ៉ាន"
        },
        {
            "barcode": "171102260",
            "dpc": "03031330001",
            "name": "ថោង  ប៊ុនធឿន"
        },
        {
            "barcode": "171102261",
            "dpc": "03031329901",
            "name": "ឌិត  យ៉ាន់"
        },
        {
            "barcode": "171102262",
            "dpc": "03031329801",
            "name": "អ៊ុង  នុត"
        },
        {
            "barcode": "171102263",
            "dpc": "03031329701",
            "name": "អ៊ឹម  នាង"
        },
        {
            "barcode": "171102264",
            "dpc": "03031329601",
            "name": "មាស  លី"
        },
        {
            "barcode": "171102265",
            "dpc": "03031329501",
            "name": "ទេព  ណាត្យ"
        },
        {
            "barcode": "171102266",
            "dpc": "03031329401",
            "name": "លឹម  គឹមភាព"
        },
        {
            "barcode": "171102267",
            "dpc": "03031323901",
            "name": "ជា  ហេង"
        },
        {
            "barcode": "171102268",
            "dpc": "03031329001",
            "name": "តេង  ច័ន្ទថុល"
        },
        {
            "barcode": "171102269",
            "dpc": "03031326501",
            "name": "ព្រឹម  សាលី"
        },
        {
            "barcode": "171102270",
            "dpc": "03031346601",
            "name": "ពិន  ប៊ុនហ៊ត"
        },
        {
            "barcode": "171102271",
            "dpc": "03031346701",
            "name": "ឈាង  គី"
        },
        {
            "barcode": "171102272",
            "dpc": "03031346801",
            "name": "អួង   សន"
        },
        {
            "barcode": "171102273",
            "dpc": "03031346901",
            "name": "កែវ  មនោ"
        },
        {
            "barcode": "171102274",
            "dpc": "03031347001",
            "name": "តោ  ពិសិដ្ឋ"
        },
        {
            "barcode": "171102275",
            "dpc": "03031347101",
            "name": "កៅ  សុខន"
        },
        {
            "barcode": "171102276",
            "dpc": "03031347201",
            "name": "វិហារអ្នកតាចិន"
        },
        {
            "barcode": "171102277",
            "dpc": "03031347301",
            "name": "ម៉ៃ  ហ៊ាង"
        },
        {
            "barcode": "171102278",
            "dpc": "03031347401",
            "name": "យឹម  ហ៊ីង"
        },
        {
            "barcode": "171102279",
            "dpc": "03031347501",
            "name": "សុខ  គៀត"
        },
        {
            "barcode": "171102280",
            "dpc": "03031347601",
            "name": "ហ៊ីម  ស៊ីស"
        },
        {
            "barcode": "171102281",
            "dpc": "03031347701",
            "name": "ធឹក  សាធឿន"
        },
        {
            "barcode": "171102282",
            "dpc": "03031347801",
            "name": "ជូ  គឹមរិន"
        },
        {
            "barcode": "171102283",
            "dpc": "03031347901",
            "name": "ឈុន  ស្រេង"
        },
        {
            "barcode": "171102284",
            "dpc": "03031344101",
            "name": "ឈឿម  សុវណ្ណ"
        },
        {
            "barcode": "171102285",
            "dpc": "03031344301",
            "name": "អុំ   លឿម"
        },
        {
            "barcode": "171102286",
            "dpc": "03031344601",
            "name": "យឺន  ម៉ិ"
        },
        {
            "barcode": "171102287",
            "dpc": "03031344701",
            "name": "ម៉ៃ  ហ៊ាង"
        },
        {
            "barcode": "171102288",
            "dpc": "03031344801",
            "name": "តោ  ហួត"
        },
        {
            "barcode": "171102289",
            "dpc": "03031344901",
            "name": "អេង  ចាន់ម៉ាន់"
        },
        {
            "barcode": "171102290",
            "dpc": "03031345001",
            "name": "តោ  ភិសិដ្ឋ"
        },
        {
            "barcode": "171102291",
            "dpc": "03031345101",
            "name": "យូ  គង់"
        },
        {
            "barcode": "171102292",
            "dpc": "03031345301",
            "name": "អ៊ិត  តាន់"
        },
        {
            "barcode": "171102293",
            "dpc": "03031345401",
            "name": "សុខ  ជា"
        },
        {
            "barcode": "171102294",
            "dpc": "03031345501",
            "name": "ហ៊ឹម  សារ៉េត"
        },
        {
            "barcode": "171102295",
            "dpc": "03031345601",
            "name": "ស៊ុត  ថាយ"
        },
        {
            "barcode": "171102296",
            "dpc": "03031345801",
            "name": "នូ  នេតត្រា"
        },
        {
            "barcode": "171102297",
            "dpc": "03031345901",
            "name": "យី  សារ៉ូ"
        },
        {
            "barcode": "171102298",
            "dpc": "03031346001",
            "name": "ជូង  ពីង"
        },
        {
            "barcode": "171102299",
            "dpc": "03031346101",
            "name": "ចាន់  បឿម"
        },
        {
            "barcode": "171102300",
            "dpc": "03031346201",
            "name": "ម៉េង  លាង"
        },
        {
            "barcode": "171102301",
            "dpc": "03031346301",
            "name": "សុខ  អេង"
        },
        {
            "barcode": "171102302",
            "dpc": "03031346401",
            "name": "ពន់  ឃីម"
        },
        {
            "barcode": "171102303",
            "dpc": "03031346501",
            "name": "កែវ  វីរៈ"
        },
        {
            "barcode": "171102304",
            "dpc": "03031326701",
            "name": "សុច  សារុំ"
        },
        {
            "barcode": "171102305",
            "dpc": "03031326801",
            "name": "អួង  ខេង"
        },
        {
            "barcode": "171102306",
            "dpc": "03031326901",
            "name": "សោម  សាឃឿង"
        },
        {
            "barcode": "171102307",
            "dpc": "03031327001",
            "name": "លេង  ហួរ"
        },
        {
            "barcode": "171102308",
            "dpc": "03031327101",
            "name": "មាស  សុវណ្ណ"
        },
        {
            "barcode": "171102309",
            "dpc": "03031327201",
            "name": "សុខ ធី"
        },
        {
            "barcode": "171102310",
            "dpc": "03031327301",
            "name": "សុខ  ធា"
        },
        {
            "barcode": "171102311",
            "dpc": "03031327401",
            "name": "សឹង  ជឺ"
        },
        {
            "barcode": "171102312",
            "dpc": "03031327501",
            "name": "ហេង  លាង"
        },
        {
            "barcode": "171102313",
            "dpc": "03031327601",
            "name": "ព្រឹម   សាលី"
        },
        {
            "barcode": "171102314",
            "dpc": "03031327701",
            "name": "ម៉េង  វុទ្ធា"
        },
        {
            "barcode": "171102315",
            "dpc": "03031328001",
            "name": "ជុក  គឹមហាប់"
        },
        {
            "barcode": "171102316",
            "dpc": "03031328101",
            "name": "ឈឺន  លឿប"
        },
        {
            "barcode": "171102317",
            "dpc": "03031328301",
            "name": "សេង  ផូ"
        },
        {
            "barcode": "171102318",
            "dpc": "03031328401",
            "name": "អួល  រ័ត្ន"
        },
        {
            "barcode": "171102319",
            "dpc": "03031328501",
            "name": "សាត  សុធាន"
        },
        {
            "barcode": "171102320",
            "dpc": "03031328601",
            "name": "ចាន់  ថា"
        },
        {
            "barcode": "171102321",
            "dpc": "03031328701",
            "name": "ស៊ឹម  វ៉ាត់"
        },
        {
            "barcode": "171102322",
            "dpc": "03031328801",
            "name": "ដួង  កក់"
        },
        {
            "barcode": "171102323",
            "dpc": "03031328901",
            "name": "វណ្ណ  សុមាលី"
        },
        {
            "barcode": "171102324",
            "dpc": "03031312601",
            "name": "តេង  ប៊ុនរ័ត្ន"
        },
        {
            "barcode": "171102325",
            "dpc": "03031312701",
            "name": "ណៃ  ស៊្រុន"
        },
        {
            "barcode": "171102326",
            "dpc": "03031312801",
            "name": "ហេង  សុខា"
        },
        {
            "barcode": "171102327",
            "dpc": "03031312901",
            "name": "ហេង  លីម"
        },
        {
            "barcode": "171102328",
            "dpc": "03031313001",
            "name": "អឿន  សំអាត"
        },
        {
            "barcode": "171102329",
            "dpc": "03031313101",
            "name": "សៅ  ទី"
        },
        {
            "barcode": "171102330",
            "dpc": "03031313201",
            "name": "ស្វាយ សុឃីម"
        },
        {
            "barcode": "171102331",
            "dpc": "03031313301",
            "name": "តាន់  តេង"
        },
        {
            "barcode": "171102332",
            "dpc": "03031313401",
            "name": "ជូ  គង់"
        },
        {
            "barcode": "171102333",
            "dpc": "03031313501",
            "name": "ឈួន  សារ៉ាត់"
        },
        {
            "barcode": "171102334",
            "dpc": "03031313601",
            "name": "អ៊ី  ចាន់នឿន"
        },
        {
            "barcode": "171102335",
            "dpc": "03031313701",
            "name": "អ៊ុយ  គង់"
        },
        {
            "barcode": "171102336",
            "dpc": "03031313801",
            "name": "សេង  ហ៊ួរ ២"
        },
        {
            "barcode": "171102337",
            "dpc": "03031313901",
            "name": "កែវ  សុខជា"
        },
        {
            "barcode": "171102338",
            "dpc": "03031314001",
            "name": "ប៊ី សួ"
        },
        {
            "barcode": "171102339",
            "dpc": "03031314101",
            "name": "ប៉ាល់  រ៉យ"
        },
        {
            "barcode": "171102340",
            "dpc": "03031314201",
            "name": "សេង  ហួរ"
        },
        {
            "barcode": "171102341",
            "dpc": "03031314301",
            "name": "គឹម  សារឿន"
        },
        {
            "barcode": "171102342",
            "dpc": "03031314401",
            "name": "អឿ  សៀង"
        },
        {
            "barcode": "171102343",
            "dpc": "03031314501",
            "name": "គា  ហេង"
        },
        {
            "barcode": "171102344",
            "dpc": "03031314601",
            "name": "ប៉ោ  ស៊ីណា"
        },
        {
            "barcode": "171102345",
            "dpc": "03031314701",
            "name": "ង៉ែត  គី"
        },
        {
            "barcode": "171102346",
            "dpc": "03031314901",
            "name": "លឹម  ដារ៉ា"
        },
        {
            "barcode": "171102347",
            "dpc": "03031315001",
            "name": "មុំ   ហ៊ាង"
        },
        {
            "barcode": "171102348",
            "dpc": "03031315101",
            "name": "ទី  សាន"
        },
        {
            "barcode": "171102349",
            "dpc": "03031315201",
            "name": "ប៉ុញ  ឧត្តម"
        },
        {
            "barcode": "171102350",
            "dpc": "03031315301",
            "name": "ភួយ  លាងចេង"
        },
        {
            "barcode": "171102351",
            "dpc": "03031315401",
            "name": "គុជ  ជរ"
        },
        {
            "barcode": "171102352",
            "dpc": "03031315501",
            "name": "ឈឹម  សុវណ្ណ"
        },
        {
            "barcode": "171102353",
            "dpc": "03031315601",
            "name": "ភឿក  រ៉ានី"
        },
        {
            "barcode": "171102354",
            "dpc": "03031315701",
            "name": "ឈួន  សុផល"
        },
        {
            "barcode": "171102355",
            "dpc": "03031315801",
            "name": "សុខ  ពុធ"
        },
        {
            "barcode": "171102356",
            "dpc": "03031315901",
            "name": "អៀង  ស៊ីណា"
        },
        {
            "barcode": "171102357",
            "dpc": "03031316001",
            "name": "អៀង  សុភាព"
        },
        {
            "barcode": "171102358",
            "dpc": "03031316101",
            "name": "ឆាយ  រ៉ង"
        },
        {
            "barcode": "171102359",
            "dpc": "03031316201",
            "name": "ណាម  កេតរ៉ា"
        },
        {
            "barcode": "171102360",
            "dpc": "03031316301",
            "name": "ថុត  ប៊ុនឈិន"
        },
        {
            "barcode": "171102361",
            "dpc": "03031316401",
            "name": "លឹម  ចាន់ថន"
        },
        {
            "barcode": "171102362",
            "dpc": "03031316501",
            "name": "ហឿង  ឈុន"
        },
        {
            "barcode": "171102363",
            "dpc": "03031316601",
            "name": "ភួង  ចំរើន"
        },
        {
            "barcode": "171102364",
            "dpc": "03031316701",
            "name": "ងួន  ឆាយ"
        },
        {
            "barcode": "171102365",
            "dpc": "03031316801",
            "name": "កៅ  ហួរ"
        },
        {
            "barcode": "171102366",
            "dpc": "03031316901",
            "name": "អ៊ុយ  លីវ"
        },
        {
            "barcode": "171102367",
            "dpc": "03031317101",
            "name": "ប៊ូ  កិត្យា"
        },
        {
            "barcode": "171102368",
            "dpc": "03031317201",
            "name": "យូ  ទីនី"
        },
        {
            "barcode": "171102369",
            "dpc": "03031317301",
            "name": "ញឹម  ម៉ែន"
        },
        {
            "barcode": "171102370",
            "dpc": "03031317501",
            "name": "ង៉ា  ឃីម"
        },
        {
            "barcode": "171102371",
            "dpc": "03031317601",
            "name": "អួង  ម៉ានី ១"
        },
        {
            "barcode": "171102372",
            "dpc": "03031317701",
            "name": "សេង  រតនៈ"
        },
        {
            "barcode": "171102373",
            "dpc": "03031317801",
            "name": "សែម សុខា"
        },
        {
            "barcode": "171102374",
            "dpc": "03031317901",
            "name": "ម៉ៅ  រ័ត្នមុនី"
        },
        {
            "barcode": "171102375",
            "dpc": "03031318001",
            "name": "លាស់   ថេត"
        },
        {
            "barcode": "171102376",
            "dpc": "03031318101",
            "name": "ចាន់  ដាវឹង"
        },
        {
            "barcode": "171102377",
            "dpc": "03031318201",
            "name": "ផាត់  សុខលាង ១"
        },
        {
            "barcode": "171102378",
            "dpc": "03031318301",
            "name": "ផាត់  សុខលាង​​ ២"
        },
        {
            "barcode": "171102379",
            "dpc": "03031318401",
            "name": "ហ៊ាង  នូ"
        },
        {
            "barcode": "171102380",
            "dpc": "03031318501",
            "name": "ហឿង  ណៃឈុន"
        },
        {
            "barcode": "171102381",
            "dpc": "03031318601",
            "name": "អឿ  គឹមហឿង"
        },
        {
            "barcode": "171102382",
            "dpc": "03031318701",
            "name": "យឹម  សំបូ"
        },
        {
            "barcode": "171102383",
            "dpc": "03031318901",
            "name": "រស់  សុផាត"
        },
        {
            "barcode": "171102384",
            "dpc": "03031319001",
            "name": "ហេង  លីម"
        },
        {
            "barcode": "171102385",
            "dpc": "03031312401",
            "name": "ឌួង  គឹមស៊ន"
        },
        {
            "barcode": "171102386",
            "dpc": "03031322801",
            "name": "អ៊ឹម  ឈួម"
        },
        {
            "barcode": "171102387",
            "dpc": "03031322701",
            "name": "ស  ស៊ីវន"
        },
        {
            "barcode": "171102388",
            "dpc": "03031322601",
            "name": "បួន  គឹមហាវ"
        },
        {
            "barcode": "171102389",
            "dpc": "03031322501",
            "name": "ជួន  ប៊ុនធុល"
        },
        {
            "barcode": "171102390",
            "dpc": "03031322401",
            "name": "គង់  សារិន"
        },
        {
            "barcode": "171102391",
            "dpc": "03031322301",
            "name": "លី  ជា"
        },
        {
            "barcode": "171102392",
            "dpc": "03031322201",
            "name": "សូ   សារុន"
        },
        {
            "barcode": "171102393",
            "dpc": "03031322101",
            "name": "បែន  ផន"
        },
        {
            "barcode": "171102394",
            "dpc": "03031322001",
            "name": "ឃឹម  សាមិត"
        },
        {
            "barcode": "171102395",
            "dpc": "03031321901",
            "name": "តន់  ប៊ុនរឿន"
        },
        {
            "barcode": "171102396",
            "dpc": "03031321801",
            "name": "នួន  តុន"
        },
        {
            "barcode": "171102397",
            "dpc": "03031321701",
            "name": "តាន់  អ៊ីវន"
        },
        {
            "barcode": "171102398",
            "dpc": "03031321601",
            "name": "លឹម  ឡាយ"
        },
        {
            "barcode": "171102399",
            "dpc": "03031321401",
            "name": "កៅ  អេង"
        },
        {
            "barcode": "171102400",
            "dpc": "03031321301",
            "name": "ហាក់  សោភ័ណ"
        },
        {
            "barcode": "171102401",
            "dpc": "03031321201",
            "name": "គង់  ឡេង"
        },
        {
            "barcode": "171102402",
            "dpc": "03031321101",
            "name": "លឹម  គឹមស៊ា"
        },
        {
            "barcode": "171102403",
            "dpc": "03031321001",
            "name": "វឿត  សុវណ្ណ"
        },
        {
            "barcode": "171102404",
            "dpc": "03031320901",
            "name": "អោម  សាវេត"
        },
        {
            "barcode": "171102405",
            "dpc": "03031320801",
            "name": "ប៉ាវ  ឈុនលីម"
        },
        {
            "barcode": "171102406",
            "dpc": "03031320601",
            "name": "ឡុង  គឹមឆេង"
        },
        {
            "barcode": "171102407",
            "dpc": "03031320401",
            "name": "លី  សោភ័ណ"
        },
        {
            "barcode": "171102408",
            "dpc": "03031320301",
            "name": "សៅ  ដារ៉ានិមិត្ត"
        },
        {
            "barcode": "171102409",
            "dpc": "03031320201",
            "name": "ឡៅ  ជាងគី"
        },
        {
            "barcode": "171102410",
            "dpc": "03031320101",
            "name": "សក់  មី"
        },
        {
            "barcode": "171102411",
            "dpc": "03031320001",
            "name": "ពិន  កុសល"
        },
        {
            "barcode": "171102412",
            "dpc": "03031319901",
            "name": "ដុះ  វណ្ណរស្មី"
        },
        {
            "barcode": "171102413",
            "dpc": "03031319801",
            "name": "នូ  សុខុម"
        },
        {
            "barcode": "171102414",
            "dpc": "03031324401",
            "name": "យ៉ាន  បូផៃ"
        },
        {
            "barcode": "171102415",
            "dpc": "03031324201",
            "name": "មាស  សាន"
        },
        {
            "barcode": "171102416",
            "dpc": "03031324101",
            "name": "ប៊ុត  គឹមស៊ាន"
        },
        {
            "barcode": "171102417",
            "dpc": "03031324001",
            "name": "ឡុង  សេង"
        },
        {
            "barcode": "171102418",
            "dpc": "03031323801",
            "name": "ចាន់  សេរីឆុង"
        },
        {
            "barcode": "171102419",
            "dpc": "03031323701",
            "name": "ហែម   គឹមហូ"
        },
        {
            "barcode": "171102420",
            "dpc": "03031323601",
            "name": "ជេ  រៀន"
        },
        {
            "barcode": "171102421",
            "dpc": "03031323501",
            "name": "ប៉េង  សុខឃីម"
        },
        {
            "barcode": "171102422",
            "dpc": "03031323401",
            "name": "ផូង  ឌិញ"
        },
        {
            "barcode": "171102423",
            "dpc": "03031323301",
            "name": "សោម   សំអុន"
        },
        {
            "barcode": "171102424",
            "dpc": "03031323201",
            "name": "អ៊ឹង  ឡា"
        },
        {
            "barcode": "171102425",
            "dpc": "03031323101",
            "name": "ទេន   ភឹម"
        },
        {
            "barcode": "171102426",
            "dpc": "03031323001",
            "name": "ស  ណារ៉យ"
        },
        {
            "barcode": "171102427",
            "dpc": "03031322901",
            "name": "ស្រី  អឿន"
        },
        {
            "barcode": "171102428",
            "dpc": "03031331601",
            "name": "ទៀង  ចិន្តា"
        },
        {
            "barcode": "171102429",
            "dpc": "03031331701",
            "name": "សួស  ឆេង"
        },
        {
            "barcode": "171102430",
            "dpc": "03031331801",
            "name": "ទេព  គឹមហេង"
        },
        {
            "barcode": "171102431",
            "dpc": "03031331901",
            "name": "ទុយ  វុត្ថា"
        },
        {
            "barcode": "171102432",
            "dpc": "03031332001",
            "name": "សុខ  ស៊ីវ"
        },
        {
            "barcode": "171102433",
            "dpc": "03031332101",
            "name": "មាស  ប៊ុនធឿន"
        },
        {
            "barcode": "171102434",
            "dpc": "03031332201",
            "name": "សេក  សំបូរ"
        },
        {
            "barcode": "171102435",
            "dpc": "03031332301",
            "name": "ប៉ាន់  សៀក"
        },
        {
            "barcode": "171102436",
            "dpc": "03031332401",
            "name": "យូ  ណារ៉ុង"
        },
        {
            "barcode": "171102437",
            "dpc": "03031332501",
            "name": "អ៊ុក  ចាយ"
        },
        {
            "barcode": "171102438",
            "dpc": "03031332601",
            "name": "ពុត  ជួប"
        },
        {
            "barcode": "171102439",
            "dpc": "03031332801",
            "name": "នី  សុភាព"
        },
        {
            "barcode": "171102440",
            "dpc": "03031332901",
            "name": "អៀង  ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171102441",
            "dpc": "03031333001",
            "name": "អ៊ិត ផល្លា"
        },
        {
            "barcode": "171102442",
            "dpc": "03031333101",
            "name": "ប៉ា    ហាក់"
        },
        {
            "barcode": "171102443",
            "dpc": "03031333201",
            "name": "នុយ  ចំរ៉ុង"
        },
        {
            "barcode": "171102444",
            "dpc": "03031333401",
            "name": "ចៅ  គឹមយ៉ាត"
        },
        {
            "barcode": "171102445",
            "dpc": "03031333501",
            "name": "សោ  គឹមហៀក"
        },
        {
            "barcode": "171102446",
            "dpc": "03031333601",
            "name": "ប្លុង  សាវឿន"
        },
        {
            "barcode": "171102447",
            "dpc": "03031333701",
            "name": "ជីវ  យ៉ា"
        },
        {
            "barcode": "171102448",
            "dpc": "03031333801",
            "name": "ភោគ  កិច្ច"
        },
        {
            "barcode": "171102449",
            "dpc": "03031333901",
            "name": "រុណ  រាសី"
        },
        {
            "barcode": "171102450",
            "dpc": "03031334001",
            "name": "ម៉ង់  សំអាល់"
        },
        {
            "barcode": "171102451",
            "dpc": "03031334101",
            "name": "រឿង  ណារ៉ុង"
        },
        {
            "barcode": "171102452",
            "dpc": "03031334201",
            "name": "សោ ថងឌី"
        },
        {
            "barcode": "171102453",
            "dpc": "03031334301",
            "name": "សុខ  សេង"
        },
        {
            "barcode": "171102454",
            "dpc": "03031334401",
            "name": "ស៊ិន  នឿប"
        },
        {
            "barcode": "171102455",
            "dpc": "03031334601",
            "name": "យ៉ែម  សាវឿត"
        },
        {
            "barcode": "171102456",
            "dpc": "03031331101",
            "name": "ម៉ា  គឹមជន"
        },
        {
            "barcode": "171102457",
            "dpc": "03031331001",
            "name": "យ៉ែម  សាវឿត"
        },
        {
            "barcode": "171102458",
            "dpc": "03031331501",
            "name": "ក្លិន  ឌី"
        },
        {
            "barcode": "171102459",
            "dpc": "03031331401",
            "name": "ថុង  មួយហុង"
        },
        {
            "barcode": "171102460",
            "dpc": "03031331301",
            "name": "សុខ  គឹមហាន"
        },
        {
            "barcode": "171102461",
            "dpc": "03031331201",
            "name": "ឡូ  ប៊ុនប៉ា"
        },
        {
            "barcode": "171102462",
            "dpc": "03031343801",
            "name": "ទុង  ភីរម្យ"
        },
        {
            "barcode": "171102463",
            "dpc": "03031343901",
            "name": "ឌុក  ឆាយ"
        },
        {
            "barcode": "171102464",
            "dpc": "03031344001",
            "name": "នង  គឹមស៊្រុន"
        },
        {
            "barcode": "171102465",
            "dpc": "03031343701",
            "name": "ទេព  សុវណ្ណ"
        },
        {
            "barcode": "171102466",
            "dpc": "03031343601",
            "name": "ប៊ូ   វុនណាវុឌ្ឍ"
        },
        {
            "barcode": "171102467",
            "dpc": "03031343501",
            "name": "ឌួង  ភក្តី"
        },
        {
            "barcode": "171102468",
            "dpc": "03031343401",
            "name": "ញាន   ផន"
        },
        {
            "barcode": "171102469",
            "dpc": "03031343301",
            "name": "យ៉ាន់  បូផៃ"
        },
        {
            "barcode": "171102470",
            "dpc": "03031343101",
            "name": "ម៉ម  ថងឌី"
        },
        {
            "barcode": "171102471",
            "dpc": "03031342901",
            "name": "រោ  សេងវី"
        },
        {
            "barcode": "171102472",
            "dpc": "03031342801",
            "name": "សុន  សុគន្ធវ៉ារី"
        },
        {
            "barcode": "171102473",
            "dpc": "03031342701",
            "name": "ទេព  គឹមហេង"
        },
        {
            "barcode": "171102474",
            "dpc": "03031342601",
            "name": "ឌុច   ចំរ៉ាត់"
        },
        {
            "barcode": "171102475",
            "dpc": "03031342501",
            "name": "ឈឹម  ឆន"
        },
        {
            "barcode": "171102476",
            "dpc": "03031342401",
            "name": "ឈុន  ឡាយ"
        },
        {
            "barcode": "171102477",
            "dpc": "03031342301",
            "name": "សេង  ម៉េង"
        },
        {
            "barcode": "171102478",
            "dpc": "03031342201",
            "name": "ទុយ   នៅ"
        },
        {
            "barcode": "171102479",
            "dpc": "03031342101",
            "name": "មាស   ម៉ៅ"
        },
        {
            "barcode": "171102480",
            "dpc": "03031339301",
            "name": "លុម សួន"
        },
        {
            "barcode": "171102481",
            "dpc": "03031339201",
            "name": "ឡឹក ហាយ"
        },
        {
            "barcode": "171102482",
            "dpc": "03031340001",
            "name": "នង មាសរិទ្ធ"
        },
        {
            "barcode": "171102483",
            "dpc": "03031341301",
            "name": "ប៉ុក សាហ៊ុំ"
        },
        {
            "barcode": "171102484",
            "dpc": "03031341201",
            "name": "សេង ចន្ថា"
        },
        {
            "barcode": "171102485",
            "dpc": "03031341101",
            "name": "សៅ សារុន"
        },
        {
            "barcode": "171102486",
            "dpc": "03031341001",
            "name": "អ៊ិន សុខា"
        },
        {
            "barcode": "171102487",
            "dpc": "03031340901",
            "name": "ហែម សែម"
        },
        {
            "barcode": "171102488",
            "dpc": "03031340801",
            "name": "រ័ត្ន សូរិយា"
        },
        {
            "barcode": "171102489",
            "dpc": "03031340601",
            "name": "ង៉ា ជួង"
        },
        {
            "barcode": "171102490",
            "dpc": "03031340501",
            "name": "ភឿក គឹមលី"
        },
        {
            "barcode": "171102491",
            "dpc": "03031340401",
            "name": "យាំ យ៉ាន់"
        },
        {
            "barcode": "171102492",
            "dpc": "03031340301",
            "name": "ភឹម ផល្លា"
        },
        {
            "barcode": "171102493",
            "dpc": "03031340201",
            "name": "អាន សេរីវុធ"
        },
        {
            "barcode": "171102494",
            "dpc": "03031340101",
            "name": "ប៉ុក ច័ន្ទបូរី"
        },
        {
            "barcode": "171102495",
            "dpc": "03031339901",
            "name": "សួស សាវុន"
        },
        {
            "barcode": "171102496",
            "dpc": "03031339501",
            "name": "វ៉ឹក រ៉ាន់"
        },
        {
            "barcode": "171102497",
            "dpc": "03031339601",
            "name": "តាន់ តូរ៉េ"
        },
        {
            "barcode": "171102498",
            "dpc": "03031339101",
            "name": "ញ៉ែម សានិត"
        },
        {
            "barcode": "171102499",
            "dpc": "03031338901",
            "name": "ហុក ហ៊ាត"
        },
        {
            "barcode": "171102500",
            "dpc": "03031339001",
            "name": "សូ ផេងគុណ"
        },
        {
            "barcode": "171102501",
            "dpc": "03031338801",
            "name": "ជា ហុង"
        },
        {
            "barcode": "171102502",
            "dpc": "03031338701",
            "name": "ផាន់ យី"
        },
        {
            "barcode": "171102503",
            "dpc": "03031338601",
            "name": "សាន សុផល"
        },
        {
            "barcode": "171102504",
            "dpc": "03031338501",
            "name": "យិន នូ"
        },
        {
            "barcode": "171102505",
            "dpc": "03031338401",
            "name": "ចៅ​ ចាន់"
        },
        {
            "barcode": "171102506",
            "dpc": "03031338201",
            "name": "ឃួន កុមារី"
        },
        {
            "barcode": "171102507",
            "dpc": "03031338001",
            "name": "វង្ស វីរៈ"
        },
        {
            "barcode": "171102508",
            "dpc": "03031337801",
            "name": "ពួន ភិរម្យ"
        },
        {
            "barcode": "171102509",
            "dpc": "03031337701",
            "name": "ឌី យ៉ុន ២"
        },
        {
            "barcode": "171102510",
            "dpc": "03031337601",
            "name": "សុខ ឈឿន"
        },
        {
            "barcode": "171102511",
            "dpc": "03031337501",
            "name": "ធូ សុគុន"
        },
        {
            "barcode": "171102512",
            "dpc": "03031337401",
            "name": "ហួយ សុង ហេង"
        },
        {
            "barcode": "171102513",
            "dpc": "03031337201",
            "name": "មៀច សំបូរ"
        },
        {
            "barcode": "171102514",
            "dpc": "03031337101",
            "name": "អ៊ុក សំអាន"
        },
        {
            "barcode": "171102515",
            "dpc": "03031336901",
            "name": "ជេត សំណាង"
        },
        {
            "barcode": "171102516",
            "dpc": "03031336801",
            "name": "ទូច រិទ្ធី"
        },
        {
            "barcode": "171102517",
            "dpc": "03031336701",
            "name": "កែវ សំអាត"
        },
        {
            "barcode": "171102518",
            "dpc": "03031336601",
            "name": "ញ៉ែម វណ្ណា"
        },
        {
            "barcode": "171102519",
            "dpc": "03031336501",
            "name": "គង់ វីរៈ"
        },
        {
            "barcode": "171102520",
            "dpc": "03031336401",
            "name": "កាន់ ណារិន"
        },
        {
            "barcode": "171102521",
            "dpc": "03031336201",
            "name": "លី ជា"
        },
        {
            "barcode": "171102522",
            "dpc": "03031336101",
            "name": "គង់ ឆោម"
        },
        {
            "barcode": "171102523",
            "dpc": "03031336001",
            "name": "ភុំ ឆេន"
        },
        {
            "barcode": "171102524",
            "dpc": "03031335901",
            "name": "ប្រាក់ សុខែម"
        },
        {
            "barcode": "171102525",
            "dpc": "03031335801",
            "name": "ជុំ ចៅស៊ីវ៉ាន់"
        },
        {
            "barcode": "171102526",
            "dpc": "03031335701",
            "name": "ហុក សារ៉េត"
        },
        {
            "barcode": "171102527",
            "dpc": "03031335601",
            "name": "ព្រឹម សាលី"
        },
        {
            "barcode": "171102528",
            "dpc": "03031335501",
            "name": "ចុង ស៊ីន"
        },
        {
            "barcode": "171102529",
            "dpc": "03031335301",
            "name": "ស៊ិន សិត"
        },
        {
            "barcode": "171102530",
            "dpc": "03031335201",
            "name": "ជា ប៉"
        },
        {
            "barcode": "171102531",
            "dpc": "03031335101",
            "name": "ចែម សែត"
        },
        {
            "barcode": "171102532",
            "dpc": "03031335001",
            "name": "ហង់ផាន់ស៊ី"
        },
        {
            "barcode": "171102533",
            "dpc": "03031334901",
            "name": "ឈុន លីម"
        },
        {
            "barcode": "171102534",
            "dpc": "03031334801",
            "name": "គង់ ណាំ(លក់បាយ)"
        },
        {
            "barcode": "171102535",
            "dpc": "03031334701",
            "name": "លឹម ឡាយ(លក់បាយ)"
        },
        {
            "barcode": "171102536",
            "dpc": "03031301301",
            "name": "ឃឹម សាឡេះ"
        },
        {
            "barcode": "171102537",
            "dpc": "03031312001",
            "name": "រស់  ហឿន"
        },
        {
            "barcode": "171102538",
            "dpc": "03031312201",
            "name": "ញឹម  ញ៉ាន"
        },
        {
            "barcode": "171102539",
            "dpc": "03031319101",
            "name": "ម៉ោង  សំបូ"
        },
        {
            "barcode": "171102540",
            "dpc": "03031319201",
            "name": "បែន សំបូរ"
        },
        {
            "barcode": "171102541",
            "dpc": "03031319301",
            "name": "កៅ  គង់"
        },
        {
            "barcode": "171102542",
            "dpc": "03031319401",
            "name": "ត្រឹង  ច័ន្ទបូរី"
        },
        {
            "barcode": "171102543",
            "dpc": "03031319501",
            "name": "សឿន  ប៊ុនឡេង"
        },
        {
            "barcode": "171102544",
            "dpc": "03031319601",
            "name": "សុខ  សាលីន"
        },
        {
            "barcode": "171102545",
            "dpc": "03031329101",
            "name": "ឈៀង  ថុល"
        },
        {
            "barcode": "171102546",
            "dpc": "03031337301",
            "name": "តោ  ពិសិដ្ឋ"
        },
        {
            "barcode": "171102547",
            "dpc": "03031339701",
            "name": "អាង  ឈួង (បេឡាសំចៃ )"
        },
        {
            "barcode": "171102548",
            "dpc": "03031341401",
            "name": "សោម  សាឃីម"
        },
        {
            "barcode": "171102549",
            "dpc": "03031341501",
            "name": "គឹម ប៊ុនវណ្ណ"
        },
        {
            "barcode": "171102550",
            "dpc": "03031341601",
            "name": "ម៉ាន  យ៉ាន"
        },
        {
            "barcode": "171102551",
            "dpc": "03031341701",
            "name": "ម៉ៅ   ស៊ីថា"
        },
        {
            "barcode": "171102552",
            "dpc": "03031341801",
            "name": "លឹម  អូវ"
        },
        {
            "barcode": "171102553",
            "dpc": "03031341901",
            "name": "ម៉ៅ  មឿង"
        },
        {
            "barcode": "171102554",
            "dpc": "03031342001",
            "name": "ជេដ្ឋា   សោភ័ណ្ណរ៉ា"
        },
        {
            "barcode": "171109510",
            "dpc": "03031348001",
            "name": "គ្រុយ វាសនា"
        }
    ]
    barcodes.forEach(function(bar){
      let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
    });