
let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=
[
        {
            "barcode": "171107322",
            "dpc": "03031507801",
            "name": "នូ  វេត"
        },
        {
            "barcode": "171107323",
            "dpc": "03031507701",
            "name": "សុខ  ឃាង"
        },
        {
            "barcode": "171107324",
            "dpc": "03031507601",
            "name": "អី  លី"
        },
        {
            "barcode": "171107325",
            "dpc": "03031507501",
            "name": "ហេង  គឹមនី"
        },
        {
            "barcode": "171107326",
            "dpc": "03031507401",
            "name": "ឱក គឹមចាន់"
        },
        {
            "barcode": "171107327",
            "dpc": "03031507301",
            "name": "ជិន  មឿន"
        },
        {
            "barcode": "171107328",
            "dpc": "03031507101",
            "name": "អូរ ម៉េងអ៊ារ"
        },
        {
            "barcode": "171107329",
            "dpc": "03031507001",
            "name": "ជួន  ម៉ាច"
        },
        {
            "barcode": "171107330",
            "dpc": "03031506901",
            "name": "ពៅ  ជៀវ"
        },
        {
            "barcode": "171107331",
            "dpc": "03031506801",
            "name": "ប៉ែន  ធី"
        },
        {
            "barcode": "171107332",
            "dpc": "03031506701",
            "name": "កឺ  ប៊ុនឡុង"
        },
        {
            "barcode": "171107333",
            "dpc": "03031506601",
            "name": "ផល  លីនាង"
        },
        {
            "barcode": "171107334",
            "dpc": "03031506501",
            "name": "សុខ  ណាវី"
        },
        {
            "barcode": "171107335",
            "dpc": "03031506401",
            "name": "ម៉ៅ  ទូច"
        },
        {
            "barcode": "171107336",
            "dpc": "03031506301",
            "name": "ជុន  ភក្តី"
        },
        {
            "barcode": "171107337",
            "dpc": "03031506201",
            "name": "សេង  ឡុង"
        },
        {
            "barcode": "171107338",
            "dpc": "03031506101",
            "name": "ជឹម  សុម៉ាលី"
        },
        {
            "barcode": "171107339",
            "dpc": "03031506001",
            "name": "អ៊ូ  វណ្ណា"
        },
        {
            "barcode": "171107340",
            "dpc": "03031505901",
            "name": "សេង ចាន់ដាវុធ"
        },
        {
            "barcode": "171107341",
            "dpc": "03031505801",
            "name": "សេង  ហ៊ាង"
        },
        {
            "barcode": "171107342",
            "dpc": "03031505701",
            "name": "ភុក  ជា"
        },
        {
            "barcode": "171107343",
            "dpc": "03031505601",
            "name": "ឡាំ  ហ៊ុល"
        },
        {
            "barcode": "171107344",
            "dpc": "03031505501",
            "name": "យ៉ង់  មាឌី"
        },
        {
            "barcode": "171107345",
            "dpc": "03031505401",
            "name": "ប៊ុន អេង"
        },
        {
            "barcode": "171107346",
            "dpc": "03031505301",
            "name": "ម៉េង  ពៅ"
        },
        {
            "barcode": "171107347",
            "dpc": "03031505201",
            "name": "ពឹង  ប៉ុក"
        },
        {
            "barcode": "171107348",
            "dpc": "03031505101",
            "name": "គឹម  ហ៊ាង"
        },
        {
            "barcode": "171107349",
            "dpc": "03031505001",
            "name": "អ៊ិន  ឡា ២"
        },
        {
            "barcode": "171107350",
            "dpc": "03031504901",
            "name": "ប៉ោ លីម"
        },
        {
            "barcode": "171107351",
            "dpc": "03031504801",
            "name": "ប៉ា  ដារា"
        },
        {
            "barcode": "171107352",
            "dpc": "03031504701",
            "name": "អ៊ូ  វណ្ណី"
        },
        {
            "barcode": "171107353",
            "dpc": "03031504601",
            "name": "យ៉ាង  អ៊ីអិញ"
        },
        {
            "barcode": "171107354",
            "dpc": "03031504501",
            "name": "ទឹម  ដន"
        },
        {
            "barcode": "171107355",
            "dpc": "03031504401",
            "name": "អៃ  ហ្គ្រិច"
        },
        {
            "barcode": "171107356",
            "dpc": "03031504201",
            "name": "ថោង  កញ្ញា"
        },
        {
            "barcode": "171107357",
            "dpc": "03031504101",
            "name": "ចាន់  ណាវី"
        },
        {
            "barcode": "171107358",
            "dpc": "03031504001",
            "name": "ឆេង  ស៊ីវ"
        },
        {
            "barcode": "171107359",
            "dpc": "03031503901",
            "name": "សុខ  សារិន"
        },
        {
            "barcode": "171107360",
            "dpc": "03031545401",
            "name": "ប៉ាន់ ង៉ែត"
        },
        {
            "barcode": "171107361",
            "dpc": "03031545301",
            "name": "ហឿន  ធួក"
        },
        {
            "barcode": "171107362",
            "dpc": "03031545201",
            "name": "ទ្រីញ ភាវ"
        },
        {
            "barcode": "171107363",
            "dpc": "03031545101",
            "name": "ម៉ុយ សេង"
        },
        {
            "barcode": "171107364",
            "dpc": "03031544901",
            "name": "ឃី ប៉ោឆាយ"
        },
        {
            "barcode": "171107365",
            "dpc": "03031544801",
            "name": "ធូ ញ៉េប"
        },
        {
            "barcode": "171107366",
            "dpc": "03031544701",
            "name": "សុខ វែង"
        },
        {
            "barcode": "171107367",
            "dpc": "03031544601",
            "name": "សាយ រក្សា"
        },
        {
            "barcode": "171107368",
            "dpc": "03031544501",
            "name": "សុភី វណ្ណី"
        },
        {
            "barcode": "171107369",
            "dpc": "03031544401",
            "name": "ប៉ោ សុភាព"
        },
        {
            "barcode": "171107370",
            "dpc": "03031544301",
            "name": "ឃុន ហេង"
        },
        {
            "barcode": "171107371",
            "dpc": "03031544201",
            "name": "ឃន ភារម្យ"
        },
        {
            "barcode": "171107372",
            "dpc": "03031544101",
            "name": "អ៊ុំ សារ៉ានាថ"
        },
        {
            "barcode": "171107373",
            "dpc": "03031544001",
            "name": "តាំង ប៊ុនណា"
        },
        {
            "barcode": "171107374",
            "dpc": "03031543901",
            "name": "ចាយ គា"
        },
        {
            "barcode": "171107375",
            "dpc": "03031543801",
            "name": "ឆាន់ ប៊ន"
        },
        {
            "barcode": "171107376",
            "dpc": "03031543701",
            "name": "ថាត់  យ៉ាងតាំ"
        },
        {
            "barcode": "171107377",
            "dpc": "03031543601",
            "name": "គឹម គាង"
        },
        {
            "barcode": "171107378",
            "dpc": "03031543401",
            "name": "វង្ស កាំហ"
        },
        {
            "barcode": "171107379",
            "dpc": "03031543301",
            "name": "ម៉ូវ ប៊ូ"
        },
        {
            "barcode": "171107380",
            "dpc": "03031543201",
            "name": "ពិន ប៊ូ"
        },
        {
            "barcode": "171107381",
            "dpc": "03031543101",
            "name": "ប៉ោ ចន្ថា"
        },
        {
            "barcode": "171107382",
            "dpc": "03031543001",
            "name": "ជា សុផល"
        },
        {
            "barcode": "171107383",
            "dpc": "03031542901",
            "name": "ឌី ប៊ុនហ៊ាន"
        },
        {
            "barcode": "171107384",
            "dpc": "03031542701",
            "name": "អ៊ូច ចាន់រី"
        },
        {
            "barcode": "171107385",
            "dpc": "03031542601",
            "name": "ខឹម ហឿន"
        },
        {
            "barcode": "171107386",
            "dpc": "03031542501",
            "name": "ខឹម ទូច"
        },
        {
            "barcode": "171107387",
            "dpc": "03031542401",
            "name": "ឆន ឈឿង"
        },
        {
            "barcode": "171107388",
            "dpc": "03031542301",
            "name": "ភឹម គន"
        },
        {
            "barcode": "171107389",
            "dpc": "03031542201",
            "name": "ថេង ស្រូយ"
        },
        {
            "barcode": "171107390",
            "dpc": "03031542101",
            "name": "អ៊ឹង ឃាង"
        },
        {
            "barcode": "171107391",
            "dpc": "03031542001",
            "name": "សាន់ ហៃ"
        },
        {
            "barcode": "171107392",
            "dpc": "03031541901",
            "name": "ហ៊ុន បួយ"
        },
        {
            "barcode": "171107393",
            "dpc": "03031541801",
            "name": "ទាវ សៀម៉ី"
        },
        {
            "barcode": "171107394",
            "dpc": "03031541701",
            "name": "អ៊ុយ រី"
        },
        {
            "barcode": "171107395",
            "dpc": "03031541601",
            "name": "គី រី"
        },
        {
            "barcode": "171107396",
            "dpc": "03031541301",
            "name": "ហូយ ឡាំង"
        },
        {
            "barcode": "171107397",
            "dpc": "03031541201",
            "name": "ម៉ៅ ឆាយ"
        },
        {
            "barcode": "171107398",
            "dpc": "03031541101",
            "name": "លី ប៉ូទៀង"
        },
        {
            "barcode": "171107399",
            "dpc": "03031540901",
            "name": "សេង ហ៊ាង"
        },
        {
            "barcode": "171107400",
            "dpc": "03031540701",
            "name": "តាន់ លួង"
        },
        {
            "barcode": "171107401",
            "dpc": "03031540601",
            "name": "យុក សឿង"
        },
        {
            "barcode": "171107402",
            "dpc": "03031540401",
            "name": "តាន់ សាន់"
        },
        {
            "barcode": "171107403",
            "dpc": "03031540201",
            "name": "ទេស សុខុនវិនី"
        },
        {
            "barcode": "171107404",
            "dpc": "03031540101",
            "name": "កែវ សំអាត"
        },
        {
            "barcode": "171107405",
            "dpc": "03031540001",
            "name": "សួន ពោយ"
        },
        {
            "barcode": "171107406",
            "dpc": "03031547901",
            "name": "កាយ ចាន់ថន"
        },
        {
            "barcode": "171107407",
            "dpc": "03031547801",
            "name": "អ៊ឹម សូថាយ"
        },
        {
            "barcode": "171107408",
            "dpc": "03031547701",
            "name": "ញ៉េប គឹមឈឿង"
        },
        {
            "barcode": "171107409",
            "dpc": "03031547601",
            "name": "កង សេត"
        },
        {
            "barcode": "171107410",
            "dpc": "03031547501",
            "name": "ឈ ជិត"
        },
        {
            "barcode": "171107411",
            "dpc": "03031547401",
            "name": "ជឹម សេង"
        },
        {
            "barcode": "171107412",
            "dpc": "03031547301",
            "name": "តាំង នី"
        },
        {
            "barcode": "171107413",
            "dpc": "03031547201",
            "name": "តាំង ទទី"
        },
        {
            "barcode": "171107414",
            "dpc": "03031547101",
            "name": "ម៉ាន់ ប៊ុន"
        },
        {
            "barcode": "171107415",
            "dpc": "03031547001",
            "name": "លី ស៊ុនហ"
        },
        {
            "barcode": "171107416",
            "dpc": "03031546901",
            "name": "យ៉ាង ស៊ីវសេង ១"
        },
        {
            "barcode": "171107417",
            "dpc": "03031546801",
            "name": "ជា សម្ភស្ស"
        },
        {
            "barcode": "171107418",
            "dpc": "03031546701",
            "name": "សា ម៉ូរ៉ាក់"
        },
        {
            "barcode": "171107419",
            "dpc": "03031546601",
            "name": "អ៊ូច សាត់"
        },
        {
            "barcode": "171107420",
            "dpc": "03031546501",
            "name": "ង៉ែត គិម"
        },
        {
            "barcode": "171107421",
            "dpc": "03031546401",
            "name": "ផាន់ សុវណ្ណរិទ្ធ"
        },
        {
            "barcode": "171107422",
            "dpc": "03031546301",
            "name": "ខឹម ហឿន"
        },
        {
            "barcode": "171107423",
            "dpc": "03031546201",
            "name": "យី គឹមអាង"
        },
        {
            "barcode": "171107424",
            "dpc": "03031546101",
            "name": "ឈាវ ងិត"
        },
        {
            "barcode": "171107425",
            "dpc": "03031546001",
            "name": "នុត ថុន"
        },
        {
            "barcode": "171107426",
            "dpc": "03031545901",
            "name": "ហ៊ុយ តុង"
        },
        {
            "barcode": "171107427",
            "dpc": "03031545801",
            "name": "វណ្ណ សុផេន"
        },
        {
            "barcode": "171107428",
            "dpc": "03031545701",
            "name": "ទូច វ៉ាន់"
        },
        {
            "barcode": "171107429",
            "dpc": "03031545601",
            "name": "សុខ គុជ"
        },
        {
            "barcode": "171107430",
            "dpc": "03031545501",
            "name": "លី ហាក់"
        },
        {
            "barcode": "171107431",
            "dpc": "03031507901",
            "name": "ង៉ូវ គា"
        },
        {
            "barcode": "171107432",
            "dpc": "03031508001",
            "name": "សិទ្ធ ងួនហាក់"
        },
        {
            "barcode": "171107433",
            "dpc": "03031508101",
            "name": "ខៀវ ងួនឡេង"
        },
        {
            "barcode": "171107434",
            "dpc": "03031508201",
            "name": "អ៊ឹង អេង"
        },
        {
            "barcode": "171107435",
            "dpc": "03031508301",
            "name": "ស ឌឿ"
        },
        {
            "barcode": "171107436",
            "dpc": "03031508401",
            "name": "ម៉ាច ប៊ុនហ៊ាញ"
        },
        {
            "barcode": "171107437",
            "dpc": "03031508501",
            "name": "ម៉េង លាភ"
        },
        {
            "barcode": "171107438",
            "dpc": "03031508601",
            "name": "នាង ង៉ា"
        },
        {
            "barcode": "171107439",
            "dpc": "03031508701",
            "name": "ចាន់ សារេត"
        },
        {
            "barcode": "171107440",
            "dpc": "03031508801",
            "name": "ងឹម ពៅ"
        },
        {
            "barcode": "171107441",
            "dpc": "03031508901",
            "name": "ឡាវ ស៊ីវលី"
        },
        {
            "barcode": "171107442",
            "dpc": "03031509201",
            "name": "សោម ឌួង"
        },
        {
            "barcode": "171107443",
            "dpc": "03031509001",
            "name": "សុខ ហាយ"
        },
        {
            "barcode": "171107444",
            "dpc": "03031509301",
            "name": "សំរិត វិចិត្រ"
        },
        {
            "barcode": "171107445",
            "dpc": "03031517101",
            "name": "ម៉ៅ  នាង"
        },
        {
            "barcode": "171107446",
            "dpc": "03031509401",
            "name": "ចាន់ មុំ"
        },
        {
            "barcode": "171107447",
            "dpc": "03031509501",
            "name": "ធិ សុខុម"
        },
        {
            "barcode": "171107448",
            "dpc": "03031509601",
            "name": "សេង សម្បត្តិ"
        },
        {
            "barcode": "171107449",
            "dpc": "03031509701",
            "name": "ថាច់ ចាន់ថន"
        },
        {
            "barcode": "171107450",
            "dpc": "03031509901",
            "name": "ចាន់ ហ៊ាន"
        },
        {
            "barcode": "171107451",
            "dpc": "03031510001",
            "name": "យឹម ហូរ"
        },
        {
            "barcode": "171107452",
            "dpc": "03031510101",
            "name": "ជា សុខណា"
        },
        {
            "barcode": "171107453",
            "dpc": "03031510201",
            "name": "យឹម សារុំ"
        },
        {
            "barcode": "171107454",
            "dpc": "03031510301",
            "name": "លឹម ហាក់"
        },
        {
            "barcode": "171107455",
            "dpc": "03031510401",
            "name": "អាង ទី"
        },
        {
            "barcode": "171107456",
            "dpc": "03031510501",
            "name": "កៅ ណារិទ្ធ"
        },
        {
            "barcode": "171107457",
            "dpc": "03031510701",
            "name": "តាំង ហៀង"
        },
        {
            "barcode": "171107458",
            "dpc": "03031510801",
            "name": "ចាន់ លាង"
        },
        {
            "barcode": "171107459",
            "dpc": "03031510901",
            "name": "ឆេង ហ៊ាង"
        },
        {
            "barcode": "171107460",
            "dpc": "03031511001",
            "name": "ពេជ្រ តិចស៊្រុន"
        },
        {
            "barcode": "171107461",
            "dpc": "03031511101",
            "name": "ទេព ប៊ុនតុង"
        },
        {
            "barcode": "171107462",
            "dpc": "03031511301",
            "name": "លឹម ហ៊ត"
        },
        {
            "barcode": "171107463",
            "dpc": "03031511401",
            "name": "គុយ ទ្រី"
        },
        {
            "barcode": "171107464",
            "dpc": "03031511501",
            "name": "ប៉ុល សារី"
        },
        {
            "barcode": "171107465",
            "dpc": "03031511601",
            "name": "ស៊ីវ  គង់"
        },
        {
            "barcode": "171107466",
            "dpc": "03031511201",
            "name": "ចេង ហួន"
        },
        {
            "barcode": "171107467",
            "dpc": "03031511701",
            "name": "គង់ នី"
        },
        {
            "barcode": "171107468",
            "dpc": "03031511901",
            "name": "ថៃ បាក់លីវ"
        },
        {
            "barcode": "171107469",
            "dpc": "03031512001",
            "name": "សួន សាយ"
        },
        {
            "barcode": "171107470",
            "dpc": "03031512101",
            "name": "មិន សុខខេង"
        },
        {
            "barcode": "171107471",
            "dpc": "03031512301",
            "name": "សាន់  ឃាង"
        },
        {
            "barcode": "171107472",
            "dpc": "03031512401",
            "name": "សុខ ហូ"
        },
        {
            "barcode": "171107473",
            "dpc": "03031512501",
            "name": "គី សៀកហួរ"
        },
        {
            "barcode": "171107474",
            "dpc": "03031512601",
            "name": "ចាន់ ហ៊ាញ"
        },
        {
            "barcode": "171107475",
            "dpc": "03031512701",
            "name": "ញ៉ែម ហឿន"
        },
        {
            "barcode": "171107476",
            "dpc": "03031512801",
            "name": "ប៊ុន សេង"
        },
        {
            "barcode": "171107477",
            "dpc": "03031512901",
            "name": "ពត សុត"
        },
        {
            "barcode": "171107478",
            "dpc": "03031513001",
            "name": "ឆាន់ ហាក់"
        },
        {
            "barcode": "171107479",
            "dpc": "03031513101",
            "name": "ឆាន់ ឈឿង"
        },
        {
            "barcode": "171107480",
            "dpc": "03031513201",
            "name": "សុខ លី"
        },
        {
            "barcode": "171107481",
            "dpc": "03031513301",
            "name": "គង់ សុខម៉េង"
        },
        {
            "barcode": "171107482",
            "dpc": "03031513401",
            "name": "តាំង រុនឌី"
        },
        {
            "barcode": "171107483",
            "dpc": "03031513501",
            "name": "អៀរ ហៀង"
        },
        {
            "barcode": "171107484",
            "dpc": "03031513601",
            "name": "ទេព រិទ្ធី"
        },
        {
            "barcode": "171107485",
            "dpc": "03031513701",
            "name": "ហោ ឃាង"
        },
        {
            "barcode": "171107486",
            "dpc": "03031513801",
            "name": "វ៉ាន់ ថូង"
        },
        {
            "barcode": "171107487",
            "dpc": "03031513901",
            "name": "ស៊ឹម វ៉ាត់"
        },
        {
            "barcode": "171107488",
            "dpc": "03031514001",
            "name": "វ៉ាត ធា"
        },
        {
            "barcode": "171107489",
            "dpc": "03031514101",
            "name": "លី ពិសិដ្ឋ"
        },
        {
            "barcode": "171107490",
            "dpc": "03031514201",
            "name": "អ៊ុត មួយ"
        },
        {
            "barcode": "171107491",
            "dpc": "03031514301",
            "name": "សោម រ៉ានី"
        },
        {
            "barcode": "171107492",
            "dpc": "03031514401",
            "name": "យ៉ាន់ សំអូន"
        },
        {
            "barcode": "171107493",
            "dpc": "03031514501",
            "name": "តាន់ គឹមសុន"
        },
        {
            "barcode": "171107494",
            "dpc": "03031514601",
            "name": "ម៉ៅ ខេន"
        },
        {
            "barcode": "171107495",
            "dpc": "03031514801",
            "name": "សុខ ឃឿន"
        },
        {
            "barcode": "171107496",
            "dpc": "03031514701",
            "name": "ឃាន សំណាង"
        },
        {
            "barcode": "171107497",
            "dpc": "03031514901",
            "name": "អ៊ុន ឈឿន"
        },
        {
            "barcode": "171107498",
            "dpc": "03031515001",
            "name": "សេ ស៊ីឡាដា"
        },
        {
            "barcode": "171107499",
            "dpc": "03031515201",
            "name": "ឃី សុផា ២"
        },
        {
            "barcode": "171107500",
            "dpc": "03031515301",
            "name": "ទិត្យ រ៉ា"
        },
        {
            "barcode": "171107501",
            "dpc": "03031515401",
            "name": "អ៊ឹង ឡឹមហ៊ី"
        },
        {
            "barcode": "171107502",
            "dpc": "03031515501",
            "name": "គា សាម៉ន"
        },
        {
            "barcode": "171107503",
            "dpc": "03031515601",
            "name": "សុវណ្ណ សាវ៉ាន់រ៉ាន់"
        },
        {
            "barcode": "171107504",
            "dpc": "03031515701",
            "name": "ទ្រី សាមិត្ត"
        },
        {
            "barcode": "171107505",
            "dpc": "03031516001",
            "name": "ម៉េង ចាន់ថន"
        },
        {
            "barcode": "171107506",
            "dpc": "03031515901",
            "name": "ដែង សាវឿត"
        },
        {
            "barcode": "171107507",
            "dpc": "03031515801",
            "name": "ឡុង សារ៉េត"
        },
        {
            "barcode": "171107508",
            "dpc": "03031516101",
            "name": "អ៊ិត គឹមស្រ៊ុន"
        },
        {
            "barcode": "171107509",
            "dpc": "03031516201",
            "name": "យស សុខមាន"
        },
        {
            "barcode": "171107510",
            "dpc": "03031516301",
            "name": "ស្វាយ  ភីរម្យ"
        },
        {
            "barcode": "171107511",
            "dpc": "03031516401",
            "name": "វ៉ែន ទូច"
        },
        {
            "barcode": "171107512",
            "dpc": "03031516501",
            "name": "វ៉ឹង វុទ្ធី"
        },
        {
            "barcode": "171107513",
            "dpc": "03031516601",
            "name": "ណាល់ ជិនណា"
        },
        {
            "barcode": "171107514",
            "dpc": "03031516701",
            "name": "ពុធ គ្រឿន"
        },
        {
            "barcode": "171107515",
            "dpc": "03031516801",
            "name": "ហៀង លីវ"
        },
        {
            "barcode": "171107516",
            "dpc": "03031516901",
            "name": "សោម ផានី"
        },
        {
            "barcode": "171107517",
            "dpc": "03031517001",
            "name": "តេង សុខា"
        },
        {
            "barcode": "171107518",
            "dpc": "03031517201",
            "name": "អ៊ាម ស៊"
        },
        {
            "barcode": "171107519",
            "dpc": "03031517301",
            "name": "តែង ស៊ីវអេង"
        },
        {
            "barcode": "171107520",
            "dpc": "03031517401",
            "name": "ឈន ហ៊ុន"
        },
        {
            "barcode": "171107521",
            "dpc": "03031517501",
            "name": "នង ឃីម"
        },
        {
            "barcode": "171107522",
            "dpc": "03031517601",
            "name": "លិញ ម៉ាលីស"
        },
        {
            "barcode": "171107523",
            "dpc": "03031517701",
            "name": "លិញ ទៀន"
        },
        {
            "barcode": "171107524",
            "dpc": "03031517801",
            "name": "ស៊ុយ លី"
        },
        {
            "barcode": "171107525",
            "dpc": "03031517901",
            "name": "ប៉ាន ធានី"
        },
        {
            "barcode": "171107526",
            "dpc": "03031518001",
            "name": "ថន ប៊ុនធឿន"
        },
        {
            "barcode": "171107527",
            "dpc": "03031518101",
            "name": "គឹម អេង"
        },
        {
            "barcode": "171107528",
            "dpc": "03031518301",
            "name": "ថែម លី"
        },
        {
            "barcode": "171107529",
            "dpc": "03031518401",
            "name": "ចាប ប៊ុតគឹមលីស"
        },
        {
            "barcode": "171107530",
            "dpc": "03031518501",
            "name": "ម៉ៅ ប៊ុនធៀន"
        },
        {
            "barcode": "171107531",
            "dpc": "03031518601",
            "name": "លី ម៉េង"
        },
        {
            "barcode": "171107532",
            "dpc": "03031539901",
            "name": "ឡៃ ហ៊ាង"
        },
        {
            "barcode": "171107533",
            "dpc": "03031539801",
            "name": "អ៊ុន សាលី"
        },
        {
            "barcode": "171107534",
            "dpc": "03031539701",
            "name": "ឡៅ ជី"
        },
        {
            "barcode": "171107535",
            "dpc": "03031539601",
            "name": "តា លាង"
        },
        {
            "barcode": "171107536",
            "dpc": "03031539501",
            "name": "ញឹក សុធី"
        },
        {
            "barcode": "171107537",
            "dpc": "03031539401",
            "name": "ហូ ប៉ុក"
        },
        {
            "barcode": "171107538",
            "dpc": "03031539301",
            "name": "ង៉ោ ជឹងឈុន"
        },
        {
            "barcode": "171107539",
            "dpc": "03031539201",
            "name": "ម៉េង វណ្ណៈ"
        },
        {
            "barcode": "171107540",
            "dpc": "03031538901",
            "name": "ប៉ោ ស៊ីមឡី"
        },
        {
            "barcode": "171107541",
            "dpc": "03031538801",
            "name": "ប្រាក់ គឹមឡាយ"
        },
        {
            "barcode": "171107542",
            "dpc": "03031538501",
            "name": "ប្រាក់ ស៊ីម"
        },
        {
            "barcode": "171107543",
            "dpc": "03031538401",
            "name": "ជា ចាន់"
        },
        {
            "barcode": "171107544",
            "dpc": "03031538301",
            "name": "ឈុន ហាក់"
        },
        {
            "barcode": "171107545",
            "dpc": "03031538201",
            "name": "សាន កុសល"
        },
        {
            "barcode": "171107546",
            "dpc": "03031538101",
            "name": "វ៉ាន់  វុត្ថា"
        },
        {
            "barcode": "171107547",
            "dpc": "03031538001",
            "name": "តាំង  យ៉ាវ"
        },
        {
            "barcode": "171107548",
            "dpc": "03031537901",
            "name": "ឌី កេង"
        },
        {
            "barcode": "171107549",
            "dpc": "03031537801",
            "name": "សួង សារួន"
        },
        {
            "barcode": "171107550",
            "dpc": "03031537701",
            "name": "ជា អ៊ុល"
        },
        {
            "barcode": "171107551",
            "dpc": "03031536401",
            "name": "មិន ហៃ"
        },
        {
            "barcode": "171107552",
            "dpc": "03031536301",
            "name": "សោ ម៉េងហ៊ាង"
        },
        {
            "barcode": "171107553",
            "dpc": "03031536201",
            "name": "សុខ លី"
        },
        {
            "barcode": "171107554",
            "dpc": "03031536101",
            "name": "ស៊ុន ជឿន"
        },
        {
            "barcode": "171107555",
            "dpc": "03031536001",
            "name": "ស៊ូ ចក់"
        },
        {
            "barcode": "171107556",
            "dpc": "03031535901",
            "name": "ខ្លូត ហ៊ុយហេង"
        },
        {
            "barcode": "171107557",
            "dpc": "03031535801",
            "name": "គួច ហៃ"
        },
        {
            "barcode": "171107558",
            "dpc": "03031535701",
            "name": "ហេង ប៊ុនផាន"
        },
        {
            "barcode": "171107559",
            "dpc": "03031535601",
            "name": "តាំង គី"
        },
        {
            "barcode": "171107560",
            "dpc": "03031535501",
            "name": "គឹម ឡា"
        },
        {
            "barcode": "171107561",
            "dpc": "03031535401",
            "name": "អ៊ុច អាំង"
        },
        {
            "barcode": "171107562",
            "dpc": "03031535301",
            "name": "ម៉ម ពន្លក ១"
        },
        {
            "barcode": "171107563",
            "dpc": "03031535201",
            "name": "គាំ ពៅ"
        },
        {
            "barcode": "171107564",
            "dpc": "03031535101",
            "name": "ចែវ គឹមវ៉ា"
        },
        {
            "barcode": "171107565",
            "dpc": "03031534901",
            "name": "ចាន់ មុំ"
        },
        {
            "barcode": "171107566",
            "dpc": "03031534801",
            "name": "ប្រាង្គ តាយ"
        },
        {
            "barcode": "171107567",
            "dpc": "03031534701",
            "name": "ទន់ សារុន"
        },
        {
            "barcode": "171107568",
            "dpc": "03031534601",
            "name": "កង នី"
        },
        {
            "barcode": "171107569",
            "dpc": "03031534501",
            "name": "អ៊ុក វណ្ណា"
        },
        {
            "barcode": "171107570",
            "dpc": "03031534401",
            "name": "ប៉ិច គឹមស៊"
        },
        {
            "barcode": "171107571",
            "dpc": "03031534301",
            "name": "ជុក ឡុង"
        },
        {
            "barcode": "171107572",
            "dpc": "03031534201",
            "name": "ហាក់ លីម"
        },
        {
            "barcode": "171107573",
            "dpc": "03031534101",
            "name": "អ៊ុន ហ្សាលី"
        },
        {
            "barcode": "171107574",
            "dpc": "03031534001",
            "name": "លី ហូយ"
        },
        {
            "barcode": "171107575",
            "dpc": "03031533901",
            "name": "ឃី ណារិន"
        },
        {
            "barcode": "171107576",
            "dpc": "03031533801",
            "name": "គុយ ហួត"
        },
        {
            "barcode": "171107577",
            "dpc": "03031533701",
            "name": "ខូវ ហ៊ុយប៉ិ"
        },
        {
            "barcode": "171107578",
            "dpc": "03031533601",
            "name": "ថាច់ បូរិន"
        },
        {
            "barcode": "171107579",
            "dpc": "03031533501",
            "name": "អ៊ឹង ឡៃហ៊ត"
        },
        {
            "barcode": "171107580",
            "dpc": "03031533401",
            "name": "អ៊ុន ចំរើន"
        },
        {
            "barcode": "171107581",
            "dpc": "03031533301",
            "name": "ញិល ស៊ន"
        },
        {
            "barcode": "171107582",
            "dpc": "03031533201",
            "name": "លន់ អេង"
        },
        {
            "barcode": "171107583",
            "dpc": "03031533101",
            "name": "ធូ ហៃ"
        },
        {
            "barcode": "171107584",
            "dpc": "03031533001",
            "name": "តុង លីហួរ"
        },
        {
            "barcode": "171107585",
            "dpc": "03031532901",
            "name": "ជុំ រតនា"
        },
        {
            "barcode": "171107586",
            "dpc": "03031532801",
            "name": "គង់ សំណាង"
        },
        {
            "barcode": "171107587",
            "dpc": "03031532701",
            "name": "វ៉ែន ទិត្យ"
        },
        {
            "barcode": "171107588",
            "dpc": "03031537101",
            "name": "សឿន លី"
        },
        {
            "barcode": "171107589",
            "dpc": "03031537001",
            "name": "លឹម ហួន"
        },
        {
            "barcode": "171107590",
            "dpc": "03031536901",
            "name": "ភឿន ណូក"
        },
        {
            "barcode": "171107591",
            "dpc": "03031536801",
            "name": "អ៊ុក វណ្ណា"
        },
        {
            "barcode": "171107592",
            "dpc": "03031536501",
            "name": "លី សុង"
        },
        {
            "barcode": "171107593",
            "dpc": "03031536601",
            "name": "កែវ ប៊ុនឆន"
        },
        {
            "barcode": "171107594",
            "dpc": "03031536701",
            "name": "លី សាំងអូន"
        },
        {
            "barcode": "171107595",
            "dpc": "03031537601",
            "name": "លី សម្បត្តិ"
        },
        {
            "barcode": "171107596",
            "dpc": "03031537501",
            "name": "ជង់ ធឿង"
        },
        {
            "barcode": "171107597",
            "dpc": "03031532201",
            "name": "ស៊ុយ ពៅ"
        },
        {
            "barcode": "171107598",
            "dpc": "03031537401",
            "name": "ឃិន សាន"
        },
        {
            "barcode": "171107599",
            "dpc": "03031537301",
            "name": "ឃិន ជូ"
        },
        {
            "barcode": "171107600",
            "dpc": "03031537201",
            "name": "ប៊ុន ឈីញ"
        },
        {
            "barcode": "171107601",
            "dpc": "03031532601",
            "name": "អិត ផល្លី"
        },
        {
            "barcode": "171107602",
            "dpc": "03031532501",
            "name": "យី សាបាន"
        },
        {
            "barcode": "171107603",
            "dpc": "03031532401",
            "name": "ឆាន់ ភុយ"
        },
        {
            "barcode": "171107604",
            "dpc": "03031532301",
            "name": "សេង អ៊ន"
        },
        {
            "barcode": "171107605",
            "dpc": "03031532101",
            "name": "សៀម ទៀង"
        },
        {
            "barcode": "171107606",
            "dpc": "03031532001",
            "name": "ជុំ គឹមអុ"
        },
        {
            "barcode": "171107607",
            "dpc": "03031531901",
            "name": "អ៊ឹង ម៉ែង"
        },
        {
            "barcode": "171107608",
            "dpc": "03031531701",
            "name": "សម សុវណ្ណ"
        },
        {
            "barcode": "171107609",
            "dpc": "03031531501",
            "name": "ឡាយ ស៊"
        },
        {
            "barcode": "171107610",
            "dpc": "03031531401",
            "name": "អោក អៀង"
        },
        {
            "barcode": "171107611",
            "dpc": "03031531301",
            "name": "អ៊ួច យ៉ន"
        },
        {
            "barcode": "171107612",
            "dpc": "03031527201",
            "name": "ម៉េង លាង"
        },
        {
            "barcode": "171107613",
            "dpc": "03031527301",
            "name": "សេង វណ្ណី"
        },
        {
            "barcode": "171107614",
            "dpc": "03031527501",
            "name": "កែវ លី"
        },
        {
            "barcode": "171107615",
            "dpc": "03031527601",
            "name": "ប៉ៅ ណៃ"
        },
        {
            "barcode": "171107616",
            "dpc": "03031527701",
            "name": "ឆេ សាន"
        },
        {
            "barcode": "171107617",
            "dpc": "03031527801",
            "name": "អេង លី ១"
        },
        {
            "barcode": "171107618",
            "dpc": "03031527901",
            "name": "ជន យ៉ម"
        },
        {
            "barcode": "171107619",
            "dpc": "03031528001",
            "name": "តែ ហន"
        },
        {
            "barcode": "171107620",
            "dpc": "03031528101",
            "name": "ពៅ វ៉ាន់ថា"
        },
        {
            "barcode": "171107621",
            "dpc": "03031528201",
            "name": "លឹម គឹមសាន"
        },
        {
            "barcode": "171107622",
            "dpc": "03031528301",
            "name": "អេង លី ២"
        },
        {
            "barcode": "171107623",
            "dpc": "03031528401",
            "name": "ពិន សង្គមឧត្តម"
        },
        {
            "barcode": "171107624",
            "dpc": "03031528501",
            "name": "ស៊ីវ ឃួងប៉ោ"
        },
        {
            "barcode": "171107625",
            "dpc": "03031528701",
            "name": "ព្រុំ រដ្ឋា"
        },
        {
            "barcode": "171107626",
            "dpc": "03031528801",
            "name": "ដាញ់ អេងប៊ុនវ៉ាន់"
        },
        {
            "barcode": "171107627",
            "dpc": "03031528901",
            "name": "សេង លៀប"
        },
        {
            "barcode": "171107628",
            "dpc": "03031529001",
            "name": "ទេព ថាវី"
        },
        {
            "barcode": "171107629",
            "dpc": "03031529101",
            "name": "តែ ឡាង"
        },
        {
            "barcode": "171107630",
            "dpc": "03031529201",
            "name": "អែល ស្រ៊ុន"
        },
        {
            "barcode": "171107631",
            "dpc": "03031529301",
            "name": "យូ  សំអុល"
        },
        {
            "barcode": "171107632",
            "dpc": "03031529601",
            "name": "តែម  វុន"
        },
        {
            "barcode": "171107633",
            "dpc": "03031529701",
            "name": "សាន ស៊ីម៉ៃ"
        },
        {
            "barcode": "171107634",
            "dpc": "03031529901",
            "name": "ចាប ទៀង"
        },
        {
            "barcode": "171107635",
            "dpc": "03031530001",
            "name": "ទាវ តុប"
        },
        {
            "barcode": "171107636",
            "dpc": "03031530101",
            "name": "លី ហួយ"
        },
        {
            "barcode": "171107637",
            "dpc": "03031530301",
            "name": "តាំង លីម"
        },
        {
            "barcode": "171107638",
            "dpc": "03031530401",
            "name": "ជុំ ធុនណា"
        },
        {
            "barcode": "171107639",
            "dpc": "03031530501",
            "name": "ផន គឹមកែវ"
        },
        {
            "barcode": "171107640",
            "dpc": "03031530601",
            "name": "សេង ថា"
        },
        {
            "barcode": "171107641",
            "dpc": "03031530701",
            "name": "គង់ យឿត"
        },
        {
            "barcode": "171107642",
            "dpc": "03031530901",
            "name": "ជុំ ពិទាក់"
        },
        {
            "barcode": "171107643",
            "dpc": "03031531001",
            "name": "ខាត់ ប៊ុនទៀង"
        },
        {
            "barcode": "171107644",
            "dpc": "03031531201",
            "name": "ភោគ  រិទ្ធា"
        },
        {
            "barcode": "171107645",
            "dpc": "03031531101",
            "name": "សាលាបឋមសិក្សា ទួលតាឯក"
        },
        {
            "barcode": "171107646",
            "dpc": "03031525401",
            "name": "សឹម ហៃ"
        },
        {
            "barcode": "171107647",
            "dpc": "03031525501",
            "name": "លី ឃឿង"
        },
        {
            "barcode": "171107648",
            "dpc": "03031525601",
            "name": "ម៉េង ឆវី"
        },
        {
            "barcode": "171107649",
            "dpc": "03031518701",
            "name": "អ៊ុំ កុលរ៉េណែល"
        },
        {
            "barcode": "171107650",
            "dpc": "03031518801",
            "name": "អូច សម្បត្តិ"
        },
        {
            "barcode": "171107651",
            "dpc": "03031518901",
            "name": "ភូ ជុំតា"
        },
        {
            "barcode": "171107652",
            "dpc": "03031519001",
            "name": "ប៊ុន ណាក់"
        },
        {
            "barcode": "171107653",
            "dpc": "03031519101",
            "name": "ជុំ សៅហីណែត"
        },
        {
            "barcode": "171107654",
            "dpc": "03031519201",
            "name": "អោក ប៊ុនធឿន"
        },
        {
            "barcode": "171107655",
            "dpc": "03031519301",
            "name": "ទឹម បំរ៉ុង"
        },
        {
            "barcode": "171107656",
            "dpc": "03031519401",
            "name": "ឈឹម ប៊ុនឆន"
        },
        {
            "barcode": "171107657",
            "dpc": "03031519501",
            "name": "ធុង សាខន"
        },
        {
            "barcode": "171107658",
            "dpc": "03031519601",
            "name": "ឥន រ៉ាលីន"
        },
        {
            "barcode": "171107659",
            "dpc": "03031519701",
            "name": "កែវ សំអាន"
        },
        {
            "barcode": "171107660",
            "dpc": "03031519801",
            "name": "ដួង ភឿប"
        },
        {
            "barcode": "171107661",
            "dpc": "03031519901",
            "name": "កេត ចន្ទូ"
        },
        {
            "barcode": "171107662",
            "dpc": "03031520001",
            "name": "ស៊ុន ដារ៉ា"
        },
        {
            "barcode": "171107663",
            "dpc": "03031520101",
            "name": "កែម ចាន់ថុល"
        },
        {
            "barcode": "171107664",
            "dpc": "03031520201",
            "name": "នង ភីនាម"
        },
        {
            "barcode": "171107665",
            "dpc": "03031520601",
            "name": "ម៉ក់ ចំរើន"
        },
        {
            "barcode": "171107666",
            "dpc": "03031520701",
            "name": "សាន់ ឆប"
        },
        {
            "barcode": "171107667",
            "dpc": "03031520801",
            "name": "ឡុច លឿត"
        },
        {
            "barcode": "171107668",
            "dpc": "03031521001",
            "name": "ជា សាវឿន"
        },
        {
            "barcode": "171107669",
            "dpc": "03031521101",
            "name": "ហេង ស៊ីហា"
        },
        {
            "barcode": "171107670",
            "dpc": "03031521201",
            "name": "សែន សុភាព"
        },
        {
            "barcode": "171107671",
            "dpc": "03031526301",
            "name": "អ៊ុន សាខន"
        },
        {
            "barcode": "171107672",
            "dpc": "03031526401",
            "name": "មាស ឡុង"
        },
        {
            "barcode": "171107673",
            "dpc": "03031527101",
            "name": "ទុំ សុធាន"
        },
        {
            "barcode": "171107674",
            "dpc": "03031527001",
            "name": "នាង ស៊ីណា"
        },
        {
            "barcode": "171107675",
            "dpc": "03031526901",
            "name": "ញ៉ែម រ៉ែន"
        },
        {
            "barcode": "171107676",
            "dpc": "03031526701",
            "name": "វន ហ៊ីម"
        },
        {
            "barcode": "171107677",
            "dpc": "03031526801",
            "name": "យ៉ាត យឿន"
        },
        {
            "barcode": "171107678",
            "dpc": "03031526501",
            "name": "នុត ស្រីស្រស់"
        },
        {
            "barcode": "171107679",
            "dpc": "03031526601",
            "name": "ជន គឹមគ្រី"
        },
        {
            "barcode": "171107680",
            "dpc": "03031525901",
            "name": "ប៊ិន ថាវ"
        },
        {
            "barcode": "171107681",
            "dpc": "03031522101",
            "name": "សុខ ណារិទ្ធ"
        },
        {
            "barcode": "171107682",
            "dpc": "03031522001",
            "name": "គិត សុខូ"
        },
        {
            "barcode": "171107683",
            "dpc": "03031522201",
            "name": "កែវ សុភាព"
        },
        {
            "barcode": "171107684",
            "dpc": "03031522301",
            "name": "ចាន់ ហោល"
        },
        {
            "barcode": "171107685",
            "dpc": "03031522601",
            "name": "យូ ដេត"
        },
        {
            "barcode": "171107686",
            "dpc": "03031522801",
            "name": "កែវ ពិសិដ្ឋ"
        },
        {
            "barcode": "171107687",
            "dpc": "03031522701",
            "name": "លឹម ស៊ីណាត"
        },
        {
            "barcode": "171107688",
            "dpc": "03031522901",
            "name": "ដេត សាឃុន"
        },
        {
            "barcode": "171107689",
            "dpc": "03031523101",
            "name": "ឈឹម នូ"
        },
        {
            "barcode": "171107690",
            "dpc": "03031523201",
            "name": "ម៉ែន រដ្ឋា"
        },
        {
            "barcode": "171107691",
            "dpc": "03031523301",
            "name": "ញ៉ែម ប៊ុនសេង"
        },
        {
            "barcode": "171107692",
            "dpc": "03031523401",
            "name": "ថំ ហួរ"
        },
        {
            "barcode": "171107693",
            "dpc": "03031523501",
            "name": "គុជ ផាន់"
        },
        {
            "barcode": "171107694",
            "dpc": "03031523601",
            "name": "តែ ស៊ីណា"
        },
        {
            "barcode": "171107695",
            "dpc": "03031523801",
            "name": "តាំង ហួង"
        },
        {
            "barcode": "171107696",
            "dpc": "03031523901",
            "name": "ញិប សាវឿន"
        },
        {
            "barcode": "171107697",
            "dpc": "03031524001",
            "name": "ហេង វើន"
        },
        {
            "barcode": "171107698",
            "dpc": "03031524201",
            "name": "ចាន់ ហ៊ង"
        },
        {
            "barcode": "171107699",
            "dpc": "03031524301",
            "name": "ទេស ចន្ថា"
        },
        {
            "barcode": "171107700",
            "dpc": "03031524401",
            "name": "ប៉ែន តារា"
        },
        {
            "barcode": "171107701",
            "dpc": "03031524501",
            "name": "តេង ប៉ាន់"
        },
        {
            "barcode": "171107702",
            "dpc": "03031524601",
            "name": "ចិន មុំ"
        },
        {
            "barcode": "171107703",
            "dpc": "03031524701",
            "name": "លេខ វន"
        },
        {
            "barcode": "171107704",
            "dpc": "03031524801",
            "name": "មាស រិទ្ធ"
        },
        {
            "barcode": "171107705",
            "dpc": "03031524901",
            "name": "ម៉ាក ទន"
        },
        {
            "barcode": "171107706",
            "dpc": "03031525001",
            "name": "ថេ ដារ៉ា"
        },
        {
            "barcode": "171107707",
            "dpc": "03031525101",
            "name": "ចាន់ វណ្ណាលឿម"
        },
        {
            "barcode": "171107708",
            "dpc": "03031525201",
            "name": "ឡៃ គឹមឡេង"
        },
        {
            "barcode": "171107709",
            "dpc": "03031523001",
            "name": "អ៊ឹម សំអន"
        },
        {
            "barcode": "171107710",
            "dpc": "03031509101",
            "name": "ឡាប  អេង"
        },
        {
            "barcode": "171107711",
            "dpc": "03031521301",
            "name": "លី  ហ៊ាន"
        },
        {
            "barcode": "171107712",
            "dpc": "03031521401",
            "name": "ប៉ុក  ឈិត"
        },
        {
            "barcode": "171107713",
            "dpc": "03031521501",
            "name": "ឡុង  កឹមនី"
        },
        {
            "barcode": "171107714",
            "dpc": "03031521601",
            "name": "ម៉ី  វុន"
        },
        {
            "barcode": "171107715",
            "dpc": "03031521701",
            "name": "កំរិត  អូន"
        },
        {
            "barcode": "171107716",
            "dpc": "03031521801",
            "name": "ទេស  ហ៊ាញ"
        },
        {
            "barcode": "171107717",
            "dpc": "03031521901",
            "name": "ងួន  សុទ្ធី"
        },
        {
            "barcode": "171107718",
            "dpc": "03031525301",
            "name": "ប្រាក់  គឹមឡាយ"
        },
        {
            "barcode": "171107719",
            "dpc": "03031525801",
            "name": "រស  សុខុម"
        },
        {
            "barcode": "171107720",
            "dpc": "03031526001",
            "name": "ឌុច  យ៉េន"
        },
        {
            "barcode": "171107721",
            "dpc": "03031526201",
            "name": "សូត្រ  សុខសាន"
        },
        {
            "barcode": "171107722",
            "dpc": "03031529401",
            "name": "អ៊ឹម  វណ្ណី"
        },
        {
            "barcode": "171107723",
            "dpc": "03031529501",
            "name": "រ៉ម  សុវណ្ណ"
        },
        {
            "barcode": "171107724",
            "dpc": "03031531601",
            "name": "តាន់  សុខរ័ត្ន"
        },
        {
            "barcode": "171107725",
            "dpc": "03031540301",
            "name": "ទួន  ភឿន"
        },
        {
            "barcode": "171107726",
            "dpc": "03031540501",
            "name": "ជូរ  គង់"
        },
        {
            "barcode": "171107727",
            "dpc": "03031541001",
            "name": "ធៀម  ទ្រី"
        },
        {
            "barcode": "171107728",
            "dpc": "03031545001",
            "name": "នៅ  សែ"
        },
        {
            "barcode": "171107729",
            "dpc": "03031500101",
            "name": "ហេង គឹមនី"
        },
        {
            "barcode": "171107730",
            "dpc": "03031500201",
            "name": "សុខ ចាន់"
        },
        {
            "barcode": "171107731",
            "dpc": "03031500301",
            "name": "ស៊ឹម ម៉ារ៉ា"
        },
        {
            "barcode": "171107732",
            "dpc": "03031500401",
            "name": "សុង ហ៊ុងស៊ុយ"
        },
        {
            "barcode": "171107733",
            "dpc": "03031500501",
            "name": "ឡាយ កៅ"
        },
        {
            "barcode": "171107734",
            "dpc": "03031500601",
            "name": "ណាំ ហៃ"
        },
        {
            "barcode": "171107735",
            "dpc": "03031500701",
            "name": "លឹម ឈុនងៀង"
        },
        {
            "barcode": "171107736",
            "dpc": "03031500801",
            "name": "តែង តេង"
        },
        {
            "barcode": "171107737",
            "dpc": "03031500901",
            "name": "តាំង គុយម៉េង"
        },
        {
            "barcode": "171107738",
            "dpc": "03031501001",
            "name": "ម៉ម ណារេត"
        },
        {
            "barcode": "171107739",
            "dpc": "03031501501",
            "name": "ហួយ ចន្ធី"
        },
        {
            "barcode": "171107740",
            "dpc": "03031501401",
            "name": "តាំង កាំង ៣"
        },
        {
            "barcode": "171107741",
            "dpc": "03031501301",
            "name": "តាំង កាំង ២"
        },
        {
            "barcode": "171107742",
            "dpc": "03031501101",
            "name": "ប៉ាន់ យូសែ"
        },
        {
            "barcode": "171107743",
            "dpc": "03031501601",
            "name": "តាំង ម៉េងអាន"
        },
        {
            "barcode": "171107744",
            "dpc": "03031501701",
            "name": "ព្រាប សុខជា"
        },
        {
            "barcode": "171107745",
            "dpc": "03031501801",
            "name": "ឈុន  ចិន្តា"
        },
        {
            "barcode": "171107746",
            "dpc": "03031501901",
            "name": "ជូ  ហ្វឹង"
        },
        {
            "barcode": "171107747",
            "dpc": "03031502101",
            "name": "ហួត  អួង"
        },
        {
            "barcode": "171107748",
            "dpc": "03031502201",
            "name": "ណាំ  ទីវ"
        },
        {
            "barcode": "171107749",
            "dpc": "03031502301",
            "name": "សេង ចាន់ដាវុធ"
        },
        {
            "barcode": "171107750",
            "dpc": "03031502401",
            "name": "អ៊ិន  ឡា ១"
        },
        {
            "barcode": "171107751",
            "dpc": "03031502001",
            "name": "កុក  ឆេង ១"
        },
        {
            "barcode": "171107752",
            "dpc": "03031502501",
            "name": "យី  តុង"
        },
        {
            "barcode": "171107753",
            "dpc": "03031502601",
            "name": "ហេង ហុកលី"
        },
        {
            "barcode": "171107754",
            "dpc": "03031502701",
            "name": "អ៊ឹម  ឡុង"
        },
        {
            "barcode": "171107755",
            "dpc": "03031502801",
            "name": "ពេជ្រ  គឿន"
        },
        {
            "barcode": "171107756",
            "dpc": "03031502901",
            "name": "ទួន  សុខម៉េង"
        },
        {
            "barcode": "171107757",
            "dpc": "03031503101",
            "name": "កេង  សុខហេង"
        },
        {
            "barcode": "171107758",
            "dpc": "03031503201",
            "name": "ចែ  ទ្រី"
        },
        {
            "barcode": "171107759",
            "dpc": "03031503301",
            "name": "ខា  ជូ"
        },
        {
            "barcode": "171107760",
            "dpc": "03031503401",
            "name": "អៀង  ប៊ុនហៀង"
        },
        {
            "barcode": "171107761",
            "dpc": "03031503501",
            "name": "ប៉ា  ប៉េងលី"
        },
        {
            "barcode": "171107762",
            "dpc": "03031503601",
            "name": "អ៊ឹង  អេង"
        },
        {
            "barcode": "171107763",
            "dpc": "03031503701",
            "name": "សុខ  ណាល់"
        },
        {
            "barcode": "171107764",
            "dpc": "03031503801",
            "name": "ប៉េង  សុផល"
        },
        {
            "barcode": "171107765",
            "dpc": "03031504301",
            "name": "សុខ  ទ្រី"
        },
        {
            "barcode": "171109512",
            "dpc": "03031548001",
            "name": "ឆាយ គីមសាន"
        }
    ]
barcodes.forEach(function(bar){
  let customer=db.wb_customer.findOne({dpc:bar.dpc});
db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});