
let start=moment('2017-11-10').toDate();
let end=moment('2017-11-30').toDate();

let barcodes=
[
        {
            "barcode": "171104343",
            "dpc": "03042047901",
            "name": "ជួន វ៉ាន់លី"
        },
        {
            "barcode": "171104344",
            "dpc": "03042047801",
            "name": "ប៉ក់ ម៉ៅ"
        },
        {
            "barcode": "171104345",
            "dpc": "03042046701",
            "name": "យៀង ឃិត"
        },
        {
            "barcode": "171104346",
            "dpc": "03042046901",
            "name": "ឡោ ណងហេង"
        },
        {
            "barcode": "171104347",
            "dpc": "03042045301",
            "name": "គី លំអង"
        },
        {
            "barcode": "171104348",
            "dpc": "03042045201",
            "name": "ថោង ដានាប១"
        },
        {
            "barcode": "171104349",
            "dpc": "03042045101",
            "name": "ថោង ដានាប២"
        },
        {
            "barcode": "171104350",
            "dpc": "03042045001",
            "name": "អៀក ប៊ុនកើន"
        },
        {
            "barcode": "171104351",
            "dpc": "03042041201",
            "name": "ស៊ា លីវ"
        },
        {
            "barcode": "171104352",
            "dpc": "03042041301",
            "name": "ពៅ សាវើយ"
        },
        {
            "barcode": "171104353",
            "dpc": "03042041401",
            "name": "ឈឿន ទី"
        },
        {
            "barcode": "171104354",
            "dpc": "03042041501",
            "name": "ឌី ពៀច"
        },
        {
            "barcode": "171104355",
            "dpc": "03042041601",
            "name": "ផេង ធឿន"
        },
        {
            "barcode": "171104356",
            "dpc": "03042041701",
            "name": "អ៊ូរ គឹមហុក"
        },
        {
            "barcode": "171104357",
            "dpc": "03042041801",
            "name": "សាលាបឋមសិក្សាវត្តគរ"
        },
        {
            "barcode": "171104358",
            "dpc": "03042041901",
            "name": "វត្តគរ"
        },
        {
            "barcode": "171104359",
            "dpc": "03042043201",
            "name": "សៀ ទៀង"
        },
        {
            "barcode": "171104360",
            "dpc": "03042043301",
            "name": "អៀប គុយហួត"
        },
        {
            "barcode": "171104361",
            "dpc": "03042043401",
            "name": "ជា រួន"
        },
        {
            "barcode": "171104362",
            "dpc": "03042043501",
            "name": "អឿង ថាវី"
        },
        {
            "barcode": "171104363",
            "dpc": "03042043701",
            "name": "សយ សុវណ្ណ"
        },
        {
            "barcode": "171104364",
            "dpc": "03042043601",
            "name": "អឿង សុគន្ធ"
        },
        {
            "barcode": "171104365",
            "dpc": "03042043801",
            "name": "ឌុច ចំរើន"
        },
        {
            "barcode": "171104366",
            "dpc": "03042043901",
            "name": "មាឃ ឆវីវណ្ណ"
        },
        {
            "barcode": "171104367",
            "dpc": "03042044001",
            "name": "ហោ គឹមហួន"
        },
        {
            "barcode": "171104368",
            "dpc": "03042044101",
            "name": "អន ចរិយា"
        },
        {
            "barcode": "171104369",
            "dpc": "03042044201",
            "name": "អន សុខាវី"
        },
        {
            "barcode": "171104370",
            "dpc": "03042044301",
            "name": "ណាំ សុរឿង"
        },
        {
            "barcode": "171104371",
            "dpc": "03042044401",
            "name": "ជុំ រៀប"
        },
        {
            "barcode": "171104372",
            "dpc": "03042044901",
            "name": "ប៊ុន រឿង"
        },
        {
            "barcode": "171104373",
            "dpc": "03042044801",
            "name": "សាន ហឿន"
        },
        {
            "barcode": "171104374",
            "dpc": "03042044701",
            "name": "គុយ អោក"
        },
        {
            "barcode": "171104375",
            "dpc": "03042044601",
            "name": "ម៉ក់  រ៉ាត់"
        },
        {
            "barcode": "171104376",
            "dpc": "03042044501",
            "name": "ប៉ូ យៀត"
        },
        {
            "barcode": "171104377",
            "dpc": "03042043101",
            "name": "អ៊ុក ដារ៉ា"
        },
        {
            "barcode": "171104378",
            "dpc": "03042042901",
            "name": "ហ៊ួយ ស៊ុនថន"
        },
        {
            "barcode": "171104379",
            "dpc": "03042042801",
            "name": "យ៉ន យ៉ង់"
        },
        {
            "barcode": "171104380",
            "dpc": "03042042701",
            "name": "ឆែម រ៉ូ"
        },
        {
            "barcode": "171104381",
            "dpc": "03042042601",
            "name": "យ៉ា វីរៈ"
        },
        {
            "barcode": "171104382",
            "dpc": "03042042501",
            "name": "អ៊ឹង ហូវ"
        },
        {
            "barcode": "171104383",
            "dpc": "03042042401",
            "name": "អេង សាវ៉ាត"
        },
        {
            "barcode": "171104384",
            "dpc": "03042042301",
            "name": "ព្រំ ហ៊ន"
        },
        {
            "barcode": "171104385",
            "dpc": "03042042201",
            "name": "តូ ឈុនវៀង"
        },
        {
            "barcode": "171104386",
            "dpc": "03042042101",
            "name": "ងី ឆេងអៀង"
        },
        {
            "barcode": "171104387",
            "dpc": "03042042001",
            "name": "សេង សុធាវី"
        },
        {
            "barcode": "171104388",
            "dpc": "03042047501",
            "name": "ស៊ូ ណាវី"
        },
        {
            "barcode": "171104389",
            "dpc": "03042047401",
            "name": "ហៃ ប៊ុនឈួ"
        },
        {
            "barcode": "171104390",
            "dpc": "03042047301",
            "name": "អ៊ុត រ៉ុន"
        },
        {
            "barcode": "171104391",
            "dpc": "03042047201",
            "name": "អ៊ួន រ៉ុត"
        },
        {
            "barcode": "171104392",
            "dpc": "03042047101",
            "name": "បាន ប៉េងលី"
        },
        {
            "barcode": "171104393",
            "dpc": "03042047001",
            "name": "អ៊ឹង ឈៀង"
        },
        {
            "barcode": "171104394",
            "dpc": "03042046801",
            "name": "អៀម សំអាត"
        },
        {
            "barcode": "171104395",
            "dpc": "03042046601",
            "name": "ឃុន ភី"
        },
        {
            "barcode": "171104396",
            "dpc": "03042046501",
            "name": "សំ សុដារ៉ា"
        },
        {
            "barcode": "171104397",
            "dpc": "03042039701",
            "name": "គឹម សុផល"
        },
        {
            "barcode": "171104398",
            "dpc": "03042039901",
            "name": "ឆោម ឆុង"
        },
        {
            "barcode": "171104399",
            "dpc": "03042046401",
            "name": "យ៉ែម ចាន់តារ៉ា"
        },
        {
            "barcode": "171104400",
            "dpc": "03042046201",
            "name": "គង់ ដាវី"
        },
        {
            "barcode": "171104401",
            "dpc": "03042045701",
            "name": "ឯម ស៊ា"
        },
        {
            "barcode": "171104402",
            "dpc": "03042046101",
            "name": "សាញ់ សុភាព"
        },
        {
            "barcode": "171104403",
            "dpc": "03042045901",
            "name": "រិត កប"
        },
        {
            "barcode": "171104404",
            "dpc": "03042045801",
            "name": "ជ័យ ធីតា"
        },
        {
            "barcode": "171104405",
            "dpc": "03042045601",
            "name": "លុច គឿន"
        },
        {
            "barcode": "171104406",
            "dpc": "03042045501",
            "name": "ហោ សំប៊ុន"
        },
        {
            "barcode": "171104407",
            "dpc": "03042045401",
            "name": "ឈឹម សុវណ្ណ"
        },
        {
            "barcode": "171104408",
            "dpc": "03042041101",
            "name": "ថាច់ លី"
        },
        {
            "barcode": "171104409",
            "dpc": "03042040901",
            "name": "យស សុផាត"
        },
        {
            "barcode": "171104410",
            "dpc": "03042040801",
            "name": "ថោង វិចិត្រ"
        },
        {
            "barcode": "171104411",
            "dpc": "03042040701",
            "name": "ពៅ វណ្ណៈ"
        },
        {
            "barcode": "171104412",
            "dpc": "03042040601",
            "name": "សឺន សានសម្បត្តិ"
        },
        {
            "barcode": "171104413",
            "dpc": "03042040401",
            "name": "ទឹម ស្សី"
        },
        {
            "barcode": "171104414",
            "dpc": "03042040301",
            "name": "ថាច់ ធី"
        },
        {
            "barcode": "171104415",
            "dpc": "03042040101",
            "name": "សួស សុគន្ធី"
        },
        {
            "barcode": "171104416",
            "dpc": "03042040001",
            "name": "សំបូរ ផូ"
        },
        {
            "barcode": "171104417",
            "dpc": "03042038701",
            "name": "យិន យៀន"
        },
        {
            "barcode": "171104418",
            "dpc": "03042039301",
            "name": "លឹម  ណុន"
        },
        {
            "barcode": "171104419",
            "dpc": "03042039201",
            "name": "ម៉ិល  សាម៉េត"
        },
        {
            "barcode": "171104420",
            "dpc": "03042039401",
            "name": "អ៊ិត ដារ៉ា"
        },
        {
            "barcode": "171104421",
            "dpc": "03042039001",
            "name": "សៅ ឈុំ"
        },
        {
            "barcode": "171104422",
            "dpc": "03042038901",
            "name": "ជិន សល់"
        },
        {
            "barcode": "171104423",
            "dpc": "03042038601",
            "name": "ហុង ហៃ"
        },
        {
            "barcode": "171104424",
            "dpc": "03042038501",
            "name": "អៀង ធី"
        },
        {
            "barcode": "171104425",
            "dpc": "03042038401",
            "name": "គុល គុណ"
        },
        {
            "barcode": "171104426",
            "dpc": "03042038001",
            "name": "ឈិត ឆាយ"
        },
        {
            "barcode": "171104427",
            "dpc": "03042037901",
            "name": "ខឿន ភាន់"
        },
        {
            "barcode": "171104428",
            "dpc": "03042037801",
            "name": "អ៊ឹងចេង"
        },
        {
            "barcode": "171104429",
            "dpc": "03042037701",
            "name": "វត្តកណ្តឹង"
        },
        {
            "barcode": "171104430",
            "dpc": "03042028401",
            "name": "ធិន  ធួន"
        },
        {
            "barcode": "171104431",
            "dpc": "03042047701",
            "name": "ម៉ៅ  សុផុន"
        },
        {
            "barcode": "171104432",
            "dpc": "03042043001",
            "name": "ឡាត  សាវេត"
        },
        {
            "barcode": "171104433",
            "dpc": "03042038301",
            "name": "គឹម   ទៀង"
        },
        {
            "barcode": "171104434",
            "dpc": "03042037501",
            "name": "ទិន  សុផល"
        },
        {
            "barcode": "171104435",
            "dpc": "03042037401",
            "name": "អ៊ឹង  ប៉ូអាន"
        },
        {
            "barcode": "171104436",
            "dpc": "03042037301",
            "name": "ហូ  យកលីន"
        },
        {
            "barcode": "171104437",
            "dpc": "03042037201",
            "name": "ខឹម  ជីម"
        },
        {
            "barcode": "171104438",
            "dpc": "03042037101",
            "name": "លួង  នាង"
        },
        {
            "barcode": "171104439",
            "dpc": "03042037001",
            "name": "ងួន  ភី"
        },
        {
            "barcode": "171104440",
            "dpc": "03042036901",
            "name": "ឃឹម  ផេង"
        },
        {
            "barcode": "171104441",
            "dpc": "03042036801",
            "name": "ជី  សុខហ៊ាង"
        },
        {
            "barcode": "171104442",
            "dpc": "03042036601",
            "name": "ង៉ែត  ពិសិទ្ធ"
        },
        {
            "barcode": "171104443",
            "dpc": "03042036501",
            "name": "ហម  អារុន"
        },
        {
            "barcode": "171104444",
            "dpc": "03042036401",
            "name": "គិញ  សារុន"
        },
        {
            "barcode": "171104445",
            "dpc": "03042036301",
            "name": "កែវ  ចាន់ផល"
        },
        {
            "barcode": "171104446",
            "dpc": "03042036101",
            "name": "ព្រហ្ម  ប៊ុនណាវី"
        },
        {
            "barcode": "171104447",
            "dpc": "03042036001",
            "name": "ប៉ក់  សុងរិទ្ធិ"
        },
        {
            "barcode": "171104448",
            "dpc": "03042035701",
            "name": "ម៉េត  សុខុម"
        },
        {
            "barcode": "171104449",
            "dpc": "03042035401",
            "name": "ជា  សាង"
        },
        {
            "barcode": "171104450",
            "dpc": "03042035301",
            "name": "សំរិទ្ធ  សីលា"
        },
        {
            "barcode": "171104451",
            "dpc": "03042035201",
            "name": "គា  សឺន"
        },
        {
            "barcode": "171104452",
            "dpc": "03042035101",
            "name": "ថាន់  រដ្ឋា"
        },
        {
            "barcode": "171104453",
            "dpc": "03042034901",
            "name": "ប៊ុន  ថើន"
        },
        {
            "barcode": "171104454",
            "dpc": "03042034801",
            "name": "សេក សម្បត្តិ"
        },
        {
            "barcode": "171104455",
            "dpc": "03042034701",
            "name": "ត្រេង  វុទ្ធី"
        },
        {
            "barcode": "171104456",
            "dpc": "03042034501",
            "name": "សាន  ឧស្សា"
        },
        {
            "barcode": "171104457",
            "dpc": "03042034401",
            "name": "ញឹក  យឿង"
        },
        {
            "barcode": "171104458",
            "dpc": "03042034301",
            "name": "សុខ  ណាលីន"
        },
        {
            "barcode": "171104459",
            "dpc": "03042034201",
            "name": "មាស  នី"
        },
        {
            "barcode": "171104460",
            "dpc": "03042034101",
            "name": "សាំង  សាគួន"
        },
        {
            "barcode": "171104461",
            "dpc": "03042034001",
            "name": "យស  សារិទ្ធ"
        },
        {
            "barcode": "171104462",
            "dpc": "03042033901",
            "name": "ឆៃ  សុវណ្ណ"
        },
        {
            "barcode": "171104463",
            "dpc": "03042033801",
            "name": "អ៊ាង  ហេង"
        },
        {
            "barcode": "171104464",
            "dpc": "03042033701",
            "name": "អ៊ាង  លក្ខិណា"
        },
        {
            "barcode": "171104465",
            "dpc": "03042033601",
            "name": "កាន់  វិបុល"
        },
        {
            "barcode": "171104466",
            "dpc": "03042033501",
            "name": "ចាន់  សុខ"
        },
        {
            "barcode": "171104467",
            "dpc": "03042033101",
            "name": "រស់   វិន"
        },
        {
            "barcode": "171104468",
            "dpc": "03042033001",
            "name": "ចៅ  ហាវ"
        },
        {
            "barcode": "171104469",
            "dpc": "03042032901",
            "name": "អ៊ុក  ផាវណ្ណី"
        },
        {
            "barcode": "171104470",
            "dpc": "03042032801",
            "name": "តា   ឈួម"
        },
        {
            "barcode": "171104471",
            "dpc": "03042032701",
            "name": "គង់  សេរីវុធ"
        },
        {
            "barcode": "171104472",
            "dpc": "03042032501",
            "name": "អ៊ុក  ចាន់ថុល"
        },
        {
            "barcode": "171104473",
            "dpc": "03042032401",
            "name": "ញ៉ែម  កញ្ញា"
        },
        {
            "barcode": "171104474",
            "dpc": "03042032301",
            "name": "អ៊ុំ  សាម៉េត ២"
        },
        {
            "barcode": "171104475",
            "dpc": "03042032201",
            "name": "លិស  ពិសិទ្ធ"
        },
        {
            "barcode": "171104476",
            "dpc": "03042032101",
            "name": "ភេម  រឿត"
        },
        {
            "barcode": "171104477",
            "dpc": "03042032001",
            "name": "ភេម   សុខុម"
        },
        {
            "barcode": "171104478",
            "dpc": "03042031801",
            "name": "សឿន  ស៊ីម"
        },
        {
            "barcode": "171104479",
            "dpc": "03042031701",
            "name": "អ៊ុង  សុផល"
        },
        {
            "barcode": "171104480",
            "dpc": "03042031601",
            "name": "ឡត  សារ៉េត"
        },
        {
            "barcode": "171104481",
            "dpc": "03042031501",
            "name": "ឌុក  ពូល"
        },
        {
            "barcode": "171104482",
            "dpc": "03042031401",
            "name": "ទិត្យ  យង់"
        },
        {
            "barcode": "171104483",
            "dpc": "03042031301",
            "name": "ឈឹម  យ៉េង"
        },
        {
            "barcode": "171104484",
            "dpc": "03042031201",
            "name": "អ៊ុក  តែម"
        },
        {
            "barcode": "171104485",
            "dpc": "03042031101",
            "name": "វណ្ណ  មឿន"
        },
        {
            "barcode": "171104486",
            "dpc": "03042031001",
            "name": "សូ  សុគន្ធា"
        },
        {
            "barcode": "171104487",
            "dpc": "03042030901",
            "name": "គង់  គា"
        },
        {
            "barcode": "171104488",
            "dpc": "03042030801",
            "name": "ឆន  ឈៀង"
        },
        {
            "barcode": "171104489",
            "dpc": "03042030701",
            "name": "សំ  ភារុំ"
        },
        {
            "barcode": "171104490",
            "dpc": "03042030601",
            "name": "ចែម  សារិទ្ធ"
        },
        {
            "barcode": "171104491",
            "dpc": "03042030501",
            "name": "ឃុត  សំផុន"
        },
        {
            "barcode": "171104492",
            "dpc": "03042030401",
            "name": "ឡៅ  សុខា"
        },
        {
            "barcode": "171104493",
            "dpc": "03042030301",
            "name": "សួន  តាំង"
        },
        {
            "barcode": "171104494",
            "dpc": "03042030201",
            "name": "ព្រំ  គឹមឆេង"
        },
        {
            "barcode": "171104495",
            "dpc": "03042030001",
            "name": "សួស  សុភ័ក្រ ២"
        },
        {
            "barcode": "171104496",
            "dpc": "03042029901",
            "name": "ផេង  ឡូញ"
        },
        {
            "barcode": "171104497",
            "dpc": "03042029801",
            "name": "ហែម  អឿន"
        },
        {
            "barcode": "171104498",
            "dpc": "03042029701",
            "name": "ជឿន  ដេត"
        },
        {
            "barcode": "171104499",
            "dpc": "03042029601",
            "name": "ព្រុំ  រាសី"
        },
        {
            "barcode": "171104500",
            "dpc": "03042029501",
            "name": "ព្រុំ  សំអាង"
        },
        {
            "barcode": "171104501",
            "dpc": "03042029401",
            "name": "លឹម  សុផល"
        },
        {
            "barcode": "171104502",
            "dpc": "03042029301",
            "name": "ចក់  សុន"
        },
        {
            "barcode": "171104503",
            "dpc": "03042029201",
            "name": "ខ្លូត  ចំរ៉ាត់"
        },
        {
            "barcode": "171104504",
            "dpc": "03042029101",
            "name": "ឆោម  ឆាត់"
        },
        {
            "barcode": "171104505",
            "dpc": "03042029001",
            "name": "រ៉ែម  ណេង"
        },
        {
            "barcode": "171104506",
            "dpc": "03042028901",
            "name": "ឆោម  ឆូយ"
        },
        {
            "barcode": "171104507",
            "dpc": "03042019701",
            "name": "សេក  ឆក"
        },
        {
            "barcode": "171104508",
            "dpc": "03042019601",
            "name": "ណុប  អេង"
        },
        {
            "barcode": "171104509",
            "dpc": "03042019501",
            "name": "វ៉ាត  វីរៈ"
        },
        {
            "barcode": "171104510",
            "dpc": "03042019401",
            "name": "ប៊ិច  ប៊ុនធឿន"
        },
        {
            "barcode": "171104511",
            "dpc": "03042019201",
            "name": "ខៀវ  តារា"
        },
        {
            "barcode": "171104512",
            "dpc": "03042019101",
            "name": "ហេង  រតនា"
        },
        {
            "barcode": "171104513",
            "dpc": "03042018901",
            "name": "ម៉ម  សារឿន"
        },
        {
            "barcode": "171104514",
            "dpc": "03042018801",
            "name": "ងិន  សំអុន"
        },
        {
            "barcode": "171104515",
            "dpc": "03042018701",
            "name": "ហែម  ប៉ាច"
        },
        {
            "barcode": "171104516",
            "dpc": "03042018601",
            "name": "តិច  ជ្រិន"
        },
        {
            "barcode": "171104517",
            "dpc": "03042018501",
            "name": "ងួន  លាង"
        },
        {
            "barcode": "171104518",
            "dpc": "03042018401",
            "name": "ឃី  យ៉ា"
        },
        {
            "barcode": "171104519",
            "dpc": "03042018301",
            "name": "ហាក់   លាន"
        },
        {
            "barcode": "171104520",
            "dpc": "03042018201",
            "name": "តឹក  សំណាក់ ២"
        },
        {
            "barcode": "171104521",
            "dpc": "03042018101",
            "name": "តឹក  សំណាក់ ១"
        },
        {
            "barcode": "171104522",
            "dpc": "03042018001",
            "name": "ឈិន  សំណាង"
        },
        {
            "barcode": "171104523",
            "dpc": "03042017901",
            "name": "ប៊ុន  មុំ"
        },
        {
            "barcode": "171104524",
            "dpc": "03042017701",
            "name": "ម៉ាង  គឹមស៊ាន"
        },
        {
            "barcode": "171104525",
            "dpc": "03042017601",
            "name": "ឌី  សុវណ្ណ"
        },
        {
            "barcode": "171104526",
            "dpc": "03042017501",
            "name": "គង់  កុសល្យ"
        },
        {
            "barcode": "171104527",
            "dpc": "03042017401",
            "name": "អ៊ឹង  ផល្គុន"
        },
        {
            "barcode": "171104528",
            "dpc": "03042017201",
            "name": "ជាម  តេង"
        },
        {
            "barcode": "171104529",
            "dpc": "03042017101",
            "name": "ឡ  គឹមលន់"
        },
        {
            "barcode": "171104530",
            "dpc": "03042017001",
            "name": "ហឿន  ឌីន"
        },
        {
            "barcode": "171104531",
            "dpc": "03042016901",
            "name": "សេង  ផន"
        },
        {
            "barcode": "171104532",
            "dpc": "03042016801",
            "name": "នាង  វណ្ណះ"
        },
        {
            "barcode": "171104533",
            "dpc": "03042016701",
            "name": "ហួត  លីឆេង"
        },
        {
            "barcode": "171104534",
            "dpc": "03042016601",
            "name": "ជា  ចាន់ដា"
        },
        {
            "barcode": "171104535",
            "dpc": "03042016501",
            "name": "សំ  សុខុម"
        },
        {
            "barcode": "171104536",
            "dpc": "03042016401",
            "name": "ឈិត  ថា"
        },
        {
            "barcode": "171104537",
            "dpc": "03042016301",
            "name": "ម៉ម  សារឿន"
        },
        {
            "barcode": "171104538",
            "dpc": "03042016201",
            "name": "កែវ  សុផន"
        },
        {
            "barcode": "171104539",
            "dpc": "03042016101",
            "name": "អ៊ុំ  សុធិញ"
        },
        {
            "barcode": "171104540",
            "dpc": "03042016001",
            "name": "មិន  ថាវី"
        },
        {
            "barcode": "171104541",
            "dpc": "03042015901",
            "name": "ថាប់  ធឿន"
        },
        {
            "barcode": "171104542",
            "dpc": "03042015801",
            "name": "ជុំ  សុភាព"
        },
        {
            "barcode": "171104543",
            "dpc": "03042015701",
            "name": "ស្រី  ស៊្ររ"
        },
        {
            "barcode": "171104544",
            "dpc": "03042015301",
            "name": "គឹម  ណាវី"
        },
        {
            "barcode": "171104545",
            "dpc": "03042012401",
            "name": "សុខ  សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171104546",
            "dpc": "03042023801",
            "name": "សោម សោភា"
        },
        {
            "barcode": "171104547",
            "dpc": "03042023701",
            "name": "វ៉ាន់ សុធាវី"
        },
        {
            "barcode": "171104548",
            "dpc": "03042023601",
            "name": "ញ៉ែម វណ្ឌី"
        },
        {
            "barcode": "171104549",
            "dpc": "03042023501",
            "name": "សួង រ៉ា"
        },
        {
            "barcode": "171104550",
            "dpc": "03042023401",
            "name": "សោម សុមាលី"
        },
        {
            "barcode": "171104551",
            "dpc": "03042023301",
            "name": "ប៉ែន ឡឹង"
        },
        {
            "barcode": "171104552",
            "dpc": "03042023201",
            "name": "ប៊ុន ធឿន"
        },
        {
            "barcode": "171104553",
            "dpc": "03042023101",
            "name": "យូ សេងហ៊ាង"
        },
        {
            "barcode": "171104554",
            "dpc": "03042023001",
            "name": "កែវ សំ"
        },
        {
            "barcode": "171104555",
            "dpc": "03042022901",
            "name": "ជា ចំរ៉ុង"
        },
        {
            "barcode": "171104556",
            "dpc": "03042022801",
            "name": "សូ សយ"
        },
        {
            "barcode": "171104557",
            "dpc": "03042022701",
            "name": "មឿន មាន"
        },
        {
            "barcode": "171104558",
            "dpc": "03042022601",
            "name": "សំ ផល្លី"
        },
        {
            "barcode": "171104559",
            "dpc": "03042022501",
            "name": "ចក់ ពេជ្រ"
        },
        {
            "barcode": "171104560",
            "dpc": "03042022401",
            "name": "ស៊ូ សារិន"
        },
        {
            "barcode": "171104561",
            "dpc": "03042022301",
            "name": "ហួត លុយ"
        },
        {
            "barcode": "171104562",
            "dpc": "03042022201",
            "name": "សៀង ហេង"
        },
        {
            "barcode": "171104563",
            "dpc": "03042011101",
            "name": "ឈិន ឆេត"
        },
        {
            "barcode": "171104564",
            "dpc": "03042022101",
            "name": "វ៉ាត់ សុវណ្ណ"
        },
        {
            "barcode": "171104565",
            "dpc": "03042022001",
            "name": "សេង សុខា"
        },
        {
            "barcode": "171104566",
            "dpc": "03042021901",
            "name": "ប៉ែន វណ្ណា"
        },
        {
            "barcode": "171104567",
            "dpc": "03042021701",
            "name": "ប៉ាន់ ផល្លា"
        },
        {
            "barcode": "171104568",
            "dpc": "03042021601",
            "name": "សាញ់ ហួយ"
        },
        {
            "barcode": "171104569",
            "dpc": "03042021501",
            "name": "ឌួង សុខុន"
        },
        {
            "barcode": "171104570",
            "dpc": "03042021401",
            "name": "យស់ សោភា"
        },
        {
            "barcode": "171104571",
            "dpc": "03042021301",
            "name": "គឹម វុធ"
        },
        {
            "barcode": "171104572",
            "dpc": "03042021201",
            "name": "ចឹក ខឹម"
        },
        {
            "barcode": "171104573",
            "dpc": "03042021001",
            "name": "ថាត សារ៉េត"
        },
        {
            "barcode": "171104574",
            "dpc": "03042020901",
            "name": "ថៃ  ហេង"
        },
        {
            "barcode": "171104575",
            "dpc": "03042020801",
            "name": "ជា រស់"
        },
        {
            "barcode": "171104576",
            "dpc": "03042019001",
            "name": "អ៊ិត សុប៉ុញ"
        },
        {
            "barcode": "171104577",
            "dpc": "03042020701",
            "name": "ជីវ  ដឿន ២"
        },
        {
            "barcode": "171104578",
            "dpc": "03042020401",
            "name": "លឿង ស៊ីធួន"
        },
        {
            "barcode": "171104579",
            "dpc": "03042020301",
            "name": "សៀង គឹមយី"
        },
        {
            "barcode": "171104580",
            "dpc": "03042020201",
            "name": "អៀក កៀវ"
        },
        {
            "barcode": "171104581",
            "dpc": "03042020101",
            "name": "អ៊ុក ណង"
        },
        {
            "barcode": "171104582",
            "dpc": "03042020001",
            "name": "យឹម សុខា"
        },
        {
            "barcode": "171104583",
            "dpc": "03042019901",
            "name": "ចេង សុខគាង"
        },
        {
            "barcode": "171104584",
            "dpc": "03042019801",
            "name": "ស្សី សាង"
        },
        {
            "barcode": "171104585",
            "dpc": "03042035601",
            "name": "លីអើរ៉ុនស៊ីថាន់"
        },
        {
            "barcode": "171104586",
            "dpc": "03042035501",
            "name": "យស់ រតនា"
        },
        {
            "barcode": "171104587",
            "dpc": "03042015501",
            "name": "កុមារកំព្រារ"
        },
        {
            "barcode": "171104588",
            "dpc": "03042033401",
            "name": "នួន ណែម"
        },
        {
            "barcode": "171104589",
            "dpc": "03042033301",
            "name": "ប៉ាច សុគុណ្ណា"
        },
        {
            "barcode": "171104590",
            "dpc": "03042033201",
            "name": "ភូ សារឿន"
        },
        {
            "barcode": "171104591",
            "dpc": "03042015401",
            "name": "ទ្រី សុង"
        },
        {
            "barcode": "171104592",
            "dpc": "03042015201",
            "name": "អ៊ីវ ថន"
        },
        {
            "barcode": "171104593",
            "dpc": "03042015101",
            "name": "រ៉ាត់ ថាវី"
        },
        {
            "barcode": "171104594",
            "dpc": "03042015001",
            "name": "ឡេង ខាន់"
        },
        {
            "barcode": "171104595",
            "dpc": "03042014901",
            "name": "ឡាច សំអាន"
        },
        {
            "barcode": "171104596",
            "dpc": "03042014801",
            "name": "សុខ ប៊ុនធឿន"
        },
        {
            "barcode": "171104597",
            "dpc": "03042014701",
            "name": "អ៊ុក សំអ៊ុន"
        },
        {
            "barcode": "171104598",
            "dpc": "03042014601",
            "name": "ជា ស្រីទូច"
        },
        {
            "barcode": "171104599",
            "dpc": "03042014501",
            "name": "សៅ សំអុល"
        },
        {
            "barcode": "171104600",
            "dpc": "03042014401",
            "name": "ជា វ៉ាសាយ"
        },
        {
            "barcode": "171104601",
            "dpc": "03042014301",
            "name": "ជា ហ៊ាន"
        },
        {
            "barcode": "171104602",
            "dpc": "03042014201",
            "name": "ធឹង គឹមហេង"
        },
        {
            "barcode": "171104603",
            "dpc": "03042014101",
            "name": "តុល សុផាត"
        },
        {
            "barcode": "171104604",
            "dpc": "03042014001",
            "name": "ជឹម សុខា"
        },
        {
            "barcode": "171104605",
            "dpc": "03042013901",
            "name": "នង សារុន"
        },
        {
            "barcode": "171104606",
            "dpc": "03042013801",
            "name": "តុង គឹមជាង"
        },
        {
            "barcode": "171104607",
            "dpc": "03042013701",
            "name": "សាយ ផាត"
        },
        {
            "barcode": "171104608",
            "dpc": "03042013601",
            "name": "ភេទ សុផុន"
        },
        {
            "barcode": "171104609",
            "dpc": "03042013501",
            "name": "យិន ស៊ីណា"
        },
        {
            "barcode": "171104610",
            "dpc": "03042013401",
            "name": "ប្រាក់ សំបូរ"
        },
        {
            "barcode": "171104611",
            "dpc": "03042013301",
            "name": "រស់ វិសិទ្ធ"
        },
        {
            "barcode": "171104612",
            "dpc": "03042013101",
            "name": "ប៉ិច សុខចាន់"
        },
        {
            "barcode": "171104613",
            "dpc": "03042013001",
            "name": "សាត តារា"
        },
        {
            "barcode": "171104614",
            "dpc": "03042012901",
            "name": "លី ស្រីពៅ"
        },
        {
            "barcode": "171104615",
            "dpc": "03042012701",
            "name": "សេរី ចរិយា"
        },
        {
            "barcode": "171104616",
            "dpc": "03042012801",
            "name": "ឡេង សេងណា"
        },
        {
            "barcode": "171104617",
            "dpc": "03042011801",
            "name": "សឹង ថន"
        },
        {
            "barcode": "171104618",
            "dpc": "03042011901",
            "name": "ជឹម ដារ៉ារដ្ឋ"
        },
        {
            "barcode": "171104619",
            "dpc": "03042012001",
            "name": "គឹម ធីសោភ័ណ្ឌ"
        },
        {
            "barcode": "171104620",
            "dpc": "03042012101",
            "name": "អ៊ុក ស៊ុន"
        },
        {
            "barcode": "171104621",
            "dpc": "03042012201",
            "name": "ស៊ាង ហួត"
        },
        {
            "barcode": "171104622",
            "dpc": "03042012301",
            "name": "ប៉ែន ណាច"
        },
        {
            "barcode": "171104623",
            "dpc": "03042012501",
            "name": "ប៊ូ គង់"
        },
        {
            "barcode": "171104624",
            "dpc": "03042011401",
            "name": "ឈឹម ណារ៉ុង"
        },
        {
            "barcode": "171104625",
            "dpc": "03042011501",
            "name": "ស៊្រុន  គីមហុង"
        },
        {
            "barcode": "171104626",
            "dpc": "03042011701",
            "name": "វឹង ហាំង ២"
        },
        {
            "barcode": "171104627",
            "dpc": "03042011601",
            "name": "វឹង ហាំង ១"
        },
        {
            "barcode": "171104628",
            "dpc": "03042004501",
            "name": "ផន វណ្ណថា"
        },
        {
            "barcode": "171104629",
            "dpc": "03042004601",
            "name": "ឆោម រី"
        },
        {
            "barcode": "171104630",
            "dpc": "03042004701",
            "name": "ង៉ូវ ហួយ"
        },
        {
            "barcode": "171104631",
            "dpc": "03042004801",
            "name": "ឆុង ឆៃលី"
        },
        {
            "barcode": "171104632",
            "dpc": "03042004901",
            "name": "ប៊ុន ថុង"
        },
        {
            "barcode": "171104633",
            "dpc": "03042005001",
            "name": "តែ លី"
        },
        {
            "barcode": "171104634",
            "dpc": "03042005101",
            "name": "ហាក់ ឆៃលាង"
        },
        {
            "barcode": "171104635",
            "dpc": "03042005201",
            "name": "ហួរ  ឆុង"
        },
        {
            "barcode": "171104636",
            "dpc": "03042005401",
            "name": "កែវ សាវី"
        },
        {
            "barcode": "171104637",
            "dpc": "03042005501",
            "name": "ថេត លឿត"
        },
        {
            "barcode": "171104638",
            "dpc": "03042005701",
            "name": "អ៊ាប ម៉េងឡេង"
        },
        {
            "barcode": "171104639",
            "dpc": "03042005801",
            "name": "សរ សាវន"
        },
        {
            "barcode": "171104640",
            "dpc": "03042005901",
            "name": "អ៊ុយ ហោ"
        },
        {
            "barcode": "171104641",
            "dpc": "03042006001",
            "name": "ដែង  មករា"
        },
        {
            "barcode": "171104642",
            "dpc": "03042004001",
            "name": "ជឹម ភើយ"
        },
        {
            "barcode": "171104643",
            "dpc": "03042003901",
            "name": "គុជ នាង"
        },
        {
            "barcode": "171104644",
            "dpc": "03042003801",
            "name": "អ៊ិន សាម៉ុន"
        },
        {
            "barcode": "171104645",
            "dpc": "03042003701",
            "name": "ប៊ុន ម៉េង"
        },
        {
            "barcode": "171104646",
            "dpc": "03042003601",
            "name": "សុក កែន"
        },
        {
            "barcode": "171104647",
            "dpc": "03042003501",
            "name": "ទៀង សារ៉ន"
        },
        {
            "barcode": "171104648",
            "dpc": "03042003401",
            "name": "ភូ គឹមហ៊ុន"
        },
        {
            "barcode": "171104649",
            "dpc": "03042003301",
            "name": "ឆាន់ ជួយ"
        },
        {
            "barcode": "171104650",
            "dpc": "03042003101",
            "name": "ដាញ់ ស៊ឹម"
        },
        {
            "barcode": "171104651",
            "dpc": "03042006101",
            "name": "ប្រាក់ យឺន"
        },
        {
            "barcode": "171104652",
            "dpc": "03042006201",
            "name": "ម៉ែន ឃុន"
        },
        {
            "barcode": "171104653",
            "dpc": "03042007401",
            "name": "មៀច បាន"
        },
        {
            "barcode": "171104654",
            "dpc": "03042008401",
            "name": "បេន សាវុធ"
        },
        {
            "barcode": "171104655",
            "dpc": "03042008501",
            "name": "លាង សារ៉េន ២"
        },
        {
            "barcode": "171104656",
            "dpc": "03042008601",
            "name": "ស៊ុម តក់"
        },
        {
            "barcode": "171104657",
            "dpc": "03042008201",
            "name": "ឆាន់ ឌី ២"
        },
        {
            "barcode": "171104658",
            "dpc": "03042008301",
            "name": "ជឹម  ធាវី"
        },
        {
            "barcode": "171104659",
            "dpc": "03042007901",
            "name": "ឈឿម សុខា"
        },
        {
            "barcode": "171104660",
            "dpc": "03042008001",
            "name": "អ៊ូ ចិន"
        },
        {
            "barcode": "171104661",
            "dpc": "03042008101",
            "name": "ឆៃ  ឆិល"
        },
        {
            "barcode": "171104662",
            "dpc": "03042007801",
            "name": "អ៊ូច ឃ៊ីម"
        },
        {
            "barcode": "171104663",
            "dpc": "03042007701",
            "name": "ឆាន់ ឌី ៥"
        },
        {
            "barcode": "171104664",
            "dpc": "03042007601",
            "name": "ម៉ុន ម៉ុត"
        },
        {
            "barcode": "171104665",
            "dpc": "03042007301",
            "name": "ខាន់ សាវុធ"
        },
        {
            "barcode": "171104666",
            "dpc": "03042007201",
            "name": "ម៉ែន សួរ"
        },
        {
            "barcode": "171104667",
            "dpc": "03042007001",
            "name": "ស៊ុង  ឌីណា"
        },
        {
            "barcode": "171104668",
            "dpc": "03042006901",
            "name": "លន់ ស្រូយ"
        },
        {
            "barcode": "171104669",
            "dpc": "03042006801",
            "name": "ស្រេង ខុន"
        },
        {
            "barcode": "171104670",
            "dpc": "03042006601",
            "name": "គង់ ឌឺ"
        },
        {
            "barcode": "171104671",
            "dpc": "03042006501",
            "name": "ឡែក  តង"
        },
        {
            "barcode": "171104672",
            "dpc": "03042006401",
            "name": "អ៊ឹង នី"
        },
        {
            "barcode": "171104673",
            "dpc": "03042006301",
            "name": "ឆាន់ ឌី៧"
        },
        {
            "barcode": "171104674",
            "dpc": "03042011201",
            "name": "សៀង ឯមវិសាលរ៉ាស៊ី"
        },
        {
            "barcode": "171104675",
            "dpc": "03042010901",
            "name": "អ៊ុក ប្រុក"
        },
        {
            "barcode": "171104676",
            "dpc": "03042010801",
            "name": "គឹម វែង"
        },
        {
            "barcode": "171104677",
            "dpc": "03042010701",
            "name": "ស៊ិន ស៊ីណាន"
        },
        {
            "barcode": "171104678",
            "dpc": "03042010601",
            "name": "សៀង សង់ឯម"
        },
        {
            "barcode": "171104679",
            "dpc": "03042010501",
            "name": "សេង ហួត"
        },
        {
            "barcode": "171104680",
            "dpc": "03042010401",
            "name": "ហុក កុសល់"
        },
        {
            "barcode": "171104681",
            "dpc": "03042010301",
            "name": "កែវ ស៊ុន (លើ)"
        },
        {
            "barcode": "171104682",
            "dpc": "03042010201",
            "name": "កែវ ស៊ុន (មុខ)"
        },
        {
            "barcode": "171104683",
            "dpc": "03042010001",
            "name": "សោម កាឌុល"
        },
        {
            "barcode": "171104684",
            "dpc": "03042009801",
            "name": "ជុង ឈី"
        },
        {
            "barcode": "171104685",
            "dpc": "03042009501",
            "name": "លាង សារ៉េន"
        },
        {
            "barcode": "171104686",
            "dpc": "03042009101",
            "name": "កែវ សម្បត្តិ"
        },
        {
            "barcode": "171104687",
            "dpc": "03042009001",
            "name": "កេង ស្សី"
        },
        {
            "barcode": "171104688",
            "dpc": "03042008901",
            "name": "ស៊ុន ថេង"
        },
        {
            "barcode": "171104689",
            "dpc": "03042008801",
            "name": "លឹម ដារ៉ុង"
        },
        {
            "barcode": "171104690",
            "dpc": "03042008701",
            "name": "ឆាន់ ឌី ១"
        },
        {
            "barcode": "171104691",
            "dpc": "03042004401",
            "name": "ខេង សេដ្ឋា"
        },
        {
            "barcode": "171104692",
            "dpc": "03042004201",
            "name": "ឌុំ ធារ៉ាក់"
        },
        {
            "barcode": "171104693",
            "dpc": "03042028801",
            "name": "ឈួន គឹមហេង"
        },
        {
            "barcode": "171104694",
            "dpc": "03042028701",
            "name": "ឆេង ហឿន"
        },
        {
            "barcode": "171104695",
            "dpc": "03042028601",
            "name": "ស៊ឹម ឆេង"
        },
        {
            "barcode": "171104696",
            "dpc": "03042028501",
            "name": "ជា លី"
        },
        {
            "barcode": "171104697",
            "dpc": "03042028301",
            "name": "ក្រូច ថែន"
        },
        {
            "barcode": "171104698",
            "dpc": "03042028201",
            "name": "សួស សុភ័ក្រ"
        },
        {
            "barcode": "171104699",
            "dpc": "03042028101",
            "name": "គឹម ពន្លក"
        },
        {
            "barcode": "171104700",
            "dpc": "03042028001",
            "name": "មៀន បូ"
        },
        {
            "barcode": "171104701",
            "dpc": "03042027901",
            "name": "សោម សុផល"
        },
        {
            "barcode": "171104702",
            "dpc": "03042027801",
            "name": "អ៊ិន សែម"
        },
        {
            "barcode": "171104703",
            "dpc": "03042027701",
            "name": "ពិន សុវណ្ណ"
        },
        {
            "barcode": "171104704",
            "dpc": "03042027601",
            "name": "តាំង ជាទ្រី"
        },
        {
            "barcode": "171104705",
            "dpc": "03042027501",
            "name": "ស៊ុន ណារ៉េត"
        },
        {
            "barcode": "171104706",
            "dpc": "03042027401",
            "name": "ជូ ចាន់រិទ្ធ"
        },
        {
            "barcode": "171104707",
            "dpc": "03042027301",
            "name": "ហម ហ៊ន"
        },
        {
            "barcode": "171104708",
            "dpc": "03042027201",
            "name": "ឡាយ ហ៊ុំ"
        },
        {
            "barcode": "171104709",
            "dpc": "03042027101",
            "name": "វង្ស ខាន់"
        },
        {
            "barcode": "171104710",
            "dpc": "03042027001",
            "name": "ជា សុខា"
        },
        {
            "barcode": "171104711",
            "dpc": "03042026901",
            "name": "ពេជ្រ វណ្ណី"
        },
        {
            "barcode": "171104712",
            "dpc": "03042026801",
            "name": "យ៉ែម សិរីវត្ត"
        },
        {
            "barcode": "171104713",
            "dpc": "03042026701",
            "name": "ឆេង ឈួន"
        },
        {
            "barcode": "171104714",
            "dpc": "03042026601",
            "name": "សាំង ណារិន"
        },
        {
            "barcode": "171104715",
            "dpc": "03042026501",
            "name": "ប៉ាល់ ហូរ"
        },
        {
            "barcode": "171104716",
            "dpc": "03042026401",
            "name": "អ៊ុំ ប៉េងសុង"
        },
        {
            "barcode": "171104717",
            "dpc": "03042026301",
            "name": "ផេង រ៉ា"
        },
        {
            "barcode": "171104718",
            "dpc": "03042026201",
            "name": "សុខ ផុន"
        },
        {
            "barcode": "171104719",
            "dpc": "03042026101",
            "name": "ម៉ី សៅ"
        },
        {
            "barcode": "171104720",
            "dpc": "03042026001",
            "name": "ឡត សារ៉េត"
        },
        {
            "barcode": "171104721",
            "dpc": "03042025901",
            "name": "គង់ សុភ័ក្ត"
        },
        {
            "barcode": "171104722",
            "dpc": "03042025801",
            "name": "យង់ សាំងគីនី"
        },
        {
            "barcode": "171104723",
            "dpc": "03042025701",
            "name": "យិន  ថារី"
        },
        {
            "barcode": "171104724",
            "dpc": "03042025601",
            "name": "អ៊ុំ អែម"
        },
        {
            "barcode": "171104725",
            "dpc": "03042025501",
            "name": "អ៊ឹម ស្រីមុំ"
        },
        {
            "barcode": "171104726",
            "dpc": "03042025401",
            "name": "ស៊ូ ឃោ"
        },
        {
            "barcode": "171104727",
            "dpc": "03042025301",
            "name": "ឆាយ ឆេង"
        },
        {
            "barcode": "171104728",
            "dpc": "03042025201",
            "name": "ទន់ យឿន"
        },
        {
            "barcode": "171104729",
            "dpc": "03042025101",
            "name": "សាក់ លីន"
        },
        {
            "barcode": "171104730",
            "dpc": "03042024901",
            "name": "ជៀម ទុំ"
        },
        {
            "barcode": "171104731",
            "dpc": "03042024801",
            "name": "សួន សាវ៉េត"
        },
        {
            "barcode": "171104732",
            "dpc": "03042024701",
            "name": "អៀប រឿប"
        },
        {
            "barcode": "171104733",
            "dpc": "03042024601",
            "name": "នី សាវ៉ាត់"
        },
        {
            "barcode": "171104734",
            "dpc": "03042024501",
            "name": "ណៃ ព្រីឆា"
        },
        {
            "barcode": "171104735",
            "dpc": "03042024401",
            "name": "ហ៊ាន ប៉េងស្រ៊ុន"
        },
        {
            "barcode": "171104736",
            "dpc": "03042024301",
            "name": "សាន់ ខា"
        },
        {
            "barcode": "171104737",
            "dpc": "03042024201",
            "name": "ហែម ក្យូ"
        },
        {
            "barcode": "171104738",
            "dpc": "03042024101",
            "name": "ឡិច ឡេង"
        },
        {
            "barcode": "171104739",
            "dpc": "03042024001",
            "name": "ឆេង សេងហាក់"
        },
        {
            "barcode": "171104740",
            "dpc": "03042023901",
            "name": "ឆេង សុភាព"
        },
        {
            "barcode": "171104741",
            "dpc": "03042003001",
            "name": "រិទ្ធ គឹមឡាង"
        },
        {
            "barcode": "171104742",
            "dpc": "03042002901",
            "name": "សុខ ផល្លី"
        },
        {
            "barcode": "171104743",
            "dpc": "03042002801",
            "name": "ជា ចាន់ត្រា"
        },
        {
            "barcode": "171104744",
            "dpc": "03042002701",
            "name": "សុខ សារ៉ុម"
        },
        {
            "barcode": "171104745",
            "dpc": "03042002601",
            "name": "ឡម ស៊ីនឿន"
        },
        {
            "barcode": "171104746",
            "dpc": "03042002501",
            "name": "គង់ ពេជ្រ"
        },
        {
            "barcode": "171104747",
            "dpc": "03042002401",
            "name": "ហុង គឹមលាង"
        },
        {
            "barcode": "171104748",
            "dpc": "03042002301",
            "name": "ជួន  សួរ"
        },
        {
            "barcode": "171104749",
            "dpc": "03042002201",
            "name": "សុង កាំង"
        },
        {
            "barcode": "171104750",
            "dpc": "03042002101",
            "name": "ឈួង វណ្ណា"
        },
        {
            "barcode": "171104751",
            "dpc": "03042002001",
            "name": "សៀង ណារិទ្ធ"
        },
        {
            "barcode": "171104752",
            "dpc": "03042001901",
            "name": "យូ សារឿន"
        },
        {
            "barcode": "171104753",
            "dpc": "03042001801",
            "name": "លី សំបឿន"
        },
        {
            "barcode": "171104754",
            "dpc": "03042001701",
            "name": "អោគ គុណ"
        },
        {
            "barcode": "171104755",
            "dpc": "03042001601",
            "name": "សូរ ទូន"
        },
        {
            "barcode": "171104756",
            "dpc": "03042001501",
            "name": "សេង លក្ខិណា"
        },
        {
            "barcode": "171104757",
            "dpc": "03042001401",
            "name": "ឈុគ ចន្ថា"
        },
        {
            "barcode": "171104758",
            "dpc": "03042001301",
            "name": "ញ៉ែត ចយ"
        },
        {
            "barcode": "171104759",
            "dpc": "03042001201",
            "name": "ជិម ជំនិត"
        },
        {
            "barcode": "171104760",
            "dpc": "03042001101",
            "name": "ប៉ែន សារិន្ទ"
        },
        {
            "barcode": "171104761",
            "dpc": "03042001001",
            "name": "ឈឹម ឌឹម"
        },
        {
            "barcode": "171104762",
            "dpc": "03042000901",
            "name": "លាក់ លួម"
        },
        {
            "barcode": "171104763",
            "dpc": "03042000801",
            "name": "ឡុង សូផន"
        },
        {
            "barcode": "171104764",
            "dpc": "03042000701",
            "name": "ហូរ ភូរិន្ទ"
        },
        {
            "barcode": "171104765",
            "dpc": "03042000601",
            "name": "ផាត់ ណារុន"
        },
        {
            "barcode": "171104766",
            "dpc": "03042000401",
            "name": "អាហារដ្ឋានស្តាហ្វូត"
        },
        {
            "barcode": "171104767",
            "dpc": "03042000501",
            "name": "លី ភក្តី"
        },
        {
            "barcode": "171104768",
            "dpc": "03042000301",
            "name": "ជួប សុខុម"
        },
        {
            "barcode": "171104769",
            "dpc": "03042000101",
            "name": "លឿង រំចេក"
        },
        {
            "barcode": "171109516",
            "dpc": "03042048001",
            "name": "យុគន្ធរ្ធ សំបូរ១"
        }
    ]
 barcodes.forEach(function(bar){
   let customer=db.wb_customer.findOne({dpc:bar.dpc});
 db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
 });
