let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=
    [
        {
            "barcode": "BBWS180205008",
            "dpc": "03010140801",
            "name": "កែវ ឃឿន"
        },
        {
            "barcode": "BBWS180205009",
            "dpc": "03010140901",
            "name": "ប៊ូ ប៊ុនសត្ថា"
        },
        {
            "barcode": "BBWS180205010",
            "dpc": "03010141001",
            "name": "សេង ឈុនឡាយ"
        },
        {
            "barcode": "BBWS180205011",
            "dpc": "03010141101",
            "name": "ជា មន្នា"
        },
        {
            "barcode": "BBWS180205012",
            "dpc": "03010141201",
            "name": "ស្រី ប៊ុនម៉ា"
        },
        {
            "barcode": "BBWS180205013",
            "dpc": "03010141301",
            "name": "សេក ស៊ីនួន"
        },
        {
            "barcode": "BBWS180205014",
            "dpc": "03010141401",
            "name": "ពៅ ឌឿន"
        },
        {
            "barcode": "BBWS180205015",
            "dpc": "03010141501",
            "name": "សេក ធីតា"
        },
        {
            "barcode": "BBWS180205016",
            "dpc": "03010141601",
            "name": "ប៉ែន ធីតា"
        },
        {
            "barcode": "BBWS180205017",
            "dpc": "03010141701",
            "name": "ជិម ចិន្តា"
        },
        {
            "barcode": "BBWS180205018",
            "dpc": "03010141801",
            "name": "ជឹម រឿងរិឡ"
        },
        {
            "barcode": "BBWS180205019",
            "dpc": "03010141901",
            "name": "គឹម ចាន់ម៉ាលី"
        },
        {
            "barcode": "BBWS180205020",
            "dpc": "03010142401",
            "name": "ឡូត ហឿន"
        },
        {
            "barcode": "BBWS180205021",
            "dpc": "03010142201",
            "name": "ព្រំ សុផៃ"
        },
        {
            "barcode": "BBWS180205022",
            "dpc": "03010142301",
            "name": "ព្រំ សុផង់"
        },
        {
            "barcode": "BBWS180205023",
            "dpc": "03010142001",
            "name": "ប៊ុន ចាន់នី"
        },
        {
            "barcode": "BBWS180205024",
            "dpc": "03010142701",
            "name": "កែវ គឹមលី"
        },
        {
            "barcode": "BBWS180205025",
            "dpc": "03010142801",
            "name": "លឹម សូសាគុណ"
        },
        {
            "barcode": "BBWS180205026",
            "dpc": "03010142901",
            "name": "ហេង វុទ្ធី"
        },
        {
            "barcode": "BBWS180205027",
            "dpc": "03010143001",
            "name": "ប៉ោ ជិនជូ"
        },
        {
            "barcode": "BBWS180205028",
            "dpc": "03010143101",
            "name": "លឹម គៀវ"
        },
        {
            "barcode": "BBWS180205029",
            "dpc": "03010143201",
            "name": "ឱ សាអាល់"
        },
        {
            "barcode": "BBWS180205030",
            "dpc": "03010143301",
            "name": "ហួត ញ៉"
        },
        {
            "barcode": "BBWS180205031",
            "dpc": "03010143401",
            "name": "ហាវ អាន"
        },
        {
            "barcode": "BBWS180205032",
            "dpc": "03010143501",
            "name": "វ៉ា ស៊ីណា"
        },
        {
            "barcode": "BBWS180205033",
            "dpc": "03010143601",
            "name": "លី ហ៊ាង"
        },
        {
            "barcode": "BBWS180205034",
            "dpc": "03010143701",
            "name": "នូ សុខឃឿន"
        },
        {
            "barcode": "BBWS180205035",
            "dpc": "03010143801",
            "name": "នូ សុខខឿត"
        },
        {
            "barcode": "BBWS180205036",
            "dpc": "03010143901",
            "name": "នូ សុគន្ធ"
        },
        {
            "barcode": "BBWS180205037",
            "dpc": "03010144001",
            "name": "កែវ រិទ្ធ"
        },
        {
            "barcode": "BBWS180205038",
            "dpc": "03010144101",
            "name": "ដាំ សុធា"
        },
        {
            "barcode": "BBWS180205039",
            "dpc": "03010144201",
            "name": "សេក សោភ័ណ្ឌ"
        },
        {
            "barcode": "BBWS180205040",
            "dpc": "03010144301",
            "name": "ចៅ គឹមឡេង"
        },
        {
            "barcode": "BBWS180205041",
            "dpc": "03010144401",
            "name": "លឹម គឹមណា"
        },
        {
            "barcode": "BBWS180205042",
            "dpc": "03010144501",
            "name": "តាំង លឹម"
        },
        {
            "barcode": "BBWS180205043",
            "dpc": "03010144601",
            "name": "សោ ស្រីណុច"
        },
        {
            "barcode": "BBWS180205044",
            "dpc": "03010144701",
            "name": "លី យ៉ាន"
        },
        {
            "barcode": "BBWS180205045",
            "dpc": "03010144801",
            "name": "យ៉ាវ គង់"
        },
        {
            "barcode": "BBWS180205046",
            "dpc": "03010144901",
            "name": "ឯម សារិន"
        },
        {
            "barcode": "BBWS180205047",
            "dpc": "03010145001",
            "name": "លាង ហុង"
        },
        {
            "barcode": "BBWS180205048",
            "dpc": "03010145101",
            "name": "ប៉ាល់  កាណា"
        },
        {
            "barcode": "BBWS180205049",
            "dpc": "03010145201",
            "name": "យ៉ុម ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "BBWS180205050",
            "dpc": "03010145301",
            "name": "ស៊ីម ផល្លី"
        },
        {
            "barcode": "BBWS180205051",
            "dpc": "03010145401",
            "name": "ប្រាក សារី"
        },
        {
            "barcode": "BBWS180205052",
            "dpc": "03010145501",
            "name": "ស្រេង ស្រូន"
        },
        {
            "barcode": "BBWS180205053",
            "dpc": "03010145601",
            "name": "គឹម សូភី"
        },
        {
            "barcode": "BBWS180205054",
            "dpc": "03010145701",
            "name": "ដេង  ផល់"
        },
        {
            "barcode": "BBWS180205055",
            "dpc": "03010145801",
            "name": "ឈន សុភា ១"
        },
        {
            "barcode": "BBWS180205056",
            "dpc": "03010145901",
            "name": "ឈន សារឿន"
        },
        {
            "barcode": "BBWS180205057",
            "dpc": "03010146101",
            "name": "អង សំអយ"
        },
        {
            "barcode": "BBWS180205058",
            "dpc": "03010146201",
            "name": "ឈន សុភា ២"
        },
        {
            "barcode": "BBWS180205059",
            "dpc": "03010146301",
            "name": "ស៊ឹម សំណាង"
        },
        {
            "barcode": "BBWS180205060",
            "dpc": "03010146401",
            "name": "នាល ហ៊ិន"
        },
        {
            "barcode": "BBWS180205061",
            "dpc": "03010146501",
            "name": "សន សុង"
        },
        {
            "barcode": "BBWS180205062",
            "dpc": "03010146601",
            "name": "ចាន់ ធូ"
        },
        {
            "barcode": "BBWS180205063",
            "dpc": "03010146701",
            "name": "ហូ ង៉ា"
        },
        {
            "barcode": "BBWS180205064",
            "dpc": "03010146901",
            "name": "ញ៉ាន់ សុភិន"
        },
        {
            "barcode": "BBWS180205065",
            "dpc": "03010147101",
            "name": "កែន កន"
        },
        {
            "barcode": "BBWS180205066",
            "dpc": "03010142501",
            "name": "ក្រម សារឿយ"
        },
        {
            "barcode": "BBWS180205067",
            "dpc": "03010142601",
            "name": "ចន ធឿន"
        },
        {
            "barcode": "BBWS180205068",
            "dpc": "03010146801",
            "name": "អ៊ឹង សំបូរ"
        },
        {
            "barcode": "BBWS180205069",
            "dpc": "03010147201",
            "name": "សេង ថង"
        },
        {
            "barcode": "BBWS180205070",
            "dpc": "03010147301",
            "name": "សុង វណ្ណា"
        },
        {
            "barcode": "BBWS180205071",
            "dpc": "03010147401",
            "name": "លៀង អ៊ួច"
        },
        {
            "barcode": "BBWS180205072",
            "dpc": "03010147501",
            "name": "ស្រូច ម៉ៅ"
        },
        {
            "barcode": "BBWS180205073",
            "dpc": "03010147601",
            "name": "ស៊ុន មី"
        },
        {
            "barcode": "BBWS180205074",
            "dpc": "03010147801",
            "name": "សួស សារី"
        },
        {
            "barcode": "BBWS180205075",
            "dpc": "03010138901",
            "name": "នៅ សោភ័ណ្ឌ"
        },
        {
            "barcode": "BBWS180205076",
            "dpc": "03010139001",
            "name": "ហ៊ី គា"
        },
        {
            "barcode": "BBWS180205077",
            "dpc": "03010139101",
            "name": "ផែ អ៊ីវ"
        },
        {
            "barcode": "BBWS180205078",
            "dpc": "03010139201",
            "name": "ជឹម បូរ៉ា"
        },
        {
            "barcode": "BBWS180205079",
            "dpc": "03010139301",
            "name": "វង្ស លន់"
        },
        {
            "barcode": "BBWS180205080",
            "dpc": "03010139401",
            "name": "គឹម ហុង"
        },
        {
            "barcode": "BBWS180205081",
            "dpc": "03010139501",
            "name": "ងួន ចាន់ថន"
        },
        {
            "barcode": "BBWS180205082",
            "dpc": "03010139601",
            "name": "អឿន សារួន"
        },
        {
            "barcode": "BBWS180205083",
            "dpc": "03010139801",
            "name": "អឿន កែវ"
        },
        {
            "barcode": "BBWS180205084",
            "dpc": "03010139901",
            "name": "គួច   ជួ"
        },
        {
            "barcode": "BBWS180205085",
            "dpc": "03010140001",
            "name": "ឈឹម វណ្ណា"
        },
        {
            "barcode": "BBWS180205086",
            "dpc": "03010140101",
            "name": "ណ  លីណា"
        },
        {
            "barcode": "BBWS180205087",
            "dpc": "03010140201",
            "name": "ប្រាក់ សាមឿន"
        },
        {
            "barcode": "BBWS180205088",
            "dpc": "03010140301",
            "name": "លឿម ឡៃ"
        },
        {
            "barcode": "BBWS180205089",
            "dpc": "03010147701",
            "name": "រី សារ៉ាក់"
        },
        {
            "barcode": "BBWS180205090",
            "dpc": "03010147901",
            "name": "សេង សុរ័ត្ន"
        },
        {
            "barcode": "BBWS180205091",
            "dpc": "03010138701",
            "name": "ឈិន វណ្ណដា"
        },
        {
            "barcode": "BBWS180205092",
            "dpc": "03010138601",
            "name": "អ៊ិត   វើន"
        },
        {
            "barcode": "BBWS180205093",
            "dpc": "03010138401",
            "name": "ឱ សុភី"
        },
        {
            "barcode": "BBWS180205094",
            "dpc": "03010138301",
            "name": "ទេព វុទ្ធី"
        },
        {
            "barcode": "BBWS180205095",
            "dpc": "03010138201",
            "name": "ម៉ា ជា"
        },
        {
            "barcode": "BBWS180205096",
            "dpc": "03010138101",
            "name": "យក់ វ៉ាន់"
        },
        {
            "barcode": "BBWS180205097",
            "dpc": "03010138001",
            "name": "តូច សៀក"
        },
        {
            "barcode": "BBWS180205098",
            "dpc": "03010137901",
            "name": "ហែម បូរី"
        },
        {
            "barcode": "BBWS180205099",
            "dpc": "03010137801",
            "name": "នួន ចំរើន"
        },
        {
            "barcode": "BBWS180205100",
            "dpc": "03010137701",
            "name": "កា តិមួយ"
        },
        {
            "barcode": "BBWS180205101",
            "dpc": "03010135401",
            "name": "ស៊ីត ស្មាន់"
        },
        {
            "barcode": "BBWS180205102",
            "dpc": "03010135501",
            "name": "តា ក្រូច"
        },
        {
            "barcode": "BBWS180205103",
            "dpc": "03010135601",
            "name": "ងួន ហេង"
        },
        {
            "barcode": "BBWS180205104",
            "dpc": "03010135701",
            "name": "ឈឹម ម៉ាលី"
        },
        {
            "barcode": "BBWS180205105",
            "dpc": "03010135801",
            "name": "សុខ ស៊ីវង្ស"
        },
        {
            "barcode": "BBWS180205106",
            "dpc": "03010135901",
            "name": "កៅ សុខា"
        },
        {
            "barcode": "BBWS180205107",
            "dpc": "03010136001",
            "name": "សែម សារិន"
        },
        {
            "barcode": "BBWS180205108",
            "dpc": "03010136101",
            "name": "ស្រី វឿត"
        },
        {
            "barcode": "BBWS180205109",
            "dpc": "03010136201",
            "name": "កាំង ប៊ុនឡុង"
        },
        {
            "barcode": "BBWS180205110",
            "dpc": "03010136401",
            "name": "ឆន វណ្ណី"
        },
        {
            "barcode": "BBWS180205111",
            "dpc": "03010136501",
            "name": "ហេង ស្រីពៅ"
        },
        {
            "barcode": "BBWS180205112",
            "dpc": "03010136601",
            "name": "សំ សំអឿន"
        },
        {
            "barcode": "BBWS180205113",
            "dpc": "03010136701",
            "name": "ឆេង ឆិ"
        },
        {
            "barcode": "BBWS180205114",
            "dpc": "03010136801",
            "name": "សេង សាហ៊ីម១"
        },
        {
            "barcode": "BBWS180205115",
            "dpc": "03010136901",
            "name": "សេង សាហ៊ីម២"
        },
        {
            "barcode": "BBWS180205116",
            "dpc": "03010137101",
            "name": "អែម សុផល"
        },
        {
            "barcode": "BBWS180205117",
            "dpc": "03010137201",
            "name": "ហ៊ុល លី"
        },
        {
            "barcode": "BBWS180205118",
            "dpc": "03010137301",
            "name": "ហែន ផល្លា"
        },
        {
            "barcode": "BBWS180205119",
            "dpc": "03010137401",
            "name": "យិន សុវណ្ណរិទ្ធ"
        },
        {
            "barcode": "BBWS180205120",
            "dpc": "03010137501",
            "name": "ឆូត តង"
        },
        {
            "barcode": "BBWS180205121",
            "dpc": "03010137601",
            "name": "ចាន់​ ផា"
        },
        {
            "barcode": "BBWS180205122",
            "dpc": "03010118601",
            "name": "គឹម វេង២"
        },
        {
            "barcode": "BBWS180205123",
            "dpc": "03010146001",
            "name": "ឈួន ឈ"
        },
        {
            "barcode": "BBWS180205124",
            "dpc": "03010116301",
            "name": "ង៉ែត វុទ្ធី"
        },
        {
            "barcode": "BBWS180205125",
            "dpc": "03010116401",
            "name": "សេង សុផល ១"
        },
        {
            "barcode": "BBWS180205126",
            "dpc": "03010116501",
            "name": "សេង​ សុផល ២"
        },
        {
            "barcode": "BBWS180205127",
            "dpc": "03010114801",
            "name": "ឡាញ់ ផាន់ណេ"
        },
        {
            "barcode": "BBWS180205128",
            "dpc": "03010114901",
            "name": "ហ៊ុយ ភាជ"
        },
        {
            "barcode": "BBWS180205129",
            "dpc": "03010115101",
            "name": "តាំង សុង"
        },
        {
            "barcode": "BBWS180205130",
            "dpc": "03010115401",
            "name": "ប្រាក់ ថុង"
        },
        {
            "barcode": "BBWS180205131",
            "dpc": "03010115601",
            "name": "កែវ ឃឿង"
        },
        {
            "barcode": "BBWS180205132",
            "dpc": "03010115701",
            "name": "ជា វណ្ណៈ"
        },
        {
            "barcode": "BBWS180205133",
            "dpc": "03010115801",
            "name": "គង់ ជាង"
        },
        {
            "barcode": "BBWS180205134",
            "dpc": "03010115901",
            "name": "ឌុល ពេជ្រ"
        },
        {
            "barcode": "BBWS180205135",
            "dpc": "03010116001",
            "name": "ឈួន  ឈន"
        },
        {
            "barcode": "BBWS180205136",
            "dpc": "03010116101",
            "name": "ពិន   ទី"
        },
        {
            "barcode": "BBWS180205137",
            "dpc": "03010107701",
            "name": "ចាន់ សេង"
        },
        {
            "barcode": "BBWS180205138",
            "dpc": "03010107901",
            "name": "ភិន វុទ្ធី ២"
        },
        {
            "barcode": "BBWS180205139",
            "dpc": "03010108001",
            "name": "ម៉ៅ ម៉ន"
        },
        {
            "barcode": "BBWS180205140",
            "dpc": "03010108101",
            "name": "អេង ណាង"
        },
        {
            "barcode": "BBWS180205141",
            "dpc": "03010108201",
            "name": "លី គឹមសាន្ត"
        },
        {
            "barcode": "BBWS180205142",
            "dpc": "03010108301",
            "name": "ជៀម ជិន"
        },
        {
            "barcode": "BBWS180205143",
            "dpc": "03010108401",
            "name": "ហ៊ុយ ឈឿន"
        },
        {
            "barcode": "BBWS180205144",
            "dpc": "03010108501",
            "name": "ប៊ុន បឿន"
        },
        {
            "barcode": "BBWS180205145",
            "dpc": "03010108601",
            "name": "ខៀវ សំហាត"
        },
        {
            "barcode": "BBWS180205146",
            "dpc": "03010108701",
            "name": "ហាត់ ឡៃឡែ"
        },
        {
            "barcode": "BBWS180205147",
            "dpc": "03010108801",
            "name": "វ៉ឹង ហុង"
        },
        {
            "barcode": "BBWS180205148",
            "dpc": "03010108901",
            "name": "យឹម យីន"
        },
        {
            "barcode": "BBWS180205149",
            "dpc": "03010107801",
            "name": "ភិន វុទ្ធី ១"
        },
        {
            "barcode": "BBWS180205150",
            "dpc": "03010109001",
            "name": "សូ កិធិ"
        },
        {
            "barcode": "BBWS180205151",
            "dpc": "03010109101",
            "name": "ម៉ី វណ្ណារ៉េត"
        },
        {
            "barcode": "BBWS180205152",
            "dpc": "03010109201",
            "name": "សុក រ៉ិត"
        },
        {
            "barcode": "BBWS180205153",
            "dpc": "03010109301",
            "name": "ស្ងួន សុផល"
        },
        {
            "barcode": "BBWS180205154",
            "dpc": "03010109401",
            "name": "ផាយ សុភ័ក្រ"
        },
        {
            "barcode": "BBWS180205155",
            "dpc": "03010109501",
            "name": "ដែង ចន្ធូ"
        },
        {
            "barcode": "BBWS180205156",
            "dpc": "03010109601",
            "name": "តែ សេងហ៊ីម"
        },
        {
            "barcode": "BBWS180205157",
            "dpc": "03010109701",
            "name": "លាន បុប្ផា"
        },
        {
            "barcode": "BBWS180205158",
            "dpc": "03010109801",
            "name": "សេង វ៉ាស៊ីន"
        },
        {
            "barcode": "BBWS180205159",
            "dpc": "03010109901",
            "name": "ផែ សុខ"
        },
        {
            "barcode": "BBWS180205160",
            "dpc": "03010110101",
            "name": "អួន វុន ១"
        },
        {
            "barcode": "BBWS180205161",
            "dpc": "03010110201",
            "name": "អួន វុន ២"
        },
        {
            "barcode": "BBWS180205162",
            "dpc": "03010110301",
            "name": "អួន ផល្លី"
        },
        {
            "barcode": "BBWS180205163",
            "dpc": "03010110501",
            "name": "គុយ គឹមឈន"
        },
        {
            "barcode": "BBWS180205164",
            "dpc": "03010110801",
            "name": "គង ជិនហោ"
        },
        {
            "barcode": "BBWS180205165",
            "dpc": "03010110401",
            "name": "សុង គឹមលាភ"
        },
        {
            "barcode": "BBWS180205166",
            "dpc": "03010110601",
            "name": "ទុយ សិទ្ធ"
        },
        {
            "barcode": "BBWS180205167",
            "dpc": "03010110701",
            "name": "ហេង សុទីនី"
        },
        {
            "barcode": "BBWS180205168",
            "dpc": "03010121201",
            "name": "ខៀវ សែ"
        },
        {
            "barcode": "BBWS180205169",
            "dpc": "03010121301",
            "name": "ហម សំបូរ"
        },
        {
            "barcode": "BBWS180205170",
            "dpc": "03010121401",
            "name": "គឹម បូរិន"
        },
        {
            "barcode": "BBWS180205171",
            "dpc": "03010121601",
            "name": "សឿម ដៀប"
        },
        {
            "barcode": "BBWS180205172",
            "dpc": "03010121701",
            "name": "ហេង មាន"
        },
        {
            "barcode": "BBWS180205173",
            "dpc": "03010122201",
            "name": "លឹម គឹមអេង"
        },
        {
            "barcode": "BBWS180205174",
            "dpc": "03010122001",
            "name": "ម៉ក់ ណាគ្រី"
        },
        {
            "barcode": "BBWS180205175",
            "dpc": "03010122101",
            "name": "អ៊ឹង ធឹង"
        },
        {
            "barcode": "BBWS180205176",
            "dpc": "03010121801",
            "name": "លឿង សារ៉ុន"
        },
        {
            "barcode": "BBWS180205177",
            "dpc": "03010121901",
            "name": "ឆាំ សុខា"
        },
        {
            "barcode": "BBWS180205178",
            "dpc": "03010122301",
            "name": "សឿ រៀន"
        },
        {
            "barcode": "BBWS180205179",
            "dpc": "03010122401",
            "name": "សឿ រិទ្ធ"
        },
        {
            "barcode": "BBWS180205180",
            "dpc": "03010122501",
            "name": "ថឹក ម៉ៅ"
        },
        {
            "barcode": "BBWS180205181",
            "dpc": "03010122601",
            "name": "ចាន់ គារ"
        },
        {
            "barcode": "BBWS180205182",
            "dpc": "03010122901",
            "name": "ថង ដេក"
        },
        {
            "barcode": "BBWS180205183",
            "dpc": "03010123001",
            "name": "ចាយ  សារ៉ាន"
        },
        {
            "barcode": "BBWS180205184",
            "dpc": "03010123101",
            "name": "សោម សាមុត"
        },
        {
            "barcode": "BBWS180205185",
            "dpc": "03010123201",
            "name": "វ៉ាន់ រិទ្ធី"
        },
        {
            "barcode": "BBWS180205186",
            "dpc": "03010123301",
            "name": "ហេង ដាវុធ"
        },
        {
            "barcode": "BBWS180205187",
            "dpc": "03010123401",
            "name": "ឈុំ ឈួន"
        },
        {
            "barcode": "BBWS180205188",
            "dpc": "03010123501",
            "name": "សៅ ញិប"
        },
        {
            "barcode": "BBWS180205189",
            "dpc": "03010120201",
            "name": "កែ ខាន់ថន"
        },
        {
            "barcode": "BBWS180205190",
            "dpc": "03010120301",
            "name": "ជា យ៉ុង"
        },
        {
            "barcode": "BBWS180205191",
            "dpc": "03010120501",
            "name": "ឆាន់ កង"
        },
        {
            "barcode": "BBWS180205192",
            "dpc": "03010120601",
            "name": "លឹម សុវណ្ណរិទ្ធ"
        },
        {
            "barcode": "BBWS180205193",
            "dpc": "03010120701",
            "name": "ប្រាក់ សូដាវី"
        },
        {
            "barcode": "BBWS180205194",
            "dpc": "03010120801",
            "name": "ម៉ាត់ ផល្លី"
        },
        {
            "barcode": "BBWS180205195",
            "dpc": "03010120901",
            "name": "អ៊ុយ សារឿន"
        },
        {
            "barcode": "BBWS180205196",
            "dpc": "03010121001",
            "name": "ចាយ សារៀន"
        },
        {
            "barcode": "BBWS180205197",
            "dpc": "03010121101",
            "name": "យស់ យឿន"
        },
        {
            "barcode": "BBWS180205198",
            "dpc": "03010123601",
            "name": "កា រ៉េត"
        },
        {
            "barcode": "BBWS180205199",
            "dpc": "03010123701",
            "name": "ស៊ុន សុគន្ធា"
        },
        {
            "barcode": "BBWS180205200",
            "dpc": "03010123801",
            "name": "ឡេង រដ្ឋា"
        },
        {
            "barcode": "BBWS180205201",
            "dpc": "03010123901",
            "name": "យន់ ប្រម"
        },
        {
            "barcode": "BBWS180205202",
            "dpc": "03010124001",
            "name": "ម៉ឹង ម៉ៅ"
        },
        {
            "barcode": "BBWS180205203",
            "dpc": "03010124101",
            "name": "ជឹម ប៊ុនរ៉េត"
        },
        {
            "barcode": "BBWS180205204",
            "dpc": "03010124201",
            "name": "ជុក ជួម"
        },
        {
            "barcode": "BBWS180205205",
            "dpc": "03010124301",
            "name": "វ៉ាន់ ថា"
        },
        {
            "barcode": "BBWS180205206",
            "dpc": "03010124401",
            "name": "អោម ចាន់ថា"
        },
        {
            "barcode": "BBWS180205207",
            "dpc": "03010124501",
            "name": "ចាន់ ណៃ"
        },
        {
            "barcode": "BBWS180205208",
            "dpc": "03010124601",
            "name": "ផាន ថុល"
        },
        {
            "barcode": "BBWS180205209",
            "dpc": "03010124701",
            "name": "មាស កុសល"
        },
        {
            "barcode": "BBWS180205210",
            "dpc": "03010124801",
            "name": "ឡិ ប៊ុនលី"
        },
        {
            "barcode": "BBWS180205211",
            "dpc": "03010124901",
            "name": "ឆាន់ ឈី"
        },
        {
            "barcode": "BBWS180205212",
            "dpc": "03010125001",
            "name": "ឌិ  កុសល់"
        },
        {
            "barcode": "BBWS180205213",
            "dpc": "03010125101",
            "name": "ខ្លូត វ៉ាន់ឆៃ"
        },
        {
            "barcode": "BBWS180205214",
            "dpc": "03010125201",
            "name": "ភេម សុគុន"
        },
        {
            "barcode": "BBWS180205215",
            "dpc": "03010125301",
            "name": "សួស វ៉ាន់ថា"
        },
        {
            "barcode": "BBWS180205216",
            "dpc": "03010125401",
            "name": "ខៀវ សារី"
        },
        {
            "barcode": "BBWS180205217",
            "dpc": "03010125701",
            "name": "អ៊ីវ វ៉ាន់ដេត"
        },
        {
            "barcode": "BBWS180205218",
            "dpc": "03010125501",
            "name": "លឹម ហាក់ហេង"
        },
        {
            "barcode": "BBWS180205219",
            "dpc": "03010125801",
            "name": "ម៉ាន់ រ៉េត"
        },
        {
            "barcode": "BBWS180205220",
            "dpc": "03010125901",
            "name": "ហុក ជាល្លី"
        },
        {
            "barcode": "BBWS180205221",
            "dpc": "03010126001",
            "name": "គឹម ប៊ុនទិត"
        },
        {
            "barcode": "BBWS180205222",
            "dpc": "03010126201",
            "name": "គឹម ញិប"
        },
        {
            "barcode": "BBWS180205223",
            "dpc": "03010126301",
            "name": "លី រ៉ានី"
        },
        {
            "barcode": "BBWS180205224",
            "dpc": "03010126501",
            "name": "ស សុធិ"
        },
        {
            "barcode": "BBWS180205225",
            "dpc": "03010126601",
            "name": "ហៃ សាន"
        },
        {
            "barcode": "BBWS180205226",
            "dpc": "03010126701",
            "name": "ប៉ា ហឿន"
        },
        {
            "barcode": "BBWS180205227",
            "dpc": "03010126801",
            "name": "ស៊ីម អួន"
        },
        {
            "barcode": "BBWS180205228",
            "dpc": "03010126901",
            "name": "រើន នី"
        },
        {
            "barcode": "BBWS180205229",
            "dpc": "03010127001",
            "name": "លឹម ស៊ីចេង"
        },
        {
            "barcode": "BBWS180205230",
            "dpc": "03010127401",
            "name": "ខៃ សៃ"
        },
        {
            "barcode": "BBWS180205231",
            "dpc": "03010127501",
            "name": "ម៉ៅ ហួយ"
        },
        {
            "barcode": "BBWS180205232",
            "dpc": "03010127601",
            "name": "សាយ សូនី"
        },
        {
            "barcode": "BBWS180205233",
            "dpc": "03010103101",
            "name": "ប៊ុន ទូច"
        },
        {
            "barcode": "BBWS180205234",
            "dpc": "03010118701",
            "name": "ជា រៈវ៉ិត"
        },
        {
            "barcode": "BBWS180205235",
            "dpc": "03010118801",
            "name": "តាន់ ឃុនរដ្ឋា"
        },
        {
            "barcode": "BBWS180205236",
            "dpc": "03010119001",
            "name": "សុខ វី"
        },
        {
            "barcode": "BBWS180205237",
            "dpc": "03010119101",
            "name": "បេង សុវណ្ណ"
        },
        {
            "barcode": "BBWS180205238",
            "dpc": "03010119201",
            "name": "ឌិត វ៉ាន់ដន"
        },
        {
            "barcode": "BBWS180205239",
            "dpc": "03010119401",
            "name": "តាំង  ម៉េងអាន ១"
        },
        {
            "barcode": "BBWS180205240",
            "dpc": "03010119601",
            "name": "តាំង  ម៉េងអាន ២"
        },
        {
            "barcode": "BBWS180205241",
            "dpc": "03010119801",
            "name": "សាន បៀន"
        },
        {
            "barcode": "BBWS180205242",
            "dpc": "03010119901",
            "name": "ផា សុផាត"
        },
        {
            "barcode": "BBWS180205243",
            "dpc": "03010120001",
            "name": "ឃឹម សាខន"
        },
        {
            "barcode": "BBWS180205244",
            "dpc": "03010127701",
            "name": "វិញ ង៉ោស៊ី"
        },
        {
            "barcode": "BBWS180205245",
            "dpc": "03010127801",
            "name": "វ៉ាន់ ម៉ម"
        },
        {
            "barcode": "BBWS180205246",
            "dpc": "03010127901",
            "name": "ម៉ាន សុធា"
        },
        {
            "barcode": "BBWS180205247",
            "dpc": "03010128001",
            "name": "ង៉ែត ផេង"
        },
        {
            "barcode": "BBWS180205248",
            "dpc": "03010128101",
            "name": "មុយ ឡេង"
        },
        {
            "barcode": "BBWS180205249",
            "dpc": "03010128201",
            "name": "សាត វត្ថា"
        },
        {
            "barcode": "BBWS180205250",
            "dpc": "03010128301",
            "name": "ជា ប៊ុនលឿត"
        },
        {
            "barcode": "BBWS180205251",
            "dpc": "03010128501",
            "name": "ហ៊ិន ឃៀន"
        },
        {
            "barcode": "BBWS180205252",
            "dpc": "03010128601",
            "name": "គី ហៀង"
        },
        {
            "barcode": "BBWS180205253",
            "dpc": "03010128701",
            "name": "ម៉េង ហៀង"
        },
        {
            "barcode": "BBWS180205254",
            "dpc": "03010128801",
            "name": "ឆាយ  ហេង"
        },
        {
            "barcode": "BBWS180205255",
            "dpc": "03010128901",
            "name": "ចាប គួយ"
        },
        {
            "barcode": "BBWS180205256",
            "dpc": "03010129101",
            "name": "ជ រ៉ាឌី"
        },
        {
            "barcode": "BBWS180205257",
            "dpc": "03010129301",
            "name": "តាំង  សេង"
        },
        {
            "barcode": "BBWS180205258",
            "dpc": "03010129401",
            "name": "ឆាយ សុភ័ណ"
        },
        {
            "barcode": "BBWS180205259",
            "dpc": "03010129501",
            "name": "អ៊ុយ ម៉ាឡា"
        },
        {
            "barcode": "BBWS180205260",
            "dpc": "03010118201",
            "name": "ប៉ិច  កន្ទុយគោ"
        },
        {
            "barcode": "BBWS180205261",
            "dpc": "03010118301",
            "name": "ចៅ ឈឿង"
        },
        {
            "barcode": "BBWS180205262",
            "dpc": "03010118401",
            "name": "លី គឹមសៀន ១"
        },
        {
            "barcode": "BBWS180205263",
            "dpc": "03010118501",
            "name": "គឹម ថៃ"
        },
        {
            "barcode": "BBWS180205264",
            "dpc": "03010129601",
            "name": "ជា ផាត"
        },
        {
            "barcode": "BBWS180205265",
            "dpc": "03010129701",
            "name": "ហាក់ អេង"
        },
        {
            "barcode": "BBWS180205266",
            "dpc": "03010130001",
            "name": "សៀម ឡាយ"
        },
        {
            "barcode": "BBWS180205267",
            "dpc": "03010130101",
            "name": "ទុយ ទូច"
        },
        {
            "barcode": "BBWS180205268",
            "dpc": "03010130201",
            "name": "ផ្លឹង សំអឿន"
        },
        {
            "barcode": "BBWS180205269",
            "dpc": "03010130301",
            "name": "អ៊ុក  វណ្ណថា"
        },
        {
            "barcode": "BBWS180205270",
            "dpc": "03010130401",
            "name": "ចាន់ សុផល"
        },
        {
            "barcode": "BBWS180205271",
            "dpc": "03010130501",
            "name": "គា សង្វា"
        },
        {
            "barcode": "BBWS180205272",
            "dpc": "03010130601",
            "name": "ពក ហ៊ាន"
        },
        {
            "barcode": "BBWS180205273",
            "dpc": "03010130701",
            "name": "ហេង ណារិន"
        },
        {
            "barcode": "BBWS180205274",
            "dpc": "03010130801",
            "name": "ជ្រឹង ចាន់បូ"
        },
        {
            "barcode": "BBWS180205275",
            "dpc": "03010130901",
            "name": "អ៊ុយ សុផាត"
        },
        {
            "barcode": "BBWS180205276",
            "dpc": "03010131001",
            "name": "សន ស៊ន"
        },
        {
            "barcode": "BBWS180205277",
            "dpc": "03010131201",
            "name": "អៀប សេង"
        },
        {
            "barcode": "BBWS180205278",
            "dpc": "03010131301",
            "name": "អ៊ាប សុខឿន"
        },
        {
            "barcode": "BBWS180205279",
            "dpc": "03010131401",
            "name": "គឹម ស៊ុន"
        },
        {
            "barcode": "BBWS180205280",
            "dpc": "03010131501",
            "name": "ហៀក  ខ្លា"
        },
        {
            "barcode": "BBWS180205281",
            "dpc": "03010131601",
            "name": "ឡាំ ធីសុរិន"
        },
        {
            "barcode": "BBWS180205282",
            "dpc": "03010131701",
            "name": "យក់ អឿ"
        },
        {
            "barcode": "BBWS180205283",
            "dpc": "03010131801",
            "name": "វុន តូយ"
        },
        {
            "barcode": "BBWS180205284",
            "dpc": "03010131901",
            "name": "អ៊ុន សុខា"
        },
        {
            "barcode": "BBWS180205285",
            "dpc": "03010132001",
            "name": "ដួង ទូច"
        },
        {
            "barcode": "BBWS180205286",
            "dpc": "03010132101",
            "name": "ទី តូ"
        },
        {
            "barcode": "BBWS180205287",
            "dpc": "03010132201",
            "name": "ចិន យ៉ុង"
        },
        {
            "barcode": "BBWS180205288",
            "dpc": "03010132301",
            "name": "សល់ មិថុនា"
        },
        {
            "barcode": "BBWS180205289",
            "dpc": "03010132501",
            "name": "សេង យឿម"
        },
        {
            "barcode": "BBWS180205290",
            "dpc": "03010132601",
            "name": "សេង ឈុនឃី"
        },
        {
            "barcode": "BBWS180205291",
            "dpc": "03010132701",
            "name": "ដេត ថុល"
        },
        {
            "barcode": "BBWS180205292",
            "dpc": "03010132801",
            "name": "ម៉ៅ សុខ"
        },
        {
            "barcode": "BBWS180205293",
            "dpc": "03010132901",
            "name": "ហោ ប៉េងសៀង"
        },
        {
            "barcode": "BBWS180205294",
            "dpc": "03010133001",
            "name": "លឹម អូន"
        },
        {
            "barcode": "BBWS180205295",
            "dpc": "03010133101",
            "name": "ម៉ាត់ នៅ"
        },
        {
            "barcode": "BBWS180205296",
            "dpc": "03010133201",
            "name": "សុខ ស៊ីវង្ស"
        },
        {
            "barcode": "BBWS180205297",
            "dpc": "03010133301",
            "name": "អាង  ភាព"
        },
        {
            "barcode": "BBWS180205298",
            "dpc": "03010133401",
            "name": "ម៉ាន យ៉ុម"
        },
        {
            "barcode": "BBWS180205299",
            "dpc": "03010133501",
            "name": "ជា គឹមឡុង"
        },
        {
            "barcode": "BBWS180205300",
            "dpc": "03010133601",
            "name": "ជា សាប់"
        },
        {
            "barcode": "BBWS180205301",
            "dpc": "03010133701",
            "name": "អ៊ិត សុភាព"
        },
        {
            "barcode": "BBWS180205302",
            "dpc": "03010133801",
            "name": "គុន មុន្នី"
        },
        {
            "barcode": "BBWS180205303",
            "dpc": "03010133901",
            "name": "ហេង ថូ"
        },
        {
            "barcode": "BBWS180205304",
            "dpc": "03010134001",
            "name": "សំ សុខ"
        },
        {
            "barcode": "BBWS180205305",
            "dpc": "03010134101",
            "name": "គាន់ បូគង់"
        },
        {
            "barcode": "BBWS180205306",
            "dpc": "03010134301",
            "name": "គួយ តូ"
        },
        {
            "barcode": "BBWS180205307",
            "dpc": "03010134401",
            "name": "អែម សុផល"
        },
        {
            "barcode": "BBWS180205308",
            "dpc": "03010134501",
            "name": "ឈឹម សំអាត"
        },
        {
            "barcode": "BBWS180205309",
            "dpc": "03010134601",
            "name": "ហុក វន"
        },
        {
            "barcode": "BBWS180205310",
            "dpc": "03010134701",
            "name": "ខ្វែក ផាត់"
        },
        {
            "barcode": "BBWS180205311",
            "dpc": "03010134901",
            "name": "ឆេង គឹមណៃ"
        },
        {
            "barcode": "BBWS180205312",
            "dpc": "03010135001",
            "name": "កែង ស៊ីថា"
        },
        {
            "barcode": "BBWS180205313",
            "dpc": "03010135201",
            "name": "ធៀម ប៊ុនសែ"
        },
        {
            "barcode": "BBWS180205314",
            "dpc": "03010135301",
            "name": "ថៃ ស្រីពៅ"
        },
        {
            "barcode": "BBWS180205315",
            "dpc": "03010100101",
            "name": "វិន នល់"
        },
        {
            "barcode": "BBWS180205316",
            "dpc": "03010100201",
            "name": "ចៅ យ៉ាន់"
        },
        {
            "barcode": "BBWS180205317",
            "dpc": "03010100301",
            "name": "ចៅ ភិរម្យ"
        },
        {
            "barcode": "BBWS180205318",
            "dpc": "03010100401",
            "name": "សួង សុផល"
        },
        {
            "barcode": "BBWS180205319",
            "dpc": "03010100501",
            "name": "អឿ គឹមឈន"
        },
        {
            "barcode": "BBWS180205320",
            "dpc": "03010100601",
            "name": "អ៊ាប លឹមហុង"
        },
        {
            "barcode": "BBWS180205321",
            "dpc": "03010100701",
            "name": "ប៊ូ វ៉ាឡៃ"
        },
        {
            "barcode": "BBWS180205322",
            "dpc": "03010100801",
            "name": "យ៉ាន សាលី"
        },
        {
            "barcode": "BBWS180205323",
            "dpc": "03010100901",
            "name": "តុម ចាន់ផល្លា"
        },
        {
            "barcode": "BBWS180205324",
            "dpc": "03010101001",
            "name": "ជេត សាត"
        },
        {
            "barcode": "BBWS180205325",
            "dpc": "03010101101",
            "name": "នូវ ចាន់ដាវី"
        },
        {
            "barcode": "BBWS180205326",
            "dpc": "03010101201",
            "name": "គុយ គឹមផាន"
        },
        {
            "barcode": "BBWS180205327",
            "dpc": "03010101301",
            "name": "ស៊ីន ថ្លាង"
        },
        {
            "barcode": "BBWS180205328",
            "dpc": "03010101401",
            "name": "ស៊ីន ប៊ុណ្ណា"
        },
        {
            "barcode": "BBWS180205329",
            "dpc": "03010101501",
            "name": "យ៉ន បូរ៉ា"
        },
        {
            "barcode": "BBWS180205330",
            "dpc": "03010101601",
            "name": "ចៅ ចាន់"
        },
        {
            "barcode": "BBWS180205331",
            "dpc": "03010101701",
            "name": "ង៉ែត ប្រម"
        },
        {
            "barcode": "BBWS180205332",
            "dpc": "03010101801",
            "name": "ចាន់ មួយគា"
        },
        {
            "barcode": "BBWS180205333",
            "dpc": "03010101901",
            "name": "លឿង ស៊ីម"
        },
        {
            "barcode": "BBWS180205334",
            "dpc": "03010102001",
            "name": "ឆាត់ ឆាយឆដា"
        },
        {
            "barcode": "BBWS180205335",
            "dpc": "03010102101",
            "name": "សួ ប៊ុណ្ណារ៉ុង"
        },
        {
            "barcode": "BBWS180205336",
            "dpc": "03010102201",
            "name": "លី គឹមឃន ១"
        },
        {
            "barcode": "BBWS180205337",
            "dpc": "03010102301",
            "name": "ទឹម សុធិន"
        },
        {
            "barcode": "BBWS180205338",
            "dpc": "03010102401",
            "name": "លី គឹមឃន ២"
        },
        {
            "barcode": "BBWS180205339",
            "dpc": "03010102501",
            "name": "ប៊ុន រ៉ា"
        },
        {
            "barcode": "BBWS180205340",
            "dpc": "03010102601",
            "name": "ហួន សាយ"
        },
        {
            "barcode": "BBWS180205341",
            "dpc": "03010102801",
            "name": "សុន ជៀក"
        },
        {
            "barcode": "BBWS180205342",
            "dpc": "03010102901",
            "name": "សុខ ឃាង"
        },
        {
            "barcode": "BBWS180205343",
            "dpc": "03010103501",
            "name": "ហេង ចាន់ធា"
        },
        {
            "barcode": "BBWS180205344",
            "dpc": "03010103001",
            "name": "ឃុន ឡុង"
        },
        {
            "barcode": "BBWS180205345",
            "dpc": "03010103201",
            "name": "អួង សន"
        },
        {
            "barcode": "BBWS180205346",
            "dpc": "03010103301",
            "name": "ស៊ីន សំអាត"
        },
        {
            "barcode": "BBWS180205347",
            "dpc": "03010103401",
            "name": "សៀក ឌី"
        },
        {
            "barcode": "BBWS180205348",
            "dpc": "03010103701",
            "name": "ឈា កៀង"
        },
        {
            "barcode": "BBWS180205349",
            "dpc": "03010103801",
            "name": "អៀង វត្តី"
        },
        {
            "barcode": "BBWS180205350",
            "dpc": "03010103901",
            "name": "គុណ ណារី"
        },
        {
            "barcode": "BBWS180205351",
            "dpc": "03010104901",
            "name": "សាលាឃុំរតនៈ"
        },
        {
            "barcode": "BBWS180205352",
            "dpc": "03010104101",
            "name": "វង៉ ថាជឹង"
        },
        {
            "barcode": "BBWS180205353",
            "dpc": "03010104401",
            "name": "ប៊ុង ឡុង"
        },
        {
            "barcode": "BBWS180205354",
            "dpc": "03010104801",
            "name": "ឈឿង វ៉ាន់"
        },
        {
            "barcode": "BBWS180205355",
            "dpc": "03010104601",
            "name": "ខាត់ សារ៉ន"
        },
        {
            "barcode": "BBWS180205356",
            "dpc": "03010104701",
            "name": "ហែម គឹមហូរ"
        },
        {
            "barcode": "BBWS180205357",
            "dpc": "03010105001",
            "name": "សំ សារិន"
        },
        {
            "barcode": "BBWS180205358",
            "dpc": "03010105201",
            "name": "សល់ ហ៊ីង"
        },
        {
            "barcode": "BBWS180205359",
            "dpc": "03010105401",
            "name": "ចក់ សារឿម"
        },
        {
            "barcode": "BBWS180205360",
            "dpc": "03010105501",
            "name": "កែវ ចំរើន"
        },
        {
            "barcode": "BBWS180205361",
            "dpc": "03010105601",
            "name": "វណ្ណ វុទ្ធី"
        },
        {
            "barcode": "BBWS180205362",
            "dpc": "03010105701",
            "name": "ហ៊ុយ ផាន់ណា"
        },
        {
            "barcode": "BBWS180205363",
            "dpc": "03010105801",
            "name": "លឹម ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180205364",
            "dpc": "03010105901",
            "name": "លី សេងស្រួយ"
        },
        {
            "barcode": "BBWS180205365",
            "dpc": "03010106001",
            "name": "លី គក់"
        },
        {
            "barcode": "BBWS180205366",
            "dpc": "03010106101",
            "name": "ឈៀង តូ ១"
        },
        {
            "barcode": "BBWS180205367",
            "dpc": "03010106201",
            "name": "ឈៀង តូ ២"
        },
        {
            "barcode": "BBWS180205368",
            "dpc": "03010106401",
            "name": "អ៊ុក ផារី"
        },
        {
            "barcode": "BBWS180205369",
            "dpc": "03010106501",
            "name": "ឌុក សាវុធ"
        },
        {
            "barcode": "BBWS180205370",
            "dpc": "03010106601",
            "name": "សុក សំអ៊ុល"
        },
        {
            "barcode": "BBWS180205371",
            "dpc": "03010106701",
            "name": "ឌុក ស៊ីនួន"
        },
        {
            "barcode": "BBWS180205372",
            "dpc": "03010106801",
            "name": "ង៉ែត សារ៉ន"
        },
        {
            "barcode": "BBWS180205373",
            "dpc": "03010112301",
            "name": "ជឹង យូហួត"
        },
        {
            "barcode": "BBWS180205374",
            "dpc": "03010107201",
            "name": "ឡុង ម៉ាដា ៤"
        },
        {
            "barcode": "BBWS180205375",
            "dpc": "03010107101",
            "name": "ឡុង ម៉ាដា ៣"
        },
        {
            "barcode": "BBWS180205376",
            "dpc": "03010106901",
            "name": "ឡុង ម៉ាដា ១"
        },
        {
            "barcode": "BBWS180205377",
            "dpc": "03010111901",
            "name": "ឆាយ ហេង"
        },
        {
            "barcode": "BBWS180205378",
            "dpc": "03010114601",
            "name": "គឹម អាន ១"
        },
        {
            "barcode": "BBWS180205379",
            "dpc": "03010114701",
            "name": "ទេព វ៉ិត"
        },
        {
            "barcode": "BBWS180205380",
            "dpc": "03010114501",
            "name": "ម៉េង ហ៊ុយ"
        },
        {
            "barcode": "BBWS180205381",
            "dpc": "03010114401",
            "name": "ដើក តិចលី"
        },
        {
            "barcode": "BBWS180205382",
            "dpc": "03010114301",
            "name": "ប៊ូ បូរ៉ា"
        },
        {
            "barcode": "BBWS180205383",
            "dpc": "03010113901",
            "name": "ឡៅ ជីងហ៊ួរ"
        },
        {
            "barcode": "BBWS180205384",
            "dpc": "03010113301",
            "name": "ខៀវ ថោង"
        },
        {
            "barcode": "BBWS180205385",
            "dpc": "03010113101",
            "name": "តូ ដារ៉ា ២"
        },
        {
            "barcode": "BBWS180205386",
            "dpc": "03010113001",
            "name": "ធៀន រស់"
        },
        {
            "barcode": "BBWS180205387",
            "dpc": "03010112901",
            "name": "ហ៊ីម ចាន់ដារ៉ា"
        },
        {
            "barcode": "BBWS180205388",
            "dpc": "03010112801",
            "name": "ប៊ូយ ហ៊ីម"
        },
        {
            "barcode": "BBWS180205389",
            "dpc": "03010112701",
            "name": "គុជ ជ"
        },
        {
            "barcode": "BBWS180205390",
            "dpc": "03010112601",
            "name": "អ៊ុក ផលលឿន"
        },
        {
            "barcode": "BBWS180205391",
            "dpc": "03010112501",
            "name": "លី ម៉េង"
        },
        {
            "barcode": "BBWS180205392",
            "dpc": "03010112401",
            "name": "ហេង ម៉ៅ"
        },
        {
            "barcode": "BBWS180205393",
            "dpc": "03010112201",
            "name": "សុខ ឃីម"
        },
        {
            "barcode": "BBWS180205394",
            "dpc": "03010113401",
            "name": "សេង   លាភ"
        },
        {
            "barcode": "BBWS180205395",
            "dpc": "03010113501",
            "name": "រៀម  ផល្លី"
        },
        {
            "barcode": "BBWS180205396",
            "dpc": "03010113701",
            "name": "គឹម  សុផៃ"
        },
        {
            "barcode": "BBWS180205397",
            "dpc": "03010113801",
            "name": "ជួន  អៀន ១"
        },
        {
            "barcode": "BBWS180205398",
            "dpc": "03010114001",
            "name": "ប្លុង   សុផាន់ឌី"
        },
        {
            "barcode": "BBWS180205399",
            "dpc": "03010114101",
            "name": "ឈុន  សុផល"
        },
        {
            "barcode": "BBWS180205400",
            "dpc": "03010110901",
            "name": "ម៉េង ប៊ុនឡៃ"
        },
        {
            "barcode": "BBWS180205401",
            "dpc": "03010111001",
            "name": "ហ៊ុយ ចេន"
        },
        {
            "barcode": "BBWS180205402",
            "dpc": "03010111101",
            "name": "ម៉ៅ សារ៉ាត ១"
        },
        {
            "barcode": "BBWS180205403",
            "dpc": "03010111401",
            "name": "ផា ភាព"
        },
        {
            "barcode": "BBWS180205404",
            "dpc": "03010111301",
            "name": "ឡឹម ស៊ីម"
        },
        {
            "barcode": "BBWS180205405",
            "dpc": "03010111201",
            "name": "អន ប៊ុនឌឿន"
        },
        {
            "barcode": "BBWS180205406",
            "dpc": "03010111501",
            "name": "ពេជ្រ សុគន្ធ"
        },
        {
            "barcode": "BBWS180205407",
            "dpc": "03010111701",
            "name": "ថាប់ ចិន"
        },
        {
            "barcode": "BBWS180205408",
            "dpc": "03010111601",
            "name": "ម៉ៅ សារ៉ាត ២"
        },
        {
            "barcode": "BBWS180205409",
            "dpc": "03010112001",
            "name": "ជ្រឹង រី"
        },
        {
            "barcode": "BBWS180205410",
            "dpc": "03010111801",
            "name": "អ៊ូ សាវ៉ុង"
        },
        {
            "barcode": "BBWS180205411",
            "dpc": "03010139701",
            "name": "អឿន  សាវុន"
        },
        {
            "barcode": "BBWS180205412",
            "dpc": "03010116201",
            "name": "អេង  ធា"
        },
        {
            "barcode": "BBWS180205413",
            "dpc": "03010116601",
            "name": "ហៀង  សុធី"
        },
        {
            "barcode": "BBWS180205414",
            "dpc": "03010116701",
            "name": "គឹម  វេង"
        },
        {
            "barcode": "BBWS180205415",
            "dpc": "03010116801",
            "name": "ហៃ  លី"
        },
        {
            "barcode": "BBWS180205416",
            "dpc": "03010116901",
            "name": "ហ៊ុយ  យាន"
        },
        {
            "barcode": "BBWS180205417",
            "dpc": "03010117001",
            "name": "ឃុយ  ងី"
        },
        {
            "barcode": "BBWS180205418",
            "dpc": "03010117101",
            "name": "លី  គឹមស៊ា"
        },
        {
            "barcode": "BBWS180205419",
            "dpc": "03010117201",
            "name": "អ៊ឹម  តាន់យ៉ា"
        },
        {
            "barcode": "BBWS180205420",
            "dpc": "03010117301",
            "name": "ប៉ាល់ គឹមស៊ាង"
        },
        {
            "barcode": "BBWS180205421",
            "dpc": "03010117401",
            "name": "ជ្រា    ស្រីមុំ"
        },
        {
            "barcode": "BBWS180205422",
            "dpc": "03010117501",
            "name": "នូវ  ឈាងហ៊ត"
        },
        {
            "barcode": "BBWS180205423",
            "dpc": "03010117601",
            "name": "លឹម  ហេង"
        },
        {
            "barcode": "BBWS180205424",
            "dpc": "03010117701",
            "name": "សោម  យូអូន"
        },
        {
            "barcode": "BBWS180205425",
            "dpc": "03010117801",
            "name": "វង្ស   យូ"
        },
        {
            "barcode": "BBWS180205426",
            "dpc": "03010117901",
            "name": "នូ  ផល្លី"
        },
        {
            "barcode": "BBWS180205427",
            "dpc": "03010118001",
            "name": "ឌុក  វន្ថា"
        },
        {
            "barcode": "BBWS180205428",
            "dpc": "03010118901",
            "name": "ឆាយ  ហេង"
        },
        {
            "barcode": "BBWS180205429",
            "dpc": "03010119701",
            "name": "មូល  សុង"
        },
        {
            "barcode": "BBWS180205430",
            "dpc": "03010122701",
            "name": "គឹម   ប៉ូ"
        },
        {
            "barcode": "BBWS180205431",
            "dpc": "03010126401",
            "name": "ឈឹម  គឹមសៀង"
        },
        {
            "barcode": "BBWS180205432",
            "dpc": "03010127301",
            "name": "ស៊ិន  ឆោម"
        },
        {
            "barcode": "BBWS180205433",
            "dpc": "03010129001",
            "name": "គង់  ឃៀន"
        },
        {
            "barcode": "BBWS180205434",
            "dpc": "03010135101",
            "name": "រស់  សារ៉េត"
        },
        {
            "barcode": "BBWS180205435",
            "dpc": "03010137001",
            "name": "ហៀង   សុធី"
        },
        {
            "barcode": "BBWS180205436",
            "dpc": "03010140401",
            "name": "សុខ  សារឿន"
        },
        {
            "barcode": "BBWS180205437",
            "dpc": "03010140501",
            "name": "ឈឹន  ឆម"
        },
        {
            "barcode": "BBWS180205438",
            "dpc": "03010140601",
            "name": "ឈឹន  សុគន្ធា"
        },
        {
            "barcode": "BBWS180205439",
            "dpc": "03010148001",
            "name": "ជឹម ប៊ុនធឿន"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
