let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=
    [
        {
            "barcode": "BBWS180207196",
            "dpc": "03010239001",
            "name": "ថង សារ៉េត"
        },
        {
            "barcode": "BBWS180207197",
            "dpc": "03010213001",
            "name": "សុខ គុណរិទ្ធ"
        },
        {
            "barcode": "BBWS180207198",
            "dpc": "03010212701",
            "name": "អោម ផល្លា"
        },
        {
            "barcode": "BBWS180207199",
            "dpc": "03010212801",
            "name": "ទិត លីនដា ១"
        },
        {
            "barcode": "BBWS180207200",
            "dpc": "03010212901",
            "name": "ទិត សុខា ២"
        },
        {
            "barcode": "BBWS180207201",
            "dpc": "03010210501",
            "name": "វ៉ាន វង្ស"
        },
        {
            "barcode": "BBWS180207202",
            "dpc": "03010210601",
            "name": "ម៉ុង ចាន់សារ័ត្ន"
        },
        {
            "barcode": "BBWS180207203",
            "dpc": "03010210701",
            "name": "លាង ធារី"
        },
        {
            "barcode": "BBWS180207204",
            "dpc": "03010210801",
            "name": "ជា សរ"
        },
        {
            "barcode": "BBWS180207205",
            "dpc": "03010210901",
            "name": "សៅ ទេពសត្ថា"
        },
        {
            "barcode": "BBWS180207206",
            "dpc": "03010211001",
            "name": "អឿ ផាន"
        },
        {
            "barcode": "BBWS180207207",
            "dpc": "03010211501",
            "name": "ប៊ុត ធូ"
        },
        {
            "barcode": "BBWS180207208",
            "dpc": "03010211101",
            "name": "យស់ សំបឿន"
        },
        {
            "barcode": "BBWS180207209",
            "dpc": "03010211201",
            "name": "ឡាយ ផាន្នី"
        },
        {
            "barcode": "BBWS180207210",
            "dpc": "03010211301",
            "name": "ឃូន សុខខេង"
        },
        {
            "barcode": "BBWS180207211",
            "dpc": "03010211601",
            "name": "ពេជ្រ ណូរ៉ែម"
        },
        {
            "barcode": "BBWS180207212",
            "dpc": "03010211701",
            "name": "នាង ចន្ធី"
        },
        {
            "barcode": "BBWS180207213",
            "dpc": "03010211901",
            "name": "ប៊ុន គង់"
        },
        {
            "barcode": "BBWS180207214",
            "dpc": "03010212001",
            "name": "គួច ប៊ុនលី"
        },
        {
            "barcode": "BBWS180207215",
            "dpc": "03010212101",
            "name": "ស្រេង គឹមស្រេង"
        },
        {
            "barcode": "BBWS180207216",
            "dpc": "03010212301",
            "name": "ម៉ៅ មួន"
        },
        {
            "barcode": "BBWS180207217",
            "dpc": "03010212401",
            "name": "ស៊ឹម លឹម"
        },
        {
            "barcode": "BBWS180207218",
            "dpc": "03010212501",
            "name": "យៀវ យ៉ុត"
        },
        {
            "barcode": "BBWS180207219",
            "dpc": "03010212601",
            "name": "យិន ឡាំ"
        },
        {
            "barcode": "BBWS180207220",
            "dpc": "03010211801",
            "name": "កៅ សារ៉េត"
        },
        {
            "barcode": "BBWS180207221",
            "dpc": "03010212201",
            "name": "ឆេង ពៅ"
        },
        {
            "barcode": "BBWS180207222",
            "dpc": "03010209301",
            "name": "វង្ស វៀត"
        },
        {
            "barcode": "BBWS180207223",
            "dpc": "03010209401",
            "name": "ហួត សុហេង"
        },
        {
            "barcode": "BBWS180207224",
            "dpc": "03010209501",
            "name": "នេត សុវណ្ណ"
        },
        {
            "barcode": "BBWS180207225",
            "dpc": "03010209601",
            "name": "ឃុន ឧត្តម"
        },
        {
            "barcode": "BBWS180207226",
            "dpc": "03010209701",
            "name": "ត្រឹង ឆោម"
        },
        {
            "barcode": "BBWS180207227",
            "dpc": "03010209801",
            "name": "ត្រឹង ឆាយ"
        },
        {
            "barcode": "BBWS180207228",
            "dpc": "03010209901",
            "name": "វ៉ាន់ ឡុញ"
        },
        {
            "barcode": "BBWS180207229",
            "dpc": "03010210001",
            "name": "អាត់ រ៉ាឌី"
        },
        {
            "barcode": "BBWS180207230",
            "dpc": "03010210201",
            "name": "អ៊ិត ហៃ"
        },
        {
            "barcode": "BBWS180207231",
            "dpc": "03010210401",
            "name": "កើត យុថា"
        },
        {
            "barcode": "BBWS180207232",
            "dpc": "03010208801",
            "name": "អ៊ាន លី"
        },
        {
            "barcode": "BBWS180207233",
            "dpc": "03010208701",
            "name": "ងិន វ៉ារី"
        },
        {
            "barcode": "BBWS180207234",
            "dpc": "03010208501",
            "name": "ទូច វណ្ណា"
        },
        {
            "barcode": "BBWS180207235",
            "dpc": "03010209001",
            "name": "ហឿ លៀបឡេង"
        },
        {
            "barcode": "BBWS180207236",
            "dpc": "03010209101",
            "name": "ឆុង ហ៊ី"
        },
        {
            "barcode": "BBWS180207237",
            "dpc": "03010209201",
            "name": "ប៉ូ ខេងរ៉ន"
        },
        {
            "barcode": "BBWS180207238",
            "dpc": "03010204701",
            "name": "ហ៊ី ពិសិទ្ធ"
        },
        {
            "barcode": "BBWS180207239",
            "dpc": "03010204801",
            "name": "គី វៀត"
        },
        {
            "barcode": "BBWS180207240",
            "dpc": "03010205001",
            "name": "ស្រេង ហេង"
        },
        {
            "barcode": "BBWS180207241",
            "dpc": "03010205201",
            "name": "អ៊ាន រឿន"
        },
        {
            "barcode": "BBWS180207242",
            "dpc": "03010205301",
            "name": "គង់ សុខឃាង"
        },
        {
            "barcode": "BBWS180207243",
            "dpc": "03010205101",
            "name": "តូវ ហូវ"
        },
        {
            "barcode": "BBWS180207244",
            "dpc": "03010205401",
            "name": "ព្រំ សៀង"
        },
        {
            "barcode": "BBWS180207245",
            "dpc": "03010205501",
            "name": "សៀង សុផល"
        },
        {
            "barcode": "BBWS180207246",
            "dpc": "03010205601",
            "name": "សាម គា"
        },
        {
            "barcode": "BBWS180207247",
            "dpc": "03010208101",
            "name": "នួន សាន"
        },
        {
            "barcode": "BBWS180207248",
            "dpc": "03010208301",
            "name": "ម៉ៅ ម៉ន"
        },
        {
            "barcode": "BBWS180207249",
            "dpc": "03010208401",
            "name": "ហៀង ហាញ់"
        },
        {
            "barcode": "BBWS180207250",
            "dpc": "03010208601",
            "name": "ណុប សាម៉ន"
        },
        {
            "barcode": "BBWS180207251",
            "dpc": "03010207101",
            "name": "តូច អេង"
        },
        {
            "barcode": "BBWS180207252",
            "dpc": "03010207201",
            "name": "ស្រស់ សារ៉ុម"
        },
        {
            "barcode": "BBWS180207253",
            "dpc": "03010207301",
            "name": "ចាន់ ធឿន"
        },
        {
            "barcode": "BBWS180207254",
            "dpc": "03010207401",
            "name": "អឿន សារុន"
        },
        {
            "barcode": "BBWS180207255",
            "dpc": "03010207501",
            "name": "ចៅ ឈីវី"
        },
        {
            "barcode": "BBWS180207256",
            "dpc": "03010207601",
            "name": "ឃួន ឈាន"
        },
        {
            "barcode": "BBWS180207257",
            "dpc": "03010207701",
            "name": "លី សុផល"
        },
        {
            "barcode": "BBWS180207258",
            "dpc": "03010207801",
            "name": "ខាត់ បូរិន"
        },
        {
            "barcode": "BBWS180207259",
            "dpc": "03010207901",
            "name": "ឆាត់ ឆាត"
        },
        {
            "barcode": "BBWS180207260",
            "dpc": "03010208001",
            "name": "ប៉ា ប៊ុនហាង"
        },
        {
            "barcode": "BBWS180207261",
            "dpc": "03010205801",
            "name": "តាំង ឈាងហួរ"
        },
        {
            "barcode": "BBWS180207262",
            "dpc": "03010205701",
            "name": "ភន ជិន"
        },
        {
            "barcode": "BBWS180207263",
            "dpc": "03010206001",
            "name": "នួន ស្នា"
        },
        {
            "barcode": "BBWS180207264",
            "dpc": "03010205901",
            "name": "នាក ជា"
        },
        {
            "barcode": "BBWS180207265",
            "dpc": "03010206101",
            "name": "ឡុង សេរីវុឌ្ឍៈ"
        },
        {
            "barcode": "BBWS180207266",
            "dpc": "03010206201",
            "name": "ជាម ដារ៉ា"
        },
        {
            "barcode": "BBWS180207267",
            "dpc": "03010206301",
            "name": "ម្លប់ស្បូវម៉ាលី"
        },
        {
            "barcode": "BBWS180207268",
            "dpc": "03010206401",
            "name": "ម្លប់ ឆាត់"
        },
        {
            "barcode": "BBWS180207269",
            "dpc": "03010206501",
            "name": "ឆាយ ទូច"
        },
        {
            "barcode": "BBWS180207270",
            "dpc": "03010206601",
            "name": "សេង ហឺ"
        },
        {
            "barcode": "BBWS180207271",
            "dpc": "03010206701",
            "name": "ជយ ហាង"
        },
        {
            "barcode": "BBWS180207272",
            "dpc": "03010206801",
            "name": "ថ្លាង ថារេត"
        },
        {
            "barcode": "BBWS180207273",
            "dpc": "03010236201",
            "name": "ទី លីនដូ"
        },
        {
            "barcode": "BBWS180207274",
            "dpc": "03010236101",
            "name": "ម៉ៅ ង៉ាវ"
        },
        {
            "barcode": "BBWS180207275",
            "dpc": "03010235901",
            "name": "គង់ សារឿន"
        },
        {
            "barcode": "BBWS180207276",
            "dpc": "03010236001",
            "name": "ហោ ភិរុណ"
        },
        {
            "barcode": "BBWS180207277",
            "dpc": "03010231501",
            "name": "សូម កុសល"
        },
        {
            "barcode": "BBWS180207278",
            "dpc": "03010221001",
            "name": "ប៊ុត ធូ"
        },
        {
            "barcode": "BBWS180207279",
            "dpc": "03010220801",
            "name": "ឡុង វ៉ាង"
        },
        {
            "barcode": "BBWS180207280",
            "dpc": "03010220701",
            "name": "ស៊ុន ស៊ុយ"
        },
        {
            "barcode": "BBWS180207281",
            "dpc": "03010220601",
            "name": "លន ប៊ុនឈន"
        },
        {
            "barcode": "BBWS180207282",
            "dpc": "03010220501",
            "name": "ធូ ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180207283",
            "dpc": "03010220401",
            "name": "អេង ណារ៉ុង"
        },
        {
            "barcode": "BBWS180207284",
            "dpc": "03010220301",
            "name": "ខុង ខន"
        },
        {
            "barcode": "BBWS180207285",
            "dpc": "03010220201",
            "name": "ស៊ុន រ៉ន"
        },
        {
            "barcode": "BBWS180207286",
            "dpc": "03010220101",
            "name": "កែវ វាសនា"
        },
        {
            "barcode": "BBWS180207287",
            "dpc": "03010220001",
            "name": "ភេង អង"
        },
        {
            "barcode": "BBWS180207288",
            "dpc": "03010219901",
            "name": "សំរិត នូ"
        },
        {
            "barcode": "BBWS180207289",
            "dpc": "03010219801",
            "name": "ស៊ឹម អឿន"
        },
        {
            "barcode": "BBWS180207290",
            "dpc": "03010219701",
            "name": "ហេង កៅ"
        },
        {
            "barcode": "BBWS180207291",
            "dpc": "03010219601",
            "name": "សាន ហោ"
        },
        {
            "barcode": "BBWS180207292",
            "dpc": "03010219501",
            "name": "ស៊ិន ហេង"
        },
        {
            "barcode": "BBWS180207293",
            "dpc": "03010219401",
            "name": "ស គឹមប៉ូ"
        },
        {
            "barcode": "BBWS180207294",
            "dpc": "03010219301",
            "name": "ឈឿង គឹមសុង"
        },
        {
            "barcode": "BBWS180207295",
            "dpc": "03010219201",
            "name": "វ៉ាត ពង់"
        },
        {
            "barcode": "BBWS180207296",
            "dpc": "03010219101",
            "name": "ទេស មាន"
        },
        {
            "barcode": "BBWS180207297",
            "dpc": "03010219001",
            "name": "ទេស ស៊ី"
        },
        {
            "barcode": "BBWS180207298",
            "dpc": "03010218901",
            "name": "លឹម ស"
        },
        {
            "barcode": "BBWS180207299",
            "dpc": "03010218801",
            "name": "ចិន អមរា"
        },
        {
            "barcode": "BBWS180207300",
            "dpc": "03010218701",
            "name": "សាន់ ផាន់ណា"
        },
        {
            "barcode": "BBWS180207301",
            "dpc": "03010218601",
            "name": "សាំង លាភ"
        },
        {
            "barcode": "BBWS180207302",
            "dpc": "03010218501",
            "name": "គិត ឆដា"
        },
        {
            "barcode": "BBWS180207303",
            "dpc": "03010218401",
            "name": "ជូ តុប"
        },
        {
            "barcode": "BBWS180207304",
            "dpc": "03010218301",
            "name": "លឹម សារ៉ែម"
        },
        {
            "barcode": "BBWS180207305",
            "dpc": "03010218201",
            "name": "យ៉ម ចំរើន ៦"
        },
        {
            "barcode": "BBWS180207306",
            "dpc": "03010218101",
            "name": "ឈូក  វណ្ណស៊ី"
        },
        {
            "barcode": "BBWS180207307",
            "dpc": "03010218001",
            "name": "ចៅ ហ៊ាង"
        },
        {
            "barcode": "BBWS180207308",
            "dpc": "03010217901",
            "name": "ឡៃ ហ៊ាង"
        },
        {
            "barcode": "BBWS180207309",
            "dpc": "03010217801",
            "name": "អ៊ុង សុភាព"
        },
        {
            "barcode": "BBWS180207310",
            "dpc": "03010217701",
            "name": "ចាន់ អាយ"
        },
        {
            "barcode": "BBWS180207311",
            "dpc": "03010217501",
            "name": "វ៉ន ឌៀប"
        },
        {
            "barcode": "BBWS180207312",
            "dpc": "03010217401",
            "name": "វ៉ិន ចានថាយ"
        },
        {
            "barcode": "BBWS180207313",
            "dpc": "03010217301",
            "name": "វង្ស យិន"
        },
        {
            "barcode": "BBWS180207314",
            "dpc": "03010217201",
            "name": "ចិន យ៉ុម"
        },
        {
            "barcode": "BBWS180207315",
            "dpc": "03010217101",
            "name": "លឹម លីហឿប"
        },
        {
            "barcode": "BBWS180207316",
            "dpc": "03010217001",
            "name": "សុខ ស៊ីវង្ស"
        },
        {
            "barcode": "BBWS180207317",
            "dpc": "03010216901",
            "name": "ជាង ឡេង"
        },
        {
            "barcode": "BBWS180207318",
            "dpc": "03010216601",
            "name": "ហ៊ិន សំរេច"
        },
        {
            "barcode": "BBWS180207319",
            "dpc": "03010216501",
            "name": "អ៊ូច សុផល"
        },
        {
            "barcode": "BBWS180207320",
            "dpc": "03010216401",
            "name": "សេស សុខុម"
        },
        {
            "barcode": "BBWS180207321",
            "dpc": "03010216201",
            "name": "គឹម ជាតិ"
        },
        {
            "barcode": "BBWS180207322",
            "dpc": "03010216001",
            "name": "នាង ឯល"
        },
        {
            "barcode": "BBWS180207323",
            "dpc": "03010215901",
            "name": "សេង ស៊ន"
        },
        {
            "barcode": "BBWS180207324",
            "dpc": "03010215801",
            "name": "សុខ ធឿន"
        },
        {
            "barcode": "BBWS180207325",
            "dpc": "03010215701",
            "name": "គឹម សារ៉ន"
        },
        {
            "barcode": "BBWS180207326",
            "dpc": "03010215601",
            "name": "វង្ស ឡេង"
        },
        {
            "barcode": "BBWS180207327",
            "dpc": "03010215501",
            "name": "អៀង សុភៀង"
        },
        {
            "barcode": "BBWS180207328",
            "dpc": "03010215401",
            "name": "ឡេង មួយ"
        },
        {
            "barcode": "BBWS180207329",
            "dpc": "03010215301",
            "name": "អ៊ិន សេង"
        },
        {
            "barcode": "BBWS180207330",
            "dpc": "03010215201",
            "name": "នៅ ស៊ីយឿប"
        },
        {
            "barcode": "BBWS180207331",
            "dpc": "03010215001",
            "name": "ហួត  លី"
        },
        {
            "barcode": "BBWS180207332",
            "dpc": "03010214901",
            "name": "គឹម ចាន់ធូ"
        },
        {
            "barcode": "BBWS180207333",
            "dpc": "03010214801",
            "name": "ជៀម  ផារុំ"
        },
        {
            "barcode": "BBWS180207334",
            "dpc": "03010214701",
            "name": "គង់ ស៊ីណាត"
        },
        {
            "barcode": "BBWS180207335",
            "dpc": "03010214601",
            "name": "ទុយ ចិន្តា"
        },
        {
            "barcode": "BBWS180207336",
            "dpc": "03010214501",
            "name": "ផ្កាយ ភីណែ"
        },
        {
            "barcode": "BBWS180207337",
            "dpc": "03010214401",
            "name": "ហម ឆាយ"
        },
        {
            "barcode": "BBWS180207338",
            "dpc": "03010214301",
            "name": "ពុញ ឆៃ"
        },
        {
            "barcode": "BBWS180207339",
            "dpc": "03010214201",
            "name": "សឹង វិសាល"
        },
        {
            "barcode": "BBWS180207340",
            "dpc": "03010214101",
            "name": "ឆាយ អូន"
        },
        {
            "barcode": "BBWS180207341",
            "dpc": "03010214001",
            "name": "រស់ វិសិទ្ធ"
        },
        {
            "barcode": "BBWS180207342",
            "dpc": "03010213901",
            "name": "លឿង យីវ"
        },
        {
            "barcode": "BBWS180207343",
            "dpc": "03010213801",
            "name": "តន់ តូច"
        },
        {
            "barcode": "BBWS180207344",
            "dpc": "03010213701",
            "name": "អ៊ាង វុទ្ធី"
        },
        {
            "barcode": "BBWS180207345",
            "dpc": "03010213501",
            "name": "ដែង សុវណ្ណ"
        },
        {
            "barcode": "BBWS180207346",
            "dpc": "03010213401",
            "name": "អ៊ិន តាប់"
        },
        {
            "barcode": "BBWS180207347",
            "dpc": "03010213301",
            "name": "សេង យីវ"
        },
        {
            "barcode": "BBWS180207348",
            "dpc": "03010213201",
            "name": "លឹម អ៊ីនស្រ៊ុន"
        },
        {
            "barcode": "BBWS180207349",
            "dpc": "03010213101",
            "name": "ក ហេង"
        },
        {
            "barcode": "BBWS180207350",
            "dpc": "03010222501",
            "name": "តាំង ឡូយ"
        },
        {
            "barcode": "BBWS180207351",
            "dpc": "03010222201",
            "name": "អ៊ាប ជីម៉ាន់"
        },
        {
            "barcode": "BBWS180207352",
            "dpc": "03010221901",
            "name": "ញ៉ិល  ច្រិច"
        },
        {
            "barcode": "BBWS180207353",
            "dpc": "03010222101",
            "name": "កៅ ស៊ាន"
        },
        {
            "barcode": "BBWS180207354",
            "dpc": "03010221701",
            "name": "ខា ខូយ"
        },
        {
            "barcode": "BBWS180207355",
            "dpc": "03010221801",
            "name": "ស៊ុត សឿង"
        },
        {
            "barcode": "BBWS180207356",
            "dpc": "03010221601",
            "name": "ប៊ុន ហៀង"
        },
        {
            "barcode": "BBWS180207357",
            "dpc": "03010221501",
            "name": "ប៊ុន លាង"
        },
        {
            "barcode": "BBWS180207358",
            "dpc": "03010221401",
            "name": "ឈុន លី"
        },
        {
            "barcode": "BBWS180207359",
            "dpc": "03010221201",
            "name": "ទូច  ញិប"
        },
        {
            "barcode": "BBWS180207360",
            "dpc": "03010221101",
            "name": "សុខ ហេង"
        },
        {
            "barcode": "BBWS180207361",
            "dpc": "03010222601",
            "name": "ខឹម ស៊ីផាត"
        },
        {
            "barcode": "BBWS180207362",
            "dpc": "03010222701",
            "name": "ស៊ុយ សាវុធ"
        },
        {
            "barcode": "BBWS180207363",
            "dpc": "03010222901",
            "name": "ឃួយ  ស៊ីម៉ុង"
        },
        {
            "barcode": "BBWS180207364",
            "dpc": "03010223101",
            "name": "ពី ឈន"
        },
        {
            "barcode": "BBWS180207365",
            "dpc": "03010223501",
            "name": "ព្រាប ផន"
        },
        {
            "barcode": "BBWS180207366",
            "dpc": "03010223301",
            "name": "សុង រ៉ាវាល់ពិនឌី"
        },
        {
            "barcode": "BBWS180207367",
            "dpc": "03010223201",
            "name": "រ៉ុង សាឌីន"
        },
        {
            "barcode": "BBWS180207368",
            "dpc": "03010223601",
            "name": "វ៉ាន សុខុម"
        },
        {
            "barcode": "BBWS180207369",
            "dpc": "03010223401",
            "name": "អ៊ួន សុក"
        },
        {
            "barcode": "BBWS180207370",
            "dpc": "03010223701",
            "name": "ប៉ែន រដ្ឋា"
        },
        {
            "barcode": "BBWS180207371",
            "dpc": "03010223801",
            "name": "ពេជ្រ តុង"
        },
        {
            "barcode": "BBWS180207372",
            "dpc": "03010223901",
            "name": "ប៉ិច ដារ៉ារិទ្ធ"
        },
        {
            "barcode": "BBWS180207373",
            "dpc": "03010224001",
            "name": "ញ៉ែម យ៉ានី"
        },
        {
            "barcode": "BBWS180207374",
            "dpc": "03010224101",
            "name": "កាំង ឈីវឃៀម"
        },
        {
            "barcode": "BBWS180207375",
            "dpc": "03010224301",
            "name": "ជា បូ"
        },
        {
            "barcode": "BBWS180207376",
            "dpc": "03010224401",
            "name": "ហ៊ាង ប៊ុនហុក"
        },
        {
            "barcode": "BBWS180207377",
            "dpc": "03010224701",
            "name": "ទិស្នាក់ការ"
        },
        {
            "barcode": "BBWS180207378",
            "dpc": "03010224801",
            "name": "ហេង មន្នីចិន្តា"
        },
        {
            "barcode": "BBWS180207379",
            "dpc": "03010224901",
            "name": "យ៉ម ចំរើន ៣"
        },
        {
            "barcode": "BBWS180207380",
            "dpc": "03010225001",
            "name": "យ៉ម ចំរើន ៥"
        },
        {
            "barcode": "BBWS180207381",
            "dpc": "03010225101",
            "name": "សឿន សុភី"
        },
        {
            "barcode": "BBWS180207382",
            "dpc": "03010225201",
            "name": "អ៊ឹង សារី"
        },
        {
            "barcode": "BBWS180207383",
            "dpc": "03010225301",
            "name": "ប៉ែន សាវុធ"
        },
        {
            "barcode": "BBWS180207384",
            "dpc": "03010225401",
            "name": "រស់ យ៉េង"
        },
        {
            "barcode": "BBWS180207385",
            "dpc": "03010225501",
            "name": "សេក ម៉ាលីស"
        },
        {
            "barcode": "BBWS180207386",
            "dpc": "03010225601",
            "name": "លី រ៉ូវីដា"
        },
        {
            "barcode": "BBWS180207387",
            "dpc": "03010225701",
            "name": "វ៉ៃ ប៉ូ"
        },
        {
            "barcode": "BBWS180207388",
            "dpc": "03010225801",
            "name": "ប៉ូ វិវឌ្ឍនៈ"
        },
        {
            "barcode": "BBWS180207389",
            "dpc": "03010225901",
            "name": "ភិន សាមឿន ១"
        },
        {
            "barcode": "BBWS180207390",
            "dpc": "03010226001",
            "name": "ភិន សាមឿន ២"
        },
        {
            "barcode": "BBWS180207391",
            "dpc": "03010226101",
            "name": "ភិន សាមឿន 3"
        },
        {
            "barcode": "BBWS180207392",
            "dpc": "03010226201",
            "name": "ភិន សាមឿន ៤"
        },
        {
            "barcode": "BBWS180207393",
            "dpc": "03010226401",
            "name": "ទ្រឿង ល័ក្ខ"
        },
        {
            "barcode": "BBWS180207394",
            "dpc": "03010226501",
            "name": "សួស ស៊ីណាន"
        },
        {
            "barcode": "BBWS180207395",
            "dpc": "03010226601",
            "name": "ប៊ុន ឡេង"
        },
        {
            "barcode": "BBWS180207396",
            "dpc": "03010226801",
            "name": "មាស សារុន"
        },
        {
            "barcode": "BBWS180207397",
            "dpc": "03010226701",
            "name": "គង់ ម៉ៅ"
        },
        {
            "barcode": "BBWS180207398",
            "dpc": "03010227001",
            "name": "សូ កូវីតា​ (មុខ)"
        },
        {
            "barcode": "BBWS180207399",
            "dpc": "03010227101",
            "name": "នង សាមឿន"
        },
        {
            "barcode": "BBWS180207400",
            "dpc": "03010227201",
            "name": "ណ លីណា"
        },
        {
            "barcode": "BBWS180207401",
            "dpc": "03010224501",
            "name": "អួន គុណ"
        },
        {
            "barcode": "BBWS180207402",
            "dpc": "03010227301",
            "name": "សេង ដាន់ណា"
        },
        {
            "barcode": "BBWS180207403",
            "dpc": "03010227401",
            "name": "មាស ទុំ"
        },
        {
            "barcode": "BBWS180207404",
            "dpc": "03010227701",
            "name": "លឹម ហ៊ួសាន"
        },
        {
            "barcode": "BBWS180207405",
            "dpc": "03010227501",
            "name": "ជួន ស្រីមុំ"
        },
        {
            "barcode": "BBWS180207406",
            "dpc": "03010227601",
            "name": "ជួប សាវឿន"
        },
        {
            "barcode": "BBWS180207407",
            "dpc": "03010227801",
            "name": "ញ៉ែម ចាន់នី"
        },
        {
            "barcode": "BBWS180207408",
            "dpc": "03010227901",
            "name": "ឈាង សែ"
        },
        {
            "barcode": "BBWS180207409",
            "dpc": "03010228001",
            "name": "គី ប៊ុនណាល់"
        },
        {
            "barcode": "BBWS180207410",
            "dpc": "03010228101",
            "name": "ជុង សុចិត្រា"
        },
        {
            "barcode": "BBWS180207411",
            "dpc": "03010228201",
            "name": "អេង ង៉ោ"
        },
        {
            "barcode": "BBWS180207412",
            "dpc": "03010228301",
            "name": "អៀង សេរី"
        },
        {
            "barcode": "BBWS180207413",
            "dpc": "03010229701",
            "name": "អ៊ុក សាមឿន"
        },
        {
            "barcode": "BBWS180207414",
            "dpc": "03010229801",
            "name": "សាន់ លីហ៊ាង"
        },
        {
            "barcode": "BBWS180207415",
            "dpc": "03010229901",
            "name": "ឈឹម ទឹម"
        },
        {
            "barcode": "BBWS180207416",
            "dpc": "03010228501",
            "name": "ស៊ុន ក្រូច"
        },
        {
            "barcode": "BBWS180207417",
            "dpc": "03010228801",
            "name": "វែន សុភ័ក្រ្ត"
        },
        {
            "barcode": "BBWS180207418",
            "dpc": "03010228601",
            "name": "ខឹម សុភា"
        },
        {
            "barcode": "BBWS180207419",
            "dpc": "03010228701",
            "name": "មាស វិចិត្រ"
        },
        {
            "barcode": "BBWS180207420",
            "dpc": "03010228401",
            "name": "ណឹម ប៉េកាឡេ"
        },
        {
            "barcode": "BBWS180207421",
            "dpc": "03010228901",
            "name": "អ៊ឹង វឌ្ឍនៈ"
        },
        {
            "barcode": "BBWS180207422",
            "dpc": "03010229001",
            "name": "សុក វិត"
        },
        {
            "barcode": "BBWS180207423",
            "dpc": "03010229101",
            "name": "ងួន រតនៈ"
        },
        {
            "barcode": "BBWS180207424",
            "dpc": "03010229201",
            "name": "គង់ បាន ២"
        },
        {
            "barcode": "BBWS180207425",
            "dpc": "03010229301",
            "name": "ប៉ោ ទ្រីឌឿន ២"
        },
        {
            "barcode": "BBWS180207426",
            "dpc": "03010229401",
            "name": "ប៉ោ ទ្រីឌឿន ១"
        },
        {
            "barcode": "BBWS180207427",
            "dpc": "03010229601",
            "name": "រ៉ាយ ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180207428",
            "dpc": "03010231401",
            "name": "ឯម វរិទ្ធ"
        },
        {
            "barcode": "BBWS180207429",
            "dpc": "03010231301",
            "name": "ជី នី"
        },
        {
            "barcode": "BBWS180207430",
            "dpc": "03010231001",
            "name": "ឡាំង វង្ស"
        },
        {
            "barcode": "BBWS180207431",
            "dpc": "03010230201",
            "name": "វង្ស វ៉ាន"
        },
        {
            "barcode": "BBWS180207432",
            "dpc": "03010230001",
            "name": "យូ ឈឿម"
        },
        {
            "barcode": "BBWS180207433",
            "dpc": "03010230101",
            "name": "ហ៊ុល ហេង"
        },
        {
            "barcode": "BBWS180207434",
            "dpc": "03010230401",
            "name": "ភួង ភិរ័ត្ន"
        },
        {
            "barcode": "BBWS180207435",
            "dpc": "03010230301",
            "name": "ជា ដាលីន"
        },
        {
            "barcode": "BBWS180207436",
            "dpc": "03010230501",
            "name": "ឡេង ហ៊ន"
        },
        {
            "barcode": "BBWS180207437",
            "dpc": "03010230601",
            "name": "ហម អនុជ"
        },
        {
            "barcode": "BBWS180207438",
            "dpc": "03010230701",
            "name": "ទាត់ ធឿន"
        },
        {
            "barcode": "BBWS180207439",
            "dpc": "03010230901",
            "name": "សុខ វីរៈ"
        },
        {
            "barcode": "BBWS180207440",
            "dpc": "03010231201",
            "name": "ខៀវ សុជាតិ"
        },
        {
            "barcode": "BBWS180207441",
            "dpc": "03010232401",
            "name": "អ៊ុយ វណ្ណនី"
        },
        {
            "barcode": "BBWS180207442",
            "dpc": "03010232301",
            "name": "តេង ហុកហេង"
        },
        {
            "barcode": "BBWS180207443",
            "dpc": "03010232201",
            "name": "ជ័យ សែន"
        },
        {
            "barcode": "BBWS180207444",
            "dpc": "03010232101",
            "name": "ទេព វិត"
        },
        {
            "barcode": "BBWS180207445",
            "dpc": "03010232001",
            "name": "សោ វុទ្ធី"
        },
        {
            "barcode": "BBWS180207446",
            "dpc": "03010231901",
            "name": "សួង សុគន្ធ"
        },
        {
            "barcode": "BBWS180207447",
            "dpc": "03010231801",
            "name": "សួង ចាន់ទី"
        },
        {
            "barcode": "BBWS180207448",
            "dpc": "03010231701",
            "name": "សួង សុធា"
        },
        {
            "barcode": "BBWS180207449",
            "dpc": "03010231601",
            "name": "ពេជ្រ ព្រហ្មមុនី"
        },
        {
            "barcode": "BBWS180207450",
            "dpc": "03010235701",
            "name": "មួង សារ៉េន ១"
        },
        {
            "barcode": "BBWS180207451",
            "dpc": "03010235601",
            "name": "ឡុង ផលគុណ"
        },
        {
            "barcode": "BBWS180207452",
            "dpc": "03010235501",
            "name": "ខាន់ ម៉ាណេ"
        },
        {
            "barcode": "BBWS180207453",
            "dpc": "03010235401",
            "name": "ព្រះវិហារ"
        },
        {
            "barcode": "BBWS180207454",
            "dpc": "03010235301",
            "name": "យ៉ុន ធារិទ្ធ"
        },
        {
            "barcode": "BBWS180207455",
            "dpc": "03010235101",
            "name": "ហ៊ាង រ៉ាវុត"
        },
        {
            "barcode": "BBWS180207456",
            "dpc": "03010235001",
            "name": "អ៊ឹង ឆាយ"
        },
        {
            "barcode": "BBWS180207457",
            "dpc": "03010234801",
            "name": "ចេង សុខណា"
        },
        {
            "barcode": "BBWS180207458",
            "dpc": "03010234701",
            "name": "ឡាំ គឹមហេង"
        },
        {
            "barcode": "BBWS180207459",
            "dpc": "03010234601",
            "name": "ឡាញ សាអូន"
        },
        {
            "barcode": "BBWS180207460",
            "dpc": "03010234501",
            "name": "ទស្ស ហុង"
        },
        {
            "barcode": "BBWS180207461",
            "dpc": "03010234301",
            "name": "ទិត្យ ហ៊ាន"
        },
        {
            "barcode": "BBWS180207462",
            "dpc": "03010234201",
            "name": "ប៉ែន សារិទ្ធ"
        },
        {
            "barcode": "BBWS180207463",
            "dpc": "03010234101",
            "name": "ឃួន ស៊ីម៉ង"
        },
        {
            "barcode": "BBWS180207464",
            "dpc": "03010234001",
            "name": "គី ឌីណា"
        },
        {
            "barcode": "BBWS180207465",
            "dpc": "03010233901",
            "name": "អៀ សាវុធ"
        },
        {
            "barcode": "BBWS180207466",
            "dpc": "03010233801",
            "name": "ឈាង ហាក់"
        },
        {
            "barcode": "BBWS180207467",
            "dpc": "03010233501",
            "name": "ជា ស៊ីមៀន"
        },
        {
            "barcode": "BBWS180207468",
            "dpc": "03010233401",
            "name": "ជី"
        },
        {
            "barcode": "BBWS180207469",
            "dpc": "03010233301",
            "name": "តាំង អ៊ិចហុង"
        },
        {
            "barcode": "BBWS180207470",
            "dpc": "03010233101",
            "name": "ថេត ថេន"
        },
        {
            "barcode": "BBWS180207471",
            "dpc": "03010233001",
            "name": "ហុក ដាវិន"
        },
        {
            "barcode": "BBWS180207472",
            "dpc": "03010232901",
            "name": "សាយ សុវណ្ណរ៉េត"
        },
        {
            "barcode": "BBWS180207473",
            "dpc": "03010232801",
            "name": "សុ វណ្ណារី"
        },
        {
            "barcode": "BBWS180207474",
            "dpc": "03010232701",
            "name": "ពិន សុជាតា"
        },
        {
            "barcode": "BBWS180207475",
            "dpc": "03010232601",
            "name": "លក ស៊ូ"
        },
        {
            "barcode": "BBWS180207476",
            "dpc": "03010232501",
            "name": "សេង សាវុធ"
        },
        {
            "barcode": "BBWS180207477",
            "dpc": "03010240001",
            "name": "ឈឿន វេង"
        },
        {
            "barcode": "BBWS180207478",
            "dpc": "03010239801",
            "name": "ឃួន ឈឿត ២"
        },
        {
            "barcode": "BBWS180207479",
            "dpc": "03010239901",
            "name": "ឃួន ឈឿត ៣"
        },
        {
            "barcode": "BBWS180207480",
            "dpc": "03010239701",
            "name": "ឃួន ឈឿត ១"
        },
        {
            "barcode": "BBWS180207481",
            "dpc": "03010239601",
            "name": "រស់ សុធី"
        },
        {
            "barcode": "BBWS180207482",
            "dpc": "03010239501",
            "name": "សៀ បេន"
        },
        {
            "barcode": "BBWS180207483",
            "dpc": "03010239401",
            "name": "សូ ភីយា"
        },
        {
            "barcode": "BBWS180207484",
            "dpc": "03010239301",
            "name": "ចាយ តុងកឹង"
        },
        {
            "barcode": "BBWS180207485",
            "dpc": "03010239101",
            "name": "ផុន សាវឿន"
        },
        {
            "barcode": "BBWS180207486",
            "dpc": "03010240301",
            "name": "ហ៊ុល ធី"
        },
        {
            "barcode": "BBWS180207487",
            "dpc": "03010240201",
            "name": "ម៉េង វ៉ានដានីន"
        },
        {
            "barcode": "BBWS180207488",
            "dpc": "03010239201",
            "name": "លឹម ហូរ"
        },
        {
            "barcode": "BBWS180207489",
            "dpc": "03010237701",
            "name": "ព្រហ្ម មរណៈ"
        },
        {
            "barcode": "BBWS180207490",
            "dpc": "03010237201",
            "name": "អ៊ឹង ពោធិរដ្ឋ"
        },
        {
            "barcode": "BBWS180207491",
            "dpc": "03010237101",
            "name": "ឡុច ឈឿត"
        },
        {
            "barcode": "BBWS180207492",
            "dpc": "03010237001",
            "name": "ភោគ សុផុន ២"
        },
        {
            "barcode": "BBWS180207493",
            "dpc": "03010236801",
            "name": "ស៊ុត សៅរ៉ាន"
        },
        {
            "barcode": "BBWS180207494",
            "dpc": "03010236701",
            "name": "ស្វិត ជេដ្ឋា"
        },
        {
            "barcode": "BBWS180207495",
            "dpc": "03010238001",
            "name": "សោ បូរិទ្ធ"
        },
        {
            "barcode": "BBWS180207496",
            "dpc": "03010237901",
            "name": "មួង រ៉េន"
        },
        {
            "barcode": "BBWS180207497",
            "dpc": "03010240101",
            "name": "ព្រហ្ម មរណៈ"
        },
        {
            "barcode": "BBWS180207498",
            "dpc": "03010237801",
            "name": "អ៊ុក វី"
        },
        {
            "barcode": "BBWS180207499",
            "dpc": "03010237601",
            "name": "អូន វិបុល"
        },
        {
            "barcode": "BBWS180207500",
            "dpc": "03010237501",
            "name": "ឯក សំអូន ៣"
        },
        {
            "barcode": "BBWS180207501",
            "dpc": "03010237401",
            "name": "ឯក សំអូន ១"
        },
        {
            "barcode": "BBWS180207502",
            "dpc": "03010237301",
            "name": "ប៊ុន  ប៉ា"
        },
        {
            "barcode": "BBWS180207503",
            "dpc": "03010236401",
            "name": "ម៉ម ហ៊ីម"
        },
        {
            "barcode": "BBWS180207504",
            "dpc": "03010236501",
            "name": "វ៉ា គឹមអូន"
        },
        {
            "barcode": "BBWS180207505",
            "dpc": "03010236601",
            "name": "ជា ហុង"
        },
        {
            "barcode": "BBWS180207506",
            "dpc": "03010246901",
            "name": "យិន នូ"
        },
        {
            "barcode": "BBWS180207507",
            "dpc": "03010246601",
            "name": "ស សារិន"
        },
        {
            "barcode": "BBWS180207508",
            "dpc": "03010238901",
            "name": "ហួយ ប៊ុនឡេង"
        },
        {
            "barcode": "BBWS180207509",
            "dpc": "03010238801",
            "name": "ឯក សុផាន"
        },
        {
            "barcode": "BBWS180207510",
            "dpc": "03010240801",
            "name": "ពៅ ពីដារិទ្ធ"
        },
        {
            "barcode": "BBWS180207511",
            "dpc": "03010240601",
            "name": "ម៉ី វណ្ណទូច"
        },
        {
            "barcode": "BBWS180207512",
            "dpc": "03010240501",
            "name": "ជា ឆន"
        },
        {
            "barcode": "BBWS180207513",
            "dpc": "03010240401",
            "name": "អ៊ិន ស៊ីដារ៉េ"
        },
        {
            "barcode": "BBWS180207514",
            "dpc": "03010238701",
            "name": "កែវ សាឡាត់"
        },
        {
            "barcode": "BBWS180207515",
            "dpc": "03010238301",
            "name": "ចាន់ សារឿម"
        },
        {
            "barcode": "BBWS180207516",
            "dpc": "03010238401",
            "name": "នាង ផល្លា"
        },
        {
            "barcode": "BBWS180207517",
            "dpc": "03010238201",
            "name": "ហ៊ាង រ័ត្ន"
        },
        {
            "barcode": "BBWS180207518",
            "dpc": "03010238101",
            "name": "ចាន ធូ"
        },
        {
            "barcode": "BBWS180207519",
            "dpc": "03010246801",
            "name": "តុល ចាន់សុខ"
        },
        {
            "barcode": "BBWS180207520",
            "dpc": "03010246701",
            "name": "ប៉ិល សៃ"
        },
        {
            "barcode": "BBWS180207521",
            "dpc": "03010241901",
            "name": "សួន សុខន"
        },
        {
            "barcode": "BBWS180207522",
            "dpc": "03010242101",
            "name": "ចាន់ ថុលឡា"
        },
        {
            "barcode": "BBWS180207523",
            "dpc": "03010241601",
            "name": "ឯម សុភាព"
        },
        {
            "barcode": "BBWS180207524",
            "dpc": "03010241401",
            "name": "សោម សុវណ្ណ"
        },
        {
            "barcode": "BBWS180207525",
            "dpc": "03010241201",
            "name": "ឆេង ស្រីនាថ"
        },
        {
            "barcode": "BBWS180207526",
            "dpc": "03010241101",
            "name": "សំ សុវណ្ណ"
        },
        {
            "barcode": "BBWS180207527",
            "dpc": "03010240901",
            "name": "ផាន់ សុវណ្ណ"
        },
        {
            "barcode": "BBWS180207528",
            "dpc": "03010241001",
            "name": "ចាន់ គឹមហុង"
        },
        {
            "barcode": "BBWS180207529",
            "dpc": "03010243801",
            "name": "ស៊ុប ធី (វត្តសង្កែ)"
        },
        {
            "barcode": "BBWS180207530",
            "dpc": "03010241301",
            "name": "វត្តសង្កែ"
        },
        {
            "barcode": "BBWS180207531",
            "dpc": "03010246501",
            "name": "អ៊ិន ប្រាជ្ញ"
        },
        {
            "barcode": "BBWS180207532",
            "dpc": "03010241801",
            "name": "សោម មាន"
        },
        {
            "barcode": "BBWS180207533",
            "dpc": "03010241701",
            "name": "ចំរើ រដ្ឋ"
        },
        {
            "barcode": "BBWS180207534",
            "dpc": "03010245701",
            "name": "ឌុច ហឿម"
        },
        {
            "barcode": "BBWS180207535",
            "dpc": "03010245601",
            "name": "ប៊ូ ប៉ុច"
        },
        {
            "barcode": "BBWS180207536",
            "dpc": "03010245401",
            "name": "នុល ឈឿង"
        },
        {
            "barcode": "BBWS180207537",
            "dpc": "03010245301",
            "name": "ទេព ទូ"
        },
        {
            "barcode": "BBWS180207538",
            "dpc": "03010245201",
            "name": "ដូង  រតនះ"
        },
        {
            "barcode": "BBWS180207539",
            "dpc": "03010245101",
            "name": "ប៉េ ហួម"
        },
        {
            "barcode": "BBWS180207540",
            "dpc": "03010245001",
            "name": "ប៉ិច ប៉ុក"
        },
        {
            "barcode": "BBWS180207541",
            "dpc": "03010244901",
            "name": "ប៉ិច ហាប់"
        },
        {
            "barcode": "BBWS180207542",
            "dpc": "03010244801",
            "name": "លួង ឆយ"
        },
        {
            "barcode": "BBWS180207543",
            "dpc": "03010244701",
            "name": "ងៀង សុំភ័ណ"
        },
        {
            "barcode": "BBWS180207544",
            "dpc": "03010244601",
            "name": "ភន រដ្ឋា"
        },
        {
            "barcode": "BBWS180207545",
            "dpc": "03010244501",
            "name": "ស៊ុត សឿង"
        },
        {
            "barcode": "BBWS180207546",
            "dpc": "03010244401",
            "name": "អៀប រិននឿត"
        },
        {
            "barcode": "BBWS180207547",
            "dpc": "03010244201",
            "name": "អៀក ឈៀត"
        },
        {
            "barcode": "BBWS180207548",
            "dpc": "03010244101",
            "name": "អៀក ភៀង"
        },
        {
            "barcode": "BBWS180207549",
            "dpc": "03010244001",
            "name": "លួត ភួង"
        },
        {
            "barcode": "BBWS180207550",
            "dpc": "03010243901",
            "name": "ជុក គឹមហាប់"
        },
        {
            "barcode": "BBWS180207551",
            "dpc": "03010246401",
            "name": "សៀ ប៊ុនយឺ"
        },
        {
            "barcode": "BBWS180207552",
            "dpc": "03010246301",
            "name": "សៀ គឹមណៃ"
        },
        {
            "barcode": "BBWS180207553",
            "dpc": "03010246201",
            "name": "ផាន់ សុគឿន"
        },
        {
            "barcode": "BBWS180207554",
            "dpc": "03010246001",
            "name": "ឡុង ផលគុន"
        },
        {
            "barcode": "BBWS180207555",
            "dpc": "03010245801",
            "name": "ប៊ុន ប្រសិទ្ធ"
        },
        {
            "barcode": "BBWS180207556",
            "dpc": "03010245901",
            "name": "ម៉ាក់ សុខា"
        },
        {
            "barcode": "BBWS180207557",
            "dpc": "03010242601",
            "name": "ម៉ម សុម៉ាវត្តី"
        },
        {
            "barcode": "BBWS180207558",
            "dpc": "03010242501",
            "name": "ហោ គឹមសឿង"
        },
        {
            "barcode": "BBWS180207559",
            "dpc": "03010242401",
            "name": "ហ៊ុយ យិនង៉"
        },
        {
            "barcode": "BBWS180207560",
            "dpc": "03010242301",
            "name": "ប៉ុក ណាវី"
        },
        {
            "barcode": "BBWS180207561",
            "dpc": "03010242201",
            "name": "សំ សុវណ្ណ"
        },
        {
            "barcode": "BBWS180207562",
            "dpc": "03010243701",
            "name": "តាន់ ម៉េង"
        },
        {
            "barcode": "BBWS180207563",
            "dpc": "03010243601",
            "name": "ម៉េង សុឡាតា"
        },
        {
            "barcode": "BBWS180207564",
            "dpc": "03010243501",
            "name": "ម៉េង សុគិត"
        },
        {
            "barcode": "BBWS180207565",
            "dpc": "03010243401",
            "name": "សំ ឆន"
        },
        {
            "barcode": "BBWS180207566",
            "dpc": "03010243301",
            "name": "នាង ឡានី"
        },
        {
            "barcode": "BBWS180207567",
            "dpc": "03010243201",
            "name": "ឌុក សាង"
        },
        {
            "barcode": "BBWS180207568",
            "dpc": "03010243001",
            "name": "មន្ទីរពេទ្យសុខសាន"
        },
        {
            "barcode": "BBWS180207569",
            "dpc": "03010242801",
            "name": "សង ថន"
        },
        {
            "barcode": "BBWS180207570",
            "dpc": "03010202601",
            "name": "ថន ប៊ុនថាន់"
        },
        {
            "barcode": "BBWS180207571",
            "dpc": "03010202701",
            "name": "គឹម សាន្ត"
        },
        {
            "barcode": "BBWS180207572",
            "dpc": "03010202801",
            "name": "រៀន សំណាង"
        },
        {
            "barcode": "BBWS180207573",
            "dpc": "03010203101",
            "name": "ម៉ែន សុខុម"
        },
        {
            "barcode": "BBWS180207574",
            "dpc": "03010203301",
            "name": "ហេង សុភាព"
        },
        {
            "barcode": "BBWS180207575",
            "dpc": "03010203401",
            "name": "វ៉ន ណារ៉ូ"
        },
        {
            "barcode": "BBWS180207576",
            "dpc": "03010200401",
            "name": "ប៉ូវ សំភី"
        },
        {
            "barcode": "BBWS180207577",
            "dpc": "03010200801",
            "name": "ម៉ី សារី"
        },
        {
            "barcode": "BBWS180207578",
            "dpc": "03010200901",
            "name": "យិន ពៅ"
        },
        {
            "barcode": "BBWS180207579",
            "dpc": "03010201001",
            "name": "សារ័ត្ន មុន្នី"
        },
        {
            "barcode": "BBWS180207580",
            "dpc": "03010201101",
            "name": "កេត្រ ស៊ីយ៉ារ៉ា"
        },
        {
            "barcode": "BBWS180207581",
            "dpc": "03010201201",
            "name": "យឹម យឿន"
        },
        {
            "barcode": "BBWS180207582",
            "dpc": "03010201301",
            "name": "យ៉ាត ស្រីសុខុម"
        },
        {
            "barcode": "BBWS180207583",
            "dpc": "03010201401",
            "name": "កុយ នុយ"
        },
        {
            "barcode": "BBWS180207584",
            "dpc": "03010201701",
            "name": "ប៊ិន យួម"
        },
        {
            "barcode": "BBWS180207585",
            "dpc": "03010201801",
            "name": "ហឿង ហាយ"
        },
        {
            "barcode": "BBWS180207586",
            "dpc": "03010201901",
            "name": "អួង ណារ៉េត"
        },
        {
            "barcode": "BBWS180207587",
            "dpc": "03010202001",
            "name": "យ៉ន បូរ៉ា"
        },
        {
            "barcode": "BBWS180207588",
            "dpc": "03010202101",
            "name": "ហូរ ធី"
        },
        {
            "barcode": "BBWS180207589",
            "dpc": "03010200701",
            "name": "កែវ ដេត"
        },
        {
            "barcode": "BBWS180207590",
            "dpc": "03010200601",
            "name": "កេត្រ ចន្ត្រា"
        },
        {
            "barcode": "BBWS180207591",
            "dpc": "03010202401",
            "name": "សៅ ណាវី"
        },
        {
            "barcode": "BBWS180207592",
            "dpc": "03010202301",
            "name": "ហេង ស៊ុនហូរ"
        },
        {
            "barcode": "BBWS180207593",
            "dpc": "03010202201",
            "name": "ពុម ប៊ុនង៉ា"
        },
        {
            "barcode": "BBWS180207594",
            "dpc": "03010201601",
            "name": "លឿម សុខហេង"
        },
        {
            "barcode": "BBWS180207595",
            "dpc": "03010200101",
            "name": "ឡាច សាមឿន"
        },
        {
            "barcode": "BBWS180207596",
            "dpc": "03010200201",
            "name": "នូវ ខន្តី"
        },
        {
            "barcode": "BBWS180207597",
            "dpc": "03010200301",
            "name": "ចាន់ តុន"
        },
        {
            "barcode": "BBWS180207598",
            "dpc": "03010247501",
            "name": "គុយ ឈុំណាត"
        },
        {
            "barcode": "BBWS180207599",
            "dpc": "03010247901",
            "name": "ជុន ណៃឈឿត"
        },
        {
            "barcode": "BBWS180207600",
            "dpc": "03010247301",
            "name": "សួន ចាន់សឿន"
        },
        {
            "barcode": "BBWS180207601",
            "dpc": "03010203601",
            "name": "ផូ សុងហេង"
        },
        {
            "barcode": "BBWS180207602",
            "dpc": "03010203501",
            "name": "សូ ឈឿងលី"
        },
        {
            "barcode": "BBWS180207603",
            "dpc": "03010203801",
            "name": "ជយ ហឿម"
        },
        {
            "barcode": "BBWS180207604",
            "dpc": "03010203901",
            "name": "ថន សារិទ្ធ"
        },
        {
            "barcode": "BBWS180207605",
            "dpc": "03010204001",
            "name": "សុក ពុធ"
        },
        {
            "barcode": "BBWS180207606",
            "dpc": "03010204201",
            "name": "សន ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180207607",
            "dpc": "03010204401",
            "name": "សេង ប៊ុនសួ"
        },
        {
            "barcode": "BBWS180207608",
            "dpc": "03010204601",
            "name": "កែវ សៀប៉ូ"
        },
        {
            "barcode": "BBWS180207609",
            "dpc": "03010204501",
            "name": "ជួង ខ្វា"
        },
        {
            "barcode": "BBWS180207610",
            "dpc": "03010204301",
            "name": "ហ៊ាន  ហឹម"
        },
        {
            "barcode": "BBWS180207611",
            "dpc": "03010207001",
            "name": "រ៉ាយ  សារ៉ុម"
        },
        {
            "barcode": "BBWS180207612",
            "dpc": "03010220901",
            "name": "ជាង  ម៉េត"
        },
        {
            "barcode": "BBWS180207613",
            "dpc": "03010226301",
            "name": "ឌួង វិបុល"
        },
        {
            "barcode": "BBWS180207614",
            "dpc": "03010229501",
            "name": "ឈុន  ស្រេង"
        },
        {
            "barcode": "BBWS180207615",
            "dpc": "03010233601",
            "name": "ថង សៀង"
        },
        {
            "barcode": "BBWS180207616",
            "dpc": "03010234401",
            "name": "យឹម  សុខា"
        },
        {
            "barcode": "BBWS180207617",
            "dpc": "03010235201",
            "name": "ផូ  ធូរេន"
        },
        {
            "barcode": "BBWS180207618",
            "dpc": "03010236301",
            "name": "ខៀវ  សំហេន"
        },
        {
            "barcode": "BBWS180207619",
            "dpc": "03010236901",
            "name": "តាំង  ប៊ុនហ៊ីម"
        },
        {
            "barcode": "BBWS180207620",
            "dpc": "03010238501",
            "name": "សុខ  ចាន់"
        },
        {
            "barcode": "BBWS180207621",
            "dpc": "03010238601",
            "name": "ជុំ  សុខុម"
        },
        {
            "barcode": "BBWS180207622",
            "dpc": "03010241501",
            "name": "សុខ  ឃាង"
        },
        {
            "barcode": "BBWS180207623",
            "dpc": "03010242001",
            "name": "សុខ  ធឿន"
        },
        {
            "barcode": "BBWS180207624",
            "dpc": "03010244301",
            "name": "តាន់  សារឿន"
        },
        {
            "barcode": "BBWS180207625",
            "dpc": "03010247201",
            "name": "ញ៉ែម  សុខា"
        },
        {
            "barcode": "BBWS180207626",
            "dpc": "03010247401",
            "name": "ស៊ាង  ចាន់ធាម"
        },
        {
            "barcode": "BBWS180207627",
            "dpc": "03010247701",
            "name": "សៅ  ហ៊ាល"
        },
        {
            "barcode": "BBWS180207628",
            "dpc": "03010247801",
            "name": "សៅ  មន្ថា"
        },
        {
            "barcode": "BBWS180207629",
            "dpc": "03010248001",
            "name": "ម៉ី ជឿន"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
