let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=

    [
        {
            "barcode": "BBWS180210097",
            "dpc": "03010302201",
            "name": "ងឿន រិទ្ធ"
        },
        {
            "barcode": "BBWS180210098",
            "dpc": "03010302301",
            "name": "ហេង សុផល"
        },
        {
            "barcode": "BBWS180210099",
            "dpc": "03010302501",
            "name": "ធាវ  អ៊ិត"
        },
        {
            "barcode": "BBWS180210100",
            "dpc": "03010302701",
            "name": "វណ្ណា ដា"
        },
        {
            "barcode": "BBWS180210101",
            "dpc": "03010302801",
            "name": "ភន សុខា"
        },
        {
            "barcode": "BBWS180210102",
            "dpc": "03010302901",
            "name": "សួស សុខភាព"
        },
        {
            "barcode": "BBWS180210103",
            "dpc": "03010303001",
            "name": "សុខ ជា"
        },
        {
            "barcode": "BBWS180210104",
            "dpc": "03010303101",
            "name": "ស៊ាន ហ៊ុល"
        },
        {
            "barcode": "BBWS180210105",
            "dpc": "03010303201",
            "name": "គា យ៉ាន"
        },
        {
            "barcode": "BBWS180210106",
            "dpc": "03010303301",
            "name": "រស់ សារ៉េត"
        },
        {
            "barcode": "BBWS180210107",
            "dpc": "03010303401",
            "name": "ចាន់ សុខឡេង"
        },
        {
            "barcode": "BBWS180210108",
            "dpc": "03010303501",
            "name": "យឹម សាវ៉ាត"
        },
        {
            "barcode": "BBWS180210109",
            "dpc": "03010303601",
            "name": "មុត សារឿន"
        },
        {
            "barcode": "BBWS180210110",
            "dpc": "03010303701",
            "name": "សេង អាន"
        },
        {
            "barcode": "BBWS180210111",
            "dpc": "03010303901",
            "name": "សេក អៀង"
        },
        {
            "barcode": "BBWS180210112",
            "dpc": "03010303801",
            "name": "អ៊ិត ស៊ីធា"
        },
        {
            "barcode": "BBWS180210113",
            "dpc": "03010304001",
            "name": "អែម គឹមស៊ុន"
        },
        {
            "barcode": "BBWS180210114",
            "dpc": "03010304101",
            "name": "ទាវ អ៊ុយសឹង"
        },
        {
            "barcode": "BBWS180210115",
            "dpc": "03010304201",
            "name": "អែម ប៊ុនណាត"
        },
        {
            "barcode": "BBWS180210116",
            "dpc": "03010304301",
            "name": "ង៉ែត វុទ្ធី"
        },
        {
            "barcode": "BBWS180210117",
            "dpc": "03010304401",
            "name": "ឡាច ម៉ាន់"
        },
        {
            "barcode": "BBWS180210118",
            "dpc": "03010304601",
            "name": "ចាន់ សំបូរ"
        },
        {
            "barcode": "BBWS180210119",
            "dpc": "03010304701",
            "name": "ទាន់ សម័យ"
        },
        {
            "barcode": "BBWS180210120",
            "dpc": "03010304801",
            "name": "គឹម បូរី"
        },
        {
            "barcode": "BBWS180210121",
            "dpc": "03010305001",
            "name": "ទិត ជិន"
        },
        {
            "barcode": "BBWS180210122",
            "dpc": "03010304901",
            "name": "គង់ ហ៊ាន"
        },
        {
            "barcode": "BBWS180210123",
            "dpc": "03010333401",
            "name": "អ៊ីវ អមរា"
        },
        {
            "barcode": "BBWS180210124",
            "dpc": "03010333501",
            "name": "ឃី ធារ៉ា"
        },
        {
            "barcode": "BBWS180210125",
            "dpc": "03010333601",
            "name": "គង់ ហ៊ាន"
        },
        {
            "barcode": "BBWS180210126",
            "dpc": "03010333701",
            "name": "អាត ទីត ១"
        },
        {
            "barcode": "BBWS180210127",
            "dpc": "03010333801",
            "name": "អាត ទីត ២"
        },
        {
            "barcode": "BBWS180210128",
            "dpc": "03010333901",
            "name": "ថង ជី"
        },
        {
            "barcode": "BBWS180210129",
            "dpc": "03010334001",
            "name": "អៀប សាវឿត"
        },
        {
            "barcode": "BBWS180210130",
            "dpc": "03010334201",
            "name": "អ៊ឹប លឿត ១"
        },
        {
            "barcode": "BBWS180210131",
            "dpc": "03010334301",
            "name": "ហ៊ឹង ចំរើន"
        },
        {
            "barcode": "BBWS180210132",
            "dpc": "03010334401",
            "name": "ជា​ សុធា"
        },
        {
            "barcode": "BBWS180210133",
            "dpc": "03010334501",
            "name": "ស៊ិន ឈៀន"
        },
        {
            "barcode": "BBWS180210134",
            "dpc": "03010334601",
            "name": "ចែក ប៊ុនឈៀង"
        },
        {
            "barcode": "BBWS180210135",
            "dpc": "03010334701",
            "name": "ស៊ិន សាលី"
        },
        {
            "barcode": "BBWS180210136",
            "dpc": "03010334801",
            "name": "រ័ត្ន វ៉ាន់ថា"
        },
        {
            "barcode": "BBWS180210137",
            "dpc": "03010334901",
            "name": "សុវណ្ណារ៉ា"
        },
        {
            "barcode": "BBWS180210138",
            "dpc": "03010335001",
            "name": "លាស់ សុទ្ធ២"
        },
        {
            "barcode": "BBWS180210139",
            "dpc": "03010335101",
            "name": "លាស់ សុទ្ធ ២"
        },
        {
            "barcode": "BBWS180210140",
            "dpc": "03010335201",
            "name": "ម៉េង ហ៊ាង"
        },
        {
            "barcode": "BBWS180210141",
            "dpc": "03010335301",
            "name": "ឈុន លី"
        },
        {
            "barcode": "BBWS180210142",
            "dpc": "03010335401",
            "name": "វ៉ាត វ៉ារីម"
        },
        {
            "barcode": "BBWS180210143",
            "dpc": "03010335601",
            "name": "សឹង ខូច"
        },
        {
            "barcode": "BBWS180210144",
            "dpc": "03010335701",
            "name": "ហេង ផាន់"
        },
        {
            "barcode": "BBWS180210145",
            "dpc": "03010335801",
            "name": "សឹង ង៉ុយ"
        },
        {
            "barcode": "BBWS180210146",
            "dpc": "03010335901",
            "name": "តាំង ម៉េង"
        },
        {
            "barcode": "BBWS180210147",
            "dpc": "03010336001",
            "name": "ប៉ូ សុខអេង"
        },
        {
            "barcode": "BBWS180210148",
            "dpc": "03010336101",
            "name": "ឈុន ណៃ"
        },
        {
            "barcode": "BBWS180210149",
            "dpc": "03010336201",
            "name": "ប៉ូ ស៊ុនទាក"
        },
        {
            "barcode": "BBWS180210150",
            "dpc": "03010336301",
            "name": "ទ្រី ម៉េងឡាយ"
        },
        {
            "barcode": "BBWS180210151",
            "dpc": "03010336401",
            "name": "សេង សុភា"
        },
        {
            "barcode": "BBWS180210152",
            "dpc": "03010336501",
            "name": "សេម ម៉ារីន"
        },
        {
            "barcode": "BBWS180210153",
            "dpc": "03010336601",
            "name": "ស៊ុយ ងិន"
        },
        {
            "barcode": "BBWS180210154",
            "dpc": "03010336701",
            "name": "យឹក ចន្ធី"
        },
        {
            "barcode": "BBWS180210155",
            "dpc": "03010336801",
            "name": "អោម ពិសិទ្ធ"
        },
        {
            "barcode": "BBWS180210156",
            "dpc": "03010336901",
            "name": "ឈៀង ហាក"
        },
        {
            "barcode": "BBWS180210157",
            "dpc": "03010337001",
            "name": "អ៊ឹម លឿត"
        },
        {
            "barcode": "BBWS180210158",
            "dpc": "03010337101",
            "name": "គុជ ជ"
        },
        {
            "barcode": "BBWS180210159",
            "dpc": "03010337301",
            "name": "ប៊ុន វណ្ណា"
        },
        {
            "barcode": "BBWS180210160",
            "dpc": "03010337401",
            "name": "សេម ចំរ៉ាត់"
        },
        {
            "barcode": "BBWS180210161",
            "dpc": "03010337501",
            "name": "ខី ហ៊ត"
        },
        {
            "barcode": "BBWS180210162",
            "dpc": "03010337601",
            "name": "លន់ សៀន"
        },
        {
            "barcode": "BBWS180210163",
            "dpc": "03010337701",
            "name": "ទ្រី ម៉េង"
        },
        {
            "barcode": "BBWS180210164",
            "dpc": "03010337901",
            "name": "ឃុន ដាលាង"
        },
        {
            "barcode": "BBWS180210165",
            "dpc": "03010338001",
            "name": "តាន់ សុផល"
        },
        {
            "barcode": "BBWS180210166",
            "dpc": "03010338101",
            "name": "ទិត សំពាក្យ"
        },
        {
            "barcode": "BBWS180210167",
            "dpc": "03010338201",
            "name": "សយ ហ៊ាង"
        },
        {
            "barcode": "BBWS180210168",
            "dpc": "03010338301",
            "name": "ទិត កៀត"
        },
        {
            "barcode": "BBWS180210169",
            "dpc": "03010304501",
            "name": "ង៉ែត ឈី"
        },
        {
            "barcode": "BBWS180210170",
            "dpc": "03010306001",
            "name": "គី មឿន"
        },
        {
            "barcode": "BBWS180210171",
            "dpc": "03010306101",
            "name": "អនសុខម៉ាលភាព ១"
        },
        {
            "barcode": "BBWS180210172",
            "dpc": "03010305601",
            "name": "លឹម ស៊ីណាត"
        },
        {
            "barcode": "BBWS180210173",
            "dpc": "03010305801",
            "name": "សុខ ចាន់ថា"
        },
        {
            "barcode": "BBWS180210174",
            "dpc": "03010305701",
            "name": "ងិន អូន"
        },
        {
            "barcode": "BBWS180210175",
            "dpc": "03010305901",
            "name": "ទី ហ៊ាង"
        },
        {
            "barcode": "BBWS180210176",
            "dpc": "03010306201",
            "name": "ចាន់ ទូច"
        },
        {
            "barcode": "BBWS180210177",
            "dpc": "03010306301",
            "name": "វ៉ាន់ គ្រី"
        },
        {
            "barcode": "BBWS180210178",
            "dpc": "03010306401",
            "name": "ទេស ឃឿន"
        },
        {
            "barcode": "BBWS180210179",
            "dpc": "03010306701",
            "name": "ឡៃ ស៊ីម"
        },
        {
            "barcode": "BBWS180210180",
            "dpc": "03010306501",
            "name": "ឌុន វុទ្ធី"
        },
        {
            "barcode": "BBWS180210181",
            "dpc": "03010306601",
            "name": "ហង សារៀប"
        },
        {
            "barcode": "BBWS180210182",
            "dpc": "03010306901",
            "name": "បង ណាក់"
        },
        {
            "barcode": "BBWS180210183",
            "dpc": "03010306801",
            "name": "វ៉ាន់ សុឆិន"
        },
        {
            "barcode": "BBWS180210184",
            "dpc": "03010307001",
            "name": "ភួង គឹមស៊ុន"
        },
        {
            "barcode": "BBWS180210185",
            "dpc": "03010307101",
            "name": "ស៊ូ ប៊ុនសុំ"
        },
        {
            "barcode": "BBWS180210186",
            "dpc": "03010307201",
            "name": "ចាប សំណាង ២"
        },
        {
            "barcode": "BBWS180210187",
            "dpc": "03010307301",
            "name": "នៀត"
        },
        {
            "barcode": "BBWS180210188",
            "dpc": "03010307401",
            "name": "អ៊ុំ យ៉ា"
        },
        {
            "barcode": "BBWS180210189",
            "dpc": "03010307501",
            "name": "ទ្រៀង វិន"
        },
        {
            "barcode": "BBWS180210190",
            "dpc": "03010307601",
            "name": "ទ្រឿង វុទ្ធា"
        },
        {
            "barcode": "BBWS180210191",
            "dpc": "03010307701",
            "name": "ចាប សំណាង ១"
        },
        {
            "barcode": "BBWS180210192",
            "dpc": "03010307801",
            "name": "រូត  ប៉ូលីន"
        },
        {
            "barcode": "BBWS180210193",
            "dpc": "03010307901",
            "name": "គឹម សារ៉ាន់"
        },
        {
            "barcode": "BBWS180210194",
            "dpc": "03010308001",
            "name": "ព្រុំ សាវន"
        },
        {
            "barcode": "BBWS180210195",
            "dpc": "03010308101",
            "name": "និវ  ណន"
        },
        {
            "barcode": "BBWS180210196",
            "dpc": "03010308201",
            "name": "យឿម យ៉េង"
        },
        {
            "barcode": "BBWS180210197",
            "dpc": "03010308301",
            "name": "ថោង ប្រានី"
        },
        {
            "barcode": "BBWS180210198",
            "dpc": "03010308401",
            "name": "ផន សាលីន"
        },
        {
            "barcode": "BBWS180210199",
            "dpc": "03010305301",
            "name": "អន ផល្លា"
        },
        {
            "barcode": "BBWS180210200",
            "dpc": "03010305501",
            "name": "ម៉ម ស្រីរដ្ឋ"
        },
        {
            "barcode": "BBWS180210201",
            "dpc": "03010305401",
            "name": "អោក ចានធឿន ១"
        },
        {
            "barcode": "BBWS180210202",
            "dpc": "03010309501",
            "name": "ទូច មន្នី"
        },
        {
            "barcode": "BBWS180210203",
            "dpc": "03010309601",
            "name": "ហ៊ី ហ៊ីង"
        },
        {
            "barcode": "BBWS180210204",
            "dpc": "03010309701",
            "name": "ជា ចន្យា"
        },
        {
            "barcode": "BBWS180210205",
            "dpc": "03010309801",
            "name": "ជា សេត"
        },
        {
            "barcode": "BBWS180210206",
            "dpc": "03010309901",
            "name": "ស៊ូ សឿន"
        },
        {
            "barcode": "BBWS180210207",
            "dpc": "03010310001",
            "name": "យិន ហ៊ាង"
        },
        {
            "barcode": "BBWS180210208",
            "dpc": "03010310101",
            "name": "មុំ សេង"
        },
        {
            "barcode": "BBWS180210209",
            "dpc": "03010310201",
            "name": "ស៊ុយ  មុំ"
        },
        {
            "barcode": "BBWS180210210",
            "dpc": "03010310401",
            "name": "ហេង រ៉ាឌី"
        },
        {
            "barcode": "BBWS180210211",
            "dpc": "03010310501",
            "name": "យ៉ា ខឿប"
        },
        {
            "barcode": "BBWS180210212",
            "dpc": "03010310601",
            "name": "ហុង សាខឿន"
        },
        {
            "barcode": "BBWS180210213",
            "dpc": "03010310701",
            "name": "គិត ម៉េងហាក់"
        },
        {
            "barcode": "BBWS180210214",
            "dpc": "03010310801",
            "name": "ហេង សុផាត"
        },
        {
            "barcode": "BBWS180210215",
            "dpc": "03010310901",
            "name": "ហេង សុភាព"
        },
        {
            "barcode": "BBWS180210216",
            "dpc": "03010311001",
            "name": "ង៉ាត វ៉ានថា"
        },
        {
            "barcode": "BBWS180210217",
            "dpc": "03010311101",
            "name": "ព្រះវិហារគ្រីះបរិសុទ្ធ"
        },
        {
            "barcode": "BBWS180210218",
            "dpc": "03010311201",
            "name": "អ៊ិត ឃឿត"
        },
        {
            "barcode": "BBWS180210219",
            "dpc": "03010311301",
            "name": "ដើង ស៊ីថា"
        },
        {
            "barcode": "BBWS180210220",
            "dpc": "03010311401",
            "name": "ហួត ចានថង"
        },
        {
            "barcode": "BBWS180210221",
            "dpc": "03010311501",
            "name": "ហួត ចាន់ស៊ី"
        },
        {
            "barcode": "BBWS180210222",
            "dpc": "03010311601",
            "name": "ជឺ  បុទុំ"
        },
        {
            "barcode": "BBWS180210223",
            "dpc": "03010311701",
            "name": "កែវ សំអឿន"
        },
        {
            "barcode": "BBWS180210224",
            "dpc": "03010311801",
            "name": "ទូច សឿន"
        },
        {
            "barcode": "BBWS180210225",
            "dpc": "03010311901",
            "name": "ចុង ស៊ីន"
        },
        {
            "barcode": "BBWS180210226",
            "dpc": "03010312101",
            "name": "សេង គួន"
        },
        {
            "barcode": "BBWS180210227",
            "dpc": "03010312301",
            "name": "យោក ស៊ីផុន"
        },
        {
            "barcode": "BBWS180210228",
            "dpc": "03010312401",
            "name": "អាត់ វណ្ណា ២"
        },
        {
            "barcode": "BBWS180210229",
            "dpc": "03010312501",
            "name": "វណ្ណា  រ៉េ ១"
        },
        {
            "barcode": "BBWS180210230",
            "dpc": "03010312601",
            "name": "ថន ច្ឆា"
        },
        {
            "barcode": "BBWS180210231",
            "dpc": "03010312701",
            "name": "ឆាត់ ឆាយឆដា១"
        },
        {
            "barcode": "BBWS180210232",
            "dpc": "03010312801",
            "name": "វ៉ន យួង"
        },
        {
            "barcode": "BBWS180210233",
            "dpc": "03010312901",
            "name": "ជ័យ សុផាត"
        },
        {
            "barcode": "BBWS180210234",
            "dpc": "03010313001",
            "name": "អ៊ុន សាវ៉ុន"
        },
        {
            "barcode": "BBWS180210235",
            "dpc": "03010313101",
            "name": "សុខ ចំរើន"
        },
        {
            "barcode": "BBWS180210236",
            "dpc": "03010313201",
            "name": "រី សុធារ៉ា"
        },
        {
            "barcode": "BBWS180210237",
            "dpc": "03010313301",
            "name": "តិច សេង"
        },
        {
            "barcode": "BBWS180210238",
            "dpc": "03010313401",
            "name": "តិច ស៊ាង"
        },
        {
            "barcode": "BBWS180210239",
            "dpc": "03010313501",
            "name": "អោម នៅ"
        },
        {
            "barcode": "BBWS180210240",
            "dpc": "03010313601",
            "name": "ខុង កវី"
        },
        {
            "barcode": "BBWS180210241",
            "dpc": "03010313701",
            "name": "ហៀង ឃាង"
        },
        {
            "barcode": "BBWS180210242",
            "dpc": "03010313801",
            "name": "ចាន សុខលីន"
        },
        {
            "barcode": "BBWS180210243",
            "dpc": "03010313901",
            "name": "តា ហេង"
        },
        {
            "barcode": "BBWS180210244",
            "dpc": "03010314001",
            "name": "គួច  ម៉ារី ១"
        },
        {
            "barcode": "BBWS180210245",
            "dpc": "03010314101",
            "name": "គួច  ម៉ារី ២"
        },
        {
            "barcode": "BBWS180210246",
            "dpc": "03010314301",
            "name": "ឡាញ់ ម៉ុងទី"
        },
        {
            "barcode": "BBWS180210247",
            "dpc": "03010331301",
            "name": "អ៊ុយ សុខុម"
        },
        {
            "barcode": "BBWS180210248",
            "dpc": "03010331401",
            "name": "ហ៊ាង អូន"
        },
        {
            "barcode": "BBWS180210249",
            "dpc": "03010331501",
            "name": "នុត សារុន"
        },
        {
            "barcode": "BBWS180210250",
            "dpc": "03010331601",
            "name": "នុត សារិទ្ធ"
        },
        {
            "barcode": "BBWS180210251",
            "dpc": "03010331701",
            "name": "មាស សុភិន ១"
        },
        {
            "barcode": "BBWS180210252",
            "dpc": "03010331801",
            "name": "មាស សុភិន ២"
        },
        {
            "barcode": "BBWS180210253",
            "dpc": "03010331901",
            "name": "ហូរ ប៊ុនហេង"
        },
        {
            "barcode": "BBWS180210254",
            "dpc": "03010332001",
            "name": "ហុង ចាន់នី"
        },
        {
            "barcode": "BBWS180210255",
            "dpc": "03010332101",
            "name": "ងិន សុជា"
        },
        {
            "barcode": "BBWS180210256",
            "dpc": "03010332201",
            "name": "តាំង ហុង"
        },
        {
            "barcode": "BBWS180210257",
            "dpc": "03010332301",
            "name": "ប៉ាវ សុភាព"
        },
        {
            "barcode": "BBWS180210258",
            "dpc": "03010332401",
            "name": "លី អេង"
        },
        {
            "barcode": "BBWS180210259",
            "dpc": "03010332501",
            "name": "ជា ចាន់ថា"
        },
        {
            "barcode": "BBWS180210260",
            "dpc": "03010332601",
            "name": "ឈុំ ហៀង"
        },
        {
            "barcode": "BBWS180210261",
            "dpc": "03010332701",
            "name": "សាំង ឈិនហូរ"
        },
        {
            "barcode": "BBWS180210262",
            "dpc": "03010332801",
            "name": "កែវ ពិសិទ្ធ"
        },
        {
            "barcode": "BBWS180210263",
            "dpc": "03010332901",
            "name": "ចាន់ ឃុយ"
        },
        {
            "barcode": "BBWS180210264",
            "dpc": "03010333001",
            "name": "សុខ អាន"
        },
        {
            "barcode": "BBWS180210265",
            "dpc": "03010333101",
            "name": "ជ័យ សារឿន"
        },
        {
            "barcode": "BBWS180210266",
            "dpc": "03010333201",
            "name": "ភី សុភា"
        },
        {
            "barcode": "BBWS180210267",
            "dpc": "03010333301",
            "name": "សុខ វណ្ណី"
        },
        {
            "barcode": "BBWS180210268",
            "dpc": "03010328501",
            "name": "អ៊ិន សារឿន"
        },
        {
            "barcode": "BBWS180210269",
            "dpc": "03010328901",
            "name": "រស ផល"
        },
        {
            "barcode": "BBWS180210270",
            "dpc": "03010308501",
            "name": "ពេជ្រ បូរ"
        },
        {
            "barcode": "BBWS180210271",
            "dpc": "03010309201",
            "name": "រ៉ុង ឈឿន"
        },
        {
            "barcode": "BBWS180210272",
            "dpc": "03010308601",
            "name": "ព្រំ ឆៃយ៉ាន"
        },
        {
            "barcode": "BBWS180210273",
            "dpc": "03010308701",
            "name": "សេង ថាឌី ១"
        },
        {
            "barcode": "BBWS180210274",
            "dpc": "03010308801",
            "name": "សេង ថាឌី ២"
        },
        {
            "barcode": "BBWS180210275",
            "dpc": "03010308901",
            "name": "សរ យស់ថាវរៈ"
        },
        {
            "barcode": "BBWS180210276",
            "dpc": "03010309101",
            "name": "អែវ និមល"
        },
        {
            "barcode": "BBWS180210277",
            "dpc": "03010326901",
            "name": "យិន សារឿន ១"
        },
        {
            "barcode": "BBWS180210278",
            "dpc": "03010327001",
            "name": "យិន សារឿន ២"
        },
        {
            "barcode": "BBWS180210279",
            "dpc": "03010327101",
            "name": "យិន សារឿន ៣"
        },
        {
            "barcode": "BBWS180210280",
            "dpc": "03010327301",
            "name": "ឈាង ឌុក"
        },
        {
            "barcode": "BBWS180210281",
            "dpc": "03010327501",
            "name": "ថ្លាង ប៊ុនណាត"
        },
        {
            "barcode": "BBWS180210282",
            "dpc": "03010327801",
            "name": "អ៊ុំ រ៉ា"
        },
        {
            "barcode": "BBWS180210283",
            "dpc": "03010328301",
            "name": "អ៊ុន រឿន"
        },
        {
            "barcode": "BBWS180210284",
            "dpc": "03010329701",
            "name": "ហ៊ុល យ៉ាង"
        },
        {
            "barcode": "BBWS180210285",
            "dpc": "03010329601",
            "name": "ទាវ វុទ្ធី"
        },
        {
            "barcode": "BBWS180210286",
            "dpc": "03010329501",
            "name": "ឃឹម សារ៉ាត់"
        },
        {
            "barcode": "BBWS180210287",
            "dpc": "03010329301",
            "name": "អ៊ុយ លីវ ៣"
        },
        {
            "barcode": "BBWS180210288",
            "dpc": "03010328801",
            "name": "ខាំ សារ៉ុម"
        },
        {
            "barcode": "BBWS180210289",
            "dpc": "03010328401",
            "name": "យ៉ាន សុភី"
        },
        {
            "barcode": "BBWS180210290",
            "dpc": "03010328201",
            "name": "កែវ ហឿន"
        },
        {
            "barcode": "BBWS180210291",
            "dpc": "03010328101",
            "name": "កែវ  រ៉ាដា"
        },
        {
            "barcode": "BBWS180210292",
            "dpc": "03010328001",
            "name": "ឯម សុភី"
        },
        {
            "barcode": "BBWS180210293",
            "dpc": "03010327601",
            "name": "កាន់ ណាឌី"
        },
        {
            "barcode": "BBWS180210294",
            "dpc": "03010327401",
            "name": "តាង សារ៉េត"
        },
        {
            "barcode": "BBWS180210295",
            "dpc": "03010327201",
            "name": "ថោង ផល្លា"
        },
        {
            "barcode": "BBWS180210296",
            "dpc": "03010319201",
            "name": "សាលារៀនព្រែកព្រះស្តេច"
        },
        {
            "barcode": "BBWS180210297",
            "dpc": "03010319301",
            "name": "កែវ ផូ"
        },
        {
            "barcode": "BBWS180210298",
            "dpc": "03010319701",
            "name": "សុង ស៊ឹង"
        },
        {
            "barcode": "BBWS180210299",
            "dpc": "03010320201",
            "name": "ភុំ រីណូ"
        },
        {
            "barcode": "BBWS180210300",
            "dpc": "03010320301",
            "name": "សៀង ស៊ាត"
        },
        {
            "barcode": "BBWS180210301",
            "dpc": "03010320401",
            "name": "លី សេង"
        },
        {
            "barcode": "BBWS180210302",
            "dpc": "03010320601",
            "name": "រឿន ឈិន"
        },
        {
            "barcode": "BBWS180210303",
            "dpc": "03010320701",
            "name": "ហុង សុជា"
        },
        {
            "barcode": "BBWS180210304",
            "dpc": "03010320801",
            "name": "ហាក់ ទៀង"
        },
        {
            "barcode": "BBWS180210305",
            "dpc": "03010321001",
            "name": "គឹម ប៊ុនថា"
        },
        {
            "barcode": "BBWS180210306",
            "dpc": "03010321101",
            "name": "ថោង សារ៉ន"
        },
        {
            "barcode": "BBWS180210307",
            "dpc": "03010329801",
            "name": "ថង ចេង"
        },
        {
            "barcode": "BBWS180210308",
            "dpc": "03010330801",
            "name": "ជា​ សុខុប"
        },
        {
            "barcode": "BBWS180210309",
            "dpc": "03010330701",
            "name": "ហ៊ាង ណៃជឹង"
        },
        {
            "barcode": "BBWS180210310",
            "dpc": "03010330601",
            "name": "សាត សារ៉ន"
        },
        {
            "barcode": "BBWS180210311",
            "dpc": "03010330401",
            "name": "អឿន ឈន"
        },
        {
            "barcode": "BBWS180210312",
            "dpc": "03010330501",
            "name": "នូ សំបូរ"
        },
        {
            "barcode": "BBWS180210313",
            "dpc": "03010330301",
            "name": "ហ៊ាង តឹកលី"
        },
        {
            "barcode": "BBWS180210314",
            "dpc": "03010330201",
            "name": "យន់ ឡៃ"
        },
        {
            "barcode": "BBWS180210315",
            "dpc": "03010330101",
            "name": "ឪ សារឿន"
        },
        {
            "barcode": "BBWS180210316",
            "dpc": "03010330001",
            "name": "ជិន សំប៊ុន"
        },
        {
            "barcode": "BBWS180210317",
            "dpc": "03010329901",
            "name": "ថង សៀង"
        },
        {
            "barcode": "BBWS180210318",
            "dpc": "03010330901",
            "name": "ព្រិល ហ៊ាង"
        },
        {
            "barcode": "BBWS180210319",
            "dpc": "03010331001",
            "name": "ឈឿ ឈួន"
        },
        {
            "barcode": "BBWS180210320",
            "dpc": "03010331101",
            "name": "ប៉ែន ភូង"
        },
        {
            "barcode": "BBWS180210321",
            "dpc": "03010331201",
            "name": "ធីតា លក្ខិណា"
        },
        {
            "barcode": "BBWS180210322",
            "dpc": "03010309301",
            "name": "អ៊ឹង ថាវី"
        },
        {
            "barcode": "BBWS180210323",
            "dpc": "03010314401",
            "name": "ស៊ីន វុឌ្ឍី"
        },
        {
            "barcode": "BBWS180210324",
            "dpc": "03010314501",
            "name": "គង់ សក់"
        },
        {
            "barcode": "BBWS180210325",
            "dpc": "03010314701",
            "name": "ឃួន ផន"
        },
        {
            "barcode": "BBWS180210326",
            "dpc": "03010314801",
            "name": "កែវ ម៉ូរ៉ាគន្ធ"
        },
        {
            "barcode": "BBWS180210327",
            "dpc": "03010314901",
            "name": "សំ សែម"
        },
        {
            "barcode": "BBWS180210328",
            "dpc": "03010315001",
            "name": "មុំ រ៉ៃ"
        },
        {
            "barcode": "BBWS180210329",
            "dpc": "03010315201",
            "name": "អ៊ុំ ម៉ាលី"
        },
        {
            "barcode": "BBWS180210330",
            "dpc": "03010315101",
            "name": "កៅ ថា"
        },
        {
            "barcode": "BBWS180210331",
            "dpc": "03010315301",
            "name": "ម៉ិល ហេង"
        },
        {
            "barcode": "BBWS180210332",
            "dpc": "03010315401",
            "name": "មាស ស្រាង"
        },
        {
            "barcode": "BBWS180210333",
            "dpc": "03010315501",
            "name": "ហង្ស ស៊ីណា"
        },
        {
            "barcode": "BBWS180210334",
            "dpc": "03010315601",
            "name": "សុទ្ធ ឈឿម"
        },
        {
            "barcode": "BBWS180210335",
            "dpc": "03010318401",
            "name": "សុក សោភា"
        },
        {
            "barcode": "BBWS180210336",
            "dpc": "03010318501",
            "name": "ម៉ាច គឹមឆាយ"
        },
        {
            "barcode": "BBWS180210337",
            "dpc": "03010318601",
            "name": "មៀន គឹមហ៊ាង"
        },
        {
            "barcode": "BBWS180210338",
            "dpc": "03010318801",
            "name": "ទេព សោភ័ណ្ឌ"
        },
        {
            "barcode": "BBWS180210339",
            "dpc": "03010318901",
            "name": "ម៉ន រ៉ែត"
        },
        {
            "barcode": "BBWS180210340",
            "dpc": "03010319001",
            "name": "ផាត់ សេង"
        },
        {
            "barcode": "BBWS180210341",
            "dpc": "03010319101",
            "name": "ឡេង ជីវ"
        },
        {
            "barcode": "BBWS180210342",
            "dpc": "03010319901",
            "name": "ភិវ ចំរើន"
        },
        {
            "barcode": "BBWS180210343",
            "dpc": "03010317601",
            "name": "ឥត ចំណាន"
        },
        {
            "barcode": "BBWS180210344",
            "dpc": "03010317701",
            "name": "កៀវ គឹមលន"
        },
        {
            "barcode": "BBWS180210345",
            "dpc": "03010317801",
            "name": "ចៅ គឹមអូន ១"
        },
        {
            "barcode": "BBWS180210346",
            "dpc": "03010317901",
            "name": "ចៅ គឹមអូន ២"
        },
        {
            "barcode": "BBWS180210347",
            "dpc": "03010318101",
            "name": "រស់ សារួន"
        },
        {
            "barcode": "BBWS180210348",
            "dpc": "03010318201",
            "name": "ឡាយ ទិតដារ៉ា"
        },
        {
            "barcode": "BBWS180210349",
            "dpc": "03010318301",
            "name": "ភឿក រ័ត្ន"
        },
        {
            "barcode": "BBWS180210350",
            "dpc": "03010315701",
            "name": "យក់ វ៉ានឆវី"
        },
        {
            "barcode": "BBWS180210351",
            "dpc": "03010315801",
            "name": "កែវ ដារ៉ា"
        },
        {
            "barcode": "BBWS180210352",
            "dpc": "03010315901",
            "name": "លឹម សាម៉េត"
        },
        {
            "barcode": "BBWS180210353",
            "dpc": "03010316101",
            "name": "ស៊ាង យ៉ាងហ្គោ"
        },
        {
            "barcode": "BBWS180210354",
            "dpc": "03010316601",
            "name": "លួង ឡេង"
        },
        {
            "barcode": "BBWS180210355",
            "dpc": "03010316701",
            "name": "ប៉ាន ប៊ុនរឿន"
        },
        {
            "barcode": "BBWS180210356",
            "dpc": "03010316501",
            "name": "ម៉ី ប៊ុនហួរ១"
        },
        {
            "barcode": "BBWS180210357",
            "dpc": "03010316201",
            "name": "ម៉ី ប៊ុនហូរ"
        },
        {
            "barcode": "BBWS180210358",
            "dpc": "03010316901",
            "name": "ឡឹក សុខុន"
        },
        {
            "barcode": "BBWS180210359",
            "dpc": "03010316801",
            "name": "ទូច លន"
        },
        {
            "barcode": "BBWS180210360",
            "dpc": "03010316301",
            "name": "នូវ សុភាព ១"
        },
        {
            "barcode": "BBWS180210361",
            "dpc": "03010317101",
            "name": "អ៊ុក សឿន"
        },
        {
            "barcode": "BBWS180210362",
            "dpc": "03010317201",
            "name": "គុណ សាលឿត"
        },
        {
            "barcode": "BBWS180210363",
            "dpc": "03010317301",
            "name": "កែវ ភ័ក្រ្ត"
        },
        {
            "barcode": "BBWS180210364",
            "dpc": "03010317401",
            "name": "សៅ សុជាតិ ១"
        },
        {
            "barcode": "BBWS180210365",
            "dpc": "03010317501",
            "name": "សៅ សុជាតិ ២"
        },
        {
            "barcode": "BBWS180210366",
            "dpc": "03010318001",
            "name": "ចៅ  គឹមអូន ៣"
        },
        {
            "barcode": "BBWS180210367",
            "dpc": "03010338501",
            "name": "លី យូសូស"
        },
        {
            "barcode": "BBWS180210368",
            "dpc": "03010300401",
            "name": "ជឹម ឈិញ"
        },
        {
            "barcode": "BBWS180210369",
            "dpc": "03010338601",
            "name": "ហួយ ហុង"
        },
        {
            "barcode": "BBWS180210370",
            "dpc": "03010338701",
            "name": "ស្រី ល័ក្ខ"
        },
        {
            "barcode": "BBWS180210371",
            "dpc": "03010338801",
            "name": "ប្រាង ភឿត"
        },
        {
            "barcode": "BBWS180210372",
            "dpc": "03010338901",
            "name": "សេង ហូរ"
        },
        {
            "barcode": "BBWS180210373",
            "dpc": "03010339001",
            "name": "យ៉ាត ចរិយា"
        },
        {
            "barcode": "BBWS180210374",
            "dpc": "03010339101",
            "name": "អ៊ុល រឿន"
        },
        {
            "barcode": "BBWS180210375",
            "dpc": "03010339201",
            "name": "អ៊ាប វិសាល"
        },
        {
            "barcode": "BBWS180210376",
            "dpc": "03010339301",
            "name": "សយ សាវិច"
        },
        {
            "barcode": "BBWS180210377",
            "dpc": "03010339401",
            "name": "ជឿម ឃុន"
        },
        {
            "barcode": "BBWS180210378",
            "dpc": "03010339501",
            "name": "ទុំ ប៊ុនធៀន"
        },
        {
            "barcode": "BBWS180210379",
            "dpc": "03010321401",
            "name": "ឆឹង ដួង"
        },
        {
            "barcode": "BBWS180210380",
            "dpc": "03010321301",
            "name": "ជា គឹមឈាង"
        },
        {
            "barcode": "BBWS180210381",
            "dpc": "03010321201",
            "name": "ហុង គុយ"
        },
        {
            "barcode": "BBWS180210382",
            "dpc": "03010320901",
            "name": "ទូច ហួត"
        },
        {
            "barcode": "BBWS180210383",
            "dpc": "03010320501",
            "name": "សាយ សុភាព"
        },
        {
            "barcode": "BBWS180210384",
            "dpc": "03010320101",
            "name": "មឹង សួន"
        },
        {
            "barcode": "BBWS180210385",
            "dpc": "03010320001",
            "name": "ស ធុច"
        },
        {
            "barcode": "BBWS180210386",
            "dpc": "03010319801",
            "name": "ម៉ី ផាន់ណារិទ្ធ"
        },
        {
            "barcode": "BBWS180210387",
            "dpc": "03010319401",
            "name": "ស្រី ឆូ"
        },
        {
            "barcode": "BBWS180210388",
            "dpc": "03010319601",
            "name": "តោ សាហឿយ"
        },
        {
            "barcode": "BBWS180210389",
            "dpc": "03010319501",
            "name": "តោ ហ៊ុន"
        },
        {
            "barcode": "BBWS180210390",
            "dpc": "03010326701",
            "name": "លាស គួយ"
        },
        {
            "barcode": "BBWS180210391",
            "dpc": "03010326601",
            "name": "ភិន វណ្ណា"
        },
        {
            "barcode": "BBWS180210392",
            "dpc": "03010338401",
            "name": "គង់ ឈួន"
        },
        {
            "barcode": "BBWS180210393",
            "dpc": "03010326501",
            "name": "ងួន កិត្យា"
        },
        {
            "barcode": "BBWS180210394",
            "dpc": "03010326401",
            "name": "ឆឹង ឈួម"
        },
        {
            "barcode": "BBWS180210395",
            "dpc": "03010326301",
            "name": "ឆយ ម៉ូវធាង"
        },
        {
            "barcode": "BBWS180210396",
            "dpc": "03010326201",
            "name": "វ៉ាន់ ឃាង"
        },
        {
            "barcode": "BBWS180210397",
            "dpc": "03010326101",
            "name": "ប៉ក ចាន់"
        },
        {
            "barcode": "BBWS180210398",
            "dpc": "03010326001",
            "name": "ប៉ូយ ហ៊ីម"
        },
        {
            "barcode": "BBWS180210399",
            "dpc": "03010325901",
            "name": "អេង ង៉ោ"
        },
        {
            "barcode": "BBWS180210400",
            "dpc": "03010325801",
            "name": "សុខ អឿន"
        },
        {
            "barcode": "BBWS180210401",
            "dpc": "03010325701",
            "name": "ឆឹង ឆាង"
        },
        {
            "barcode": "BBWS180210402",
            "dpc": "03010325601",
            "name": "សន ផាន់នី"
        },
        {
            "barcode": "BBWS180210403",
            "dpc": "03010325401",
            "name": "ប៉ែន សំបូរ"
        },
        {
            "barcode": "BBWS180210404",
            "dpc": "03010325301",
            "name": "មុំ វ៉ាត"
        },
        {
            "barcode": "BBWS180210405",
            "dpc": "03010325501",
            "name": "ឡុង សុផាន"
        },
        {
            "barcode": "BBWS180210406",
            "dpc": "03010325201",
            "name": "ឡេង សុវណ្ណារ៉ា"
        },
        {
            "barcode": "BBWS180210407",
            "dpc": "03010325101",
            "name": "សៀង សាវឿន"
        },
        {
            "barcode": "BBWS180210408",
            "dpc": "03010325001",
            "name": "ស ចាន់ថា"
        },
        {
            "barcode": "BBWS180210409",
            "dpc": "03010324901",
            "name": "ព្រែក ថា"
        },
        {
            "barcode": "BBWS180210410",
            "dpc": "03010324801",
            "name": "ហោ ផល្លី"
        },
        {
            "barcode": "BBWS180210411",
            "dpc": "03010324701",
            "name": "គុយ ចាន់ធូ"
        },
        {
            "barcode": "BBWS180210412",
            "dpc": "03010324601",
            "name": "ហាក គឹមលាង"
        },
        {
            "barcode": "BBWS180210413",
            "dpc": "03010324201",
            "name": "អួង បូរ៉ាផា"
        },
        {
            "barcode": "BBWS180210414",
            "dpc": "03010324401",
            "name": "មាស ផុន"
        },
        {
            "barcode": "BBWS180210415",
            "dpc": "03010324501",
            "name": "ហុក លាភ"
        },
        {
            "barcode": "BBWS180210416",
            "dpc": "03010324301",
            "name": "គី ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "BBWS180210417",
            "dpc": "03010324101",
            "name": "ឈិន សុផានី"
        },
        {
            "barcode": "BBWS180210418",
            "dpc": "03010323901",
            "name": "អេង សាលឿន"
        },
        {
            "barcode": "BBWS180210419",
            "dpc": "03010323801",
            "name": "ឆោម គឹមយួង"
        },
        {
            "barcode": "BBWS180210420",
            "dpc": "03010323701",
            "name": "ទឹម សេរី"
        },
        {
            "barcode": "BBWS180210421",
            "dpc": "03010323601",
            "name": "ឃួន ស៊ាប"
        },
        {
            "barcode": "BBWS180210422",
            "dpc": "03010323501",
            "name": "អឿម ប៊ុណ្ណា"
        },
        {
            "barcode": "BBWS180210423",
            "dpc": "03010323401",
            "name": "លាន នី"
        },
        {
            "barcode": "BBWS180210424",
            "dpc": "03010323301",
            "name": "សយ សារ៉ន"
        },
        {
            "barcode": "BBWS180210425",
            "dpc": "03010323201",
            "name": "ខុង ធួក"
        },
        {
            "barcode": "BBWS180210426",
            "dpc": "03010323101",
            "name": "អ៊ុក សំផុន"
        },
        {
            "barcode": "BBWS180210427",
            "dpc": "03010323001",
            "name": "សយ រៀង"
        },
        {
            "barcode": "BBWS180210428",
            "dpc": "03010322801",
            "name": "សូ ផេងគុណ"
        },
        {
            "barcode": "BBWS180210429",
            "dpc": "03010322701",
            "name": "ហួត  គីរីរិត"
        },
        {
            "barcode": "BBWS180210430",
            "dpc": "03010322601",
            "name": "ភឿប​ ផាយោ"
        },
        {
            "barcode": "BBWS180210431",
            "dpc": "03010322501",
            "name": "សោ គឹមឡាយ"
        },
        {
            "barcode": "BBWS180210432",
            "dpc": "03010322401",
            "name": "រ៉ែត គុណធារី"
        },
        {
            "barcode": "BBWS180210433",
            "dpc": "03010322301",
            "name": "សុខ វិបុល"
        },
        {
            "barcode": "BBWS180210434",
            "dpc": "03010322201",
            "name": "ខាត់ ឡុង"
        },
        {
            "barcode": "BBWS180210435",
            "dpc": "03010322901",
            "name": "ឈុត សុគន្ធា"
        },
        {
            "barcode": "BBWS180210436",
            "dpc": "03010322101",
            "name": "ថៃ ហេង"
        },
        {
            "barcode": "BBWS180210437",
            "dpc": "03010321901",
            "name": "បេង សុធី"
        },
        {
            "barcode": "BBWS180210438",
            "dpc": "03010321801",
            "name": "ហុង វណ្ណារិទ្ធ"
        },
        {
            "barcode": "BBWS180210439",
            "dpc": "03010321601",
            "name": "តាន់ សិទ្ធ"
        },
        {
            "barcode": "BBWS180210440",
            "dpc": "03010321701",
            "name": "យ៉ាត ថូ"
        },
        {
            "barcode": "BBWS180210441",
            "dpc": "03010321501",
            "name": "សំ វ៉ានថុល"
        },
        {
            "barcode": "BBWS180210442",
            "dpc": "03010342101",
            "name": "កែវ ម៉ាន់ធឿន"
        },
        {
            "barcode": "BBWS180210443",
            "dpc": "03010342201",
            "name": "សាង សាវុន"
        },
        {
            "barcode": "BBWS180210444",
            "dpc": "03010342401",
            "name": "ភឹម ហេង"
        },
        {
            "barcode": "BBWS180210445",
            "dpc": "03010342501",
            "name": "តាំង ម៉េង"
        },
        {
            "barcode": "BBWS180210446",
            "dpc": "03010342601",
            "name": "ងួន រតនៈ ២"
        },
        {
            "barcode": "BBWS180210447",
            "dpc": "03010342701",
            "name": "ឆយ ម៉ូវធៀង"
        },
        {
            "barcode": "BBWS180210448",
            "dpc": "03010342901",
            "name": "ឈឿត សំខាន់"
        },
        {
            "barcode": "BBWS180210449",
            "dpc": "03010342801",
            "name": "ហេង ហៀង"
        },
        {
            "barcode": "BBWS180210450",
            "dpc": "03010343001",
            "name": "ងិន ណារី"
        },
        {
            "barcode": "BBWS180210451",
            "dpc": "03010343101",
            "name": "សឹង កាក់"
        },
        {
            "barcode": "BBWS180210452",
            "dpc": "03010343201",
            "name": "អៀរ រិទ្ធី"
        },
        {
            "barcode": "BBWS180210453",
            "dpc": "03010343301",
            "name": "ប៉េង រ៉ាដេត"
        },
        {
            "barcode": "BBWS180210454",
            "dpc": "03010343401",
            "name": "ឃុន កី"
        },
        {
            "barcode": "BBWS180210455",
            "dpc": "03010343501",
            "name": "ចាន់ គឹមឡេង"
        },
        {
            "barcode": "BBWS180210456",
            "dpc": "03010343601",
            "name": "គី គឹមឡេង"
        },
        {
            "barcode": "BBWS180210457",
            "dpc": "03010343701",
            "name": "សយ ឈួន"
        },
        {
            "barcode": "BBWS180210458",
            "dpc": "03010343801",
            "name": "សឿន ឃឿប"
        },
        {
            "barcode": "BBWS180210459",
            "dpc": "03010343901",
            "name": "ក្រូច គីរី"
        },
        {
            "barcode": "BBWS180210460",
            "dpc": "03010344001",
            "name": "សាត សុខុំ"
        },
        {
            "barcode": "BBWS180210461",
            "dpc": "03010344101",
            "name": "ធូ ធិន"
        },
        {
            "barcode": "BBWS180210462",
            "dpc": "03010344901",
            "name": "ឆឺយ ស៊ីន"
        },
        {
            "barcode": "BBWS180210463",
            "dpc": "03010344701",
            "name": "សុខ លាងហួយ"
        },
        {
            "barcode": "BBWS180210464",
            "dpc": "03010344601",
            "name": "គឹម ហ្គិច"
        },
        {
            "barcode": "BBWS180210465",
            "dpc": "03010344501",
            "name": "រ័ត្ន វ៉ាន់"
        },
        {
            "barcode": "BBWS180210466",
            "dpc": "03010344301",
            "name": "អ៊ុន ឆៃហ៊ាង"
        },
        {
            "barcode": "BBWS180210467",
            "dpc": "03010344201",
            "name": "ទី ផាត"
        },
        {
            "barcode": "BBWS180210468",
            "dpc": "03010345201",
            "name": "ស៊ុយ សុវណ្ណមន្នី"
        },
        {
            "barcode": "BBWS180210469",
            "dpc": "03010345101",
            "name": "ហ៊ិន ស៊ីប៉ិច"
        },
        {
            "barcode": "BBWS180210470",
            "dpc": "03010345001",
            "name": "សាលាឃុំព្រែកព្រះស្តេច"
        },
        {
            "barcode": "BBWS180210471",
            "dpc": "03010337801",
            "name": "សៀង  លីម"
        },
        {
            "barcode": "BBWS180210472",
            "dpc": "03010344801",
            "name": "គង់ បណ្តូល"
        },
        {
            "barcode": "BBWS180210473",
            "dpc": "03010345501",
            "name": "ហេង ពៅ"
        },
        {
            "barcode": "BBWS180210474",
            "dpc": "03010345301",
            "name": "វិទ្យាស្ថានអភិវឌ្ឍន៍"
        },
        {
            "barcode": "BBWS180210475",
            "dpc": "03010345401",
            "name": "ងួន គង់"
        },
        {
            "barcode": "BBWS180210476",
            "dpc": "03010345601",
            "name": "សឿន ស៊ីថា"
        },
        {
            "barcode": "BBWS180210477",
            "dpc": "03010345701",
            "name": "អ៊ុក សាវុន"
        },
        {
            "barcode": "BBWS180210478",
            "dpc": "03010345801",
            "name": "ទឹម ដារ៉េត"
        },
        {
            "barcode": "BBWS180210479",
            "dpc": "03010345901",
            "name": "ឡាច លីម"
        },
        {
            "barcode": "BBWS180210480",
            "dpc": "03010346001",
            "name": "ចាន់ ទូច"
        },
        {
            "barcode": "BBWS180210481",
            "dpc": "03010346101",
            "name": "ម៉ា ម៉ុន្ថា"
        },
        {
            "barcode": "BBWS180210482",
            "dpc": "03010346201",
            "name": "ចាន់ រ៉ា"
        },
        {
            "barcode": "BBWS180210483",
            "dpc": "03010346301",
            "name": "អោម ភាព"
        },
        {
            "barcode": "BBWS180210484",
            "dpc": "03010346401",
            "name": "ងួន ប៊ុនណា"
        },
        {
            "barcode": "BBWS180210485",
            "dpc": "03010346501",
            "name": "ជឹម  ជឿន"
        },
        {
            "barcode": "BBWS180210486",
            "dpc": "03010346801",
            "name": "ឡុង ហុកម៉េង"
        },
        {
            "barcode": "BBWS180210487",
            "dpc": "03010346601",
            "name": "សន សុផាន់នី"
        },
        {
            "barcode": "BBWS180210488",
            "dpc": "03010346901",
            "name": "លន់ ហ៊ិន"
        },
        {
            "barcode": "BBWS180210489",
            "dpc": "03010347001",
            "name": "ខាត់ ជុន"
        },
        {
            "barcode": "BBWS180210490",
            "dpc": "03010347101",
            "name": "យន់ រ៉ាវី"
        },
        {
            "barcode": "BBWS180210491",
            "dpc": "03010347401",
            "name": "ប៉ាវ ចាន់ដារ៉ា"
        },
        {
            "barcode": "BBWS180210492",
            "dpc": "03010339601",
            "name": "គឹម ភិគុណ"
        },
        {
            "barcode": "BBWS180210493",
            "dpc": "03010339701",
            "name": "នន់ នៅ"
        },
        {
            "barcode": "BBWS180210494",
            "dpc": "03010340001",
            "name": "ឃឹម សាវុធ"
        },
        {
            "barcode": "BBWS180210495",
            "dpc": "03010339901",
            "name": "ទិត និត"
        },
        {
            "barcode": "BBWS180210496",
            "dpc": "03010340101",
            "name": "យ៉ាន ធី"
        },
        {
            "barcode": "BBWS180210497",
            "dpc": "03010340201",
            "name": "ជា ណាវី"
        },
        {
            "barcode": "BBWS180210498",
            "dpc": "03010340301",
            "name": "ឈួន សំណាង"
        },
        {
            "barcode": "BBWS180210499",
            "dpc": "03010340401",
            "name": "កាំង មាឌ"
        },
        {
            "barcode": "BBWS180210500",
            "dpc": "03010340501",
            "name": "ស៊ីម ហុង"
        },
        {
            "barcode": "BBWS180210501",
            "dpc": "03010340701",
            "name": "ឡាយ សារ៉ុង"
        },
        {
            "barcode": "BBWS180210502",
            "dpc": "03010340601",
            "name": "ចាយ សំណាង"
        },
        {
            "barcode": "BBWS180210503",
            "dpc": "03010340801",
            "name": "ភេង សាធី"
        },
        {
            "barcode": "BBWS180210504",
            "dpc": "03010340901",
            "name": "ចាន់ វណ្ណៈ"
        },
        {
            "barcode": "BBWS180210505",
            "dpc": "03010341001",
            "name": "ប៉ែន តាន់"
        },
        {
            "barcode": "BBWS180210506",
            "dpc": "03010341101",
            "name": "ម៉ាន់ សូនី"
        },
        {
            "barcode": "BBWS180210507",
            "dpc": "03010341201",
            "name": "គឹម ចាន់"
        },
        {
            "barcode": "BBWS180210508",
            "dpc": "03010341301",
            "name": "អ៊ុល កញ្ញា"
        },
        {
            "barcode": "BBWS180210509",
            "dpc": "03010341401",
            "name": "ទេព កុសល"
        },
        {
            "barcode": "BBWS180210510",
            "dpc": "03010341501",
            "name": "ញ៉ូ សាអ៊ីម"
        },
        {
            "barcode": "BBWS180210511",
            "dpc": "03010341601",
            "name": "ញ៉ូ សុផារី"
        },
        {
            "barcode": "BBWS180210512",
            "dpc": "03010341701",
            "name": "កែវ ឡុង"
        },
        {
            "barcode": "BBWS180210513",
            "dpc": "03010341801",
            "name": "ម៉ាត់ យើ"
        },
        {
            "barcode": "BBWS180210514",
            "dpc": "03010341901",
            "name": "ម៉ាត់ លះ"
        },
        {
            "barcode": "BBWS180210515",
            "dpc": "03010342001",
            "name": "ម៉ាត់ យ៉ាន"
        },
        {
            "barcode": "BBWS180210516",
            "dpc": "03010346701",
            "name": "រី ចាន់ដូ"
        },
        {
            "barcode": "BBWS180210517",
            "dpc": "03010347201",
            "name": "ហ៊ីម សុភាព"
        },
        {
            "barcode": "BBWS180210518",
            "dpc": "03010347301",
            "name": "ចាប សារី"
        },
        {
            "barcode": "BBWS180210519",
            "dpc": "03010347501",
            "name": "ឃ្លាំង សូគីម៉ិច"
        },
        {
            "barcode": "BBWS180210520",
            "dpc": "03010347601",
            "name": "នង ប៉ុនធឿន"
        },
        {
            "barcode": "BBWS180210521",
            "dpc": "03010347701",
            "name": "ហេង ចាន់ថាវី"
        },
        {
            "barcode": "BBWS180210522",
            "dpc": "03010347801",
            "name": "សំ គឹមហ៊ុន"
        },
        {
            "barcode": "BBWS180210523",
            "dpc": "03010347901",
            "name": "ឃឿ យូលី"
        },
        {
            "barcode": "BBWS180210524",
            "dpc": "03010302601",
            "name": "ឡាយ  ជាង"
        },
        {
            "barcode": "BBWS180210525",
            "dpc": "03010305101",
            "name": "តាន់ បូរ៉ាវណ្ណ"
        },
        {
            "barcode": "BBWS180210526",
            "dpc": "03010310301",
            "name": "ហុង  សុវណ្ណ"
        },
        {
            "barcode": "BBWS180210527",
            "dpc": "03010312201",
            "name": "ស វ៉ាន់ណារ៉េត"
        },
        {
            "barcode": "BBWS180210528",
            "dpc": "03010300101",
            "name": "គង់  យិន"
        },
        {
            "barcode": "BBWS180210529",
            "dpc": "03010300201",
            "name": "គង់  ហាច"
        },
        {
            "barcode": "BBWS180210530",
            "dpc": "03010300301",
            "name": "លួង  ខន"
        },
        {
            "barcode": "BBWS180210531",
            "dpc": "03010300601",
            "name": "ប៉ិច  គឹមលី"
        },
        {
            "barcode": "BBWS180210532",
            "dpc": "03010300701",
            "name": "សៅ  រិន្ទ"
        },
        {
            "barcode": "BBWS180210533",
            "dpc": "03010300801",
            "name": "ម៉ាន់  ឈឿង"
        },
        {
            "barcode": "BBWS180210534",
            "dpc": "03010300901",
            "name": "លី  សំណាង"
        },
        {
            "barcode": "BBWS180210535",
            "dpc": "03010301001",
            "name": "ស៊ីម  សាវុន"
        },
        {
            "barcode": "BBWS180210536",
            "dpc": "03010301101",
            "name": "ជា ខេមរិន"
        },
        {
            "barcode": "BBWS180210537",
            "dpc": "03010301201",
            "name": "ពក  សម្បត្តិ"
        },
        {
            "barcode": "BBWS180210538",
            "dpc": "03010301301",
            "name": "សៅ  ប៊ុនសុង"
        },
        {
            "barcode": "BBWS180210539",
            "dpc": "03010301401",
            "name": "ងឹម ខេមរិទ្ធ"
        },
        {
            "barcode": "BBWS180210540",
            "dpc": "03010301501",
            "name": "ស៊ូ  គឹមហេង"
        },
        {
            "barcode": "BBWS180210541",
            "dpc": "03010301601",
            "name": "លឹម គឹមលាង"
        },
        {
            "barcode": "BBWS180210542",
            "dpc": "03010301701",
            "name": "ស៊ីន ពៅចិន្តា"
        },
        {
            "barcode": "BBWS180210543",
            "dpc": "03010301801",
            "name": "យិន លិននិន"
        },
        {
            "barcode": "BBWS180210544",
            "dpc": "03010301901",
            "name": "ឆាំ សោនីរដ្ឋ"
        },
        {
            "barcode": "BBWS180210545",
            "dpc": "03010302101",
            "name": "រុំ  រ៉េត"
        },
        {
            "barcode": "BBWS180210546",
            "dpc": "03010348001",
            "name": "ភួង សារុំ"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
