let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=

    [
        {
            "barcode": "BBWS180204555",
            "dpc": "03020739801",
            "name": "អ៊ិន យូឃាង"
        },
        {
            "barcode": "BBWS180204556",
            "dpc": "03020737301",
            "name": "វ៉ាន់ចាន់ ធី"
        },
        {
            "barcode": "BBWS180204557",
            "dpc": "03020737401",
            "name": "ទុយ ហួន"
        },
        {
            "barcode": "BBWS180204558",
            "dpc": "03020737501",
            "name": "ឃួន ពុជ"
        },
        {
            "barcode": "BBWS180204559",
            "dpc": "03020737601",
            "name": "ពៅ រដ្ឋា"
        },
        {
            "barcode": "BBWS180204560",
            "dpc": "03020737701",
            "name": "ជុច សារឿត"
        },
        {
            "barcode": "BBWS180204561",
            "dpc": "03020737901",
            "name": "យិន រដ្ឋា"
        },
        {
            "barcode": "BBWS180204562",
            "dpc": "03020737801",
            "name": "ហម វ៉ុង"
        },
        {
            "barcode": "BBWS180204563",
            "dpc": "03020703001",
            "name": "ថាន់ ម៉ុយ"
        },
        {
            "barcode": "BBWS180204564",
            "dpc": "03020702901",
            "name": "ចាប ឃីម"
        },
        {
            "barcode": "BBWS180204565",
            "dpc": "03020707101",
            "name": "អ៊ឹង យក់ឃន"
        },
        {
            "barcode": "BBWS180204566",
            "dpc": "03020706901",
            "name": "ព្រំវិហាសាវ័តថ្មី"
        },
        {
            "barcode": "BBWS180204567",
            "dpc": "03020706801",
            "name": "គុយ ជួយ"
        },
        {
            "barcode": "BBWS180204568",
            "dpc": "03020706701",
            "name": "ធូស ផានណា"
        },
        {
            "barcode": "BBWS180204569",
            "dpc": "03020706601",
            "name": "លឹម  សាមេត"
        },
        {
            "barcode": "BBWS180204570",
            "dpc": "03020706501",
            "name": "ប៉ា ពូន"
        },
        {
            "barcode": "BBWS180204571",
            "dpc": "03020706301",
            "name": "សូ សែម"
        },
        {
            "barcode": "BBWS180204572",
            "dpc": "03020706201",
            "name": "ប៊ុន វណ្ណា"
        },
        {
            "barcode": "BBWS180204573",
            "dpc": "03020706101",
            "name": "ឡាប ម៉ាប់"
        },
        {
            "barcode": "BBWS180204574",
            "dpc": "03020706001",
            "name": "ស្មាន់ សំប៊ុន"
        },
        {
            "barcode": "BBWS180204575",
            "dpc": "03020705901",
            "name": "សោម គង់"
        },
        {
            "barcode": "BBWS180204576",
            "dpc": "03020705801",
            "name": "ចាយ សុធី"
        },
        {
            "barcode": "BBWS180204577",
            "dpc": "03020705701",
            "name": "ការាស់សាំងអូរចារ"
        },
        {
            "barcode": "BBWS180204578",
            "dpc": "03020705601",
            "name": "សំ ស៊ិន"
        },
        {
            "barcode": "BBWS180204579",
            "dpc": "03020705501",
            "name": "ចាន់ ថា"
        },
        {
            "barcode": "BBWS180204580",
            "dpc": "03020705401",
            "name": "សាង ឃៀង"
        },
        {
            "barcode": "BBWS180204581",
            "dpc": "03020705301",
            "name": "ឃួន  ងួន"
        },
        {
            "barcode": "BBWS180204582",
            "dpc": "03020705201",
            "name": "ឈាង គឹមហួ"
        },
        {
            "barcode": "BBWS180204583",
            "dpc": "03020705001",
            "name": "សេង ទូច"
        },
        {
            "barcode": "BBWS180204584",
            "dpc": "03020704901",
            "name": "ឈឹម សួន"
        },
        {
            "barcode": "BBWS180204585",
            "dpc": "03020704801",
            "name": "ព្រុំ ចំរើន"
        },
        {
            "barcode": "BBWS180204586",
            "dpc": "03020704601",
            "name": "កែវ ណារ៉េត"
        },
        {
            "barcode": "BBWS180204587",
            "dpc": "03020704501",
            "name": "ឡាញ់ សំបូរ"
        },
        {
            "barcode": "BBWS180204588",
            "dpc": "03020704401",
            "name": "សាន ងិន"
        },
        {
            "barcode": "BBWS180204589",
            "dpc": "03020704301",
            "name": "យី ស៊ីម"
        },
        {
            "barcode": "BBWS180204590",
            "dpc": "03020704201",
            "name": "លី សារ៉ា"
        },
        {
            "barcode": "BBWS180204591",
            "dpc": "03020704101",
            "name": "ចាន់ សំអាង"
        },
        {
            "barcode": "BBWS180204592",
            "dpc": "03020704001",
            "name": "សេង ប៊ុនថន"
        },
        {
            "barcode": "BBWS180204593",
            "dpc": "03020703901",
            "name": "សុក ផល្លា"
        },
        {
            "barcode": "BBWS180204594",
            "dpc": "03020703801",
            "name": "ខៀវ សំអឿន"
        },
        {
            "barcode": "BBWS180204595",
            "dpc": "03020703701",
            "name": "តៀម  សារ៉េត"
        },
        {
            "barcode": "BBWS180204596",
            "dpc": "03020703601",
            "name": "លក្ខ ទិត្យ"
        },
        {
            "barcode": "BBWS180204597",
            "dpc": "03020703501",
            "name": "ហៀ សោ"
        },
        {
            "barcode": "BBWS180204598",
            "dpc": "03020703401",
            "name": "ជឹម  សារ៉ាយ"
        },
        {
            "barcode": "BBWS180204599",
            "dpc": "03020703301",
            "name": "ខាំ នីន"
        },
        {
            "barcode": "BBWS180204600",
            "dpc": "03020703201",
            "name": "យិន សុពល"
        },
        {
            "barcode": "BBWS180204601",
            "dpc": "03020701601",
            "name": "ង៉ែត យឿន"
        },
        {
            "barcode": "BBWS180204602",
            "dpc": "03020712301",
            "name": "ប៉ា គឹមស៊ត"
        },
        {
            "barcode": "BBWS180204603",
            "dpc": "03020712101",
            "name": "លី តេង"
        },
        {
            "barcode": "BBWS180204604",
            "dpc": "03020711901",
            "name": "ទុយ ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "BBWS180204605",
            "dpc": "03020711701",
            "name": "នួន ញឿត"
        },
        {
            "barcode": "BBWS180204606",
            "dpc": "03020711501",
            "name": "សាន សុភី"
        },
        {
            "barcode": "BBWS180204607",
            "dpc": "03020711401",
            "name": "ម៉ុក ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180204608",
            "dpc": "03020711301",
            "name": "សារិ វណ្ណា"
        },
        {
            "barcode": "BBWS180204609",
            "dpc": "03020711201",
            "name": "ម៉ុក វ៉ាន់ថានី"
        },
        {
            "barcode": "BBWS180204610",
            "dpc": "03020711101",
            "name": "គង់ យ៉ាវ"
        },
        {
            "barcode": "BBWS180204611",
            "dpc": "03020711001",
            "name": "កែវ រ៉េត"
        },
        {
            "barcode": "BBWS180204612",
            "dpc": "03020710901",
            "name": "សុខ ម៉ន"
        },
        {
            "barcode": "BBWS180204613",
            "dpc": "03020710801",
            "name": "កង សុផល"
        },
        {
            "barcode": "BBWS180204614",
            "dpc": "03020710701",
            "name": "លឹម ហួន"
        },
        {
            "barcode": "BBWS180204615",
            "dpc": "03020710601",
            "name": "យាន រ៉ាស៊ីន"
        },
        {
            "barcode": "BBWS180204616",
            "dpc": "03020710501",
            "name": "សួស បូរ"
        },
        {
            "barcode": "BBWS180204617",
            "dpc": "03020710401",
            "name": "ជាង ធី"
        },
        {
            "barcode": "BBWS180204618",
            "dpc": "03020710301",
            "name": "ដាំ ភឿក"
        },
        {
            "barcode": "BBWS180204619",
            "dpc": "03020710201",
            "name": "ឈុន វុន"
        },
        {
            "barcode": "BBWS180204620",
            "dpc": "03020710101",
            "name": "ចាន់ សុន"
        },
        {
            "barcode": "BBWS180204621",
            "dpc": "03020710001",
            "name": "ប៉ី  សំអុល"
        },
        {
            "barcode": "BBWS180204622",
            "dpc": "03020709901",
            "name": "ផ្លុង សារឿន"
        },
        {
            "barcode": "BBWS180204623",
            "dpc": "03020709801",
            "name": "ឌុក ទូច"
        },
        {
            "barcode": "BBWS180204624",
            "dpc": "03020709701",
            "name": "ភី ឈន"
        },
        {
            "barcode": "BBWS180204625",
            "dpc": "03020709601",
            "name": "យ៉ែម ង៉ា"
        },
        {
            "barcode": "BBWS180204626",
            "dpc": "03020709501",
            "name": "កង សារី"
        },
        {
            "barcode": "BBWS180204627",
            "dpc": "03020709401",
            "name": "ងួន វ៉ាន"
        },
        {
            "barcode": "BBWS180204628",
            "dpc": "03020709301",
            "name": "ចាន់ សន"
        },
        {
            "barcode": "BBWS180204629",
            "dpc": "03020709201",
            "name": "វូ ធា"
        },
        {
            "barcode": "BBWS180204630",
            "dpc": "03020709101",
            "name": "អេង សំអាន"
        },
        {
            "barcode": "BBWS180204631",
            "dpc": "03020709001",
            "name": "គង់ សំបូរ"
        },
        {
            "barcode": "BBWS180204632",
            "dpc": "03020708901",
            "name": "សួ គឹមសៀន"
        },
        {
            "barcode": "BBWS180204633",
            "dpc": "03020708801",
            "name": "សួ គឹមសាន"
        },
        {
            "barcode": "BBWS180204634",
            "dpc": "03020708701",
            "name": "ចាន់ តី"
        },
        {
            "barcode": "BBWS180204635",
            "dpc": "03020708601",
            "name": "ម៉ុក សាមឿន"
        },
        {
            "barcode": "BBWS180204636",
            "dpc": "03020708301",
            "name": "រើន ផារី"
        },
        {
            "barcode": "BBWS180204637",
            "dpc": "03020708201",
            "name": "សំ សុខខា"
        },
        {
            "barcode": "BBWS180204638",
            "dpc": "03020708101",
            "name": "ឈឹម ទូច"
        },
        {
            "barcode": "BBWS180204639",
            "dpc": "03020708001",
            "name": "ឈុន ឃី"
        },
        {
            "barcode": "BBWS180204640",
            "dpc": "03020707901",
            "name": "ពិន វ៉ារី"
        },
        {
            "barcode": "BBWS180204641",
            "dpc": "03020707801",
            "name": "យោក  ឆង"
        },
        {
            "barcode": "BBWS180204642",
            "dpc": "03020707701",
            "name": "ឆូយ សុខ"
        },
        {
            "barcode": "BBWS180204643",
            "dpc": "03020707601",
            "name": "នុត ផល្លី"
        },
        {
            "barcode": "BBWS180204644",
            "dpc": "03020707401",
            "name": "សាន់ ចាយ"
        },
        {
            "barcode": "BBWS180204645",
            "dpc": "03020707201",
            "name": "អុំ  ឌុច"
        },
        {
            "barcode": "BBWS180204646",
            "dpc": "03020723701",
            "name": "ឃួន ដេត"
        },
        {
            "barcode": "BBWS180204647",
            "dpc": "03020723601",
            "name": "ស្រី បណ្តូល"
        },
        {
            "barcode": "BBWS180204648",
            "dpc": "03020723501",
            "name": "តោ វុដ្ឋា"
        },
        {
            "barcode": "BBWS180204649",
            "dpc": "03020723401",
            "name": "ផា  សាវឿន"
        },
        {
            "barcode": "BBWS180204650",
            "dpc": "03020723301",
            "name": "អឿង សុខុន"
        },
        {
            "barcode": "BBWS180204651",
            "dpc": "03020723201",
            "name": "កៅ ម៉េងគ្រាន់"
        },
        {
            "barcode": "BBWS180204652",
            "dpc": "03020723101",
            "name": "អួន ចាន់ធីតា"
        },
        {
            "barcode": "BBWS180204653",
            "dpc": "03020723001",
            "name": "សម សាវើន"
        },
        {
            "barcode": "BBWS180204654",
            "dpc": "03020722901",
            "name": "ប្រាជ្ញ រុន"
        },
        {
            "barcode": "BBWS180204655",
            "dpc": "03020722801",
            "name": "ឡៃ សាមុនធី"
        },
        {
            "barcode": "BBWS180204656",
            "dpc": "03020722701",
            "name": "សួស សុម៉ាលី"
        },
        {
            "barcode": "BBWS180204657",
            "dpc": "03020722601",
            "name": "ស្រី រឿន"
        },
        {
            "barcode": "BBWS180204658",
            "dpc": "03020722501",
            "name": "ឃឹម សុផាត់"
        },
        {
            "barcode": "BBWS180204659",
            "dpc": "03020722401",
            "name": "ស៊ូ ណែវ"
        },
        {
            "barcode": "BBWS180204660",
            "dpc": "03020722301",
            "name": "ភោគ សន"
        },
        {
            "barcode": "BBWS180204661",
            "dpc": "03020722201",
            "name": "សុខ ឯម"
        },
        {
            "barcode": "BBWS180204662",
            "dpc": "03020722101",
            "name": "កែវ  សោភ័ណ"
        },
        {
            "barcode": "BBWS180204663",
            "dpc": "03020721801",
            "name": "អ៊ុក ណារិន"
        },
        {
            "barcode": "BBWS180204664",
            "dpc": "03020721701",
            "name": "ស្រី ថែសេង"
        },
        {
            "barcode": "BBWS180204665",
            "dpc": "03020721601",
            "name": "សារិ សុខុម"
        },
        {
            "barcode": "BBWS180204666",
            "dpc": "03020721501",
            "name": "លីម  សែន"
        },
        {
            "barcode": "BBWS180204667",
            "dpc": "03020721301",
            "name": "នួន ញ៉"
        },
        {
            "barcode": "BBWS180204668",
            "dpc": "03020721201",
            "name": "សេង ឡាយ"
        },
        {
            "barcode": "BBWS180204669",
            "dpc": "03020721101",
            "name": "អុំ  ឌឿ"
        },
        {
            "barcode": "BBWS180204670",
            "dpc": "03020714901",
            "name": "ប្រាក់ លឿត"
        },
        {
            "barcode": "BBWS180204671",
            "dpc": "03020714801",
            "name": "ស៊ី ណា"
        },
        {
            "barcode": "BBWS180204672",
            "dpc": "03020714701",
            "name": "ឃុន វណ្ណៈ"
        },
        {
            "barcode": "BBWS180204673",
            "dpc": "03020714601",
            "name": "មាស ទាវ"
        },
        {
            "barcode": "BBWS180204674",
            "dpc": "03020714501",
            "name": "ជា លីខា"
        },
        {
            "barcode": "BBWS180204675",
            "dpc": "03020714401",
            "name": "អោ ភឹម"
        },
        {
            "barcode": "BBWS180204676",
            "dpc": "03020714301",
            "name": "ហេង ឆែម"
        },
        {
            "barcode": "BBWS180204677",
            "dpc": "03020714201",
            "name": "ប៉ែន ណារិទ្ធ"
        },
        {
            "barcode": "BBWS180204678",
            "dpc": "03020713901",
            "name": "អុន  ពិសុទ្ធ"
        },
        {
            "barcode": "BBWS180204679",
            "dpc": "03020713801",
            "name": "ស្រី វ៉ាន"
        },
        {
            "barcode": "BBWS180204680",
            "dpc": "03020713601",
            "name": "ជួប ហាក់"
        },
        {
            "barcode": "BBWS180204681",
            "dpc": "03020713501",
            "name": "មុំ ច្រេន"
        },
        {
            "barcode": "BBWS180204682",
            "dpc": "03020713401",
            "name": "ក្រុមហ៊ុន 016"
        },
        {
            "barcode": "BBWS180204683",
            "dpc": "03020713301",
            "name": "ឡោ សុខជា"
        },
        {
            "barcode": "BBWS180204684",
            "dpc": "03020713201",
            "name": "ប្រេម ឌឿន"
        },
        {
            "barcode": "BBWS180204685",
            "dpc": "03020713101",
            "name": "ប៉ិល សុផល"
        },
        {
            "barcode": "BBWS180204686",
            "dpc": "03020713001",
            "name": "ពូក ធឿន"
        },
        {
            "barcode": "BBWS180204687",
            "dpc": "03020712901",
            "name": "ទ្រី ថា"
        },
        {
            "barcode": "BBWS180204688",
            "dpc": "03020712801",
            "name": "សៀង សុឃៀង"
        },
        {
            "barcode": "BBWS180204689",
            "dpc": "03020712701",
            "name": "ចិន ខ្មៅ(រ៉ាន់)"
        },
        {
            "barcode": "BBWS180204690",
            "dpc": "03020712601",
            "name": "ហ៊ួត  គឹមស៊ា"
        },
        {
            "barcode": "BBWS180204691",
            "dpc": "03020712501",
            "name": "ហោ ហុង"
        },
        {
            "barcode": "BBWS180204692",
            "dpc": "03020712401",
            "name": "អ៊ុយ ចាន់ធន"
        },
        {
            "barcode": "BBWS180204693",
            "dpc": "03020711801",
            "name": "យ៉ោក  សារី"
        },
        {
            "barcode": "BBWS180204694",
            "dpc": "03020721001",
            "name": "នុត ជុន"
        },
        {
            "barcode": "BBWS180204695",
            "dpc": "03020720901",
            "name": "ហុក សារុំ"
        },
        {
            "barcode": "BBWS180204696",
            "dpc": "03020720801",
            "name": "ប៉ាច ផល្លី"
        },
        {
            "barcode": "BBWS180204697",
            "dpc": "03020720701",
            "name": "ប៉ាច សារឿន"
        },
        {
            "barcode": "BBWS180204698",
            "dpc": "03020720601",
            "name": "មាស ពៅ"
        },
        {
            "barcode": "BBWS180204699",
            "dpc": "03020720501",
            "name": "ជួន បុប្ផា"
        },
        {
            "barcode": "BBWS180204700",
            "dpc": "03020720401",
            "name": "យឹម សន្រ្ទីណ៍ (២)"
        },
        {
            "barcode": "BBWS180204701",
            "dpc": "03020720301",
            "name": "យឹម សន្រ្ទីណ៍ (១)"
        },
        {
            "barcode": "BBWS180204702",
            "dpc": "03020720201",
            "name": "តាន់ គឹមស៊ាង"
        },
        {
            "barcode": "BBWS180204703",
            "dpc": "03020720101",
            "name": "ឈូ  អេង"
        },
        {
            "barcode": "BBWS180204704",
            "dpc": "03020720001",
            "name": "ទិស្នាក់ការគណៈបក្ស"
        },
        {
            "barcode": "BBWS180204705",
            "dpc": "03020719901",
            "name": "ប៊ិន សារាយ"
        },
        {
            "barcode": "BBWS180204706",
            "dpc": "03020719801",
            "name": "ភោក គឹមសាន"
        },
        {
            "barcode": "BBWS180204707",
            "dpc": "03020719701",
            "name": "ចាន ប៊ុនរឿន"
        },
        {
            "barcode": "BBWS180204708",
            "dpc": "03020719601",
            "name": "លី គឹមយុន"
        },
        {
            "barcode": "BBWS180204709",
            "dpc": "03020719501",
            "name": "ពិន ស្រីបូរ"
        },
        {
            "barcode": "BBWS180204710",
            "dpc": "03020719401",
            "name": "ញឹក ចាន់ធឿន"
        },
        {
            "barcode": "BBWS180204711",
            "dpc": "03020719301",
            "name": "ទឹម យ៉ន"
        },
        {
            "barcode": "BBWS180204712",
            "dpc": "03020719201",
            "name": "ហម ថន"
        },
        {
            "barcode": "BBWS180204713",
            "dpc": "03020719101",
            "name": "ពឹង សាយហ៊ឺ"
        },
        {
            "barcode": "BBWS180204714",
            "dpc": "03020719001",
            "name": "អេង ធី"
        },
        {
            "barcode": "BBWS180204715",
            "dpc": "03020718901",
            "name": "ស៊ូ ខាសៀង"
        },
        {
            "barcode": "BBWS180204716",
            "dpc": "03020718801",
            "name": "ម៉េង ទូច"
        },
        {
            "barcode": "BBWS180204717",
            "dpc": "03020718701",
            "name": "ង៉ាន ងឹម"
        },
        {
            "barcode": "BBWS180204718",
            "dpc": "03020718601",
            "name": "កើត សេរី"
        },
        {
            "barcode": "BBWS180204719",
            "dpc": "03020718501",
            "name": "រ៉េត សារ៉ែន"
        },
        {
            "barcode": "BBWS180204720",
            "dpc": "03020718401",
            "name": "យ៉យ ហ៊ាន"
        },
        {
            "barcode": "BBWS180204721",
            "dpc": "03020718301",
            "name": "កៅ សាវុទ្ធី"
        },
        {
            "barcode": "BBWS180204722",
            "dpc": "03020718201",
            "name": "ម៉ៅ នី"
        },
        {
            "barcode": "BBWS180204723",
            "dpc": "03020718101",
            "name": "ប៊ុន ថូល"
        },
        {
            "barcode": "BBWS180204724",
            "dpc": "03020717901",
            "name": "ឃ្លាំង យូអ៊ិន"
        },
        {
            "barcode": "BBWS180204725",
            "dpc": "03020717801",
            "name": "អ៊ឹង ឡេងជា"
        },
        {
            "barcode": "BBWS180204726",
            "dpc": "03020717701",
            "name": "ប៊ុន សារុន"
        },
        {
            "barcode": "BBWS180204727",
            "dpc": "03020717601",
            "name": "សុខ គី"
        },
        {
            "barcode": "BBWS180204728",
            "dpc": "03020717401",
            "name": "សុខ វិបុល"
        },
        {
            "barcode": "BBWS180204729",
            "dpc": "03020717301",
            "name": "ជូ វុទ្ធី"
        },
        {
            "barcode": "BBWS180204730",
            "dpc": "03020717201",
            "name": "រ៉ាន បូណាត"
        },
        {
            "barcode": "BBWS180204731",
            "dpc": "03020717101",
            "name": "ឈឹន  សុភា"
        },
        {
            "barcode": "BBWS180204732",
            "dpc": "03020717001",
            "name": "ហេង សារ៉ាន់"
        },
        {
            "barcode": "BBWS180204733",
            "dpc": "03020716901",
            "name": "សាន នី (១)"
        },
        {
            "barcode": "BBWS180204734",
            "dpc": "03020716801",
            "name": "ឈឹម រ៉ាដែន"
        },
        {
            "barcode": "BBWS180204735",
            "dpc": "03020716701",
            "name": "ឈុន ហួរ"
        },
        {
            "barcode": "BBWS180204736",
            "dpc": "03020716601",
            "name": "ចាន់ ឃឿង"
        },
        {
            "barcode": "BBWS180204737",
            "dpc": "03020716401",
            "name": "គឹម ម៉ាលីវាន់ ២"
        },
        {
            "barcode": "BBWS180204738",
            "dpc": "03020716301",
            "name": "គឹម ម៉ាលីវាន់ ១"
        },
        {
            "barcode": "BBWS180204739",
            "dpc": "03020716201",
            "name": "ច័ន្ទ សុគុន"
        },
        {
            "barcode": "BBWS180204740",
            "dpc": "03020716001",
            "name": "សាយ ប៊ុនធី (១)"
        },
        {
            "barcode": "BBWS180204741",
            "dpc": "03020715901",
            "name": "សាយ ប៊ុនធី (២)"
        },
        {
            "barcode": "BBWS180204742",
            "dpc": "03020732701",
            "name": "ឈុត សារិន"
        },
        {
            "barcode": "BBWS180204743",
            "dpc": "03020732601",
            "name": "ប្រឹង ចន្ធូ"
        },
        {
            "barcode": "BBWS180204744",
            "dpc": "03020732501",
            "name": "សុខ ជាតិ"
        },
        {
            "barcode": "BBWS180204745",
            "dpc": "03020732401",
            "name": "យឹម  សារ៉េត"
        },
        {
            "barcode": "BBWS180204746",
            "dpc": "03020730201",
            "name": "គ្រី សម្បត្តិ"
        },
        {
            "barcode": "BBWS180204747",
            "dpc": "03020730101",
            "name": "សុខ សុខខា"
        },
        {
            "barcode": "BBWS180204748",
            "dpc": "03020730001",
            "name": "គិត ដូនារី"
        },
        {
            "barcode": "BBWS180204749",
            "dpc": "03020729901",
            "name": "តាំង ចាន់ធី"
        },
        {
            "barcode": "BBWS180204750",
            "dpc": "03020729801",
            "name": "តែង ឃុនណា"
        },
        {
            "barcode": "BBWS180204751",
            "dpc": "03020729701",
            "name": "ចៅ វ៉ាន់"
        },
        {
            "barcode": "BBWS180204752",
            "dpc": "03020729601",
            "name": "យិន ហួត"
        },
        {
            "barcode": "BBWS180204753",
            "dpc": "03020729501",
            "name": "ម៉ៅ  ហុក"
        },
        {
            "barcode": "BBWS180204754",
            "dpc": "03020729401",
            "name": "ញ៉េប  វ៉ាន់ទី"
        },
        {
            "barcode": "BBWS180204755",
            "dpc": "03020729301",
            "name": "សុខ វិញ"
        },
        {
            "barcode": "BBWS180204756",
            "dpc": "03020729201",
            "name": "ម៉ុង សាង"
        },
        {
            "barcode": "BBWS180204757",
            "dpc": "03020729101",
            "name": "ឆាន់ ស៊ីញ"
        },
        {
            "barcode": "BBWS180204758",
            "dpc": "03020728901",
            "name": "ឡើយ ហេង"
        },
        {
            "barcode": "BBWS180204759",
            "dpc": "03020728701",
            "name": "សេ ហ៊ាង"
        },
        {
            "barcode": "BBWS180204760",
            "dpc": "03020728601",
            "name": "យូ ចាន់ទី"
        },
        {
            "barcode": "BBWS180204761",
            "dpc": "03020728401",
            "name": "សុខ គង់"
        },
        {
            "barcode": "BBWS180204762",
            "dpc": "03020728301",
            "name": "ឆេង ហួរ"
        },
        {
            "barcode": "BBWS180204763",
            "dpc": "03020728201",
            "name": "ជា វ៉ាត់"
        },
        {
            "barcode": "BBWS180204764",
            "dpc": "03020727901",
            "name": "យូ រីតា"
        },
        {
            "barcode": "BBWS180204765",
            "dpc": "03020727801",
            "name": "ភូ ចេង"
        },
        {
            "barcode": "BBWS180204766",
            "dpc": "03020727601",
            "name": "នួន ញ៉"
        },
        {
            "barcode": "BBWS180204767",
            "dpc": "03020713701",
            "name": "ជ្រិន អេង"
        },
        {
            "barcode": "BBWS180204768",
            "dpc": "03020727501",
            "name": "ស យីម"
        },
        {
            "barcode": "BBWS180204769",
            "dpc": "03020727401",
            "name": "ម៉ែន គង់"
        },
        {
            "barcode": "BBWS180204770",
            "dpc": "03020727301",
            "name": "កែវ តឿ"
        },
        {
            "barcode": "BBWS180204771",
            "dpc": "03020727201",
            "name": "លី សុភាព"
        },
        {
            "barcode": "BBWS180204772",
            "dpc": "03020727001",
            "name": "សៅ ចំប៉ី"
        },
        {
            "barcode": "BBWS180204773",
            "dpc": "03020726901",
            "name": "ប៊ុន ឈឿន"
        },
        {
            "barcode": "BBWS180204774",
            "dpc": "03020726801",
            "name": "ថាច់ ហង្ស"
        },
        {
            "barcode": "BBWS180204775",
            "dpc": "03020726701",
            "name": "សាម ភកប៉ា"
        },
        {
            "barcode": "BBWS180204776",
            "dpc": "03020726601",
            "name": "លីន"
        },
        {
            "barcode": "BBWS180204777",
            "dpc": "03020726501",
            "name": "ញឹម សារិទ្ធ"
        },
        {
            "barcode": "BBWS180204778",
            "dpc": "03020726401",
            "name": "បូរ ប៉ុច"
        },
        {
            "barcode": "BBWS180204779",
            "dpc": "03020726301",
            "name": "នន់ គឹមថែ"
        },
        {
            "barcode": "BBWS180204780",
            "dpc": "03020726201",
            "name": "ឌិត សេរីសុផាណ្ណា"
        },
        {
            "barcode": "BBWS180204781",
            "dpc": "03020726101",
            "name": "មីន  សុខាន"
        },
        {
            "barcode": "BBWS180204782",
            "dpc": "03020726001",
            "name": "ស៊ូ ផាន"
        },
        {
            "barcode": "BBWS180204783",
            "dpc": "03020725801",
            "name": "មាស គាំ ៤"
        },
        {
            "barcode": "BBWS180204784",
            "dpc": "03020725701",
            "name": "មាស គាំ ៣"
        },
        {
            "barcode": "BBWS180204785",
            "dpc": "03020725601",
            "name": "មាស គាំ ២"
        },
        {
            "barcode": "BBWS180204786",
            "dpc": "03020725501",
            "name": "មាស គាំ ១"
        },
        {
            "barcode": "BBWS180204787",
            "dpc": "03020725401",
            "name": "ជឹម សុទ្ធា"
        },
        {
            "barcode": "BBWS180204788",
            "dpc": "03020725301",
            "name": "សោម សុភា"
        },
        {
            "barcode": "BBWS180204789",
            "dpc": "03020725201",
            "name": "សំ សារឿន"
        },
        {
            "barcode": "BBWS180204790",
            "dpc": "03020725101",
            "name": "ពៅ បុប្ផា"
        },
        {
            "barcode": "BBWS180204791",
            "dpc": "03020725001",
            "name": "អ៊ុន ចំរើន"
        },
        {
            "barcode": "BBWS180204792",
            "dpc": "03020724901",
            "name": "គឹម សុវណ្ណ"
        },
        {
            "barcode": "BBWS180204793",
            "dpc": "03020724601",
            "name": "តឹក លីម"
        },
        {
            "barcode": "BBWS180204794",
            "dpc": "03020724401",
            "name": "គិន  ភីណា"
        },
        {
            "barcode": "BBWS180204795",
            "dpc": "03020724301",
            "name": "គិន  ចិន្តា"
        },
        {
            "barcode": "BBWS180204796",
            "dpc": "03020724201",
            "name": "រ៉ិល រឿប"
        },
        {
            "barcode": "BBWS180204797",
            "dpc": "03020724101",
            "name": "កែវ  ស៊ីណា"
        },
        {
            "barcode": "BBWS180204798",
            "dpc": "03020724001",
            "name": "ឆន់ ចំរើន"
        },
        {
            "barcode": "BBWS180204799",
            "dpc": "03020723901",
            "name": "លឹម សារិទ្ធ"
        },
        {
            "barcode": "BBWS180204800",
            "dpc": "03020715801",
            "name": "ផន សុភា"
        },
        {
            "barcode": "BBWS180204801",
            "dpc": "03020715701",
            "name": "សាក់ សុខុម"
        },
        {
            "barcode": "BBWS180204802",
            "dpc": "03020715601",
            "name": "ឌី ហុង"
        },
        {
            "barcode": "BBWS180204803",
            "dpc": "03020715501",
            "name": "កែវ គឹមឈៀង"
        },
        {
            "barcode": "BBWS180204804",
            "dpc": "03020715401",
            "name": "ចាន់ ឌី"
        },
        {
            "barcode": "BBWS180204805",
            "dpc": "03020715301",
            "name": "ស្វាយ ផុន"
        },
        {
            "barcode": "BBWS180204806",
            "dpc": "03020715201",
            "name": "ប៉ិច វី"
        },
        {
            "barcode": "BBWS180204807",
            "dpc": "03020715101",
            "name": "សេង លាវ"
        },
        {
            "barcode": "BBWS180204808",
            "dpc": "03020715001",
            "name": "រស់ ភី"
        },
        {
            "barcode": "BBWS180204809",
            "dpc": "03020742101",
            "name": "គា  ខេមរី"
        },
        {
            "barcode": "BBWS180204810",
            "dpc": "03020742001",
            "name": "ចេង  យូអ៊ីម"
        },
        {
            "barcode": "BBWS180204811",
            "dpc": "03020741901",
            "name": "ហេង តាំងស្រេង"
        },
        {
            "barcode": "BBWS180204812",
            "dpc": "03020741801",
            "name": "ឈន   សុបុណ្យ"
        },
        {
            "barcode": "BBWS180204813",
            "dpc": "03020741701",
            "name": "ខាត់  ថន"
        },
        {
            "barcode": "BBWS180204814",
            "dpc": "03020737101",
            "name": "គឹម  ខេត្ត"
        },
        {
            "barcode": "BBWS180204815",
            "dpc": "03020737001",
            "name": "សាយ  ទូច"
        },
        {
            "barcode": "BBWS180204816",
            "dpc": "03020736901",
            "name": "មុំ   សុភាព"
        },
        {
            "barcode": "BBWS180204817",
            "dpc": "03020736801",
            "name": "គង់  ច័ន្ទគ្រឹស្នា"
        },
        {
            "barcode": "BBWS180204818",
            "dpc": "03020736701",
            "name": "ហែម  ធីតា"
        },
        {
            "barcode": "BBWS180204819",
            "dpc": "03020736601",
            "name": "ប៉ែន  លីម"
        },
        {
            "barcode": "BBWS180204820",
            "dpc": "03020736501",
            "name": "វង់  ថាវន"
        },
        {
            "barcode": "BBWS180204821",
            "dpc": "03020736401",
            "name": "ផន   ឆវី"
        },
        {
            "barcode": "BBWS180204822",
            "dpc": "03020736301",
            "name": "ខាវ  ភ័ណ្ឌ"
        },
        {
            "barcode": "BBWS180204823",
            "dpc": "03020736201",
            "name": "នួន   ផល្លា"
        },
        {
            "barcode": "BBWS180204824",
            "dpc": "03020736101",
            "name": "ឈិន  សាន"
        },
        {
            "barcode": "BBWS180204825",
            "dpc": "03020736001",
            "name": "ខឹម  ចេនឡា"
        },
        {
            "barcode": "BBWS180204826",
            "dpc": "03020735901",
            "name": "កៅ   ស៊ីផាន"
        },
        {
            "barcode": "BBWS180204827",
            "dpc": "03020735801",
            "name": "ឆឺយ  សុផល"
        },
        {
            "barcode": "BBWS180204828",
            "dpc": "03020735701",
            "name": "ជ័យ  ស៊ីណេត"
        },
        {
            "barcode": "BBWS180204829",
            "dpc": "03020735601",
            "name": "ទូ  តូនី"
        },
        {
            "barcode": "BBWS180204830",
            "dpc": "03020735501",
            "name": "ហៀង   សុវណ្ណារ៉ា"
        },
        {
            "barcode": "BBWS180204831",
            "dpc": "03020735401",
            "name": "អ៊ឹម  ស្រីមាន"
        },
        {
            "barcode": "BBWS180204832",
            "dpc": "03020735301",
            "name": "សួន   វ៉ុន"
        },
        {
            "barcode": "BBWS180204833",
            "dpc": "03020735201",
            "name": "យ៉ាន់  សារឿន"
        },
        {
            "barcode": "BBWS180204834",
            "dpc": "03020735101",
            "name": "ថៃ  ប៉ៃលីន"
        },
        {
            "barcode": "BBWS180204835",
            "dpc": "03020735001",
            "name": "កាញ ឡេង"
        },
        {
            "barcode": "BBWS180204836",
            "dpc": "03020734901",
            "name": "ម៉ុញ សុគន្ធា"
        },
        {
            "barcode": "BBWS180204837",
            "dpc": "03020734701",
            "name": "អ៊ឹម ប៉េងលី"
        },
        {
            "barcode": "BBWS180204838",
            "dpc": "03020734601",
            "name": "ទូច ឥត"
        },
        {
            "barcode": "BBWS180204839",
            "dpc": "03020734501",
            "name": "ភួង ណាត"
        },
        {
            "barcode": "BBWS180204840",
            "dpc": "03020734401",
            "name": "អុំ  សាវឿន"
        },
        {
            "barcode": "BBWS180204841",
            "dpc": "03020734301",
            "name": "រិទ្ធ សម្បត្តិ"
        },
        {
            "barcode": "BBWS180204842",
            "dpc": "03020734201",
            "name": "អ៊ូ  សារ៉េត"
        },
        {
            "barcode": "BBWS180204843",
            "dpc": "03020734101",
            "name": "ផល សុធា (៣)"
        },
        {
            "barcode": "BBWS180204844",
            "dpc": "03020734001",
            "name": "ហៀង ភារិទ្ធ"
        },
        {
            "barcode": "BBWS180204845",
            "dpc": "03020733901",
            "name": "ផូ នីម"
        },
        {
            "barcode": "BBWS180204846",
            "dpc": "03020733801",
            "name": "ហ៊ីង ស៊ីផេង"
        },
        {
            "barcode": "BBWS180204847",
            "dpc": "03020733701",
            "name": "ផល សុធា"
        },
        {
            "barcode": "BBWS180204848",
            "dpc": "03020733601",
            "name": "អេង ពេជ្ជរា"
        },
        {
            "barcode": "BBWS180204849",
            "dpc": "03020733501",
            "name": "ឃ្លោក  ផល្លា"
        },
        {
            "barcode": "BBWS180204850",
            "dpc": "03020733401",
            "name": "ហួយ ឡុង"
        },
        {
            "barcode": "BBWS180204851",
            "dpc": "03020733301",
            "name": "ត្រៃ  ដុល"
        },
        {
            "barcode": "BBWS180204852",
            "dpc": "03020733201",
            "name": "អ៊ិង គីមឡាយ"
        },
        {
            "barcode": "BBWS180204853",
            "dpc": "03020733101",
            "name": "វណ្ណ ស្រីដា"
        },
        {
            "barcode": "BBWS180204854",
            "dpc": "03020733001",
            "name": "រុន ពៅ"
        },
        {
            "barcode": "BBWS180204855",
            "dpc": "03020732901",
            "name": "យ៉ែម ជា"
        },
        {
            "barcode": "BBWS180204856",
            "dpc": "03020732801",
            "name": "សំ រ៉ងទ្រី"
        },
        {
            "barcode": "BBWS180204857",
            "dpc": "03020732301",
            "name": "ជួប អៀង"
        },
        {
            "barcode": "BBWS180204858",
            "dpc": "03020732201",
            "name": "វ៉ាន់ ប៉េងហ៊ីម"
        },
        {
            "barcode": "BBWS180204859",
            "dpc": "03020732101",
            "name": "ជាម ហេង"
        },
        {
            "barcode": "BBWS180204860",
            "dpc": "03020731901",
            "name": "ចែម ពូន"
        },
        {
            "barcode": "BBWS180204861",
            "dpc": "03020731801",
            "name": "យ៉ែម ចាន់ថន"
        },
        {
            "barcode": "BBWS180204862",
            "dpc": "03020731701",
            "name": "រស់ សុភា"
        },
        {
            "barcode": "BBWS180204863",
            "dpc": "03020731601",
            "name": "សាត  ហ៊ន"
        },
        {
            "barcode": "BBWS180204864",
            "dpc": "03020731501",
            "name": "ផល  សុធា"
        },
        {
            "barcode": "BBWS180204865",
            "dpc": "03020731401",
            "name": "ហម  សារិទ្ធ"
        },
        {
            "barcode": "BBWS180204866",
            "dpc": "03020731301",
            "name": "ចែម  ផាន"
        },
        {
            "barcode": "BBWS180204867",
            "dpc": "03020731201",
            "name": "ស៊ិន ផល្លី"
        },
        {
            "barcode": "BBWS180204868",
            "dpc": "03020731101",
            "name": "រ័ត្ន ម៉េង"
        },
        {
            "barcode": "BBWS180204869",
            "dpc": "03020731001",
            "name": "អ៊ូ  អែល"
        },
        {
            "barcode": "BBWS180204870",
            "dpc": "03020730901",
            "name": "លី    គី"
        },
        {
            "barcode": "BBWS180204871",
            "dpc": "03020730801",
            "name": "ឈួន  ឆែម"
        },
        {
            "barcode": "BBWS180204872",
            "dpc": "03020730701",
            "name": "ភុក  គង់"
        },
        {
            "barcode": "BBWS180204873",
            "dpc": "03020730601",
            "name": "ហ៊ីង   រឿន"
        },
        {
            "barcode": "BBWS180204874",
            "dpc": "03020730401",
            "name": "ម៉ក់  ដានី"
        },
        {
            "barcode": "BBWS180204875",
            "dpc": "03020729001",
            "name": "វ័រ សុកជា"
        },
        {
            "barcode": "BBWS180204876",
            "dpc": "03020728501",
            "name": "ម៉ៃ ម៉ៃ"
        },
        {
            "barcode": "BBWS180204877",
            "dpc": "03020747901",
            "name": "យស់ ហ៊ាង"
        },
        {
            "barcode": "BBWS180204878",
            "dpc": "03020747801",
            "name": "តាំង  ឡេងហ៊ាង"
        },
        {
            "barcode": "BBWS180204879",
            "dpc": "03020747601",
            "name": "តន់ យឿត"
        },
        {
            "barcode": "BBWS180204880",
            "dpc": "03020742701",
            "name": "ជួន ស៊ីណា"
        },
        {
            "barcode": "BBWS180204881",
            "dpc": "03020742301",
            "name": "យី ស៊ូ"
        },
        {
            "barcode": "BBWS180204882",
            "dpc": "03020742201",
            "name": "ព្រំ ឈូវង្ស"
        },
        {
            "barcode": "BBWS180204883",
            "dpc": "03020741601",
            "name": "ម៉ៃ ចាន់ណារី"
        },
        {
            "barcode": "BBWS180204884",
            "dpc": "03020741501",
            "name": "ម៉ែន សៀក"
        },
        {
            "barcode": "BBWS180204885",
            "dpc": "03020741401",
            "name": "ស៊ា លាង"
        },
        {
            "barcode": "BBWS180204886",
            "dpc": "03020741301",
            "name": "អ៊ូច ចាន់ថុន"
        },
        {
            "barcode": "BBWS180204887",
            "dpc": "03020741201",
            "name": "លឹម ឆេង"
        },
        {
            "barcode": "BBWS180204888",
            "dpc": "03020741101",
            "name": "ចាន់ កង"
        },
        {
            "barcode": "BBWS180204889",
            "dpc": "03020741001",
            "name": "ពៅ ហ៊ន"
        },
        {
            "barcode": "BBWS180204890",
            "dpc": "03020740901",
            "name": "សុខ ពីង"
        },
        {
            "barcode": "BBWS180204891",
            "dpc": "03020740801",
            "name": "ហ៊ុន រឿន"
        },
        {
            "barcode": "BBWS180204892",
            "dpc": "03020740701",
            "name": "សម សារ៉ែម"
        },
        {
            "barcode": "BBWS180204893",
            "dpc": "03020740601",
            "name": "សុខ ឡា"
        },
        {
            "barcode": "BBWS180204894",
            "dpc": "03020740501",
            "name": "ឈឹន  ឈឿន"
        },
        {
            "barcode": "BBWS180204895",
            "dpc": "03020740401",
            "name": "ម៉ូល  ង៉េន"
        },
        {
            "barcode": "BBWS180204896",
            "dpc": "03020739901",
            "name": "ហង់ លី"
        },
        {
            "barcode": "BBWS180204897",
            "dpc": "03020739701",
            "name": "សឿម សឿង ១"
        },
        {
            "barcode": "BBWS180204898",
            "dpc": "03020739601",
            "name": "ទុយ សុផល"
        },
        {
            "barcode": "BBWS180204899",
            "dpc": "03020739501",
            "name": "សោម ឈន"
        },
        {
            "barcode": "BBWS180204900",
            "dpc": "03020739401",
            "name": "ហូ ហេង"
        },
        {
            "barcode": "BBWS180204901",
            "dpc": "03020739301",
            "name": "សុខ ធី"
        },
        {
            "barcode": "BBWS180204902",
            "dpc": "03020739201",
            "name": "សោម សារឹម"
        },
        {
            "barcode": "BBWS180204903",
            "dpc": "03020739101",
            "name": "ប៉ិច កក្កដា"
        },
        {
            "barcode": "BBWS180204904",
            "dpc": "03020739001",
            "name": "វ៉ាង វន"
        },
        {
            "barcode": "BBWS180204905",
            "dpc": "03020738901",
            "name": "ប៉ិច ចំណាន"
        },
        {
            "barcode": "BBWS180204906",
            "dpc": "03020738801",
            "name": "អ៊ី សុខុម"
        },
        {
            "barcode": "BBWS180204907",
            "dpc": "03020738701",
            "name": "ង៉ែត ងួន"
        },
        {
            "barcode": "BBWS180204908",
            "dpc": "03020738601",
            "name": "ធួន  ថាវី"
        },
        {
            "barcode": "BBWS180204909",
            "dpc": "03020738501",
            "name": "បួន ឡៃហ៊ាង"
        },
        {
            "barcode": "BBWS180204910",
            "dpc": "03020738301",
            "name": "នៅ​ ចំរើន"
        },
        {
            "barcode": "BBWS180204911",
            "dpc": "03020738201",
            "name": "អៀង ពៅ"
        },
        {
            "barcode": "BBWS180204912",
            "dpc": "03020738101",
            "name": "សួន សុភាព"
        },
        {
            "barcode": "BBWS180204913",
            "dpc": "03020747501",
            "name": "ចៅ ហូវ"
        },
        {
            "barcode": "BBWS180204914",
            "dpc": "03020747401",
            "name": "នង ស៊ីថា ២"
        },
        {
            "barcode": "BBWS180204915",
            "dpc": "03020747301",
            "name": "កាន់ រ៉ា"
        },
        {
            "barcode": "BBWS180204916",
            "dpc": "03020747201",
            "name": "ថ្លាង លឹមម៉ុង"
        },
        {
            "barcode": "BBWS180204917",
            "dpc": "03020747101",
            "name": "យន សាខុន"
        },
        {
            "barcode": "BBWS180204918",
            "dpc": "03020747001",
            "name": "សរ ហេង"
        },
        {
            "barcode": "BBWS180204919",
            "dpc": "03020746901",
            "name": "កែវ ជ្រឹង"
        },
        {
            "barcode": "BBWS180204920",
            "dpc": "03020746801",
            "name": "យ៉ាត កំសាន្ត"
        },
        {
            "barcode": "BBWS180204921",
            "dpc": "03020746701",
            "name": "ហាច ម៉ៅ"
        },
        {
            "barcode": "BBWS180204922",
            "dpc": "03020746601",
            "name": "គឹម ហៀន"
        },
        {
            "barcode": "BBWS180204923",
            "dpc": "03020746501",
            "name": "តូច សំ"
        },
        {
            "barcode": "BBWS180204924",
            "dpc": "03020746401",
            "name": "ស ឡេង"
        },
        {
            "barcode": "BBWS180204925",
            "dpc": "03020746301",
            "name": "ទូច ថុង"
        },
        {
            "barcode": "BBWS180204926",
            "dpc": "03020746201",
            "name": "ម៉ុន វ៉ាត"
        },
        {
            "barcode": "BBWS180204927",
            "dpc": "03020746001",
            "name": "នង ស៊ីថា ១"
        },
        {
            "barcode": "BBWS180204928",
            "dpc": "03020745601",
            "name": "នូវ ផល្លា"
        },
        {
            "barcode": "BBWS180204929",
            "dpc": "03020745201",
            "name": "នូ ហៃ"
        },
        {
            "barcode": "BBWS180204930",
            "dpc": "03020745101",
            "name": "សយ ឡាក់"
        },
        {
            "barcode": "BBWS180204931",
            "dpc": "03020745001",
            "name": "ប៉េង ហួត"
        },
        {
            "barcode": "BBWS180204932",
            "dpc": "03020744901",
            "name": "ហម ហ៊ន"
        },
        {
            "barcode": "BBWS180204933",
            "dpc": "03020744801",
            "name": "អៀង លីវិន"
        },
        {
            "barcode": "BBWS180204934",
            "dpc": "03020744701",
            "name": "អ៊ី អេន"
        },
        {
            "barcode": "BBWS180204935",
            "dpc": "03020744601",
            "name": "ព្រំ  ចន្ថា"
        },
        {
            "barcode": "BBWS180204936",
            "dpc": "03020744501",
            "name": "ម៉ែន ម៉ន"
        },
        {
            "barcode": "BBWS180204937",
            "dpc": "03020744401",
            "name": "បាន ចាន់ណា"
        },
        {
            "barcode": "BBWS180204938",
            "dpc": "03020744201",
            "name": "ផន ខែម"
        },
        {
            "barcode": "BBWS180204939",
            "dpc": "03020744101",
            "name": "លឹម សួន"
        },
        {
            "barcode": "BBWS180204940",
            "dpc": "03020744001",
            "name": "គល់  ភក្តី"
        },
        {
            "barcode": "BBWS180204941",
            "dpc": "03020743901",
            "name": "ឡាច សម្បត្តិ"
        },
        {
            "barcode": "BBWS180204942",
            "dpc": "03020743801",
            "name": "ផន  សុផល"
        },
        {
            "barcode": "BBWS180204943",
            "dpc": "03020743701",
            "name": "លី  ង៉ូវ"
        },
        {
            "barcode": "BBWS180204944",
            "dpc": "03020743601",
            "name": "ដួង  ប្រុស"
        },
        {
            "barcode": "BBWS180204945",
            "dpc": "03020743501",
            "name": "គុំ វន្នី ២"
        },
        {
            "barcode": "BBWS180204946",
            "dpc": "03020743401",
            "name": "សោម  ម៉ៅ"
        },
        {
            "barcode": "BBWS180204947",
            "dpc": "03020743201",
            "name": "សុខ  ឆាវ"
        },
        {
            "barcode": "BBWS180204948",
            "dpc": "03020743101",
            "name": "ឆាយ រ៉ុង"
        },
        {
            "barcode": "BBWS180204949",
            "dpc": "03020743001",
            "name": "ដៀប  ហ៊ួរ"
        },
        {
            "barcode": "BBWS180204950",
            "dpc": "03020742901",
            "name": "ហេង ដាលីន"
        },
        {
            "barcode": "BBWS180204951",
            "dpc": "03020742801",
            "name": "ទី ដេង"
        },
        {
            "barcode": "BBWS180204952",
            "dpc": "03020742601",
            "name": "ផូ ផល"
        },
        {
            "barcode": "BBWS180204953",
            "dpc": "03020742501",
            "name": "ផៃ ប៉េងស៊្រា"
        },
        {
            "barcode": "BBWS180204954",
            "dpc": "03020742401",
            "name": "ជា ទូច"
        },
        {
            "barcode": "BBWS180204955",
            "dpc": "03020740301",
            "name": "ស៊ឹង  ប៉ូយ"
        },
        {
            "barcode": "BBWS180204956",
            "dpc": "03020740201",
            "name": "លឹម ឈាង"
        },
        {
            "barcode": "BBWS180204957",
            "dpc": "03020740101",
            "name": "សួស សុង"
        },
        {
            "barcode": "BBWS180204958",
            "dpc": "03020740001",
            "name": "ចាម ធា"
        },
        {
            "barcode": "BBWS180204959",
            "dpc": "03020746101",
            "name": "អ៊ុយ ម៉េងហួន"
        },
        {
            "barcode": "BBWS180204960",
            "dpc": "03020745901",
            "name": "ភិន ភីរ៉ុង"
        },
        {
            "barcode": "BBWS180204961",
            "dpc": "03020745801",
            "name": "ភិន  ភីរុណ"
        },
        {
            "barcode": "BBWS180204962",
            "dpc": "03020745701",
            "name": "គឹម យី"
        },
        {
            "barcode": "BBWS180204963",
            "dpc": "03020745501",
            "name": "សាយ សារឿន"
        },
        {
            "barcode": "BBWS180204964",
            "dpc": "03020745401",
            "name": "អ៊ូ ភុំ"
        },
        {
            "barcode": "BBWS180204965",
            "dpc": "03020745301",
            "name": "វ៉ាន ផាន"
        },
        {
            "barcode": "BBWS180204966",
            "dpc": "03020744301",
            "name": "ជៀម ផុន"
        },
        {
            "barcode": "BBWS180204967",
            "dpc": "03020714001",
            "name": "ឈួន  ធឿន"
        },
        {
            "barcode": "BBWS180204968",
            "dpc": "03020714101",
            "name": "ខាត់  សំអាត"
        },
        {
            "barcode": "BBWS180204969",
            "dpc": "03020721901",
            "name": "ស៊ុន  ណារី"
        },
        {
            "barcode": "BBWS180204970",
            "dpc": "03020722001",
            "name": "ចក់  រដ្ឋា"
        },
        {
            "barcode": "BBWS180204971",
            "dpc": "03020723801",
            "name": "ឃ្លោត    លឿត"
        },
        {
            "barcode": "BBWS180204972",
            "dpc": "03020727701",
            "name": "ម៉ៅ  សារុំ"
        },
        {
            "barcode": "BBWS180204973",
            "dpc": "03020728801",
            "name": "គឹម  ហួរ"
        },
        {
            "barcode": "BBWS180204974",
            "dpc": "03020730501",
            "name": "ប្រាក់ ឈួន"
        },
        {
            "barcode": "BBWS180204975",
            "dpc": "03020734801",
            "name": "ម៉ុញ៉  សុខា"
        },
        {
            "barcode": "BBWS180204976",
            "dpc": "03020737201",
            "name": "សែ  សារ៉ាន់"
        },
        {
            "barcode": "BBWS180204977",
            "dpc": "03020738401",
            "name": "លឹម  ឡៃហ៊ាង"
        },
        {
            "barcode": "BBWS180204978",
            "dpc": "03020743301",
            "name": "ទូច  ឃៀង"
        },
        {
            "barcode": "BBWS180204979",
            "dpc": "03020700101",
            "name": "លួង  ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180204980",
            "dpc": "03020700201",
            "name": "លៀក  ស៊្រុន"
        },
        {
            "barcode": "BBWS180204981",
            "dpc": "03020700301",
            "name": "ទូច  ម៉ៅ"
        },
        {
            "barcode": "BBWS180204982",
            "dpc": "03020700401",
            "name": "វី  ផា"
        },
        {
            "barcode": "BBWS180204983",
            "dpc": "03020700501",
            "name": "ប៊ុន  វណ្ណះ"
        },
        {
            "barcode": "BBWS180204984",
            "dpc": "03020700601",
            "name": "ឆាយ  លៀប"
        },
        {
            "barcode": "BBWS180204985",
            "dpc": "03020700701",
            "name": "តាំង  ឆេងលី"
        },
        {
            "barcode": "BBWS180204986",
            "dpc": "03020700801",
            "name": "ស្បោង  ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180204987",
            "dpc": "03020700901",
            "name": "កែម  ថា"
        },
        {
            "barcode": "BBWS180204988",
            "dpc": "03020701001",
            "name": "ប៊ុន  ស្រេង"
        },
        {
            "barcode": "BBWS180204989",
            "dpc": "03020701101",
            "name": "ទេស  ស៊ីណា"
        },
        {
            "barcode": "BBWS180204990",
            "dpc": "03020701201",
            "name": "វ័ន  ពន"
        },
        {
            "barcode": "BBWS180204991",
            "dpc": "03020701301",
            "name": "អឿន  ប៉ាក់"
        },
        {
            "barcode": "BBWS180204992",
            "dpc": "03020701401",
            "name": "ងិន  ឆេងអ៊ី"
        },
        {
            "barcode": "BBWS180204993",
            "dpc": "03020701501",
            "name": "បង់  ប៉ុក"
        },
        {
            "barcode": "BBWS180204994",
            "dpc": "03020701701",
            "name": "កូវ  ទៀង"
        },
        {
            "barcode": "BBWS180204995",
            "dpc": "03020701801",
            "name": "គិត  ជី"
        },
        {
            "barcode": "BBWS180204996",
            "dpc": "03020701901",
            "name": "ម៉ី  លី"
        },
        {
            "barcode": "BBWS180204997",
            "dpc": "03020702001",
            "name": "រ័ត្ន  ង៉ែត"
        },
        {
            "barcode": "BBWS180204998",
            "dpc": "03020702201",
            "name": "ព្រំ  សឿន"
        },
        {
            "barcode": "BBWS180204999",
            "dpc": "03020702301",
            "name": "សេក  ឈឺន"
        },
        {
            "barcode": "BBWS180205000",
            "dpc": "03020702401",
            "name": "ឃុន  ធៀន"
        },
        {
            "barcode": "BBWS180205001",
            "dpc": "03020702501",
            "name": "កុយ  វណ្ណា"
        },
        {
            "barcode": "BBWS180205002",
            "dpc": "03020702601",
            "name": "អុំ   ស៊ីម"
        },
        {
            "barcode": "BBWS180205003",
            "dpc": "03020702701",
            "name": "អ៊ូ  លីម"
        },
        {
            "barcode": "BBWS180205004",
            "dpc": "03020702801",
            "name": "លី  វ៉ា"
        },
        {
            "barcode": "BBWS180205005",
            "dpc": "03020724501",
            "name": "ប៊ុន   លី"
        },
        {
            "barcode": "BBWS180205006",
            "dpc": "03020730301",
            "name": "ពិន ដាមរ៉ា"
        },
        {
            "barcode": "BBWS180205007",
            "dpc": "03020748001",
            "name": "គង់ ភីរម្យ"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
