let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=

    [
        {
            "barcode": "BBWS180207630",
            "dpc": "03020842501",
            "name": "រ៉ើន ស៊ិនណារ៉ុង"
        },
        {
            "barcode": "BBWS180207631",
            "dpc": "03020842601",
            "name": "លី ឈៀងហោ"
        },
        {
            "barcode": "BBWS180207632",
            "dpc": "03020842701",
            "name": "ប៉ោ លី"
        },
        {
            "barcode": "BBWS180207633",
            "dpc": "03020842801",
            "name": "ឃុន ជឿន"
        },
        {
            "barcode": "BBWS180207634",
            "dpc": "03020800101",
            "name": "ជ័យ រិទ្ធី"
        },
        {
            "barcode": "BBWS180207635",
            "dpc": "03020843201",
            "name": "អ៊ុំ ប៊ុនធី"
        },
        {
            "barcode": "BBWS180207636",
            "dpc": "03020843301",
            "name": "ទួក ឌិន"
        },
        {
            "barcode": "BBWS180207637",
            "dpc": "03020800401",
            "name": "ស៊ុន សេន"
        },
        {
            "barcode": "BBWS180207638",
            "dpc": "03020843101",
            "name": "ម៉ា ចិន្តា"
        },
        {
            "barcode": "BBWS180207639",
            "dpc": "03020800201",
            "name": "ញឹម សារិន"
        },
        {
            "barcode": "BBWS180207640",
            "dpc": "03020800301",
            "name": "ម៉ិល សុខា"
        },
        {
            "barcode": "BBWS180207641",
            "dpc": "03020800501",
            "name": "បែន សំណាង"
        },
        {
            "barcode": "BBWS180207642",
            "dpc": "03020800601",
            "name": "អ៊ុក ថែ"
        },
        {
            "barcode": "BBWS180207643",
            "dpc": "03020800701",
            "name": "មឿន ភឿន"
        },
        {
            "barcode": "BBWS180207644",
            "dpc": "03020800801",
            "name": "ម៉ា សុខា"
        },
        {
            "barcode": "BBWS180207645",
            "dpc": "03020843401",
            "name": "កែវ វុទ្ធី"
        },
        {
            "barcode": "BBWS180207646",
            "dpc": "03020843501",
            "name": "ងី ផេង"
        },
        {
            "barcode": "BBWS180207647",
            "dpc": "03020843601",
            "name": "សុខ ថា"
        },
        {
            "barcode": "BBWS180207648",
            "dpc": "03020843701",
            "name": "អ៊ុក ធឹម"
        },
        {
            "barcode": "BBWS180207649",
            "dpc": "03020843801",
            "name": "គុយ ងី"
        },
        {
            "barcode": "BBWS180207650",
            "dpc": "03020843901",
            "name": "តាំង សុង"
        },
        {
            "barcode": "BBWS180207651",
            "dpc": "03020844101",
            "name": "ប៊ុន ឡុង"
        },
        {
            "barcode": "BBWS180207652",
            "dpc": "03020844201",
            "name": "ឌិន ប្រង់"
        },
        {
            "barcode": "BBWS180207653",
            "dpc": "03020844301",
            "name": "រស់ ផល"
        },
        {
            "barcode": "BBWS180207654",
            "dpc": "03020844401",
            "name": "សួន ស៊ុនហាក់"
        },
        {
            "barcode": "BBWS180207655",
            "dpc": "03020844501",
            "name": "សេង ឆាង"
        },
        {
            "barcode": "BBWS180207656",
            "dpc": "03020844601",
            "name": "ហេង គីមហុង"
        },
        {
            "barcode": "BBWS180207657",
            "dpc": "03020844701",
            "name": "មណ្ឌលសុខភាព"
        },
        {
            "barcode": "BBWS180207658",
            "dpc": "03020844801",
            "name": "ជ័រ ឃីម"
        },
        {
            "barcode": "BBWS180207659",
            "dpc": "03020844901",
            "name": "រស់ ចំរើន"
        },
        {
            "barcode": "BBWS180207660",
            "dpc": "03020845001",
            "name": "សុខ ឡាវ"
        },
        {
            "barcode": "BBWS180207661",
            "dpc": "03020801101",
            "name": "ទឹម ភាន"
        },
        {
            "barcode": "BBWS180207662",
            "dpc": "03020801201",
            "name": "ទឹម ហាប់"
        },
        {
            "barcode": "BBWS180207663",
            "dpc": "03020801301",
            "name": "ទឹម សុធិន"
        },
        {
            "barcode": "BBWS180207664",
            "dpc": "03020801001",
            "name": "ញឹក សុគន្ធ"
        },
        {
            "barcode": "BBWS180207665",
            "dpc": "03020800901",
            "name": "ប៊ុន សុង"
        },
        {
            "barcode": "BBWS180207666",
            "dpc": "03020801401",
            "name": "ឥន ញ៉ែត"
        },
        {
            "barcode": "BBWS180207667",
            "dpc": "03020801701",
            "name": "យឹម សុវណ្ណី"
        },
        {
            "barcode": "BBWS180207668",
            "dpc": "03020801501",
            "name": "ចាន់ ធី"
        },
        {
            "barcode": "BBWS180207669",
            "dpc": "03020801601",
            "name": "ឈៀង ថុង"
        },
        {
            "barcode": "BBWS180207670",
            "dpc": "03020801801",
            "name": "លឹម គីមអ៊ី"
        },
        {
            "barcode": "BBWS180207671",
            "dpc": "03020801901",
            "name": "ឡុត យាន"
        },
        {
            "barcode": "BBWS180207672",
            "dpc": "03020802001",
            "name": "នូវ រុន"
        },
        {
            "barcode": "BBWS180207673",
            "dpc": "03020802101",
            "name": "ឌុក វ៉ាន់ថា"
        },
        {
            "barcode": "BBWS180207674",
            "dpc": "03020802401",
            "name": "ពុធ ហេង"
        },
        {
            "barcode": "BBWS180207675",
            "dpc": "03020841301",
            "name": "ដុស សារ៉ាត់"
        },
        {
            "barcode": "BBWS180207676",
            "dpc": "03020841101",
            "name": "គុយ ម៉េង"
        },
        {
            "barcode": "BBWS180207677",
            "dpc": "03020841401",
            "name": "ឌុល សុភី"
        },
        {
            "barcode": "BBWS180207678",
            "dpc": "03020841201",
            "name": "យឿន ប៊ុនណារ៉ា"
        },
        {
            "barcode": "BBWS180207679",
            "dpc": "03020841501",
            "name": "ហេង វាសនា"
        },
        {
            "barcode": "BBWS180207680",
            "dpc": "03020841601",
            "name": "អ៊ារ សុភ័ក្រ"
        },
        {
            "barcode": "BBWS180207681",
            "dpc": "03020841701",
            "name": "វ៉ាន់ សាវើយ"
        },
        {
            "barcode": "BBWS180207682",
            "dpc": "03020841801",
            "name": "ហាក់ ហ៊ុយ"
        },
        {
            "barcode": "BBWS180207683",
            "dpc": "03020841901",
            "name": "ដុស វណ្ណា"
        },
        {
            "barcode": "BBWS180207684",
            "dpc": "03020842101",
            "name": "វ៉ាយ សារ ២"
        },
        {
            "barcode": "BBWS180207685",
            "dpc": "03020842201",
            "name": "ពេជ្រ ចំរើន"
        },
        {
            "barcode": "BBWS180207686",
            "dpc": "03020842301",
            "name": "ព្រំ សុខុម"
        },
        {
            "barcode": "BBWS180207687",
            "dpc": "03020842401",
            "name": "ប៊ុន សាវុធ"
        },
        {
            "barcode": "BBWS180207688",
            "dpc": "03020802301",
            "name": "ប៊ុន ប៉ាក់"
        },
        {
            "barcode": "BBWS180207689",
            "dpc": "03020802201",
            "name": "សេង លៀប"
        },
        {
            "barcode": "BBWS180207690",
            "dpc": "03020802501",
            "name": "នាក់ចាន់ ថន"
        },
        {
            "barcode": "BBWS180207691",
            "dpc": "03020802601",
            "name": "ឈឿន ហន"
        },
        {
            "barcode": "BBWS180207692",
            "dpc": "03020802701",
            "name": "រ៉ឹម សុគន្ធ"
        },
        {
            "barcode": "BBWS180207693",
            "dpc": "03020802801",
            "name": "រឹម សារឿត"
        },
        {
            "barcode": "BBWS180207694",
            "dpc": "03020803001",
            "name": "ពៅ បូរិន"
        },
        {
            "barcode": "BBWS180207695",
            "dpc": "03020803101",
            "name": "រស់ ចំរើន"
        },
        {
            "barcode": "BBWS180207696",
            "dpc": "03020803201",
            "name": "ម៉ក់ ហន"
        },
        {
            "barcode": "BBWS180207697",
            "dpc": "03020803301",
            "name": "ឃ្លោក សំបូរ"
        },
        {
            "barcode": "BBWS180207698",
            "dpc": "03020803401",
            "name": "យ៉ាង សៀវសេង"
        },
        {
            "barcode": "BBWS180207699",
            "dpc": "03020803501",
            "name": "ស៊ុន សុភី"
        },
        {
            "barcode": "BBWS180207700",
            "dpc": "03020803601",
            "name": "ឈឹម វុត្ថា"
        },
        {
            "barcode": "BBWS180207701",
            "dpc": "03020803701",
            "name": "លាភ​ ឈន់"
        },
        {
            "barcode": "BBWS180207702",
            "dpc": "03020803801",
            "name": "ម៉ៅ ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180207703",
            "dpc": "03020840601",
            "name": "សែម សោភា"
        },
        {
            "barcode": "BBWS180207704",
            "dpc": "03020818901",
            "name": "នូ កង"
        },
        {
            "barcode": "BBWS180207705",
            "dpc": "03020817401",
            "name": "វិន សាំ"
        },
        {
            "barcode": "BBWS180207706",
            "dpc": "03020818101",
            "name": "ហម សីណា"
        },
        {
            "barcode": "BBWS180207707",
            "dpc": "03020818201",
            "name": "ឆុន សុភាព"
        },
        {
            "barcode": "BBWS180207708",
            "dpc": "03020836001",
            "name": "ឆូយ លាងគីម"
        },
        {
            "barcode": "BBWS180207709",
            "dpc": "03020836101",
            "name": "ហេង ហុង"
        },
        {
            "barcode": "BBWS180207710",
            "dpc": "03020836301",
            "name": "លីវ គៀត"
        },
        {
            "barcode": "BBWS180207711",
            "dpc": "03020836201",
            "name": "ជាង ពៅ"
        },
        {
            "barcode": "BBWS180207712",
            "dpc": "03020836401",
            "name": "សុក ទុយ"
        },
        {
            "barcode": "BBWS180207713",
            "dpc": "03020836501",
            "name": "សៀង តិច"
        },
        {
            "barcode": "BBWS180207714",
            "dpc": "03020836601",
            "name": "តាំង សារ"
        },
        {
            "barcode": "BBWS180207715",
            "dpc": "03020836901",
            "name": "ជូរ ហេង"
        },
        {
            "barcode": "BBWS180207716",
            "dpc": "03020837001",
            "name": "លី ស៊ីវចេង"
        },
        {
            "barcode": "BBWS180207717",
            "dpc": "03020837101",
            "name": "តាំង យី"
        },
        {
            "barcode": "BBWS180207718",
            "dpc": "03020837201",
            "name": "អៀម ពៅ"
        },
        {
            "barcode": "BBWS180207719",
            "dpc": "03020837501",
            "name": "ពេជ្រ ដារ៉ុង"
        },
        {
            "barcode": "BBWS180207720",
            "dpc": "03020837601",
            "name": "ជា ប៉ុង"
        },
        {
            "barcode": "BBWS180207721",
            "dpc": "03020837701",
            "name": "ញ៉ែម ពិសិទ្ធ"
        },
        {
            "barcode": "BBWS180207722",
            "dpc": "03020837801",
            "name": "ខ្លូត ណារ៉ុង"
        },
        {
            "barcode": "BBWS180207723",
            "dpc": "03020837901",
            "name": "សាន ថាន"
        },
        {
            "barcode": "BBWS180207724",
            "dpc": "03020838001",
            "name": "ម៉ែន សុធៃ"
        },
        {
            "barcode": "BBWS180207725",
            "dpc": "03020838101",
            "name": "កែវ ផៃសាន"
        },
        {
            "barcode": "BBWS180207726",
            "dpc": "03020838301",
            "name": "ញឹក សុវណ្ណ"
        },
        {
            "barcode": "BBWS180207727",
            "dpc": "03020838501",
            "name": "ពៅ ពិសិទ្ធ"
        },
        {
            "barcode": "BBWS180207728",
            "dpc": "03020838801",
            "name": "ភឹម គឹមលន់"
        },
        {
            "barcode": "BBWS180207729",
            "dpc": "03020837301",
            "name": "ចៅ គីមយ៉េន"
        },
        {
            "barcode": "BBWS180207730",
            "dpc": "03020837401",
            "name": "ទៀង រតនា"
        },
        {
            "barcode": "BBWS180207731",
            "dpc": "03020838901",
            "name": "គុយ ហ៊ី ១"
        },
        {
            "barcode": "BBWS180207732",
            "dpc": "03020839001",
            "name": "គុយ ហ៊ី ២"
        },
        {
            "barcode": "BBWS180207733",
            "dpc": "03020839601",
            "name": "ចាន ខេមរៈ"
        },
        {
            "barcode": "BBWS180207734",
            "dpc": "03020839401",
            "name": "ឡាយ គុណ"
        },
        {
            "barcode": "BBWS180207735",
            "dpc": "03020839301",
            "name": "ឡាច ហៀក"
        },
        {
            "barcode": "BBWS180207736",
            "dpc": "03020839101",
            "name": "សម សុខា"
        },
        {
            "barcode": "BBWS180207737",
            "dpc": "03020839701",
            "name": "ប្រាក់ ធី"
        },
        {
            "barcode": "BBWS180207738",
            "dpc": "03020839901",
            "name": "ពិន ចាន់ថន"
        },
        {
            "barcode": "BBWS180207739",
            "dpc": "03020840001",
            "name": "លន់ ញឹក"
        },
        {
            "barcode": "BBWS180207740",
            "dpc": "03020840101",
            "name": "ហ៊ុន ណៃ"
        },
        {
            "barcode": "BBWS180207741",
            "dpc": "03020840201",
            "name": "តាំង សុថា"
        },
        {
            "barcode": "BBWS180207742",
            "dpc": "03020840301",
            "name": "សួន សំណាង"
        },
        {
            "barcode": "BBWS180207743",
            "dpc": "03020841001",
            "name": "គឹម ដេត"
        },
        {
            "barcode": "BBWS180207744",
            "dpc": "03020840901",
            "name": "ង៉ោ ច្រុង"
        },
        {
            "barcode": "BBWS180207745",
            "dpc": "03020840801",
            "name": "ម៉េង លាង"
        },
        {
            "barcode": "BBWS180207746",
            "dpc": "03020840701",
            "name": "ឡាំ ហ៊ុល"
        },
        {
            "barcode": "BBWS180207747",
            "dpc": "03020840401",
            "name": "ហេង ថេងហៀង"
        },
        {
            "barcode": "BBWS180207748",
            "dpc": "03020803901",
            "name": "យឹម ឆេង"
        },
        {
            "barcode": "BBWS180207749",
            "dpc": "03020804201",
            "name": "រ៉ែ យ៉ា"
        },
        {
            "barcode": "BBWS180207750",
            "dpc": "03020804301",
            "name": "ណម បាន់នូ"
        },
        {
            "barcode": "BBWS180207751",
            "dpc": "03020804401",
            "name": "ជិន ធៀម"
        },
        {
            "barcode": "BBWS180207752",
            "dpc": "03020804501",
            "name": "លន់ ឈន"
        },
        {
            "barcode": "BBWS180207753",
            "dpc": "03020804001",
            "name": "ហន ណន"
        },
        {
            "barcode": "BBWS180207754",
            "dpc": "03020804101",
            "name": "ភុក ចាន់ណា"
        },
        {
            "barcode": "BBWS180207755",
            "dpc": "03020804601",
            "name": "អ៊ឹង អ៊ាម"
        },
        {
            "barcode": "BBWS180207756",
            "dpc": "03020804701",
            "name": "អ៊ាម ទី"
        },
        {
            "barcode": "BBWS180207757",
            "dpc": "03020804801",
            "name": "អៀម ប៊ិន"
        },
        {
            "barcode": "BBWS180207758",
            "dpc": "03020804901",
            "name": "ប៊ុន ស្រេង"
        },
        {
            "barcode": "BBWS180207759",
            "dpc": "03020805001",
            "name": "ស៊ុន ផាន់ណា"
        },
        {
            "barcode": "BBWS180207760",
            "dpc": "03020805101",
            "name": "ទិត ឡា"
        },
        {
            "barcode": "BBWS180207761",
            "dpc": "03020805201",
            "name": "ជៀវ សានណាវី"
        },
        {
            "barcode": "BBWS180207762",
            "dpc": "03020805301",
            "name": "លឹម អៀវណាំ ១"
        },
        {
            "barcode": "BBWS180207763",
            "dpc": "03020805501",
            "name": "ចែ ទូច"
        },
        {
            "barcode": "BBWS180207764",
            "dpc": "03020806001",
            "name": "អ៊ឹម អ៊ីវ"
        },
        {
            "barcode": "BBWS180207765",
            "dpc": "03020805701",
            "name": "លុក ចន្ថា"
        },
        {
            "barcode": "BBWS180207766",
            "dpc": "03020805601",
            "name": "អ៊ឹម ហួរ"
        },
        {
            "barcode": "BBWS180207767",
            "dpc": "03020806101",
            "name": "ង៉ក់ ធីង"
        },
        {
            "barcode": "BBWS180207768",
            "dpc": "03020806201",
            "name": "អ៊ិម ហួត"
        },
        {
            "barcode": "BBWS180207769",
            "dpc": "03020806301",
            "name": "ណៃ ស៊ាន"
        },
        {
            "barcode": "BBWS180207770",
            "dpc": "03020806401",
            "name": "សេង ទុន"
        },
        {
            "barcode": "BBWS180207771",
            "dpc": "03020806501",
            "name": "សាញ់ សុង"
        },
        {
            "barcode": "BBWS180207772",
            "dpc": "03020806601",
            "name": "ហ៊ីង ណៃស៊ាន"
        },
        {
            "barcode": "BBWS180207773",
            "dpc": "03020806701",
            "name": "សាំង ហយ"
        },
        {
            "barcode": "BBWS180207774",
            "dpc": "03020806801",
            "name": "អ៊ឹម ថាវរី"
        },
        {
            "barcode": "BBWS180207775",
            "dpc": "03020806901",
            "name": "អៀត វុទ្ធី"
        },
        {
            "barcode": "BBWS180207776",
            "dpc": "03020807001",
            "name": "ហ៊ុន លក្ខិណា"
        },
        {
            "barcode": "BBWS180207777",
            "dpc": "03020807101",
            "name": "អោម សុថារី"
        },
        {
            "barcode": "BBWS180207778",
            "dpc": "03020807201",
            "name": "យឹម អៀនគីម"
        },
        {
            "barcode": "BBWS180207779",
            "dpc": "03020828101",
            "name": "សាយ ហុង"
        },
        {
            "barcode": "BBWS180207780",
            "dpc": "03020828001",
            "name": "ប៉ែន សាលី"
        },
        {
            "barcode": "BBWS180207781",
            "dpc": "03020829301",
            "name": "កូ គួយហួង"
        },
        {
            "barcode": "BBWS180207782",
            "dpc": "03020828201",
            "name": "សុខ សូត្រ"
        },
        {
            "barcode": "BBWS180207783",
            "dpc": "03020829201",
            "name": "ស៊ុន តឹក"
        },
        {
            "barcode": "BBWS180207784",
            "dpc": "03020829101",
            "name": "ហ៊ុន ហ៊ីម"
        },
        {
            "barcode": "BBWS180207785",
            "dpc": "03020829001",
            "name": "ក្លឹង នួន"
        },
        {
            "barcode": "BBWS180207786",
            "dpc": "03020828301",
            "name": "វ៉ៃ ប៊ិស"
        },
        {
            "barcode": "BBWS180207787",
            "dpc": "03020828401",
            "name": "សុខ ប៉ោយ"
        },
        {
            "barcode": "BBWS180207788",
            "dpc": "03020828501",
            "name": "វណ្ណ រតនា"
        },
        {
            "barcode": "BBWS180207789",
            "dpc": "03020828601",
            "name": "វឹង មុន្នី"
        },
        {
            "barcode": "BBWS180207790",
            "dpc": "03020828701",
            "name": "សុខ ចាន់រឿន"
        },
        {
            "barcode": "BBWS180207791",
            "dpc": "03020805801",
            "name": "សុខ ធារី"
        },
        {
            "barcode": "BBWS180207792",
            "dpc": "03020805901",
            "name": "លឹម អៀវណាំ ២"
        },
        {
            "barcode": "BBWS180207793",
            "dpc": "03020828801",
            "name": "ទិត្យ អ៊ឹង"
        },
        {
            "barcode": "BBWS180207794",
            "dpc": "03020836801",
            "name": "គឹម ឆាយ"
        },
        {
            "barcode": "BBWS180207795",
            "dpc": "03020836701",
            "name": "តាំង យី ៣"
        },
        {
            "barcode": "BBWS180207796",
            "dpc": "03020827701",
            "name": "ឡេង វួច"
        },
        {
            "barcode": "BBWS180207797",
            "dpc": "03020827801",
            "name": "នេត មុំ"
        },
        {
            "barcode": "BBWS180207798",
            "dpc": "03020827901",
            "name": "ចាន់ សោភា"
        },
        {
            "barcode": "BBWS180207799",
            "dpc": "03020807401",
            "name": "ប៉ាវ សាំងហេង"
        },
        {
            "barcode": "BBWS180207800",
            "dpc": "03020807501",
            "name": "សុខ សាមិត្ត"
        },
        {
            "barcode": "BBWS180207801",
            "dpc": "03020809101",
            "name": "ផន សុផាត"
        },
        {
            "barcode": "BBWS180207802",
            "dpc": "03020807801",
            "name": "គុណ ស្រុន"
        },
        {
            "barcode": "BBWS180207803",
            "dpc": "03020808001",
            "name": "សិត អេងផល"
        },
        {
            "barcode": "BBWS180207804",
            "dpc": "03020808101",
            "name": "លួន សុខនី"
        },
        {
            "barcode": "BBWS180207805",
            "dpc": "03020808201",
            "name": "សុន ទ្រី"
        },
        {
            "barcode": "BBWS180207806",
            "dpc": "03020808301",
            "name": "ហង់ ខន"
        },
        {
            "barcode": "BBWS180207807",
            "dpc": "03020808401",
            "name": "ជា ពៅ"
        },
        {
            "barcode": "BBWS180207808",
            "dpc": "03020807901",
            "name": "សៀង គង់ហេង"
        },
        {
            "barcode": "BBWS180207809",
            "dpc": "03020808601",
            "name": "ខឹម សេង"
        },
        {
            "barcode": "BBWS180207810",
            "dpc": "03020808701",
            "name": "វ៉ែន សាយ"
        },
        {
            "barcode": "BBWS180207811",
            "dpc": "03020808801",
            "name": "សួន ចន្ថា"
        },
        {
            "barcode": "BBWS180207812",
            "dpc": "03020808901",
            "name": "ព្រុំ សារឿន"
        },
        {
            "barcode": "BBWS180207813",
            "dpc": "03020809001",
            "name": "អាង ទូច"
        },
        {
            "barcode": "BBWS180207814",
            "dpc": "03020809201",
            "name": "ឈឹម យ៉ុង"
        },
        {
            "barcode": "BBWS180207815",
            "dpc": "03020809301",
            "name": "កាញ់ សូយ"
        },
        {
            "barcode": "BBWS180207816",
            "dpc": "03020809401",
            "name": "គង់ វណ្ណា"
        },
        {
            "barcode": "BBWS180207817",
            "dpc": "03020825601",
            "name": "គឹម ឡាង"
        },
        {
            "barcode": "BBWS180207818",
            "dpc": "03020825701",
            "name": "គឹម សារ៉ាន់"
        },
        {
            "barcode": "BBWS180207819",
            "dpc": "03020825801",
            "name": "ហាក់ ស៊ុនហេង"
        },
        {
            "barcode": "BBWS180207820",
            "dpc": "03020825901",
            "name": "ឃុន ងួន១"
        },
        {
            "barcode": "BBWS180207821",
            "dpc": "03020831301",
            "name": "ឃួន ងួន"
        },
        {
            "barcode": "BBWS180207822",
            "dpc": "03020826001",
            "name": "ជៀប ណារ៉ុង"
        },
        {
            "barcode": "BBWS180207823",
            "dpc": "03020826101",
            "name": "កាំង ហុក ២"
        },
        {
            "barcode": "BBWS180207824",
            "dpc": "03020831401",
            "name": "កាំង ហុក"
        },
        {
            "barcode": "BBWS180207825",
            "dpc": "03020831501",
            "name": "ទូច ញ៉ុល"
        },
        {
            "barcode": "BBWS180207826",
            "dpc": "03020826201",
            "name": "កុយ អៀង"
        },
        {
            "barcode": "BBWS180207827",
            "dpc": "03020826301",
            "name": "ងិន ចេង"
        },
        {
            "barcode": "BBWS180207828",
            "dpc": "03020826401",
            "name": "សៅ ទី"
        },
        {
            "barcode": "BBWS180207829",
            "dpc": "03020826501",
            "name": "លឿង ស្រីនិត"
        },
        {
            "barcode": "BBWS180207830",
            "dpc": "03020826601",
            "name": "ជុំ ពិទ័ក្ក"
        },
        {
            "barcode": "BBWS180207831",
            "dpc": "03020826701",
            "name": "កាំ ហុក ១"
        },
        {
            "barcode": "BBWS180207832",
            "dpc": "03020826801",
            "name": "លឹម ផល"
        },
        {
            "barcode": "BBWS180207833",
            "dpc": "03020826901",
            "name": "ណុប សាមិ"
        },
        {
            "barcode": "BBWS180207834",
            "dpc": "03020827001",
            "name": "ហ៊ុន យឿន"
        },
        {
            "barcode": "BBWS180207835",
            "dpc": "03020827101",
            "name": "ត្រិញ សុង"
        },
        {
            "barcode": "BBWS180207836",
            "dpc": "03020827301",
            "name": "ចាន់ សារឿន"
        },
        {
            "barcode": "BBWS180207837",
            "dpc": "03020827401",
            "name": "ឡោ ស្រេង"
        },
        {
            "barcode": "BBWS180207838",
            "dpc": "03020827501",
            "name": "ម៉ៅ ឃុន"
        },
        {
            "barcode": "BBWS180207839",
            "dpc": "03020827601",
            "name": "ឃុន រដ្ឋាលី"
        },
        {
            "barcode": "BBWS180207840",
            "dpc": "03020829401",
            "name": "ម៉ឹន វិបុល"
        },
        {
            "barcode": "BBWS180207841",
            "dpc": "03020835901",
            "name": "ឡុង គីមហេង"
        },
        {
            "barcode": "BBWS180207842",
            "dpc": "03020835801",
            "name": "ជី ឆាយ"
        },
        {
            "barcode": "BBWS180207843",
            "dpc": "03020835701",
            "name": "ថន សឿម"
        },
        {
            "barcode": "BBWS180207844",
            "dpc": "03020835601",
            "name": "ហុង ហ៊ុលឡេង់"
        },
        {
            "barcode": "BBWS180207845",
            "dpc": "03020835501",
            "name": "ហួយ ខេង"
        },
        {
            "barcode": "BBWS180207846",
            "dpc": "03020835401",
            "name": "ង៉ូវ ថៃ"
        },
        {
            "barcode": "BBWS180207847",
            "dpc": "03020835301",
            "name": "សេង ប្រាង្គ"
        },
        {
            "barcode": "BBWS180207848",
            "dpc": "03020835201",
            "name": "សេង ផាត"
        },
        {
            "barcode": "BBWS180207849",
            "dpc": "03020835101",
            "name": "វិញ ហៃ"
        },
        {
            "barcode": "BBWS180207850",
            "dpc": "03020835001",
            "name": "សេដ្ឋ សាខា"
        },
        {
            "barcode": "BBWS180207851",
            "dpc": "03020834901",
            "name": "ស៊ីន ថា"
        },
        {
            "barcode": "BBWS180207852",
            "dpc": "03020834801",
            "name": "ឡៃ ឆេងវែង"
        },
        {
            "barcode": "BBWS180207853",
            "dpc": "03020834701",
            "name": "ផាន ទូច"
        },
        {
            "barcode": "BBWS180207854",
            "dpc": "03020834601",
            "name": "ង៉ូវ គីម"
        },
        {
            "barcode": "BBWS180207855",
            "dpc": "03020834401",
            "name": "យ៉ម ឆន"
        },
        {
            "barcode": "BBWS180207856",
            "dpc": "03020834201",
            "name": "អ៊ុក ផន"
        },
        {
            "barcode": "BBWS180207857",
            "dpc": "03020834301",
            "name": "ហាស់ ហ៊ន"
        },
        {
            "barcode": "BBWS180207858",
            "dpc": "03020834101",
            "name": "អ៊ុន សុខា"
        },
        {
            "barcode": "BBWS180207859",
            "dpc": "03020834001",
            "name": "ប៊ូ ប៉ិច"
        },
        {
            "barcode": "BBWS180207860",
            "dpc": "03020833901",
            "name": "ហេង ហាវ"
        },
        {
            "barcode": "BBWS180207861",
            "dpc": "03020833801",
            "name": "ហេង កង"
        },
        {
            "barcode": "BBWS180207862",
            "dpc": "03020833701",
            "name": "អ៊ុល ងឿប"
        },
        {
            "barcode": "BBWS180207863",
            "dpc": "03020833601",
            "name": "ជីប ណារ៉ុង"
        },
        {
            "barcode": "BBWS180207864",
            "dpc": "03020833501",
            "name": "កែវ នី"
        },
        {
            "barcode": "BBWS180207865",
            "dpc": "03020833401",
            "name": "ឈុត សោភ័ណ្ឌ"
        },
        {
            "barcode": "BBWS180207866",
            "dpc": "03020833301",
            "name": "សុខ ប៊ុនអៀង"
        },
        {
            "barcode": "BBWS180207867",
            "dpc": "03020833201",
            "name": "ហេង គង់"
        },
        {
            "barcode": "BBWS180207868",
            "dpc": "03020833101",
            "name": "អ៊ឹង សេង"
        },
        {
            "barcode": "BBWS180207869",
            "dpc": "03020833001",
            "name": "តេង ឈាង"
        },
        {
            "barcode": "BBWS180207870",
            "dpc": "03020832901",
            "name": "ដួង ដានី"
        },
        {
            "barcode": "BBWS180207871",
            "dpc": "03020832801",
            "name": "ខ្ចៅ សំកុល ១"
        },
        {
            "barcode": "BBWS180207872",
            "dpc": "03020832701",
            "name": "ហុង គា"
        },
        {
            "barcode": "BBWS180207873",
            "dpc": "03020832601",
            "name": "ប៊ុន ស្រេង"
        },
        {
            "barcode": "BBWS180207874",
            "dpc": "03020832501",
            "name": "តាំង ឈាងហួរ"
        },
        {
            "barcode": "BBWS180207875",
            "dpc": "03020832401",
            "name": "ម៉ុង ចាន់សារ៉េត"
        },
        {
            "barcode": "BBWS180207876",
            "dpc": "03020832201",
            "name": "ខាន់ ពៅ"
        },
        {
            "barcode": "BBWS180207877",
            "dpc": "03020832101",
            "name": "ខៀវ បូរ៉េត"
        },
        {
            "barcode": "BBWS180207878",
            "dpc": "03020832301",
            "name": "ខ្ចៅ សំកុល ២"
        },
        {
            "barcode": "BBWS180207879",
            "dpc": "03020832001",
            "name": "ដុស រីដេត"
        },
        {
            "barcode": "BBWS180207880",
            "dpc": "03020831901",
            "name": "ហែម អឿន"
        },
        {
            "barcode": "BBWS180207881",
            "dpc": "03020831801",
            "name": "សុខ ស៊ុយ"
        },
        {
            "barcode": "BBWS180207882",
            "dpc": "03020831601",
            "name": "សេង ហាន់"
        },
        {
            "barcode": "BBWS180207883",
            "dpc": "03020831201",
            "name": "លឹម គឹមឡាង"
        },
        {
            "barcode": "BBWS180207884",
            "dpc": "03020831101",
            "name": "អ៊ឹង ផិតទី"
        },
        {
            "barcode": "BBWS180207885",
            "dpc": "03020830901",
            "name": "ឈួន ឡេង"
        },
        {
            "barcode": "BBWS180207886",
            "dpc": "03020831001",
            "name": "លឿង ឆារ៉ា"
        },
        {
            "barcode": "BBWS180207887",
            "dpc": "03020830801",
            "name": "លី ឃួង"
        },
        {
            "barcode": "BBWS180207888",
            "dpc": "03020830701",
            "name": "សម ស៊ីណា"
        },
        {
            "barcode": "BBWS180207889",
            "dpc": "03020830601",
            "name": "យាន បូលី"
        },
        {
            "barcode": "BBWS180207890",
            "dpc": "03020830501",
            "name": "ស្រី នេ"
        },
        {
            "barcode": "BBWS180207891",
            "dpc": "03020830401",
            "name": "ប៉ែត សីហា"
        },
        {
            "barcode": "BBWS180207892",
            "dpc": "03020830301",
            "name": "ហ៊ិន គឹមហ៊តឌី"
        },
        {
            "barcode": "BBWS180207893",
            "dpc": "03020830201",
            "name": "សៀង ជៀកផេង"
        },
        {
            "barcode": "BBWS180207894",
            "dpc": "03020830101",
            "name": "ឆាយ ចាន់"
        },
        {
            "barcode": "BBWS180207895",
            "dpc": "03020829901",
            "name": "ញាណ សុផាត"
        },
        {
            "barcode": "BBWS180207896",
            "dpc": "03020829801",
            "name": "សុខ ធី"
        },
        {
            "barcode": "BBWS180207897",
            "dpc": "03020829701",
            "name": "ឈុន សុខ"
        },
        {
            "barcode": "BBWS180207898",
            "dpc": "03020829601",
            "name": "ជូ គង់"
        },
        {
            "barcode": "BBWS180207899",
            "dpc": "03020829501",
            "name": "អ៊ុក សុវណ្ណលី"
        },
        {
            "barcode": "BBWS180207900",
            "dpc": "03020813601",
            "name": "កែវ មនោ"
        },
        {
            "barcode": "BBWS180207901",
            "dpc": "03020846401",
            "name": "មួន ងិៈ"
        },
        {
            "barcode": "BBWS180207902",
            "dpc": "03020846501",
            "name": "ពេជ្រ ម៉ារី"
        },
        {
            "barcode": "BBWS180207903",
            "dpc": "03020846601",
            "name": "ឆាយ វ៉ាន់ឌី"
        },
        {
            "barcode": "BBWS180207904",
            "dpc": "03020846701",
            "name": "អោម ណាវី"
        },
        {
            "barcode": "BBWS180207905",
            "dpc": "03020846801",
            "name": "ញ៉េម ឈឿត"
        },
        {
            "barcode": "BBWS180207906",
            "dpc": "03020846901",
            "name": "សៀង ស៊ីណាត"
        },
        {
            "barcode": "BBWS180207907",
            "dpc": "03020847101",
            "name": "នែម វ៉ាន់"
        },
        {
            "barcode": "BBWS180207908",
            "dpc": "03020847201",
            "name": "ទឹម សារុំ"
        },
        {
            "barcode": "BBWS180207909",
            "dpc": "03020847301",
            "name": "ហម គឹមប៉ោ"
        },
        {
            "barcode": "BBWS180207910",
            "dpc": "03020847501",
            "name": "ទឹម វ៉ាន់រិទ្ធ"
        },
        {
            "barcode": "BBWS180207911",
            "dpc": "03020846201",
            "name": "សុខ លាង"
        },
        {
            "barcode": "BBWS180207912",
            "dpc": "03020846101",
            "name": "គុយ សត្យា"
        },
        {
            "barcode": "BBWS180207913",
            "dpc": "03020846001",
            "name": "សំ គង់"
        },
        {
            "barcode": "BBWS180207914",
            "dpc": "03020845301",
            "name": "នូ ឆវី"
        },
        {
            "barcode": "BBWS180207915",
            "dpc": "03020845201",
            "name": "នូ ឆាវ"
        },
        {
            "barcode": "BBWS180207916",
            "dpc": "03020847601",
            "name": "ឌឿម សាមុជ"
        },
        {
            "barcode": "BBWS180207917",
            "dpc": "03020847701",
            "name": "ណយ រ៉ាវុធ"
        },
        {
            "barcode": "BBWS180207918",
            "dpc": "03020847801",
            "name": "ដាំ ប៉ូលី"
        },
        {
            "barcode": "BBWS180207919",
            "dpc": "03020847901",
            "name": "គង់ សំអាត"
        },
        {
            "barcode": "BBWS180207920",
            "dpc": "03020817201",
            "name": "សេង សាវដា"
        },
        {
            "barcode": "BBWS180207921",
            "dpc": "03020817301",
            "name": "ប៊ុន សេងហ៊ាង"
        },
        {
            "barcode": "BBWS180207922",
            "dpc": "03020817501",
            "name": "គុយ ច្រិប"
        },
        {
            "barcode": "BBWS180207923",
            "dpc": "03020817101",
            "name": "ទេព តឿម"
        },
        {
            "barcode": "BBWS180207924",
            "dpc": "03020824501",
            "name": "សំ សារួម"
        },
        {
            "barcode": "BBWS180207925",
            "dpc": "03020816801",
            "name": "បៃ យាន"
        },
        {
            "barcode": "BBWS180207926",
            "dpc": "03020817701",
            "name": "ឡឹក សំបូរ"
        },
        {
            "barcode": "BBWS180207927",
            "dpc": "03020817801",
            "name": "ខ្លូត សំបូរ"
        },
        {
            "barcode": "BBWS180207928",
            "dpc": "03020817901",
            "name": "ប៉ិច ចិន្តា"
        },
        {
            "barcode": "BBWS180207929",
            "dpc": "03020818001",
            "name": "អ៊ី សាមិត្ត"
        },
        {
            "barcode": "BBWS180207930",
            "dpc": "03020818401",
            "name": "លាប ឈន់"
        },
        {
            "barcode": "BBWS180207931",
            "dpc": "03020815901",
            "name": "ហូវ សានី"
        },
        {
            "barcode": "BBWS180207932",
            "dpc": "03020816001",
            "name": "សេង វ៉ាន់លី"
        },
        {
            "barcode": "BBWS180207933",
            "dpc": "03020816101",
            "name": "សុខ សាន"
        },
        {
            "barcode": "BBWS180207934",
            "dpc": "03020816201",
            "name": "សុខ គង់"
        },
        {
            "barcode": "BBWS180207935",
            "dpc": "03020818801",
            "name": "គល់ ឈុន"
        },
        {
            "barcode": "BBWS180207936",
            "dpc": "03020818601",
            "name": "ចាន់ សុខន"
        },
        {
            "barcode": "BBWS180207937",
            "dpc": "03020816401",
            "name": "អៀង ឆេង"
        },
        {
            "barcode": "BBWS180207938",
            "dpc": "03020840501",
            "name": "ស៊ូ ស្រីនិ"
        },
        {
            "barcode": "BBWS180207939",
            "dpc": "03020816501",
            "name": "មុំ ចិន្តា"
        },
        {
            "barcode": "BBWS180207940",
            "dpc": "03020816701",
            "name": "ខ្លូត សម្បត្តិ"
        },
        {
            "barcode": "BBWS180207941",
            "dpc": "03020816901",
            "name": "សុខ ឡម"
        },
        {
            "barcode": "BBWS180207942",
            "dpc": "03020817001",
            "name": "លាង កេង"
        },
        {
            "barcode": "BBWS180207943",
            "dpc": "03020818501",
            "name": "ឈុន លឿត"
        },
        {
            "barcode": "BBWS180207944",
            "dpc": "03020819001",
            "name": "នង សុផល"
        },
        {
            "barcode": "BBWS180207945",
            "dpc": "03020819201",
            "name": "តោ កុយហួង"
        },
        {
            "barcode": "BBWS180207946",
            "dpc": "03020819301",
            "name": "សូ សាវុធ"
        },
        {
            "barcode": "BBWS180207947",
            "dpc": "03020819601",
            "name": "ឃិន ពៅ"
        },
        {
            "barcode": "BBWS180207948",
            "dpc": "03020819701",
            "name": "ហេង សុភារុណ"
        },
        {
            "barcode": "BBWS180207949",
            "dpc": "03020819801",
            "name": "ឡោ ចិន្តា"
        },
        {
            "barcode": "BBWS180207950",
            "dpc": "03020819901",
            "name": "សយ គឹមសាន្ត"
        },
        {
            "barcode": "BBWS180207951",
            "dpc": "03020820201",
            "name": "ពុធ សំរិទ្ធ"
        },
        {
            "barcode": "BBWS180207952",
            "dpc": "03020820501",
            "name": "គុណ សម្ផស្ស"
        },
        {
            "barcode": "BBWS180207953",
            "dpc": "03020820601",
            "name": "ម៉ក សាលី"
        },
        {
            "barcode": "BBWS180207954",
            "dpc": "03020822001",
            "name": "គង់ គន្ធា"
        },
        {
            "barcode": "BBWS180207955",
            "dpc": "03020821101",
            "name": "ខៀវ ពៅ"
        },
        {
            "barcode": "BBWS180207956",
            "dpc": "03020821001",
            "name": "ឡោ សម្បត្តិ"
        },
        {
            "barcode": "BBWS180207957",
            "dpc": "03020820901",
            "name": "រស់ វ៉ាវី"
        },
        {
            "barcode": "BBWS180207958",
            "dpc": "03020820801",
            "name": "ទិត សារួន"
        },
        {
            "barcode": "BBWS180207959",
            "dpc": "03020820701",
            "name": "ហុល រិន"
        },
        {
            "barcode": "BBWS180207960",
            "dpc": "03020820401",
            "name": "ពៅ សត្យ"
        },
        {
            "barcode": "BBWS180207961",
            "dpc": "03020820301",
            "name": "ខឹម ចាន់"
        },
        {
            "barcode": "BBWS180207962",
            "dpc": "03020820101",
            "name": "វិន សាវេន"
        },
        {
            "barcode": "BBWS180207963",
            "dpc": "03020820001",
            "name": "សុខ សារ៉ាត់"
        },
        {
            "barcode": "BBWS180207964",
            "dpc": "03020819501",
            "name": "គឹម សុភុន"
        },
        {
            "barcode": "BBWS180207965",
            "dpc": "03020819401",
            "name": "នង ហ៊ាន"
        },
        {
            "barcode": "BBWS180207966",
            "dpc": "03020821201",
            "name": "កង សារ៉េន"
        },
        {
            "barcode": "BBWS180207967",
            "dpc": "03020821301",
            "name": "ពៅ វុទ្ធី"
        },
        {
            "barcode": "BBWS180207968",
            "dpc": "03020821401",
            "name": "ហ៊ីម លិញ"
        },
        {
            "barcode": "BBWS180207969",
            "dpc": "03020815301",
            "name": "សោ ជ្រឿន"
        },
        {
            "barcode": "BBWS180207970",
            "dpc": "03020821501",
            "name": "ម៉ម ណុល"
        },
        {
            "barcode": "BBWS180207971",
            "dpc": "03020821701",
            "name": "តាំង ចាំងហួយ"
        },
        {
            "barcode": "BBWS180207972",
            "dpc": "03020821601",
            "name": "ភួង ស៊ីម"
        },
        {
            "barcode": "BBWS180207973",
            "dpc": "03020821801",
            "name": "ហុក សេង"
        },
        {
            "barcode": "BBWS180207974",
            "dpc": "03020822101",
            "name": "យិន ឌី"
        },
        {
            "barcode": "BBWS180207975",
            "dpc": "03020822201",
            "name": "សេង ម៉េងសាម"
        },
        {
            "barcode": "BBWS180207976",
            "dpc": "03020845101",
            "name": "គឹម លន់"
        },
        {
            "barcode": "BBWS180207977",
            "dpc": "03020845401",
            "name": "នូ វ៉ារី"
        },
        {
            "barcode": "BBWS180207978",
            "dpc": "03020845901",
            "name": "លឹម ហាន"
        },
        {
            "barcode": "BBWS180207979",
            "dpc": "03020845801",
            "name": "មណ្ឌល កុម៉ាកំព្រា"
        },
        {
            "barcode": "BBWS180207980",
            "dpc": "03020845701",
            "name": "រៀន វីរៈ"
        },
        {
            "barcode": "BBWS180207981",
            "dpc": "03020845601",
            "name": "លុក ចន្ថា"
        },
        {
            "barcode": "BBWS180207982",
            "dpc": "03020845501",
            "name": "ខែត្រ សៀង"
        },
        {
            "barcode": "BBWS180207983",
            "dpc": "03020821901",
            "name": "ងួន គន"
        },
        {
            "barcode": "BBWS180207984",
            "dpc": "03020846301",
            "name": "សុខ សុផល"
        },
        {
            "barcode": "BBWS180207985",
            "dpc": "03020847001",
            "name": "ហ៊ុន សាលី"
        },
        {
            "barcode": "BBWS180207986",
            "dpc": "03020817601",
            "name": "ទុយ សុផល"
        },
        {
            "barcode": "BBWS180207987",
            "dpc": "03020824401",
            "name": "ញូង ផែន"
        },
        {
            "barcode": "BBWS180207988",
            "dpc": "03020824301",
            "name": "ម៉ែន ឆយ"
        },
        {
            "barcode": "BBWS180207989",
            "dpc": "03020824201",
            "name": "អៃ អឿន"
        },
        {
            "barcode": "BBWS180207990",
            "dpc": "03020824101",
            "name": "ជឹម ចិន្តា"
        },
        {
            "barcode": "BBWS180207991",
            "dpc": "03020824001",
            "name": "អ៊ី ខេង"
        },
        {
            "barcode": "BBWS180207992",
            "dpc": "03020823901",
            "name": "រ៉ែម សំណាង"
        },
        {
            "barcode": "BBWS180207993",
            "dpc": "03020823801",
            "name": "ឆាន់ ជី"
        },
        {
            "barcode": "BBWS180207994",
            "dpc": "03020823701",
            "name": "និន ផល្លា"
        },
        {
            "barcode": "BBWS180207995",
            "dpc": "03020823601",
            "name": "អ៊ឹង ឈួរឆាយ"
        },
        {
            "barcode": "BBWS180207996",
            "dpc": "03020823501",
            "name": "នូ ប៊ុនណា"
        },
        {
            "barcode": "BBWS180207997",
            "dpc": "03020823401",
            "name": "ម៉ៅ ប៊ន"
        },
        {
            "barcode": "BBWS180207998",
            "dpc": "03020823301",
            "name": "ព ពៅ"
        },
        {
            "barcode": "BBWS180207999",
            "dpc": "03020823201",
            "name": "កូវ ជីងប៊ុង"
        },
        {
            "barcode": "BBWS180208000",
            "dpc": "03020823101",
            "name": "ឆាយ លីន"
        },
        {
            "barcode": "BBWS180208001",
            "dpc": "03020823001",
            "name": "ឡឹក ចាន់រិទ្ធី"
        },
        {
            "barcode": "BBWS180208002",
            "dpc": "03020822901",
            "name": "អុក សេន"
        },
        {
            "barcode": "BBWS180208003",
            "dpc": "03020822801",
            "name": "ម៉ិល ណារិន"
        },
        {
            "barcode": "BBWS180208004",
            "dpc": "03020822701",
            "name": "ឆោម ឈឺយ"
        },
        {
            "barcode": "BBWS180208005",
            "dpc": "03020822401",
            "name": "ឌិត សាលួត"
        },
        {
            "barcode": "BBWS180208006",
            "dpc": "03020822301",
            "name": "ប៊ុន ឡុង"
        },
        {
            "barcode": "BBWS180208007",
            "dpc": "03020813801",
            "name": "គ្រី ទិត្យ"
        },
        {
            "barcode": "BBWS180208008",
            "dpc": "03020813701",
            "name": "ជិន សុភា"
        },
        {
            "barcode": "BBWS180208009",
            "dpc": "03020813501",
            "name": "រ៉ឹន ណារ៉ាន់"
        },
        {
            "barcode": "BBWS180208010",
            "dpc": "03020813401",
            "name": "យិន រឿម"
        },
        {
            "barcode": "BBWS180208011",
            "dpc": "03020813301",
            "name": "ម៉ាង សារុំ"
        },
        {
            "barcode": "BBWS180208012",
            "dpc": "03020813001",
            "name": "តោ ចិន្តា"
        },
        {
            "barcode": "BBWS180208013",
            "dpc": "03020812901",
            "name": "ពូ ពេក"
        },
        {
            "barcode": "BBWS180208014",
            "dpc": "03020812801",
            "name": "សុខ លី"
        },
        {
            "barcode": "BBWS180208015",
            "dpc": "03020812501",
            "name": "ជា ឃុន"
        },
        {
            "barcode": "BBWS180208016",
            "dpc": "03020825501",
            "name": "ឆាយ គឹមទឹង"
        },
        {
            "barcode": "BBWS180208017",
            "dpc": "03020825301",
            "name": "ដឿក ម៉ៅ"
        },
        {
            "barcode": "BBWS180208018",
            "dpc": "03020825201",
            "name": "ម៉ាញ ផាន"
        },
        {
            "barcode": "BBWS180208019",
            "dpc": "03020825101",
            "name": "អាង យ៉េង"
        },
        {
            "barcode": "BBWS180208020",
            "dpc": "03020824901",
            "name": "ហួត ឡាយ"
        },
        {
            "barcode": "BBWS180208021",
            "dpc": "03020824801",
            "name": "ឈិន វៃ"
        },
        {
            "barcode": "BBWS180208022",
            "dpc": "03020824701",
            "name": "យក់ ហ៊ុន"
        },
        {
            "barcode": "BBWS180208023",
            "dpc": "03020824601",
            "name": "ជាង ម៉ុង"
        },
        {
            "barcode": "BBWS180208024",
            "dpc": "03020812301",
            "name": "អ៊ឹង ឡេងហ៊ួត"
        },
        {
            "barcode": "BBWS180208025",
            "dpc": "03020812201",
            "name": "គឹម បូផៃ"
        },
        {
            "barcode": "BBWS180208026",
            "dpc": "03020812101",
            "name": "យឿន អឿន"
        },
        {
            "barcode": "BBWS180208027",
            "dpc": "03020811901",
            "name": "គឹម សុងវិចិត្រ"
        },
        {
            "barcode": "BBWS180208028",
            "dpc": "03020811801",
            "name": "គឹម បុត្តា"
        },
        {
            "barcode": "BBWS180208029",
            "dpc": "03020811701",
            "name": "លុយ រដ្ឋា"
        },
        {
            "barcode": "BBWS180208030",
            "dpc": "03020811601",
            "name": "វែង ថៃ"
        },
        {
            "barcode": "BBWS180208031",
            "dpc": "03020811501",
            "name": "អ៊ាង សុខា"
        },
        {
            "barcode": "BBWS180208032",
            "dpc": "03020811401",
            "name": "ពៅ រ៉េន"
        },
        {
            "barcode": "BBWS180208033",
            "dpc": "03020811301",
            "name": "ពេជ្រ សុខា"
        },
        {
            "barcode": "BBWS180208034",
            "dpc": "03020811201",
            "name": "ស៊ន ហ៊ុន"
        },
        {
            "barcode": "BBWS180208035",
            "dpc": "03020811101",
            "name": "ប៉ាវ ចាន់តារា"
        },
        {
            "barcode": "BBWS180208036",
            "dpc": "03020811001",
            "name": "អេង អ៊ាង"
        },
        {
            "barcode": "BBWS180208037",
            "dpc": "03020810901",
            "name": "ប៉ូ ទូច"
        },
        {
            "barcode": "BBWS180208038",
            "dpc": "03020810801",
            "name": "គូ កាម"
        },
        {
            "barcode": "BBWS180208039",
            "dpc": "03020810701",
            "name": "គឹម សេង"
        },
        {
            "barcode": "BBWS180208040",
            "dpc": "03020810601",
            "name": "សេង សំរេច"
        },
        {
            "barcode": "BBWS180208041",
            "dpc": "03020810201",
            "name": "ប្រាក់ ឡុង"
        },
        {
            "barcode": "BBWS180208042",
            "dpc": "03020810101",
            "name": "ឈៀង ឡានី"
        },
        {
            "barcode": "BBWS180208043",
            "dpc": "03020810001",
            "name": "ពឹង ស៊ីម៉េង"
        },
        {
            "barcode": "BBWS180208044",
            "dpc": "03020809901",
            "name": "លី ឈុន"
        },
        {
            "barcode": "BBWS180208045",
            "dpc": "03020809801",
            "name": "យក់ តាំង"
        },
        {
            "barcode": "BBWS180208046",
            "dpc": "03020809701",
            "name": "លឹម ហាប់"
        },
        {
            "barcode": "BBWS180208047",
            "dpc": "03020809601",
            "name": "ចាប សុធី"
        },
        {
            "barcode": "BBWS180208048",
            "dpc": "03020809501",
            "name": "សេង ជា"
        },
        {
            "barcode": "BBWS180208049",
            "dpc": "03020815601",
            "name": "នៅ យ៉ារ័ត្ន"
        },
        {
            "barcode": "BBWS180208050",
            "dpc": "03020815401",
            "name": "ម៉ៅ ហ៊ុន"
        },
        {
            "barcode": "BBWS180208051",
            "dpc": "03020815201",
            "name": "អាត់ សឿន"
        },
        {
            "barcode": "BBWS180208052",
            "dpc": "03020815101",
            "name": "ស៊ា លឹមទ្រី"
        },
        {
            "barcode": "BBWS180208053",
            "dpc": "03020815001",
            "name": "គឹម សុខសាន្ត"
        },
        {
            "barcode": "BBWS180208054",
            "dpc": "03020814901",
            "name": "អ៊ឹង សារ៉ាត់"
        },
        {
            "barcode": "BBWS180208055",
            "dpc": "03020814801",
            "name": "ហួយ ឡាន"
        },
        {
            "barcode": "BBWS180208056",
            "dpc": "03020814601",
            "name": "សុខ ប៊ូ"
        },
        {
            "barcode": "BBWS180208057",
            "dpc": "03020814501",
            "name": "លុក សំប៊ុន"
        },
        {
            "barcode": "BBWS180208058",
            "dpc": "03020814401",
            "name": "ទឹម ប៉ូល"
        },
        {
            "barcode": "BBWS180208059",
            "dpc": "03020814301",
            "name": "សេង ហ៊ីម"
        },
        {
            "barcode": "BBWS180208060",
            "dpc": "03020814001",
            "name": "ជា ដាំ"
        },
        {
            "barcode": "BBWS180208061",
            "dpc": "03020813901",
            "name": "អ៊ុន រឿន"
        },
        {
            "barcode": "BBWS180208062",
            "dpc": "03020813201",
            "name": "សោម យ៉ម"
        },
        {
            "barcode": "BBWS180208063",
            "dpc": "03020813101",
            "name": "ជៀវ ហ្វីលីប"
        },
        {
            "barcode": "BBWS180208064",
            "dpc": "03020812701",
            "name": "សុខ វុទ្ធី"
        },
        {
            "barcode": "BBWS180208065",
            "dpc": "03020812401",
            "name": "ជៀម ហ៊ាង"
        },
        {
            "barcode": "BBWS180208066",
            "dpc": "03020848001",
            "name": "ឌឿម សាមុជ"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
