let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=

    [
        {
            "barcode": "BBWS180209655",
            "dpc": "03020920901",
            "name": "សុខ នាង"
        },
        {
            "barcode": "BBWS180209656",
            "dpc": "03020921701",
            "name": "មឿន ឈឿត"
        },
        {
            "barcode": "BBWS180209657",
            "dpc": "03020921601",
            "name": "សុខ កប"
        },
        {
            "barcode": "BBWS180209658",
            "dpc": "03020921501",
            "name": "ឈួម សាវី ១"
        },
        {
            "barcode": "BBWS180209659",
            "dpc": "03020921401",
            "name": "កែវ វាសនា"
        },
        {
            "barcode": "BBWS180209660",
            "dpc": "03020921301",
            "name": "ពិន ប៊ុនថន"
        },
        {
            "barcode": "BBWS180209661",
            "dpc": "03020921201",
            "name": "ស៊ាន សុខណាល់"
        },
        {
            "barcode": "BBWS180209662",
            "dpc": "03020921101",
            "name": "អ៊ឹម រតនា"
        },
        {
            "barcode": "BBWS180209663",
            "dpc": "03020921001",
            "name": "ហួ  ហេង"
        },
        {
            "barcode": "BBWS180209664",
            "dpc": "03020919501",
            "name": "សា រឿន"
        },
        {
            "barcode": "BBWS180209665",
            "dpc": "03020919701",
            "name": "ជ  គឹមហេង"
        },
        {
            "barcode": "BBWS180209666",
            "dpc": "03020919601",
            "name": "ជៀប សូរ"
        },
        {
            "barcode": "BBWS180209667",
            "dpc": "03020919901",
            "name": "ឡាយ សាយ"
        },
        {
            "barcode": "BBWS180209668",
            "dpc": "03020920001",
            "name": "យូ ហៀក"
        },
        {
            "barcode": "BBWS180209669",
            "dpc": "03020920101",
            "name": "គ្រី ឈួន"
        },
        {
            "barcode": "BBWS180209670",
            "dpc": "03020920201",
            "name": "ឆន លួត"
        },
        {
            "barcode": "BBWS180209671",
            "dpc": "03020920301",
            "name": "ឆន ឆាន"
        },
        {
            "barcode": "BBWS180209672",
            "dpc": "03020920401",
            "name": "ទ្រី លួត"
        },
        {
            "barcode": "BBWS180209673",
            "dpc": "03020920501",
            "name": "គឹម សុខាល័យ"
        },
        {
            "barcode": "BBWS180209674",
            "dpc": "03020920601",
            "name": "សឹង ពៅ"
        },
        {
            "barcode": "BBWS180209675",
            "dpc": "03020920701",
            "name": "គង់ ហុង"
        },
        {
            "barcode": "BBWS180209676",
            "dpc": "03020919301",
            "name": "រឿង តាន់"
        },
        {
            "barcode": "BBWS180209677",
            "dpc": "03020919201",
            "name": "កែវ ពិសិទ្ធ"
        },
        {
            "barcode": "BBWS180209678",
            "dpc": "03020919101",
            "name": "ម៉ាន់ លិញ"
        },
        {
            "barcode": "BBWS180209679",
            "dpc": "03020919001",
            "name": "ជួន រដ្ឋា"
        },
        {
            "barcode": "BBWS180209680",
            "dpc": "03020918801",
            "name": "គឹម គាង"
        },
        {
            "barcode": "BBWS180209681",
            "dpc": "03020918901",
            "name": "កឹម  ឌី"
        },
        {
            "barcode": "BBWS180209682",
            "dpc": "03020918601",
            "name": "សោម ឌឿន"
        },
        {
            "barcode": "BBWS180209683",
            "dpc": "03020917301",
            "name": "ម៉ៅ ធី"
        },
        {
            "barcode": "BBWS180209684",
            "dpc": "03020917201",
            "name": "ពិន ថាវី"
        },
        {
            "barcode": "BBWS180209685",
            "dpc": "03020917101",
            "name": "គង់ អន"
        },
        {
            "barcode": "BBWS180209686",
            "dpc": "03020917001",
            "name": "ម៉ឹង សុខុន"
        },
        {
            "barcode": "BBWS180209687",
            "dpc": "03020917601",
            "name": "ឈុំ ដេត"
        },
        {
            "barcode": "BBWS180209688",
            "dpc": "03020917701",
            "name": "ហៀក ស្រេង"
        },
        {
            "barcode": "BBWS180209689",
            "dpc": "03020917801",
            "name": "វ៉ា  ប៊ុនយឿត"
        },
        {
            "barcode": "BBWS180209690",
            "dpc": "03020917901",
            "name": "ហេង ហុកម៉េង"
        },
        {
            "barcode": "BBWS180209691",
            "dpc": "03020918001",
            "name": "យិន ហុង"
        },
        {
            "barcode": "BBWS180209692",
            "dpc": "03020918101",
            "name": "សុខ វែង"
        },
        {
            "barcode": "BBWS180209693",
            "dpc": "03020918201",
            "name": "លេ សុខ"
        },
        {
            "barcode": "BBWS180209694",
            "dpc": "03020918301",
            "name": "លឿង សុលីដា"
        },
        {
            "barcode": "BBWS180209695",
            "dpc": "03020918401",
            "name": "ស៊ិន និត្យាលីន"
        },
        {
            "barcode": "BBWS180209696",
            "dpc": "03020918501",
            "name": "សំ ឡាយ"
        },
        {
            "barcode": "BBWS180209697",
            "dpc": "03020917401",
            "name": "សុខ ឌី"
        },
        {
            "barcode": "BBWS180209698",
            "dpc": "03020917501",
            "name": "អ៊ុង សំអន"
        },
        {
            "barcode": "BBWS180209699",
            "dpc": "03020916901",
            "name": "យ៉ា សុផៃលីន"
        },
        {
            "barcode": "BBWS180209700",
            "dpc": "03020916801",
            "name": "ឌឹម  វី"
        },
        {
            "barcode": "BBWS180209701",
            "dpc": "03020916701",
            "name": "ធឹង វន"
        },
        {
            "barcode": "BBWS180209702",
            "dpc": "03020916601",
            "name": "មុ ភឿន"
        },
        {
            "barcode": "BBWS180209703",
            "dpc": "03020916501",
            "name": "ពុធ ចំរើន"
        },
        {
            "barcode": "BBWS180209704",
            "dpc": "03020916401",
            "name": "សុខ សុផាត"
        },
        {
            "barcode": "BBWS180209705",
            "dpc": "03020916301",
            "name": "គឹម ឡេង"
        },
        {
            "barcode": "BBWS180209706",
            "dpc": "03020915601",
            "name": "ហៀក ស្រេង ១"
        },
        {
            "barcode": "BBWS180209707",
            "dpc": "03020915701",
            "name": "ហៀក ស្រេង ២"
        },
        {
            "barcode": "BBWS180209708",
            "dpc": "03020915801",
            "name": "ហៀក ស្រេង ៣"
        },
        {
            "barcode": "BBWS180209709",
            "dpc": "03020915901",
            "name": "ហៀក ស្រេង ៤"
        },
        {
            "barcode": "BBWS180209710",
            "dpc": "03020915401",
            "name": "គឹម  វុទ្ធី"
        },
        {
            "barcode": "BBWS180209711",
            "dpc": "03020915301",
            "name": "ស្វាយ ចំរិទ្ធ"
        },
        {
            "barcode": "BBWS180209712",
            "dpc": "03020923001",
            "name": "ទូច ហេង"
        },
        {
            "barcode": "BBWS180209713",
            "dpc": "03020922901",
            "name": "គង់ គា"
        },
        {
            "barcode": "BBWS180209714",
            "dpc": "03020922801",
            "name": "តាំង ហាលឹម"
        },
        {
            "barcode": "BBWS180209715",
            "dpc": "03020927401",
            "name": "អ៊ិន យូឃាង"
        },
        {
            "barcode": "BBWS180209716",
            "dpc": "03020931101",
            "name": "ម៉ែន  ម៉ាន"
        },
        {
            "barcode": "BBWS180209717",
            "dpc": "03020931701",
            "name": "ជុំ ចំរ៉ុង"
        },
        {
            "barcode": "BBWS180209718",
            "dpc": "03020932001",
            "name": "សា ម៉ន"
        },
        {
            "barcode": "BBWS180209719",
            "dpc": "03020932101",
            "name": "លី ស្រូន"
        },
        {
            "barcode": "BBWS180209720",
            "dpc": "03020932401",
            "name": "សឹង សារៀម"
        },
        {
            "barcode": "BBWS180209721",
            "dpc": "03020933401",
            "name": "សយ បូរ៉ា"
        },
        {
            "barcode": "BBWS180209722",
            "dpc": "03020933501",
            "name": "សយ ប៉ូលីន"
        },
        {
            "barcode": "BBWS180209723",
            "dpc": "03020933601",
            "name": "ពត សាវ៉ុង"
        },
        {
            "barcode": "BBWS180209724",
            "dpc": "03020932201",
            "name": "កាក់ សិលា"
        },
        {
            "barcode": "BBWS180209725",
            "dpc": "03020935401",
            "name": "នង វណ្ណៈ"
        },
        {
            "barcode": "BBWS180209726",
            "dpc": "03020935301",
            "name": "នង​ ស៊ីផាន់"
        },
        {
            "barcode": "BBWS180209727",
            "dpc": "03020935201",
            "name": "នង ប៊ុន ធឿន"
        },
        {
            "barcode": "BBWS180209728",
            "dpc": "03020935101",
            "name": "នន់ វណ្ណា"
        },
        {
            "barcode": "BBWS180209729",
            "dpc": "03020935001",
            "name": "អុំ  វណ្ណា"
        },
        {
            "barcode": "BBWS180209730",
            "dpc": "03020934801",
            "name": "គឹម អនោ"
        },
        {
            "barcode": "BBWS180209731",
            "dpc": "03020934701",
            "name": "ចាន់ យ៉េន"
        },
        {
            "barcode": "BBWS180209732",
            "dpc": "03020934601",
            "name": "សោម កុសល់"
        },
        {
            "barcode": "BBWS180209733",
            "dpc": "03020934501",
            "name": "មាស គឹមលន់"
        },
        {
            "barcode": "BBWS180209734",
            "dpc": "03020934401",
            "name": "ទ្រី ចំរ៉ុង"
        },
        {
            "barcode": "BBWS180209735",
            "dpc": "03020934301",
            "name": "ម៉ែន សម្បត្តិ ២"
        },
        {
            "barcode": "BBWS180209736",
            "dpc": "03020934201",
            "name": "ទូច សំអាង"
        },
        {
            "barcode": "BBWS180209737",
            "dpc": "03020934101",
            "name": "ទូច ដាវី"
        },
        {
            "barcode": "BBWS180209738",
            "dpc": "03020934001",
            "name": "ទូច សំអ៊ីន"
        },
        {
            "barcode": "BBWS180209739",
            "dpc": "03020933901",
            "name": "ឈួង រ៉ាវ៉ៃ"
        },
        {
            "barcode": "BBWS180209740",
            "dpc": "03020933801",
            "name": "សួន វណ្ណា"
        },
        {
            "barcode": "BBWS180209741",
            "dpc": "03020933701",
            "name": "ណុប ស៊ឹម"
        },
        {
            "barcode": "BBWS180209742",
            "dpc": "03020933301",
            "name": "លាង   ស៊ីវហេង"
        },
        {
            "barcode": "BBWS180209743",
            "dpc": "03020933001",
            "name": "ហេវ បាស៊ាន"
        },
        {
            "barcode": "BBWS180209744",
            "dpc": "03020932901",
            "name": "ហេង បេងឈុន"
        },
        {
            "barcode": "BBWS180209745",
            "dpc": "03020933201",
            "name": "ផាត ភីរុណ"
        },
        {
            "barcode": "BBWS180209746",
            "dpc": "03020932701",
            "name": "ឈុំ នារី"
        },
        {
            "barcode": "BBWS180209747",
            "dpc": "03020932601",
            "name": "លឹម ប៊ុនសឺ"
        },
        {
            "barcode": "BBWS180209748",
            "dpc": "03020932501",
            "name": "ទី វត្ថា"
        },
        {
            "barcode": "BBWS180209749",
            "dpc": "03020932801",
            "name": "ទេស អាណុង"
        },
        {
            "barcode": "BBWS180209750",
            "dpc": "03020937401",
            "name": "កៅ សួម"
        },
        {
            "barcode": "BBWS180209751",
            "dpc": "03020937301",
            "name": "លាយ សាវឿន"
        },
        {
            "barcode": "BBWS180209752",
            "dpc": "03020937201",
            "name": "តាំង សុផល"
        },
        {
            "barcode": "BBWS180209753",
            "dpc": "03020937101",
            "name": "ពៅ សាំង"
        },
        {
            "barcode": "BBWS180209754",
            "dpc": "03020937001",
            "name": "ជ័យ សែន"
        },
        {
            "barcode": "BBWS180209755",
            "dpc": "03020936901",
            "name": "ឈួង  ផាន់នី"
        },
        {
            "barcode": "BBWS180209756",
            "dpc": "03020936801",
            "name": "សេង សុភាព"
        },
        {
            "barcode": "BBWS180209757",
            "dpc": "03020936701",
            "name": "ឡុង សារុំ"
        },
        {
            "barcode": "BBWS180209758",
            "dpc": "03020936601",
            "name": "មាស បាន"
        },
        {
            "barcode": "BBWS180209759",
            "dpc": "03020936301",
            "name": "គឹម តាន់យ៉ា"
        },
        {
            "barcode": "BBWS180209760",
            "dpc": "03020936401",
            "name": "សោ វិចិត្រ"
        },
        {
            "barcode": "BBWS180209761",
            "dpc": "03020938301",
            "name": "អុំ  ណារិន"
        },
        {
            "barcode": "BBWS180209762",
            "dpc": "03020938201",
            "name": "ប៉ិល ដារ៉ា"
        },
        {
            "barcode": "BBWS180209763",
            "dpc": "03020938101",
            "name": "បុល  ដាវីត"
        },
        {
            "barcode": "BBWS180209764",
            "dpc": "03020938001",
            "name": "ប៉ិល ឆវិឌ្ឍន៍"
        },
        {
            "barcode": "BBWS180209765",
            "dpc": "03020937801",
            "name": "ហាស់ ស៊ីផាន់"
        },
        {
            "barcode": "BBWS180209766",
            "dpc": "03020937901",
            "name": "ចក់ ឆន"
        },
        {
            "barcode": "BBWS180209767",
            "dpc": "03020937701",
            "name": "ទឹម ភី"
        },
        {
            "barcode": "BBWS180209768",
            "dpc": "03020937601",
            "name": "ខ្វែក វ៉ាន់ឌឿន"
        },
        {
            "barcode": "BBWS180209769",
            "dpc": "03020937501",
            "name": "ឆឺយ គឹមយ៉េន"
        },
        {
            "barcode": "BBWS180209770",
            "dpc": "03020935901",
            "name": "គឹម សុផានី"
        },
        {
            "barcode": "BBWS180209771",
            "dpc": "03020935801",
            "name": "មាស សារី"
        },
        {
            "barcode": "BBWS180209772",
            "dpc": "03020935701",
            "name": "ហេ បុប្ផា"
        },
        {
            "barcode": "BBWS180209773",
            "dpc": "03020935601",
            "name": "ខុង មន្នី"
        },
        {
            "barcode": "BBWS180209774",
            "dpc": "03020935501",
            "name": "អូន សៀន"
        },
        {
            "barcode": "BBWS180209775",
            "dpc": "03020936201",
            "name": "គឹម គា"
        },
        {
            "barcode": "BBWS180209776",
            "dpc": "03020936101",
            "name": "គឹម ហេង"
        },
        {
            "barcode": "BBWS180209777",
            "dpc": "03020923301",
            "name": "ថេង សុជាតា"
        },
        {
            "barcode": "BBWS180209778",
            "dpc": "03020923401",
            "name": "អ៊ឹង ម៉េងលី"
        },
        {
            "barcode": "BBWS180209779",
            "dpc": "03020923501",
            "name": "វង្ស ដាវី"
        },
        {
            "barcode": "BBWS180209780",
            "dpc": "03020923601",
            "name": "តេង សោភ័ណ្ឌ"
        },
        {
            "barcode": "BBWS180209781",
            "dpc": "03020923701",
            "name": "ព្រុំ ប្រសិទ្ធ"
        },
        {
            "barcode": "BBWS180209782",
            "dpc": "03020923801",
            "name": "ស៊ី អ៊ីវ"
        },
        {
            "barcode": "BBWS180209783",
            "dpc": "03020923901",
            "name": "ជា សុខចេង"
        },
        {
            "barcode": "BBWS180209784",
            "dpc": "03020924001",
            "name": "ជា ពៅ"
        },
        {
            "barcode": "BBWS180209785",
            "dpc": "03020924601",
            "name": "អុំ ប៉េងសុង"
        },
        {
            "barcode": "BBWS180209786",
            "dpc": "03020925201",
            "name": "សោម សុផា"
        },
        {
            "barcode": "BBWS180209787",
            "dpc": "03020925301",
            "name": "អេន សុវណ្ណារ៉ា"
        },
        {
            "barcode": "BBWS180209788",
            "dpc": "03020925401",
            "name": "ស៊ុន ហឿន"
        },
        {
            "barcode": "BBWS180209789",
            "dpc": "03020925501",
            "name": "ហែម រ៉ា"
        },
        {
            "barcode": "BBWS180209790",
            "dpc": "03020925601",
            "name": "នូ ផន"
        },
        {
            "barcode": "BBWS180209791",
            "dpc": "03020925701",
            "name": "ម៉េង ទី"
        },
        {
            "barcode": "BBWS180209792",
            "dpc": "03020925801",
            "name": "ម៉ៅ ស្រីកែវ"
        },
        {
            "barcode": "BBWS180209793",
            "dpc": "03020925901",
            "name": "សុខ សាលួត"
        },
        {
            "barcode": "BBWS180209794",
            "dpc": "03020926001",
            "name": "ចាន់ យ៉ា"
        },
        {
            "barcode": "BBWS180209795",
            "dpc": "03020926101",
            "name": "រស់ សាម៉ែន"
        },
        {
            "barcode": "BBWS180209796",
            "dpc": "03020926201",
            "name": "ជិន លាភ"
        },
        {
            "barcode": "BBWS180209797",
            "dpc": "03020926301",
            "name": "ស៊ុន បេ"
        },
        {
            "barcode": "BBWS180209798",
            "dpc": "03020926401",
            "name": "ម៉ាក់ ស៊ីណាត"
        },
        {
            "barcode": "BBWS180209799",
            "dpc": "03020926501",
            "name": "សេង ថេង"
        },
        {
            "barcode": "BBWS180209800",
            "dpc": "03020926601",
            "name": "យៀង នៅ"
        },
        {
            "barcode": "BBWS180209801",
            "dpc": "03020926701",
            "name": "ពេជ្រ ហេង"
        },
        {
            "barcode": "BBWS180209802",
            "dpc": "03020926801",
            "name": "កែវ សន"
        },
        {
            "barcode": "BBWS180209803",
            "dpc": "03020927001",
            "name": "ប៊ុន យ៉ារីន"
        },
        {
            "barcode": "BBWS180209804",
            "dpc": "03020926901",
            "name": "គុណ សារ៉ូ"
        },
        {
            "barcode": "BBWS180209805",
            "dpc": "03020927101",
            "name": "សាំង ភៅ"
        },
        {
            "barcode": "BBWS180209806",
            "dpc": "03020927201",
            "name": "លឹម យូហេង"
        },
        {
            "barcode": "BBWS180209807",
            "dpc": "03020927301",
            "name": "ង៉ុយ ស៊ីម"
        },
        {
            "barcode": "BBWS180209808",
            "dpc": "03020927501",
            "name": "សម ភារិន"
        },
        {
            "barcode": "BBWS180209809",
            "dpc": "03020927601",
            "name": "តោ ចាន់ថន"
        },
        {
            "barcode": "BBWS180209810",
            "dpc": "03020927701",
            "name": "លី ប៊ុនរៀន ១"
        },
        {
            "barcode": "BBWS180209811",
            "dpc": "03020927801",
            "name": "ហាន់ សុជិត"
        },
        {
            "barcode": "BBWS180209812",
            "dpc": "03020927901",
            "name": "លី ប៊ុនរឿន ២"
        },
        {
            "barcode": "BBWS180209813",
            "dpc": "03020928001",
            "name": "តោ ចាន់ថន ២"
        },
        {
            "barcode": "BBWS180209814",
            "dpc": "03020928101",
            "name": "ថោ សាន"
        },
        {
            "barcode": "BBWS180209815",
            "dpc": "03020928201",
            "name": "ចាន់ ឌឿន"
        },
        {
            "barcode": "BBWS180209816",
            "dpc": "03020928301",
            "name": "កូវ ជិញសៀង"
        },
        {
            "barcode": "BBWS180209817",
            "dpc": "03020928401",
            "name": "ភួង មេត្តា"
        },
        {
            "barcode": "BBWS180209818",
            "dpc": "03020928701",
            "name": "ម៉ា ព្រៀន"
        },
        {
            "barcode": "BBWS180209819",
            "dpc": "03020928801",
            "name": "ហ៊ុន  ណៃ"
        },
        {
            "barcode": "BBWS180209820",
            "dpc": "03020928901",
            "name": "ម៉ៃ សាវ៉ាតឌី"
        },
        {
            "barcode": "BBWS180209821",
            "dpc": "03020929001",
            "name": "ប៉ៃ  ទ្រី"
        },
        {
            "barcode": "BBWS180209822",
            "dpc": "03020929101",
            "name": "មុត ឈាង"
        },
        {
            "barcode": "BBWS180209823",
            "dpc": "03020929301",
            "name": "ទៀង សូលីណា"
        },
        {
            "barcode": "BBWS180209824",
            "dpc": "03020929401",
            "name": "ខេង ម៉ាក់ខេន"
        },
        {
            "barcode": "BBWS180209825",
            "dpc": "03020929501",
            "name": "នាង អ៊ីវ៉ាត"
        },
        {
            "barcode": "BBWS180209826",
            "dpc": "03020929601",
            "name": "ឈឹម សិលា"
        },
        {
            "barcode": "BBWS180209827",
            "dpc": "03020929701",
            "name": "សោម សាវួច"
        },
        {
            "barcode": "BBWS180209828",
            "dpc": "03020924301",
            "name": "ផេង សុភី"
        },
        {
            "barcode": "BBWS180209829",
            "dpc": "03020924501",
            "name": "ដង  ខ្វិត"
        },
        {
            "barcode": "BBWS180209830",
            "dpc": "03020924701",
            "name": "លឹម ប៉ូលីន"
        },
        {
            "barcode": "BBWS180209831",
            "dpc": "03020924801",
            "name": "កង វណ្ណៈ"
        },
        {
            "barcode": "BBWS180209832",
            "dpc": "03020924901",
            "name": "ចាន់ វ៉ារ៉ាសៀន"
        },
        {
            "barcode": "BBWS180209833",
            "dpc": "03020925001",
            "name": "ចាន់ ម៉ូនីតា"
        },
        {
            "barcode": "BBWS180209834",
            "dpc": "03020925101",
            "name": "ផូ ចិន"
        },
        {
            "barcode": "BBWS180209835",
            "dpc": "03020941701",
            "name": "គន់ សារូ"
        },
        {
            "barcode": "BBWS180209836",
            "dpc": "03020941901",
            "name": "យ៉ង់ ប៉ូឡែន"
        },
        {
            "barcode": "BBWS180209837",
            "dpc": "03020942001",
            "name": "ជា គីម"
        },
        {
            "barcode": "BBWS180209838",
            "dpc": "03020942201",
            "name": "ផា ចន្ធូរ"
        },
        {
            "barcode": "BBWS180209839",
            "dpc": "03020942301",
            "name": "ខៀវ ស៊ី"
        },
        {
            "barcode": "BBWS180209840",
            "dpc": "03020942401",
            "name": "ឈុំ កែវ"
        },
        {
            "barcode": "BBWS180209841",
            "dpc": "03020942501",
            "name": "ទា ហ៊ុយ"
        },
        {
            "barcode": "BBWS180209842",
            "dpc": "03020939601",
            "name": "ងុវ៉ូ  ដៀប"
        },
        {
            "barcode": "BBWS180209843",
            "dpc": "03020939801",
            "name": "ហុក ចន្ទ្រា"
        },
        {
            "barcode": "BBWS180209844",
            "dpc": "03020939901",
            "name": "វ៉ាយ គល់"
        },
        {
            "barcode": "BBWS180209845",
            "dpc": "03020940301",
            "name": "យឹម សាវឿន"
        },
        {
            "barcode": "BBWS180209846",
            "dpc": "03020940601",
            "name": "មៀច សាម៉េត"
        },
        {
            "barcode": "BBWS180209847",
            "dpc": "03020940701",
            "name": "កែវ អ៊ឹម"
        },
        {
            "barcode": "BBWS180209848",
            "dpc": "03020940801",
            "name": "ព្រឿន ប្រសិទ្ធ"
        },
        {
            "barcode": "BBWS180209849",
            "dpc": "03020940901",
            "name": "អ៊ឹង ចាន់ធី"
        },
        {
            "barcode": "BBWS180209850",
            "dpc": "03020941001",
            "name": "ព្រឿង គៀវ"
        },
        {
            "barcode": "BBWS180209851",
            "dpc": "03020941101",
            "name": "អ៊ឹម ដាវី"
        },
        {
            "barcode": "BBWS180209852",
            "dpc": "03020940501",
            "name": "អ៊ឹម ដាញ៉ឹម"
        },
        {
            "barcode": "BBWS180209853",
            "dpc": "03020940401",
            "name": "ចាន់ មុំ"
        },
        {
            "barcode": "BBWS180209854",
            "dpc": "03020940001",
            "name": "ឈីវ ទី"
        },
        {
            "barcode": "BBWS180209855",
            "dpc": "03020940101",
            "name": "ផាវ មុន្នី"
        },
        {
            "barcode": "BBWS180209856",
            "dpc": "03020940201",
            "name": "គី សែ"
        },
        {
            "barcode": "BBWS180209857",
            "dpc": "03020941301",
            "name": "រៀន ណារ៉ា"
        },
        {
            "barcode": "BBWS180209858",
            "dpc": "03020941401",
            "name": "កូវ ជិញសៀង"
        },
        {
            "barcode": "BBWS180209859",
            "dpc": "03020941601",
            "name": "យក់ ចំរើន"
        },
        {
            "barcode": "BBWS180209860",
            "dpc": "03020942801",
            "name": "ម៉ៅ រ័ត្នមុនី"
        },
        {
            "barcode": "BBWS180209861",
            "dpc": "03020942901",
            "name": "ទូច វណ្ណី"
        },
        {
            "barcode": "BBWS180209862",
            "dpc": "03020943001",
            "name": "គា សិលា"
        },
        {
            "barcode": "BBWS180209863",
            "dpc": "03020941801",
            "name": "កែវ គឹមសាន"
        },
        {
            "barcode": "BBWS180209864",
            "dpc": "03020939001",
            "name": "ចាន់ សុខឡេង"
        },
        {
            "barcode": "BBWS180209865",
            "dpc": "03020939201",
            "name": "ឃុន អ៊ូ"
        },
        {
            "barcode": "BBWS180209866",
            "dpc": "03020939301",
            "name": "ណី សំណា"
        },
        {
            "barcode": "BBWS180209867",
            "dpc": "03020939401",
            "name": "ង៉ូវ ហ៊ុយ"
        },
        {
            "barcode": "BBWS180209868",
            "dpc": "03020939501",
            "name": "ស ហាវ"
        },
        {
            "barcode": "BBWS180209869",
            "dpc": "03020942701",
            "name": "សែម សុខា"
        },
        {
            "barcode": "BBWS180209870",
            "dpc": "03020938701",
            "name": "វ៉ធ សុខុម"
        },
        {
            "barcode": "BBWS180209871",
            "dpc": "03020938401",
            "name": "អ៊ីវ ប៉ូឡូ"
        },
        {
            "barcode": "BBWS180209872",
            "dpc": "03020938501",
            "name": "អ៊ី ឆេង"
        },
        {
            "barcode": "BBWS180209873",
            "dpc": "03020938601",
            "name": "ញ៉ក់ ពីវ"
        },
        {
            "barcode": "BBWS180209874",
            "dpc": "03020938801",
            "name": "ប៉ុល កែវ"
        },
        {
            "barcode": "BBWS180209875",
            "dpc": "03020938901",
            "name": "គឹម កេង"
        },
        {
            "barcode": "BBWS180209876",
            "dpc": "03020945301",
            "name": "សាំង បូរ៉ា"
        },
        {
            "barcode": "BBWS180209877",
            "dpc": "03020945401",
            "name": "មឿង សារិទ្ធ"
        },
        {
            "barcode": "BBWS180209878",
            "dpc": "03020945501",
            "name": "ហេង សុវណ្ណ"
        },
        {
            "barcode": "BBWS180209879",
            "dpc": "03020945601",
            "name": "សុខ អេង"
        },
        {
            "barcode": "BBWS180209880",
            "dpc": "03020945701",
            "name": "អ៊ុន សំប៊ុន"
        },
        {
            "barcode": "BBWS180209881",
            "dpc": "03020945901",
            "name": "គឹម  ទ្រី"
        },
        {
            "barcode": "BBWS180209882",
            "dpc": "03020946001",
            "name": "សាន ថាវៀង"
        },
        {
            "barcode": "BBWS180209883",
            "dpc": "03020946101",
            "name": "វិន វន"
        },
        {
            "barcode": "BBWS180209884",
            "dpc": "03020946201",
            "name": "ស្រី សំណាង"
        },
        {
            "barcode": "BBWS180209885",
            "dpc": "03020946301",
            "name": "ម៉ុយ ដារ៉ាវុធ"
        },
        {
            "barcode": "BBWS180209886",
            "dpc": "03020946401",
            "name": "ទិព្វ ចន្ទវិបុល"
        },
        {
            "barcode": "BBWS180209887",
            "dpc": "03020946501",
            "name": "ភោគ វុទ្ធី"
        },
        {
            "barcode": "BBWS180209888",
            "dpc": "03020946601",
            "name": "ស៊ុន ចំរ៉ាត់ ១"
        },
        {
            "barcode": "BBWS180209889",
            "dpc": "03020946701",
            "name": "ស៊ុន ចំរ៉ាត់ ២"
        },
        {
            "barcode": "BBWS180209890",
            "dpc": "03020946801",
            "name": "នូ វណ្ណា"
        },
        {
            "barcode": "BBWS180209891",
            "dpc": "03020946901",
            "name": "សោម សុផា"
        },
        {
            "barcode": "BBWS180209892",
            "dpc": "03020947101",
            "name": "ស ម៉ារ៉ា"
        },
        {
            "barcode": "BBWS180209893",
            "dpc": "03020947201",
            "name": "តាំង ជៀវឡាយ"
        },
        {
            "barcode": "BBWS180209894",
            "dpc": "03020947301",
            "name": "អ៊ីវ ឈឿប"
        },
        {
            "barcode": "BBWS180209895",
            "dpc": "03020947501",
            "name": "ងួន សុខគង់"
        },
        {
            "barcode": "BBWS180209896",
            "dpc": "03020947601",
            "name": "ពឹង ភាព"
        },
        {
            "barcode": "BBWS180209897",
            "dpc": "03020947701",
            "name": "គង់ ថៃឆេង"
        },
        {
            "barcode": "BBWS180209898",
            "dpc": "03020947801",
            "name": "លី មួយនី"
        },
        {
            "barcode": "BBWS180209899",
            "dpc": "03020947901",
            "name": "មៀច កន"
        },
        {
            "barcode": "BBWS180209900",
            "dpc": "03020943101",
            "name": "ម៉ែន សាម៉ុន ២"
        },
        {
            "barcode": "BBWS180209901",
            "dpc": "03020943201",
            "name": "ហម ហ៊ន"
        },
        {
            "barcode": "BBWS180209902",
            "dpc": "03020943301",
            "name": "ចាន់ ប៊ុនធី"
        },
        {
            "barcode": "BBWS180209903",
            "dpc": "03020943401",
            "name": "ណុប សុដេត"
        },
        {
            "barcode": "BBWS180209904",
            "dpc": "03020943501",
            "name": "ជៀវ  គឹមឈៀត"
        },
        {
            "barcode": "BBWS180209905",
            "dpc": "03020943601",
            "name": "ម៉ាញ់ កែវ"
        },
        {
            "barcode": "BBWS180209906",
            "dpc": "03020943701",
            "name": "ជាវ ស្រៀង"
        },
        {
            "barcode": "BBWS180209907",
            "dpc": "03020943801",
            "name": "អ៊ុយ ជិនណា"
        },
        {
            "barcode": "BBWS180209908",
            "dpc": "03020943901",
            "name": "អ៊ុន សំអូន"
        },
        {
            "barcode": "BBWS180209909",
            "dpc": "03020944001",
            "name": "អ៊ុន សំអាត"
        },
        {
            "barcode": "BBWS180209910",
            "dpc": "03020944101",
            "name": "សួន សុវណ្ណ"
        },
        {
            "barcode": "BBWS180209911",
            "dpc": "03020944201",
            "name": "ម៉ម ឡា"
        },
        {
            "barcode": "BBWS180209912",
            "dpc": "03020944301",
            "name": "ធន់ សេរី"
        },
        {
            "barcode": "BBWS180209913",
            "dpc": "03020944401",
            "name": "ជិន ហុង"
        },
        {
            "barcode": "BBWS180209914",
            "dpc": "03020944501",
            "name": "យិន ដាំ"
        },
        {
            "barcode": "BBWS180209915",
            "dpc": "03020944601",
            "name": "ខេង ឡាយ"
        },
        {
            "barcode": "BBWS180209916",
            "dpc": "03020944701",
            "name": "អ៊ឹម ហៃ"
        },
        {
            "barcode": "BBWS180209917",
            "dpc": "03020944801",
            "name": "ហៃ សុភាព"
        },
        {
            "barcode": "BBWS180209918",
            "dpc": "03020944901",
            "name": "ហម នី"
        },
        {
            "barcode": "BBWS180209919",
            "dpc": "03020945101",
            "name": "ទុយ ប៊ុនឈត"
        },
        {
            "barcode": "BBWS180209920",
            "dpc": "03020945201",
            "name": "សំ ប៊ុន"
        },
        {
            "barcode": "BBWS180209921",
            "dpc": "03020914201",
            "name": "វត្តលៀប"
        },
        {
            "barcode": "BBWS180209922",
            "dpc": "03020945001",
            "name": "សេង ថៃលី"
        },
        {
            "barcode": "BBWS180209923",
            "dpc": "03020941501",
            "name": "វ៉ាន់ វារី"
        },
        {
            "barcode": "BBWS180209924",
            "dpc": "03020939701",
            "name": "ហួយ ប៊ុនឡេង"
        },
        {
            "barcode": "BBWS180209925",
            "dpc": "03020906701",
            "name": "ចៅ  យិ"
        },
        {
            "barcode": "BBWS180209926",
            "dpc": "03020911601",
            "name": "សុច  សុផល"
        },
        {
            "barcode": "BBWS180209927",
            "dpc": "03020913301",
            "name": "ទ្រីញ  អាន"
        },
        {
            "barcode": "BBWS180209928",
            "dpc": "03020915501",
            "name": "ពេទ្យ  ផាវ៉ាន់"
        },
        {
            "barcode": "BBWS180209929",
            "dpc": "03020919401",
            "name": "ម៉ែន   តិច"
        },
        {
            "barcode": "BBWS180209930",
            "dpc": "03020921801",
            "name": "ឡុង   ដេត"
        },
        {
            "barcode": "BBWS180209931",
            "dpc": "03020921901",
            "name": "លឹម  ហ៊ួសាន"
        },
        {
            "barcode": "BBWS180209932",
            "dpc": "03020922001",
            "name": "សុខ   ប៊ុននី"
        },
        {
            "barcode": "BBWS180209933",
            "dpc": "03020922401",
            "name": "យឹម  ឈឿម"
        },
        {
            "barcode": "BBWS180209934",
            "dpc": "03020922501",
            "name": "ដាំ  សាម៉ី"
        },
        {
            "barcode": "BBWS180209935",
            "dpc": "03020922601",
            "name": "ទេស  ឈុំសាម៉ុន"
        },
        {
            "barcode": "BBWS180209936",
            "dpc": "03020922701",
            "name": "ហៀក  ស្រេង ៩"
        },
        {
            "barcode": "BBWS180209937",
            "dpc": "03020923101",
            "name": "ណាំ  ទីស៊ុនធួក"
        },
        {
            "barcode": "BBWS180209938",
            "dpc": "03020923201",
            "name": "ណាំ  ចាន់ថានី"
        },
        {
            "barcode": "BBWS180209939",
            "dpc": "03020924101",
            "name": "ធូ  ចឹក"
        },
        {
            "barcode": "BBWS180209940",
            "dpc": "03020924201",
            "name": "អួន  សុភី"
        },
        {
            "barcode": "BBWS180209941",
            "dpc": "03020929801",
            "name": "វ៉ាន់    អេង"
        },
        {
            "barcode": "BBWS180209942",
            "dpc": "03020929901",
            "name": "នួន   ផល្លី"
        },
        {
            "barcode": "BBWS180209943",
            "dpc": "03020930001",
            "name": "តាន់  គឹមស៊ាន"
        },
        {
            "barcode": "BBWS180209944",
            "dpc": "03020930101",
            "name": "អ៊ឹម  សារឿន"
        },
        {
            "barcode": "BBWS180209945",
            "dpc": "03020930201",
            "name": "ម៉ន  ម៉ុន"
        },
        {
            "barcode": "BBWS180209946",
            "dpc": "03020930301",
            "name": "ញ៉ែម  មឿន"
        },
        {
            "barcode": "BBWS180209947",
            "dpc": "03020930401",
            "name": "សៅ  ភីរិទ្ធ"
        },
        {
            "barcode": "BBWS180209948",
            "dpc": "03020930501",
            "name": "សៅ  ភីរុទ្ធ"
        },
        {
            "barcode": "BBWS180209949",
            "dpc": "03020930601",
            "name": "ហឿន  សំរិទ្ធិ"
        },
        {
            "barcode": "BBWS180209950",
            "dpc": "03020930701",
            "name": "តាំង  សេងហ៊ាង"
        },
        {
            "barcode": "BBWS180209951",
            "dpc": "03020930801",
            "name": "ធូ  សុជាតិ"
        },
        {
            "barcode": "BBWS180209952",
            "dpc": "03020930901",
            "name": "កាន  ហួ"
        },
        {
            "barcode": "BBWS180209953",
            "dpc": "03020931001",
            "name": "លាយ  សុភី"
        },
        {
            "barcode": "BBWS180209954",
            "dpc": "03020931201",
            "name": "ហួត  សុគុណ ២"
        },
        {
            "barcode": "BBWS180209955",
            "dpc": "03020931301",
            "name": "ខ្លង  សារិន"
        },
        {
            "barcode": "BBWS180209956",
            "dpc": "03020931401",
            "name": "វ៉ាន់  ថុល"
        },
        {
            "barcode": "BBWS180209957",
            "dpc": "03020931501",
            "name": "ចេង  ឡៃ"
        },
        {
            "barcode": "BBWS180209958",
            "dpc": "03020931601",
            "name": "សំ  សុន"
        },
        {
            "barcode": "BBWS180209959",
            "dpc": "03020931801",
            "name": "មុំ  ឌឹម"
        },
        {
            "barcode": "BBWS180209960",
            "dpc": "03020931901",
            "name": "ឌឹម  សំអាង"
        },
        {
            "barcode": "BBWS180209961",
            "dpc": "03020941201",
            "name": "ហាក់  ថាំង"
        },
        {
            "barcode": "BBWS180209962",
            "dpc": "03020922101",
            "name": "ងិន  សារ៉េត"
        },
        {
            "barcode": "BBWS180209963",
            "dpc": "03020922201",
            "name": "ហេង  រក្សា"
        },
        {
            "barcode": "BBWS180209964",
            "dpc": "03020922301",
            "name": "សាន  លាងគីម"
        },
        {
            "barcode": "BBWS180209965",
            "dpc": "03020909001",
            "name": "ប៊ី ទូច"
        },
        {
            "barcode": "BBWS180209966",
            "dpc": "03020909401",
            "name": "ហេង អូន"
        },
        {
            "barcode": "BBWS180209967",
            "dpc": "03020909501",
            "name": "សួរ ណាលី"
        },
        {
            "barcode": "BBWS180209968",
            "dpc": "03020909601",
            "name": "ច័ន្ទ ចៀន"
        },
        {
            "barcode": "BBWS180209969",
            "dpc": "03020909701",
            "name": "ទី ផាត"
        },
        {
            "barcode": "BBWS180209970",
            "dpc": "03020909801",
            "name": "ហេង សារ៉ាត់"
        },
        {
            "barcode": "BBWS180209971",
            "dpc": "03020909901",
            "name": "វង្ស សុក្រសារវ័ន្ត"
        },
        {
            "barcode": "BBWS180209972",
            "dpc": "03020910001",
            "name": "ជុំ អុល"
        },
        {
            "barcode": "BBWS180209973",
            "dpc": "03020910101",
            "name": "គង់ ផៃ"
        },
        {
            "barcode": "BBWS180209974",
            "dpc": "03020910301",
            "name": "យឹម  សំបូរ"
        },
        {
            "barcode": "BBWS180209975",
            "dpc": "03020907701",
            "name": "វេង  ហោ"
        },
        {
            "barcode": "BBWS180209976",
            "dpc": "03020907801",
            "name": "ថុង គឹមស៊ួរ"
        },
        {
            "barcode": "BBWS180209977",
            "dpc": "03020907901",
            "name": "វង្ស វឹង"
        },
        {
            "barcode": "BBWS180209978",
            "dpc": "03020908601",
            "name": "ឡេង ឃុនសុខផល្លី"
        },
        {
            "barcode": "BBWS180209979",
            "dpc": "03020908701",
            "name": "ឡយ ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180209980",
            "dpc": "03020908801",
            "name": "អេង ប៊ុនហេង"
        },
        {
            "barcode": "BBWS180209981",
            "dpc": "03020908901",
            "name": "វិញ រ៉ាឌី"
        },
        {
            "barcode": "BBWS180209982",
            "dpc": "03020909301",
            "name": "ឡាយ សុខខេង"
        },
        {
            "barcode": "BBWS180209983",
            "dpc": "03020908501",
            "name": "ឡៅ ឆាយទ្រី"
        },
        {
            "barcode": "BBWS180209984",
            "dpc": "03020908401",
            "name": "ជួង ខ្វា"
        },
        {
            "barcode": "BBWS180209985",
            "dpc": "03020908301",
            "name": "ថេង"
        },
        {
            "barcode": "BBWS180209986",
            "dpc": "03020908201",
            "name": "ឃុន សុឆី"
        },
        {
            "barcode": "BBWS180209987",
            "dpc": "03020908101",
            "name": "ចន សំណាង"
        },
        {
            "barcode": "BBWS180209988",
            "dpc": "03020908001",
            "name": "សុខ ចាន់"
        },
        {
            "barcode": "BBWS180209989",
            "dpc": "03020907601",
            "name": "សុខ សារ៉ាន់"
        },
        {
            "barcode": "BBWS180209990",
            "dpc": "03020907501",
            "name": "រស់ ឈន"
        },
        {
            "barcode": "BBWS180209991",
            "dpc": "03020907401",
            "name": "ហេង ចាន់ថា"
        },
        {
            "barcode": "BBWS180209992",
            "dpc": "03020907301",
            "name": "ព្រំ ធៀន"
        },
        {
            "barcode": "BBWS180209993",
            "dpc": "03020907201",
            "name": "គ្រី គឹមឈន"
        },
        {
            "barcode": "BBWS180209994",
            "dpc": "03020907101",
            "name": "រឿម សក់"
        },
        {
            "barcode": "BBWS180209995",
            "dpc": "03020907001",
            "name": "ចាន់ នី"
        },
        {
            "barcode": "BBWS180209996",
            "dpc": "03020906901",
            "name": "សាំង ស៊ីថា"
        },
        {
            "barcode": "BBWS180209997",
            "dpc": "03020906801",
            "name": "សេង ស៊ុយ"
        },
        {
            "barcode": "BBWS180209998",
            "dpc": "03020906601",
            "name": "វិសុទ្ធ រដ្ឋា"
        },
        {
            "barcode": "BBWS180209999",
            "dpc": "03020906501",
            "name": "ចាន់ សូយ៉េត"
        },
        {
            "barcode": "BBWS180210000",
            "dpc": "03020905701",
            "name": "ញ៉ែម សឿន"
        },
        {
            "barcode": "BBWS180210001",
            "dpc": "03020905801",
            "name": "និត ស៊ីញ"
        },
        {
            "barcode": "BBWS180210002",
            "dpc": "03020905901",
            "name": "អ៊ុក វង្ស"
        },
        {
            "barcode": "BBWS180210003",
            "dpc": "03020906001",
            "name": "ខូវ ឈូក"
        },
        {
            "barcode": "BBWS180210004",
            "dpc": "03020906101",
            "name": "សៀង សុថង ១"
        },
        {
            "barcode": "BBWS180210005",
            "dpc": "03020906201",
            "name": "សៀង សុថង ២"
        },
        {
            "barcode": "BBWS180210006",
            "dpc": "03020906301",
            "name": "សៀង សុថង ៣"
        },
        {
            "barcode": "BBWS180210007",
            "dpc": "03020906401",
            "name": "អែល សយ"
        },
        {
            "barcode": "BBWS180210008",
            "dpc": "03020905201",
            "name": "អ៊ឹង ចាន់ថន"
        },
        {
            "barcode": "BBWS180210009",
            "dpc": "03020905301",
            "name": "ហឿន ឌឿ"
        },
        {
            "barcode": "BBWS180210010",
            "dpc": "03020905401",
            "name": "ធី គិន"
        },
        {
            "barcode": "BBWS180210011",
            "dpc": "03020905501",
            "name": "សូរ សុគុណ"
        },
        {
            "barcode": "BBWS180210012",
            "dpc": "03020905601",
            "name": "ឆាយ សារ៉េត ១"
        },
        {
            "barcode": "BBWS180210013",
            "dpc": "03020905001",
            "name": "ម៉ែន  ហួត"
        },
        {
            "barcode": "BBWS180210014",
            "dpc": "03020904601",
            "name": "គូ សុគន្ធាវី"
        },
        {
            "barcode": "BBWS180210015",
            "dpc": "03020904801",
            "name": "ស វុទ្ធី"
        },
        {
            "barcode": "BBWS180210016",
            "dpc": "03020905101",
            "name": "សៀវ ចន្នី"
        },
        {
            "barcode": "BBWS180210017",
            "dpc": "03020904501",
            "name": "អឿ ឈឿត"
        },
        {
            "barcode": "BBWS180210018",
            "dpc": "03020904401",
            "name": "ហង់ ប៊ុនថន"
        },
        {
            "barcode": "BBWS180210019",
            "dpc": "03020904301",
            "name": "អ៊ុយ លីវ ៩"
        },
        {
            "barcode": "BBWS180210020",
            "dpc": "03020904201",
            "name": "អ៊ុយ លីវ ៨"
        },
        {
            "barcode": "BBWS180210021",
            "dpc": "03020904101",
            "name": "អ៊ុយ លីវ ៧"
        },
        {
            "barcode": "BBWS180210022",
            "dpc": "03020904001",
            "name": "អ៊ុយ លីវ  ៦"
        },
        {
            "barcode": "BBWS180210023",
            "dpc": "03020903801",
            "name": "អ៊ុយ លីវ ៤"
        },
        {
            "barcode": "BBWS180210024",
            "dpc": "03020903701",
            "name": "អ៊ុយ លីវ ៣"
        },
        {
            "barcode": "BBWS180210025",
            "dpc": "03020903601",
            "name": "អ៊ុយ លីវ ២"
        },
        {
            "barcode": "BBWS180210026",
            "dpc": "03020903501",
            "name": "អ៊ុយ លីវ ១"
        },
        {
            "barcode": "BBWS180210027",
            "dpc": "03020903401",
            "name": "តាន់ ម៉ាល័យ"
        },
        {
            "barcode": "BBWS180210028",
            "dpc": "03020903301",
            "name": "អេង សុវណ្ណី"
        },
        {
            "barcode": "BBWS180210029",
            "dpc": "03020903201",
            "name": "កៅ ឈួនណារ៉ា"
        },
        {
            "barcode": "BBWS180210030",
            "dpc": "03020903101",
            "name": "អ៊ឹម សុជិត"
        },
        {
            "barcode": "BBWS180210031",
            "dpc": "03020903001",
            "name": "ម៉ី សាវី"
        },
        {
            "barcode": "BBWS180210032",
            "dpc": "03020902901",
            "name": "អ៊ឹម ហឿន"
        },
        {
            "barcode": "BBWS180210033",
            "dpc": "03020902601",
            "name": "រស់ សុក្រិត"
        },
        {
            "barcode": "BBWS180210034",
            "dpc": "03020902501",
            "name": "អ៊ុង សាមី"
        },
        {
            "barcode": "BBWS180210035",
            "dpc": "03020902401",
            "name": "តន់ ប៊ុនរឿង"
        },
        {
            "barcode": "BBWS180210036",
            "dpc": "03020900101",
            "name": "លី  ឆយ"
        },
        {
            "barcode": "BBWS180210037",
            "dpc": "03020900401",
            "name": "សាលាហ្វឹកហ្វឺនភាសាអន្តរជាតិ"
        },
        {
            "barcode": "BBWS180210038",
            "dpc": "03020900301",
            "name": "ហឺ ដាវី"
        },
        {
            "barcode": "BBWS180210039",
            "dpc": "03020900501",
            "name": "អៀង សុភី"
        },
        {
            "barcode": "BBWS180210040",
            "dpc": "03020900701",
            "name": "សួន សំរិទ្ធ"
        },
        {
            "barcode": "BBWS180210041",
            "dpc": "03020900801",
            "name": "ហម រិទ្ធ"
        },
        {
            "barcode": "BBWS180210042",
            "dpc": "03020900901",
            "name": "ថុល សុធា"
        },
        {
            "barcode": "BBWS180210043",
            "dpc": "03020901001",
            "name": "លី ប៊ួយ"
        },
        {
            "barcode": "BBWS180210044",
            "dpc": "03020901101",
            "name": "តូច ស៊ុនណារ៉ា"
        },
        {
            "barcode": "BBWS180210045",
            "dpc": "03020901201",
            "name": "ហម មន្នី"
        },
        {
            "barcode": "BBWS180210046",
            "dpc": "03020901301",
            "name": "នួម  ឆៃរួម"
        },
        {
            "barcode": "BBWS180210047",
            "dpc": "03020901401",
            "name": "ម៉ក់ ផាន់ណា"
        },
        {
            "barcode": "BBWS180210048",
            "dpc": "03020901501",
            "name": "សុខ ស្រីមុំ"
        },
        {
            "barcode": "BBWS180210049",
            "dpc": "03020901601",
            "name": "ស្វាយ ថាវរិទ្ធ"
        },
        {
            "barcode": "BBWS180210050",
            "dpc": "03020901801",
            "name": "ជ័រ សុវណ្ណ"
        },
        {
            "barcode": "BBWS180210051",
            "dpc": "03020901901",
            "name": "គួយ តាំងអេង"
        },
        {
            "barcode": "BBWS180210052",
            "dpc": "03020902001",
            "name": "យិន យក់"
        },
        {
            "barcode": "BBWS180210053",
            "dpc": "03020901701",
            "name": "ពិន ស៊ីវត្ថា"
        },
        {
            "barcode": "BBWS180210054",
            "dpc": "03020902101",
            "name": "ជូរ ឆានហួត"
        },
        {
            "barcode": "BBWS180210055",
            "dpc": "03020902201",
            "name": "មុំ បុណ្យបូរិន"
        },
        {
            "barcode": "BBWS180210056",
            "dpc": "03020902301",
            "name": "ស៊ុន វ៉ាន់ណូ"
        },
        {
            "barcode": "BBWS180210057",
            "dpc": "03020910601",
            "name": "ម៉ុង ចាន់សារ៉េត"
        },
        {
            "barcode": "BBWS180210058",
            "dpc": "03020910701",
            "name": "សោម កញ្ញារ័ត្ន"
        },
        {
            "barcode": "BBWS180210059",
            "dpc": "03020910901",
            "name": "ឈាង សុវណ្ណា"
        },
        {
            "barcode": "BBWS180210060",
            "dpc": "03020911001",
            "name": "ហែម សិលា"
        },
        {
            "barcode": "BBWS180210061",
            "dpc": "03020911101",
            "name": "ហេង វែងឈៀង"
        },
        {
            "barcode": "BBWS180210062",
            "dpc": "03020911201",
            "name": "ប៉ាន់ នី"
        },
        {
            "barcode": "BBWS180210063",
            "dpc": "03020911401",
            "name": "លី ឆទិញ"
        },
        {
            "barcode": "BBWS180210064",
            "dpc": "03020911501",
            "name": "យិន កោ"
        },
        {
            "barcode": "BBWS180210065",
            "dpc": "03020911701",
            "name": "ចែង ឆុំ"
        },
        {
            "barcode": "BBWS180210066",
            "dpc": "03020911801",
            "name": "ឡុង ស្រី"
        },
        {
            "barcode": "BBWS180210067",
            "dpc": "03020911901",
            "name": "ណូ ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180210068",
            "dpc": "03020912001",
            "name": "ពៅ សុង"
        },
        {
            "barcode": "BBWS180210069",
            "dpc": "03020912101",
            "name": "អៀង គឹមថុល"
        },
        {
            "barcode": "BBWS180210070",
            "dpc": "03020912201",
            "name": "ចន  សំណាង"
        },
        {
            "barcode": "BBWS180210071",
            "dpc": "03020912301",
            "name": "ផល លាងហ៊ីម"
        },
        {
            "barcode": "BBWS180210072",
            "dpc": "03020912401",
            "name": "សេង ទៀង"
        },
        {
            "barcode": "BBWS180210073",
            "dpc": "03020912501",
            "name": "រ៉ុង ប៉ុក"
        },
        {
            "barcode": "BBWS180210074",
            "dpc": "03020912601",
            "name": "ឈឿង ឆន"
        },
        {
            "barcode": "BBWS180210075",
            "dpc": "03020912701",
            "name": "សារិ អឿន"
        },
        {
            "barcode": "BBWS180210076",
            "dpc": "03020912801",
            "name": "ចាន់ ពៅ"
        },
        {
            "barcode": "BBWS180210077",
            "dpc": "03020912901",
            "name": "ឆាយ សារ៉េត"
        },
        {
            "barcode": "BBWS180210078",
            "dpc": "03020913001",
            "name": "ហាស់ អសនី"
        },
        {
            "barcode": "BBWS180210079",
            "dpc": "03020913101",
            "name": "ឃុន ងួន(ថ្មី)"
        },
        {
            "barcode": "BBWS180210080",
            "dpc": "03020913201",
            "name": "ថោង បូរាណ"
        },
        {
            "barcode": "BBWS180210081",
            "dpc": "03020913401",
            "name": "ប៊ុន ដេត"
        },
        {
            "barcode": "BBWS180210082",
            "dpc": "03020913501",
            "name": "កែវ ហួត"
        },
        {
            "barcode": "BBWS180210083",
            "dpc": "03020913601",
            "name": "គា វណ្ណា"
        },
        {
            "barcode": "BBWS180210084",
            "dpc": "03020913701",
            "name": "សេង ហ៊ុយ"
        },
        {
            "barcode": "BBWS180210085",
            "dpc": "03020913801",
            "name": "សុខ ចាន់"
        },
        {
            "barcode": "BBWS180210086",
            "dpc": "03020913901",
            "name": "អ៊ិន ប្រាជ្ញ"
        },
        {
            "barcode": "BBWS180210087",
            "dpc": "03020914001",
            "name": "សុង ហុង (ចាស់)"
        },
        {
            "barcode": "BBWS180210088",
            "dpc": "03020914301",
            "name": "ដែង  រស្មី"
        },
        {
            "barcode": "BBWS180210089",
            "dpc": "03020914401",
            "name": "សុង ហុង (ថ្មី)"
        },
        {
            "barcode": "BBWS180210090",
            "dpc": "03020914601",
            "name": "ប៊ុន ហូហេង"
        },
        {
            "barcode": "BBWS180210091",
            "dpc": "03020914701",
            "name": "អ៊ឹង ប៊ុនហុង"
        },
        {
            "barcode": "BBWS180210092",
            "dpc": "03020914801",
            "name": "ដៀប ទ្រី"
        },
        {
            "barcode": "BBWS180210093",
            "dpc": "03020914901",
            "name": "វិទ្យាស្ថានវប្បធម៌បារាំង"
        },
        {
            "barcode": "BBWS180210094",
            "dpc": "03020915101",
            "name": "សុខ សុផាត ៣"
        },
        {
            "barcode": "BBWS180210095",
            "dpc": "03020915001",
            "name": "វែង ស្រ៊ុន ១"
        },
        {
            "barcode": "BBWS180210096",
            "dpc": "03020915201",
            "name": "វែង ស្រ៊ុន ៤"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
