let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=
    [
        {
            "barcode": "BBWS180205440",
            "dpc": "03031207301",
            "name": "សៀង សៀក ខេង"
        },
        {
            "barcode": "BBWS180205441",
            "dpc": "03031245801",
            "name": "ឃី យ៉ា"
        },
        {
            "barcode": "BBWS180205442",
            "dpc": "03031245701",
            "name": "ជ គាង"
        },
        {
            "barcode": "BBWS180205443",
            "dpc": "03031245601",
            "name": "ឆាយ ម៉េងហ៊ាង"
        },
        {
            "barcode": "BBWS180205444",
            "dpc": "03031245501",
            "name": "ម៉េង ជូ"
        },
        {
            "barcode": "BBWS180205445",
            "dpc": "03031245401",
            "name": "អ៊ូច ដានី"
        },
        {
            "barcode": "BBWS180205446",
            "dpc": "03031245301",
            "name": "គឹម រដ្ឋា"
        },
        {
            "barcode": "BBWS180205447",
            "dpc": "03031238601",
            "name": "អ៊ុក ទូច"
        },
        {
            "barcode": "BBWS180205448",
            "dpc": "03031245101",
            "name": "ឈុន សុរិយា"
        },
        {
            "barcode": "BBWS180205449",
            "dpc": "03031245001",
            "name": "ចាន់ ប៊ុនលឿម"
        },
        {
            "barcode": "BBWS180205450",
            "dpc": "03031244901",
            "name": "អ៊ុក ផាន់ណាក់"
        },
        {
            "barcode": "BBWS180205451",
            "dpc": "03031244801",
            "name": "រៀន ឌ័រ"
        },
        {
            "barcode": "BBWS180205452",
            "dpc": "03031244601",
            "name": "អ៊ុង ឃុន"
        },
        {
            "barcode": "BBWS180205453",
            "dpc": "03031244701",
            "name": "ហេង ឡាង"
        },
        {
            "barcode": "BBWS180205454",
            "dpc": "03031244001",
            "name": "ចេត ហ៊ួរ"
        },
        {
            "barcode": "BBWS180205455",
            "dpc": "03031242601",
            "name": "ទ្រី គឹមទៀង"
        },
        {
            "barcode": "BBWS180205456",
            "dpc": "03031242701",
            "name": "ប៊ិន ពៅ"
        },
        {
            "barcode": "BBWS180205457",
            "dpc": "03031243001",
            "name": "លឹម លី"
        },
        {
            "barcode": "BBWS180205458",
            "dpc": "03031243101",
            "name": "ហាង  សំណាង"
        },
        {
            "barcode": "BBWS180205459",
            "dpc": "03031244101",
            "name": "រុន រ៉ឹយ"
        },
        {
            "barcode": "BBWS180205460",
            "dpc": "03031244201",
            "name": "ឡុង ណាគ្រី"
        },
        {
            "barcode": "BBWS180205461",
            "dpc": "03031244301",
            "name": "ស សារ៉ាបូពាន៍"
        },
        {
            "barcode": "BBWS180205462",
            "dpc": "03031244401",
            "name": "អ៊ុយ វណ្ណា"
        },
        {
            "barcode": "BBWS180205463",
            "dpc": "03031244501",
            "name": "បៅ តុង"
        },
        {
            "barcode": "BBWS180205464",
            "dpc": "03031243301",
            "name": "យន សម្បត្តិ"
        },
        {
            "barcode": "BBWS180205465",
            "dpc": "03031243401",
            "name": "សុខ សុធារិទ្ធ"
        },
        {
            "barcode": "BBWS180205466",
            "dpc": "03031243501",
            "name": "កេន ម៉ៅ"
        },
        {
            "barcode": "BBWS180205467",
            "dpc": "03031243601",
            "name": "ឌុច សុម៉ាលី"
        },
        {
            "barcode": "BBWS180205468",
            "dpc": "03031243701",
            "name": "យន ស៊ីន"
        },
        {
            "barcode": "BBWS180205469",
            "dpc": "03031243801",
            "name": "ដួង ម៉ុន"
        },
        {
            "barcode": "BBWS180205470",
            "dpc": "03031243901",
            "name": "ប្រាក់ លីវណ្ណៈ"
        },
        {
            "barcode": "BBWS180205471",
            "dpc": "03031243201",
            "name": "ឈឺន ឡូវ"
        },
        {
            "barcode": "BBWS180205472",
            "dpc": "03031242901",
            "name": "សំ​ វឹង"
        },
        {
            "barcode": "BBWS180205473",
            "dpc": "03031242801",
            "name": "ផៃ ធឿន"
        },
        {
            "barcode": "BBWS180205474",
            "dpc": "03031222301",
            "name": "សួ សុផារ៉ាប់"
        },
        {
            "barcode": "BBWS180205475",
            "dpc": "03031242501",
            "name": "ទេព សា"
        },
        {
            "barcode": "BBWS180205476",
            "dpc": "03031242401",
            "name": "ទេព ស៊ីម"
        },
        {
            "barcode": "BBWS180205477",
            "dpc": "03031242301",
            "name": "ស៊ូ ខឿត"
        },
        {
            "barcode": "BBWS180205478",
            "dpc": "03031242201",
            "name": "ឈីវ កិរិយា"
        },
        {
            "barcode": "BBWS180205479",
            "dpc": "03031242101",
            "name": "ឃុន សុភាព"
        },
        {
            "barcode": "BBWS180205480",
            "dpc": "03031242001",
            "name": "ហោ ជា"
        },
        {
            "barcode": "BBWS180205481",
            "dpc": "03031241901",
            "name": "អ្នក ម៉ាង"
        },
        {
            "barcode": "BBWS180205482",
            "dpc": "03031241801",
            "name": "លី ហ៊ាង (ឈិម សារុំ)"
        },
        {
            "barcode": "BBWS180205483",
            "dpc": "03031241701",
            "name": "ណង អឿន"
        },
        {
            "barcode": "BBWS180205484",
            "dpc": "03031241601",
            "name": "អ៊ឹវ សារិកាកែវ"
        },
        {
            "barcode": "BBWS180205485",
            "dpc": "03031241501",
            "name": "សុខ ហេង"
        },
        {
            "barcode": "BBWS180205486",
            "dpc": "03031241401",
            "name": "ឌុច រី"
        },
        {
            "barcode": "BBWS180205487",
            "dpc": "03031241301",
            "name": "ណាត គង់"
        },
        {
            "barcode": "BBWS180205488",
            "dpc": "03031241101",
            "name": "សុខ នី"
        },
        {
            "barcode": "BBWS180205489",
            "dpc": "03031241001",
            "name": "សុខ ធី"
        },
        {
            "barcode": "BBWS180205490",
            "dpc": "03031240901",
            "name": "ប៉ិន សុខុន"
        },
        {
            "barcode": "BBWS180205491",
            "dpc": "03031240801",
            "name": "សុខ ស៊ីវន"
        },
        {
            "barcode": "BBWS180205492",
            "dpc": "03031240701",
            "name": "មិន ញឹម"
        },
        {
            "barcode": "BBWS180205493",
            "dpc": "03031240601",
            "name": "ផៃ គង់"
        },
        {
            "barcode": "BBWS180205494",
            "dpc": "03031240501",
            "name": "ឈុយ ឡឹម"
        },
        {
            "barcode": "BBWS180205495",
            "dpc": "03031240401",
            "name": "អឿន ប្រុស"
        },
        {
            "barcode": "BBWS180205496",
            "dpc": "03031240301",
            "name": "នុត ធូក"
        },
        {
            "barcode": "BBWS180205497",
            "dpc": "03031240201",
            "name": "អៀង វិន"
        },
        {
            "barcode": "BBWS180205498",
            "dpc": "03031240101",
            "name": "វង្ស ឈុតនី"
        },
        {
            "barcode": "BBWS180205499",
            "dpc": "03031240001",
            "name": "សេង ទូច"
        },
        {
            "barcode": "BBWS180205500",
            "dpc": "03031239901",
            "name": "ជា ថា"
        },
        {
            "barcode": "BBWS180205501",
            "dpc": "03031239801",
            "name": "ឈួន ង៉ូវ"
        },
        {
            "barcode": "BBWS180205502",
            "dpc": "03031239701",
            "name": "ថាច់  ចិន្តា"
        },
        {
            "barcode": "BBWS180205503",
            "dpc": "03031239601",
            "name": "រី សុខា"
        },
        {
            "barcode": "BBWS180205504",
            "dpc": "03031247201",
            "name": "ជុន ផាត"
        },
        {
            "barcode": "BBWS180205505",
            "dpc": "03031247101",
            "name": "អុំ សុភី"
        },
        {
            "barcode": "BBWS180205506",
            "dpc": "03031247001",
            "name": "ស៊ី នួន"
        },
        {
            "barcode": "BBWS180205507",
            "dpc": "03031246901",
            "name": "ប៉ាវ មុនយីន"
        },
        {
            "barcode": "BBWS180205508",
            "dpc": "03031246801",
            "name": "លឹម គឹមស្រេង"
        },
        {
            "barcode": "BBWS180205509",
            "dpc": "03031246701",
            "name": "វ៉ាន់ ណារី"
        },
        {
            "barcode": "BBWS180205510",
            "dpc": "03031246601",
            "name": "គិវ ល័យ"
        },
        {
            "barcode": "BBWS180205511",
            "dpc": "03031246401",
            "name": "គិម សឿន"
        },
        {
            "barcode": "BBWS180205512",
            "dpc": "03031246301",
            "name": "ពិន ខាន"
        },
        {
            "barcode": "BBWS180205513",
            "dpc": "03031246201",
            "name": "គឹម ហួយ"
        },
        {
            "barcode": "BBWS180205514",
            "dpc": "03031246101",
            "name": "ពិន ម៉ុក"
        },
        {
            "barcode": "BBWS180205515",
            "dpc": "03031245901",
            "name": "សាយ សូ"
        },
        {
            "barcode": "BBWS180205516",
            "dpc": "03031239501",
            "name": "លឹម ឆាយ"
        },
        {
            "barcode": "BBWS180205517",
            "dpc": "03031239401",
            "name": "ថៃ គង់"
        },
        {
            "barcode": "BBWS180205518",
            "dpc": "03031239301",
            "name": "លឹម   ឈន"
        },
        {
            "barcode": "BBWS180205519",
            "dpc": "03031239201",
            "name": "ឡោ ខៃ"
        },
        {
            "barcode": "BBWS180205520",
            "dpc": "03031239101",
            "name": "លន់ ត្រៃ"
        },
        {
            "barcode": "BBWS180205521",
            "dpc": "03031239001",
            "name": "ប៊ិន អូន"
        },
        {
            "barcode": "BBWS180205522",
            "dpc": "03031238701",
            "name": "ប៊ុន ចាន់មុនី"
        },
        {
            "barcode": "BBWS180205523",
            "dpc": "03031238501",
            "name": "ហោ អៀង"
        },
        {
            "barcode": "BBWS180205524",
            "dpc": "03031238401",
            "name": "ប៊ី ណាលីន"
        },
        {
            "barcode": "BBWS180205525",
            "dpc": "03031238301",
            "name": "ប៊ិន អឿន"
        },
        {
            "barcode": "BBWS180205526",
            "dpc": "03031238201",
            "name": "ចាន់ ស៊ន"
        },
        {
            "barcode": "BBWS180205527",
            "dpc": "03031238101",
            "name": "ហៃ តុង"
        },
        {
            "barcode": "BBWS180205528",
            "dpc": "03031238001",
            "name": "ស៊ិន សំរេច"
        },
        {
            "barcode": "BBWS180205529",
            "dpc": "03031237901",
            "name": "ចាន់ សំអោ"
        },
        {
            "barcode": "BBWS180205530",
            "dpc": "03031237801",
            "name": "ផាវ ប៊ុនតឹក"
        },
        {
            "barcode": "BBWS180205531",
            "dpc": "03031237701",
            "name": "កែវ អន"
        },
        {
            "barcode": "BBWS180205532",
            "dpc": "03031237601",
            "name": "រី សុខា"
        },
        {
            "barcode": "BBWS180205533",
            "dpc": "03031237501",
            "name": "គាវ ណយ"
        },
        {
            "barcode": "BBWS180205534",
            "dpc": "03031237401",
            "name": "អ៊ឹ ហ៊ុយ"
        },
        {
            "barcode": "BBWS180205535",
            "dpc": "03031237301",
            "name": "សៅ សឿន"
        },
        {
            "barcode": "BBWS180205536",
            "dpc": "03031237201",
            "name": "ថេន សារឿន"
        },
        {
            "barcode": "BBWS180205537",
            "dpc": "03031237101",
            "name": "មួយ ឡេង"
        },
        {
            "barcode": "BBWS180205538",
            "dpc": "03031237001",
            "name": "ស៊ិ ស៊ីវ"
        },
        {
            "barcode": "BBWS180205539",
            "dpc": "03031236901",
            "name": "គឹម រដ្ឋា"
        },
        {
            "barcode": "BBWS180205540",
            "dpc": "03031211801",
            "name": "នី សារ៉ា"
        },
        {
            "barcode": "BBWS180205541",
            "dpc": "03031236801",
            "name": "ម៉ឹក សូនី"
        },
        {
            "barcode": "BBWS180205542",
            "dpc": "03031236701",
            "name": "ឈុំ ផល្លី"
        },
        {
            "barcode": "BBWS180205543",
            "dpc": "03031236601",
            "name": "គួច ហាវ"
        },
        {
            "barcode": "BBWS180205544",
            "dpc": "03031236501",
            "name": "ប៊ុន គង់"
        },
        {
            "barcode": "BBWS180205545",
            "dpc": "03031236401",
            "name": "លន់ ស៊ីម"
        },
        {
            "barcode": "BBWS180205546",
            "dpc": "03031236301",
            "name": "កែវ ភូមិន្ទ"
        },
        {
            "barcode": "BBWS180205547",
            "dpc": "03031236201",
            "name": "ចឹក គា"
        },
        {
            "barcode": "BBWS180205548",
            "dpc": "03031236101",
            "name": "ទាវ យ៉ាន់"
        },
        {
            "barcode": "BBWS180205549",
            "dpc": "03031236001",
            "name": "លី ឡេង"
        },
        {
            "barcode": "BBWS180205550",
            "dpc": "03031235901",
            "name": "ចាន់ ថុល"
        },
        {
            "barcode": "BBWS180205551",
            "dpc": "03031235801",
            "name": "សឿម កែវ"
        },
        {
            "barcode": "BBWS180205552",
            "dpc": "03031235701",
            "name": "វ៉ាន់  បូយ៉ា"
        },
        {
            "barcode": "BBWS180205553",
            "dpc": "03031226501",
            "name": "ខេង  ស្រីទូច"
        },
        {
            "barcode": "BBWS180205554",
            "dpc": "03031225901",
            "name": "ស៊ឹម  សុផល"
        },
        {
            "barcode": "BBWS180205555",
            "dpc": "03031225701",
            "name": "ស៊ីវ  ជុយ"
        },
        {
            "barcode": "BBWS180205556",
            "dpc": "03031225601",
            "name": "សេង  គឹមឈុន"
        },
        {
            "barcode": "BBWS180205557",
            "dpc": "03031225501",
            "name": "មៀច  សុមន៍"
        },
        {
            "barcode": "BBWS180205558",
            "dpc": "03031225401",
            "name": "ស៊ូ  អៀ"
        },
        {
            "barcode": "BBWS180205559",
            "dpc": "03031225301",
            "name": "គី  គង់"
        },
        {
            "barcode": "BBWS180205560",
            "dpc": "03031225201",
            "name": "ម៉ុន  មីកា"
        },
        {
            "barcode": "BBWS180205561",
            "dpc": "03031225101",
            "name": "ចេស  សាវុធ"
        },
        {
            "barcode": "BBWS180205562",
            "dpc": "03031225001",
            "name": "យ៉ាន  ហួត ២"
        },
        {
            "barcode": "BBWS180205563",
            "dpc": "03031224901",
            "name": "យ៉ាន  ហួត ១"
        },
        {
            "barcode": "BBWS180205564",
            "dpc": "03031224801",
            "name": "គុយ  សុខ"
        },
        {
            "barcode": "BBWS180205565",
            "dpc": "03031224701",
            "name": "តាំង  សាន់"
        },
        {
            "barcode": "BBWS180205566",
            "dpc": "03031224601",
            "name": "លឹម  សារ៉ម"
        },
        {
            "barcode": "BBWS180205567",
            "dpc": "03031224501",
            "name": "សេង  យ៉ុន"
        },
        {
            "barcode": "BBWS180205568",
            "dpc": "03031224401",
            "name": "ជូ  ម៉ាត់លី"
        },
        {
            "barcode": "BBWS180205569",
            "dpc": "03031224301",
            "name": "គង់  ឈុន"
        },
        {
            "barcode": "BBWS180205570",
            "dpc": "03031224201",
            "name": "ស្មាន់  ប៉ិច"
        },
        {
            "barcode": "BBWS180205571",
            "dpc": "03031224101",
            "name": "ចាន់  គឹមហ៊ាង"
        },
        {
            "barcode": "BBWS180205572",
            "dpc": "03031224001",
            "name": "ងិន  យឹម"
        },
        {
            "barcode": "BBWS180205573",
            "dpc": "03031223901",
            "name": "ហែម  សាវ៉ាត"
        },
        {
            "barcode": "BBWS180205574",
            "dpc": "03031223801",
            "name": "លីវ  សុខា"
        },
        {
            "barcode": "BBWS180205575",
            "dpc": "03031223701",
            "name": "គង់  ផៃ"
        },
        {
            "barcode": "BBWS180205576",
            "dpc": "03031223501",
            "name": "សណ្នាគារខេមរា ២"
        },
        {
            "barcode": "BBWS180205577",
            "dpc": "03031223401",
            "name": "សណ្នាគារខេមរា ១"
        },
        {
            "barcode": "BBWS180205578",
            "dpc": "03031223301",
            "name": "សៀង  ស៊ុតថង"
        },
        {
            "barcode": "BBWS180205579",
            "dpc": "03031223201",
            "name": "ឃុន  ហេង"
        },
        {
            "barcode": "BBWS180205580",
            "dpc": "03031223101",
            "name": "ថាច់  ជួន"
        },
        {
            "barcode": "BBWS180205581",
            "dpc": "03031223001",
            "name": "ម៉ៅ  សុផល"
        },
        {
            "barcode": "BBWS180205582",
            "dpc": "03031222901",
            "name": "ធុយ  ជួប"
        },
        {
            "barcode": "BBWS180205583",
            "dpc": "03031222801",
            "name": "ឯក  ជិវ័ន ២"
        },
        {
            "barcode": "BBWS180205584",
            "dpc": "03031222501",
            "name": "សុស  ឈូក"
        },
        {
            "barcode": "BBWS180205585",
            "dpc": "03031222401",
            "name": "ស  បេងទូ"
        },
        {
            "barcode": "BBWS180205586",
            "dpc": "03031222201",
            "name": "ណៃ  គឹមស៊ុន"
        },
        {
            "barcode": "BBWS180205587",
            "dpc": "03031222101",
            "name": "ហុក  ឃន"
        },
        {
            "barcode": "BBWS180205588",
            "dpc": "03031222001",
            "name": "ចៅ  សូវង្ស"
        },
        {
            "barcode": "BBWS180205589",
            "dpc": "03031221201",
            "name": "ង៉ោ  សុធី"
        },
        {
            "barcode": "BBWS180205590",
            "dpc": "03031221101",
            "name": "ឌុច   សៀង"
        },
        {
            "barcode": "BBWS180205591",
            "dpc": "03031221001",
            "name": "ហាក់  ស្រី"
        },
        {
            "barcode": "BBWS180205592",
            "dpc": "03031220801",
            "name": "អេង  សាវឿន ២"
        },
        {
            "barcode": "BBWS180205593",
            "dpc": "03031220701",
            "name": "អេង  សាវឿន"
        },
        {
            "barcode": "BBWS180205594",
            "dpc": "03031220601",
            "name": "ឈិន  យាន"
        },
        {
            "barcode": "BBWS180205595",
            "dpc": "03031220501",
            "name": "ឃុន  ស៊ាង"
        },
        {
            "barcode": "BBWS180205596",
            "dpc": "03031223601",
            "name": "វង្ស  ផាន់"
        },
        {
            "barcode": "BBWS180205597",
            "dpc": "03031200201",
            "name": "ឌុច ចំរ៉ាត់"
        },
        {
            "barcode": "BBWS180205598",
            "dpc": "03031200301",
            "name": "ឡេង លីម"
        },
        {
            "barcode": "BBWS180205599",
            "dpc": "03031200401",
            "name": "ឯម ស៊ីថុល"
        },
        {
            "barcode": "BBWS180205600",
            "dpc": "03031200501",
            "name": "មាស ស៊ីណាត"
        },
        {
            "barcode": "BBWS180205601",
            "dpc": "03031200601",
            "name": "សុខ មឿន"
        },
        {
            "barcode": "BBWS180205602",
            "dpc": "03031200701",
            "name": "ភូ សុផល"
        },
        {
            "barcode": "BBWS180205603",
            "dpc": "03031200801",
            "name": "សួន ជន"
        },
        {
            "barcode": "BBWS180205604",
            "dpc": "03031200901",
            "name": "នូ ម៉េង"
        },
        {
            "barcode": "BBWS180205605",
            "dpc": "03031201001",
            "name": "តែ ពៅចិន្តា"
        },
        {
            "barcode": "BBWS180205606",
            "dpc": "03031201101",
            "name": "តុក សួរ"
        },
        {
            "barcode": "BBWS180205607",
            "dpc": "03031201201",
            "name": "សោម សាឃឿង"
        },
        {
            "barcode": "BBWS180205608",
            "dpc": "03031201301",
            "name": "ខួច សុផល"
        },
        {
            "barcode": "BBWS180205609",
            "dpc": "03031201401",
            "name": "លឹម ហួត"
        },
        {
            "barcode": "BBWS180205610",
            "dpc": "03031201501",
            "name": "ទឹម វណ្ណា"
        },
        {
            "barcode": "BBWS180205611",
            "dpc": "03031201601",
            "name": "អែម  ហ៊ន"
        },
        {
            "barcode": "BBWS180205612",
            "dpc": "03031201701",
            "name": "ជូ ធានហួត"
        },
        {
            "barcode": "BBWS180205613",
            "dpc": "03031201801",
            "name": "ខៀវ សារ៉ូ"
        },
        {
            "barcode": "BBWS180205614",
            "dpc": "03031201901",
            "name": "ហ៊ុយ គឹមសេម"
        },
        {
            "barcode": "BBWS180205615",
            "dpc": "03031202001",
            "name": "ទារ៍ សារ៉ាត់"
        },
        {
            "barcode": "BBWS180205616",
            "dpc": "03031202101",
            "name": "វែង ឃុន"
        },
        {
            "barcode": "BBWS180205617",
            "dpc": "03031202201",
            "name": "ទឹម ជូនេត្រ្ត"
        },
        {
            "barcode": "BBWS180205618",
            "dpc": "03031202301",
            "name": "សុខ ហេង"
        },
        {
            "barcode": "BBWS180205619",
            "dpc": "03031202401",
            "name": "ឆេង ហួត"
        },
        {
            "barcode": "BBWS180205620",
            "dpc": "03031202501",
            "name": "នូ ស៊ីធឿន"
        },
        {
            "barcode": "BBWS180205621",
            "dpc": "03031202601",
            "name": "ជា គឹមហង់"
        },
        {
            "barcode": "BBWS180205622",
            "dpc": "03031202701",
            "name": "យិន សុខេន"
        },
        {
            "barcode": "BBWS180205623",
            "dpc": "03031202801",
            "name": "សេង ហួរ"
        },
        {
            "barcode": "BBWS180205624",
            "dpc": "03031202901",
            "name": "ចៅ ឈឹមភីរម្យ"
        },
        {
            "barcode": "BBWS180205625",
            "dpc": "03031203001",
            "name": "ព្រំ ដាយ"
        },
        {
            "barcode": "BBWS180205626",
            "dpc": "03031203101",
            "name": "ម៉ឹន សារី"
        },
        {
            "barcode": "BBWS180205627",
            "dpc": "03031203201",
            "name": "ប៉ាន់ ផង់"
        },
        {
            "barcode": "BBWS180205628",
            "dpc": "03031203301",
            "name": "ជា គីញឈួង"
        },
        {
            "barcode": "BBWS180205629",
            "dpc": "03031203401",
            "name": "ជា វ៉ៃ"
        },
        {
            "barcode": "BBWS180205630",
            "dpc": "03031203501",
            "name": "ឡាំ  ឆវី"
        },
        {
            "barcode": "BBWS180205631",
            "dpc": "03031203601",
            "name": "ប៉ែន  នាង"
        },
        {
            "barcode": "BBWS180205632",
            "dpc": "03031203701",
            "name": "ឆាន   សូ"
        },
        {
            "barcode": "BBWS180205633",
            "dpc": "03031203801",
            "name": "ឈិន   ង៉ាម"
        },
        {
            "barcode": "BBWS180205634",
            "dpc": "03031203901",
            "name": "ចាន់  ប្រម"
        },
        {
            "barcode": "BBWS180205635",
            "dpc": "03031204001",
            "name": "គឹម  សាយ"
        },
        {
            "barcode": "BBWS180205636",
            "dpc": "03031204101",
            "name": "គុណ  ភាព"
        },
        {
            "barcode": "BBWS180205637",
            "dpc": "03031204201",
            "name": "ឡេង  រ័ត្ន"
        },
        {
            "barcode": "BBWS180205638",
            "dpc": "03031204301",
            "name": "មៀន  សុផល"
        },
        {
            "barcode": "BBWS180205639",
            "dpc": "03031204401",
            "name": "មាស   ធន"
        },
        {
            "barcode": "BBWS180205640",
            "dpc": "03031204501",
            "name": "ឱក  ឈៀក"
        },
        {
            "barcode": "BBWS180205641",
            "dpc": "03031204601",
            "name": "គួយ  គឹមស៊ន"
        },
        {
            "barcode": "BBWS180205642",
            "dpc": "03031204701",
            "name": "ជុំ  សំណាង"
        },
        {
            "barcode": "BBWS180205643",
            "dpc": "03031205101",
            "name": "សុខ  ឡាវ"
        },
        {
            "barcode": "BBWS180205644",
            "dpc": "03031205201",
            "name": "អ៊ុក   ហេង"
        },
        {
            "barcode": "BBWS180205645",
            "dpc": "03031205301",
            "name": "សយ  សារិក"
        },
        {
            "barcode": "BBWS180205646",
            "dpc": "03031205401",
            "name": "ទុចូ  ម៉ៅ"
        },
        {
            "barcode": "BBWS180205647",
            "dpc": "03031205601",
            "name": "ប៊ីន  សារ៉ន"
        },
        {
            "barcode": "BBWS180205648",
            "dpc": "03031205501",
            "name": "ប៉េង  តាំងហៃ"
        },
        {
            "barcode": "BBWS180205649",
            "dpc": "03031205701",
            "name": "ម៉ី  សុវណ្ណ"
        },
        {
            "barcode": "BBWS180205650",
            "dpc": "03031205801",
            "name": "ប៉ាន់  វណ្ណះ"
        },
        {
            "barcode": "BBWS180205651",
            "dpc": "03031205901",
            "name": "ប៉ិញ ច័ន្ទឧត្តម"
        },
        {
            "barcode": "BBWS180205652",
            "dpc": "03031206001",
            "name": "ឆន  ហួត"
        },
        {
            "barcode": "BBWS180205653",
            "dpc": "03031206101",
            "name": "យឹម  មាន"
        },
        {
            "barcode": "BBWS180205654",
            "dpc": "03031206201",
            "name": "ជូ  ម៉ាឡែន"
        },
        {
            "barcode": "BBWS180205655",
            "dpc": "03031206301",
            "name": "ណៃ  គឹមវ៉ិត"
        },
        {
            "barcode": "BBWS180205656",
            "dpc": "03031206401",
            "name": "សុខ  ឡាវ"
        },
        {
            "barcode": "BBWS180205657",
            "dpc": "03031206501",
            "name": "សេង  សុភាព"
        },
        {
            "barcode": "BBWS180205658",
            "dpc": "03031206601",
            "name": "សាន  គឹម  ស៊ត"
        },
        {
            "barcode": "BBWS180205659",
            "dpc": "03031206801",
            "name": "គង់  ឈឿន"
        },
        {
            "barcode": "BBWS180205660",
            "dpc": "03031206901",
            "name": "អង្កការ ស៊ី.អ.អែស"
        },
        {
            "barcode": "BBWS180205661",
            "dpc": "03031207001",
            "name": "ភោគ  សារ័ត្ន"
        },
        {
            "barcode": "BBWS180205662",
            "dpc": "03031207101",
            "name": "គុយ  វិចិត្រ"
        },
        {
            "barcode": "BBWS180205663",
            "dpc": "03031207201",
            "name": "គុយ  ម៉េង"
        },
        {
            "barcode": "BBWS180205664",
            "dpc": "03031207701",
            "name": "គី  សេរី"
        },
        {
            "barcode": "BBWS180205665",
            "dpc": "03031207801",
            "name": "ទិត  សុខ"
        },
        {
            "barcode": "BBWS180205666",
            "dpc": "03031207901",
            "name": "លី  ហួរ"
        },
        {
            "barcode": "BBWS180205667",
            "dpc": "03031208001",
            "name": "ហេង  ភួន"
        },
        {
            "barcode": "BBWS180205668",
            "dpc": "03031208101",
            "name": "វ៉ាន់  ញ៉ាញ់"
        },
        {
            "barcode": "BBWS180205669",
            "dpc": "03031208201",
            "name": "តែ   សុផាន់ណា"
        },
        {
            "barcode": "BBWS180205670",
            "dpc": "03031208301",
            "name": "ឈុន ចិន្តា"
        },
        {
            "barcode": "BBWS180205671",
            "dpc": "03031208401",
            "name": "អ៊ឹង  សេង"
        },
        {
            "barcode": "BBWS180205672",
            "dpc": "03031208501",
            "name": "ស៊ុយ  លីម"
        },
        {
            "barcode": "BBWS180205673",
            "dpc": "03031208601",
            "name": "ស្រី  សឹង"
        },
        {
            "barcode": "BBWS180205674",
            "dpc": "03031208701",
            "name": "ឌី  យ៉ុន"
        },
        {
            "barcode": "BBWS180205675",
            "dpc": "03031208801",
            "name": "លឹម  សុខគី"
        },
        {
            "barcode": "BBWS180205676",
            "dpc": "03031208901",
            "name": "ទេព  សាកន"
        },
        {
            "barcode": "BBWS180205677",
            "dpc": "03031209101",
            "name": "លី  ណាំ"
        },
        {
            "barcode": "BBWS180205678",
            "dpc": "03031209201",
            "name": "រស់  សុខុម"
        },
        {
            "barcode": "BBWS180205679",
            "dpc": "03031209301",
            "name": "ឆាង  ហេង"
        },
        {
            "barcode": "BBWS180205680",
            "dpc": "03031209401",
            "name": "រស់ សុផុន"
        },
        {
            "barcode": "BBWS180205681",
            "dpc": "03031209501",
            "name": "អាំឡង់  ឌី"
        },
        {
            "barcode": "BBWS180205682",
            "dpc": "03031209601",
            "name": "ខ្លូត  រិទ្ធ"
        },
        {
            "barcode": "BBWS180205683",
            "dpc": "03031209701",
            "name": "ញឹម ហុង"
        },
        {
            "barcode": "BBWS180205684",
            "dpc": "03031209901",
            "name": "ម៉ូវ  សម្បត្តិ"
        },
        {
            "barcode": "BBWS180205685",
            "dpc": "03031210001",
            "name": "តូម  អូន"
        },
        {
            "barcode": "BBWS180205686",
            "dpc": "03031210101",
            "name": "សា  កញ្ញា"
        },
        {
            "barcode": "BBWS180205687",
            "dpc": "03031210201",
            "name": "ខេង  សុខឡាយ"
        },
        {
            "barcode": "BBWS180205688",
            "dpc": "03031210301",
            "name": "ប្រាក់  ថុង"
        },
        {
            "barcode": "BBWS180205689",
            "dpc": "03031210401",
            "name": "គ្រុយ  មុយហ្គិច"
        },
        {
            "barcode": "BBWS180205690",
            "dpc": "03031210501",
            "name": "ច្រាយ  ប៊ុន"
        },
        {
            "barcode": "BBWS180205691",
            "dpc": "03031210601",
            "name": "ង៉ែត  តុន"
        },
        {
            "barcode": "BBWS180205692",
            "dpc": "03031210701",
            "name": "សំ  លីង"
        },
        {
            "barcode": "BBWS180205693",
            "dpc": "03031210801",
            "name": "សាន  គឹមស៊ត"
        },
        {
            "barcode": "BBWS180205694",
            "dpc": "03031210901",
            "name": "តុក គឹមស៊្រុន"
        },
        {
            "barcode": "BBWS180205695",
            "dpc": "03031211001",
            "name": "លន់   សំប៊ី"
        },
        {
            "barcode": "BBWS180205696",
            "dpc": "03031211101",
            "name": "ស៊ឹម  សល្យ"
        },
        {
            "barcode": "BBWS180205697",
            "dpc": "03031211201",
            "name": "ជា  សាបឿន"
        },
        {
            "barcode": "BBWS180205698",
            "dpc": "03031211301",
            "name": "យូរ  ចន្ថា"
        },
        {
            "barcode": "BBWS180205699",
            "dpc": "03031211401",
            "name": "ស្មី  រដ្ឋា"
        },
        {
            "barcode": "BBWS180205700",
            "dpc": "03031211501",
            "name": "អ៊ុក  វណ្ណា"
        },
        {
            "barcode": "BBWS180205701",
            "dpc": "03031211601",
            "name": "ពិន  ណារ៉េត"
        },
        {
            "barcode": "BBWS180205702",
            "dpc": "03031211701",
            "name": "សៅ  តាប់"
        },
        {
            "barcode": "BBWS180205703",
            "dpc": "03031214101",
            "name": "ជា សារិន"
        },
        {
            "barcode": "BBWS180205704",
            "dpc": "03031214201",
            "name": "កែវ សេងលន់"
        },
        {
            "barcode": "BBWS180205705",
            "dpc": "03031214301",
            "name": "អន ថាវរិទ្ធ"
        },
        {
            "barcode": "BBWS180205706",
            "dpc": "03031214501",
            "name": "វង្ស ឃុតឈឿង"
        },
        {
            "barcode": "BBWS180205707",
            "dpc": "03031214601",
            "name": "សេង ហ៊ាង"
        },
        {
            "barcode": "BBWS180205708",
            "dpc": "03031214701",
            "name": "សេង សៀហៃ ១"
        },
        {
            "barcode": "BBWS180205709",
            "dpc": "03031214801",
            "name": "សេង សៀហៃ ២"
        },
        {
            "barcode": "BBWS180205710",
            "dpc": "03031214901",
            "name": "មាស សាម៉ុន"
        },
        {
            "barcode": "BBWS180205711",
            "dpc": "03031215001",
            "name": "ខៀវ សេងលី"
        },
        {
            "barcode": "BBWS180205712",
            "dpc": "03031215401",
            "name": "ថាច់ សែ"
        },
        {
            "barcode": "BBWS180205713",
            "dpc": "03031215501",
            "name": "ឌឹម វីរោចន៍"
        },
        {
            "barcode": "BBWS180205714",
            "dpc": "03031215601",
            "name": "ពុំ សារិក"
        },
        {
            "barcode": "BBWS180205715",
            "dpc": "03031215701",
            "name": "ឈឹម គ្រីហ្វុង"
        },
        {
            "barcode": "BBWS180205716",
            "dpc": "03031215801",
            "name": "តេង ហេង"
        },
        {
            "barcode": "BBWS180205717",
            "dpc": "03031215901",
            "name": "អ៊ុក គឹមទី"
        },
        {
            "barcode": "BBWS180205718",
            "dpc": "03031216001",
            "name": "កណ្តៀង ជឿន"
        },
        {
            "barcode": "BBWS180205719",
            "dpc": "03031216101",
            "name": "ព្រំ ធៀន"
        },
        {
            "barcode": "BBWS180205720",
            "dpc": "03031216201",
            "name": "លឹម ហ៊ុន"
        },
        {
            "barcode": "BBWS180205721",
            "dpc": "03031216301",
            "name": "អ៊ឹម លាភ"
        },
        {
            "barcode": "BBWS180205722",
            "dpc": "03031216401",
            "name": "វង្ស គឹមហ៊ាង"
        },
        {
            "barcode": "BBWS180205723",
            "dpc": "03031216501",
            "name": "អ៊ិន ញឹម"
        },
        {
            "barcode": "BBWS180205724",
            "dpc": "03031216701",
            "name": "សួន  សារុន"
        },
        {
            "barcode": "BBWS180205725",
            "dpc": "03031216801",
            "name": "សៀង  ហ៊ាង"
        },
        {
            "barcode": "BBWS180205726",
            "dpc": "03031216901",
            "name": "ឯល  វ៉ាន់"
        },
        {
            "barcode": "BBWS180205727",
            "dpc": "03031217001",
            "name": "គី  ទិត"
        },
        {
            "barcode": "BBWS180205728",
            "dpc": "03031217101",
            "name": "អុំ  វណ្ណះ"
        },
        {
            "barcode": "BBWS180205729",
            "dpc": "03031217201",
            "name": "ឆេង  ទ្រី"
        },
        {
            "barcode": "BBWS180205730",
            "dpc": "03031217301",
            "name": "សុខ  ប៊ុនដារា"
        },
        {
            "barcode": "BBWS180205731",
            "dpc": "03031217401",
            "name": "ជូ អ៊ឹម"
        },
        {
            "barcode": "BBWS180205732",
            "dpc": "03031217501",
            "name": "ថូយ ទ្រី"
        },
        {
            "barcode": "BBWS180205733",
            "dpc": "03031217601",
            "name": "ខៀវ ភីរុណ"
        },
        {
            "barcode": "BBWS180205734",
            "dpc": "03031217701",
            "name": "តន់ សាវ៉េត"
        },
        {
            "barcode": "BBWS180205735",
            "dpc": "03031217901",
            "name": "ឃៀន ខឿម"
        },
        {
            "barcode": "BBWS180205736",
            "dpc": "03031218001",
            "name": "ម៉ែន ទីន"
        },
        {
            "barcode": "BBWS180205737",
            "dpc": "03031218101",
            "name": "គឹម ទុយ"
        },
        {
            "barcode": "BBWS180205738",
            "dpc": "03031218201",
            "name": "ម៉ៅ សាម៉េត"
        },
        {
            "barcode": "BBWS180205739",
            "dpc": "03031218301",
            "name": "ប៊ុន ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180205740",
            "dpc": "03031218401",
            "name": "រៀន វីវៈ"
        },
        {
            "barcode": "BBWS180205741",
            "dpc": "03031218501",
            "name": "ជំនឿ សិច្ចរ៉ា"
        },
        {
            "barcode": "BBWS180205742",
            "dpc": "03031218601",
            "name": "ឡា ឡាប"
        },
        {
            "barcode": "BBWS180205743",
            "dpc": "03031218801",
            "name": "អ៊ុំ ខេមរា"
        },
        {
            "barcode": "BBWS180205744",
            "dpc": "03031218901",
            "name": "សេង សុភរា"
        },
        {
            "barcode": "BBWS180205745",
            "dpc": "03031219001",
            "name": "លន់ ម៉ាណែត"
        },
        {
            "barcode": "BBWS180205746",
            "dpc": "03031219101",
            "name": "ទិត្យ ឈៀង"
        },
        {
            "barcode": "BBWS180205747",
            "dpc": "03031219201",
            "name": "ជឹម សុខឡាយ"
        },
        {
            "barcode": "BBWS180205748",
            "dpc": "03031219301",
            "name": "គង់ ស្រីនាង"
        },
        {
            "barcode": "BBWS180205749",
            "dpc": "03031216601",
            "name": "ជូន រិទ្ធី"
        },
        {
            "barcode": "BBWS180205750",
            "dpc": "03031219401",
            "name": "មាស ឡូញ ២"
        },
        {
            "barcode": "BBWS180205751",
            "dpc": "03031219501",
            "name": "សួស សុខ"
        },
        {
            "barcode": "BBWS180205752",
            "dpc": "03031219601",
            "name": "សាក់ ចំរើន"
        },
        {
            "barcode": "BBWS180205753",
            "dpc": "03031219701",
            "name": "មាស ឡូញ ១"
        },
        {
            "barcode": "BBWS180205754",
            "dpc": "03031219801",
            "name": "ហ៊ិន ពេញ"
        },
        {
            "barcode": "BBWS180205755",
            "dpc": "03031219901",
            "name": "ឃឿម គឹមហោ"
        },
        {
            "barcode": "BBWS180205756",
            "dpc": "03031231701",
            "name": "ប៉ែន ពិរោះ"
        },
        {
            "barcode": "BBWS180205757",
            "dpc": "03031204901",
            "name": "កេតុ សឿ"
        },
        {
            "barcode": "BBWS180205758",
            "dpc": "03031247901",
            "name": "សៅ សោភ័ណ្ឌ"
        },
        {
            "barcode": "BBWS180205759",
            "dpc": "03031247801",
            "name": "គឹម បឹង"
        },
        {
            "barcode": "BBWS180205760",
            "dpc": "03031247601",
            "name": "សួន សុខេង"
        },
        {
            "barcode": "BBWS180205761",
            "dpc": "03031247501",
            "name": "អ៊ុក ចិប"
        },
        {
            "barcode": "BBWS180205762",
            "dpc": "03031247401",
            "name": "ង៉ែត បុប្ផាចាន់"
        },
        {
            "barcode": "BBWS180205763",
            "dpc": "03031247301",
            "name": "អ៊ុក បូរ៉ា"
        },
        {
            "barcode": "BBWS180205764",
            "dpc": "03031226601",
            "name": "ផល ម៉ុន"
        },
        {
            "barcode": "BBWS180205765",
            "dpc": "03031226701",
            "name": "មួង ស៊ុនហេង ១"
        },
        {
            "barcode": "BBWS180205766",
            "dpc": "03031226801",
            "name": "រឿន សោភ័ណ្ឌ"
        },
        {
            "barcode": "BBWS180205767",
            "dpc": "03031226901",
            "name": "គុយ សុខ"
        },
        {
            "barcode": "BBWS180205768",
            "dpc": "03031227001",
            "name": "ដួង សុខសារិន"
        },
        {
            "barcode": "BBWS180205769",
            "dpc": "03031227101",
            "name": "ម៉ា រ៉ុន"
        },
        {
            "barcode": "BBWS180205770",
            "dpc": "03031227201",
            "name": "សុខ ឈឿន"
        },
        {
            "barcode": "BBWS180205771",
            "dpc": "03031227301",
            "name": "អាត់ ខែម"
        },
        {
            "barcode": "BBWS180205772",
            "dpc": "03031227401",
            "name": "លឹម សុខវ៉ាន់"
        },
        {
            "barcode": "BBWS180205773",
            "dpc": "03031227501",
            "name": "យ៉ាត គឹមលិន"
        },
        {
            "barcode": "BBWS180205774",
            "dpc": "03031227601",
            "name": "ញ៉ុញ សាណុំ"
        },
        {
            "barcode": "BBWS180205775",
            "dpc": "03031227701",
            "name": "ស៊ីន គុណ"
        },
        {
            "barcode": "BBWS180205776",
            "dpc": "03031227801",
            "name": "មឿន ឆ័យ"
        },
        {
            "barcode": "BBWS180205777",
            "dpc": "03031245201",
            "name": "គង់ សាន"
        },
        {
            "barcode": "BBWS180205778",
            "dpc": "03031227901",
            "name": "ភុំ វ៉ារ៉ែន"
        },
        {
            "barcode": "BBWS180205779",
            "dpc": "03031228001",
            "name": "ជួង ខ្វា"
        },
        {
            "barcode": "BBWS180205780",
            "dpc": "03031228101",
            "name": "គឹម លាង"
        },
        {
            "barcode": "BBWS180205781",
            "dpc": "03031228201",
            "name": "ពិន ជុំ"
        },
        {
            "barcode": "BBWS180205782",
            "dpc": "03031228301",
            "name": "យ៉ត ឆាត់"
        },
        {
            "barcode": "BBWS180205783",
            "dpc": "03031228501",
            "name": "វ៉ន ឈុនលី"
        },
        {
            "barcode": "BBWS180205784",
            "dpc": "03031228601",
            "name": "ហ៊ី ឈុន"
        },
        {
            "barcode": "BBWS180205785",
            "dpc": "03031228701",
            "name": "ហេង ពៅ"
        },
        {
            "barcode": "BBWS180205786",
            "dpc": "03031228801",
            "name": "ឡោ យក់ លន់"
        },
        {
            "barcode": "BBWS180205787",
            "dpc": "03031228901",
            "name": "តេង លឹម"
        },
        {
            "barcode": "BBWS180205788",
            "dpc": "03031229001",
            "name": "មួង ស៊ុនហេង ២"
        },
        {
            "barcode": "BBWS180205789",
            "dpc": "03031229101",
            "name": "ប៉ោ ស៊ីថា"
        },
        {
            "barcode": "BBWS180205790",
            "dpc": "03031230701",
            "name": "សុខ ឡាវ"
        },
        {
            "barcode": "BBWS180205791",
            "dpc": "03031230601",
            "name": "សេង កុសល់"
        },
        {
            "barcode": "BBWS180205792",
            "dpc": "03031230501",
            "name": "សោ គឹមសាន"
        },
        {
            "barcode": "BBWS180205793",
            "dpc": "03031230401",
            "name": "មឹក ហួយ"
        },
        {
            "barcode": "BBWS180205794",
            "dpc": "03031230301",
            "name": "រី ដេត"
        },
        {
            "barcode": "BBWS180205795",
            "dpc": "03031230201",
            "name": "អ៊ុក ចាប"
        },
        {
            "barcode": "BBWS180205796",
            "dpc": "03031230101",
            "name": "ម៉ោញ សារ៉ាត់"
        },
        {
            "barcode": "BBWS180205797",
            "dpc": "03031230001",
            "name": "វ៉ាន់ ម៉ានី"
        },
        {
            "barcode": "BBWS180205798",
            "dpc": "03031229801",
            "name": "ហួយ កុសល់"
        },
        {
            "barcode": "BBWS180205799",
            "dpc": "03031229701",
            "name": "ជៀវ វន"
        },
        {
            "barcode": "BBWS180205800",
            "dpc": "03031229601",
            "name": "ដាំ​ ស្វាង"
        },
        {
            "barcode": "BBWS180205801",
            "dpc": "03031229501",
            "name": "ឌី ញ៉ុន"
        },
        {
            "barcode": "BBWS180205802",
            "dpc": "03031229201",
            "name": "សយ សុផល"
        },
        {
            "barcode": "BBWS180205803",
            "dpc": "03031232601",
            "name": "តាំង ស៊ុនហួរ"
        },
        {
            "barcode": "BBWS180205804",
            "dpc": "03031232501",
            "name": "ខៀវ ស៊ន"
        },
        {
            "barcode": "BBWS180205805",
            "dpc": "03031232401",
            "name": "លី គឹមសាន"
        },
        {
            "barcode": "BBWS180205806",
            "dpc": "03031232301",
            "name": "ឃុត សាអុំ"
        },
        {
            "barcode": "BBWS180205807",
            "dpc": "03031232101",
            "name": "គឹម សារ៉ន"
        },
        {
            "barcode": "BBWS180205808",
            "dpc": "03031232001",
            "name": "ឈួន គឹមឈន"
        },
        {
            "barcode": "BBWS180205809",
            "dpc": "03031231901",
            "name": "យប់ វង់"
        },
        {
            "barcode": "BBWS180205810",
            "dpc": "03031231801",
            "name": "អាន ថាវី"
        },
        {
            "barcode": "BBWS180205811",
            "dpc": "03031231601",
            "name": "កង យេត"
        },
        {
            "barcode": "BBWS180205812",
            "dpc": "03031231501",
            "name": "ណៃ គឹមសុន"
        },
        {
            "barcode": "BBWS180205813",
            "dpc": "03031231401",
            "name": "រាជ ថេត"
        },
        {
            "barcode": "BBWS180205814",
            "dpc": "03031231301",
            "name": "ជូរ សុខហេង"
        },
        {
            "barcode": "BBWS180205815",
            "dpc": "03031231201",
            "name": "តាន់ សុខា"
        },
        {
            "barcode": "BBWS180205816",
            "dpc": "03031231101",
            "name": "ខ្លួត បឿន"
        },
        {
            "barcode": "BBWS180205817",
            "dpc": "03031231001",
            "name": "តោ ជុន"
        },
        {
            "barcode": "BBWS180205818",
            "dpc": "03031230901",
            "name": "ឌួង សំអុល"
        },
        {
            "barcode": "BBWS180205819",
            "dpc": "03031230801",
            "name": "ពុធ សំអាន"
        },
        {
            "barcode": "BBWS180205820",
            "dpc": "03031213801",
            "name": "សៀង សុវឌ្ឍនា ៣"
        },
        {
            "barcode": "BBWS180205821",
            "dpc": "03031213901",
            "name": "សៀ ស៊ិន"
        },
        {
            "barcode": "BBWS180205822",
            "dpc": "03031213701",
            "name": "សៀង សុវឌ្ឍនា ២"
        },
        {
            "barcode": "BBWS180205823",
            "dpc": "03031213501",
            "name": "ជូ ផល្លា"
        },
        {
            "barcode": "BBWS180205824",
            "dpc": "03031213401",
            "name": "យក់ ហ៊ុន"
        },
        {
            "barcode": "BBWS180205825",
            "dpc": "03031213301",
            "name": "យាំ យ៉េត ២"
        },
        {
            "barcode": "BBWS180205826",
            "dpc": "03031213201",
            "name": "យាំ យ៉េត ១"
        },
        {
            "barcode": "BBWS180205827",
            "dpc": "03031213101",
            "name": "អៀម ម៉េងគង់"
        },
        {
            "barcode": "BBWS180205828",
            "dpc": "03031213001",
            "name": "សយ ស្រ៊ុន"
        },
        {
            "barcode": "BBWS180205829",
            "dpc": "03031212901",
            "name": "សេង ហឹយ"
        },
        {
            "barcode": "BBWS180205830",
            "dpc": "03031212801",
            "name": "ហ៊ីន ភួងណារី"
        },
        {
            "barcode": "BBWS180205831",
            "dpc": "03031212701",
            "name": "ចាន់ ផារិន"
        },
        {
            "barcode": "BBWS180205832",
            "dpc": "03031212601",
            "name": "អ៊ុំ ចិត្រ"
        },
        {
            "barcode": "BBWS180205833",
            "dpc": "03031212501",
            "name": "ភោគ រស្មី"
        },
        {
            "barcode": "BBWS180205834",
            "dpc": "03031212401",
            "name": "ទេស កៅ"
        },
        {
            "barcode": "BBWS180205835",
            "dpc": "03031212301",
            "name": "ជុំ ស៊ីថា"
        },
        {
            "barcode": "BBWS180205836",
            "dpc": "03031212201",
            "name": "ឌឿ សង្វាវ៉ាន"
        },
        {
            "barcode": "BBWS180205837",
            "dpc": "03031212101",
            "name": "រួម រុន"
        },
        {
            "barcode": "BBWS180205838",
            "dpc": "03031235501",
            "name": "វិញ យ៉េន"
        },
        {
            "barcode": "BBWS180205839",
            "dpc": "03031235601",
            "name": "ហុង ងួន"
        },
        {
            "barcode": "BBWS180205840",
            "dpc": "03031235401",
            "name": "ឡុង វ៉ាន់នី"
        },
        {
            "barcode": "BBWS180205841",
            "dpc": "03031235301",
            "name": "សំ វីឡុង"
        },
        {
            "barcode": "BBWS180205842",
            "dpc": "03031234301",
            "name": "ទូច មុំ"
        },
        {
            "barcode": "BBWS180205843",
            "dpc": "03031234201",
            "name": "ភោគ ឡឹក"
        },
        {
            "barcode": "BBWS180205844",
            "dpc": "03031234101",
            "name": "សេង គុណ"
        },
        {
            "barcode": "BBWS180205845",
            "dpc": "03031234001",
            "name": "និល ប៊ុនណ្ណា"
        },
        {
            "barcode": "BBWS180205846",
            "dpc": "03031233901",
            "name": "ហុក សុខា"
        },
        {
            "barcode": "BBWS180205847",
            "dpc": "03031233701",
            "name": "លាង ស្រេង"
        },
        {
            "barcode": "BBWS180205848",
            "dpc": "03031234601",
            "name": "ហែម ទុំ"
        },
        {
            "barcode": "BBWS180205849",
            "dpc": "03031234701",
            "name": "ស៊ឹម វ៉ាន់"
        },
        {
            "barcode": "BBWS180205850",
            "dpc": "03031234801",
            "name": "លី សារុំ"
        },
        {
            "barcode": "BBWS180205851",
            "dpc": "03031234901",
            "name": "សេន សារឿន"
        },
        {
            "barcode": "BBWS180205852",
            "dpc": "03031235001",
            "name": "ជា សម្បត្តិ"
        },
        {
            "barcode": "BBWS180205853",
            "dpc": "03031235101",
            "name": "កង ណារីន"
        },
        {
            "barcode": "BBWS180205854",
            "dpc": "03031235201",
            "name": "នៃ ច័ន្ទថន"
        },
        {
            "barcode": "BBWS180205855",
            "dpc": "03031233601",
            "name": "លន់ ឡៃមិញ"
        },
        {
            "barcode": "BBWS180205856",
            "dpc": "03031233501",
            "name": "ច័ន្ទ សុឋាន"
        },
        {
            "barcode": "BBWS180205857",
            "dpc": "03031233401",
            "name": "ពេជ្រ បុប្ផា"
        },
        {
            "barcode": "BBWS180205858",
            "dpc": "03031233301",
            "name": "រស់ ឃ្លោក"
        },
        {
            "barcode": "BBWS180205859",
            "dpc": "03031233201",
            "name": "ម៉ៅ ផល្លា"
        },
        {
            "barcode": "BBWS180205860",
            "dpc": "03031233101",
            "name": "ទុយ ប៊ុនរ៉ាត់"
        },
        {
            "barcode": "BBWS180205861",
            "dpc": "03031232901",
            "name": "ថន នី"
        },
        {
            "barcode": "BBWS180205862",
            "dpc": "03031232801",
            "name": "លាវ សុជាតិ"
        },
        {
            "barcode": "BBWS180205863",
            "dpc": "03031211901",
            "name": "ឃឹម សារ៉ន"
        },
        {
            "barcode": "BBWS180205864",
            "dpc": "03031232701",
            "name": "សេង ភី"
        },
        {
            "barcode": "BBWS180205865",
            "dpc": "03031200101",
            "name": "ព្រាប   វន"
        },
        {
            "barcode": "BBWS180205866",
            "dpc": "03031205001",
            "name": "ខៀវ  សំបូរ"
        },
        {
            "barcode": "BBWS180205867",
            "dpc": "03031207501",
            "name": "ជា  គឹមឈួង ២"
        },
        {
            "barcode": "BBWS180205868",
            "dpc": "03031212001",
            "name": "គណៈបក្សប្រជាជន"
        },
        {
            "barcode": "BBWS180205869",
            "dpc": "03031220101",
            "name": "ចៅ  ហ្វឹង (៥៥៥ )"
        },
        {
            "barcode": "BBWS180205870",
            "dpc": "03031220201",
            "name": "ពេជ្រ  ណាឡុង"
        },
        {
            "barcode": "BBWS180205871",
            "dpc": "03031220301",
            "name": "ឡុង  ប៊ុនហេង"
        },
        {
            "barcode": "BBWS180205872",
            "dpc": "03031220401",
            "name": "គឹម  ស៊្រុន"
        },
        {
            "barcode": "BBWS180205873",
            "dpc": "03031222701",
            "name": "ឯក  ជិវ័ន ១"
        },
        {
            "barcode": "BBWS180205874",
            "dpc": "03031226301",
            "name": "បែន  ភួង"
        },
        {
            "barcode": "BBWS180205875",
            "dpc": "03031233001",
            "name": "ឡាច  ប៊ុនថាច"
        },
        {
            "barcode": "BBWS180205876",
            "dpc": "03031234501",
            "name": "ផាត់  មុំ"
        },
        {
            "barcode": "BBWS180205877",
            "dpc": "03031246501",
            "name": "ឡុង  វ៉ាន់រ៉ា"
        },
        {
            "barcode": "BBWS180205878",
            "dpc": "03031221301",
            "name": "តូច  ស៊ិនណារ៉ា"
        },
        {
            "barcode": "BBWS180205879",
            "dpc": "03031221401",
            "name": "វែង  ស៊្រុន"
        },
        {
            "barcode": "BBWS180205880",
            "dpc": "03031221501",
            "name": "ណុប  សាមិ"
        },
        {
            "barcode": "BBWS180205881",
            "dpc": "03031221601",
            "name": "ឡាយ  គឹមហៀក"
        },
        {
            "barcode": "BBWS180205882",
            "dpc": "03031221701",
            "name": "យូ  គង់"
        },
        {
            "barcode": "BBWS180205883",
            "dpc": "03031221801",
            "name": "ផាត់  តុង"
        },
        {
            "barcode": "BBWS180205884",
            "dpc": "03031221901",
            "name": "លឿង  ប៊ួយ"
        },
        {
            "barcode": "BBWS180205885",
            "dpc": "03031225801",
            "name": "យោង  យិន"
        },
        {
            "barcode": "BBWS180205886",
            "dpc": "03031226001",
            "name": "ពឹង  គឹមហួរ"
        },
        {
            "barcode": "BBWS180205887",
            "dpc": "03031226101",
            "name": "យ៉ាន់  លឿម"
        },
        {
            "barcode": "BBWS180205888",
            "dpc": "03031226201",
            "name": "ថង  សៀង"
        },
        {
            "barcode": "BBWS180205889",
            "dpc": "03031226401",
            "name": "ចៅ  វៃឈូ"
        },
        {
            "barcode": "BBWS180205890",
            "dpc": "03031248001",
            "name": "រឿន ខុន"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
