let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=

    [
        {
            "barcode": "BBWS180205891",
            "dpc": "03031305801",
            "name": "សាន សុផល"
        },
        {
            "barcode": "BBWS180205892",
            "dpc": "03031305901",
            "name": "សុខ រ៉ុង"
        },
        {
            "barcode": "BBWS180205893",
            "dpc": "03031306001",
            "name": "ឡាំ ធៀន ១"
        },
        {
            "barcode": "BBWS180205894",
            "dpc": "03031306101",
            "name": "ឡាំ ធៀន ២"
        },
        {
            "barcode": "BBWS180205895",
            "dpc": "03031306201",
            "name": "អៀង សុគន្ធ"
        },
        {
            "barcode": "BBWS180205896",
            "dpc": "03031306301",
            "name": "ហៃ សុភ័ក្រ"
        },
        {
            "barcode": "BBWS180205897",
            "dpc": "03031306401",
            "name": "ម៉េង អ៊ីវ"
        },
        {
            "barcode": "BBWS180205898",
            "dpc": "03031306501",
            "name": "កុលាប កណិកា"
        },
        {
            "barcode": "BBWS180205899",
            "dpc": "03031306601",
            "name": "ហួត ទុយ"
        },
        {
            "barcode": "BBWS180205900",
            "dpc": "03031306701",
            "name": "គង់ ឌី"
        },
        {
            "barcode": "BBWS180205901",
            "dpc": "03031306801",
            "name": "សោម សារិទ្ធ"
        },
        {
            "barcode": "BBWS180205902",
            "dpc": "03031306901",
            "name": "ដាញ់ ធឹង"
        },
        {
            "barcode": "BBWS180205903",
            "dpc": "03031307001",
            "name": "សោម សុន"
        },
        {
            "barcode": "BBWS180205904",
            "dpc": "03031307101",
            "name": "អ៊ុក ម៉ៅ"
        },
        {
            "barcode": "BBWS180205905",
            "dpc": "03031307201",
            "name": "សិច ផល្លី"
        },
        {
            "barcode": "BBWS180205906",
            "dpc": "03031307301",
            "name": "គឹម រ៉ា"
        },
        {
            "barcode": "BBWS180205907",
            "dpc": "03031307401",
            "name": "ឈុន ហេង"
        },
        {
            "barcode": "BBWS180205908",
            "dpc": "03031307501",
            "name": "ហ៊ិន ចំរើន"
        },
        {
            "barcode": "BBWS180205909",
            "dpc": "03031307601",
            "name": "ងិន យីម"
        },
        {
            "barcode": "BBWS180205910",
            "dpc": "03031307701",
            "name": "យក់ អឿ"
        },
        {
            "barcode": "BBWS180205911",
            "dpc": "03031307801",
            "name": "អ៊ុច សុន"
        },
        {
            "barcode": "BBWS180205912",
            "dpc": "03031307901",
            "name": "ហ៊ាង ម៉េង"
        },
        {
            "barcode": "BBWS180205913",
            "dpc": "03031308001",
            "name": "សាន សុផល"
        },
        {
            "barcode": "BBWS180205914",
            "dpc": "03031308101",
            "name": "ចៅ កី"
        },
        {
            "barcode": "BBWS180205915",
            "dpc": "03031308201",
            "name": "សោ ភីនី"
        },
        {
            "barcode": "BBWS180205916",
            "dpc": "03031308301",
            "name": "ម៉េង វណ្ណារី"
        },
        {
            "barcode": "BBWS180205917",
            "dpc": "03031308401",
            "name": "ហេង ប៊ន"
        },
        {
            "barcode": "BBWS180205918",
            "dpc": "03031308501",
            "name": "តាំង ជុងខេង"
        },
        {
            "barcode": "BBWS180205919",
            "dpc": "03031308601",
            "name": "នង ស៊ុំ"
        },
        {
            "barcode": "BBWS180205920",
            "dpc": "03031308701",
            "name": "ធួន សាយ"
        },
        {
            "barcode": "BBWS180205921",
            "dpc": "03031308801",
            "name": "ណាំ ផេង"
        },
        {
            "barcode": "BBWS180205922",
            "dpc": "03031308901",
            "name": "លេង សាវុធ"
        },
        {
            "barcode": "BBWS180205923",
            "dpc": "03031309001",
            "name": "ឆាយ សារ៉េត"
        },
        {
            "barcode": "BBWS180205924",
            "dpc": "03031309101",
            "name": "ហុង ជ្រិន"
        },
        {
            "barcode": "BBWS180205925",
            "dpc": "03031309201",
            "name": "តែ ម៉ូវិធូន"
        },
        {
            "barcode": "BBWS180205926",
            "dpc": "03031309301",
            "name": "អៀង ហ៊ាង"
        },
        {
            "barcode": "BBWS180205927",
            "dpc": "03031309401",
            "name": "គឹម សឹង"
        },
        {
            "barcode": "BBWS180205928",
            "dpc": "03031309501",
            "name": "ជា សុផល"
        },
        {
            "barcode": "BBWS180205929",
            "dpc": "03031309601",
            "name": "ឈួន ហុង"
        },
        {
            "barcode": "BBWS180205930",
            "dpc": "03031309701",
            "name": "ជីវ ជា"
        },
        {
            "barcode": "BBWS180205931",
            "dpc": "03031309801",
            "name": "ហេង ជុង"
        },
        {
            "barcode": "BBWS180205932",
            "dpc": "03031309901",
            "name": "ឡៅ ឆាយទ្រី ១"
        },
        {
            "barcode": "BBWS180205933",
            "dpc": "03031310001",
            "name": "ឡៅ ឆាយទ្រី ២"
        },
        {
            "barcode": "BBWS180205934",
            "dpc": "03031310101",
            "name": "ចាន់ ទី"
        },
        {
            "barcode": "BBWS180205935",
            "dpc": "03031310201",
            "name": "ជី សារ៉េត"
        },
        {
            "barcode": "BBWS180205936",
            "dpc": "03031310301",
            "name": "វឹង ឡុង"
        },
        {
            "barcode": "BBWS180205937",
            "dpc": "03031310401",
            "name": "ម៉ុន មីកា"
        },
        {
            "barcode": "BBWS180205938",
            "dpc": "03031310501",
            "name": "ហួន ហ៊ន"
        },
        {
            "barcode": "BBWS180205939",
            "dpc": "03031310601",
            "name": "អ៊ឹង ងួន"
        },
        {
            "barcode": "BBWS180205940",
            "dpc": "03031310701",
            "name": "រី រឿន"
        },
        {
            "barcode": "BBWS180205941",
            "dpc": "03031310801",
            "name": "គង់ វុត្ថា"
        },
        {
            "barcode": "BBWS180205942",
            "dpc": "03031310901",
            "name": "ស៊ិក សុរ័ត្នន៍"
        },
        {
            "barcode": "BBWS180205943",
            "dpc": "03031311001",
            "name": "ជាប លាង"
        },
        {
            "barcode": "BBWS180205944",
            "dpc": "03031311101",
            "name": "យូ គឹមជូ"
        },
        {
            "barcode": "BBWS180205945",
            "dpc": "03031311301",
            "name": "យ៉ម ចំរើន"
        },
        {
            "barcode": "BBWS180205946",
            "dpc": "03031311401",
            "name": "ម៉ម ម៉ាច"
        },
        {
            "barcode": "BBWS180205947",
            "dpc": "03031311501",
            "name": "គឹម ឡេង"
        },
        {
            "barcode": "BBWS180205948",
            "dpc": "03031311601",
            "name": "ជា ពិសិដ្ឋ"
        },
        {
            "barcode": "BBWS180205949",
            "dpc": "03031311701",
            "name": "ម៉ង់ ស្វាយគីរី"
        },
        {
            "barcode": "BBWS180205950",
            "dpc": "03031311801",
            "name": "គី គឹមហឿង ១"
        },
        {
            "barcode": "BBWS180205951",
            "dpc": "03031311901",
            "name": "គី គឹមហឿង ២"
        },
        {
            "barcode": "BBWS180205952",
            "dpc": "03031300101",
            "name": "ភូ ស៊ន់"
        },
        {
            "barcode": "BBWS180205953",
            "dpc": "03031300201",
            "name": "ឡុង សុខា"
        },
        {
            "barcode": "BBWS180205954",
            "dpc": "03031300301",
            "name": "ស៊ឹម វណ្ណៈ"
        },
        {
            "barcode": "BBWS180205955",
            "dpc": "03031300501",
            "name": "ពៅ ជ្រុន"
        },
        {
            "barcode": "BBWS180205956",
            "dpc": "03031300601",
            "name": "ជា ផេង"
        },
        {
            "barcode": "BBWS180205957",
            "dpc": "03031300701",
            "name": "លី ឡាង"
        },
        {
            "barcode": "BBWS180205958",
            "dpc": "03031300801",
            "name": "នូ សុខុន"
        },
        {
            "barcode": "BBWS180205959",
            "dpc": "03031301201",
            "name": "នក់ ហ្វួយ"
        },
        {
            "barcode": "BBWS180205960",
            "dpc": "03031300901",
            "name": "នង ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180205961",
            "dpc": "03031301001",
            "name": "អ៊ូច សុផៃ"
        },
        {
            "barcode": "BBWS180205962",
            "dpc": "03031301101",
            "name": "សូ ប៉ូឃន"
        },
        {
            "barcode": "BBWS180205963",
            "dpc": "03031301401",
            "name": "កែវ កាមីន"
        },
        {
            "barcode": "BBWS180205964",
            "dpc": "03031301501",
            "name": "គី ងួន"
        },
        {
            "barcode": "BBWS180205965",
            "dpc": "03031301601",
            "name": "តែ ម៉េងសួរ"
        },
        {
            "barcode": "BBWS180205966",
            "dpc": "03031301701",
            "name": "ភូ ប៉ូយ"
        },
        {
            "barcode": "BBWS180205967",
            "dpc": "03031301801",
            "name": "តាន់ កុសល"
        },
        {
            "barcode": "BBWS180205968",
            "dpc": "03031301901",
            "name": "ហេង យ៉ាត"
        },
        {
            "barcode": "BBWS180205969",
            "dpc": "03031302001",
            "name": "តាំង លីងួន"
        },
        {
            "barcode": "BBWS180205970",
            "dpc": "03031302101",
            "name": "កែវ នីម"
        },
        {
            "barcode": "BBWS180205971",
            "dpc": "03031302201",
            "name": "ពេជ្រ អៀម"
        },
        {
            "barcode": "BBWS180205972",
            "dpc": "03031302301",
            "name": "យូ សាង"
        },
        {
            "barcode": "BBWS180205973",
            "dpc": "03031302401",
            "name": "លាវ សុខម៉េង"
        },
        {
            "barcode": "BBWS180205974",
            "dpc": "03031302501",
            "name": "ចៅ កាំឈិញ"
        },
        {
            "barcode": "BBWS180205975",
            "dpc": "03031302601",
            "name": "នី ចំរើន"
        },
        {
            "barcode": "BBWS180205976",
            "dpc": "03031302701",
            "name": "ហ៊ុន វិបុល"
        },
        {
            "barcode": "BBWS180205977",
            "dpc": "03031302801",
            "name": "ខៀវ ចៃ"
        },
        {
            "barcode": "BBWS180205978",
            "dpc": "03031302901",
            "name": "លី ម៉េង"
        },
        {
            "barcode": "BBWS180205979",
            "dpc": "03031303001",
            "name": "អោម ផេង"
        },
        {
            "barcode": "BBWS180205980",
            "dpc": "03031303101",
            "name": "លក់ គ្រី"
        },
        {
            "barcode": "BBWS180205981",
            "dpc": "03031303201",
            "name": "តាំង ឈុន"
        },
        {
            "barcode": "BBWS180205982",
            "dpc": "03031303301",
            "name": "ម៉ក់ ហុង"
        },
        {
            "barcode": "BBWS180205983",
            "dpc": "03031303701",
            "name": "អ៊ឹង  ឡា"
        },
        {
            "barcode": "BBWS180205984",
            "dpc": "03031303801",
            "name": "ឡុច តង"
        },
        {
            "barcode": "BBWS180205985",
            "dpc": "03031303901",
            "name": "គឹម វ៉ាន់"
        },
        {
            "barcode": "BBWS180205986",
            "dpc": "03031304001",
            "name": "ខ្ចៅ ទូច"
        },
        {
            "barcode": "BBWS180205987",
            "dpc": "03031304101",
            "name": "ជឹម ជឿន"
        },
        {
            "barcode": "BBWS180205988",
            "dpc": "03031304201",
            "name": "យ៉ាន់ សារឿន"
        },
        {
            "barcode": "BBWS180205989",
            "dpc": "03031304301",
            "name": "អ៊ឹម យិន"
        },
        {
            "barcode": "BBWS180205990",
            "dpc": "03031304401",
            "name": "ដួង លី"
        },
        {
            "barcode": "BBWS180205991",
            "dpc": "03031304501",
            "name": "ទីម យេត"
        },
        {
            "barcode": "BBWS180205992",
            "dpc": "03031304601",
            "name": "ឈឹម សួរ"
        },
        {
            "barcode": "BBWS180205993",
            "dpc": "03031304701",
            "name": "សេង សុន"
        },
        {
            "barcode": "BBWS180205994",
            "dpc": "03031304801",
            "name": "សាន់ ហាក់"
        },
        {
            "barcode": "BBWS180205995",
            "dpc": "03031304901",
            "name": "គង់ កុសល"
        },
        {
            "barcode": "BBWS180205996",
            "dpc": "03031305001",
            "name": "ពុន សែ"
        },
        {
            "barcode": "BBWS180205997",
            "dpc": "03031305201",
            "name": "សាន ផល្លីន"
        },
        {
            "barcode": "BBWS180205998",
            "dpc": "03031305301",
            "name": "គឹម អេង"
        },
        {
            "barcode": "BBWS180205999",
            "dpc": "03031305501",
            "name": "ឡុង ខេន"
        },
        {
            "barcode": "BBWS180206000",
            "dpc": "03031305601",
            "name": "សក់ ចន្ទ្រាវុធ"
        },
        {
            "barcode": "BBWS180206001",
            "dpc": "03031305701",
            "name": "តូច  សារិន"
        },
        {
            "barcode": "BBWS180206002",
            "dpc": "03031326201",
            "name": "ទេព  បេងសួរ"
        },
        {
            "barcode": "BBWS180206003",
            "dpc": "03031326001",
            "name": "ម៉េង  លាង"
        },
        {
            "barcode": "BBWS180206004",
            "dpc": "03031325901",
            "name": "អ៊ុយ  គង់"
        },
        {
            "barcode": "BBWS180206005",
            "dpc": "03031325701",
            "name": "យស់  បាន"
        },
        {
            "barcode": "BBWS180206006",
            "dpc": "03031325601",
            "name": "អ៊ុយ  ជុំ"
        },
        {
            "barcode": "BBWS180206007",
            "dpc": "03031325501",
            "name": "អ៊ឹម  កោវិត"
        },
        {
            "barcode": "BBWS180206008",
            "dpc": "03031325401",
            "name": "អួង  ខេង"
        },
        {
            "barcode": "BBWS180206009",
            "dpc": "03031325301",
            "name": "ហុក  ឈួន"
        },
        {
            "barcode": "BBWS180206010",
            "dpc": "03031325201",
            "name": "កែវ  ប៉ក់"
        },
        {
            "barcode": "BBWS180206011",
            "dpc": "03031325101",
            "name": "អេង  ង៉ោ"
        },
        {
            "barcode": "BBWS180206012",
            "dpc": "03031325001",
            "name": "នូ  ហានី"
        },
        {
            "barcode": "BBWS180206013",
            "dpc": "03031324801",
            "name": "ឆា  ស៊ីសុវត្ថា"
        },
        {
            "barcode": "BBWS180206014",
            "dpc": "03031324701",
            "name": "ស៊ុន   ប៊ុនឡេង"
        },
        {
            "barcode": "BBWS180206015",
            "dpc": "03031324601",
            "name": "ឡោ  សារឹម"
        },
        {
            "barcode": "BBWS180206016",
            "dpc": "03031330901",
            "name": "សោ  គឹមកូយ"
        },
        {
            "barcode": "BBWS180206017",
            "dpc": "03031330801",
            "name": "ហ៊ុល  សុមុន្នី"
        },
        {
            "barcode": "BBWS180206018",
            "dpc": "03031330701",
            "name": "មាស  ប៊ុនថេន"
        },
        {
            "barcode": "BBWS180206019",
            "dpc": "03031330401",
            "name": "លី  គឹមលាង"
        },
        {
            "barcode": "BBWS180206020",
            "dpc": "03031330301",
            "name": "ធម្ម  សុផា"
        },
        {
            "barcode": "BBWS180206021",
            "dpc": "03031330201",
            "name": "ឡុង  គឹមតេង"
        },
        {
            "barcode": "BBWS180206022",
            "dpc": "03031330101",
            "name": "ម៉ឺន  យ៉ាន"
        },
        {
            "barcode": "BBWS180206023",
            "dpc": "03031330001",
            "name": "ថោង  ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180206024",
            "dpc": "03031329901",
            "name": "ឌិត  យ៉ាន់"
        },
        {
            "barcode": "BBWS180206025",
            "dpc": "03031329801",
            "name": "អ៊ុង  នុត"
        },
        {
            "barcode": "BBWS180206026",
            "dpc": "03031329701",
            "name": "អ៊ឹម  នាង"
        },
        {
            "barcode": "BBWS180206027",
            "dpc": "03031329601",
            "name": "មាស  លី"
        },
        {
            "barcode": "BBWS180206028",
            "dpc": "03031329501",
            "name": "ទេព  ណាត្យ"
        },
        {
            "barcode": "BBWS180206029",
            "dpc": "03031329401",
            "name": "លឹម  គឹមភាព"
        },
        {
            "barcode": "BBWS180206030",
            "dpc": "03031323901",
            "name": "ជា  ហេង"
        },
        {
            "barcode": "BBWS180206031",
            "dpc": "03031329001",
            "name": "តេង  ច័ន្ទថុល"
        },
        {
            "barcode": "BBWS180206032",
            "dpc": "03031326501",
            "name": "ព្រឹម  សាលី"
        },
        {
            "barcode": "BBWS180206033",
            "dpc": "03031346601",
            "name": "ពិន  ប៊ុនហ៊ត"
        },
        {
            "barcode": "BBWS180206034",
            "dpc": "03031346701",
            "name": "ឈាង  គី"
        },
        {
            "barcode": "BBWS180206035",
            "dpc": "03031346801",
            "name": "អួង   សន"
        },
        {
            "barcode": "BBWS180206036",
            "dpc": "03031346901",
            "name": "កែវ  មនោ"
        },
        {
            "barcode": "BBWS180206037",
            "dpc": "03031347001",
            "name": "តោ  ពិសិដ្ឋ"
        },
        {
            "barcode": "BBWS180206038",
            "dpc": "03031347101",
            "name": "កៅ  សុខន"
        },
        {
            "barcode": "BBWS180206039",
            "dpc": "03031347201",
            "name": "វិហារអ្នកតាចិន"
        },
        {
            "barcode": "BBWS180206040",
            "dpc": "03031347301",
            "name": "ម៉ៃ  ហ៊ាង"
        },
        {
            "barcode": "BBWS180206041",
            "dpc": "03031347401",
            "name": "យឹម  ហ៊ីង"
        },
        {
            "barcode": "BBWS180206042",
            "dpc": "03031347501",
            "name": "សុខ  គៀត"
        },
        {
            "barcode": "BBWS180206043",
            "dpc": "03031347601",
            "name": "ហ៊ីម  ស៊ីស"
        },
        {
            "barcode": "BBWS180206044",
            "dpc": "03031347701",
            "name": "ធឹក  សាធឿន"
        },
        {
            "barcode": "BBWS180206045",
            "dpc": "03031347801",
            "name": "ជូ  គឹមរិន"
        },
        {
            "barcode": "BBWS180206046",
            "dpc": "03031347901",
            "name": "ឈុន  ស្រេង"
        },
        {
            "barcode": "BBWS180206047",
            "dpc": "03031344101",
            "name": "ឈឿម  សុវណ្ណ"
        },
        {
            "barcode": "BBWS180206048",
            "dpc": "03031344301",
            "name": "អុំ   លឿម"
        },
        {
            "barcode": "BBWS180206049",
            "dpc": "03031344501",
            "name": "ហឹង  សៀន"
        },
        {
            "barcode": "BBWS180206050",
            "dpc": "03031344601",
            "name": "យឺន  ម៉ិ"
        },
        {
            "barcode": "BBWS180206051",
            "dpc": "03031344701",
            "name": "ម៉ៃ  ហ៊ាង"
        },
        {
            "barcode": "BBWS180206052",
            "dpc": "03031344801",
            "name": "តោ  ហួត"
        },
        {
            "barcode": "BBWS180206053",
            "dpc": "03031344901",
            "name": "អេង  ចាន់ម៉ាន់"
        },
        {
            "barcode": "BBWS180206054",
            "dpc": "03031345001",
            "name": "តោ  ភិសិដ្ឋ"
        },
        {
            "barcode": "BBWS180206055",
            "dpc": "03031345101",
            "name": "យូ  គង់"
        },
        {
            "barcode": "BBWS180206056",
            "dpc": "03031345301",
            "name": "អ៊ិត  តាន់"
        },
        {
            "barcode": "BBWS180206057",
            "dpc": "03031345401",
            "name": "សុខ  ជា"
        },
        {
            "barcode": "BBWS180206058",
            "dpc": "03031345501",
            "name": "ហ៊ឹម  សារ៉េត"
        },
        {
            "barcode": "BBWS180206059",
            "dpc": "03031345601",
            "name": "ស៊ុត  ថាយ"
        },
        {
            "barcode": "BBWS180206060",
            "dpc": "03031345801",
            "name": "នូ  នេតត្រា"
        },
        {
            "barcode": "BBWS180206061",
            "dpc": "03031345901",
            "name": "យី  សារ៉ូ"
        },
        {
            "barcode": "BBWS180206062",
            "dpc": "03031346001",
            "name": "ជូង  ពីង"
        },
        {
            "barcode": "BBWS180206063",
            "dpc": "03031346101",
            "name": "ចាន់  បឿម"
        },
        {
            "barcode": "BBWS180206064",
            "dpc": "03031346201",
            "name": "ម៉េង  លាង"
        },
        {
            "barcode": "BBWS180206065",
            "dpc": "03031346301",
            "name": "សុខ  អេង"
        },
        {
            "barcode": "BBWS180206066",
            "dpc": "03031346401",
            "name": "ពន់  ឃីម"
        },
        {
            "barcode": "BBWS180206067",
            "dpc": "03031346501",
            "name": "កែវ  វីរៈ"
        },
        {
            "barcode": "BBWS180206068",
            "dpc": "03031326701",
            "name": "សុច  សារុំ"
        },
        {
            "barcode": "BBWS180206069",
            "dpc": "03031326801",
            "name": "អួង  ខេង"
        },
        {
            "barcode": "BBWS180206070",
            "dpc": "03031326901",
            "name": "សោម  សាឃឿង"
        },
        {
            "barcode": "BBWS180206071",
            "dpc": "03031327001",
            "name": "លេង  ហួរ"
        },
        {
            "barcode": "BBWS180206072",
            "dpc": "03031327101",
            "name": "មាស  សុវណ្ណ"
        },
        {
            "barcode": "BBWS180206073",
            "dpc": "03031327201",
            "name": "សុខ ធី"
        },
        {
            "barcode": "BBWS180206074",
            "dpc": "03031327301",
            "name": "សុខ  ធា"
        },
        {
            "barcode": "BBWS180206075",
            "dpc": "03031327401",
            "name": "សឹង  ជឺ"
        },
        {
            "barcode": "BBWS180206076",
            "dpc": "03031327501",
            "name": "ហេង  លាង"
        },
        {
            "barcode": "BBWS180206077",
            "dpc": "03031327601",
            "name": "ព្រឹម   សាលី"
        },
        {
            "barcode": "BBWS180206078",
            "dpc": "03031327701",
            "name": "ម៉េង  វុទ្ធា"
        },
        {
            "barcode": "BBWS180206079",
            "dpc": "03031328001",
            "name": "ជុក  គឹមហាប់"
        },
        {
            "barcode": "BBWS180206080",
            "dpc": "03031328301",
            "name": "សេង  ផូ"
        },
        {
            "barcode": "BBWS180206081",
            "dpc": "03031328401",
            "name": "អួល  រ័ត្ន"
        },
        {
            "barcode": "BBWS180206082",
            "dpc": "03031328501",
            "name": "សាត  សុធាន"
        },
        {
            "barcode": "BBWS180206083",
            "dpc": "03031328601",
            "name": "ចាន់  ថា"
        },
        {
            "barcode": "BBWS180206084",
            "dpc": "03031328701",
            "name": "ស៊ឹម  វ៉ាត់"
        },
        {
            "barcode": "BBWS180206085",
            "dpc": "03031328801",
            "name": "ដួង  កក់"
        },
        {
            "barcode": "BBWS180206086",
            "dpc": "03031328901",
            "name": "វណ្ណ  សុមាលី"
        },
        {
            "barcode": "BBWS180206087",
            "dpc": "03031312701",
            "name": "ណៃ  ស៊្រុន"
        },
        {
            "barcode": "BBWS180206088",
            "dpc": "03031312801",
            "name": "ហេង  សុខា"
        },
        {
            "barcode": "BBWS180206089",
            "dpc": "03031312901",
            "name": "ហេង  លីម"
        },
        {
            "barcode": "BBWS180206090",
            "dpc": "03031313001",
            "name": "អឿន  សំអាត"
        },
        {
            "barcode": "BBWS180206091",
            "dpc": "03031313101",
            "name": "សៅ  ទី"
        },
        {
            "barcode": "BBWS180206092",
            "dpc": "03031313201",
            "name": "ស្វាយ សុឃីម"
        },
        {
            "barcode": "BBWS180206093",
            "dpc": "03031313301",
            "name": "តាន់  តេង"
        },
        {
            "barcode": "BBWS180206094",
            "dpc": "03031313401",
            "name": "ជូ  គង់"
        },
        {
            "barcode": "BBWS180206095",
            "dpc": "03031313501",
            "name": "ឈួន  សារ៉ាត់"
        },
        {
            "barcode": "BBWS180206096",
            "dpc": "03031313601",
            "name": "អ៊ី  ចាន់នឿន"
        },
        {
            "barcode": "BBWS180206097",
            "dpc": "03031313701",
            "name": "អ៊ុយ  គង់"
        },
        {
            "barcode": "BBWS180206098",
            "dpc": "03031313801",
            "name": "សេង  ហ៊ួរ ២"
        },
        {
            "barcode": "BBWS180206099",
            "dpc": "03031313901",
            "name": "កែវ  សុខជា"
        },
        {
            "barcode": "BBWS180206100",
            "dpc": "03031314001",
            "name": "ប៊ី សួ"
        },
        {
            "barcode": "BBWS180206101",
            "dpc": "03031314101",
            "name": "ប៉ាល់  រ៉យ"
        },
        {
            "barcode": "BBWS180206102",
            "dpc": "03031314201",
            "name": "សេង  ហួរ"
        },
        {
            "barcode": "BBWS180206103",
            "dpc": "03031314301",
            "name": "គឹម  សារឿន"
        },
        {
            "barcode": "BBWS180206104",
            "dpc": "03031314401",
            "name": "អឿ  សៀង"
        },
        {
            "barcode": "BBWS180206105",
            "dpc": "03031314501",
            "name": "គា  ហេង"
        },
        {
            "barcode": "BBWS180206106",
            "dpc": "03031314601",
            "name": "ប៉ោ  ស៊ីណា"
        },
        {
            "barcode": "BBWS180206107",
            "dpc": "03031314701",
            "name": "ង៉ែត  គី"
        },
        {
            "barcode": "BBWS180206108",
            "dpc": "03031314901",
            "name": "លឹម  ដារ៉ា"
        },
        {
            "barcode": "BBWS180206109",
            "dpc": "03031315001",
            "name": "មុំ   ហ៊ាង"
        },
        {
            "barcode": "BBWS180206110",
            "dpc": "03031315101",
            "name": "ទី  សាន"
        },
        {
            "barcode": "BBWS180206111",
            "dpc": "03031315201",
            "name": "ប៉ុញ  ឧត្តម"
        },
        {
            "barcode": "BBWS180206112",
            "dpc": "03031315301",
            "name": "ភួយ  លាងចេង"
        },
        {
            "barcode": "BBWS180206113",
            "dpc": "03031315401",
            "name": "គុជ  ជរ"
        },
        {
            "barcode": "BBWS180206114",
            "dpc": "03031315501",
            "name": "ឈឹម  សុវណ្ណ"
        },
        {
            "barcode": "BBWS180206115",
            "dpc": "03031315601",
            "name": "ភឿក  រ៉ានី"
        },
        {
            "barcode": "BBWS180206116",
            "dpc": "03031315701",
            "name": "ឈួន  សុផល"
        },
        {
            "barcode": "BBWS180206117",
            "dpc": "03031315801",
            "name": "សុខ  ពុធ"
        },
        {
            "barcode": "BBWS180206118",
            "dpc": "03031315901",
            "name": "អៀង  ស៊ីណា"
        },
        {
            "barcode": "BBWS180206119",
            "dpc": "03031316001",
            "name": "អៀង  សុភាព"
        },
        {
            "barcode": "BBWS180206120",
            "dpc": "03031316101",
            "name": "ឆាយ  រ៉ង"
        },
        {
            "barcode": "BBWS180206121",
            "dpc": "03031316201",
            "name": "ណាម  កេតរ៉ា"
        },
        {
            "barcode": "BBWS180206122",
            "dpc": "03031316301",
            "name": "ថុត  ប៊ុនឈិន"
        },
        {
            "barcode": "BBWS180206123",
            "dpc": "03031316401",
            "name": "លឹម  ចាន់ថន"
        },
        {
            "barcode": "BBWS180206124",
            "dpc": "03031316501",
            "name": "ហឿង  ឈុន"
        },
        {
            "barcode": "BBWS180206125",
            "dpc": "03031316601",
            "name": "ភួង  ចំរើន"
        },
        {
            "barcode": "BBWS180206126",
            "dpc": "03031316701",
            "name": "ងួន  ឆាយ"
        },
        {
            "barcode": "BBWS180206127",
            "dpc": "03031316901",
            "name": "អ៊ុយ  លីវ"
        },
        {
            "barcode": "BBWS180206128",
            "dpc": "03031317001",
            "name": "ជូ  ចំរើន"
        },
        {
            "barcode": "BBWS180206129",
            "dpc": "03031317101",
            "name": "ប៊ូ  កិត្យា"
        },
        {
            "barcode": "BBWS180206130",
            "dpc": "03031317201",
            "name": "យូ  ទីនី"
        },
        {
            "barcode": "BBWS180206131",
            "dpc": "03031317301",
            "name": "ញឹម  ម៉ែន"
        },
        {
            "barcode": "BBWS180206132",
            "dpc": "03031317501",
            "name": "ង៉ា  ឃីម"
        },
        {
            "barcode": "BBWS180206133",
            "dpc": "03031317601",
            "name": "អួង  ម៉ានី ១"
        },
        {
            "barcode": "BBWS180206134",
            "dpc": "03031317801",
            "name": "សែម សុខា"
        },
        {
            "barcode": "BBWS180206135",
            "dpc": "03031317901",
            "name": "ម៉ៅ  រ័ត្នមុនី"
        },
        {
            "barcode": "BBWS180206136",
            "dpc": "03031318001",
            "name": "លាស់   ថេត"
        },
        {
            "barcode": "BBWS180206137",
            "dpc": "03031318101",
            "name": "ចាន់  ដាវឹង"
        },
        {
            "barcode": "BBWS180206138",
            "dpc": "03031318201",
            "name": "ផាត់  សុខលាង ១"
        },
        {
            "barcode": "BBWS180206139",
            "dpc": "03031318301",
            "name": "ផាត់  សុខលាង​​ ២"
        },
        {
            "barcode": "BBWS180206140",
            "dpc": "03031318501",
            "name": "ហឿង  ណៃឈុន"
        },
        {
            "barcode": "BBWS180206141",
            "dpc": "03031318601",
            "name": "អឿ  គឹមហឿង"
        },
        {
            "barcode": "BBWS180206142",
            "dpc": "03031318701",
            "name": "យឹម  សំបូ"
        },
        {
            "barcode": "BBWS180206143",
            "dpc": "03031318901",
            "name": "រស់  សុផាត"
        },
        {
            "barcode": "BBWS180206144",
            "dpc": "03031319001",
            "name": "ហេង  លីម"
        },
        {
            "barcode": "BBWS180206145",
            "dpc": "03031322801",
            "name": "អ៊ឹម  ឈួម"
        },
        {
            "barcode": "BBWS180206146",
            "dpc": "03031322701",
            "name": "ស  ស៊ីវន"
        },
        {
            "barcode": "BBWS180206147",
            "dpc": "03031322601",
            "name": "បួន  គឹមហាវ"
        },
        {
            "barcode": "BBWS180206148",
            "dpc": "03031322501",
            "name": "ជួន  ប៊ុនធុល"
        },
        {
            "barcode": "BBWS180206149",
            "dpc": "03031322401",
            "name": "គង់  សារិន"
        },
        {
            "barcode": "BBWS180206150",
            "dpc": "03031322301",
            "name": "លី  ជា"
        },
        {
            "barcode": "BBWS180206151",
            "dpc": "03031322101",
            "name": "បែន  ផន"
        },
        {
            "barcode": "BBWS180206152",
            "dpc": "03031322001",
            "name": "ឃឹម  សាមិត"
        },
        {
            "barcode": "BBWS180206153",
            "dpc": "03031321901",
            "name": "តន់  ប៊ុនរឿន"
        },
        {
            "barcode": "BBWS180206154",
            "dpc": "03031321801",
            "name": "នួន  តុន"
        },
        {
            "barcode": "BBWS180206155",
            "dpc": "03031321701",
            "name": "តាន់  អ៊ីវន"
        },
        {
            "barcode": "BBWS180206156",
            "dpc": "03031321601",
            "name": "លឹម  ឡាយ"
        },
        {
            "barcode": "BBWS180206157",
            "dpc": "03031321501",
            "name": "អ៊ូច  សុផៃ"
        },
        {
            "barcode": "BBWS180206158",
            "dpc": "03031321401",
            "name": "កៅ  អេង"
        },
        {
            "barcode": "BBWS180206159",
            "dpc": "03031321301",
            "name": "ហាក់  សោភ័ណ"
        },
        {
            "barcode": "BBWS180206160",
            "dpc": "03031321201",
            "name": "គង់  ឡេង"
        },
        {
            "barcode": "BBWS180206161",
            "dpc": "03031321101",
            "name": "លឹម  គឹមស៊ា"
        },
        {
            "barcode": "BBWS180206162",
            "dpc": "03031321001",
            "name": "វឿត  សុវណ្ណ"
        },
        {
            "barcode": "BBWS180206163",
            "dpc": "03031320901",
            "name": "អោម  សាវេត"
        },
        {
            "barcode": "BBWS180206164",
            "dpc": "03031320801",
            "name": "ប៉ាវ  ឈុនលីម"
        },
        {
            "barcode": "BBWS180206165",
            "dpc": "03031320601",
            "name": "ឡុង  គឹមឆេង"
        },
        {
            "barcode": "BBWS180206166",
            "dpc": "03031320401",
            "name": "លី  សោភ័ណ"
        },
        {
            "barcode": "BBWS180206167",
            "dpc": "03031320301",
            "name": "សៅ  ដារ៉ានិមិត្ត"
        },
        {
            "barcode": "BBWS180206168",
            "dpc": "03031320201",
            "name": "ឡៅ  ជាងគី"
        },
        {
            "barcode": "BBWS180206169",
            "dpc": "03031320101",
            "name": "សក់  មី"
        },
        {
            "barcode": "BBWS180206170",
            "dpc": "03031320001",
            "name": "ពិន  កុសល"
        },
        {
            "barcode": "BBWS180206171",
            "dpc": "03031319901",
            "name": "ដុះ  វណ្ណរស្មី"
        },
        {
            "barcode": "BBWS180206172",
            "dpc": "03031319801",
            "name": "នូ  សុខុម"
        },
        {
            "barcode": "BBWS180206173",
            "dpc": "03031320701",
            "name": "ទូច   សុផាត"
        },
        {
            "barcode": "BBWS180206174",
            "dpc": "03031324401",
            "name": "យ៉ាន  បូផៃ"
        },
        {
            "barcode": "BBWS180206175",
            "dpc": "03031324201",
            "name": "មាស  សាន"
        },
        {
            "barcode": "BBWS180206176",
            "dpc": "03031324101",
            "name": "ប៊ុត  គឹមស៊ាន"
        },
        {
            "barcode": "BBWS180206177",
            "dpc": "03031324001",
            "name": "ឡុង  សេង"
        },
        {
            "barcode": "BBWS180206178",
            "dpc": "03031323801",
            "name": "ចាន់  សេរីឆុង"
        },
        {
            "barcode": "BBWS180206179",
            "dpc": "03031323701",
            "name": "ហែម   គឹមហូ"
        },
        {
            "barcode": "BBWS180206180",
            "dpc": "03031323601",
            "name": "ជេ  រៀន"
        },
        {
            "barcode": "BBWS180206181",
            "dpc": "03031323501",
            "name": "ប៉េង  សុខឃីម"
        },
        {
            "barcode": "BBWS180206182",
            "dpc": "03031323401",
            "name": "ផូង  ឌិញ"
        },
        {
            "barcode": "BBWS180206183",
            "dpc": "03031323201",
            "name": "អ៊ឹង  ឡា"
        },
        {
            "barcode": "BBWS180206184",
            "dpc": "03031323101",
            "name": "ទេន   ភឹម"
        },
        {
            "barcode": "BBWS180206185",
            "dpc": "03031323001",
            "name": "ស  ណារ៉យ"
        },
        {
            "barcode": "BBWS180206186",
            "dpc": "03031322901",
            "name": "ស្រី  អឿន"
        },
        {
            "barcode": "BBWS180206187",
            "dpc": "03031331601",
            "name": "ទៀង  ចិន្តា"
        },
        {
            "barcode": "BBWS180206188",
            "dpc": "03031331801",
            "name": "ទេព  គឹមហេង"
        },
        {
            "barcode": "BBWS180206189",
            "dpc": "03031331901",
            "name": "ទុយ  វុត្ថា"
        },
        {
            "barcode": "BBWS180206190",
            "dpc": "03031332001",
            "name": "សុខ  ស៊ីវ"
        },
        {
            "barcode": "BBWS180206191",
            "dpc": "03031332101",
            "name": "មាស  ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180206192",
            "dpc": "03031332201",
            "name": "សេក  សំបូរ"
        },
        {
            "barcode": "BBWS180206193",
            "dpc": "03031332301",
            "name": "ប៉ាន់  សៀក"
        },
        {
            "barcode": "BBWS180206194",
            "dpc": "03031332401",
            "name": "យូ  ណារ៉ុង"
        },
        {
            "barcode": "BBWS180206195",
            "dpc": "03031332501",
            "name": "អ៊ុក  ចាយ"
        },
        {
            "barcode": "BBWS180206196",
            "dpc": "03031332601",
            "name": "ពុត  ជួប"
        },
        {
            "barcode": "BBWS180206197",
            "dpc": "03031332701",
            "name": "ទូច  គឹមធុច"
        },
        {
            "barcode": "BBWS180206198",
            "dpc": "03031332801",
            "name": "នី  សុភាព"
        },
        {
            "barcode": "BBWS180206199",
            "dpc": "03031332901",
            "name": "អៀង  ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "BBWS180206200",
            "dpc": "03031333001",
            "name": "អ៊ិត ផល្លា"
        },
        {
            "barcode": "BBWS180206201",
            "dpc": "03031333101",
            "name": "ប៉ា    ហាក់"
        },
        {
            "barcode": "BBWS180206202",
            "dpc": "03031333201",
            "name": "នុយ  ចំរ៉ុង"
        },
        {
            "barcode": "BBWS180206203",
            "dpc": "03031333401",
            "name": "ចៅ  គឹមយ៉ាត"
        },
        {
            "barcode": "BBWS180206204",
            "dpc": "03031333501",
            "name": "សោ  គឹមហៀក"
        },
        {
            "barcode": "BBWS180206205",
            "dpc": "03031333601",
            "name": "ប្លុង  សាវឿន"
        },
        {
            "barcode": "BBWS180206206",
            "dpc": "03031333701",
            "name": "ជីវ  យ៉ា"
        },
        {
            "barcode": "BBWS180206207",
            "dpc": "03031333801",
            "name": "ភោគ  កិច្ច"
        },
        {
            "barcode": "BBWS180206208",
            "dpc": "03031334001",
            "name": "ម៉ង់  សំអាល់"
        },
        {
            "barcode": "BBWS180206209",
            "dpc": "03031334101",
            "name": "រឿង  ណារ៉ុង"
        },
        {
            "barcode": "BBWS180206210",
            "dpc": "03031334201",
            "name": "សោ ថងឌី"
        },
        {
            "barcode": "BBWS180206211",
            "dpc": "03031334301",
            "name": "សុខ  សេង"
        },
        {
            "barcode": "BBWS180206212",
            "dpc": "03031334401",
            "name": "ស៊ិន  នឿប"
        },
        {
            "barcode": "BBWS180206213",
            "dpc": "03031334501",
            "name": "តាំង  លីហ៊ុន"
        },
        {
            "barcode": "BBWS180206214",
            "dpc": "03031334601",
            "name": "យ៉ែម  សាវឿត"
        },
        {
            "barcode": "BBWS180206215",
            "dpc": "03031331101",
            "name": "ម៉ា  គឹមជន"
        },
        {
            "barcode": "BBWS180206216",
            "dpc": "03031331001",
            "name": "យ៉ែម  សាវឿត"
        },
        {
            "barcode": "BBWS180206217",
            "dpc": "03031331501",
            "name": "ក្លិន  ឌី"
        },
        {
            "barcode": "BBWS180206218",
            "dpc": "03031331401",
            "name": "ថុង  មួយហុង"
        },
        {
            "barcode": "BBWS180206219",
            "dpc": "03031331301",
            "name": "សុខ  គឹមហាន"
        },
        {
            "barcode": "BBWS180206220",
            "dpc": "03031331201",
            "name": "ឡូ  ប៊ុនប៉ា"
        },
        {
            "barcode": "BBWS180206221",
            "dpc": "03031343801",
            "name": "ទុង  ភីរម្យ"
        },
        {
            "barcode": "BBWS180206222",
            "dpc": "03031343901",
            "name": "ឌុក  ឆាយ"
        },
        {
            "barcode": "BBWS180206223",
            "dpc": "03031344001",
            "name": "នង  គឹមស៊្រុន"
        },
        {
            "barcode": "BBWS180206224",
            "dpc": "03031343701",
            "name": "ទេព  សុវណ្ណ"
        },
        {
            "barcode": "BBWS180206225",
            "dpc": "03031343601",
            "name": "ប៊ូ   វុនណាវុឌ្ឍ"
        },
        {
            "barcode": "BBWS180206226",
            "dpc": "03031343501",
            "name": "ឌួង  ភក្តី"
        },
        {
            "barcode": "BBWS180206227",
            "dpc": "03031343401",
            "name": "ញាន   ផន"
        },
        {
            "barcode": "BBWS180206228",
            "dpc": "03031343301",
            "name": "យ៉ាន់  បូផៃ"
        },
        {
            "barcode": "BBWS180206229",
            "dpc": "03031343101",
            "name": "ម៉ម  ថងឌី"
        },
        {
            "barcode": "BBWS180206230",
            "dpc": "03031342801",
            "name": "សុន  សុគន្ធវ៉ារី"
        },
        {
            "barcode": "BBWS180206231",
            "dpc": "03031342701",
            "name": "ទេព  គឹមហេង"
        },
        {
            "barcode": "BBWS180206232",
            "dpc": "03031342601",
            "name": "ឌុច   ចំរ៉ាត់"
        },
        {
            "barcode": "BBWS180206233",
            "dpc": "03031342501",
            "name": "ឈឹម  ឆន"
        },
        {
            "barcode": "BBWS180206234",
            "dpc": "03031342301",
            "name": "សេង  ម៉េង"
        },
        {
            "barcode": "BBWS180206235",
            "dpc": "03031342201",
            "name": "ទុយ   នៅ"
        },
        {
            "barcode": "BBWS180206236",
            "dpc": "03031342101",
            "name": "មាស   ម៉ៅ"
        },
        {
            "barcode": "BBWS180206237",
            "dpc": "03031339301",
            "name": "លុម សួន"
        },
        {
            "barcode": "BBWS180206238",
            "dpc": "03031339201",
            "name": "ឡឹក ហាយ"
        },
        {
            "barcode": "BBWS180206239",
            "dpc": "03031340001",
            "name": "នង មាសរិទ្ធ"
        },
        {
            "barcode": "BBWS180206240",
            "dpc": "03031341301",
            "name": "ប៉ុក សាហ៊ុំ"
        },
        {
            "barcode": "BBWS180206241",
            "dpc": "03031341201",
            "name": "សេង ចន្ថា"
        },
        {
            "barcode": "BBWS180206242",
            "dpc": "03031341101",
            "name": "សៅ សារុន"
        },
        {
            "barcode": "BBWS180206243",
            "dpc": "03031341001",
            "name": "អ៊ិន សុខា"
        },
        {
            "barcode": "BBWS180206244",
            "dpc": "03031340901",
            "name": "ហែម សែម"
        },
        {
            "barcode": "BBWS180206245",
            "dpc": "03031340801",
            "name": "រ័ត្ន សូរិយា"
        },
        {
            "barcode": "BBWS180206246",
            "dpc": "03031340601",
            "name": "ង៉ា ជួង"
        },
        {
            "barcode": "BBWS180206247",
            "dpc": "03031340501",
            "name": "ភឿក គឹមលី"
        },
        {
            "barcode": "BBWS180206248",
            "dpc": "03031340401",
            "name": "យាំ យ៉ាន់"
        },
        {
            "barcode": "BBWS180206249",
            "dpc": "03031340301",
            "name": "ភឹម ផល្លា"
        },
        {
            "barcode": "BBWS180206250",
            "dpc": "03031340201",
            "name": "អាន សេរីវុធ"
        },
        {
            "barcode": "BBWS180206251",
            "dpc": "03031340101",
            "name": "ប៉ុក ច័ន្ទបូរី"
        },
        {
            "barcode": "BBWS180206252",
            "dpc": "03031339901",
            "name": "សួស សាវុន"
        },
        {
            "barcode": "BBWS180206253",
            "dpc": "03031339801",
            "name": "ឡុយ  ធិច"
        },
        {
            "barcode": "BBWS180206254",
            "dpc": "03031339501",
            "name": "វ៉ឹក រ៉ាន់"
        },
        {
            "barcode": "BBWS180206255",
            "dpc": "03031339601",
            "name": "តាន់ តូរ៉េ"
        },
        {
            "barcode": "BBWS180206256",
            "dpc": "03031339101",
            "name": "ញ៉ែម សានិត"
        },
        {
            "barcode": "BBWS180206257",
            "dpc": "03031338901",
            "name": "ហុក ហ៊ាត"
        },
        {
            "barcode": "BBWS180206258",
            "dpc": "03031339001",
            "name": "សូ ផេងគុណ"
        },
        {
            "barcode": "BBWS180206259",
            "dpc": "03031338801",
            "name": "ជា ហុង"
        },
        {
            "barcode": "BBWS180206260",
            "dpc": "03031338701",
            "name": "ផាន់ យី"
        },
        {
            "barcode": "BBWS180206261",
            "dpc": "03031338601",
            "name": "សាន សុផល"
        },
        {
            "barcode": "BBWS180206262",
            "dpc": "03031338501",
            "name": "យិន នូ"
        },
        {
            "barcode": "BBWS180206263",
            "dpc": "03031338401",
            "name": "ចៅ​ ចាន់"
        },
        {
            "barcode": "BBWS180206264",
            "dpc": "03031338201",
            "name": "ឃួន កុមារី"
        },
        {
            "barcode": "BBWS180206265",
            "dpc": "03031338001",
            "name": "វង្ស វីរៈ"
        },
        {
            "barcode": "BBWS180206266",
            "dpc": "03031337801",
            "name": "ពួន ភិរម្យ"
        },
        {
            "barcode": "BBWS180206267",
            "dpc": "03031337701",
            "name": "ឌី យ៉ុន ២"
        },
        {
            "barcode": "BBWS180206268",
            "dpc": "03031337601",
            "name": "សុខ ឈឿន"
        },
        {
            "barcode": "BBWS180206269",
            "dpc": "03031337501",
            "name": "ធូ សុគុន"
        },
        {
            "barcode": "BBWS180206270",
            "dpc": "03031337401",
            "name": "ហួយ សុង ហេង"
        },
        {
            "barcode": "BBWS180206271",
            "dpc": "03031337201",
            "name": "មៀច សំបូរ"
        },
        {
            "barcode": "BBWS180206272",
            "dpc": "03031337101",
            "name": "អ៊ុក សំអាន"
        },
        {
            "barcode": "BBWS180206273",
            "dpc": "03031336901",
            "name": "ជេត សំណាង"
        },
        {
            "barcode": "BBWS180206274",
            "dpc": "03031336801",
            "name": "ទូច រិទ្ធី"
        },
        {
            "barcode": "BBWS180206275",
            "dpc": "03031336701",
            "name": "កែវ សំអាត"
        },
        {
            "barcode": "BBWS180206276",
            "dpc": "03031336601",
            "name": "ញ៉ែម វណ្ណា"
        },
        {
            "barcode": "BBWS180206277",
            "dpc": "03031336401",
            "name": "កាន់ ណារិន"
        },
        {
            "barcode": "BBWS180206278",
            "dpc": "03031336301",
            "name": "កែវ សំអាង"
        },
        {
            "barcode": "BBWS180206279",
            "dpc": "03031336201",
            "name": "លី ជា"
        },
        {
            "barcode": "BBWS180206280",
            "dpc": "03031336101",
            "name": "គង់ ឆោម"
        },
        {
            "barcode": "BBWS180206281",
            "dpc": "03031336001",
            "name": "ភុំ ឆេន"
        },
        {
            "barcode": "BBWS180206282",
            "dpc": "03031335901",
            "name": "ប្រាក់ សុខែម"
        },
        {
            "barcode": "BBWS180206283",
            "dpc": "03031335801",
            "name": "ជុំ ចៅស៊ីវ៉ាន់"
        },
        {
            "barcode": "BBWS180206284",
            "dpc": "03031335701",
            "name": "ហុក សារ៉េត"
        },
        {
            "barcode": "BBWS180206285",
            "dpc": "03031335601",
            "name": "ព្រឹម សាលី"
        },
        {
            "barcode": "BBWS180206286",
            "dpc": "03031335501",
            "name": "ចុង ស៊ីន"
        },
        {
            "barcode": "BBWS180206287",
            "dpc": "03031335301",
            "name": "ស៊ិន សិត"
        },
        {
            "barcode": "BBWS180206288",
            "dpc": "03031335201",
            "name": "ជា ប៉"
        },
        {
            "barcode": "BBWS180206289",
            "dpc": "03031335101",
            "name": "ចែម សែត"
        },
        {
            "barcode": "BBWS180206290",
            "dpc": "03031335001",
            "name": "ហង់ផាន់ស៊ី"
        },
        {
            "barcode": "BBWS180206291",
            "dpc": "03031334901",
            "name": "ឈុន លីម"
        },
        {
            "barcode": "BBWS180206292",
            "dpc": "03031334801",
            "name": "គង់ ណាំ(លក់បាយ)"
        },
        {
            "barcode": "BBWS180206293",
            "dpc": "03031334701",
            "name": "លឹម ឡាយ(លក់បាយ)"
        },
        {
            "barcode": "BBWS180206294",
            "dpc": "03031301301",
            "name": "ឃឹម សាឡេះ"
        },
        {
            "barcode": "BBWS180206295",
            "dpc": "03031312001",
            "name": "រស់  ហឿន"
        },
        {
            "barcode": "BBWS180206296",
            "dpc": "03031312201",
            "name": "ញឹម  ញ៉ាន"
        },
        {
            "barcode": "BBWS180206297",
            "dpc": "03031319101",
            "name": "ម៉ោង  សំបូ"
        },
        {
            "barcode": "BBWS180206298",
            "dpc": "03031319201",
            "name": "បែន សំបូរ"
        },
        {
            "barcode": "BBWS180206299",
            "dpc": "03031319301",
            "name": "កៅ  គង់"
        },
        {
            "barcode": "BBWS180206300",
            "dpc": "03031319401",
            "name": "ត្រឹង  ច័ន្ទបូរី"
        },
        {
            "barcode": "BBWS180206301",
            "dpc": "03031319501",
            "name": "សឿន  ប៊ុនឡេង"
        },
        {
            "barcode": "BBWS180206302",
            "dpc": "03031319601",
            "name": "សុខ  សាលីន"
        },
        {
            "barcode": "BBWS180206303",
            "dpc": "03031329101",
            "name": "ឈៀង  ថុល"
        },
        {
            "barcode": "BBWS180206304",
            "dpc": "03031337301",
            "name": "តោ  ពិសិដ្ឋ"
        },
        {
            "barcode": "BBWS180206305",
            "dpc": "03031339701",
            "name": "អាង  ឈួង (បេឡាសំចៃ )"
        },
        {
            "barcode": "BBWS180206306",
            "dpc": "03031341401",
            "name": "សោម  សាឃីម"
        },
        {
            "barcode": "BBWS180206307",
            "dpc": "03031341501",
            "name": "គឹម ប៊ុនវណ្ណ"
        },
        {
            "barcode": "BBWS180206308",
            "dpc": "03031341601",
            "name": "ម៉ាន  យ៉ាន"
        },
        {
            "barcode": "BBWS180206309",
            "dpc": "03031341701",
            "name": "ម៉ៅ   ស៊ីថា"
        },
        {
            "barcode": "BBWS180206310",
            "dpc": "03031341801",
            "name": "លឹម  អូវ"
        },
        {
            "barcode": "BBWS180206311",
            "dpc": "03031341901",
            "name": "ម៉ៅ  មឿង"
        },
        {
            "barcode": "BBWS180206312",
            "dpc": "03031342001",
            "name": "ជេដ្ឋា   សោភ័ណ្ណរ៉ា"
        },
        {
            "barcode": "BBWS180206313",
            "dpc": "03031348001",
            "name": "គ្រុយ វាសនា"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
