let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=

    [
        {
            "barcode": "BBWS180208788",
            "dpc": "03031400101",
            "name": "អៀ ស្រ៊ុន ១"
        },
        {
            "barcode": "BBWS180208789",
            "dpc": "03031400201",
            "name": "អៀ ស្រ៊ុន ២"
        },
        {
            "barcode": "BBWS180208790",
            "dpc": "03031400301",
            "name": "ជា ប៊ុនរ័ត្ន"
        },
        {
            "barcode": "BBWS180208791",
            "dpc": "03031400401",
            "name": "ពិន ទី"
        },
        {
            "barcode": "BBWS180208792",
            "dpc": "03031400501",
            "name": "អូ អិមស៊ី ១"
        },
        {
            "barcode": "BBWS180208793",
            "dpc": "03031400601",
            "name": "អូ អិមស៊ី ២"
        },
        {
            "barcode": "BBWS180208794",
            "dpc": "03031400701",
            "name": "ម៉ៅ សុខលី ១"
        },
        {
            "barcode": "BBWS180208795",
            "dpc": "03031400801",
            "name": "វៀង  សុម៉ាន់ ១"
        },
        {
            "barcode": "BBWS180208796",
            "dpc": "03031400901",
            "name": "វៀង  សុម៉ាន់២"
        },
        {
            "barcode": "BBWS180208797",
            "dpc": "03031401001",
            "name": "រ៉េន រស់"
        },
        {
            "barcode": "BBWS180208798",
            "dpc": "03031401301",
            "name": "គឹម វ៉ាន់"
        },
        {
            "barcode": "BBWS180208799",
            "dpc": "03031401201",
            "name": "ម៉ៅ សុខលី ២"
        },
        {
            "barcode": "BBWS180208800",
            "dpc": "03031401101",
            "name": "សៀង ណាវី ១"
        },
        {
            "barcode": "BBWS180208801",
            "dpc": "03031401401",
            "name": "ឃុន ម៉េង"
        },
        {
            "barcode": "BBWS180208802",
            "dpc": "03031401501",
            "name": "សុខ ឃីម"
        },
        {
            "barcode": "BBWS180208803",
            "dpc": "03031401601",
            "name": "តាំង ប៊ុនអៀង"
        },
        {
            "barcode": "BBWS180208804",
            "dpc": "03031401701",
            "name": "ឡុង ខួយ"
        },
        {
            "barcode": "BBWS180208805",
            "dpc": "03031401801",
            "name": "តេង  ឈៀង"
        },
        {
            "barcode": "BBWS180208806",
            "dpc": "03031401901",
            "name": "អ៊ឹង វែង"
        },
        {
            "barcode": "BBWS180208807",
            "dpc": "03031402001",
            "name": "វ៉ា សុកអែល"
        },
        {
            "barcode": "BBWS180208808",
            "dpc": "03031402101",
            "name": "សំ ប៊ុនហ៊ិន"
        },
        {
            "barcode": "BBWS180208809",
            "dpc": "03031402201",
            "name": "គឹម ហាំង ២"
        },
        {
            "barcode": "BBWS180208810",
            "dpc": "03031402301",
            "name": "សឿម វណ្ណា"
        },
        {
            "barcode": "BBWS180208811",
            "dpc": "03031402401",
            "name": "យូ ចាន់ទី"
        },
        {
            "barcode": "BBWS180208812",
            "dpc": "03031402501",
            "name": "លី ហុង"
        },
        {
            "barcode": "BBWS180208813",
            "dpc": "03031402701",
            "name": "តាំង ឈុន"
        },
        {
            "barcode": "BBWS180208814",
            "dpc": "03031402801",
            "name": "ធី អ៊ីម"
        },
        {
            "barcode": "BBWS180208815",
            "dpc": "03031402901",
            "name": "គឹម  ជីវ"
        },
        {
            "barcode": "BBWS180208816",
            "dpc": "03031403001",
            "name": "តាំង ផេងហ៊ី"
        },
        {
            "barcode": "BBWS180208817",
            "dpc": "03031403101",
            "name": "ស៊ុន សុផា ១"
        },
        {
            "barcode": "BBWS180208818",
            "dpc": "03031403201",
            "name": "រ៉ុង ប៉ុក"
        },
        {
            "barcode": "BBWS180208819",
            "dpc": "03031409001",
            "name": "សំ  ចាន់រិទ្ធ"
        },
        {
            "barcode": "BBWS180208820",
            "dpc": "03031403301",
            "name": "ឡុង ប៊ុនថេង"
        },
        {
            "barcode": "BBWS180208821",
            "dpc": "03031403401",
            "name": "ចាន់ ម៉ាន់"
        },
        {
            "barcode": "BBWS180208822",
            "dpc": "03031403501",
            "name": "ស៊ា ឈាងហេង"
        },
        {
            "barcode": "BBWS180208823",
            "dpc": "03031403601",
            "name": "វៀង ហេន"
        },
        {
            "barcode": "BBWS180208824",
            "dpc": "03031406301",
            "name": "អេង  លី"
        },
        {
            "barcode": "BBWS180208825",
            "dpc": "03031406401",
            "name": "ឃុន  ហាក់ស្រេង"
        },
        {
            "barcode": "BBWS180208826",
            "dpc": "03031406501",
            "name": "គង់  ទី"
        },
        {
            "barcode": "BBWS180208827",
            "dpc": "03031406601",
            "name": "ឃុន  ហាក់ស្រេង"
        },
        {
            "barcode": "BBWS180208828",
            "dpc": "03031406701",
            "name": "ទូច  សុខនី"
        },
        {
            "barcode": "BBWS180208829",
            "dpc": "03031406801",
            "name": "ម៉ៅ  តេង"
        },
        {
            "barcode": "BBWS180208830",
            "dpc": "03031406901",
            "name": "ម៉ាញ ផាត"
        },
        {
            "barcode": "BBWS180208831",
            "dpc": "03031407001",
            "name": "ទឺ   ម៉ារ៉ាឌី"
        },
        {
            "barcode": "BBWS180208832",
            "dpc": "03031411501",
            "name": "ជុំ  រិន"
        },
        {
            "barcode": "BBWS180208833",
            "dpc": "03031422901",
            "name": "ប៉ូ  ប៊ុនថន"
        },
        {
            "barcode": "BBWS180208834",
            "dpc": "03031405701",
            "name": "កែវ វណ្ណា"
        },
        {
            "barcode": "BBWS180208835",
            "dpc": "03031405801",
            "name": "ថៃ សេង"
        },
        {
            "barcode": "BBWS180208836",
            "dpc": "03031405901",
            "name": "ប៊ុន វែង"
        },
        {
            "barcode": "BBWS180208837",
            "dpc": "03031406001",
            "name": "លី ឃាង"
        },
        {
            "barcode": "BBWS180208838",
            "dpc": "03031406101",
            "name": "នាង ម៉េងលាង"
        },
        {
            "barcode": "BBWS180208839",
            "dpc": "03031406201",
            "name": "ងិន  ចេង"
        },
        {
            "barcode": "BBWS180208840",
            "dpc": "03031404801",
            "name": "ហុក រ៉ាវុធ"
        },
        {
            "barcode": "BBWS180208841",
            "dpc": "03031404901",
            "name": "ហម ស៊ិនទៀង"
        },
        {
            "barcode": "BBWS180208842",
            "dpc": "03031405001",
            "name": "លេង ឈឺន"
        },
        {
            "barcode": "BBWS180208843",
            "dpc": "03031405101",
            "name": "សៀង ជៀងផេង"
        },
        {
            "barcode": "BBWS180208844",
            "dpc": "03031405201",
            "name": "អ៊ឹម ថុង"
        },
        {
            "barcode": "BBWS180208845",
            "dpc": "03031405301",
            "name": "ហៀ មី"
        },
        {
            "barcode": "BBWS180208846",
            "dpc": "03031411401",
            "name": "ឌុក  សាវើន"
        },
        {
            "barcode": "BBWS180208847",
            "dpc": "03031411301",
            "name": "ម៉ាន់  ជួយ"
        },
        {
            "barcode": "BBWS180208848",
            "dpc": "03031411201",
            "name": "គាំ  ប៊ីន"
        },
        {
            "barcode": "BBWS180208849",
            "dpc": "03031404101",
            "name": "តាំង ឈុន ១"
        },
        {
            "barcode": "BBWS180208850",
            "dpc": "03031404201",
            "name": "តាំង ឈុន ២"
        },
        {
            "barcode": "BBWS180208851",
            "dpc": "03031404401",
            "name": "តាំង ឈុន ៤"
        },
        {
            "barcode": "BBWS180208852",
            "dpc": "03031404501",
            "name": "តាំង ឈុន ៥"
        },
        {
            "barcode": "BBWS180208853",
            "dpc": "03031404601",
            "name": "តាំង ឈុន ៦"
        },
        {
            "barcode": "BBWS180208854",
            "dpc": "03031404701",
            "name": "តាំង ឈុន ៧"
        },
        {
            "barcode": "BBWS180208855",
            "dpc": "03031410301",
            "name": "យិន  សួរ"
        },
        {
            "barcode": "BBWS180208856",
            "dpc": "03031410201",
            "name": "ហ៊  ចាន់ថា"
        },
        {
            "barcode": "BBWS180208857",
            "dpc": "03031410101",
            "name": "ហុក  កុសល"
        },
        {
            "barcode": "BBWS180208858",
            "dpc": "03031410001",
            "name": "តាំង កាំង ៣"
        },
        {
            "barcode": "BBWS180208859",
            "dpc": "03031409901",
            "name": "តាំង កាំង ១"
        },
        {
            "barcode": "BBWS180208860",
            "dpc": "03031409801",
            "name": "តាំង  កាំង ១"
        },
        {
            "barcode": "BBWS180208861",
            "dpc": "03031410901",
            "name": "ហៃ  ណារ៉េត"
        },
        {
            "barcode": "BBWS180208862",
            "dpc": "03031410801",
            "name": "សរ  ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "BBWS180208863",
            "dpc": "03031410701",
            "name": "អ៊ុច   សុថា"
        },
        {
            "barcode": "BBWS180208864",
            "dpc": "03031410601",
            "name": "ធុច  រ៉ា"
        },
        {
            "barcode": "BBWS180208865",
            "dpc": "03031410501",
            "name": "ស្បោង   ចាន់ថុល"
        },
        {
            "barcode": "BBWS180208866",
            "dpc": "03031410401",
            "name": "លី   ប៊ុនហេង"
        },
        {
            "barcode": "BBWS180208867",
            "dpc": "03031411101",
            "name": "អ៊ី  ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "BBWS180208868",
            "dpc": "03031408601",
            "name": "តាំង  បាក់ស្រេង"
        },
        {
            "barcode": "BBWS180208869",
            "dpc": "03031408501",
            "name": "លាង  ហាវ"
        },
        {
            "barcode": "BBWS180208870",
            "dpc": "03031408401",
            "name": "រ៉ុន  រ៉នី"
        },
        {
            "barcode": "BBWS180208871",
            "dpc": "03031408201",
            "name": "ចៅ  កំហ្វាន់"
        },
        {
            "barcode": "BBWS180208872",
            "dpc": "03031408301",
            "name": "តាំង  កាំង"
        },
        {
            "barcode": "BBWS180208873",
            "dpc": "03031408101",
            "name": "ស  កាន"
        },
        {
            "barcode": "BBWS180208874",
            "dpc": "03031408001",
            "name": "លឹម  តុង"
        },
        {
            "barcode": "BBWS180208875",
            "dpc": "03031409701",
            "name": "ស៊ូ  អារ៉ាហ្វាត"
        },
        {
            "barcode": "BBWS180208876",
            "dpc": "03031409601",
            "name": "ឯល  ការីម"
        },
        {
            "barcode": "BBWS180208877",
            "dpc": "03031409401",
            "name": "ស៊ុន  សុផា"
        },
        {
            "barcode": "BBWS180208878",
            "dpc": "03031409301",
            "name": "ថៃ  និមល"
        },
        {
            "barcode": "BBWS180208879",
            "dpc": "03031409201",
            "name": "សំ  ហា"
        },
        {
            "barcode": "BBWS180208880",
            "dpc": "03031409101",
            "name": "នៅ  រ៉ាដេត"
        },
        {
            "barcode": "BBWS180208881",
            "dpc": "03031408801",
            "name": "សេង  ស្រីពេជ្រ"
        },
        {
            "barcode": "BBWS180208882",
            "dpc": "03031403701",
            "name": "ពឹង គឹមផេង"
        },
        {
            "barcode": "BBWS180208883",
            "dpc": "03031403801",
            "name": "អេង ឋារ័ត្ន"
        },
        {
            "barcode": "BBWS180208884",
            "dpc": "03031403901",
            "name": "ស៊ូ វ៉ាន់ធី"
        },
        {
            "barcode": "BBWS180208885",
            "dpc": "03031404001",
            "name": "យិន ចិត្រា"
        },
        {
            "barcode": "BBWS180208886",
            "dpc": "03031407901",
            "name": "តាំង  គៀងបុង"
        },
        {
            "barcode": "BBWS180208887",
            "dpc": "03031407801",
            "name": "ណា  រ៉េត"
        },
        {
            "barcode": "BBWS180208888",
            "dpc": "03031407701",
            "name": "ហេង ឈុនផេង ១"
        },
        {
            "barcode": "BBWS180208889",
            "dpc": "03031407601",
            "name": "ហេង  ឈុនផេង ១"
        },
        {
            "barcode": "BBWS180208890",
            "dpc": "03031407501",
            "name": "ជា  ស៊ឺ"
        },
        {
            "barcode": "BBWS180208891",
            "dpc": "03031407401",
            "name": "ហ៊ឺ  សេង"
        },
        {
            "barcode": "BBWS180208892",
            "dpc": "03031407301",
            "name": "យស់  ពៅ"
        },
        {
            "barcode": "BBWS180208893",
            "dpc": "03031408901",
            "name": "លឺន  សារ៉ា"
        },
        {
            "barcode": "BBWS180208894",
            "dpc": "03031411801",
            "name": "ស៊ីវ  ហក់"
        },
        {
            "barcode": "BBWS180208895",
            "dpc": "03031411701",
            "name": "ថោង  ឡាយស្រេង"
        },
        {
            "barcode": "BBWS180208896",
            "dpc": "03031411601",
            "name": "ហ៊ុយ  ស៊ីម ២"
        },
        {
            "barcode": "BBWS180208897",
            "dpc": "03031411901",
            "name": "សៀង   គៀង ២"
        },
        {
            "barcode": "BBWS180208898",
            "dpc": "03031412001",
            "name": "ឈីវ   គី ២"
        },
        {
            "barcode": "BBWS180208899",
            "dpc": "03031412101",
            "name": "ប៊ុន  រ៉ាស៊ី"
        },
        {
            "barcode": "BBWS180208900",
            "dpc": "03031412201",
            "name": "អ៊ុយ  ស៊ីម"
        },
        {
            "barcode": "BBWS180208901",
            "dpc": "03031412301",
            "name": "ធីវ  ណារិន"
        },
        {
            "barcode": "BBWS180208902",
            "dpc": "03031412501",
            "name": "អន  ភិរម្យ"
        },
        {
            "barcode": "BBWS180208903",
            "dpc": "03031412601",
            "name": "យ៉ាំ  ឃួង"
        },
        {
            "barcode": "BBWS180208904",
            "dpc": "03031412701",
            "name": "ឌុក  ឆាយ"
        },
        {
            "barcode": "BBWS180208905",
            "dpc": "03031412801",
            "name": "ស៊ិក  សុរ័ត្នន៍"
        },
        {
            "barcode": "BBWS180208906",
            "dpc": "03031412901",
            "name": "ពិន  សាវឿន"
        },
        {
            "barcode": "BBWS180208907",
            "dpc": "03031413001",
            "name": "ចាំង  គីមឹអ៊ាង"
        },
        {
            "barcode": "BBWS180208908",
            "dpc": "03031413201",
            "name": "យិន  វុនហាន ១"
        },
        {
            "barcode": "BBWS180208909",
            "dpc": "03031413301",
            "name": "ស៊្រុន"
        },
        {
            "barcode": "BBWS180208910",
            "dpc": "03031413401",
            "name": "ហៃ  សុភ័ក្រ"
        },
        {
            "barcode": "BBWS180208911",
            "dpc": "03031413501",
            "name": "គឹម  ហេង"
        },
        {
            "barcode": "BBWS180208912",
            "dpc": "03031413601",
            "name": "ឌុក  ឆវេត"
        },
        {
            "barcode": "BBWS180208913",
            "dpc": "03031413701",
            "name": "ប្រាក់  សារីម"
        },
        {
            "barcode": "BBWS180208914",
            "dpc": "03031413801",
            "name": "សេក  សុគន្ធ"
        },
        {
            "barcode": "BBWS180208915",
            "dpc": "03031413901",
            "name": "នីវ  ណារិន"
        },
        {
            "barcode": "BBWS180208916",
            "dpc": "03031414001",
            "name": "ផែ  ណាំជីវ"
        },
        {
            "barcode": "BBWS180208917",
            "dpc": "03031414101",
            "name": "យាំ  តាំងចាប់"
        },
        {
            "barcode": "BBWS180208918",
            "dpc": "03031414201",
            "name": "យិន  វុនហាន ២"
        },
        {
            "barcode": "BBWS180208919",
            "dpc": "03031414301",
            "name": "ហេង  រ៉ា"
        },
        {
            "barcode": "BBWS180208920",
            "dpc": "03031414401",
            "name": "ឆាន់  ភុយ"
        },
        {
            "barcode": "BBWS180208921",
            "dpc": "03031414501",
            "name": "ម៉ៅ  សុខលី ៣"
        },
        {
            "barcode": "BBWS180208922",
            "dpc": "03031414601",
            "name": "ស៊ីន  ឃុន ១"
        },
        {
            "barcode": "BBWS180208923",
            "dpc": "03031414701",
            "name": "ស៊ីន ឃុន ១"
        },
        {
            "barcode": "BBWS180208924",
            "dpc": "03031414801",
            "name": "សូ  ឌឿន"
        },
        {
            "barcode": "BBWS180208925",
            "dpc": "03031414901",
            "name": "តាំង  បាក់ស្រេង"
        },
        {
            "barcode": "BBWS180208926",
            "dpc": "03031415001",
            "name": "តាំង បាក់ស្រេង ១"
        },
        {
            "barcode": "BBWS180208927",
            "dpc": "03031415101",
            "name": "គុយ  ម៉េង ២"
        },
        {
            "barcode": "BBWS180208928",
            "dpc": "03031415201",
            "name": "តាំង  កាំង ១"
        },
        {
            "barcode": "BBWS180208929",
            "dpc": "03031415301",
            "name": "តាំង កាំង ២"
        },
        {
            "barcode": "BBWS180208930",
            "dpc": "03031415401",
            "name": "តាំង កាំង លក់បារី"
        },
        {
            "barcode": "BBWS180208931",
            "dpc": "03031415501",
            "name": "អ៊ុក  សារ៉េត"
        },
        {
            "barcode": "BBWS180208932",
            "dpc": "03031415601",
            "name": "ឈីវ  កិរិយា"
        },
        {
            "barcode": "BBWS180208933",
            "dpc": "03031415701",
            "name": "លឹម  ហួរ ១"
        },
        {
            "barcode": "BBWS180208934",
            "dpc": "03031415801",
            "name": "លឹម ហួរ ១"
        },
        {
            "barcode": "BBWS180208935",
            "dpc": "03031415901",
            "name": "ជឺ  ឈៀង"
        },
        {
            "barcode": "BBWS180208936",
            "dpc": "03031416001",
            "name": "សៅ  រិន"
        },
        {
            "barcode": "BBWS180208937",
            "dpc": "03031416101",
            "name": "អ៊ឹម  សុថូល"
        },
        {
            "barcode": "BBWS180208938",
            "dpc": "03031416201",
            "name": "ហេង (លក់មាស )"
        },
        {
            "barcode": "BBWS180208939",
            "dpc": "03031416301",
            "name": "លី  វ៉ាន់នី"
        },
        {
            "barcode": "BBWS180208940",
            "dpc": "03031416401",
            "name": "លូ  ហៀង"
        },
        {
            "barcode": "BBWS180208941",
            "dpc": "03031416501",
            "name": "ហាំង  ឆែ"
        },
        {
            "barcode": "BBWS180208942",
            "dpc": "03031416601",
            "name": "ថុង  ម៉េង ២"
        },
        {
            "barcode": "BBWS180208943",
            "dpc": "03031416801",
            "name": "តាំង  ប៊ូ"
        },
        {
            "barcode": "BBWS180208944",
            "dpc": "03031416701",
            "name": "លាង  ហាក់"
        },
        {
            "barcode": "BBWS180208945",
            "dpc": "03031416901",
            "name": "លី   មាន (លក់អង្ករ)"
        },
        {
            "barcode": "BBWS180208946",
            "dpc": "03031417001",
            "name": "លឹម  ឃុន"
        },
        {
            "barcode": "BBWS180208947",
            "dpc": "03031417101",
            "name": "លី  មាន ( លី  ស្រី)"
        },
        {
            "barcode": "BBWS180208948",
            "dpc": "03031417201",
            "name": "លី លុយ"
        },
        {
            "barcode": "BBWS180208949",
            "dpc": "03031417301",
            "name": "ថុង  ម៉ី"
        },
        {
            "barcode": "BBWS180208950",
            "dpc": "03031417401",
            "name": "សុខ  គង់"
        },
        {
            "barcode": "BBWS180208951",
            "dpc": "03031417501",
            "name": "អ៊ុក  ឃុន"
        },
        {
            "barcode": "BBWS180208952",
            "dpc": "03031417601",
            "name": "ពឹង  ឆាយគៀង"
        },
        {
            "barcode": "BBWS180208953",
            "dpc": "03031417701",
            "name": "ឈៀង  សុវណ្ណា"
        },
        {
            "barcode": "BBWS180208954",
            "dpc": "03031417801",
            "name": "អ៊ឹង  នីតា"
        },
        {
            "barcode": "BBWS180208955",
            "dpc": "03031417901",
            "name": "ពេជ្រ  ថុល"
        },
        {
            "barcode": "BBWS180208956",
            "dpc": "03031418001",
            "name": "ឃឹម  ឡេង"
        },
        {
            "barcode": "BBWS180208957",
            "dpc": "03031418201",
            "name": "ឌិន  ប៊ុណ្ណា"
        },
        {
            "barcode": "BBWS180208958",
            "dpc": "03031418301",
            "name": "តាំង  ឈុន ២"
        },
        {
            "barcode": "BBWS180208959",
            "dpc": "03031418401",
            "name": "តាំង  ឈុន ៧"
        },
        {
            "barcode": "BBWS180208960",
            "dpc": "03031418501",
            "name": "គង់  សុភា"
        },
        {
            "barcode": "BBWS180208961",
            "dpc": "03031418601",
            "name": "យាយ  កែវ"
        },
        {
            "barcode": "BBWS180208962",
            "dpc": "03031418701",
            "name": "ប៊ុន  សួរ"
        },
        {
            "barcode": "BBWS180208963",
            "dpc": "03031418801",
            "name": "ពូ  ពេជ្រ"
        },
        {
            "barcode": "BBWS180208964",
            "dpc": "03031422801",
            "name": "ទួន  ភាព"
        },
        {
            "barcode": "BBWS180208965",
            "dpc": "03031418901",
            "name": "អ៊ឹង  ប៊ីហាប់"
        },
        {
            "barcode": "BBWS180208966",
            "dpc": "03031419001",
            "name": "ឃូ  ប៉ាវ"
        },
        {
            "barcode": "BBWS180208967",
            "dpc": "03031419101",
            "name": "ណយ  សាន់"
        },
        {
            "barcode": "BBWS180208968",
            "dpc": "03031419201",
            "name": "សា  វ៉ាន់"
        },
        {
            "barcode": "BBWS180208969",
            "dpc": "03031419301",
            "name": "សុក  ឡាយ"
        },
        {
            "barcode": "BBWS180208970",
            "dpc": "03031419401",
            "name": "គឹម  ទី"
        },
        {
            "barcode": "BBWS180208971",
            "dpc": "03031419501",
            "name": "លៀង  គឹមឡី"
        },
        {
            "barcode": "BBWS180208972",
            "dpc": "03031419601",
            "name": "កាំង សៀក"
        },
        {
            "barcode": "BBWS180208973",
            "dpc": "03031419701",
            "name": "ពឹង  លីវ"
        },
        {
            "barcode": "BBWS180208974",
            "dpc": "03031419801",
            "name": "ស៊ាន  សាវឿន"
        },
        {
            "barcode": "BBWS180208975",
            "dpc": "03031419901",
            "name": "គុជ  កល្យា"
        },
        {
            "barcode": "BBWS180208976",
            "dpc": "03031420001",
            "name": "លឹម  ជា"
        },
        {
            "barcode": "BBWS180208977",
            "dpc": "03031420101",
            "name": "កាំង  លី"
        },
        {
            "barcode": "BBWS180208978",
            "dpc": "03031420201",
            "name": "ឈួន  ប៉ា"
        },
        {
            "barcode": "BBWS180208979",
            "dpc": "03031420301",
            "name": "ហម សំបូរ"
        },
        {
            "barcode": "BBWS180208980",
            "dpc": "03031420401",
            "name": "ជុត  វ៉ារ៉ុង"
        },
        {
            "barcode": "BBWS180208981",
            "dpc": "03031420501",
            "name": "លឹម  ឃុន"
        },
        {
            "barcode": "BBWS180208982",
            "dpc": "03031420701",
            "name": "ព្រំ  ណូ"
        },
        {
            "barcode": "BBWS180208983",
            "dpc": "03031420801",
            "name": "តោ  សាលីន"
        },
        {
            "barcode": "BBWS180208984",
            "dpc": "03031420901",
            "name": "តាំង ឈុន ៥"
        },
        {
            "barcode": "BBWS180208985",
            "dpc": "03031421001",
            "name": "តាង  ឈុន (លក់មាស)"
        },
        {
            "barcode": "BBWS180208986",
            "dpc": "03031421101",
            "name": "ភោគ  សុភី"
        },
        {
            "barcode": "BBWS180208987",
            "dpc": "03031421301",
            "name": "ចាន់  ហេង"
        },
        {
            "barcode": "BBWS180208988",
            "dpc": "03031421401",
            "name": "តាំង ឈុន១"
        },
        {
            "barcode": "BBWS180208989",
            "dpc": "03031421601",
            "name": "សេង  រ៉ាស៊ីន"
        },
        {
            "barcode": "BBWS180208990",
            "dpc": "03031421701",
            "name": "ទ្រី  ថា"
        },
        {
            "barcode": "BBWS180208991",
            "dpc": "03031421801",
            "name": "យឹម  វ៉ិត ១"
        },
        {
            "barcode": "BBWS180208992",
            "dpc": "03031421901",
            "name": "យឹម  វ៉ិត ២"
        },
        {
            "barcode": "BBWS180208993",
            "dpc": "03031422001",
            "name": "ជូរ  គង់"
        },
        {
            "barcode": "BBWS180208994",
            "dpc": "03031422201",
            "name": "លី  មាន"
        },
        {
            "barcode": "BBWS180208995",
            "dpc": "03031422101",
            "name": "លី វែង"
        },
        {
            "barcode": "BBWS180208996",
            "dpc": "03031422501",
            "name": "ឈី  គី ១"
        },
        {
            "barcode": "BBWS180208997",
            "dpc": "03031422601",
            "name": "កែវ  ចំរើន"
        },
        {
            "barcode": "BBWS180208998",
            "dpc": "03031422701",
            "name": "ឈ  គង់ទី"
        },
        {
            "barcode": "BBWS180208999",
            "dpc": "03031426801",
            "name": "ង៉ែត គី"
        },
        {
            "barcode": "BBWS180209000",
            "dpc": "03031426901",
            "name": "ខូវ ស៊ាងហុង"
        },
        {
            "barcode": "BBWS180209001",
            "dpc": "03031427001",
            "name": "អ៊ុក ចឹក"
        },
        {
            "barcode": "BBWS180209002",
            "dpc": "03031427101",
            "name": "ខេង ធីតា"
        },
        {
            "barcode": "BBWS180209003",
            "dpc": "03031427201",
            "name": "ឃុត ចន្ថា"
        },
        {
            "barcode": "BBWS180209004",
            "dpc": "03031427401",
            "name": "សម ស៊ុននី"
        },
        {
            "barcode": "BBWS180209005",
            "dpc": "03031427501",
            "name": "ទ្រឿង រដ្ឋរិទ្ធី"
        },
        {
            "barcode": "BBWS180209006",
            "dpc": "03031427601",
            "name": "អ៊ុក វង្ស ១"
        },
        {
            "barcode": "BBWS180209007",
            "dpc": "03031427701",
            "name": "អ៊ុក វង្ស ២"
        },
        {
            "barcode": "BBWS180209008",
            "dpc": "03031427801",
            "name": "អ៊ុក វង្ស ៣"
        },
        {
            "barcode": "BBWS180209009",
            "dpc": "03031427901",
            "name": "អ៊ុក វង្ស ៤"
        },
        {
            "barcode": "BBWS180209010",
            "dpc": "03031428001",
            "name": "ថាំង សុវណ្ណ"
        },
        {
            "barcode": "BBWS180209011",
            "dpc": "03031428101",
            "name": "ហេង ទុយ"
        },
        {
            "barcode": "BBWS180209012",
            "dpc": "03031428301",
            "name": "ឆឺន អ៊ីណន"
        },
        {
            "barcode": "BBWS180209013",
            "dpc": "03031428401",
            "name": "ជាង មុយ"
        },
        {
            "barcode": "BBWS180209014",
            "dpc": "03031428501",
            "name": "ស៊ឹម សារ៉ាត់ ១"
        },
        {
            "barcode": "BBWS180209015",
            "dpc": "03031428601",
            "name": "នក់ ហ្វួយ"
        },
        {
            "barcode": "BBWS180209016",
            "dpc": "03031428701",
            "name": "ង៉ែត វិភូ ១"
        },
        {
            "barcode": "BBWS180209017",
            "dpc": "03031428801",
            "name": "ស៊ឹម សារ៉ាត់ ២"
        },
        {
            "barcode": "BBWS180209018",
            "dpc": "03031428901",
            "name": "អ៊ុន ផល្លា"
        },
        {
            "barcode": "BBWS180209019",
            "dpc": "03031432701",
            "name": "ឯក ស៊ីនាង"
        },
        {
            "barcode": "BBWS180209020",
            "dpc": "03031429001",
            "name": "ទុយ សុខុន ១"
        },
        {
            "barcode": "BBWS180209021",
            "dpc": "03031429101",
            "name": "ទុយ សុខុន ២"
        },
        {
            "barcode": "BBWS180209022",
            "dpc": "03031429201",
            "name": "ជា ចាន់ខន ១"
        },
        {
            "barcode": "BBWS180209023",
            "dpc": "03031429301",
            "name": "អ៊ុក ព្រំ"
        },
        {
            "barcode": "BBWS180209024",
            "dpc": "03031429401",
            "name": "ជា ចាន់ខន ២"
        },
        {
            "barcode": "BBWS180209025",
            "dpc": "03031429501",
            "name": "យ៉ង់ ផាន"
        },
        {
            "barcode": "BBWS180209026",
            "dpc": "03031429601",
            "name": "ទេព សារ៉ាត់"
        },
        {
            "barcode": "BBWS180209027",
            "dpc": "03031429701",
            "name": "ទួន ស៊ុនលី"
        },
        {
            "barcode": "BBWS180209028",
            "dpc": "03031426001",
            "name": "ទូ ថាំង ១"
        },
        {
            "barcode": "BBWS180209029",
            "dpc": "03031426101",
            "name": "ទូ ថាំង ២"
        },
        {
            "barcode": "BBWS180209030",
            "dpc": "03031426201",
            "name": "ភួយ សណារ័ត្ន"
        },
        {
            "barcode": "BBWS180209031",
            "dpc": "03031426301",
            "name": "ជុំ ចាន់ដារិទ្ធ"
        },
        {
            "barcode": "BBWS180209032",
            "dpc": "03031426401",
            "name": "សូ សុគុណ"
        },
        {
            "barcode": "BBWS180209033",
            "dpc": "03031426601",
            "name": "គឹម សាភិន"
        },
        {
            "barcode": "BBWS180209034",
            "dpc": "03031426701",
            "name": "ម៉ៅ ឆវឿង"
        },
        {
            "barcode": "BBWS180209035",
            "dpc": "03031425901",
            "name": "ជា ម៉ៅ"
        },
        {
            "barcode": "BBWS180209036",
            "dpc": "03031425801",
            "name": "ប៉ែន ឆាលី"
        },
        {
            "barcode": "BBWS180209037",
            "dpc": "03031425701",
            "name": "សុខ សារ៉េត"
        },
        {
            "barcode": "BBWS180209038",
            "dpc": "03031425601",
            "name": "នីវ ណារិន"
        },
        {
            "barcode": "BBWS180209039",
            "dpc": "03031425501",
            "name": "ជា ឆវិល័យ"
        },
        {
            "barcode": "BBWS180209040",
            "dpc": "03031425401",
            "name": "ឡឹម សារិន"
        },
        {
            "barcode": "BBWS180209041",
            "dpc": "03031433401",
            "name": "ឌួង សាក់"
        },
        {
            "barcode": "BBWS180209042",
            "dpc": "03031433301",
            "name": "សួន សុខុម"
        },
        {
            "barcode": "BBWS180209043",
            "dpc": "03031433201",
            "name": "ហេង កង"
        },
        {
            "barcode": "BBWS180209044",
            "dpc": "03031433101",
            "name": "ប៊ុន គង់"
        },
        {
            "barcode": "BBWS180209045",
            "dpc": "03031433001",
            "name": "លី ជា"
        },
        {
            "barcode": "BBWS180209046",
            "dpc": "03031432901",
            "name": "សាយ សុខខេង"
        },
        {
            "barcode": "BBWS180209047",
            "dpc": "03031432501",
            "name": "ឃុន មុំ"
        },
        {
            "barcode": "BBWS180209048",
            "dpc": "03031432401",
            "name": "ឃុន ឃីម"
        },
        {
            "barcode": "BBWS180209049",
            "dpc": "03031432201",
            "name": "កោ គឹមហៃ"
        },
        {
            "barcode": "BBWS180209050",
            "dpc": "03031432101",
            "name": "ឈរ ជាណាំង"
        },
        {
            "barcode": "BBWS180209051",
            "dpc": "03031432001",
            "name": "សេក សុគន្ធ"
        },
        {
            "barcode": "BBWS180209052",
            "dpc": "03031431901",
            "name": "ផាន់ សុភាព"
        },
        {
            "barcode": "BBWS180209053",
            "dpc": "03031430101",
            "name": "ឆុង ឈឿត"
        },
        {
            "barcode": "BBWS180209054",
            "dpc": "03031430001",
            "name": "ណុប ងិន"
        },
        {
            "barcode": "BBWS180209055",
            "dpc": "03031429901",
            "name": "សោ សុទ្ធធឿន"
        },
        {
            "barcode": "BBWS180209056",
            "dpc": "03031429801",
            "name": "ការិ.សុខាភិបាលស្រុក"
        },
        {
            "barcode": "BBWS180209057",
            "dpc": "03031430201",
            "name": "ង៉ូវ លីផេង"
        },
        {
            "barcode": "BBWS180209058",
            "dpc": "03031430301",
            "name": "ចេ ចៀក"
        },
        {
            "barcode": "BBWS180209059",
            "dpc": "03031430401",
            "name": "នង ឃាង"
        },
        {
            "barcode": "BBWS180209060",
            "dpc": "03031430501",
            "name": "ស៊ុំ   ផន"
        },
        {
            "barcode": "BBWS180209061",
            "dpc": "03031430601",
            "name": "ឈួ សុធា"
        },
        {
            "barcode": "BBWS180209062",
            "dpc": "03031430701",
            "name": "លន់ ស៊ីន"
        },
        {
            "barcode": "BBWS180209063",
            "dpc": "03031430801",
            "name": "គឹម ហួតហេង"
        },
        {
            "barcode": "BBWS180209064",
            "dpc": "03031430901",
            "name": "ឈុយ លី"
        },
        {
            "barcode": "BBWS180209065",
            "dpc": "03031431001",
            "name": "ខែក សៀង"
        },
        {
            "barcode": "BBWS180209066",
            "dpc": "03031431701",
            "name": "ជាង លាប"
        },
        {
            "barcode": "BBWS180209067",
            "dpc": "03031431301",
            "name": "តាន់ អ៊ីម"
        },
        {
            "barcode": "BBWS180209068",
            "dpc": "03031431101",
            "name": "អេង ឌាំង"
        },
        {
            "barcode": "BBWS180209069",
            "dpc": "03031431801",
            "name": "លី ឆង៉ូវ"
        },
        {
            "barcode": "BBWS180209070",
            "dpc": "03031407101",
            "name": "ជា ពៅ"
        },
        {
            "barcode": "BBWS180209071",
            "dpc": "03031440001",
            "name": "ជូ​ ផេង"
        },
        {
            "barcode": "BBWS180209072",
            "dpc": "03031439901",
            "name": "សុខ  ម៉េង"
        },
        {
            "barcode": "BBWS180209073",
            "dpc": "03031439701",
            "name": "គង់  ស៊ីណា"
        },
        {
            "barcode": "BBWS180209074",
            "dpc": "03031439601",
            "name": "ធាម  ជឹង"
        },
        {
            "barcode": "BBWS180209075",
            "dpc": "03031439501",
            "name": "សេង  សុរ័ត្ន"
        },
        {
            "barcode": "BBWS180209076",
            "dpc": "03031439401",
            "name": "គ្រិន  ញ៉ុង"
        },
        {
            "barcode": "BBWS180209077",
            "dpc": "03031439201",
            "name": "ងូវ  សៀង"
        },
        {
            "barcode": "BBWS180209078",
            "dpc": "03031439001",
            "name": "លេង  ហុង"
        },
        {
            "barcode": "BBWS180209079",
            "dpc": "03031438801",
            "name": "ជុំ  សុណ្ណារិទ្ធ ២"
        },
        {
            "barcode": "BBWS180209080",
            "dpc": "03031425301",
            "name": "ខូវ លាងម៉េង"
        },
        {
            "barcode": "BBWS180209081",
            "dpc": "03031425201",
            "name": "គឹម រិន"
        },
        {
            "barcode": "BBWS180209082",
            "dpc": "03031425101",
            "name": "សៀវ ច័ន្ទមនោរម្យ"
        },
        {
            "barcode": "BBWS180209083",
            "dpc": "03031425001",
            "name": "ឡុង ស្រ៊ុន"
        },
        {
            "barcode": "BBWS180209084",
            "dpc": "03031424901",
            "name": "សៀវ បូផេង"
        },
        {
            "barcode": "BBWS180209085",
            "dpc": "03031424801",
            "name": "គិន យុន"
        },
        {
            "barcode": "BBWS180209086",
            "dpc": "03031424701",
            "name": "ចាន់ សុន"
        },
        {
            "barcode": "BBWS180209087",
            "dpc": "03031424601",
            "name": "ស៊ិន សោភា"
        },
        {
            "barcode": "BBWS180209088",
            "dpc": "03031424501",
            "name": "លឹម គឹមអ៊ី"
        },
        {
            "barcode": "BBWS180209089",
            "dpc": "03031424401",
            "name": "ម៉ី  សំណាង"
        },
        {
            "barcode": "BBWS180209090",
            "dpc": "03031424301",
            "name": "ជា សុគន្ទ ១"
        },
        {
            "barcode": "BBWS180209091",
            "dpc": "03031424201",
            "name": "យឿន យៀន"
        },
        {
            "barcode": "BBWS180209092",
            "dpc": "03031424101",
            "name": "ជិម ឡាវស្រ៊ុន"
        },
        {
            "barcode": "BBWS180209093",
            "dpc": "03031423901",
            "name": "តាំង ហេង"
        },
        {
            "barcode": "BBWS180209094",
            "dpc": "03031423801",
            "name": "ម៉ម សេសាន"
        },
        {
            "barcode": "BBWS180209095",
            "dpc": "03031423701",
            "name": "វឿង ប៊ុតរេត"
        },
        {
            "barcode": "BBWS180209096",
            "dpc": "03031423501",
            "name": "ហួត សំណាង"
        },
        {
            "barcode": "BBWS180209097",
            "dpc": "03031423401",
            "name": "ជួញ សឆៃ"
        },
        {
            "barcode": "BBWS180209098",
            "dpc": "03031423301",
            "name": "ឯល សយ"
        },
        {
            "barcode": "BBWS180209099",
            "dpc": "03031423201",
            "name": "ព្រំ វណ្ណា"
        },
        {
            "barcode": "BBWS180209100",
            "dpc": "03031423101",
            "name": "ស៊ីវ សារឿន"
        },
        {
            "barcode": "BBWS180209101",
            "dpc": "03031423001",
            "name": "គុយ ម៉េង"
        },
        {
            "barcode": "BBWS180209102",
            "dpc": "03031438001",
            "name": "ផល មី"
        },
        {
            "barcode": "BBWS180209103",
            "dpc": "03031437901",
            "name": "តាត នី"
        },
        {
            "barcode": "BBWS180209104",
            "dpc": "03031437801",
            "name": "អិ សូញ"
        },
        {
            "barcode": "BBWS180209105",
            "dpc": "03031437701",
            "name": "ព្រំ សេរី"
        },
        {
            "barcode": "BBWS180209106",
            "dpc": "03031437601",
            "name": "លឹម ប៉េងឃីម"
        },
        {
            "barcode": "BBWS180209107",
            "dpc": "03031437501",
            "name": "ហាក់ ឡេង"
        },
        {
            "barcode": "BBWS180209108",
            "dpc": "03031437401",
            "name": "អៀ គឹមហ៊ុន១"
        },
        {
            "barcode": "BBWS180209109",
            "dpc": "03031437301",
            "name": "ឈួរ គី"
        },
        {
            "barcode": "BBWS180209110",
            "dpc": "03031437201",
            "name": "អ៊ឹម ផូ"
        },
        {
            "barcode": "BBWS180209111",
            "dpc": "03031437101",
            "name": "និន ណុន"
        },
        {
            "barcode": "BBWS180209112",
            "dpc": "03031437001",
            "name": "អ៊ឹង គង់"
        },
        {
            "barcode": "BBWS180209113",
            "dpc": "03031436901",
            "name": "រុន រ៉ានី"
        },
        {
            "barcode": "BBWS180209114",
            "dpc": "03031436801",
            "name": "ជាង គឿ"
        },
        {
            "barcode": "BBWS180209115",
            "dpc": "03031436601",
            "name": "ងួន តូ"
        },
        {
            "barcode": "BBWS180209116",
            "dpc": "03031436401",
            "name": "ង៉ោ ឆេង"
        },
        {
            "barcode": "BBWS180209117",
            "dpc": "03031436301",
            "name": "គូ ស៊ីថា"
        },
        {
            "barcode": "BBWS180209118",
            "dpc": "03031436201",
            "name": "តុង សេង"
        },
        {
            "barcode": "BBWS180209119",
            "dpc": "03031436101",
            "name": "សុខ ឡេង"
        },
        {
            "barcode": "BBWS180209120",
            "dpc": "03031436001",
            "name": "សរ ប៊ុនរិទ្ធិ"
        },
        {
            "barcode": "BBWS180209121",
            "dpc": "03031434301",
            "name": "លីវ ធារ៉ា"
        },
        {
            "barcode": "BBWS180209122",
            "dpc": "03031434401",
            "name": "ជា ចំរើន"
        },
        {
            "barcode": "BBWS180209123",
            "dpc": "03031434501",
            "name": "វ៉ែន សំបូរ"
        },
        {
            "barcode": "BBWS180209124",
            "dpc": "03031434601",
            "name": "គិត យិង"
        },
        {
            "barcode": "BBWS180209125",
            "dpc": "03031434701",
            "name": "ជា សុគន្ធ ២"
        },
        {
            "barcode": "BBWS180209126",
            "dpc": "03031434801",
            "name": "ប៊ី បុប្ផា"
        },
        {
            "barcode": "BBWS180209127",
            "dpc": "03031434901",
            "name": "គង់ ណាំ"
        },
        {
            "barcode": "BBWS180209128",
            "dpc": "03031435101",
            "name": "ចេង ប៊ុនឡុង"
        },
        {
            "barcode": "BBWS180209129",
            "dpc": "03031435201",
            "name": "ហៀង ឆោមណា"
        },
        {
            "barcode": "BBWS180209130",
            "dpc": "03031435301",
            "name": "លឹម សុខ"
        },
        {
            "barcode": "BBWS180209131",
            "dpc": "03031435401",
            "name": "រស់ សេង"
        },
        {
            "barcode": "BBWS180209132",
            "dpc": "03031435501",
            "name": "សំ វ៉ាន់នី"
        },
        {
            "barcode": "BBWS180209133",
            "dpc": "03031435601",
            "name": "ទាវ កៅ"
        },
        {
            "barcode": "BBWS180209134",
            "dpc": "03031435701",
            "name": "អ៊ឺង អៀងហេង"
        },
        {
            "barcode": "BBWS180209135",
            "dpc": "03031435801",
            "name": "ចាន់ ហុង"
        },
        {
            "barcode": "BBWS180209136",
            "dpc": "03031435901",
            "name": "ទិត្យ បូប"
        },
        {
            "barcode": "BBWS180209137",
            "dpc": "03031434201",
            "name": "ស ណាំ"
        },
        {
            "barcode": "BBWS180209138",
            "dpc": "03031434101",
            "name": "ហ៊ុំ សុខា ២"
        },
        {
            "barcode": "BBWS180209139",
            "dpc": "03031434001",
            "name": "ខូវ ផល្លី"
        },
        {
            "barcode": "BBWS180209140",
            "dpc": "03031433801",
            "name": "ឡាយ វ៉ាន់"
        },
        {
            "barcode": "BBWS180209141",
            "dpc": "03031433701",
            "name": "នេត ថន"
        },
        {
            "barcode": "BBWS180209142",
            "dpc": "03031433601",
            "name": "ពេជ្រ  ខាន់"
        },
        {
            "barcode": "BBWS180209143",
            "dpc": "03031440101",
            "name": "អ៊ុក ព្រំ"
        },
        {
            "barcode": "BBWS180209144",
            "dpc": "03031440201",
            "name": "វត្តពិភិទ្ធារាម (ខាងលិច)"
        },
        {
            "barcode": "BBWS180209145",
            "dpc": "03031440301",
            "name": "វត្តពិភិទ្ធារាម (ខាងកើត)"
        },
        {
            "barcode": "BBWS180209146",
            "dpc": "03031446301",
            "name": "ប៉ុក សុទ្ធា"
        },
        {
            "barcode": "BBWS180209147",
            "dpc": "03031432601",
            "name": "គង់ ប៊ុនលី"
        },
        {
            "barcode": "BBWS180209148",
            "dpc": "03031441401",
            "name": "លក់ គ្រី"
        },
        {
            "barcode": "BBWS180209149",
            "dpc": "03031441701",
            "name": "ប៉ែន ហាប់"
        },
        {
            "barcode": "BBWS180209150",
            "dpc": "03031441801",
            "name": "ឈ្នាង សុង"
        },
        {
            "barcode": "BBWS180209151",
            "dpc": "03031441901",
            "name": "ព្រំ មាំងគីម"
        },
        {
            "barcode": "BBWS180209152",
            "dpc": "03031442001",
            "name": "ប៉ែន កិ"
        },
        {
            "barcode": "BBWS180209153",
            "dpc": "03031442201",
            "name": "ជិត ជុំ"
        },
        {
            "barcode": "BBWS180209154",
            "dpc": "03031442301",
            "name": "បេង លន់"
        },
        {
            "barcode": "BBWS180209155",
            "dpc": "03031442401",
            "name": "ហ៊ុន វិបុល"
        },
        {
            "barcode": "BBWS180209156",
            "dpc": "03031442501",
            "name": "ឆាយ យួម"
        },
        {
            "barcode": "BBWS180209157",
            "dpc": "03031442601",
            "name": "ម៉ៅ ហុក"
        },
        {
            "barcode": "BBWS180209158",
            "dpc": "03031442701",
            "name": "តុក សុងសួរ"
        },
        {
            "barcode": "BBWS180209159",
            "dpc": "03031442801",
            "name": "បណ្តូល សំណាង"
        },
        {
            "barcode": "BBWS180209160",
            "dpc": "03031442901",
            "name": "ឈិនស៊ី"
        },
        {
            "barcode": "BBWS180209161",
            "dpc": "03031443001",
            "name": "ឯល សារ៉ាត់"
        },
        {
            "barcode": "BBWS180209162",
            "dpc": "03031443101",
            "name": "ញឹក ប៊ុនឈុប"
        },
        {
            "barcode": "BBWS180209163",
            "dpc": "03031443201",
            "name": "អ៊ន សុផានី"
        },
        {
            "barcode": "BBWS180209164",
            "dpc": "03031443401",
            "name": "យ៉ាំ យី"
        },
        {
            "barcode": "BBWS180209165",
            "dpc": "03031443501",
            "name": "អៀ ឈុន"
        },
        {
            "barcode": "BBWS180209166",
            "dpc": "03031443601",
            "name": "ណាំ ទុំ"
        },
        {
            "barcode": "BBWS180209167",
            "dpc": "03031443701",
            "name": "អ៊ុល វិបុល"
        },
        {
            "barcode": "BBWS180209168",
            "dpc": "03031443801",
            "name": "ងួូន ចរិយា១"
        },
        {
            "barcode": "BBWS180209169",
            "dpc": "03031443901",
            "name": "ងួន ចរិយា"
        },
        {
            "barcode": "BBWS180209170",
            "dpc": "03031444001",
            "name": "ចាប សុភី"
        },
        {
            "barcode": "BBWS180209171",
            "dpc": "03031444101",
            "name": "ម៉ន សាម៉ៃ"
        },
        {
            "barcode": "BBWS180209172",
            "dpc": "03031444201",
            "name": "អ៊ុំ រ៉ូន"
        },
        {
            "barcode": "BBWS180209173",
            "dpc": "03031444301",
            "name": "សែ សារ៉ាន់"
        },
        {
            "barcode": "BBWS180209174",
            "dpc": "03031444401",
            "name": "ប៉ឹង រ៉ុន"
        },
        {
            "barcode": "BBWS180209175",
            "dpc": "03031444601",
            "name": "តាត ស៊ាង"
        },
        {
            "barcode": "BBWS180209176",
            "dpc": "03031444701",
            "name": "ម៉ក់ ណុល"
        },
        {
            "barcode": "BBWS180209177",
            "dpc": "03031444801",
            "name": "ទ្រី ទុយ"
        },
        {
            "barcode": "BBWS180209178",
            "dpc": "03031444901",
            "name": "អៀង សាមេត"
        },
        {
            "barcode": "BBWS180209179",
            "dpc": "03031445001",
            "name": "ស៊ុយ អេង"
        },
        {
            "barcode": "BBWS180209180",
            "dpc": "03031445101",
            "name": "ជួន ប៊ុន"
        },
        {
            "barcode": "BBWS180209181",
            "dpc": "03031445201",
            "name": "អ៊ុយ លន់"
        },
        {
            "barcode": "BBWS180209182",
            "dpc": "03031445301",
            "name": "ឈួន ហួត"
        },
        {
            "barcode": "BBWS180209183",
            "dpc": "03031445501",
            "name": "សេង ស៊ីម"
        },
        {
            "barcode": "BBWS180209184",
            "dpc": "03031445601",
            "name": "គីង ចាន់ឡាយ"
        },
        {
            "barcode": "BBWS180209185",
            "dpc": "03031445801",
            "name": "កឺ សិនឡុង"
        },
        {
            "barcode": "BBWS180209186",
            "dpc": "03031445901",
            "name": "ឈឹម ឆុំ"
        },
        {
            "barcode": "BBWS180209187",
            "dpc": "03031446001",
            "name": "ហេង ឈាន"
        },
        {
            "barcode": "BBWS180209188",
            "dpc": "03031446101",
            "name": "ស្រៀង ទ្រី"
        },
        {
            "barcode": "BBWS180209189",
            "dpc": "03031446401",
            "name": "ចៅ ម៉ាន់"
        },
        {
            "barcode": "BBWS180209190",
            "dpc": "03031446501",
            "name": "ចៅ កង"
        },
        {
            "barcode": "BBWS180209191",
            "dpc": "03031446701",
            "name": "សង ស៊ីន"
        },
        {
            "barcode": "BBWS180209192",
            "dpc": "03031446901",
            "name": "នូ សារ"
        },
        {
            "barcode": "BBWS180209193",
            "dpc": "03031447001",
            "name": "ចែត្រ ថៃ"
        },
        {
            "barcode": "BBWS180209194",
            "dpc": "03031447101",
            "name": "ឆេង ឡុង"
        },
        {
            "barcode": "BBWS180209195",
            "dpc": "03031447201",
            "name": "ពាំង វែង"
        },
        {
            "barcode": "BBWS180209196",
            "dpc": "03031447301",
            "name": "ស៊ឹម ណា"
        },
        {
            "barcode": "BBWS180209197",
            "dpc": "03031447401",
            "name": "ជា ឆូយ"
        },
        {
            "barcode": "BBWS180209198",
            "dpc": "03031447501",
            "name": "លុយ ម៉េងណាំង"
        },
        {
            "barcode": "BBWS180209199",
            "dpc": "03031440401",
            "name": "សៀង លីម"
        },
        {
            "barcode": "BBWS180209200",
            "dpc": "03031440601",
            "name": "សេង យក់រ៉ា"
        },
        {
            "barcode": "BBWS180209201",
            "dpc": "03031440701",
            "name": "ឈួន ហួត"
        },
        {
            "barcode": "BBWS180209202",
            "dpc": "03031440801",
            "name": "សេង ម៉ាង"
        },
        {
            "barcode": "BBWS180209203",
            "dpc": "03031440901",
            "name": "ណៃ វណ្ណៈ"
        },
        {
            "barcode": "BBWS180209204",
            "dpc": "03031441001",
            "name": "ជា ហួរ"
        },
        {
            "barcode": "BBWS180209205",
            "dpc": "03031441201",
            "name": "ជី ខេង"
        },
        {
            "barcode": "BBWS180209206",
            "dpc": "03031441301",
            "name": "កឹម  កាង"
        },
        {
            "barcode": "BBWS180209207",
            "dpc": "03031447701",
            "name": "នន់ សុគន្ធ"
        },
        {
            "barcode": "BBWS180209208",
            "dpc": "03031447801",
            "name": "ចាន់ សូយ៉េត"
        },
        {
            "barcode": "BBWS180209209",
            "dpc": "03031447901",
            "name": "គឹម ស៊ុនរិទ្ធី"
        },
        {
            "barcode": "BBWS180209210",
            "dpc": "03031402601",
            "name": "ចាន់  ហួត"
        },
        {
            "barcode": "BBWS180209211",
            "dpc": "03031407201",
            "name": "យឹម  ចិត្រា"
        },
        {
            "barcode": "BBWS180209212",
            "dpc": "03031408701",
            "name": "ហេង  សុខមុនី"
        },
        {
            "barcode": "BBWS180209213",
            "dpc": "03031409501",
            "name": "ហាស់  ស៊ីផាន់"
        },
        {
            "barcode": "BBWS180209214",
            "dpc": "03031431201",
            "name": "អ៊ឹង  អេង"
        },
        {
            "barcode": "BBWS180209215",
            "dpc": "03031431401",
            "name": "អ៊ឹង  អេង"
        },
        {
            "barcode": "BBWS180209216",
            "dpc": "03031432301",
            "name": "ដូ  គង់"
        },
        {
            "barcode": "BBWS180209217",
            "dpc": "03031433501",
            "name": "ឡុង  នី"
        },
        {
            "barcode": "BBWS180209218",
            "dpc": "03031436701",
            "name": "ជា  សុគន្ធ ៣"
        },
        {
            "barcode": "BBWS180209219",
            "dpc": "03031438201",
            "name": "យិន  ប៊ុនឡុង"
        },
        {
            "barcode": "BBWS180209220",
            "dpc": "03031438301",
            "name": "ម៉ក់  ស៊ន"
        },
        {
            "barcode": "BBWS180209221",
            "dpc": "03031438501",
            "name": "សុខ  លន់"
        },
        {
            "barcode": "BBWS180209222",
            "dpc": "03031438601",
            "name": "អ៊ឹង  វ៉ា"
        },
        {
            "barcode": "BBWS180209223",
            "dpc": "03031438901",
            "name": "លី  ស៊ុនហ"
        },
        {
            "barcode": "BBWS180209224",
            "dpc": "03031443301",
            "name": "សុខ  ចាន់"
        },
        {
            "barcode": "BBWS180209225",
            "dpc": "03031422301",
            "name": "លី  យូ"
        },
        {
            "barcode": "BBWS180209226",
            "dpc": "03031439801",
            "name": "សេង  ប្រាង"
        },
        {
            "barcode": "BBWS180209227",
            "dpc": "03031448001",
            "name": "គង់ លៀប"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
