let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=

    [
        {
            "barcode": "BBWS180206314",
            "dpc": "03041812501",
            "name": "ហែម សុខខី"
        },
        {
            "barcode": "BBWS180206315",
            "dpc": "03041812401",
            "name": "សួន នឿត"
        },
        {
            "barcode": "BBWS180206316",
            "dpc": "03041812301",
            "name": "ហេង ម៉ៅ"
        },
        {
            "barcode": "BBWS180206317",
            "dpc": "03041812201",
            "name": "សុខ សុខា"
        },
        {
            "barcode": "BBWS180206318",
            "dpc": "03041812101",
            "name": "អ៊ិន សាឡូត"
        },
        {
            "barcode": "BBWS180206319",
            "dpc": "03041812701",
            "name": "នួន សំណាង"
        },
        {
            "barcode": "BBWS180206320",
            "dpc": "03041812801",
            "name": "អ៊ុក  ឆេង"
        },
        {
            "barcode": "BBWS180206321",
            "dpc": "03041812901",
            "name": "ឌុច សែណាង"
        },
        {
            "barcode": "BBWS180206322",
            "dpc": "03041813001",
            "name": "សុខ ហេង"
        },
        {
            "barcode": "BBWS180206323",
            "dpc": "03041813201",
            "name": "ឥន ហេង"
        },
        {
            "barcode": "BBWS180206324",
            "dpc": "03041813301",
            "name": "ហេង ប៊ុនវ៉ាត់"
        },
        {
            "barcode": "BBWS180206325",
            "dpc": "03041813401",
            "name": "សុខ វិរៈ"
        },
        {
            "barcode": "BBWS180206326",
            "dpc": "03041813501",
            "name": "ឥន ឡេង"
        },
        {
            "barcode": "BBWS180206327",
            "dpc": "03041813601",
            "name": "នុត ណែម"
        },
        {
            "barcode": "BBWS180206328",
            "dpc": "03041813701",
            "name": "ជា សាវី"
        },
        {
            "barcode": "BBWS180206329",
            "dpc": "03041813801",
            "name": "ធុន អឿន"
        },
        {
            "barcode": "BBWS180206330",
            "dpc": "03041813901",
            "name": "សុខ ឡេង"
        },
        {
            "barcode": "BBWS180206331",
            "dpc": "03041814101",
            "name": "សុខ ណេង"
        },
        {
            "barcode": "BBWS180206332",
            "dpc": "03041814201",
            "name": "សុខ ឡេង"
        },
        {
            "barcode": "BBWS180206333",
            "dpc": "03041814301",
            "name": "ឃិម  សូរីយា"
        },
        {
            "barcode": "BBWS180206334",
            "dpc": "03041814401",
            "name": "គួច  សាវី"
        },
        {
            "barcode": "BBWS180206335",
            "dpc": "03041814501",
            "name": "មាស ពែវ"
        },
        {
            "barcode": "BBWS180206336",
            "dpc": "03041814601",
            "name": "ឆាយ ឡាប"
        },
        {
            "barcode": "BBWS180206337",
            "dpc": "03041814701",
            "name": "អ៊ុំ ស្រី"
        },
        {
            "barcode": "BBWS180206338",
            "dpc": "03041814801",
            "name": "អ៊ុំ សាំង"
        },
        {
            "barcode": "BBWS180206339",
            "dpc": "03041814901",
            "name": "ទឹម ថា"
        },
        {
            "barcode": "BBWS180206340",
            "dpc": "03041810001",
            "name": "លឹម សុធា"
        },
        {
            "barcode": "BBWS180206341",
            "dpc": "03041815001",
            "name": "ជា សំអាត"
        },
        {
            "barcode": "BBWS180206342",
            "dpc": "03041815101",
            "name": "អេង ម៉ុន"
        },
        {
            "barcode": "BBWS180206343",
            "dpc": "03041815201",
            "name": "ញ៉ែម ខេន"
        },
        {
            "barcode": "BBWS180206344",
            "dpc": "03041815301",
            "name": "ធឿម ស៊ីមុត"
        },
        {
            "barcode": "BBWS180206345",
            "dpc": "03041815401",
            "name": "ជី សូហា"
        },
        {
            "barcode": "BBWS180206346",
            "dpc": "03041815501",
            "name": "ស៊ុន  ថាវ"
        },
        {
            "barcode": "BBWS180206347",
            "dpc": "03041815601",
            "name": "សោម  សូណែត"
        },
        {
            "barcode": "BBWS180206348",
            "dpc": "03041815701",
            "name": "ឌី ស៊ីម"
        },
        {
            "barcode": "BBWS180206349",
            "dpc": "03041815801",
            "name": "ថោង មុំ"
        },
        {
            "barcode": "BBWS180206350",
            "dpc": "03041815901",
            "name": "លិន ណាវី"
        },
        {
            "barcode": "BBWS180206351",
            "dpc": "03041816001",
            "name": "ស៊ុយ ពិសិដ្ឋ"
        },
        {
            "barcode": "BBWS180206352",
            "dpc": "03041816101",
            "name": "ស៊ិន ញិប"
        },
        {
            "barcode": "BBWS180206353",
            "dpc": "03041816201",
            "name": "ស៊ិន បូរ៉ាន់"
        },
        {
            "barcode": "BBWS180206354",
            "dpc": "03041816301",
            "name": "សុខ ជា"
        },
        {
            "barcode": "BBWS180206355",
            "dpc": "03041816401",
            "name": "សេង សុភី"
        },
        {
            "barcode": "BBWS180206356",
            "dpc": "03041816501",
            "name": "ឃួយ  គឹមទ្រី"
        },
        {
            "barcode": "BBWS180206357",
            "dpc": "03041816601",
            "name": "អ៊ិន សុខា"
        },
        {
            "barcode": "BBWS180206358",
            "dpc": "03041816801",
            "name": "ហ៊ីង សៀក"
        },
        {
            "barcode": "BBWS180206359",
            "dpc": "03041816901",
            "name": "ម៉ាច គឹមឆាយ"
        },
        {
            "barcode": "BBWS180206360",
            "dpc": "03041817001",
            "name": "យូ សាន"
        },
        {
            "barcode": "BBWS180206361",
            "dpc": "03041817101",
            "name": "សយ  សារឿន"
        },
        {
            "barcode": "BBWS180206362",
            "dpc": "03041817201",
            "name": "ហ្វាន់ ទី"
        },
        {
            "barcode": "BBWS180206363",
            "dpc": "03041828301",
            "name": "ផាត់ នី"
        },
        {
            "barcode": "BBWS180206364",
            "dpc": "03041828401",
            "name": "ហួត  វី"
        },
        {
            "barcode": "BBWS180206365",
            "dpc": "03041828501",
            "name": "សួន សំអាត"
        },
        {
            "barcode": "BBWS180206366",
            "dpc": "03041828801",
            "name": "លី ងួន"
        },
        {
            "barcode": "BBWS180206367",
            "dpc": "03041811901",
            "name": "ពេក តារ៉ា"
        },
        {
            "barcode": "BBWS180206368",
            "dpc": "03041811401",
            "name": "សោ សារី"
        },
        {
            "barcode": "BBWS180206369",
            "dpc": "03041811701",
            "name": "អ៊ុយ ដារីន"
        },
        {
            "barcode": "BBWS180206370",
            "dpc": "03041827401",
            "name": "សោម ថន"
        },
        {
            "barcode": "BBWS180206371",
            "dpc": "03041811601",
            "name": "មាស រ៉ាស៊ីន"
        },
        {
            "barcode": "BBWS180206372",
            "dpc": "03041811501",
            "name": "ចាប ដារីណេត"
        },
        {
            "barcode": "BBWS180206373",
            "dpc": "03041811301",
            "name": "សោម ជូ"
        },
        {
            "barcode": "BBWS180206374",
            "dpc": "03041811201",
            "name": "សោម សុវណ្ណារ៉ា"
        },
        {
            "barcode": "BBWS180206375",
            "dpc": "03041811101",
            "name": "ទូច កុសល"
        },
        {
            "barcode": "BBWS180206376",
            "dpc": "03041811001",
            "name": "សុខ ណែម"
        },
        {
            "barcode": "BBWS180206377",
            "dpc": "03041810901",
            "name": "ហួត លាងស៊ីម"
        },
        {
            "barcode": "BBWS180206378",
            "dpc": "03041810801",
            "name": "ហាក់ សំផុន"
        },
        {
            "barcode": "BBWS180206379",
            "dpc": "03041810701",
            "name": "សែ បូរ"
        },
        {
            "barcode": "BBWS180206380",
            "dpc": "03041810601",
            "name": "នង   វុត្ថា"
        },
        {
            "barcode": "BBWS180206381",
            "dpc": "03041810501",
            "name": "ឃុត សារ៉ុម"
        },
        {
            "barcode": "BBWS180206382",
            "dpc": "03041810401",
            "name": "តឹក គឹមឡុង"
        },
        {
            "barcode": "BBWS180206383",
            "dpc": "03041810301",
            "name": "សែង ចិន្តា"
        },
        {
            "barcode": "BBWS180206384",
            "dpc": "03041810201",
            "name": "រស់ ជីវ័ន្ត"
        },
        {
            "barcode": "BBWS180206385",
            "dpc": "03041809701",
            "name": "លក  សួរ"
        },
        {
            "barcode": "BBWS180206386",
            "dpc": "03041807201",
            "name": "កៅ ស៊ីឡេង"
        },
        {
            "barcode": "BBWS180206387",
            "dpc": "03041807301",
            "name": "ហេង អេង"
        },
        {
            "barcode": "BBWS180206388",
            "dpc": "03041807401",
            "name": "ឃួន ឱសថ"
        },
        {
            "barcode": "BBWS180206389",
            "dpc": "03041807501",
            "name": "សេក ទូច"
        },
        {
            "barcode": "BBWS180206390",
            "dpc": "03041807601",
            "name": "ចាន់ កណ្ណិកា"
        },
        {
            "barcode": "BBWS180206391",
            "dpc": "03041807701",
            "name": "លី ម៉េង"
        },
        {
            "barcode": "BBWS180206392",
            "dpc": "03041807801",
            "name": "យូ ជីឃាង"
        },
        {
            "barcode": "BBWS180206393",
            "dpc": "03041807901",
            "name": "សួន សុផល"
        },
        {
            "barcode": "BBWS180206394",
            "dpc": "03041808001",
            "name": "ម៉ុន  ម៉ុត"
        },
        {
            "barcode": "BBWS180206395",
            "dpc": "03041808101",
            "name": "កឺ សែត"
        },
        {
            "barcode": "BBWS180206396",
            "dpc": "03041808201",
            "name": "ជាន  ឡូញ"
        },
        {
            "barcode": "BBWS180206397",
            "dpc": "03041808301",
            "name": "រឿន វណ្ណស៊ី"
        },
        {
            "barcode": "BBWS180206398",
            "dpc": "03041808401",
            "name": "សិន  ញ៉ា"
        },
        {
            "barcode": "BBWS180206399",
            "dpc": "03041808501",
            "name": "យូ សាន ១"
        },
        {
            "barcode": "BBWS180206400",
            "dpc": "03041808601",
            "name": "យាន  ពៅ"
        },
        {
            "barcode": "BBWS180206401",
            "dpc": "03041808701",
            "name": "ធូ ហួត"
        },
        {
            "barcode": "BBWS180206402",
            "dpc": "03041808801",
            "name": "ព្រុំ ប៊ុត"
        },
        {
            "barcode": "BBWS180206403",
            "dpc": "03041808901",
            "name": "លុក មន្នី"
        },
        {
            "barcode": "BBWS180206404",
            "dpc": "03041809001",
            "name": "ស៊ីម សារិន"
        },
        {
            "barcode": "BBWS180206405",
            "dpc": "03041809101",
            "name": "ប៉ិច ឆាតសារិ"
        },
        {
            "barcode": "BBWS180206406",
            "dpc": "03041809201",
            "name": "យូ ឆេង"
        },
        {
            "barcode": "BBWS180206407",
            "dpc": "03041809301",
            "name": "ម៉ៅ ណារិទ្ធិ"
        },
        {
            "barcode": "BBWS180206408",
            "dpc": "03041809401",
            "name": "ខែក ស៊ីថុន"
        },
        {
            "barcode": "BBWS180206409",
            "dpc": "03041809501",
            "name": "ខែក ស៊ីធឿន"
        },
        {
            "barcode": "BBWS180206410",
            "dpc": "03041809601",
            "name": "ឡេង សំអាត"
        },
        {
            "barcode": "BBWS180206411",
            "dpc": "03041810101",
            "name": "ច័ន្ទ   មន្នី"
        },
        {
            "barcode": "BBWS180206412",
            "dpc": "03041809901",
            "name": "សូនី រស្មី"
        },
        {
            "barcode": "BBWS180206413",
            "dpc": "03041846101",
            "name": "យឹង  ហឿប"
        },
        {
            "barcode": "BBWS180206414",
            "dpc": "03041846201",
            "name": "វ៉ាន់ ករ"
        },
        {
            "barcode": "BBWS180206415",
            "dpc": "03041846301",
            "name": "ម៉ម ណារ៉េត"
        },
        {
            "barcode": "BBWS180206416",
            "dpc": "03041846401",
            "name": "អ៊ិត សំប៊ុន"
        },
        {
            "barcode": "BBWS180206417",
            "dpc": "03041846501",
            "name": "នៅ  បូរិន"
        },
        {
            "barcode": "BBWS180206418",
            "dpc": "03041846601",
            "name": "ណុប សោភ័ណ្ឌ"
        },
        {
            "barcode": "BBWS180206419",
            "dpc": "03041846701",
            "name": "ជួន  ហុង"
        },
        {
            "barcode": "BBWS180206420",
            "dpc": "03041846801",
            "name": "អ៊ិត សំបូរ"
        },
        {
            "barcode": "BBWS180206421",
            "dpc": "03041846901",
            "name": "អៃ អ៊ី"
        },
        {
            "barcode": "BBWS180206422",
            "dpc": "03041847101",
            "name": "ម៉ែន កល្យាណ"
        },
        {
            "barcode": "BBWS180206423",
            "dpc": "03041847301",
            "name": "ទូច ហាក់"
        },
        {
            "barcode": "BBWS180206424",
            "dpc": "03041847401",
            "name": "ផន ផល្លា"
        },
        {
            "barcode": "BBWS180206425",
            "dpc": "03041847501",
            "name": "ម៉ក់ ទូច"
        },
        {
            "barcode": "BBWS180206426",
            "dpc": "03041847701",
            "name": "យង់  តាវ"
        },
        {
            "barcode": "BBWS180206427",
            "dpc": "03041847801",
            "name": "ឡុង សុឃីម"
        },
        {
            "barcode": "BBWS180206428",
            "dpc": "03041847901",
            "name": "អ៊ុច សុផាត"
        },
        {
            "barcode": "BBWS180206429",
            "dpc": "03041838501",
            "name": "ហេង សៅយ៉ាត"
        },
        {
            "barcode": "BBWS180206430",
            "dpc": "03041838701",
            "name": "សាំង ធី"
        },
        {
            "barcode": "BBWS180206431",
            "dpc": "03041838801",
            "name": "ឡាយ ណារី"
        },
        {
            "barcode": "BBWS180206432",
            "dpc": "03041838901",
            "name": "គង់ តាប"
        },
        {
            "barcode": "BBWS180206433",
            "dpc": "03041839001",
            "name": "ហុក ចាន់ថុល"
        },
        {
            "barcode": "BBWS180206434",
            "dpc": "03041839101",
            "name": "ស៊្រុន សុទិដ្ឋ"
        },
        {
            "barcode": "BBWS180206435",
            "dpc": "03041839201",
            "name": "យូ ហេងស្រេង"
        },
        {
            "barcode": "BBWS180206436",
            "dpc": "03041839301",
            "name": "ឡេង ហន"
        },
        {
            "barcode": "BBWS180206437",
            "dpc": "03041839401",
            "name": "អ៊ូ សុដារិទ្ធ"
        },
        {
            "barcode": "BBWS180206438",
            "dpc": "03041839501",
            "name": "ហ៊ីង ឡាង"
        },
        {
            "barcode": "BBWS180206439",
            "dpc": "03041839601",
            "name": "ទង ស៊្រី"
        },
        {
            "barcode": "BBWS180206440",
            "dpc": "03041839701",
            "name": "តុង ម៉ៅ"
        },
        {
            "barcode": "BBWS180206441",
            "dpc": "03041839901",
            "name": "លី វិចិត្រ"
        },
        {
            "barcode": "BBWS180206442",
            "dpc": "03041840101",
            "name": "យស ពៅ"
        },
        {
            "barcode": "BBWS180206443",
            "dpc": "03041840301",
            "name": "រិន រួម"
        },
        {
            "barcode": "BBWS180206444",
            "dpc": "03041840401",
            "name": "រ៉ាន់ ដារី"
        },
        {
            "barcode": "BBWS180206445",
            "dpc": "03041840501",
            "name": "រ៉ាន់ ម៉ៅ"
        },
        {
            "barcode": "BBWS180206446",
            "dpc": "03041840601",
            "name": "ជា ម៉ារីយ៉ាន"
        },
        {
            "barcode": "BBWS180206447",
            "dpc": "03041840701",
            "name": "អៀវ  តេង"
        },
        {
            "barcode": "BBWS180206448",
            "dpc": "03041840801",
            "name": "ឡេង វិសាល"
        },
        {
            "barcode": "BBWS180206449",
            "dpc": "03041840901",
            "name": "ហុល  វ៉ាន់ណារូ"
        },
        {
            "barcode": "BBWS180206450",
            "dpc": "03041841001",
            "name": "ឈួន គឹមលៀន"
        },
        {
            "barcode": "BBWS180206451",
            "dpc": "03041841201",
            "name": "ប្រាក់ កេះ"
        },
        {
            "barcode": "BBWS180206452",
            "dpc": "03041841301",
            "name": "លី ប៊ុន"
        },
        {
            "barcode": "BBWS180206453",
            "dpc": "03041841401",
            "name": "កែវ ចន្ថា"
        },
        {
            "barcode": "BBWS180206454",
            "dpc": "03041841501",
            "name": "ជ័យ ធីដា"
        },
        {
            "barcode": "BBWS180206455",
            "dpc": "03041841601",
            "name": "អេង ផល្លា"
        },
        {
            "barcode": "BBWS180206456",
            "dpc": "03041841701",
            "name": "អ៊ិន ថៃលី"
        },
        {
            "barcode": "BBWS180206457",
            "dpc": "03041841801",
            "name": "ងូវ  ឈាង"
        },
        {
            "barcode": "BBWS180206458",
            "dpc": "03041841901",
            "name": "ស្វាយ ពៅ"
        },
        {
            "barcode": "BBWS180206459",
            "dpc": "03041842001",
            "name": "លឹម ជៀន"
        },
        {
            "barcode": "BBWS180206460",
            "dpc": "03041842101",
            "name": "ស៊ូ  ដាក់"
        },
        {
            "barcode": "BBWS180206461",
            "dpc": "03041841101",
            "name": "ណុប ចាន់ជីនា"
        },
        {
            "barcode": "BBWS180206462",
            "dpc": "03041842201",
            "name": "អេ សារុំ"
        },
        {
            "barcode": "BBWS180206463",
            "dpc": "03041842301",
            "name": "អ៊ូ សៀក"
        },
        {
            "barcode": "BBWS180206464",
            "dpc": "03041842401",
            "name": "ឈុំ ពុធ"
        },
        {
            "barcode": "BBWS180206465",
            "dpc": "03041842501",
            "name": "ណុប តុល"
        },
        {
            "barcode": "BBWS180206466",
            "dpc": "03041842701",
            "name": "លន់ ឡូន"
        },
        {
            "barcode": "BBWS180206467",
            "dpc": "03041842801",
            "name": "ស្រី ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180206468",
            "dpc": "03041842901",
            "name": "ម៉ែន បូរី"
        },
        {
            "barcode": "BBWS180206469",
            "dpc": "03041843001",
            "name": "សូ មុន្នី"
        },
        {
            "barcode": "BBWS180206470",
            "dpc": "03041843101",
            "name": "គួច ហុង"
        },
        {
            "barcode": "BBWS180206471",
            "dpc": "03041843201",
            "name": "មិន សាអែម"
        },
        {
            "barcode": "BBWS180206472",
            "dpc": "03041843301",
            "name": "ស៊ិន សុផល"
        },
        {
            "barcode": "BBWS180206473",
            "dpc": "03041843401",
            "name": "ឆាន់ ណារ័ត្ន"
        },
        {
            "barcode": "BBWS180206474",
            "dpc": "03041843501",
            "name": "ប៉ែន សារ៉ាត់"
        },
        {
            "barcode": "BBWS180206475",
            "dpc": "03041843601",
            "name": "ផន ថន"
        },
        {
            "barcode": "BBWS180206476",
            "dpc": "03041843701",
            "name": "ឡូវ ហុង"
        },
        {
            "barcode": "BBWS180206477",
            "dpc": "03041843901",
            "name": "នេត ផល្លី"
        },
        {
            "barcode": "BBWS180206478",
            "dpc": "03041844101",
            "name": "ជា ចំរើន"
        },
        {
            "barcode": "BBWS180206479",
            "dpc": "03041844201",
            "name": "ឈុន សម្ភស្ស"
        },
        {
            "barcode": "BBWS180206480",
            "dpc": "03041844301",
            "name": "ឈុន ចំរើន"
        },
        {
            "barcode": "BBWS180206481",
            "dpc": "03041844401",
            "name": "ង៉ែត សាវុធ"
        },
        {
            "barcode": "BBWS180206482",
            "dpc": "03041844501",
            "name": "ទឹម សាម៉ី"
        },
        {
            "barcode": "BBWS180206483",
            "dpc": "03041844601",
            "name": "សេង ប៊ុនហេង"
        },
        {
            "barcode": "BBWS180206484",
            "dpc": "03041844701",
            "name": "សុខ ប៉ុន"
        },
        {
            "barcode": "BBWS180206485",
            "dpc": "03041844801",
            "name": "អ៊ុក លី"
        },
        {
            "barcode": "BBWS180206486",
            "dpc": "03041844901",
            "name": "វូច ស្រេង"
        },
        {
            "barcode": "BBWS180206487",
            "dpc": "03041845001",
            "name": "ណុប ម៉ៅ"
        },
        {
            "barcode": "BBWS180206488",
            "dpc": "03041845101",
            "name": "សូយ ប៊ុនហឿន"
        },
        {
            "barcode": "BBWS180206489",
            "dpc": "03041845401",
            "name": "អោ ថុង"
        },
        {
            "barcode": "BBWS180206490",
            "dpc": "03041845501",
            "name": "អ៊ុំ ធឿន"
        },
        {
            "barcode": "BBWS180206491",
            "dpc": "03041845601",
            "name": "ឡូត សឿត"
        },
        {
            "barcode": "BBWS180206492",
            "dpc": "03041845701",
            "name": "កែវ សុខា"
        },
        {
            "barcode": "BBWS180206493",
            "dpc": "03041845801",
            "name": "ពៅ ប៊ុនថុន"
        },
        {
            "barcode": "BBWS180206494",
            "dpc": "03041845901",
            "name": "ឆន  ប៊ុនថន"
        },
        {
            "barcode": "BBWS180206495",
            "dpc": "03041828601",
            "name": "ព្រំ  ណូ"
        },
        {
            "barcode": "BBWS180206496",
            "dpc": "03041828701",
            "name": "ស៊ុយ  ជុក"
        },
        {
            "barcode": "BBWS180206497",
            "dpc": "03041829701",
            "name": "អ៊ូ  ដាវី"
        },
        {
            "barcode": "BBWS180206498",
            "dpc": "03041838401",
            "name": "ឆាន់   សុជាតិ"
        },
        {
            "barcode": "BBWS180206499",
            "dpc": "03041844001",
            "name": "ម៉ែន  ស៊ី"
        },
        {
            "barcode": "BBWS180206500",
            "dpc": "03041845301",
            "name": "ទិត  វ៉ាន"
        },
        {
            "barcode": "BBWS180206501",
            "dpc": "03041846001",
            "name": "ជ័យ  សារិទ្ធ"
        },
        {
            "barcode": "BBWS180206502",
            "dpc": "03041801601",
            "name": "ហម ញង"
        },
        {
            "barcode": "BBWS180206503",
            "dpc": "03041801501",
            "name": "សំ  សុខ"
        },
        {
            "barcode": "BBWS180206504",
            "dpc": "03041801401",
            "name": "ហូ ឡាយ"
        },
        {
            "barcode": "BBWS180206505",
            "dpc": "03041800101",
            "name": "គឹម  សំបូរ"
        },
        {
            "barcode": "BBWS180206506",
            "dpc": "03041800201",
            "name": "មាស សាយ"
        },
        {
            "barcode": "BBWS180206507",
            "dpc": "03041800301",
            "name": "ឃុត អារឌី"
        },
        {
            "barcode": "BBWS180206508",
            "dpc": "03041800401",
            "name": "ទូរគមនាគមន៍"
        },
        {
            "barcode": "BBWS180206509",
            "dpc": "03041800501",
            "name": "ក្រុមហ៊ុនម៉ូបីតែល"
        },
        {
            "barcode": "BBWS180206510",
            "dpc": "03041800601",
            "name": "កាំមីតែល"
        },
        {
            "barcode": "BBWS180206511",
            "dpc": "03041800801",
            "name": "អាត់ សាវ៉ន"
        },
        {
            "barcode": "BBWS180206512",
            "dpc": "03041800901",
            "name": "ម៉ែន ញ៉ល"
        },
        {
            "barcode": "BBWS180206513",
            "dpc": "03041801001",
            "name": "សុខ សារ៉ូ"
        },
        {
            "barcode": "BBWS180206514",
            "dpc": "03041801101",
            "name": "លាង  ថុល ១"
        },
        {
            "barcode": "BBWS180206515",
            "dpc": "03041801201",
            "name": "រស់ សាអ៊ីន"
        },
        {
            "barcode": "BBWS180206516",
            "dpc": "03041801301",
            "name": "ជា សង្ខារសរីវឌ្ឍ"
        },
        {
            "barcode": "BBWS180206517",
            "dpc": "03041801701",
            "name": "សន សុខ១"
        },
        {
            "barcode": "BBWS180206518",
            "dpc": "03041801801",
            "name": "សន សុខ២"
        },
        {
            "barcode": "BBWS180206519",
            "dpc": "03041801901",
            "name": "វ៉ែន ហុក"
        },
        {
            "barcode": "BBWS180206520",
            "dpc": "03041802001",
            "name": "អែត ហ្វូត ៣"
        },
        {
            "barcode": "BBWS180206521",
            "dpc": "03041802301",
            "name": "លី សេងសៀង"
        },
        {
            "barcode": "BBWS180206522",
            "dpc": "03041802501",
            "name": "អៀម ធាម"
        },
        {
            "barcode": "BBWS180206523",
            "dpc": "03041812601",
            "name": "អង្គការ អេ.អ.អឹម"
        },
        {
            "barcode": "BBWS180206524",
            "dpc": "03041803001",
            "name": "ស៊ាង មួយ"
        },
        {
            "barcode": "BBWS180206525",
            "dpc": "03041803101",
            "name": "ធួន រ៉ាវុធ"
        },
        {
            "barcode": "BBWS180206526",
            "dpc": "03041803401",
            "name": "ណុប សាមិ"
        },
        {
            "barcode": "BBWS180206527",
            "dpc": "03041803501",
            "name": "កែវ ធី ៧៣"
        },
        {
            "barcode": "BBWS180206528",
            "dpc": "03041803601",
            "name": "គង់ សុខម៉េង"
        },
        {
            "barcode": "BBWS180206529",
            "dpc": "03041803701",
            "name": "គឹម គា"
        },
        {
            "barcode": "BBWS180206530",
            "dpc": "03041803801",
            "name": "ភួង សាវុធ"
        },
        {
            "barcode": "BBWS180206531",
            "dpc": "03041803901",
            "name": "តុក គឹមសួរ"
        },
        {
            "barcode": "BBWS180206532",
            "dpc": "03041804001",
            "name": "សាយ ហាក់ស្រ៊ុន"
        },
        {
            "barcode": "BBWS180206533",
            "dpc": "03041804101",
            "name": "ហ៊ុត សុភាព"
        },
        {
            "barcode": "BBWS180206534",
            "dpc": "03041804201",
            "name": "ជា ផល"
        },
        {
            "barcode": "BBWS180206535",
            "dpc": "03041804501",
            "name": "ហេង ចាន់ថានី"
        },
        {
            "barcode": "BBWS180206536",
            "dpc": "03041804801",
            "name": "យ៉ាំ ឃួង"
        },
        {
            "barcode": "BBWS180206537",
            "dpc": "03041805801",
            "name": "សុខ ចាន់មន្នី"
        },
        {
            "barcode": "BBWS180206538",
            "dpc": "03041805501",
            "name": "ព្រំ ណូ"
        },
        {
            "barcode": "BBWS180206539",
            "dpc": "03041805601",
            "name": "ទួន សុផល"
        },
        {
            "barcode": "BBWS180206540",
            "dpc": "03041804701",
            "name": "ចៅ យីថង"
        },
        {
            "barcode": "BBWS180206541",
            "dpc": "03041805901",
            "name": "ស៊ាន ផា"
        },
        {
            "barcode": "BBWS180206542",
            "dpc": "03041806001",
            "name": "កែវ សំណាង"
        },
        {
            "barcode": "BBWS180206543",
            "dpc": "03041806101",
            "name": "ឡុង ចន្ថា"
        },
        {
            "barcode": "BBWS180206544",
            "dpc": "03041806301",
            "name": "ខាន់ មាណេ"
        },
        {
            "barcode": "BBWS180206545",
            "dpc": "03041806501",
            "name": "ខា ហេង"
        },
        {
            "barcode": "BBWS180206546",
            "dpc": "03041802801",
            "name": "លឹម កែវធី"
        },
        {
            "barcode": "BBWS180206547",
            "dpc": "03041807101",
            "name": "សយ ផា"
        },
        {
            "barcode": "BBWS180206548",
            "dpc": "03041806901",
            "name": "ជី ឃីម"
        },
        {
            "barcode": "BBWS180206549",
            "dpc": "03041807001",
            "name": "យឹម វណ្ណថន"
        },
        {
            "barcode": "BBWS180206550",
            "dpc": "03041806801",
            "name": "ជិន ហ៊ាង"
        },
        {
            "barcode": "BBWS180206551",
            "dpc": "03041806601",
            "name": "សុខ លន់"
        },
        {
            "barcode": "BBWS180206552",
            "dpc": "03041806401",
            "name": "ហ្វាន់ ទី"
        },
        {
            "barcode": "BBWS180206553",
            "dpc": "03041806201",
            "name": "យឹន  វឹង"
        },
        {
            "barcode": "BBWS180206554",
            "dpc": "03041805701",
            "name": "សាម ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180206555",
            "dpc": "03041805401",
            "name": "សៅ អ៊ុល"
        },
        {
            "barcode": "BBWS180206556",
            "dpc": "03041805001",
            "name": "យាំ វ៉ិត"
        },
        {
            "barcode": "BBWS180206557",
            "dpc": "03041804601",
            "name": "កៅ អៀងឡាយ"
        },
        {
            "barcode": "BBWS180206558",
            "dpc": "03041804401",
            "name": "តុប សារុន"
        },
        {
            "barcode": "BBWS180206559",
            "dpc": "03041804301",
            "name": "កេតុ សឿ"
        },
        {
            "barcode": "BBWS180206560",
            "dpc": "03041817301",
            "name": "ឱ  ព្រឿង"
        },
        {
            "barcode": "BBWS180206561",
            "dpc": "03041817401",
            "name": "ប្រាក់ សាលឿត"
        },
        {
            "barcode": "BBWS180206562",
            "dpc": "03041818001",
            "name": "បេង លន់"
        },
        {
            "barcode": "BBWS180206563",
            "dpc": "03041818101",
            "name": "សុខ គឹមអេង"
        },
        {
            "barcode": "BBWS180206564",
            "dpc": "03041818201",
            "name": "សាំង អ៊ាង"
        },
        {
            "barcode": "BBWS180206565",
            "dpc": "03041818601",
            "name": "អ៊ូច សាឡូន"
        },
        {
            "barcode": "BBWS180206566",
            "dpc": "03041818501",
            "name": "ទិត ផល្លី"
        },
        {
            "barcode": "BBWS180206567",
            "dpc": "03041818401",
            "name": "ម៉ី យានឈុន"
        },
        {
            "barcode": "BBWS180206568",
            "dpc": "03041818301",
            "name": "ឡុង ម្លិះ"
        },
        {
            "barcode": "BBWS180206569",
            "dpc": "03041817901",
            "name": "គង់ វុត្ថា"
        },
        {
            "barcode": "BBWS180206570",
            "dpc": "03041817601",
            "name": "កង សារ៉េន"
        },
        {
            "barcode": "BBWS180206571",
            "dpc": "03041817501",
            "name": "សាយ ចំរើន"
        },
        {
            "barcode": "BBWS180206572",
            "dpc": "03041818701",
            "name": "ឈុន ង៉ោ"
        },
        {
            "barcode": "BBWS180206573",
            "dpc": "03041818801",
            "name": "ហួ  សុផា"
        },
        {
            "barcode": "BBWS180206574",
            "dpc": "03041819001",
            "name": "រស់ សុទ្ធ"
        },
        {
            "barcode": "BBWS180206575",
            "dpc": "03041819201",
            "name": "ហ៊ីម ហេង"
        },
        {
            "barcode": "BBWS180206576",
            "dpc": "03041819301",
            "name": "ប៉ាល់ ពៅ"
        },
        {
            "barcode": "BBWS180206577",
            "dpc": "03041819401",
            "name": "សុខ គន្ធី ២"
        },
        {
            "barcode": "BBWS180206578",
            "dpc": "03041819501",
            "name": "មុំវិសិទ្ធ"
        },
        {
            "barcode": "BBWS180206579",
            "dpc": "03041819701",
            "name": "ឆឺន ផាន"
        },
        {
            "barcode": "BBWS180206580",
            "dpc": "03041819901",
            "name": "ពេទ្យ ភាព"
        },
        {
            "barcode": "BBWS180206581",
            "dpc": "03041820001",
            "name": "កេះ ប៊ុនអើយ ១"
        },
        {
            "barcode": "BBWS180206582",
            "dpc": "03041820101",
            "name": "ម៉ុត សាវិវណ្ណា"
        },
        {
            "barcode": "BBWS180206583",
            "dpc": "03041820201",
            "name": "មាស សារ៉ាត់"
        },
        {
            "barcode": "BBWS180206584",
            "dpc": "03041820301",
            "name": "ប៊ុន អើយកេះ"
        },
        {
            "barcode": "BBWS180206585",
            "dpc": "03041820401",
            "name": "អ៊ី ប៊ុនរឿន"
        },
        {
            "barcode": "BBWS180206586",
            "dpc": "03041820501",
            "name": "ធី ១"
        },
        {
            "barcode": "BBWS180206587",
            "dpc": "03041820601",
            "name": "ធី ២"
        },
        {
            "barcode": "BBWS180206588",
            "dpc": "03041820701",
            "name": "ប៉ុល សាវុធ"
        },
        {
            "barcode": "BBWS180206589",
            "dpc": "03041820801",
            "name": "ចៅ យឿត"
        },
        {
            "barcode": "BBWS180206590",
            "dpc": "03041821001",
            "name": "ផាន់ វិបុល"
        },
        {
            "barcode": "BBWS180206591",
            "dpc": "03041821101",
            "name": "កេះ សោភ័ណ្ឌ ១"
        },
        {
            "barcode": "BBWS180206592",
            "dpc": "03041821201",
            "name": "កេស សលផល"
        },
        {
            "barcode": "BBWS180206593",
            "dpc": "03041821301",
            "name": "ជា ទូយ"
        },
        {
            "barcode": "BBWS180206594",
            "dpc": "03041821401",
            "name": "តូច លក្ខិណា"
        },
        {
            "barcode": "BBWS180206595",
            "dpc": "03041802701",
            "name": "ញឹក សុផាណារ៉ាក់"
        },
        {
            "barcode": "BBWS180206596",
            "dpc": "03041821501",
            "name": "ព្រះវិហារចិន"
        },
        {
            "barcode": "BBWS180206597",
            "dpc": "03041821601",
            "name": "យង់   ទីណូ"
        },
        {
            "barcode": "BBWS180206598",
            "dpc": "03041821701",
            "name": "ផេង សារុំ"
        },
        {
            "barcode": "BBWS180206599",
            "dpc": "03041821801",
            "name": "ម៉ៅ សាវី"
        },
        {
            "barcode": "BBWS180206600",
            "dpc": "03041821901",
            "name": "ហោ ហៀប"
        },
        {
            "barcode": "BBWS180206601",
            "dpc": "03041822001",
            "name": "ជួន  ហុង"
        },
        {
            "barcode": "BBWS180206602",
            "dpc": "03041822101",
            "name": "តឹក ប៊ុនឡុង"
        },
        {
            "barcode": "BBWS180206603",
            "dpc": "03041822201",
            "name": "យាំ យ៉េត ១"
        },
        {
            "barcode": "BBWS180206604",
            "dpc": "03041828201",
            "name": "ហ៊ាន ហ៊ឺម ២"
        },
        {
            "barcode": "BBWS180206605",
            "dpc": "03041822301",
            "name": "សរ  ខាន់ថន"
        },
        {
            "barcode": "BBWS180206606",
            "dpc": "03041822401",
            "name": "អ៊ឹង សុន្ធា"
        },
        {
            "barcode": "BBWS180206607",
            "dpc": "03041822501",
            "name": "សុខ ណាគ្រី"
        },
        {
            "barcode": "BBWS180206608",
            "dpc": "03041822601",
            "name": "មាឃ ម៉ារិន"
        },
        {
            "barcode": "BBWS180206609",
            "dpc": "03041822801",
            "name": "ហ៊ាន ប៊ុនធឿម"
        },
        {
            "barcode": "BBWS180206610",
            "dpc": "03041822901",
            "name": "ឃុត ចាន់ដារ៉ា"
        },
        {
            "barcode": "BBWS180206611",
            "dpc": "03041823001",
            "name": "ទៀវ សឿម"
        },
        {
            "barcode": "BBWS180206612",
            "dpc": "03041823201",
            "name": "គុយ  ថុល"
        },
        {
            "barcode": "BBWS180206613",
            "dpc": "03041823301",
            "name": "ដន លន់ ១"
        },
        {
            "barcode": "BBWS180206614",
            "dpc": "03041823401",
            "name": "ង៉ែត សុផា"
        },
        {
            "barcode": "BBWS180206615",
            "dpc": "03041823501",
            "name": "វ៉ាន់ វីរៈ"
        },
        {
            "barcode": "BBWS180206616",
            "dpc": "03041823601",
            "name": "វង្ស វ៉ាន់ណាវី"
        },
        {
            "barcode": "BBWS180206617",
            "dpc": "03041823701",
            "name": "ភោគ ភាព"
        },
        {
            "barcode": "BBWS180206618",
            "dpc": "03041823801",
            "name": "ខៀវ រ៉ាហ្វី ២"
        },
        {
            "barcode": "BBWS180206619",
            "dpc": "03041823901",
            "name": "សុខ គង់ ១"
        },
        {
            "barcode": "BBWS180206620",
            "dpc": "03041824001",
            "name": "អ៊ិន តាំ"
        },
        {
            "barcode": "BBWS180206621",
            "dpc": "03041824101",
            "name": "វិហារជិការអិល"
        },
        {
            "barcode": "BBWS180206622",
            "dpc": "03041824201",
            "name": "ស៊ឹម ណាលី"
        },
        {
            "barcode": "BBWS180206623",
            "dpc": "03041824301",
            "name": "លី ប៊ុនហេង"
        },
        {
            "barcode": "BBWS180206624",
            "dpc": "03041824401",
            "name": "សុខ គង់ ២"
        },
        {
            "barcode": "BBWS180206625",
            "dpc": "03041824501",
            "name": "ខៀវ រ៉ាហ្វី"
        },
        {
            "barcode": "BBWS180206626",
            "dpc": "03041824601",
            "name": "ម៉ី ពៅ"
        },
        {
            "barcode": "BBWS180206627",
            "dpc": "03041824701",
            "name": "ចាប ធូ"
        },
        {
            "barcode": "BBWS180206628",
            "dpc": "03041824801",
            "name": "ចាន់ ឬទ្ធី"
        },
        {
            "barcode": "BBWS180206629",
            "dpc": "03041824901",
            "name": "យឹន  រឿប"
        },
        {
            "barcode": "BBWS180206630",
            "dpc": "03041825001",
            "name": "ចាន់ សុធី"
        },
        {
            "barcode": "BBWS180206631",
            "dpc": "03041825101",
            "name": "សួន សិលា"
        },
        {
            "barcode": "BBWS180206632",
            "dpc": "03041825301",
            "name": "ខៀវ ប៊ុនរឿប"
        },
        {
            "barcode": "BBWS180206633",
            "dpc": "03041825501",
            "name": "គុជ ស៊ីណា"
        },
        {
            "barcode": "BBWS180206634",
            "dpc": "03041825601",
            "name": "ឡុង សារឿន"
        },
        {
            "barcode": "BBWS180206635",
            "dpc": "03041825801",
            "name": "វ៉ាត វ៉ាន់ឆែ"
        },
        {
            "barcode": "BBWS180206636",
            "dpc": "03041825901",
            "name": "ទូច សុម៉ាលី"
        },
        {
            "barcode": "BBWS180206637",
            "dpc": "03041826001",
            "name": "ហម ភីរ៉ាត់"
        },
        {
            "barcode": "BBWS180206638",
            "dpc": "03041826101",
            "name": "ឃឹម ទិព្វមុនី"
        },
        {
            "barcode": "BBWS180206639",
            "dpc": "03041826201",
            "name": "ឆូយចំរើន"
        },
        {
            "barcode": "BBWS180206640",
            "dpc": "03041826301",
            "name": "ក្រិទ្ធ រិន"
        },
        {
            "barcode": "BBWS180206641",
            "dpc": "03041826501",
            "name": "យឺន វាសនា"
        },
        {
            "barcode": "BBWS180206642",
            "dpc": "03041826601",
            "name": "អ៊ី អ៊ារ"
        },
        {
            "barcode": "BBWS180206643",
            "dpc": "03041826701",
            "name": "តឹប  ហូវ"
        },
        {
            "barcode": "BBWS180206644",
            "dpc": "03041826801",
            "name": "ទៀង គឹមហេង"
        },
        {
            "barcode": "BBWS180206645",
            "dpc": "03041826901",
            "name": "អ៊ីវ រតនា"
        },
        {
            "barcode": "BBWS180206646",
            "dpc": "03041827001",
            "name": "ប៊ូ ប៊ុនណាត"
        },
        {
            "barcode": "BBWS180206647",
            "dpc": "03041806701",
            "name": "ម៉ោញ សារ៉ាត់"
        },
        {
            "barcode": "BBWS180206648",
            "dpc": "03041827101",
            "name": "ហូយ  ចាន់ឌី"
        },
        {
            "barcode": "BBWS180206649",
            "dpc": "03041827201",
            "name": "យ៉ាង វ៉ាន់ហេង"
        },
        {
            "barcode": "BBWS180206650",
            "dpc": "03041827301",
            "name": "ច័ន្ទ  ស៊ីឡា"
        },
        {
            "barcode": "BBWS180206651",
            "dpc": "03041829201",
            "name": "រ៉ែ សានិតា"
        },
        {
            "barcode": "BBWS180206652",
            "dpc": "03041827501",
            "name": "សួន រិទ្ធី"
        },
        {
            "barcode": "BBWS180206653",
            "dpc": "03041827601",
            "name": "លន់ ប៊ុនឡេង"
        },
        {
            "barcode": "BBWS180206654",
            "dpc": "03041827701",
            "name": "សួន  គឿន"
        },
        {
            "barcode": "BBWS180206655",
            "dpc": "03041827901",
            "name": "គ្រាល សុភាព"
        },
        {
            "barcode": "BBWS180206656",
            "dpc": "03041828901",
            "name": "រស់ ហឿន"
        },
        {
            "barcode": "BBWS180206657",
            "dpc": "03041829001",
            "name": "ម៉ែន សុវណ្ណ"
        },
        {
            "barcode": "BBWS180206658",
            "dpc": "03041829301",
            "name": "ប៊ូ ប៊ុនណាត"
        },
        {
            "barcode": "BBWS180206659",
            "dpc": "03041829401",
            "name": "ឆាយ សុធា"
        },
        {
            "barcode": "BBWS180206660",
            "dpc": "03041829601",
            "name": "យៀម សុផាត"
        },
        {
            "barcode": "BBWS180206661",
            "dpc": "03041829801",
            "name": "ផា រឿន"
        },
        {
            "barcode": "BBWS180206662",
            "dpc": "03041829901",
            "name": "គូ សុងលី"
        },
        {
            "barcode": "BBWS180206663",
            "dpc": "03041830001",
            "name": "ម៉ៅ មឿង"
        },
        {
            "barcode": "BBWS180206664",
            "dpc": "03041830901",
            "name": "ស៊ីន ឃន ២"
        },
        {
            "barcode": "BBWS180206665",
            "dpc": "03041830701",
            "name": "តាម វៃ"
        },
        {
            "barcode": "BBWS180206666",
            "dpc": "03041830801",
            "name": "ជា សារិន"
        },
        {
            "barcode": "BBWS180206667",
            "dpc": "03041830501",
            "name": "សុង ឈុនលី"
        },
        {
            "barcode": "BBWS180206668",
            "dpc": "03041830601",
            "name": "ជា វិឆ្ឆ័យ"
        },
        {
            "barcode": "BBWS180206669",
            "dpc": "03041837201",
            "name": "ហ្វីលីពីនបាហាយ"
        },
        {
            "barcode": "BBWS180206670",
            "dpc": "03041830401",
            "name": "ញ៉ែម រ៉ានី"
        },
        {
            "barcode": "BBWS180206671",
            "dpc": "03041830201",
            "name": "សែម សុគន្ធា"
        },
        {
            "barcode": "BBWS180206672",
            "dpc": "03041830101",
            "name": "ម៉ុង ហោ"
        },
        {
            "barcode": "BBWS180206673",
            "dpc": "03041838301",
            "name": "ជុំ ពោ"
        },
        {
            "barcode": "BBWS180206674",
            "dpc": "03041838201",
            "name": "អ៊ឹង ឡាយហ៊ក"
        },
        {
            "barcode": "BBWS180206675",
            "dpc": "03041838101",
            "name": "សាប់ គឹមឆម"
        },
        {
            "barcode": "BBWS180206676",
            "dpc": "03041838001",
            "name": "ខឹម  សាមុត៉ុ"
        },
        {
            "barcode": "BBWS180206677",
            "dpc": "03041837901",
            "name": "ស៊ុន សុវណ្ណ"
        },
        {
            "barcode": "BBWS180206678",
            "dpc": "03041802101",
            "name": "លឹម ប៊ុនហេង"
        },
        {
            "barcode": "BBWS180206679",
            "dpc": "03041836901",
            "name": "សេង សុខា"
        },
        {
            "barcode": "BBWS180206680",
            "dpc": "03041837001",
            "name": "សេង សុវត្ថិឌី"
        },
        {
            "barcode": "BBWS180206681",
            "dpc": "03041802601",
            "name": "ឡែន សំអាត"
        },
        {
            "barcode": "BBWS180206682",
            "dpc": "03041837101",
            "name": "ម៉ិល សុផល"
        },
        {
            "barcode": "BBWS180206683",
            "dpc": "03041837301",
            "name": "សួន សាវិញ"
        },
        {
            "barcode": "BBWS180206684",
            "dpc": "03041837401",
            "name": "សោម មុន្នីរ័ត្ន"
        },
        {
            "barcode": "BBWS180206685",
            "dpc": "03041837501",
            "name": "សេង ពៅ"
        },
        {
            "barcode": "BBWS180206686",
            "dpc": "03041837601",
            "name": "អៀម ដានី"
        },
        {
            "barcode": "BBWS180206687",
            "dpc": "03041837701",
            "name": "គង់ សំភ័ស្ស"
        },
        {
            "barcode": "BBWS180206688",
            "dpc": "03041837801",
            "name": "អ៊ុំ សុខា"
        },
        {
            "barcode": "BBWS180206689",
            "dpc": "03041836801",
            "name": "ធឹង គឹមហេង១"
        },
        {
            "barcode": "BBWS180206690",
            "dpc": "03041836701",
            "name": "ជួ  សុខ"
        },
        {
            "barcode": "BBWS180206691",
            "dpc": "03041836601",
            "name": "នាង រដ្ឋា"
        },
        {
            "barcode": "BBWS180206692",
            "dpc": "03041836501",
            "name": "អ៊ុក គឹម"
        },
        {
            "barcode": "BBWS180206693",
            "dpc": "03041836201",
            "name": "កែវ នីម"
        },
        {
            "barcode": "BBWS180206694",
            "dpc": "03041836101",
            "name": "អ៊ីវ កុលស្ស"
        },
        {
            "barcode": "BBWS180206695",
            "dpc": "03041836001",
            "name": "សុខ គឹមសួរ"
        },
        {
            "barcode": "BBWS180206696",
            "dpc": "03041835901",
            "name": "អ៊ុក ចន្ថា"
        },
        {
            "barcode": "BBWS180206697",
            "dpc": "03041835801",
            "name": "ឃុត អ៊ឹង"
        },
        {
            "barcode": "BBWS180206698",
            "dpc": "03041835701",
            "name": "ស៊ឹម ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180206699",
            "dpc": "03041835501",
            "name": "ជា  វណ្ណារិទ្ធ"
        },
        {
            "barcode": "BBWS180206700",
            "dpc": "03041835401",
            "name": "លឿង សុឃីម"
        },
        {
            "barcode": "BBWS180206701",
            "dpc": "03041835301",
            "name": "អ៊ុក វាសនា"
        },
        {
            "barcode": "BBWS180206702",
            "dpc": "03041835201",
            "name": "ប្រាក់ យូ"
        },
        {
            "barcode": "BBWS180206703",
            "dpc": "03041835101",
            "name": "គឹម វណ្ណឌី"
        },
        {
            "barcode": "BBWS180206704",
            "dpc": "03041835001",
            "name": "អ៊ឹម សុខឿន"
        },
        {
            "barcode": "BBWS180206705",
            "dpc": "03041834901",
            "name": "លឿង សុវណ្ណា"
        },
        {
            "barcode": "BBWS180206706",
            "dpc": "03041834801",
            "name": "ម៉ៅ មើរ"
        },
        {
            "barcode": "BBWS180206707",
            "dpc": "03041834701",
            "name": "អ៊ុត ណែ"
        },
        {
            "barcode": "BBWS180206708",
            "dpc": "03041819801",
            "name": "សែស សារ៉ុម"
        },
        {
            "barcode": "BBWS180206709",
            "dpc": "03041834601",
            "name": "ស៊ុន គឹមថៃ"
        },
        {
            "barcode": "BBWS180206710",
            "dpc": "03041834501",
            "name": "ធាង  ណុង"
        },
        {
            "barcode": "BBWS180206711",
            "dpc": "03041834401",
            "name": "វ៉ាន់ ប៊ុនធៀប"
        },
        {
            "barcode": "BBWS180206712",
            "dpc": "03041834301",
            "name": "សាន ហឿម"
        },
        {
            "barcode": "BBWS180206713",
            "dpc": "03041834201",
            "name": "លាង សំអ៊ុល"
        },
        {
            "barcode": "BBWS180206714",
            "dpc": "03041834101",
            "name": "តឹង អៀង"
        },
        {
            "barcode": "BBWS180206715",
            "dpc": "03041834001",
            "name": "ភោគ សុផុន"
        },
        {
            "barcode": "BBWS180206716",
            "dpc": "03041833901",
            "name": "ស៊ុំ លឹម"
        },
        {
            "barcode": "BBWS180206717",
            "dpc": "03041833801",
            "name": "អ៊ិត វុទ្ធី"
        },
        {
            "barcode": "BBWS180206718",
            "dpc": "03041833701",
            "name": "ហ៊ាង ថុង"
        },
        {
            "barcode": "BBWS180206719",
            "dpc": "03041833601",
            "name": "ស៊ាង ហ៊ួត"
        },
        {
            "barcode": "BBWS180206720",
            "dpc": "03041833501",
            "name": "កាក់ សុខា"
        },
        {
            "barcode": "BBWS180206721",
            "dpc": "03041833401",
            "name": "ខាវ ហួត"
        },
        {
            "barcode": "BBWS180206722",
            "dpc": "03041833301",
            "name": "អ៊ុក ឃ្នួច ២"
        },
        {
            "barcode": "BBWS180206723",
            "dpc": "03041833201",
            "name": "អ៊ុក ឃ្នួច ១"
        },
        {
            "barcode": "BBWS180206724",
            "dpc": "03041833101",
            "name": "ម៉ុច សុម៉ាល័យ"
        },
        {
            "barcode": "BBWS180206725",
            "dpc": "03041833001",
            "name": "នៅ បុល"
        },
        {
            "barcode": "BBWS180206726",
            "dpc": "03041832901",
            "name": "ខាំ ឈៀង"
        },
        {
            "barcode": "BBWS180206727",
            "dpc": "03041832801",
            "name": "ផុន ប្រុស"
        },
        {
            "barcode": "BBWS180206728",
            "dpc": "03041832701",
            "name": "ខេង កែវពិដ្ឋ"
        },
        {
            "barcode": "BBWS180206729",
            "dpc": "03041832601",
            "name": "ទៀង មុនីរដ្ឋា"
        },
        {
            "barcode": "BBWS180206730",
            "dpc": "03041832501",
            "name": "ដុះ ឈួម"
        },
        {
            "barcode": "BBWS180206731",
            "dpc": "03041831901",
            "name": "លឹម សុខម៉េង"
        },
        {
            "barcode": "BBWS180206732",
            "dpc": "03041832001",
            "name": "ហួន សារ៉ាយ"
        },
        {
            "barcode": "BBWS180206733",
            "dpc": "03041832101",
            "name": "វង្ស គឹមសៀក"
        },
        {
            "barcode": "BBWS180206734",
            "dpc": "03041832201",
            "name": "លឿង ណាវី"
        },
        {
            "barcode": "BBWS180206735",
            "dpc": "03041832301",
            "name": "ប៉ាង វុទ្ធី"
        },
        {
            "barcode": "BBWS180206736",
            "dpc": "03041832401",
            "name": "សឿរ សុខុម"
        },
        {
            "barcode": "BBWS180206737",
            "dpc": "03041825201",
            "name": "សុខ ចំរើន"
        },
        {
            "barcode": "BBWS180206738",
            "dpc": "03041831801",
            "name": "លឿង លៀង"
        },
        {
            "barcode": "BBWS180206739",
            "dpc": "03041831701",
            "name": "ដន លន់"
        },
        {
            "barcode": "BBWS180206740",
            "dpc": "03041831601",
            "name": "ព្រីង បញ្ញារិទ្ធ"
        },
        {
            "barcode": "BBWS180206741",
            "dpc": "03041831501",
            "name": "ទូច សេន"
        },
        {
            "barcode": "BBWS180206742",
            "dpc": "03041831401",
            "name": "ឆិវ សុខឡេង"
        },
        {
            "barcode": "BBWS180206743",
            "dpc": "03041831301",
            "name": "ផែ ប៊ុនឡុង"
        },
        {
            "barcode": "BBWS180206744",
            "dpc": "03041831201",
            "name": "ជី ខេង"
        },
        {
            "barcode": "BBWS180206745",
            "dpc": "03041831101",
            "name": "ប្រាក់ សាលឿត"
        },
        {
            "barcode": "BBWS180206746",
            "dpc": "03041831001",
            "name": "ម៉ម នាង"
        },
        {
            "barcode": "BBWS180206747",
            "dpc": "03041802901",
            "name": "ជូ  តឹក"
        },
        {
            "barcode": "BBWS180206748",
            "dpc": "03041804901",
            "name": "លឹម  តុង"
        },
        {
            "barcode": "BBWS180206749",
            "dpc": "03041805201",
            "name": "ប៊ូ  លាង"
        },
        {
            "barcode": "BBWS180206750",
            "dpc": "03041805301",
            "name": "ប៊ូ   ណាវី"
        },
        {
            "barcode": "BBWS180206751",
            "dpc": "03041811801",
            "name": "រឿន  រ៉េត"
        },
        {
            "barcode": "BBWS180206752",
            "dpc": "03041812001",
            "name": "អ៊ុន  គីជន"
        },
        {
            "barcode": "BBWS180206753",
            "dpc": "03041827801",
            "name": "ខា  ហេង"
        },
        {
            "barcode": "BBWS180206754",
            "dpc": "03041828001",
            "name": "រត្ន  សារ៉ែម"
        },
        {
            "barcode": "BBWS180206755",
            "dpc": "03041848001",
            "name": "ស៊ុន សូ"
        }
    ]
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
