let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=

    [
        {
            "barcode": "BBWS180206756",
            "dpc": "03041902401",
            "name": "ទូច រៀម"
        },
        {
            "barcode": "BBWS180206757",
            "dpc": "03041902501",
            "name": "កែវ ផលរដ្ឋ"
        },
        {
            "barcode": "BBWS180206758",
            "dpc": "03041913401",
            "name": "ហោល វ៉ាន"
        },
        {
            "barcode": "BBWS180206759",
            "dpc": "03041913501",
            "name": "ជួង គឹមសាន"
        },
        {
            "barcode": "BBWS180206760",
            "dpc": "03041913601",
            "name": "ជិន ចាន់"
        },
        {
            "barcode": "BBWS180206761",
            "dpc": "03041913701",
            "name": "សែម ធួន"
        },
        {
            "barcode": "BBWS180206762",
            "dpc": "03041913801",
            "name": "លាង ឆេង"
        },
        {
            "barcode": "BBWS180206763",
            "dpc": "03041913901",
            "name": "អៃ  អ៊ី"
        },
        {
            "barcode": "BBWS180206764",
            "dpc": "03041914001",
            "name": "ចាន់ នីស្សា"
        },
        {
            "barcode": "BBWS180206765",
            "dpc": "03041914101",
            "name": "សុខ ឌួង"
        },
        {
            "barcode": "BBWS180206766",
            "dpc": "03041914201",
            "name": "ឡៃ ហ៊ាង"
        },
        {
            "barcode": "BBWS180206767",
            "dpc": "03041914301",
            "name": "ហុក ហេង"
        },
        {
            "barcode": "BBWS180206768",
            "dpc": "03041914601",
            "name": "ដៀប គាំ"
        },
        {
            "barcode": "BBWS180206769",
            "dpc": "03041914701",
            "name": "តាន់ គឹមស្រូ"
        },
        {
            "barcode": "BBWS180206770",
            "dpc": "03041914801",
            "name": "ស៊ីវ ខេង"
        },
        {
            "barcode": "BBWS180206771",
            "dpc": "03041914901",
            "name": "ហែន ឆាំ"
        },
        {
            "barcode": "BBWS180206772",
            "dpc": "03041915001",
            "name": "កែ ឃាន"
        },
        {
            "barcode": "BBWS180206773",
            "dpc": "03041915101",
            "name": "ប្រាក់ ថាវី"
        },
        {
            "barcode": "BBWS180206774",
            "dpc": "03041915201",
            "name": "កែ ឆេន"
        },
        {
            "barcode": "BBWS180206775",
            "dpc": "03041915301",
            "name": "ម៉ូ ភឿត"
        },
        {
            "barcode": "BBWS180206776",
            "dpc": "03041915401",
            "name": "អៀម គុយ"
        },
        {
            "barcode": "BBWS180206777",
            "dpc": "03041915501",
            "name": "ហ៊ីង ចាន់ថន"
        },
        {
            "barcode": "BBWS180206778",
            "dpc": "03041915601",
            "name": "ភិន សុផាត"
        },
        {
            "barcode": "BBWS180206779",
            "dpc": "03041915701",
            "name": "អ៊ុច ភិន"
        },
        {
            "barcode": "BBWS180206780",
            "dpc": "03041915801",
            "name": "អ៊ុច សុភី"
        },
        {
            "barcode": "BBWS180206781",
            "dpc": "03041915901",
            "name": "អ៊ុក សារ៉េត"
        },
        {
            "barcode": "BBWS180206782",
            "dpc": "03041916001",
            "name": "ស៊ុន បូរី"
        },
        {
            "barcode": "BBWS180206783",
            "dpc": "03041916101",
            "name": "សេក ចាន់រស្មី"
        },
        {
            "barcode": "BBWS180206784",
            "dpc": "03041916201",
            "name": "ជ័យ ពីន"
        },
        {
            "barcode": "BBWS180206785",
            "dpc": "03041916301",
            "name": "ណុប គុំ"
        },
        {
            "barcode": "BBWS180206786",
            "dpc": "03041916401",
            "name": "ពៅ ឈឿន"
        },
        {
            "barcode": "BBWS180206787",
            "dpc": "03041916501",
            "name": "ពៅ វណ្ណា"
        },
        {
            "barcode": "BBWS180206788",
            "dpc": "03041916601",
            "name": "តឹក គឹមសន"
        },
        {
            "barcode": "BBWS180206789",
            "dpc": "03041916801",
            "name": "វឿត ចាន់ណា"
        },
        {
            "barcode": "BBWS180206790",
            "dpc": "03041916901",
            "name": "លិញ ផាន"
        },
        {
            "barcode": "BBWS180206791",
            "dpc": "03041917101",
            "name": "ម៉ូត វោយហូរ"
        },
        {
            "barcode": "BBWS180206792",
            "dpc": "03041917001",
            "name": "ជឹង គឹមសុន"
        },
        {
            "barcode": "BBWS180206793",
            "dpc": "03041917201",
            "name": "ជឹង ញ៉េន"
        },
        {
            "barcode": "BBWS180206794",
            "dpc": "03041917301",
            "name": "អេន សាខន"
        },
        {
            "barcode": "BBWS180206795",
            "dpc": "03041917401",
            "name": "វឿន វ័ន្ត"
        },
        {
            "barcode": "BBWS180206796",
            "dpc": "03041917501",
            "name": "ទិត យ៉ុម"
        },
        {
            "barcode": "BBWS180206797",
            "dpc": "03041917601",
            "name": "សេក សុផុន"
        },
        {
            "barcode": "BBWS180206798",
            "dpc": "03041917701",
            "name": "តិប សុមន្នី"
        },
        {
            "barcode": "BBWS180206799",
            "dpc": "03041917901",
            "name": "ទូច គង់"
        },
        {
            "barcode": "BBWS180206800",
            "dpc": "03041918101",
            "name": "វង  ស្រីទូច"
        },
        {
            "barcode": "BBWS180206801",
            "dpc": "03041918001",
            "name": "ទូច សឿង"
        },
        {
            "barcode": "BBWS180206802",
            "dpc": "03041918201",
            "name": "សេន វន"
        },
        {
            "barcode": "BBWS180206803",
            "dpc": "03041918301",
            "name": "សុខ នាង"
        },
        {
            "barcode": "BBWS180206804",
            "dpc": "03041918501",
            "name": "ឆោម ប៊ុនធី"
        },
        {
            "barcode": "BBWS180206805",
            "dpc": "03041918601",
            "name": "ចាន់ មណ្ឌល"
        },
        {
            "barcode": "BBWS180206806",
            "dpc": "03041918701",
            "name": "ស៊ុំំ គឹមយ៉េង"
        },
        {
            "barcode": "BBWS180206807",
            "dpc": "03041918801",
            "name": "ម៉េង វែង"
        },
        {
            "barcode": "BBWS180206808",
            "dpc": "03041918901",
            "name": "ញ៉ែម កេត"
        },
        {
            "barcode": "BBWS180206809",
            "dpc": "03041919001",
            "name": "ស៊ីវ ខេន"
        },
        {
            "barcode": "BBWS180206810",
            "dpc": "03041919101",
            "name": "កែវ ស"
        },
        {
            "barcode": "BBWS180206811",
            "dpc": "03041919201",
            "name": "ស៊ូ ថន"
        },
        {
            "barcode": "BBWS180206812",
            "dpc": "03041919301",
            "name": "គុយ ចាន់ផេង"
        },
        {
            "barcode": "BBWS180206813",
            "dpc": "03041919401",
            "name": "តាំង ឆេងហ៊ាង"
        },
        {
            "barcode": "BBWS180206814",
            "dpc": "03041919501",
            "name": "ហឿង វណ្ណដេត"
        },
        {
            "barcode": "BBWS180206815",
            "dpc": "03041919601",
            "name": "អ៊ឹង សំបូរ"
        },
        {
            "barcode": "BBWS180206816",
            "dpc": "03041919801",
            "name": "ព្រឿន ស្រីរដ្ឋ"
        },
        {
            "barcode": "BBWS180206817",
            "dpc": "03041919901",
            "name": "ព្រីង   ចំរើន"
        },
        {
            "barcode": "BBWS180206818",
            "dpc": "03041920001",
            "name": "ទុង   រ៉ាដូ"
        },
        {
            "barcode": "BBWS180206819",
            "dpc": "03041920101",
            "name": "ម៉ិល ណេង"
        },
        {
            "barcode": "BBWS180206820",
            "dpc": "03041920201",
            "name": "ម៉ៅ សុផាត"
        },
        {
            "barcode": "BBWS180206821",
            "dpc": "03041920301",
            "name": "សៅ ស៊ីថា"
        },
        {
            "barcode": "BBWS180206822",
            "dpc": "03041920401",
            "name": "សំ ស៊ីណាត"
        },
        {
            "barcode": "BBWS180206823",
            "dpc": "03041920501",
            "name": "ហែម សាន"
        },
        {
            "barcode": "BBWS180206824",
            "dpc": "03041920701",
            "name": "អោក សុវណ្ណ"
        },
        {
            "barcode": "BBWS180206825",
            "dpc": "03041920801",
            "name": "សូ ម៉ន"
        },
        {
            "barcode": "BBWS180206826",
            "dpc": "03041920901",
            "name": "មាន ធន"
        },
        {
            "barcode": "BBWS180206827",
            "dpc": "03041921001",
            "name": "ដេន តាំង"
        },
        {
            "barcode": "BBWS180206828",
            "dpc": "03041921101",
            "name": "នៅ ស៊ីថា"
        },
        {
            "barcode": "BBWS180206829",
            "dpc": "03041921201",
            "name": "រុន  ថែល"
        },
        {
            "barcode": "BBWS180206830",
            "dpc": "03041921301",
            "name": "សូ សៀក"
        },
        {
            "barcode": "BBWS180206831",
            "dpc": "03041921401",
            "name": "កៅ សុខលី"
        },
        {
            "barcode": "BBWS180206832",
            "dpc": "03041921501",
            "name": "អ៊ឹម សារឿន"
        },
        {
            "barcode": "BBWS180206833",
            "dpc": "03041921601",
            "name": "ឡៃ ស៊ីណាត"
        },
        {
            "barcode": "BBWS180206834",
            "dpc": "03041921701",
            "name": "ព្រាប សុជាតា"
        },
        {
            "barcode": "BBWS180206835",
            "dpc": "03041921801",
            "name": "ងន់ ប៊ុន"
        },
        {
            "barcode": "BBWS180206836",
            "dpc": "03041921901",
            "name": "ឈឺន ឆូយ"
        },
        {
            "barcode": "BBWS180206837",
            "dpc": "03041922001",
            "name": "សេង ហៀប"
        },
        {
            "barcode": "BBWS180206838",
            "dpc": "03041922101",
            "name": "ម៉ឺន សុខុន"
        },
        {
            "barcode": "BBWS180206839",
            "dpc": "03041922201",
            "name": "នូ សាម៉ុន"
        },
        {
            "barcode": "BBWS180206840",
            "dpc": "03041922301",
            "name": "ប៉ោ គឹមវិទ្ធ"
        },
        {
            "barcode": "BBWS180206841",
            "dpc": "03041922401",
            "name": "គឹម យៀក"
        },
        {
            "barcode": "BBWS180206842",
            "dpc": "03041922501",
            "name": "គឹម ជៀន"
        },
        {
            "barcode": "BBWS180206843",
            "dpc": "03041922601",
            "name": "ទី គឹមអៀង"
        },
        {
            "barcode": "BBWS180206844",
            "dpc": "03041922701",
            "name": "ឡេង វិសាល"
        },
        {
            "barcode": "BBWS180206845",
            "dpc": "03041922901",
            "name": "សន មុន្នី"
        },
        {
            "barcode": "BBWS180206846",
            "dpc": "03041923001",
            "name": "គឹម សួរ"
        },
        {
            "barcode": "BBWS180206847",
            "dpc": "03041923101",
            "name": "ឈឹម  ឡែន"
        },
        {
            "barcode": "BBWS180206848",
            "dpc": "03041923201",
            "name": "ជុន ស៊ីថា"
        },
        {
            "barcode": "BBWS180206849",
            "dpc": "03041923301",
            "name": "កៅ ហៃ"
        },
        {
            "barcode": "BBWS180206850",
            "dpc": "03041923401",
            "name": "ណុប ស្រីនាង"
        },
        {
            "barcode": "BBWS180206851",
            "dpc": "03041923501",
            "name": "នៅ សារឿត"
        },
        {
            "barcode": "BBWS180206852",
            "dpc": "03041923601",
            "name": "ឯម ហេង"
        },
        {
            "barcode": "BBWS180206853",
            "dpc": "03041923801",
            "name": "ឈិត ទាប"
        },
        {
            "barcode": "BBWS180206854",
            "dpc": "03041923901",
            "name": "ឯក ធឿង"
        },
        {
            "barcode": "BBWS180206855",
            "dpc": "03041924001",
            "name": "មាឃខ ណារិន"
        },
        {
            "barcode": "BBWS180206856",
            "dpc": "03041924101",
            "name": "ហម  សុភា"
        },
        {
            "barcode": "BBWS180206857",
            "dpc": "03041924201",
            "name": "ទុយ វឺ"
        },
        {
            "barcode": "BBWS180206858",
            "dpc": "03041924301",
            "name": "រស់ រិទ្ធ"
        },
        {
            "barcode": "BBWS180206859",
            "dpc": "03041924401",
            "name": "សេង គង់"
        },
        {
            "barcode": "BBWS180206860",
            "dpc": "03041924501",
            "name": "គឹម សុខា"
        },
        {
            "barcode": "BBWS180206861",
            "dpc": "03041924601",
            "name": "ធូ សារិន"
        },
        {
            "barcode": "BBWS180206862",
            "dpc": "03041924701",
            "name": "កែវ ប៊ុនឈឿន"
        },
        {
            "barcode": "BBWS180206863",
            "dpc": "03041924801",
            "name": "ផេង ផល្លី"
        },
        {
            "barcode": "BBWS180206864",
            "dpc": "03041900101",
            "name": "ជិន នៅ"
        },
        {
            "barcode": "BBWS180206865",
            "dpc": "03041900201",
            "name": "រស់ សំអាត"
        },
        {
            "barcode": "BBWS180206866",
            "dpc": "03041902701",
            "name": "មុំ សាមឌី"
        },
        {
            "barcode": "BBWS180206867",
            "dpc": "03041902801",
            "name": "ស៊ុម លឹម"
        },
        {
            "barcode": "BBWS180206868",
            "dpc": "03041902901",
            "name": "ស៊ុម ឡេង"
        },
        {
            "barcode": "BBWS180206869",
            "dpc": "03041903101",
            "name": "គង់ ស្រគៀល"
        },
        {
            "barcode": "BBWS180206870",
            "dpc": "03041903401",
            "name": "ភឿ គឹមលី"
        },
        {
            "barcode": "BBWS180206871",
            "dpc": "03041903501",
            "name": "ប៉ែន ទូច"
        },
        {
            "barcode": "BBWS180206872",
            "dpc": "03041903601",
            "name": "ហែម ធុយ"
        },
        {
            "barcode": "BBWS180206873",
            "dpc": "03041903701",
            "name": "ពេជ្រ សុធា"
        },
        {
            "barcode": "BBWS180206874",
            "dpc": "03041903801",
            "name": "ខាត់ សុខ"
        },
        {
            "barcode": "BBWS180206875",
            "dpc": "03041903901",
            "name": "ស៊ិន ចាន់ពៅរ៉ូហ្សិត"
        },
        {
            "barcode": "BBWS180206876",
            "dpc": "03041904001",
            "name": "ឃុន សារ៉ាឌី"
        },
        {
            "barcode": "BBWS180206877",
            "dpc": "03041904101",
            "name": "ហ៊ុយ ហ៊ាង"
        },
        {
            "barcode": "BBWS180206878",
            "dpc": "03041904201",
            "name": "តាំង ពិសី"
        },
        {
            "barcode": "BBWS180206879",
            "dpc": "03041904301",
            "name": "ប៊ុន លី"
        },
        {
            "barcode": "BBWS180206880",
            "dpc": "03041904401",
            "name": "មុំ ហាក់"
        },
        {
            "barcode": "BBWS180206881",
            "dpc": "03041904501",
            "name": "អង់ រ៉ែម"
        },
        {
            "barcode": "BBWS180206882",
            "dpc": "03041904701",
            "name": "ឯម  សារុំ"
        },
        {
            "barcode": "BBWS180206883",
            "dpc": "03041904801",
            "name": "នៅ ម៉ុន"
        },
        {
            "barcode": "BBWS180206884",
            "dpc": "03041904901",
            "name": "ឯម សាវ៉ាត"
        },
        {
            "barcode": "BBWS180206885",
            "dpc": "03041905001",
            "name": "ចឹក សុខេង"
        },
        {
            "barcode": "BBWS180206886",
            "dpc": "03041905101",
            "name": "ណូ ណូត"
        },
        {
            "barcode": "BBWS180206887",
            "dpc": "03041905201",
            "name": "កែវ ផេង"
        },
        {
            "barcode": "BBWS180206888",
            "dpc": "03041905301",
            "name": "ហ៊ឹម គឹមលី"
        },
        {
            "barcode": "BBWS180206889",
            "dpc": "03041905401",
            "name": "សាយ រិទ្ធី"
        },
        {
            "barcode": "BBWS180206890",
            "dpc": "03041905601",
            "name": "នុត ហ៊ាង"
        },
        {
            "barcode": "BBWS180206891",
            "dpc": "03041905801",
            "name": "ផាន សុភា"
        },
        {
            "barcode": "BBWS180206892",
            "dpc": "03041905901",
            "name": "ស៊ឹម សុឃន"
        },
        {
            "barcode": "BBWS180206893",
            "dpc": "03041906001",
            "name": "ពេជ្រ សុវណ្ណ"
        },
        {
            "barcode": "BBWS180206894",
            "dpc": "03041906101",
            "name": "ឆេង ណុល"
        },
        {
            "barcode": "BBWS180206895",
            "dpc": "03041904601",
            "name": "ខន អៀក"
        },
        {
            "barcode": "BBWS180206896",
            "dpc": "03041906201",
            "name": "សុខ ចាន់រ៉ា"
        },
        {
            "barcode": "BBWS180206897",
            "dpc": "03041906301",
            "name": "ឆេង មុំ"
        },
        {
            "barcode": "BBWS180206898",
            "dpc": "03041906401",
            "name": "សុខ ចាន់"
        },
        {
            "barcode": "BBWS180206899",
            "dpc": "03041906501",
            "name": "ម៉ង ប៉ោហ៊ុយ"
        },
        {
            "barcode": "BBWS180206900",
            "dpc": "03041906601",
            "name": "ទូច យ៉ាន"
        },
        {
            "barcode": "BBWS180206901",
            "dpc": "03041906801",
            "name": "លឹម ទាពីវ ២"
        },
        {
            "barcode": "BBWS180206902",
            "dpc": "03041906901",
            "name": "ជុន សុខា"
        },
        {
            "barcode": "BBWS180206903",
            "dpc": "03041907001",
            "name": "សោម រិទ្ធ"
        },
        {
            "barcode": "BBWS180206904",
            "dpc": "03041907101",
            "name": "យ៉ាន សៀន"
        },
        {
            "barcode": "BBWS180206905",
            "dpc": "03041907201",
            "name": "គី ភនចាយ"
        },
        {
            "barcode": "BBWS180206906",
            "dpc": "03041907301",
            "name": "ឃុត សំអឿន"
        },
        {
            "barcode": "BBWS180206907",
            "dpc": "03041907401",
            "name": "យឹម សែ"
        },
        {
            "barcode": "BBWS180206908",
            "dpc": "03041907501",
            "name": "អ៊ឹង កូយ"
        },
        {
            "barcode": "BBWS180206909",
            "dpc": "03041907601",
            "name": "សោម សុវណ្ណ"
        },
        {
            "barcode": "BBWS180206910",
            "dpc": "03041907701",
            "name": "សាលា ឃុំទួលតាឯក"
        },
        {
            "barcode": "BBWS180206911",
            "dpc": "03041907801",
            "name": "អ៊ឹង ចេងគ្រី"
        },
        {
            "barcode": "BBWS180206912",
            "dpc": "03041907901",
            "name": "ពា កយ"
        },
        {
            "barcode": "BBWS180206913",
            "dpc": "03041908001",
            "name": "ហុក កុសល"
        },
        {
            "barcode": "BBWS180206914",
            "dpc": "03041908101",
            "name": "ពៅ ហេឡែន"
        },
        {
            "barcode": "BBWS180206915",
            "dpc": "03041908201",
            "name": "គឹម ហួង"
        },
        {
            "barcode": "BBWS180206916",
            "dpc": "03041908301",
            "name": "ង៉ែត សារ៉ន"
        },
        {
            "barcode": "BBWS180206917",
            "dpc": "03041908401",
            "name": "គៀង សុគន្ធារី"
        },
        {
            "barcode": "BBWS180206918",
            "dpc": "03041908501",
            "name": "ហុក វុទ្ធី"
        },
        {
            "barcode": "BBWS180206919",
            "dpc": "03041908701",
            "name": "លី ហេងសៀក"
        },
        {
            "barcode": "BBWS180206920",
            "dpc": "03041908801",
            "name": "អ៊ឹង គួយ"
        },
        {
            "barcode": "BBWS180206921",
            "dpc": "03041908901",
            "name": "ហាក់  ស្រី"
        },
        {
            "barcode": "BBWS180206922",
            "dpc": "03041909101",
            "name": "សុខ លឹមហាក់"
        },
        {
            "barcode": "BBWS180206923",
            "dpc": "03041909201",
            "name": "ម៉ៅ ផាន់"
        },
        {
            "barcode": "BBWS180206924",
            "dpc": "03041909501",
            "name": "ឡោ អ៊ូ"
        },
        {
            "barcode": "BBWS180206925",
            "dpc": "03041909601",
            "name": "ចាប កុយ"
        },
        {
            "barcode": "BBWS180206926",
            "dpc": "03041909801",
            "name": "ថោង គឹមស្រូ"
        },
        {
            "barcode": "BBWS180206927",
            "dpc": "03041910101",
            "name": "អ៊ឹម ទ្រី"
        },
        {
            "barcode": "BBWS180206928",
            "dpc": "03041910201",
            "name": "ហង់ ម៉ាឡានី"
        },
        {
            "barcode": "BBWS180206929",
            "dpc": "03041910301",
            "name": "ងិន គឹមលាន"
        },
        {
            "barcode": "BBWS180206930",
            "dpc": "03041910401",
            "name": "ហ៊ិន មុំ"
        },
        {
            "barcode": "BBWS180206931",
            "dpc": "03041910501",
            "name": "ប៉ែន ហ៊ុច"
        },
        {
            "barcode": "BBWS180206932",
            "dpc": "03041910601",
            "name": "វឿត លឿម"
        },
        {
            "barcode": "BBWS180206933",
            "dpc": "03041910701",
            "name": "ជៀម បូរ៉េន"
        },
        {
            "barcode": "BBWS180206934",
            "dpc": "03041910801",
            "name": "ថូ ធី"
        },
        {
            "barcode": "BBWS180206935",
            "dpc": "03041910901",
            "name": "ងួន ខុន"
        },
        {
            "barcode": "BBWS180206936",
            "dpc": "03041911001",
            "name": "ឈឹម សុម៉ាលី"
        },
        {
            "barcode": "BBWS180206937",
            "dpc": "03041911101",
            "name": "ឯម ចន្ថា"
        },
        {
            "barcode": "BBWS180206938",
            "dpc": "03041911201",
            "name": "ស៊ិន សម្បត្តិ"
        },
        {
            "barcode": "BBWS180206939",
            "dpc": "03041911301",
            "name": "សេង វ៉ាន់នឿន"
        },
        {
            "barcode": "BBWS180206940",
            "dpc": "03041911401",
            "name": "គង់ យ៉ានី"
        },
        {
            "barcode": "BBWS180206941",
            "dpc": "03041911501",
            "name": "ឡុង នាង"
        },
        {
            "barcode": "BBWS180206942",
            "dpc": "03041911601",
            "name": "កៅ សារ៉ុន"
        },
        {
            "barcode": "BBWS180206943",
            "dpc": "03041911701",
            "name": "ឡុង ប៊ុនថា"
        },
        {
            "barcode": "BBWS180206944",
            "dpc": "03041911801",
            "name": "ឆោម ប៊ុនធី"
        },
        {
            "barcode": "BBWS180206945",
            "dpc": "03041911901",
            "name": "តោ ទៀប"
        },
        {
            "barcode": "BBWS180206946",
            "dpc": "03041912001",
            "name": "កៅ ចាត"
        },
        {
            "barcode": "BBWS180206947",
            "dpc": "03041912201",
            "name": "ប៊ូ ហាំង"
        },
        {
            "barcode": "BBWS180206948",
            "dpc": "03041912301",
            "name": "ផាន់ ហៃ"
        },
        {
            "barcode": "BBWS180206949",
            "dpc": "03041912401",
            "name": "ភួយ  លាងអ៊ី"
        },
        {
            "barcode": "BBWS180206950",
            "dpc": "03041912501",
            "name": "គល់ ប្រឹម"
        },
        {
            "barcode": "BBWS180206951",
            "dpc": "03041912601",
            "name": "ភូ ចាយ"
        },
        {
            "barcode": "BBWS180206952",
            "dpc": "03041912701",
            "name": "ចាន់ ធី"
        },
        {
            "barcode": "BBWS180206953",
            "dpc": "03041912801",
            "name": "ឈាន ស៊ីណា"
        },
        {
            "barcode": "BBWS180206954",
            "dpc": "03041912901",
            "name": "ចាន់ អូន"
        },
        {
            "barcode": "BBWS180206955",
            "dpc": "03041913001",
            "name": "សេក តូ"
        },
        {
            "barcode": "BBWS180206956",
            "dpc": "03041913101",
            "name": "ខុន ដា"
        },
        {
            "barcode": "BBWS180206957",
            "dpc": "03041913201",
            "name": "ខុន សាឃឿត"
        },
        {
            "barcode": "BBWS180206958",
            "dpc": "03041913301",
            "name": "ខុន និមល"
        },
        {
            "barcode": "BBWS180206959",
            "dpc": "03041935001",
            "name": "សូ វ៉ែ"
        },
        {
            "barcode": "BBWS180206960",
            "dpc": "03041935101",
            "name": "សូ គឹមរឿត"
        },
        {
            "barcode": "BBWS180206961",
            "dpc": "03041935201",
            "name": "គី ជីវ័ន្ត"
        },
        {
            "barcode": "BBWS180206962",
            "dpc": "03041935301",
            "name": "ជិន សាខន"
        },
        {
            "barcode": "BBWS180206963",
            "dpc": "03041935401",
            "name": "ភោគ កែវ"
        },
        {
            "barcode": "BBWS180206964",
            "dpc": "03041935801",
            "name": "កើត ម៉ូលី"
        },
        {
            "barcode": "BBWS180206965",
            "dpc": "03041935901",
            "name": "ហ៊ុន សារួន"
        },
        {
            "barcode": "BBWS180206966",
            "dpc": "03041936201",
            "name": "ចេង ចន្ធ"
        },
        {
            "barcode": "BBWS180206967",
            "dpc": "03041936001",
            "name": "ពៅ សុភាព"
        },
        {
            "barcode": "BBWS180206968",
            "dpc": "03041936101",
            "name": "ស៊ឺន ប៊ុនថា"
        },
        {
            "barcode": "BBWS180206969",
            "dpc": "03041936301",
            "name": "ម៉ៅ សារួន"
        },
        {
            "barcode": "BBWS180206970",
            "dpc": "03041936401",
            "name": "កែវ សារឿន"
        },
        {
            "barcode": "BBWS180206971",
            "dpc": "03041936501",
            "name": "កែវ យឿង"
        },
        {
            "barcode": "BBWS180206972",
            "dpc": "03041936601",
            "name": "ប្រាក់ សុខា"
        },
        {
            "barcode": "BBWS180206973",
            "dpc": "03041936701",
            "name": "ប៉ាត់  សំណាង"
        },
        {
            "barcode": "BBWS180206974",
            "dpc": "03041936801",
            "name": "ជិន ហេង"
        },
        {
            "barcode": "BBWS180206975",
            "dpc": "03041936901",
            "name": "អៀម គៀង"
        },
        {
            "barcode": "BBWS180206976",
            "dpc": "03041937001",
            "name": "អ៊ឹម សារិន"
        },
        {
            "barcode": "BBWS180206977",
            "dpc": "03041937101",
            "name": "ម៉ៅ វ៉ា"
        },
        {
            "barcode": "BBWS180206978",
            "dpc": "03041937201",
            "name": "យ៉ាត ឌិន"
        },
        {
            "barcode": "BBWS180206979",
            "dpc": "03041937301",
            "name": "នួន ណារុំ"
        },
        {
            "barcode": "BBWS180206980",
            "dpc": "03041937401",
            "name": "សំរិត ឆន"
        },
        {
            "barcode": "BBWS180206981",
            "dpc": "03041937501",
            "name": "ប៉ាល់ ណាំ"
        },
        {
            "barcode": "BBWS180206982",
            "dpc": "03041937601",
            "name": "ស្កាន  សំបូរ"
        },
        {
            "barcode": "BBWS180206983",
            "dpc": "03041937701",
            "name": "អ៊ី ចាន់"
        },
        {
            "barcode": "BBWS180206984",
            "dpc": "03041937801",
            "name": "ឡៃ ស៊ាន"
        },
        {
            "barcode": "BBWS180206985",
            "dpc": "03041937901",
            "name": "កែម គាន"
        },
        {
            "barcode": "BBWS180206986",
            "dpc": "03041938001",
            "name": "អ៊ឹម វ៉ាន់ថា"
        },
        {
            "barcode": "BBWS180206987",
            "dpc": "03041938101",
            "name": "ទួន  រិទ្ធ"
        },
        {
            "barcode": "BBWS180206988",
            "dpc": "03041938201",
            "name": "លី ហួរ"
        },
        {
            "barcode": "BBWS180206989",
            "dpc": "03041938301",
            "name": "ផេង សុខា"
        },
        {
            "barcode": "BBWS180206990",
            "dpc": "03041938401",
            "name": "ង៉ាន សារ៉េត"
        },
        {
            "barcode": "BBWS180206991",
            "dpc": "03041938501",
            "name": "សួម  ឆាយ"
        },
        {
            "barcode": "BBWS180206992",
            "dpc": "03041938601",
            "name": "ស៊ុំ ភ័ណ្ឌ"
        },
        {
            "barcode": "BBWS180206993",
            "dpc": "03041938701",
            "name": "លន់ គឹមលី"
        },
        {
            "barcode": "BBWS180206994",
            "dpc": "03041938801",
            "name": "ក្តិប ជុំនិត"
        },
        {
            "barcode": "BBWS180206995",
            "dpc": "03041938901",
            "name": "ផន សុភី"
        },
        {
            "barcode": "BBWS180206996",
            "dpc": "03041939001",
            "name": "ប៉ែន សារ៉ាត់"
        },
        {
            "barcode": "BBWS180206997",
            "dpc": "03041939101",
            "name": "នួន លឿប"
        },
        {
            "barcode": "BBWS180206998",
            "dpc": "03041939801",
            "name": "អេង ប៊ុនហេង"
        },
        {
            "barcode": "BBWS180206999",
            "dpc": "03041939301",
            "name": "វឿត ហឿម"
        },
        {
            "barcode": "BBWS180207000",
            "dpc": "03041939201",
            "name": "ជុំ ហាច"
        },
        {
            "barcode": "BBWS180207001",
            "dpc": "03041939401",
            "name": "ទីម  ហ៊ុច"
        },
        {
            "barcode": "BBWS180207002",
            "dpc": "03041939601",
            "name": "ផន កែវ"
        },
        {
            "barcode": "BBWS180207003",
            "dpc": "03041939501",
            "name": "គិម សឿន"
        },
        {
            "barcode": "BBWS180207004",
            "dpc": "03041939901",
            "name": "ទុយ គង់"
        },
        {
            "barcode": "BBWS180207005",
            "dpc": "03041940001",
            "name": "ស៊ុយ អេង"
        },
        {
            "barcode": "BBWS180207006",
            "dpc": "03041940201",
            "name": "ជា បុប្ផា"
        },
        {
            "barcode": "BBWS180207007",
            "dpc": "03041940301",
            "name": "យ៉ាត ស្រីមុំ"
        },
        {
            "barcode": "BBWS180207008",
            "dpc": "03041940401",
            "name": "ឡាយ យាន"
        },
        {
            "barcode": "BBWS180207009",
            "dpc": "03041940501",
            "name": "ឯម សារ៉ុម"
        },
        {
            "barcode": "BBWS180207010",
            "dpc": "03041940601",
            "name": "គឹម ស្រីម៉ៅ"
        },
        {
            "barcode": "BBWS180207011",
            "dpc": "03041940701",
            "name": "ទា សុម៉ាលី"
        },
        {
            "barcode": "BBWS180207012",
            "dpc": "03041940801",
            "name": "ម៉ី ណន"
        },
        {
            "barcode": "BBWS180207013",
            "dpc": "03041940901",
            "name": "ផន សុវណ្ណ"
        },
        {
            "barcode": "BBWS180207014",
            "dpc": "03041941101",
            "name": "អ៊ុក ពន្លឺ"
        },
        {
            "barcode": "BBWS180207015",
            "dpc": "03041941201",
            "name": "គុយ ព្រឿង"
        },
        {
            "barcode": "BBWS180207016",
            "dpc": "03041941301",
            "name": "គាត ហង្ស"
        },
        {
            "barcode": "BBWS180207017",
            "dpc": "03041941401",
            "name": "យឹង សំអុន"
        },
        {
            "barcode": "BBWS180207018",
            "dpc": "03041941501",
            "name": "សេង គឹមសួ"
        },
        {
            "barcode": "BBWS180207019",
            "dpc": "03041941601",
            "name": "ម៉េង អាន"
        },
        {
            "barcode": "BBWS180207020",
            "dpc": "03041941701",
            "name": "សុង ស៊ានហ៊ូ"
        },
        {
            "barcode": "BBWS180207021",
            "dpc": "03041941801",
            "name": "មៀច បូរ៉ា"
        },
        {
            "barcode": "BBWS180207022",
            "dpc": "03041941901",
            "name": "ចៅ ម៉េងសេង"
        },
        {
            "barcode": "BBWS180207023",
            "dpc": "03041942001",
            "name": "សេង ស្រីពៅ"
        },
        {
            "barcode": "BBWS180207024",
            "dpc": "03041942101",
            "name": "យិន ធិរ៉ាក់"
        },
        {
            "barcode": "BBWS180207025",
            "dpc": "03041942201",
            "name": "ម៉ៅ សេង"
        },
        {
            "barcode": "BBWS180207026",
            "dpc": "03041939701",
            "name": "សួន ស្រីមុំ"
        },
        {
            "barcode": "BBWS180207027",
            "dpc": "03041945701",
            "name": "ផ្លុង ផល្លា"
        },
        {
            "barcode": "BBWS180207028",
            "dpc": "03041926801",
            "name": "ជៀម សេរី"
        },
        {
            "barcode": "BBWS180207029",
            "dpc": "03041926901",
            "name": "សន ជេស"
        },
        {
            "barcode": "BBWS180207030",
            "dpc": "03041927001",
            "name": "ហួត សំណាង"
        },
        {
            "barcode": "BBWS180207031",
            "dpc": "03041926701",
            "name": "អៀង ចាន់"
        },
        {
            "barcode": "BBWS180207032",
            "dpc": "03041926601",
            "name": "សាន អឿម"
        },
        {
            "barcode": "BBWS180207033",
            "dpc": "03041926401",
            "name": "ប៉ែន សន"
        },
        {
            "barcode": "BBWS180207034",
            "dpc": "03041926301",
            "name": "ជា វិន"
        },
        {
            "barcode": "BBWS180207035",
            "dpc": "03041926201",
            "name": "ខេង ឡាយ"
        },
        {
            "barcode": "BBWS180207036",
            "dpc": "03041926101",
            "name": "ជា ពុទ្ធី"
        },
        {
            "barcode": "BBWS180207037",
            "dpc": "03041926001",
            "name": "ងូវ   ទៀប"
        },
        {
            "barcode": "BBWS180207038",
            "dpc": "03041925901",
            "name": "ជី វុទ្ធី"
        },
        {
            "barcode": "BBWS180207039",
            "dpc": "03041925801",
            "name": "ប៉ោ ស៊ឹមឡី"
        },
        {
            "barcode": "BBWS180207040",
            "dpc": "03041925701",
            "name": "គឹម ចរិយា"
        },
        {
            "barcode": "BBWS180207041",
            "dpc": "03041925601",
            "name": "រ៉ន វិរិន"
        },
        {
            "barcode": "BBWS180207042",
            "dpc": "03041925501",
            "name": "មុំ សាមឌី"
        },
        {
            "barcode": "BBWS180207043",
            "dpc": "03041925401",
            "name": "សៀង ទ្រី"
        },
        {
            "barcode": "BBWS180207044",
            "dpc": "03041925301",
            "name": "យ៉ក់   ខ្វៃ"
        },
        {
            "barcode": "BBWS180207045",
            "dpc": "03041925201",
            "name": "តាំង នី"
        },
        {
            "barcode": "BBWS180207046",
            "dpc": "03041925001",
            "name": "នៅ រ៉ុង"
        },
        {
            "barcode": "BBWS180207047",
            "dpc": "03041924901",
            "name": "ឈឹម សារ៉េត"
        },
        {
            "barcode": "BBWS180207048",
            "dpc": "03041934901",
            "name": "ជា ម៉េងយូ"
        },
        {
            "barcode": "BBWS180207049",
            "dpc": "03041934801",
            "name": "បេង ហួន"
        },
        {
            "barcode": "BBWS180207050",
            "dpc": "03041934701",
            "name": "ម៉ង់ វុទ្ធី"
        },
        {
            "barcode": "BBWS180207051",
            "dpc": "03041934601",
            "name": "ម៉ង់ វិរ៉ា"
        },
        {
            "barcode": "BBWS180207052",
            "dpc": "03041934501",
            "name": "ញឹក ប៊ុនឈៀត"
        },
        {
            "barcode": "BBWS180207053",
            "dpc": "03041934301",
            "name": "ហូង  ខាត់យិង"
        },
        {
            "barcode": "BBWS180207054",
            "dpc": "03041934201",
            "name": "ប៊ុត សំអែល"
        },
        {
            "barcode": "BBWS180207055",
            "dpc": "03041934101",
            "name": "ធិញ ឆាន់"
        },
        {
            "barcode": "BBWS180207056",
            "dpc": "03041934001",
            "name": "លឿង ម៉ឹង"
        },
        {
            "barcode": "BBWS180207057",
            "dpc": "03041933901",
            "name": "ផ្លុង សាយ"
        },
        {
            "barcode": "BBWS180207058",
            "dpc": "03041933801",
            "name": "មុំ សោភ័ណ្ឌ"
        },
        {
            "barcode": "BBWS180207059",
            "dpc": "03041933701",
            "name": "ហ៊ាង ហ៊ត"
        },
        {
            "barcode": "BBWS180207060",
            "dpc": "03041933601",
            "name": "កើត មនោរក្ស"
        },
        {
            "barcode": "BBWS180207061",
            "dpc": "03041933501",
            "name": "មណ្ឌលសុខភាពទួលតាឯក"
        },
        {
            "barcode": "BBWS180207062",
            "dpc": "03041933401",
            "name": "ញ៉ែម សារ៉េម"
        },
        {
            "barcode": "BBWS180207063",
            "dpc": "03041933301",
            "name": "តាន់ សុភាព"
        },
        {
            "barcode": "BBWS180207064",
            "dpc": "03041933101",
            "name": "ខាត់ ភឿន"
        },
        {
            "barcode": "BBWS180207065",
            "dpc": "03041933001",
            "name": "ពៅ ប៊ុនហាក់"
        },
        {
            "barcode": "BBWS180207066",
            "dpc": "03041932901",
            "name": "ជូ ស៊ីម"
        },
        {
            "barcode": "BBWS180207067",
            "dpc": "03041932801",
            "name": "អ៊ិត អ៊ុត"
        },
        {
            "barcode": "BBWS180207068",
            "dpc": "03041932701",
            "name": "ភុំ ហុង"
        },
        {
            "barcode": "BBWS180207069",
            "dpc": "03041932601",
            "name": "ភួង ម៉ាប់"
        },
        {
            "barcode": "BBWS180207070",
            "dpc": "03041932501",
            "name": "អ៊ិត គឹមស្រ៊ុន"
        },
        {
            "barcode": "BBWS180207071",
            "dpc": "03041932401",
            "name": "ស្រី ស៊ុន"
        },
        {
            "barcode": "BBWS180207072",
            "dpc": "03041932201",
            "name": "អ៊ិន វណ្ណៈ"
        },
        {
            "barcode": "BBWS180207073",
            "dpc": "03041932301",
            "name": "ណាវ សុខា"
        },
        {
            "barcode": "BBWS180207074",
            "dpc": "03041932101",
            "name": "សាម ភិត"
        },
        {
            "barcode": "BBWS180207075",
            "dpc": "03041932001",
            "name": "សេង អូន"
        },
        {
            "barcode": "BBWS180207076",
            "dpc": "03041931901",
            "name": "ឡេង វិសាល២"
        },
        {
            "barcode": "BBWS180207077",
            "dpc": "03041931801",
            "name": "ប៊ុន ម៉ា"
        },
        {
            "barcode": "BBWS180207078",
            "dpc": "03041931701",
            "name": "ហ៊ុយ គឹមថេត"
        },
        {
            "barcode": "BBWS180207079",
            "dpc": "03041931601",
            "name": "គឹម ជា"
        },
        {
            "barcode": "BBWS180207080",
            "dpc": "03041931501",
            "name": "សាយ ណន"
        },
        {
            "barcode": "BBWS180207081",
            "dpc": "03041931401",
            "name": "សុ ខា"
        },
        {
            "barcode": "BBWS180207082",
            "dpc": "03041931301",
            "name": "សរ សុរិទ្ធ"
        },
        {
            "barcode": "BBWS180207083",
            "dpc": "03041931201",
            "name": "សាយ ញ៉ុន"
        },
        {
            "barcode": "BBWS180207084",
            "dpc": "03041931101",
            "name": "កេញ វ៉ឿន"
        },
        {
            "barcode": "BBWS180207085",
            "dpc": "03041931001",
            "name": "សាលាបឋមសិក្សាអូរ ២"
        },
        {
            "barcode": "BBWS180207086",
            "dpc": "03041914501",
            "name": "យឺន សំពៅ"
        },
        {
            "barcode": "BBWS180207087",
            "dpc": "03041930801",
            "name": "ភឿន ពៅ"
        },
        {
            "barcode": "BBWS180207088",
            "dpc": "03041930901",
            "name": "គាំ ឌៀប"
        },
        {
            "barcode": "BBWS180207089",
            "dpc": "03041930701",
            "name": "គង់ ស៊ីឡា"
        },
        {
            "barcode": "BBWS180207090",
            "dpc": "03041930001",
            "name": "ឆេង ពៅ"
        },
        {
            "barcode": "BBWS180207091",
            "dpc": "03041930401",
            "name": "ប៉ឹង  រ៉េត"
        },
        {
            "barcode": "BBWS180207092",
            "dpc": "03041930301",
            "name": "ជា ម៉ាលី"
        },
        {
            "barcode": "BBWS180207093",
            "dpc": "03041930101",
            "name": "គី ចន្ធូ"
        },
        {
            "barcode": "BBWS180207094",
            "dpc": "03041929901",
            "name": "ប៉ុល សារឿន"
        },
        {
            "barcode": "BBWS180207095",
            "dpc": "03041929601",
            "name": "ប៉ុយ ធៀន ១"
        },
        {
            "barcode": "BBWS180207096",
            "dpc": "03041929501",
            "name": "ជុំ ជីវ័ន្ត"
        },
        {
            "barcode": "BBWS180207097",
            "dpc": "03041929301",
            "name": "សំអាង សត្យា"
        },
        {
            "barcode": "BBWS180207098",
            "dpc": "03041929201",
            "name": "ម៉ុក ឌីណា"
        },
        {
            "barcode": "BBWS180207099",
            "dpc": "03041929101",
            "name": "អាត ម៉ៅ"
        },
        {
            "barcode": "BBWS180207100",
            "dpc": "03041929001",
            "name": "ឡេង វិសុទ្ធ"
        },
        {
            "barcode": "BBWS180207101",
            "dpc": "03041928901",
            "name": "អ៊ុន ប៊ុនថា"
        },
        {
            "barcode": "BBWS180207102",
            "dpc": "03041928801",
            "name": "ហឿន សារ៉ាត់"
        },
        {
            "barcode": "BBWS180207103",
            "dpc": "03041928701",
            "name": "អ៊ុយ បូរី"
        },
        {
            "barcode": "BBWS180207104",
            "dpc": "03041928601",
            "name": "សាញ ណយ"
        },
        {
            "barcode": "BBWS180207105",
            "dpc": "03041928501",
            "name": "ហុយ  គឹមថង"
        },
        {
            "barcode": "BBWS180207106",
            "dpc": "03041928401",
            "name": "ផេង ដានី"
        },
        {
            "barcode": "BBWS180207107",
            "dpc": "03041928201",
            "name": "នា  គ្រី"
        },
        {
            "barcode": "BBWS180207108",
            "dpc": "03041928101",
            "name": "កែវ ឈុន"
        },
        {
            "barcode": "BBWS180207109",
            "dpc": "03041928001",
            "name": "ប៉ែន សាមុត"
        },
        {
            "barcode": "BBWS180207110",
            "dpc": "03041927901",
            "name": "ជា គឹម"
        },
        {
            "barcode": "BBWS180207111",
            "dpc": "03041927801",
            "name": "ជា សំបូរ"
        },
        {
            "barcode": "BBWS180207112",
            "dpc": "03041927701",
            "name": "កែ ស៊ីណូ"
        },
        {
            "barcode": "BBWS180207113",
            "dpc": "03041927601",
            "name": "ដៀប ប៊ន"
        },
        {
            "barcode": "BBWS180207114",
            "dpc": "03041927501",
            "name": "ចាំង យូរិន"
        },
        {
            "barcode": "BBWS180207115",
            "dpc": "03041927301",
            "name": "ភឿន ភិន"
        },
        {
            "barcode": "BBWS180207116",
            "dpc": "03041927201",
            "name": "តាន់ ហ៊ាង"
        },
        {
            "barcode": "BBWS180207117",
            "dpc": "03041927101",
            "name": "ហេង វ៉ាន់នី"
        },
        {
            "barcode": "BBWS180207118",
            "dpc": "03041930201",
            "name": "ឡាំ អ៊ាប"
        },
        {
            "barcode": "BBWS180207119",
            "dpc": "03041945501",
            "name": "ភ័ណ្ឌ កែវវិចិត្រ"
        },
        {
            "barcode": "BBWS180207120",
            "dpc": "03041945001",
            "name": "ស៊ិន សេន"
        },
        {
            "barcode": "BBWS180207121",
            "dpc": "03041945601",
            "name": "ស៊ ចន្ធូ"
        },
        {
            "barcode": "BBWS180207122",
            "dpc": "03041945201",
            "name": "គង់ សំអាន"
        },
        {
            "barcode": "BBWS180207123",
            "dpc": "03041945101",
            "name": "ឌី ម៉ា"
        },
        {
            "barcode": "BBWS180207124",
            "dpc": "03041945801",
            "name": "ចាន់ សេរី"
        },
        {
            "barcode": "BBWS180207125",
            "dpc": "03041945901",
            "name": "នូច  យ៉ា"
        },
        {
            "barcode": "BBWS180207126",
            "dpc": "03041946001",
            "name": "ង៉ែត សុផល"
        },
        {
            "barcode": "BBWS180207127",
            "dpc": "03041946101",
            "name": "មុំ យាន់"
        },
        {
            "barcode": "BBWS180207128",
            "dpc": "03041946301",
            "name": "ប៉ាត់ ថន"
        },
        {
            "barcode": "BBWS180207129",
            "dpc": "03041946401",
            "name": "ចាប សៀន"
        },
        {
            "barcode": "BBWS180207130",
            "dpc": "03041946501",
            "name": "ផ្លេក ពិសិទ្ធ"
        },
        {
            "barcode": "BBWS180207131",
            "dpc": "03041946601",
            "name": "ប៉ាត់ ថុល"
        },
        {
            "barcode": "BBWS180207132",
            "dpc": "03041946701",
            "name": "ផូ ផាន់ណារិទ្ធ"
        },
        {
            "barcode": "BBWS180207133",
            "dpc": "03041946801",
            "name": "ហែម ស្រស់"
        },
        {
            "barcode": "BBWS180207134",
            "dpc": "03041946901",
            "name": "ច្រាច់ មុំ"
        },
        {
            "barcode": "BBWS180207135",
            "dpc": "03041947001",
            "name": "ប៉ក់  ម៉េង"
        },
        {
            "barcode": "BBWS180207136",
            "dpc": "03041947101",
            "name": "គឹម ស៊ីវ"
        },
        {
            "barcode": "BBWS180207137",
            "dpc": "03041947201",
            "name": "គង់ សុខលាង"
        },
        {
            "barcode": "BBWS180207138",
            "dpc": "03041947301",
            "name": "ពិន  សំបូ"
        },
        {
            "barcode": "BBWS180207139",
            "dpc": "03041947401",
            "name": "សេង សុវ​ណ្ណ"
        },
        {
            "barcode": "BBWS180207140",
            "dpc": "03041947501",
            "name": "ប៉ង សុខា"
        },
        {
            "barcode": "BBWS180207141",
            "dpc": "03041947601",
            "name": "ឈួន ទូច"
        },
        {
            "barcode": "BBWS180207142",
            "dpc": "03041947701",
            "name": "គឹម សេត"
        },
        {
            "barcode": "BBWS180207143",
            "dpc": "03041947801",
            "name": "តាត ឃោសរ៉ាត់"
        },
        {
            "barcode": "BBWS180207144",
            "dpc": "03041947901",
            "name": "អៀង សុខុម"
        },
        {
            "barcode": "BBWS180207145",
            "dpc": "03041900701",
            "name": "ប្រាក់  ឌឿន"
        },
        {
            "barcode": "BBWS180207146",
            "dpc": "03041902301",
            "name": "ប៊ុន  ឡេង"
        },
        {
            "barcode": "BBWS180207147",
            "dpc": "03041902601",
            "name": "ជួន  រឿត"
        },
        {
            "barcode": "BBWS180207148",
            "dpc": "03041903001",
            "name": "គង់  សារឿន"
        },
        {
            "barcode": "BBWS180207149",
            "dpc": "03041929701",
            "name": "អ៊ុង  ង៉ាន់"
        },
        {
            "barcode": "BBWS180207150",
            "dpc": "03041929801",
            "name": "ប៉ុយ  ធៀន  ២"
        },
        {
            "barcode": "BBWS180207151",
            "dpc": "03041930501",
            "name": "ឈឹម  ឌឿម"
        },
        {
            "barcode": "BBWS180207152",
            "dpc": "03041942301",
            "name": "ឆែម  រដ្ឋា"
        },
        {
            "barcode": "BBWS180207153",
            "dpc": "03041942401",
            "name": "វ៉ាន់   វិចិត្រ ១"
        },
        {
            "barcode": "BBWS180207154",
            "dpc": "03041942501",
            "name": "នុយ  ប៊ុនជួយ"
        },
        {
            "barcode": "BBWS180207155",
            "dpc": "03041942601",
            "name": "ឈុក   ចាន់សុផា"
        },
        {
            "barcode": "BBWS180207156",
            "dpc": "03041942701",
            "name": "ជឿម  វិច្ចិកា"
        },
        {
            "barcode": "BBWS180207157",
            "dpc": "03041942801",
            "name": "ជន  អឿន"
        },
        {
            "barcode": "BBWS180207158",
            "dpc": "03041942901",
            "name": "តែ  ពៅចិន្តា"
        },
        {
            "barcode": "BBWS180207159",
            "dpc": "03041943001",
            "name": "តូច  ពិសិទ្ធ"
        },
        {
            "barcode": "BBWS180207160",
            "dpc": "03041943101",
            "name": "អ៊ុច  សារឹម"
        },
        {
            "barcode": "BBWS180207161",
            "dpc": "03041943301",
            "name": "ភុំ  ជិនណារ៉ា"
        },
        {
            "barcode": "BBWS180207162",
            "dpc": "03041943401",
            "name": "កង  ហាវ"
        },
        {
            "barcode": "BBWS180207163",
            "dpc": "03041943501",
            "name": "ស្រស់  ចំរើន"
        },
        {
            "barcode": "BBWS180207164",
            "dpc": "03041943601",
            "name": "ថុក  ប៊ុនធី"
        },
        {
            "barcode": "BBWS180207165",
            "dpc": "03041943701",
            "name": "គឹម  ស្រីពៅ"
        },
        {
            "barcode": "BBWS180207166",
            "dpc": "03041943801",
            "name": "ប៉េង  អាន"
        },
        {
            "barcode": "BBWS180207167",
            "dpc": "03041944001",
            "name": "ហុង  នាង"
        },
        {
            "barcode": "BBWS180207168",
            "dpc": "03041944101",
            "name": "សេង  ចាង"
        },
        {
            "barcode": "BBWS180207169",
            "dpc": "03041944301",
            "name": "សឺន  សឿប"
        },
        {
            "barcode": "BBWS180207170",
            "dpc": "03041944401",
            "name": "ហម  សៀកឡាយ"
        },
        {
            "barcode": "BBWS180207171",
            "dpc": "03041944501",
            "name": "យ៉ាន់  ពេជ្រ"
        },
        {
            "barcode": "BBWS180207172",
            "dpc": "03041944601",
            "name": "ស៊ូ  ស៊ី"
        },
        {
            "barcode": "BBWS180207173",
            "dpc": "03041944701",
            "name": "រុន  ខុងណែត"
        },
        {
            "barcode": "BBWS180207174",
            "dpc": "03041944801",
            "name": "យ៉ាំ  ហុង"
        },
        {
            "barcode": "BBWS180207175",
            "dpc": "03041944901",
            "name": "ស៊ូន  នី"
        },
        {
            "barcode": "BBWS180207176",
            "dpc": "03041945301",
            "name": "គង់  សាន"
        },
        {
            "barcode": "BBWS180207177",
            "dpc": "03041945401",
            "name": "ថ្លែង  ហូ"
        },
        {
            "barcode": "BBWS180207178",
            "dpc": "03041946201",
            "name": "ឡុង  សំអឿន"
        },
        {
            "barcode": "BBWS180207179",
            "dpc": "03041901801",
            "name": "ថែត សុធា"
        },
        {
            "barcode": "BBWS180207180",
            "dpc": "03041901701",
            "name": "ឈឹម ចន្ថា"
        },
        {
            "barcode": "BBWS180207181",
            "dpc": "03041901601",
            "name": "កើត​ យុថា"
        },
        {
            "barcode": "BBWS180207182",
            "dpc": "03041901501",
            "name": "ទុយ ចាន់រតនះ"
        },
        {
            "barcode": "BBWS180207183",
            "dpc": "03041901401",
            "name": "យួម រ៉ាមី"
        },
        {
            "barcode": "BBWS180207184",
            "dpc": "03041900501",
            "name": "ស្វាយ ចាន់តារ៉ា"
        },
        {
            "barcode": "BBWS180207185",
            "dpc": "03041900401",
            "name": "ស្វាយ ចាន់ថា"
        },
        {
            "barcode": "BBWS180207186",
            "dpc": "03041900801",
            "name": "សាត សារ៉េត"
        },
        {
            "barcode": "BBWS180207187",
            "dpc": "03041901001",
            "name": "សឿម រិន"
        },
        {
            "barcode": "BBWS180207188",
            "dpc": "03041901201",
            "name": "ស្វាយ ផល្លី"
        },
        {
            "barcode": "BBWS180207189",
            "dpc": "03041901301",
            "name": "សឿម ស្រី"
        },
        {
            "barcode": "BBWS180207190",
            "dpc": "03041900301",
            "name": "សាលាឃុំស្វាយប៉ោ"
        },
        {
            "barcode": "BBWS180207191",
            "dpc": "03041901901",
            "name": "យស់ សុគន្ធារិន្ទ"
        },
        {
            "barcode": "BBWS180207192",
            "dpc": "03041902001",
            "name": "ណុប  អេង"
        },
        {
            "barcode": "BBWS180207193",
            "dpc": "03041929401",
            "name": "ទូច  ផល្លី"
        },
        {
            "barcode": "BBWS180207194",
            "dpc": "03041902101",
            "name": "លឿង វិបុល"
        },
        {
            "barcode": "BBWS180207195",
            "dpc": "03041948001",
            "name": "សេង សាំងហុន"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
