let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=

    [
        {
            "barcode": "BBWS180209228",
            "dpc": "03042016801",
            "name": "នាង  វណ្ណះ"
        },
        {
            "barcode": "BBWS180209229",
            "dpc": "03042000101",
            "name": "លឿង រំចេក"
        },
        {
            "barcode": "BBWS180209230",
            "dpc": "03042000301",
            "name": "ជួប សុខុម"
        },
        {
            "barcode": "BBWS180209231",
            "dpc": "03042000501",
            "name": "លី ភក្តី"
        },
        {
            "barcode": "BBWS180209232",
            "dpc": "03042000401",
            "name": "អាហារដ្ឋានស្តាហ្វូត"
        },
        {
            "barcode": "BBWS180209233",
            "dpc": "03042000601",
            "name": "ផាត់ ណារុន"
        },
        {
            "barcode": "BBWS180209234",
            "dpc": "03042000701",
            "name": "ហូរ ភូរិន្ទ"
        },
        {
            "barcode": "BBWS180209235",
            "dpc": "03042000801",
            "name": "ឡុង សូផន"
        },
        {
            "barcode": "BBWS180209236",
            "dpc": "03042000901",
            "name": "លាក់ លួម"
        },
        {
            "barcode": "BBWS180209237",
            "dpc": "03042001001",
            "name": "ឈឹម ឌឹម"
        },
        {
            "barcode": "BBWS180209238",
            "dpc": "03042001101",
            "name": "ប៉ែន សារិន្ទ"
        },
        {
            "barcode": "BBWS180209239",
            "dpc": "03042001201",
            "name": "ជិម ជំនិត"
        },
        {
            "barcode": "BBWS180209240",
            "dpc": "03042001301",
            "name": "ញ៉ែត ចយ"
        },
        {
            "barcode": "BBWS180209241",
            "dpc": "03042001401",
            "name": "ឈុគ ចន្ថា"
        },
        {
            "barcode": "BBWS180209242",
            "dpc": "03042001501",
            "name": "សេង លក្ខិណា"
        },
        {
            "barcode": "BBWS180209243",
            "dpc": "03042001601",
            "name": "សូរ ទូន"
        },
        {
            "barcode": "BBWS180209244",
            "dpc": "03042001701",
            "name": "អោគ គុណ"
        },
        {
            "barcode": "BBWS180209245",
            "dpc": "03042001801",
            "name": "លី សំបឿន"
        },
        {
            "barcode": "BBWS180209246",
            "dpc": "03042001901",
            "name": "យូ សារឿន"
        },
        {
            "barcode": "BBWS180209247",
            "dpc": "03042002001",
            "name": "សៀង ណារិទ្ធ"
        },
        {
            "barcode": "BBWS180209248",
            "dpc": "03042002101",
            "name": "ឈួង វណ្ណា"
        },
        {
            "barcode": "BBWS180209249",
            "dpc": "03042002201",
            "name": "សុង កាំង"
        },
        {
            "barcode": "BBWS180209250",
            "dpc": "03042002401",
            "name": "ហុង គឹមលាង"
        },
        {
            "barcode": "BBWS180209251",
            "dpc": "03042002501",
            "name": "គង់ ពេជ្រ"
        },
        {
            "barcode": "BBWS180209252",
            "dpc": "03042002601",
            "name": "ឡម ស៊ីនឿន"
        },
        {
            "barcode": "BBWS180209253",
            "dpc": "03042002701",
            "name": "សុខ សារ៉ុម"
        },
        {
            "barcode": "BBWS180209254",
            "dpc": "03042002801",
            "name": "ជា ចាន់ត្រា"
        },
        {
            "barcode": "BBWS180209255",
            "dpc": "03042002901",
            "name": "សុខ ផល្លី"
        },
        {
            "barcode": "BBWS180209256",
            "dpc": "03042003001",
            "name": "រិទ្ធ គឹមឡាង"
        },
        {
            "barcode": "BBWS180209257",
            "dpc": "03042023901",
            "name": "ឆេង សុភាព"
        },
        {
            "barcode": "BBWS180209258",
            "dpc": "03042024001",
            "name": "ឆេង សេងហាក់"
        },
        {
            "barcode": "BBWS180209259",
            "dpc": "03042024101",
            "name": "ឡិច ឡេង"
        },
        {
            "barcode": "BBWS180209260",
            "dpc": "03042024201",
            "name": "ហែម ក្យូ"
        },
        {
            "barcode": "BBWS180209261",
            "dpc": "03042024301",
            "name": "សាន់ ខា"
        },
        {
            "barcode": "BBWS180209262",
            "dpc": "03042024401",
            "name": "ហ៊ាន ប៉េងស្រ៊ុន"
        },
        {
            "barcode": "BBWS180209263",
            "dpc": "03042024501",
            "name": "ណៃ ព្រីឆា"
        },
        {
            "barcode": "BBWS180209264",
            "dpc": "03042024601",
            "name": "នី សាវ៉ាត់"
        },
        {
            "barcode": "BBWS180209265",
            "dpc": "03042024701",
            "name": "អៀប រឿប"
        },
        {
            "barcode": "BBWS180209266",
            "dpc": "03042024801",
            "name": "សួន សាវ៉េត"
        },
        {
            "barcode": "BBWS180209267",
            "dpc": "03042024901",
            "name": "ជៀម ទុំ"
        },
        {
            "barcode": "BBWS180209268",
            "dpc": "03042025101",
            "name": "សាក់ លីន"
        },
        {
            "barcode": "BBWS180209269",
            "dpc": "03042025201",
            "name": "ទន់ យឿន"
        },
        {
            "barcode": "BBWS180209270",
            "dpc": "03042025301",
            "name": "ឆាយ ឆេង"
        },
        {
            "barcode": "BBWS180209271",
            "dpc": "03042025401",
            "name": "ស៊ូ ឃោ"
        },
        {
            "barcode": "BBWS180209272",
            "dpc": "03042025501",
            "name": "អ៊ឹម ស្រីមុំ"
        },
        {
            "barcode": "BBWS180209273",
            "dpc": "03042025601",
            "name": "អ៊ុំ អែម"
        },
        {
            "barcode": "BBWS180209274",
            "dpc": "03042025701",
            "name": "យិន  ថារី"
        },
        {
            "barcode": "BBWS180209275",
            "dpc": "03042025901",
            "name": "គង់ សុភ័ក្ត"
        },
        {
            "barcode": "BBWS180209276",
            "dpc": "03042026001",
            "name": "ឡត សារ៉េត"
        },
        {
            "barcode": "BBWS180209277",
            "dpc": "03042026101",
            "name": "ម៉ី សៅ"
        },
        {
            "barcode": "BBWS180209278",
            "dpc": "03042026201",
            "name": "សុខ ផុន"
        },
        {
            "barcode": "BBWS180209279",
            "dpc": "03042026301",
            "name": "ផេង រ៉ា"
        },
        {
            "barcode": "BBWS180209280",
            "dpc": "03042026401",
            "name": "អ៊ុំ ប៉េងសុង"
        },
        {
            "barcode": "BBWS180209281",
            "dpc": "03042026501",
            "name": "ប៉ាល់ ហូរ"
        },
        {
            "barcode": "BBWS180209282",
            "dpc": "03042026601",
            "name": "សាំង ណារិន"
        },
        {
            "barcode": "BBWS180209283",
            "dpc": "03042026701",
            "name": "ឆេង ឈួន"
        },
        {
            "barcode": "BBWS180209284",
            "dpc": "03042026801",
            "name": "យ៉ែម សិរីវត្ត"
        },
        {
            "barcode": "BBWS180209285",
            "dpc": "03042026901",
            "name": "ពេជ្រ វណ្ណី"
        },
        {
            "barcode": "BBWS180209286",
            "dpc": "03042027001",
            "name": "ជា សុខា"
        },
        {
            "barcode": "BBWS180209287",
            "dpc": "03042027101",
            "name": "វង្ស ខាន់"
        },
        {
            "barcode": "BBWS180209288",
            "dpc": "03042027201",
            "name": "ឡាយ ហ៊ុំ"
        },
        {
            "barcode": "BBWS180209289",
            "dpc": "03042027301",
            "name": "ហម ហ៊ន"
        },
        {
            "barcode": "BBWS180209290",
            "dpc": "03042027401",
            "name": "ជូ ចាន់រិទ្ធ"
        },
        {
            "barcode": "BBWS180209291",
            "dpc": "03042027501",
            "name": "ស៊ុន ណារ៉េត"
        },
        {
            "barcode": "BBWS180209292",
            "dpc": "03042027601",
            "name": "តាំង ជាទ្រី"
        },
        {
            "barcode": "BBWS180209293",
            "dpc": "03042027701",
            "name": "ពិន សុវណ្ណ"
        },
        {
            "barcode": "BBWS180209294",
            "dpc": "03042027901",
            "name": "សោម សុផល"
        },
        {
            "barcode": "BBWS180209295",
            "dpc": "03042028001",
            "name": "មៀន បូ"
        },
        {
            "barcode": "BBWS180209296",
            "dpc": "03042028101",
            "name": "គឹម ពន្លក"
        },
        {
            "barcode": "BBWS180209297",
            "dpc": "03042028301",
            "name": "ក្រូច ថែន"
        },
        {
            "barcode": "BBWS180209298",
            "dpc": "03042028501",
            "name": "ជា លី"
        },
        {
            "barcode": "BBWS180209299",
            "dpc": "03042028601",
            "name": "ស៊ឹម ឆេង"
        },
        {
            "barcode": "BBWS180209300",
            "dpc": "03042028701",
            "name": "ឆេង ហឿន"
        },
        {
            "barcode": "BBWS180209301",
            "dpc": "03042028801",
            "name": "ឈួន គឹមហេង"
        },
        {
            "barcode": "BBWS180209302",
            "dpc": "03042004201",
            "name": "ឌុំ ធារ៉ាក់"
        },
        {
            "barcode": "BBWS180209303",
            "dpc": "03042004401",
            "name": "ខេង សេដ្ឋា"
        },
        {
            "barcode": "BBWS180209304",
            "dpc": "03042008701",
            "name": "ឆាន់ ឌី ១"
        },
        {
            "barcode": "BBWS180209305",
            "dpc": "03042008801",
            "name": "លឹម ដារ៉ុង"
        },
        {
            "barcode": "BBWS180209306",
            "dpc": "03042008901",
            "name": "ស៊ុន ថេង"
        },
        {
            "barcode": "BBWS180209307",
            "dpc": "03042009001",
            "name": "កេង ស្សី"
        },
        {
            "barcode": "BBWS180209308",
            "dpc": "03042009101",
            "name": "កែវ សម្បត្តិ"
        },
        {
            "barcode": "BBWS180209309",
            "dpc": "03042009501",
            "name": "លាង សារ៉េន"
        },
        {
            "barcode": "BBWS180209310",
            "dpc": "03042009801",
            "name": "ជុង ឈី"
        },
        {
            "barcode": "BBWS180209311",
            "dpc": "03042009901",
            "name": "ធិន សារិន"
        },
        {
            "barcode": "BBWS180209312",
            "dpc": "03042010001",
            "name": "សោម កាឌុល"
        },
        {
            "barcode": "BBWS180209313",
            "dpc": "03042010201",
            "name": "កែវ ស៊ុន (មុខ)"
        },
        {
            "barcode": "BBWS180209314",
            "dpc": "03042010301",
            "name": "កែវ ស៊ុន (លើ)"
        },
        {
            "barcode": "BBWS180209315",
            "dpc": "03042010401",
            "name": "ហុក កុសល់"
        },
        {
            "barcode": "BBWS180209316",
            "dpc": "03042010501",
            "name": "សេង ហួត"
        },
        {
            "barcode": "BBWS180209317",
            "dpc": "03042010601",
            "name": "សៀង សង់ឯម"
        },
        {
            "barcode": "BBWS180209318",
            "dpc": "03042010701",
            "name": "ស៊ិន ស៊ីណាន"
        },
        {
            "barcode": "BBWS180209319",
            "dpc": "03042010801",
            "name": "គឹម វែង"
        },
        {
            "barcode": "BBWS180209320",
            "dpc": "03042010901",
            "name": "អ៊ុក ប្រុក"
        },
        {
            "barcode": "BBWS180209321",
            "dpc": "03042011201",
            "name": "សៀង ឯមវិសាលរ៉ាស៊ី"
        },
        {
            "barcode": "BBWS180209322",
            "dpc": "03042006301",
            "name": "ឆាន់ ឌី៧"
        },
        {
            "barcode": "BBWS180209323",
            "dpc": "03042006401",
            "name": "អ៊ឹង នី"
        },
        {
            "barcode": "BBWS180209324",
            "dpc": "03042006501",
            "name": "ឡែក  តង"
        },
        {
            "barcode": "BBWS180209325",
            "dpc": "03042006601",
            "name": "គង់ ឌឺ"
        },
        {
            "barcode": "BBWS180209326",
            "dpc": "03042006801",
            "name": "ស្រេង ខុន"
        },
        {
            "barcode": "BBWS180209327",
            "dpc": "03042006901",
            "name": "លន់ ស្រូយ"
        },
        {
            "barcode": "BBWS180209328",
            "dpc": "03042007001",
            "name": "ស៊ុង  ឌីណា"
        },
        {
            "barcode": "BBWS180209329",
            "dpc": "03042007201",
            "name": "ម៉ែន សួរ"
        },
        {
            "barcode": "BBWS180209330",
            "dpc": "03042007301",
            "name": "ខាន់ សាវុធ"
        },
        {
            "barcode": "BBWS180209331",
            "dpc": "03042007601",
            "name": "ម៉ុន ម៉ុត"
        },
        {
            "barcode": "BBWS180209332",
            "dpc": "03042007701",
            "name": "ឆាន់ ឌី ៥"
        },
        {
            "barcode": "BBWS180209333",
            "dpc": "03042007801",
            "name": "អ៊ូច ឃ៊ីម"
        },
        {
            "barcode": "BBWS180209334",
            "dpc": "03042008101",
            "name": "ឆៃ  ឆិល"
        },
        {
            "barcode": "BBWS180209335",
            "dpc": "03042008001",
            "name": "អ៊ូ ចិន"
        },
        {
            "barcode": "BBWS180209336",
            "dpc": "03042007901",
            "name": "ឈឿម សុខា"
        },
        {
            "barcode": "BBWS180209337",
            "dpc": "03042008301",
            "name": "ជឹម  ធាវី"
        },
        {
            "barcode": "BBWS180209338",
            "dpc": "03042008201",
            "name": "ឆាន់ ឌី ២"
        },
        {
            "barcode": "BBWS180209339",
            "dpc": "03042008601",
            "name": "ស៊ុម តក់"
        },
        {
            "barcode": "BBWS180209340",
            "dpc": "03042008501",
            "name": "លាង សារ៉េន ២"
        },
        {
            "barcode": "BBWS180209341",
            "dpc": "03042008401",
            "name": "បេន សាវុធ"
        },
        {
            "barcode": "BBWS180209342",
            "dpc": "03042006201",
            "name": "ម៉ែន ឃុន"
        },
        {
            "barcode": "BBWS180209343",
            "dpc": "03042006101",
            "name": "ប្រាក់ យឺន"
        },
        {
            "barcode": "BBWS180209344",
            "dpc": "03042003101",
            "name": "ដាញ់ ស៊ឹម"
        },
        {
            "barcode": "BBWS180209345",
            "dpc": "03042003301",
            "name": "ឆាន់ ជួយ"
        },
        {
            "barcode": "BBWS180209346",
            "dpc": "03042003401",
            "name": "ភូ គឹមហ៊ុន"
        },
        {
            "barcode": "BBWS180209347",
            "dpc": "03042003501",
            "name": "ទៀង សារ៉ន"
        },
        {
            "barcode": "BBWS180209348",
            "dpc": "03042003601",
            "name": "សុក កែន"
        },
        {
            "barcode": "BBWS180209349",
            "dpc": "03042003701",
            "name": "ប៊ុន ម៉េង"
        },
        {
            "barcode": "BBWS180209350",
            "dpc": "03042003801",
            "name": "អ៊ិន សាម៉ុន"
        },
        {
            "barcode": "BBWS180209351",
            "dpc": "03042003901",
            "name": "គុជ នាង"
        },
        {
            "barcode": "BBWS180209352",
            "dpc": "03042004001",
            "name": "ជឹម ភើយ"
        },
        {
            "barcode": "BBWS180209353",
            "dpc": "03042004101",
            "name": "ជីវ ដឿន"
        },
        {
            "barcode": "BBWS180209354",
            "dpc": "03042006001",
            "name": "ដែង  មករា"
        },
        {
            "barcode": "BBWS180209355",
            "dpc": "03042005901",
            "name": "អ៊ុយ ហោ"
        },
        {
            "barcode": "BBWS180209356",
            "dpc": "03042005801",
            "name": "សរ សាវន"
        },
        {
            "barcode": "BBWS180209357",
            "dpc": "03042005701",
            "name": "អ៊ាប ម៉េងឡេង"
        },
        {
            "barcode": "BBWS180209358",
            "dpc": "03042005501",
            "name": "ថេត លឿត"
        },
        {
            "barcode": "BBWS180209359",
            "dpc": "03042005401",
            "name": "កែវ សាវី"
        },
        {
            "barcode": "BBWS180209360",
            "dpc": "03042005201",
            "name": "ហួរ  ឆុង"
        },
        {
            "barcode": "BBWS180209361",
            "dpc": "03042005101",
            "name": "ហាក់ ឆៃលាង"
        },
        {
            "barcode": "BBWS180209362",
            "dpc": "03042005001",
            "name": "តែ លី"
        },
        {
            "barcode": "BBWS180209363",
            "dpc": "03042004901",
            "name": "ប៊ុន ថុង"
        },
        {
            "barcode": "BBWS180209364",
            "dpc": "03042004801",
            "name": "ឆុង ឆៃលី"
        },
        {
            "barcode": "BBWS180209365",
            "dpc": "03042004701",
            "name": "ង៉ូវ ហួយ"
        },
        {
            "barcode": "BBWS180209366",
            "dpc": "03042004601",
            "name": "ឆោម រី"
        },
        {
            "barcode": "BBWS180209367",
            "dpc": "03042004501",
            "name": "ផន វណ្ណថា"
        },
        {
            "barcode": "BBWS180209368",
            "dpc": "03042011701",
            "name": "វឹង ហាំង ២"
        },
        {
            "barcode": "BBWS180209369",
            "dpc": "03042011501",
            "name": "ស៊្រុន  គីមហុង"
        },
        {
            "barcode": "BBWS180209370",
            "dpc": "03042011401",
            "name": "ឈឹម ណារ៉ុង"
        },
        {
            "barcode": "BBWS180209371",
            "dpc": "03042011301",
            "name": "អ៊ុង សារ៉ាវី"
        },
        {
            "barcode": "BBWS180209372",
            "dpc": "03042012501",
            "name": "ប៊ូ គង់"
        },
        {
            "barcode": "BBWS180209373",
            "dpc": "03042012301",
            "name": "ប៉ែន ណាច"
        },
        {
            "barcode": "BBWS180209374",
            "dpc": "03042012201",
            "name": "ស៊ាង ហួត"
        },
        {
            "barcode": "BBWS180209375",
            "dpc": "03042012101",
            "name": "អ៊ុក ស៊ុន"
        },
        {
            "barcode": "BBWS180209376",
            "dpc": "03042012001",
            "name": "គឹម ធីសោភ័ណ្ឌ"
        },
        {
            "barcode": "BBWS180209377",
            "dpc": "03042011901",
            "name": "ជឹម ដារ៉ារដ្ឋ"
        },
        {
            "barcode": "BBWS180209378",
            "dpc": "03042011801",
            "name": "សឹង ថន"
        },
        {
            "barcode": "BBWS180209379",
            "dpc": "03042012801",
            "name": "ឡេង សេងណា"
        },
        {
            "barcode": "BBWS180209380",
            "dpc": "03042012701",
            "name": "សេរី ចរិយា"
        },
        {
            "barcode": "BBWS180209381",
            "dpc": "03042012901",
            "name": "លី ស្រីពៅ"
        },
        {
            "barcode": "BBWS180209382",
            "dpc": "03042013001",
            "name": "សាត តារា"
        },
        {
            "barcode": "BBWS180209383",
            "dpc": "03042013101",
            "name": "ប៉ិច សុខចាន់"
        },
        {
            "barcode": "BBWS180209384",
            "dpc": "03042013301",
            "name": "រស់ វិសិទ្ធ"
        },
        {
            "barcode": "BBWS180209385",
            "dpc": "03042013401",
            "name": "ប្រាក់ សំបូរ"
        },
        {
            "barcode": "BBWS180209386",
            "dpc": "03042013501",
            "name": "យិន ស៊ីណា"
        },
        {
            "barcode": "BBWS180209387",
            "dpc": "03042013601",
            "name": "ភេទ សុផុន"
        },
        {
            "barcode": "BBWS180209388",
            "dpc": "03042013701",
            "name": "សាយ ផាត"
        },
        {
            "barcode": "BBWS180209389",
            "dpc": "03042013801",
            "name": "តុង គឹមជាង"
        },
        {
            "barcode": "BBWS180209390",
            "dpc": "03042013901",
            "name": "នង សារុន"
        },
        {
            "barcode": "BBWS180209391",
            "dpc": "03042014001",
            "name": "ជឹម សុខា"
        },
        {
            "barcode": "BBWS180209392",
            "dpc": "03042014101",
            "name": "តុល សុផាត"
        },
        {
            "barcode": "BBWS180209393",
            "dpc": "03042014201",
            "name": "ធឹង គឹមហេង"
        },
        {
            "barcode": "BBWS180209394",
            "dpc": "03042014301",
            "name": "ជា ហ៊ាន"
        },
        {
            "barcode": "BBWS180209395",
            "dpc": "03042014401",
            "name": "ជា វ៉ាសាយ"
        },
        {
            "barcode": "BBWS180209396",
            "dpc": "03042014501",
            "name": "សៅ សំអុល"
        },
        {
            "barcode": "BBWS180209397",
            "dpc": "03042014601",
            "name": "ជា ស្រីទូច"
        },
        {
            "barcode": "BBWS180209398",
            "dpc": "03042014701",
            "name": "អ៊ុក សំអ៊ុន"
        },
        {
            "barcode": "BBWS180209399",
            "dpc": "03042014801",
            "name": "សុខ ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180209400",
            "dpc": "03042014901",
            "name": "ឡាច សំអាន"
        },
        {
            "barcode": "BBWS180209401",
            "dpc": "03042015001",
            "name": "ឡេង ខាន់"
        },
        {
            "barcode": "BBWS180209402",
            "dpc": "03042015101",
            "name": "រ៉ាត់ ថាវី"
        },
        {
            "barcode": "BBWS180209403",
            "dpc": "03042015201",
            "name": "អ៊ីវ ថន"
        },
        {
            "barcode": "BBWS180209404",
            "dpc": "03042015401",
            "name": "ទ្រី សុង"
        },
        {
            "barcode": "BBWS180209405",
            "dpc": "03042033201",
            "name": "ភូ សារឿន"
        },
        {
            "barcode": "BBWS180209406",
            "dpc": "03042033301",
            "name": "ប៉ាច សុគុណ្ណា"
        },
        {
            "barcode": "BBWS180209407",
            "dpc": "03042033401",
            "name": "នួន ណែម"
        },
        {
            "barcode": "BBWS180209408",
            "dpc": "03042015501",
            "name": "កុមារកំព្រារ"
        },
        {
            "barcode": "BBWS180209409",
            "dpc": "03042035501",
            "name": "យស់ រតនា"
        },
        {
            "barcode": "BBWS180209410",
            "dpc": "03042035601",
            "name": "លីអើរ៉ុនស៊ីថាន់"
        },
        {
            "barcode": "BBWS180209411",
            "dpc": "03042019801",
            "name": "ស្សី សាង"
        },
        {
            "barcode": "BBWS180209412",
            "dpc": "03042019901",
            "name": "ចេង សុខគាង"
        },
        {
            "barcode": "BBWS180209413",
            "dpc": "03042020001",
            "name": "យឹម សុខា"
        },
        {
            "barcode": "BBWS180209414",
            "dpc": "03042020101",
            "name": "អ៊ុក ណង"
        },
        {
            "barcode": "BBWS180209415",
            "dpc": "03042020201",
            "name": "អៀក កៀវ"
        },
        {
            "barcode": "BBWS180209416",
            "dpc": "03042020301",
            "name": "សៀង គឹមយី"
        },
        {
            "barcode": "BBWS180209417",
            "dpc": "03042020501",
            "name": "លី  គឹមធី"
        },
        {
            "barcode": "BBWS180209418",
            "dpc": "03042020701",
            "name": "ជីវ  ដឿន ២"
        },
        {
            "barcode": "BBWS180209419",
            "dpc": "03042019001",
            "name": "អ៊ិត សុប៉ុញ"
        },
        {
            "barcode": "BBWS180209420",
            "dpc": "03042020801",
            "name": "ជា រស់"
        },
        {
            "barcode": "BBWS180209421",
            "dpc": "03042020901",
            "name": "ថៃ  ហេង"
        },
        {
            "barcode": "BBWS180209422",
            "dpc": "03042021001",
            "name": "ថាត សារ៉េត"
        },
        {
            "barcode": "BBWS180209423",
            "dpc": "03042021201",
            "name": "ចឹក ខឹម"
        },
        {
            "barcode": "BBWS180209424",
            "dpc": "03042021301",
            "name": "គឹម វុធ"
        },
        {
            "barcode": "BBWS180209425",
            "dpc": "03042021401",
            "name": "យស់ សោភា"
        },
        {
            "barcode": "BBWS180209426",
            "dpc": "03042021501",
            "name": "ឌួង សុខុន"
        },
        {
            "barcode": "BBWS180209427",
            "dpc": "03042021601",
            "name": "សាញ់ ហួយ"
        },
        {
            "barcode": "BBWS180209428",
            "dpc": "03042021701",
            "name": "ប៉ាន់ ផល្លា"
        },
        {
            "barcode": "BBWS180209429",
            "dpc": "03042021901",
            "name": "ប៉ែន វណ្ណា"
        },
        {
            "barcode": "BBWS180209430",
            "dpc": "03042022001",
            "name": "សេង សុខា"
        },
        {
            "barcode": "BBWS180209431",
            "dpc": "03042022101",
            "name": "វ៉ាត់ សុវណ្ណ"
        },
        {
            "barcode": "BBWS180209432",
            "dpc": "03042011101",
            "name": "ឈិន ឆេត"
        },
        {
            "barcode": "BBWS180209433",
            "dpc": "03042022201",
            "name": "សៀង ហេង"
        },
        {
            "barcode": "BBWS180209434",
            "dpc": "03042022301",
            "name": "ហួត លុយ"
        },
        {
            "barcode": "BBWS180209435",
            "dpc": "03042022401",
            "name": "ស៊ូ សារិន"
        },
        {
            "barcode": "BBWS180209436",
            "dpc": "03042022501",
            "name": "ចក់ ពេជ្រ"
        },
        {
            "barcode": "BBWS180209437",
            "dpc": "03042022601",
            "name": "សំ ផល្លី"
        },
        {
            "barcode": "BBWS180209438",
            "dpc": "03042022701",
            "name": "មឿន មាន"
        },
        {
            "barcode": "BBWS180209439",
            "dpc": "03042022801",
            "name": "សូ សយ"
        },
        {
            "barcode": "BBWS180209440",
            "dpc": "03042022901",
            "name": "ជា ចំរ៉ុង"
        },
        {
            "barcode": "BBWS180209441",
            "dpc": "03042023001",
            "name": "កែវ សំ"
        },
        {
            "barcode": "BBWS180209442",
            "dpc": "03042023101",
            "name": "យូ សេងហ៊ាង"
        },
        {
            "barcode": "BBWS180209443",
            "dpc": "03042023201",
            "name": "ប៊ុន ធឿន"
        },
        {
            "barcode": "BBWS180209444",
            "dpc": "03042023301",
            "name": "ប៉ែន ឡឹង"
        },
        {
            "barcode": "BBWS180209445",
            "dpc": "03042023401",
            "name": "សោម សុមាលី"
        },
        {
            "barcode": "BBWS180209446",
            "dpc": "03042023501",
            "name": "សួង រ៉ា"
        },
        {
            "barcode": "BBWS180209447",
            "dpc": "03042023601",
            "name": "ញ៉ែម វណ្ឌី"
        },
        {
            "barcode": "BBWS180209448",
            "dpc": "03042023701",
            "name": "វ៉ាន់ សុធាវី"
        },
        {
            "barcode": "BBWS180209449",
            "dpc": "03042023801",
            "name": "សោម សោភា"
        },
        {
            "barcode": "BBWS180209450",
            "dpc": "03042012401",
            "name": "សុខ  សុវណ្ណារ៉ា"
        },
        {
            "barcode": "BBWS180209451",
            "dpc": "03042015301",
            "name": "គឹម  ណាវី"
        },
        {
            "barcode": "BBWS180209452",
            "dpc": "03042015701",
            "name": "ស្រី  ស៊្ររ"
        },
        {
            "barcode": "BBWS180209453",
            "dpc": "03042015801",
            "name": "ជុំ  សុភាព"
        },
        {
            "barcode": "BBWS180209454",
            "dpc": "03042015901",
            "name": "ថាប់  ធឿន"
        },
        {
            "barcode": "BBWS180209455",
            "dpc": "03042016001",
            "name": "មិន  ថាវី"
        },
        {
            "barcode": "BBWS180209456",
            "dpc": "03042016101",
            "name": "អ៊ុំ  សុធិញ"
        },
        {
            "barcode": "BBWS180209457",
            "dpc": "03042016201",
            "name": "កែវ  សុផន"
        },
        {
            "barcode": "BBWS180209458",
            "dpc": "03042016301",
            "name": "ម៉ម  សារឿន"
        },
        {
            "barcode": "BBWS180209459",
            "dpc": "03042016401",
            "name": "ឈិត  ថា"
        },
        {
            "barcode": "BBWS180209460",
            "dpc": "03042016501",
            "name": "សំ  សុខុម"
        },
        {
            "barcode": "BBWS180209461",
            "dpc": "03042016601",
            "name": "ជា  ចាន់ដា"
        },
        {
            "barcode": "BBWS180209462",
            "dpc": "03042016701",
            "name": "ហួត  លីឆេង"
        },
        {
            "barcode": "BBWS180209463",
            "dpc": "03042016901",
            "name": "សេង  ផន"
        },
        {
            "barcode": "BBWS180209464",
            "dpc": "03042017001",
            "name": "ហឿន  ឌីន"
        },
        {
            "barcode": "BBWS180209465",
            "dpc": "03042017101",
            "name": "ឡ  គឹមលន់"
        },
        {
            "barcode": "BBWS180209466",
            "dpc": "03042017201",
            "name": "ជាម  តេង"
        },
        {
            "barcode": "BBWS180209467",
            "dpc": "03042017301",
            "name": "ចក់  រិទ្ធី"
        },
        {
            "barcode": "BBWS180209468",
            "dpc": "03042017401",
            "name": "អ៊ឹង  ផល្គុន"
        },
        {
            "barcode": "BBWS180209469",
            "dpc": "03042017501",
            "name": "គង់  កុសល្យ"
        },
        {
            "barcode": "BBWS180209470",
            "dpc": "03042017601",
            "name": "ឌី  សុវណ្ណ"
        },
        {
            "barcode": "BBWS180209471",
            "dpc": "03042017701",
            "name": "ម៉ាង  គឹមស៊ាន"
        },
        {
            "barcode": "BBWS180209472",
            "dpc": "03042017901",
            "name": "ប៊ុន  មុំ"
        },
        {
            "barcode": "BBWS180209473",
            "dpc": "03042018001",
            "name": "ឈិន  សំណាង"
        },
        {
            "barcode": "BBWS180209474",
            "dpc": "03042018101",
            "name": "តឹក  សំណាក់ ១"
        },
        {
            "barcode": "BBWS180209475",
            "dpc": "03042018201",
            "name": "តឹក  សំណាក់ ២"
        },
        {
            "barcode": "BBWS180209476",
            "dpc": "03042018301",
            "name": "ហាក់   លាន"
        },
        {
            "barcode": "BBWS180209477",
            "dpc": "03042018401",
            "name": "ឃី  យ៉ា"
        },
        {
            "barcode": "BBWS180209478",
            "dpc": "03042018501",
            "name": "ងួន  លាង"
        },
        {
            "barcode": "BBWS180209479",
            "dpc": "03042018601",
            "name": "តិច  ជ្រិន"
        },
        {
            "barcode": "BBWS180209480",
            "dpc": "03042018701",
            "name": "ហែម  ប៉ាច"
        },
        {
            "barcode": "BBWS180209481",
            "dpc": "03042018801",
            "name": "ងិន  សំអុន"
        },
        {
            "barcode": "BBWS180209482",
            "dpc": "03042019101",
            "name": "ហេង  រតនា"
        },
        {
            "barcode": "BBWS180209483",
            "dpc": "03042019201",
            "name": "ខៀវ  តារា"
        },
        {
            "barcode": "BBWS180209484",
            "dpc": "03042019401",
            "name": "ប៊ិច  ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180209485",
            "dpc": "03042019501",
            "name": "វ៉ាត  វីរៈ"
        },
        {
            "barcode": "BBWS180209486",
            "dpc": "03042019601",
            "name": "ណុប  អេង"
        },
        {
            "barcode": "BBWS180209487",
            "dpc": "03042019701",
            "name": "សេក  ឆក"
        },
        {
            "barcode": "BBWS180209488",
            "dpc": "03042028901",
            "name": "ឆោម  ឆូយ"
        },
        {
            "barcode": "BBWS180209489",
            "dpc": "03042029001",
            "name": "រ៉ែម  ណេង"
        },
        {
            "barcode": "BBWS180209490",
            "dpc": "03042029101",
            "name": "ឆោម  ឆាត់"
        },
        {
            "barcode": "BBWS180209491",
            "dpc": "03042029201",
            "name": "ខ្លូត  ចំរ៉ាត់"
        },
        {
            "barcode": "BBWS180209492",
            "dpc": "03042029301",
            "name": "ចក់  សុន"
        },
        {
            "barcode": "BBWS180209493",
            "dpc": "03042029401",
            "name": "លឹម  សុផល"
        },
        {
            "barcode": "BBWS180209494",
            "dpc": "03042029501",
            "name": "ព្រុំ  សំអាង"
        },
        {
            "barcode": "BBWS180209495",
            "dpc": "03042029601",
            "name": "ព្រុំ  រាសី"
        },
        {
            "barcode": "BBWS180209496",
            "dpc": "03042029701",
            "name": "ជឿន  ដេត"
        },
        {
            "barcode": "BBWS180209497",
            "dpc": "03042029801",
            "name": "ហែម  អឿន"
        },
        {
            "barcode": "BBWS180209498",
            "dpc": "03042029901",
            "name": "ផេង  ឡូញ"
        },
        {
            "barcode": "BBWS180209499",
            "dpc": "03042030001",
            "name": "សួស  សុភ័ក្រ ២"
        },
        {
            "barcode": "BBWS180209500",
            "dpc": "03042030201",
            "name": "ព្រំ  គឹមឆេង"
        },
        {
            "barcode": "BBWS180209501",
            "dpc": "03042030301",
            "name": "សួន  តាំង"
        },
        {
            "barcode": "BBWS180209502",
            "dpc": "03042030401",
            "name": "ឡៅ  សុខា"
        },
        {
            "barcode": "BBWS180209503",
            "dpc": "03042030501",
            "name": "ឃុត  សំផុន"
        },
        {
            "barcode": "BBWS180209504",
            "dpc": "03042030601",
            "name": "ចែម  សារិទ្ធ"
        },
        {
            "barcode": "BBWS180209505",
            "dpc": "03042030701",
            "name": "សំ  ភារុំ"
        },
        {
            "barcode": "BBWS180209506",
            "dpc": "03042030801",
            "name": "ឆន  ឈៀង"
        },
        {
            "barcode": "BBWS180209507",
            "dpc": "03042031001",
            "name": "សូ  សុគន្ធា"
        },
        {
            "barcode": "BBWS180209508",
            "dpc": "03042031101",
            "name": "វណ្ណ  មឿន"
        },
        {
            "barcode": "BBWS180209509",
            "dpc": "03042031201",
            "name": "អ៊ុក  តែម"
        },
        {
            "barcode": "BBWS180209510",
            "dpc": "03042031301",
            "name": "ឈឹម  យ៉េង"
        },
        {
            "barcode": "BBWS180209511",
            "dpc": "03042031401",
            "name": "ទិត្យ  យង់"
        },
        {
            "barcode": "BBWS180209512",
            "dpc": "03042031501",
            "name": "ឌុក  ពូល"
        },
        {
            "barcode": "BBWS180209513",
            "dpc": "03042031601",
            "name": "ឡត  សារ៉េត"
        },
        {
            "barcode": "BBWS180209514",
            "dpc": "03042031701",
            "name": "អ៊ុង  សុផល"
        },
        {
            "barcode": "BBWS180209515",
            "dpc": "03042031801",
            "name": "សឿន  ស៊ីម"
        },
        {
            "barcode": "BBWS180209516",
            "dpc": "03042032001",
            "name": "ភេម   សុខុម"
        },
        {
            "barcode": "BBWS180209517",
            "dpc": "03042032101",
            "name": "ភេម  រឿត"
        },
        {
            "barcode": "BBWS180209518",
            "dpc": "03042032301",
            "name": "អ៊ុំ  សាម៉េត ២"
        },
        {
            "barcode": "BBWS180209519",
            "dpc": "03042032401",
            "name": "ញ៉ែម  កញ្ញា"
        },
        {
            "barcode": "BBWS180209520",
            "dpc": "03042032501",
            "name": "អ៊ុក  ចាន់ថុល"
        },
        {
            "barcode": "BBWS180209521",
            "dpc": "03042032701",
            "name": "គង់  សេរីវុធ"
        },
        {
            "barcode": "BBWS180209522",
            "dpc": "03042032801",
            "name": "តា   ឈួម"
        },
        {
            "barcode": "BBWS180209523",
            "dpc": "03042032901",
            "name": "អ៊ុក  ផាវណ្ណី"
        },
        {
            "barcode": "BBWS180209524",
            "dpc": "03042033001",
            "name": "ចៅ  ហាវ"
        },
        {
            "barcode": "BBWS180209525",
            "dpc": "03042033101",
            "name": "រស់   វិន"
        },
        {
            "barcode": "BBWS180209526",
            "dpc": "03042033501",
            "name": "ចាន់  សុខ"
        },
        {
            "barcode": "BBWS180209527",
            "dpc": "03042033601",
            "name": "កាន់  វិបុល"
        },
        {
            "barcode": "BBWS180209528",
            "dpc": "03042033701",
            "name": "អ៊ាង  លក្ខិណា"
        },
        {
            "barcode": "BBWS180209529",
            "dpc": "03042033801",
            "name": "អ៊ាង  ហេង"
        },
        {
            "barcode": "BBWS180209530",
            "dpc": "03042033901",
            "name": "ឆៃ  សុវណ្ណ"
        },
        {
            "barcode": "BBWS180209531",
            "dpc": "03042034001",
            "name": "យស  សារិទ្ធ"
        },
        {
            "barcode": "BBWS180209532",
            "dpc": "03042034101",
            "name": "សាំង  សាគួន"
        },
        {
            "barcode": "BBWS180209533",
            "dpc": "03042034201",
            "name": "មាស  នី"
        },
        {
            "barcode": "BBWS180209534",
            "dpc": "03042034301",
            "name": "សុខ  ណាលីន"
        },
        {
            "barcode": "BBWS180209535",
            "dpc": "03042034401",
            "name": "ញឹក  យឿង"
        },
        {
            "barcode": "BBWS180209536",
            "dpc": "03042034501",
            "name": "សាន  ឧស្សា"
        },
        {
            "barcode": "BBWS180209537",
            "dpc": "03042034701",
            "name": "ត្រេង  វុទ្ធី"
        },
        {
            "barcode": "BBWS180209538",
            "dpc": "03042034801",
            "name": "សេក សម្បត្តិ"
        },
        {
            "barcode": "BBWS180209539",
            "dpc": "03042034901",
            "name": "ប៊ុន  ថើន"
        },
        {
            "barcode": "BBWS180209540",
            "dpc": "03042035101",
            "name": "ថាន់  រដ្ឋា"
        },
        {
            "barcode": "BBWS180209541",
            "dpc": "03042035201",
            "name": "គា  សឺន"
        },
        {
            "barcode": "BBWS180209542",
            "dpc": "03042035301",
            "name": "សំរិទ្ធ  សីលា"
        },
        {
            "barcode": "BBWS180209543",
            "dpc": "03042035401",
            "name": "ជា  សាង"
        },
        {
            "barcode": "BBWS180209544",
            "dpc": "03042035701",
            "name": "ម៉េត  សុខុម"
        },
        {
            "barcode": "BBWS180209545",
            "dpc": "03042036001",
            "name": "ប៉ក់  សុងរិទ្ធិ"
        },
        {
            "barcode": "BBWS180209546",
            "dpc": "03042036101",
            "name": "ព្រហ្ម  ប៊ុនណាវី"
        },
        {
            "barcode": "BBWS180209547",
            "dpc": "03042036201",
            "name": "យូ  សុង"
        },
        {
            "barcode": "BBWS180209548",
            "dpc": "03042036301",
            "name": "កែវ  ចាន់ផល"
        },
        {
            "barcode": "BBWS180209549",
            "dpc": "03042036401",
            "name": "គិញ  សារុន"
        },
        {
            "barcode": "BBWS180209550",
            "dpc": "03042036501",
            "name": "ហម  អារុន"
        },
        {
            "barcode": "BBWS180209551",
            "dpc": "03042036601",
            "name": "ង៉ែត  ពិសិទ្ធ"
        },
        {
            "barcode": "BBWS180209552",
            "dpc": "03042036801",
            "name": "ជី  សុខហ៊ាង"
        },
        {
            "barcode": "BBWS180209553",
            "dpc": "03042036901",
            "name": "ឃឹម  ផេង"
        },
        {
            "barcode": "BBWS180209554",
            "dpc": "03042037001",
            "name": "ងួន  ភី"
        },
        {
            "barcode": "BBWS180209555",
            "dpc": "03042037201",
            "name": "ខឹម  ជីម"
        },
        {
            "barcode": "BBWS180209556",
            "dpc": "03042037301",
            "name": "ហូ  យកលីន"
        },
        {
            "barcode": "BBWS180209557",
            "dpc": "03042037501",
            "name": "ទិន  សុផល"
        },
        {
            "barcode": "BBWS180209558",
            "dpc": "03042038301",
            "name": "គឹម   ទៀង"
        },
        {
            "barcode": "BBWS180209559",
            "dpc": "03042043001",
            "name": "ឡាត  សាវេត"
        },
        {
            "barcode": "BBWS180209560",
            "dpc": "03042047701",
            "name": "ម៉ៅ  សុផុន"
        },
        {
            "barcode": "BBWS180209561",
            "dpc": "03042037701",
            "name": "វត្តកណ្តឹង"
        },
        {
            "barcode": "BBWS180209562",
            "dpc": "03042037801",
            "name": "អ៊ឹងចេង"
        },
        {
            "barcode": "BBWS180209563",
            "dpc": "03042037901",
            "name": "ខឿន ភាន់"
        },
        {
            "barcode": "BBWS180209564",
            "dpc": "03042038001",
            "name": "ឈិត ឆាយ"
        },
        {
            "barcode": "BBWS180209565",
            "dpc": "03042038101",
            "name": "ពេទ្យ ឈៀង"
        },
        {
            "barcode": "BBWS180209566",
            "dpc": "03042038401",
            "name": "គុល គុណ"
        },
        {
            "barcode": "BBWS180209567",
            "dpc": "03042038501",
            "name": "អៀង ធី"
        },
        {
            "barcode": "BBWS180209568",
            "dpc": "03042038601",
            "name": "ហុង ហៃ"
        },
        {
            "barcode": "BBWS180209569",
            "dpc": "03042038901",
            "name": "ជិន សល់"
        },
        {
            "barcode": "BBWS180209570",
            "dpc": "03042039001",
            "name": "សៅ ឈុំ"
        },
        {
            "barcode": "BBWS180209571",
            "dpc": "03042039101",
            "name": "ម៉ៃ ម៉ារិទ្ធ"
        },
        {
            "barcode": "BBWS180209572",
            "dpc": "03042039401",
            "name": "អ៊ិត ដារ៉ា"
        },
        {
            "barcode": "BBWS180209573",
            "dpc": "03042039201",
            "name": "ម៉ិល  សាម៉េត"
        },
        {
            "barcode": "BBWS180209574",
            "dpc": "03042039301",
            "name": "លឹម  ណុន"
        },
        {
            "barcode": "BBWS180209575",
            "dpc": "03042038701",
            "name": "យិន យៀន"
        },
        {
            "barcode": "BBWS180209576",
            "dpc": "03042040001",
            "name": "សំបូរ ផូ"
        },
        {
            "barcode": "BBWS180209577",
            "dpc": "03042040101",
            "name": "សួស សុគន្ធី"
        },
        {
            "barcode": "BBWS180209578",
            "dpc": "03042040201",
            "name": "ប៉ូ ស៊ីថន"
        },
        {
            "barcode": "BBWS180209579",
            "dpc": "03042040301",
            "name": "ថាច់ ធី"
        },
        {
            "barcode": "BBWS180209580",
            "dpc": "03042040401",
            "name": "ទឹម ស្សី"
        },
        {
            "barcode": "BBWS180209581",
            "dpc": "03042040601",
            "name": "សឺន សានសម្បត្តិ"
        },
        {
            "barcode": "BBWS180209582",
            "dpc": "03042040701",
            "name": "ពៅ វណ្ណៈ"
        },
        {
            "barcode": "BBWS180209583",
            "dpc": "03042040801",
            "name": "ថោង វិចិត្រ"
        },
        {
            "barcode": "BBWS180209584",
            "dpc": "03042040901",
            "name": "យស សុផាត"
        },
        {
            "barcode": "BBWS180209585",
            "dpc": "03042041101",
            "name": "ថាច់ លី"
        },
        {
            "barcode": "BBWS180209586",
            "dpc": "03042045401",
            "name": "ឈឹម សុវណ្ណ"
        },
        {
            "barcode": "BBWS180209587",
            "dpc": "03042045501",
            "name": "ហោ សំប៊ុន"
        },
        {
            "barcode": "BBWS180209588",
            "dpc": "03042045601",
            "name": "លុច គឿន"
        },
        {
            "barcode": "BBWS180209589",
            "dpc": "03042045801",
            "name": "ជ័យ ធីតា"
        },
        {
            "barcode": "BBWS180209590",
            "dpc": "03042045901",
            "name": "រិត កប"
        },
        {
            "barcode": "BBWS180209591",
            "dpc": "03042046001",
            "name": "ណុប ផាស៊ី"
        },
        {
            "barcode": "BBWS180209592",
            "dpc": "03042046101",
            "name": "សាញ់ សុភាព"
        },
        {
            "barcode": "BBWS180209593",
            "dpc": "03042045701",
            "name": "ឯម ស៊ា"
        },
        {
            "barcode": "BBWS180209594",
            "dpc": "03042046201",
            "name": "គង់ ដាវី"
        },
        {
            "barcode": "BBWS180209595",
            "dpc": "03042046301",
            "name": "ហៃ គឹមឈួន"
        },
        {
            "barcode": "BBWS180209596",
            "dpc": "03042046401",
            "name": "យ៉ែម ចាន់តារ៉ា"
        },
        {
            "barcode": "BBWS180209597",
            "dpc": "03042039901",
            "name": "ឆោម ឆុង"
        },
        {
            "barcode": "BBWS180209598",
            "dpc": "03042039701",
            "name": "គឹម សុផល"
        },
        {
            "barcode": "BBWS180209599",
            "dpc": "03042039601",
            "name": "អ៊ុក សារិន"
        },
        {
            "barcode": "BBWS180209600",
            "dpc": "03042046501",
            "name": "សំ សុដារ៉ា"
        },
        {
            "barcode": "BBWS180209601",
            "dpc": "03042046601",
            "name": "ឃុន ភី"
        },
        {
            "barcode": "BBWS180209602",
            "dpc": "03042046801",
            "name": "អៀម សំអាត"
        },
        {
            "barcode": "BBWS180209603",
            "dpc": "03042047001",
            "name": "អ៊ឹង ឈៀង"
        },
        {
            "barcode": "BBWS180209604",
            "dpc": "03042047101",
            "name": "បាន ប៉េងលី"
        },
        {
            "barcode": "BBWS180209605",
            "dpc": "03042047201",
            "name": "អ៊ួន រ៉ុត"
        },
        {
            "barcode": "BBWS180209606",
            "dpc": "03042047301",
            "name": "អ៊ុត រ៉ុន"
        },
        {
            "barcode": "BBWS180209607",
            "dpc": "03042047401",
            "name": "ហៃ ប៊ុនឈួ"
        },
        {
            "barcode": "BBWS180209608",
            "dpc": "03042047501",
            "name": "ស៊ូ ណាវី"
        },
        {
            "barcode": "BBWS180209609",
            "dpc": "03042042001",
            "name": "សេង សុធាវី"
        },
        {
            "barcode": "BBWS180209610",
            "dpc": "03042042101",
            "name": "ងី ឆេងអៀង"
        },
        {
            "barcode": "BBWS180209611",
            "dpc": "03042042201",
            "name": "តូ ឈុនវៀង"
        },
        {
            "barcode": "BBWS180209612",
            "dpc": "03042042301",
            "name": "ព្រំ ហ៊ន"
        },
        {
            "barcode": "BBWS180209613",
            "dpc": "03042042401",
            "name": "អេង សាវ៉ាត"
        },
        {
            "barcode": "BBWS180209614",
            "dpc": "03042042501",
            "name": "អ៊ឹង ហូវ"
        },
        {
            "barcode": "BBWS180209615",
            "dpc": "03042042601",
            "name": "យ៉ា វីរៈ"
        },
        {
            "barcode": "BBWS180209616",
            "dpc": "03042042701",
            "name": "ឆែម រ៉ូ"
        },
        {
            "barcode": "BBWS180209617",
            "dpc": "03042042801",
            "name": "យ៉ន យ៉ង់"
        },
        {
            "barcode": "BBWS180209618",
            "dpc": "03042042901",
            "name": "ហ៊ួយ ស៊ុនថន"
        },
        {
            "barcode": "BBWS180209619",
            "dpc": "03042043101",
            "name": "អ៊ុក ដារ៉ា"
        },
        {
            "barcode": "BBWS180209620",
            "dpc": "03042044501",
            "name": "ប៉ូ យៀត"
        },
        {
            "barcode": "BBWS180209621",
            "dpc": "03042044601",
            "name": "ម៉ក់  រ៉ាត់"
        },
        {
            "barcode": "BBWS180209622",
            "dpc": "03042044701",
            "name": "គុយ អោក"
        },
        {
            "barcode": "BBWS180209623",
            "dpc": "03042044801",
            "name": "សាន ហឿន"
        },
        {
            "barcode": "BBWS180209624",
            "dpc": "03042044901",
            "name": "ប៊ុន រឿង"
        },
        {
            "barcode": "BBWS180209625",
            "dpc": "03042044401",
            "name": "ជុំ រៀប"
        },
        {
            "barcode": "BBWS180209626",
            "dpc": "03042044301",
            "name": "ណាំ សុរឿង"
        },
        {
            "barcode": "BBWS180209627",
            "dpc": "03042044201",
            "name": "អន សុខាវី"
        },
        {
            "barcode": "BBWS180209628",
            "dpc": "03042044101",
            "name": "អន ចរិយា"
        },
        {
            "barcode": "BBWS180209629",
            "dpc": "03042044001",
            "name": "ហោ គឹមហួន"
        },
        {
            "barcode": "BBWS180209630",
            "dpc": "03042043901",
            "name": "មាឃ ឆវីវណ្ណ"
        },
        {
            "barcode": "BBWS180209631",
            "dpc": "03042043801",
            "name": "ឌុច ចំរើន"
        },
        {
            "barcode": "BBWS180209632",
            "dpc": "03042043601",
            "name": "អឿង សុគន្ធ"
        },
        {
            "barcode": "BBWS180209633",
            "dpc": "03042043701",
            "name": "សយ សុវណ្ណ"
        },
        {
            "barcode": "BBWS180209634",
            "dpc": "03042043501",
            "name": "អឿង ថាវី"
        },
        {
            "barcode": "BBWS180209635",
            "dpc": "03042043401",
            "name": "ជា រួន"
        },
        {
            "barcode": "BBWS180209636",
            "dpc": "03042043301",
            "name": "អៀប គុយហួត"
        },
        {
            "barcode": "BBWS180209637",
            "dpc": "03042043201",
            "name": "សៀ ទៀង"
        },
        {
            "barcode": "BBWS180209638",
            "dpc": "03042041901",
            "name": "វត្តគរ"
        },
        {
            "barcode": "BBWS180209639",
            "dpc": "03042041801",
            "name": "សាលាបឋមសិក្សាវត្តគរ"
        },
        {
            "barcode": "BBWS180209640",
            "dpc": "03042041701",
            "name": "អ៊ូរ គឹមហុក"
        },
        {
            "barcode": "BBWS180209641",
            "dpc": "03042041601",
            "name": "ផេង ធឿន"
        },
        {
            "barcode": "BBWS180209642",
            "dpc": "03042041501",
            "name": "ឌី ពៀច"
        },
        {
            "barcode": "BBWS180209643",
            "dpc": "03042041401",
            "name": "ឈឿន ទី"
        },
        {
            "barcode": "BBWS180209644",
            "dpc": "03042041301",
            "name": "ពៅ សាវើយ"
        },
        {
            "barcode": "BBWS180209645",
            "dpc": "03042041201",
            "name": "ស៊ា លីវ"
        },
        {
            "barcode": "BBWS180209646",
            "dpc": "03042045001",
            "name": "អៀក ប៊ុនកើន"
        },
        {
            "barcode": "BBWS180209647",
            "dpc": "03042045101",
            "name": "ថោង ដានាប២"
        },
        {
            "barcode": "BBWS180209648",
            "dpc": "03042045201",
            "name": "ថោង ដានាប១"
        },
        {
            "barcode": "BBWS180209649",
            "dpc": "03042046901",
            "name": "ឡោ ណងហេង"
        },
        {
            "barcode": "BBWS180209650",
            "dpc": "03042046701",
            "name": "យៀង ឃិត"
        },
        {
            "barcode": "BBWS180209651",
            "dpc": "03042047801",
            "name": "ប៉ក់ ម៉ៅ"
        },
        {
            "barcode": "BBWS180209652",
            "dpc": "03042047901",
            "name": "ជួន វ៉ាន់លី"
        },
        {
            "barcode": "BBWS180209653",
            "dpc": "03042039801",
            "name": "ឃួន នឿន ២"
        },
        {
            "barcode": "BBWS180209654",
            "dpc": "03042048001",
            "name": "យុគន្ធរ្ធ សំបូរ១"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
