let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=
    [
        {
            "barcode": "BBWS180210547",
            "dpc": "03022706801",
            "name": "អំ ឆាំ"
        },
        {
            "barcode": "BBWS180210548",
            "dpc": "03022733301",
            "name": "សេង សុដានី"
        },
        {
            "barcode": "BBWS180210549",
            "dpc": "03022708501",
            "name": "ខៀវ សាមឿន"
        },
        {
            "barcode": "BBWS180210550",
            "dpc": "03022738401",
            "name": "ណម ផល្លា"
        },
        {
            "barcode": "BBWS180210551",
            "dpc": "03022743101",
            "name": "សេង សុយ៉ាដា"
        },
        {
            "barcode": "BBWS180210552",
            "dpc": "03022703301",
            "name": "សួន សុខុន"
        },
        {
            "barcode": "BBWS180210553",
            "dpc": "03022728001",
            "name": "សួស សាលីន"
        },
        {
            "barcode": "BBWS180210554",
            "dpc": "03022728101",
            "name": "រ៉ សាក់"
        },
        {
            "barcode": "BBWS180210555",
            "dpc": "03022728301",
            "name": "ឡោះ សាវី"
        },
        {
            "barcode": "BBWS180210556",
            "dpc": "03022728701",
            "name": "ស៊ិន អ៊ិករ៉េៈ"
        },
        {
            "barcode": "BBWS180210557",
            "dpc": "03022732701",
            "name": "លី សាលីម"
        },
        {
            "barcode": "BBWS180210558",
            "dpc": "03022732801",
            "name": "មួន រីហ្វីន"
        },
        {
            "barcode": "BBWS180210559",
            "dpc": "03022732901",
            "name": "ឡេះ ឯល"
        },
        {
            "barcode": "BBWS180210560",
            "dpc": "03022733001",
            "name": "ជួន ចំណាប់"
        },
        {
            "barcode": "BBWS180210561",
            "dpc": "03022738101",
            "name": "ម៉ាស្ទីនឌីយ៉ាសុទី្ទន"
        },
        {
            "barcode": "BBWS180210562",
            "dpc": "03022743001",
            "name": "ជួប សាវង្ស"
        },
        {
            "barcode": "BBWS180210563",
            "dpc": "03022703401",
            "name": "ម៉ាន កៅហ្វិច"
        },
        {
            "barcode": "BBWS180210564",
            "dpc": "03022703501",
            "name": "ម៉េត អាស៊ីយ៉ាស់"
        },
        {
            "barcode": "BBWS180210565",
            "dpc": "03022706901",
            "name": "ស៊ុប សារី"
        },
        {
            "barcode": "BBWS180210566",
            "dpc": "03022718601",
            "name": "សួន ចាន់រ័ត្ន"
        },
        {
            "barcode": "BBWS180210567",
            "dpc": "03022719301",
            "name": "សាន់ ដន"
        },
        {
            "barcode": "BBWS180210568",
            "dpc": "03022719401",
            "name": "ឡុង បូរី"
        },
        {
            "barcode": "BBWS180210569",
            "dpc": "03022719501",
            "name": "ប៉ាង សិលា"
        },
        {
            "barcode": "BBWS180210570",
            "dpc": "03022724501",
            "name": "សិត វណ្ណា"
        },
        {
            "barcode": "BBWS180210571",
            "dpc": "03022727901",
            "name": "ម៉ាត់ កាស់"
        },
        {
            "barcode": "BBWS180210572",
            "dpc": "03022733501",
            "name": "ចក់ ស្រស់"
        },
        {
            "barcode": "BBWS180210573",
            "dpc": "03022742801",
            "name": "ម៉ាត់ ហាទីរីន"
        },
        {
            "barcode": "BBWS180210574",
            "dpc": "03022706701",
            "name": "ហង្ស ញ៉ុក"
        },
        {
            "barcode": "BBWS180210575",
            "dpc": "03022742701",
            "name": "សឹម សូរ"
        },
        {
            "barcode": "BBWS180210576",
            "dpc": "03022742601",
            "name": "ជួនណារ៉េត"
        },
        {
            "barcode": "BBWS180210577",
            "dpc": "03022707001",
            "name": "នូ សារិទ្ធ"
        },
        {
            "barcode": "BBWS180210578",
            "dpc": "03022704501",
            "name": "វ៉ា ធឿន"
        },
        {
            "barcode": "BBWS180210579",
            "dpc": "03022703901",
            "name": "ហុង ពិសី"
        },
        {
            "barcode": "BBWS180210580",
            "dpc": "03022726101",
            "name": "កែវ ឈុនលី"
        },
        {
            "barcode": "BBWS180210581",
            "dpc": "03022717101",
            "name": "សុខ នាង"
        },
        {
            "barcode": "BBWS180210582",
            "dpc": "03022705001",
            "name": "ហេង សុធា"
        },
        {
            "barcode": "BBWS180210583",
            "dpc": "03022721201",
            "name": "គឹម ណន"
        },
        {
            "barcode": "BBWS180210584",
            "dpc": "03022704801",
            "name": "ខែម សារ៉ាត់"
        },
        {
            "barcode": "BBWS180210585",
            "dpc": "03022707101",
            "name": "ទុយ ស៊ីន"
        },
        {
            "barcode": "BBWS180210586",
            "dpc": "03022702101",
            "name": "មាស មាលតី"
        },
        {
            "barcode": "BBWS180210587",
            "dpc": "03022727301",
            "name": "ប៉េង សាវី"
        },
        {
            "barcode": "BBWS180210588",
            "dpc": "03022733101",
            "name": "កាង សៀក"
        },
        {
            "barcode": "BBWS180210589",
            "dpc": "03022727501",
            "name": "ដែន ណារ៉ុម"
        },
        {
            "barcode": "BBWS180210590",
            "dpc": "03022732601",
            "name": "ឃុត ចាន់ថន"
        },
        {
            "barcode": "BBWS180210591",
            "dpc": "03022710801",
            "name": "ណី វិចិត្ត"
        },
        {
            "barcode": "BBWS180210592",
            "dpc": "03022736401",
            "name": "ក្រង់ ចាន់លី"
        },
        {
            "barcode": "BBWS180210593",
            "dpc": "03022705101",
            "name": "គឹម ឡូន"
        },
        {
            "barcode": "BBWS180210594",
            "dpc": "03022736501",
            "name": "ម៉ី សាវ៉ុង"
        },
        {
            "barcode": "BBWS180210595",
            "dpc": "03022743901",
            "name": "ស៊ុយ សំណាង"
        },
        {
            "barcode": "BBWS180210596",
            "dpc": "03022732301",
            "name": "ឈឹង រតនៈ"
        },
        {
            "barcode": "BBWS180210597",
            "dpc": "03022720901",
            "name": "សុខ ខេង"
        },
        {
            "barcode": "BBWS180210598",
            "dpc": "03022712901",
            "name": "ទូច រិទ្ធី"
        },
        {
            "barcode": "BBWS180210599",
            "dpc": "03022713001",
            "name": "ហ៊ាង សុចាន់"
        },
        {
            "barcode": "BBWS180210600",
            "dpc": "03022725901",
            "name": "ខៀវ ពន្លឺ"
        },
        {
            "barcode": "BBWS180210601",
            "dpc": "03022726001",
            "name": "ដំ រ៉ាឌី"
        },
        {
            "barcode": "BBWS180210602",
            "dpc": "03022711701",
            "name": "សឿម សឿង"
        },
        {
            "barcode": "BBWS180210603",
            "dpc": "03022720001",
            "name": "កូយ កុសល់"
        },
        {
            "barcode": "BBWS180210604",
            "dpc": "03022731301",
            "name": "ប៊ុន សុផល"
        },
        {
            "barcode": "BBWS180210605",
            "dpc": "03022700401",
            "name": "សៀ ឈាងហេង"
        },
        {
            "barcode": "BBWS180210606",
            "dpc": "03022736801",
            "name": "លី អូន"
        },
        {
            "barcode": "BBWS180210607",
            "dpc": "03022700301",
            "name": "យ៉ែម មឿន"
        },
        {
            "barcode": "BBWS180210608",
            "dpc": "03022704401",
            "name": "ឡាំង ង៉ាយ"
        },
        {
            "barcode": "BBWS180210609",
            "dpc": "03022713101",
            "name": "ឡៅ ប៊ួយ"
        },
        {
            "barcode": "BBWS180210610",
            "dpc": "03022725201",
            "name": "ញ៉ែម សុជាតិ"
        },
        {
            "barcode": "BBWS180210611",
            "dpc": "03022702701",
            "name": "ជុក ឯក"
        },
        {
            "barcode": "BBWS180210612",
            "dpc": "03022730301",
            "name": "អ៊ឹម អ៊ាម"
        },
        {
            "barcode": "BBWS180210613",
            "dpc": "03022716301",
            "name": "តាំង ស៊ីវហេង"
        },
        {
            "barcode": "BBWS180210614",
            "dpc": "03022730501",
            "name": "ឡុង ហូ"
        },
        {
            "barcode": "BBWS180210615",
            "dpc": "03022705901",
            "name": "ទ្រិញ អាន"
        },
        {
            "barcode": "BBWS180210616",
            "dpc": "03022730401",
            "name": "ចាន់ ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180210617",
            "dpc": "03022725501",
            "name": "ឡាយ សាំងថង២"
        },
        {
            "barcode": "BBWS180210618",
            "dpc": "03022736601",
            "name": "ជួប ចំរើន"
        },
        {
            "barcode": "BBWS180210619",
            "dpc": "03022709901",
            "name": "ឡេង ខេង"
        },
        {
            "barcode": "BBWS180210620",
            "dpc": "03022714501",
            "name": "ហេង ស៊ីឌឿន"
        },
        {
            "barcode": "BBWS180210621",
            "dpc": "03022714401",
            "name": "ហ៊ួ ម៉ុងហួត"
        },
        {
            "barcode": "BBWS180210622",
            "dpc": "03022714301",
            "name": "អួម ម៉ៅ"
        },
        {
            "barcode": "BBWS180210623",
            "dpc": "03022737801",
            "name": "សួន បុផ្ផា"
        },
        {
            "barcode": "BBWS180210624",
            "dpc": "03022709801",
            "name": "ម៉ី យ៉ានឈឿន"
        },
        {
            "barcode": "BBWS180210625",
            "dpc": "03022729101",
            "name": "ឡាយ រិទ្ធវង្ស២"
        },
        {
            "barcode": "BBWS180210626",
            "dpc": "03022722101",
            "name": "ពៅ ចាន់ថា"
        },
        {
            "barcode": "BBWS180210627",
            "dpc": "03022722201",
            "name": "ពៅ អេង"
        },
        {
            "barcode": "BBWS180210628",
            "dpc": "03022722301",
            "name": "សៅ វ៉ាន់ឌី"
        },
        {
            "barcode": "BBWS180210629",
            "dpc": "03022722401",
            "name": "កែវ សុវណ្ណដេត"
        },
        {
            "barcode": "BBWS180210630",
            "dpc": "03022704601",
            "name": "មុំ ឆវី"
        },
        {
            "barcode": "BBWS180210631",
            "dpc": "03022722501",
            "name": "មុំ ម៉ាញ"
        },
        {
            "barcode": "BBWS180210632",
            "dpc": "03022704701",
            "name": "ហុង លី"
        },
        {
            "barcode": "BBWS180210633",
            "dpc": "03022701901",
            "name": "សុខ សឿត"
        },
        {
            "barcode": "BBWS180210634",
            "dpc": "03022701801",
            "name": "ម៉ាត សាត"
        },
        {
            "barcode": "BBWS180210635",
            "dpc": "03022737901",
            "name": "ស្ហើង ណាន"
        },
        {
            "barcode": "BBWS180210636",
            "dpc": "03022737701",
            "name": "ឌី សំបូរ"
        },
        {
            "barcode": "BBWS180210637",
            "dpc": "03022729001",
            "name": "យុន រ៉ាអ៊ូល"
        },
        {
            "barcode": "BBWS180210638",
            "dpc": "03022736901",
            "name": "គឹម ឈឿន"
        },
        {
            "barcode": "BBWS180210639",
            "dpc": "03022742501",
            "name": "សែម ចន្ថា"
        },
        {
            "barcode": "BBWS180210640",
            "dpc": "03022737101",
            "name": "សៀវ សារិទ្ធ"
        },
        {
            "barcode": "BBWS180210641",
            "dpc": "03022737301",
            "name": "ជា សៀង"
        },
        {
            "barcode": "BBWS180210642",
            "dpc": "03022737401",
            "name": "ញឹម សាវី"
        },
        {
            "barcode": "BBWS180210643",
            "dpc": "03022737601",
            "name": "លាង គឹមហាន"
        },
        {
            "barcode": "BBWS180210644",
            "dpc": "03022742301",
            "name": "ង៉ែត សារ៉េត"
        },
        {
            "barcode": "BBWS180210645",
            "dpc": "03022742201",
            "name": "មាស សុជាតិ"
        },
        {
            "barcode": "BBWS180210646",
            "dpc": "03022738501",
            "name": "ម៉ែន សម្បត្តិ"
        },
        {
            "barcode": "BBWS180210647",
            "dpc": "03022702201",
            "name": "គីង សារឿន"
        },
        {
            "barcode": "BBWS180210648",
            "dpc": "03022727801",
            "name": "ហេង វែងឈៀង"
        },
        {
            "barcode": "BBWS180210649",
            "dpc": "03022713901",
            "name": "សួស លាង"
        },
        {
            "barcode": "BBWS180210650",
            "dpc": "03022718501",
            "name": "កូវ ជិញសៀង"
        },
        {
            "barcode": "BBWS180210651",
            "dpc": "03022732001",
            "name": "កង ស៊ិន"
        },
        {
            "barcode": "BBWS180210652",
            "dpc": "03022721901",
            "name": "រ៉េត ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180210653",
            "dpc": "03022732101",
            "name": "វី វឹង"
        },
        {
            "barcode": "BBWS180210654",
            "dpc": "03022713501",
            "name": "ឡឹម ឈាន"
        },
        {
            "barcode": "BBWS180210655",
            "dpc": "03022701301",
            "name": "ចាន់ សាមឿន"
        },
        {
            "barcode": "BBWS180210656",
            "dpc": "03022716801",
            "name": "មាស សារឿន"
        },
        {
            "barcode": "BBWS180210657",
            "dpc": "03022714801",
            "name": "អៀង ហាក់"
        },
        {
            "barcode": "BBWS180210658",
            "dpc": "03022724101",
            "name": "យ៉ិន ចាន់ម៉ូនីកា"
        },
        {
            "barcode": "BBWS180210659",
            "dpc": "03022724201",
            "name": "ម៉ៅ សុជាតិ"
        },
        {
            "barcode": "BBWS180210660",
            "dpc": "03022714601",
            "name": "ប៉ាត់ ភុន"
        },
        {
            "barcode": "BBWS180210661",
            "dpc": "03022701201",
            "name": "តាំង ហ្គិច"
        },
        {
            "barcode": "BBWS180210662",
            "dpc": "03022703601",
            "name": "ហេង ចាន់"
        },
        {
            "barcode": "BBWS180210663",
            "dpc": "03022708101",
            "name": "ចាន់ ធី"
        },
        {
            "barcode": "BBWS180210664",
            "dpc": "03022708001",
            "name": "ស ឌីណា"
        },
        {
            "barcode": "BBWS180210665",
            "dpc": "03022707901",
            "name": "លី ថាវី"
        },
        {
            "barcode": "BBWS180210666",
            "dpc": "03022703801",
            "name": "វ៉ាន់ ឌី"
        },
        {
            "barcode": "BBWS180210667",
            "dpc": "03022703701",
            "name": "ស៊ី វ៉ូន"
        },
        {
            "barcode": "BBWS180210668",
            "dpc": "03022719701",
            "name": "អ៊ុច ឆាំ"
        },
        {
            "barcode": "BBWS180210669",
            "dpc": "03022702901",
            "name": "រ៉េន វឌ្ឍនៈ"
        },
        {
            "barcode": "BBWS180210670",
            "dpc": "03022714701",
            "name": "ម៉ុយ ដាវ៉ិត"
        },
        {
            "barcode": "BBWS180210671",
            "dpc": "03022738301",
            "name": "សោម អៀ"
        },
        {
            "barcode": "BBWS180210672",
            "dpc": "03022713601",
            "name": "ម៉េង ម៉ារី"
        },
        {
            "barcode": "BBWS180210673",
            "dpc": "03022715001",
            "name": "គីម ផល្លា"
        },
        {
            "barcode": "BBWS180210674",
            "dpc": "03022715101",
            "name": "ប៉ិច ផល្លា"
        },
        {
            "barcode": "BBWS180210675",
            "dpc": "03022713701",
            "name": "សំ នៀង"
        },
        {
            "barcode": "BBWS180210676",
            "dpc": "03022738201",
            "name": "រស់ សាវ៉ុន"
        },
        {
            "barcode": "BBWS180210677",
            "dpc": "03022743201",
            "name": "អ៊ុយ សុង"
        },
        {
            "barcode": "BBWS180210678",
            "dpc": "03022720201",
            "name": "វ៉ាន់ ចាន់ធី"
        },
        {
            "barcode": "BBWS180210679",
            "dpc": "03022733201",
            "name": "គង់ សុជឿន"
        },
        {
            "barcode": "BBWS180210680",
            "dpc": "03022717701",
            "name": "យិន ថាវ"
        },
        {
            "barcode": "BBWS180210681",
            "dpc": "03022711001",
            "name": "សុត ធី"
        },
        {
            "barcode": "BBWS180210682",
            "dpc": "03022703101",
            "name": "វ៉ែន វួច"
        },
        {
            "barcode": "BBWS180210683",
            "dpc": "03022721301",
            "name": "កា សាគី"
        },
        {
            "barcode": "BBWS180210684",
            "dpc": "03022740601",
            "name": "ឡោ ជេដ្ឋា"
        },
        {
            "barcode": "BBWS180210685",
            "dpc": "03022704201",
            "name": "ឡោ អង"
        },
        {
            "barcode": "BBWS180210686",
            "dpc": "03022709201",
            "name": "ម៉ៅ សូវៀត"
        },
        {
            "barcode": "BBWS180210687",
            "dpc": "03022746701",
            "name": "ចាន់ សាវុធ"
        },
        {
            "barcode": "BBWS180210688",
            "dpc": "03022746801",
            "name": "ឆន សុវណ្ណគីរី"
        },
        {
            "barcode": "BBWS180210689",
            "dpc": "03022746901",
            "name": "អ៊ី សាវៃ"
        },
        {
            "barcode": "BBWS180210690",
            "dpc": "03022747001",
            "name": "អុង ពិទូ"
        },
        {
            "barcode": "BBWS180210691",
            "dpc": "03022747101",
            "name": "ពេជ្រ សុផៃ"
        },
        {
            "barcode": "BBWS180210692",
            "dpc": "03022747201",
            "name": "ឌួង សុខុម"
        },
        {
            "barcode": "BBWS180210693",
            "dpc": "03022747301",
            "name": "ញៀវ សឿត"
        },
        {
            "barcode": "BBWS180210694",
            "dpc": "03022747401",
            "name": "ម៉ក់ រ៉ាស៊ី"
        },
        {
            "barcode": "BBWS180210695",
            "dpc": "03022747501",
            "name": "សៀង រុំចង់"
        },
        {
            "barcode": "BBWS180210696",
            "dpc": "03022734501",
            "name": "ចិន ឡាវ"
        },
        {
            "barcode": "BBWS180210697",
            "dpc": "03022740701",
            "name": "ពិន សុភា"
        },
        {
            "barcode": "BBWS180210698",
            "dpc": "03022747901",
            "name": "សេង ខី"
        },
        {
            "barcode": "BBWS180210699",
            "dpc": "03022734601",
            "name": "សាត សឿម"
        },
        {
            "barcode": "BBWS180210700",
            "dpc": "03022726501",
            "name": "ងួន តុលា"
        },
        {
            "barcode": "BBWS180210701",
            "dpc": "03022711801",
            "name": "ស៊ុំ សឿន"
        },
        {
            "barcode": "BBWS180210702",
            "dpc": "03022731601",
            "name": "ពួកជុំនំគ្រីស្ទបរិស័ទខ្មែរ"
        },
        {
            "barcode": "BBWS180210703",
            "dpc": "03022723801",
            "name": "ង៉ែត ប៉េង"
        },
        {
            "barcode": "BBWS180210704",
            "dpc": "03022723901",
            "name": "ឃុន ស៊ីន"
        },
        {
            "barcode": "BBWS180210705",
            "dpc": "03022735301",
            "name": "ស្រី ណឹង"
        },
        {
            "barcode": "BBWS180210706",
            "dpc": "03022735401",
            "name": "លឹម ស៊ិនណារ៉ា"
        },
        {
            "barcode": "BBWS180210707",
            "dpc": "03022735201",
            "name": "ឃុន ឃឿត"
        },
        {
            "barcode": "BBWS180210708",
            "dpc": "03022727201",
            "name": "យក់ វីណង"
        },
        {
            "barcode": "BBWS180210709",
            "dpc": "03022702801",
            "name": "រឿន សំណាង"
        },
        {
            "barcode": "BBWS180210710",
            "dpc": "03022722001",
            "name": "គឹម សុង"
        },
        {
            "barcode": "BBWS180210711",
            "dpc": "03022735001",
            "name": "ដាំ សុង២"
        },
        {
            "barcode": "BBWS180210712",
            "dpc": "03022735101",
            "name": "ហ៊ាង សមាជ"
        },
        {
            "barcode": "BBWS180210713",
            "dpc": "03022711201",
            "name": "ដាំ លេខា"
        },
        {
            "barcode": "BBWS180210714",
            "dpc": "03022724301",
            "name": "សួស សុខន"
        },
        {
            "barcode": "BBWS180210715",
            "dpc": "03022711401",
            "name": "អៀ គឹមហៀង"
        },
        {
            "barcode": "BBWS180210716",
            "dpc": "03022713801",
            "name": "ចៅ ធៀង"
        },
        {
            "barcode": "BBWS180210717",
            "dpc": "03022707201",
            "name": "ហ៊ុំ ព្រេន"
        },
        {
            "barcode": "BBWS180210718",
            "dpc": "03022741301",
            "name": "យិម សុត"
        },
        {
            "barcode": "BBWS180210719",
            "dpc": "03022739501",
            "name": "នួន សុភឿន"
        },
        {
            "barcode": "BBWS180210720",
            "dpc": "03022700901",
            "name": "អេង សុយីន"
        },
        {
            "barcode": "BBWS180210721",
            "dpc": "03022716601",
            "name": "ស៊ីនម៉ុម"
        },
        {
            "barcode": "BBWS180210722",
            "dpc": "03022711101",
            "name": "ណាក សាវ៉ាត"
        },
        {
            "barcode": "BBWS180210723",
            "dpc": "03022705201",
            "name": "ស នាង"
        },
        {
            "barcode": "BBWS180210724",
            "dpc": "03022731801",
            "name": "សន គីរី"
        },
        {
            "barcode": "BBWS180210725",
            "dpc": "03022725601",
            "name": "ឡេង សំអុល"
        },
        {
            "barcode": "BBWS180210726",
            "dpc": "03022720101",
            "name": "ពួកជំនុំជំនឿលើព្រះកម្ពីប៊ីម"
        },
        {
            "barcode": "BBWS180210727",
            "dpc": "03022700801",
            "name": "សឿន សុបាល"
        },
        {
            "barcode": "BBWS180210728",
            "dpc": "03022740001",
            "name": "សូ សាវុធ"
        },
        {
            "barcode": "BBWS180210729",
            "dpc": "03022700601",
            "name": "ប៊ុន សាខន"
        },
        {
            "barcode": "BBWS180210730",
            "dpc": "03022700701",
            "name": "ឈួន ហ៊ាប"
        },
        {
            "barcode": "BBWS180210731",
            "dpc": "03022740101",
            "name": "ម៉ី ហ៊ុំ"
        },
        {
            "barcode": "BBWS180210732",
            "dpc": "03022740201",
            "name": "លី ដានី"
        },
        {
            "barcode": "BBWS180210733",
            "dpc": "03022740401",
            "name": "ព្រឿម ស៊ីណាត"
        },
        {
            "barcode": "BBWS180210734",
            "dpc": "03022740501",
            "name": "ជា ង៉ិ"
        },
        {
            "barcode": "BBWS180210735",
            "dpc": "03022705701",
            "name": "ស៊ាង ដុំ"
        },
        {
            "barcode": "BBWS180210736",
            "dpc": "03022707301",
            "name": "ហេង រំភើយ"
        },
        {
            "barcode": "BBWS180210737",
            "dpc": "03022716501",
            "name": "ហុក គា"
        },
        {
            "barcode": "BBWS180210738",
            "dpc": "03022709501",
            "name": "ផាត់ សុងសៀង"
        },
        {
            "barcode": "BBWS180210739",
            "dpc": "03022720301",
            "name": "រស់ ចាន់កុសល"
        },
        {
            "barcode": "BBWS180210740",
            "dpc": "03022714901",
            "name": "ណៃ គឹមសុន"
        },
        {
            "barcode": "BBWS180210741",
            "dpc": "03022716001",
            "name": "វៀង រ៉ាវី"
        },
        {
            "barcode": "BBWS180210742",
            "dpc": "03022715901",
            "name": "វណ សង្ហា"
        },
        {
            "barcode": "BBWS180210743",
            "dpc": "03022701101",
            "name": "អ៊ុក ហារ៉ាឌី"
        },
        {
            "barcode": "BBWS180210744",
            "dpc": "03022716401",
            "name": "ជា សុផល"
        },
        {
            "barcode": "BBWS180210745",
            "dpc": "03022732201",
            "name": "ហៀក ស៊ីនឿន"
        },
        {
            "barcode": "BBWS180210746",
            "dpc": "03022705401",
            "name": "យៀម កុងស៊ុន"
        },
        {
            "barcode": "BBWS180210747",
            "dpc": "03022711301",
            "name": "ហុង ដាវុធ"
        },
        {
            "barcode": "BBWS180210748",
            "dpc": "03022741501",
            "name": "យ៉ឹម យ៉ុង"
        },
        {
            "barcode": "BBWS180210749",
            "dpc": "03022741401",
            "name": "ជឿម ច្រិប"
        },
        {
            "barcode": "BBWS180210750",
            "dpc": "03022701001",
            "name": "អុំ ស៊ីនួន"
        },
        {
            "barcode": "BBWS180210751",
            "dpc": "03022724001",
            "name": "សយ វុទ្ធា"
        },
        {
            "barcode": "BBWS180210752",
            "dpc": "03022720701",
            "name": "នួន គឹមសួរ"
        },
        {
            "barcode": "BBWS180210753",
            "dpc": "03022720801",
            "name": "វ៉ាន់ ខេម៉ា"
        },
        {
            "barcode": "BBWS180210754",
            "dpc": "03022709301",
            "name": "នាង សុភក្ត្រ"
        },
        {
            "barcode": "BBWS180210755",
            "dpc": "03022741101",
            "name": "សៅ ទិត្យ"
        },
        {
            "barcode": "BBWS180210756",
            "dpc": "03022735601",
            "name": "លី ម៉ាល័យ"
        },
        {
            "barcode": "BBWS180210757",
            "dpc": "03022735501",
            "name": "យួម សុវណ្ណ"
        },
        {
            "barcode": "BBWS180210758",
            "dpc": "03022741001",
            "name": "គ្រី សុណន់"
        },
        {
            "barcode": "BBWS180210759",
            "dpc": "03022705501",
            "name": "គឹម វណ្ណា"
        },
        {
            "barcode": "BBWS180210760",
            "dpc": "03022723401",
            "name": "សុខ សាមន្នី១"
        },
        {
            "barcode": "BBWS180210761",
            "dpc": "03022723501",
            "name": "សុខ សាមន្នី២"
        },
        {
            "barcode": "BBWS180210762",
            "dpc": "03022723601",
            "name": "សុខ សាមន្នី៣"
        },
        {
            "barcode": "BBWS180210763",
            "dpc": "03022723701",
            "name": "សុខ សាមន្នី៤"
        },
        {
            "barcode": "BBWS180210764",
            "dpc": "03022700501",
            "name": "ឈុន អេង"
        },
        {
            "barcode": "BBWS180210765",
            "dpc": "03022702001",
            "name": "សោម សុចិត្ត"
        },
        {
            "barcode": "BBWS180210766",
            "dpc": "03022703201",
            "name": "គង់ សុន"
        },
        {
            "barcode": "BBWS180210767",
            "dpc": "03022704901",
            "name": "អ៊ួន គឹមណង"
        },
        {
            "barcode": "BBWS180210768",
            "dpc": "03022705801",
            "name": "ថន ចាន់ធឿន"
        },
        {
            "barcode": "BBWS180210769",
            "dpc": "03022706101",
            "name": "ម៉េត លី"
        },
        {
            "barcode": "BBWS180210770",
            "dpc": "03022706201",
            "name": "សេង ហុង"
        },
        {
            "barcode": "BBWS180210771",
            "dpc": "03022706301",
            "name": "សេង ហៃ"
        },
        {
            "barcode": "BBWS180210772",
            "dpc": "03022706401",
            "name": "ជុច សាកន"
        },
        {
            "barcode": "BBWS180210773",
            "dpc": "03022706501",
            "name": "ជួន ហ៊ួរ"
        },
        {
            "barcode": "BBWS180210774",
            "dpc": "03022706601",
            "name": "សុខ លុច"
        },
        {
            "barcode": "BBWS180210775",
            "dpc": "03022707401",
            "name": "ឯល ដារ៉េះ"
        },
        {
            "barcode": "BBWS180210776",
            "dpc": "03022707501",
            "name": "លី ស្មាន"
        },
        {
            "barcode": "BBWS180210777",
            "dpc": "03022707801",
            "name": "ប៉ិន ចន្ធូ"
        },
        {
            "barcode": "BBWS180210778",
            "dpc": "03022709601",
            "name": "សេន ណារី"
        },
        {
            "barcode": "BBWS180210779",
            "dpc": "03022709701",
            "name": "លី យ៉ាមី"
        },
        {
            "barcode": "BBWS180210780",
            "dpc": "03022710001",
            "name": "រ៉េះ យ៉ើ"
        },
        {
            "barcode": "BBWS180210781",
            "dpc": "03022710701",
            "name": "គឹម សូលីណែត"
        },
        {
            "barcode": "BBWS180210782",
            "dpc": "03022710901",
            "name": "សាឡេៈ រ៉ហ្វី"
        },
        {
            "barcode": "BBWS180210783",
            "dpc": "03022711601",
            "name": "សឿន ពិសិទ្ធ"
        },
        {
            "barcode": "BBWS180210784",
            "dpc": "03022711901",
            "name": "ស៊ីវ លឿប"
        },
        {
            "barcode": "BBWS180210785",
            "dpc": "03022712001",
            "name": "មាន សារ៉ាត់"
        },
        {
            "barcode": "BBWS180210786",
            "dpc": "03022712101",
            "name": "ហម សុភក្រ័"
        },
        {
            "barcode": "BBWS180210787",
            "dpc": "03022712601",
            "name": "ហ៊ឹម ពុធសុវណ្ណ"
        },
        {
            "barcode": "BBWS180210788",
            "dpc": "03022712701",
            "name": "សាំង លីម"
        },
        {
            "barcode": "BBWS180210789",
            "dpc": "03022712801",
            "name": "លាង ឡា"
        },
        {
            "barcode": "BBWS180210790",
            "dpc": "03022713401",
            "name": "វ៉ាន់ រក្សា"
        },
        {
            "barcode": "BBWS180210791",
            "dpc": "03022714001",
            "name": "លី យ៉េត"
        },
        {
            "barcode": "BBWS180210792",
            "dpc": "03022715201",
            "name": "ឡោះ អាស្សីហ្សាស់"
        },
        {
            "barcode": "BBWS180210793",
            "dpc": "03022715301",
            "name": "ភឹត ស៊ីណា"
        },
        {
            "barcode": "BBWS180210794",
            "dpc": "03022715401",
            "name": "វ័រ វី"
        },
        {
            "barcode": "BBWS180210795",
            "dpc": "03022715501",
            "name": "ម៉ាត់ រ៉ភីយ៉ាស់"
        },
        {
            "barcode": "BBWS180210796",
            "dpc": "03022715601",
            "name": "សួន សុផល"
        },
        {
            "barcode": "BBWS180210797",
            "dpc": "03022715701",
            "name": "កែវ រ៉ស៊ីឌី"
        },
        {
            "barcode": "BBWS180210798",
            "dpc": "03022715801",
            "name": "អ៊ិន សភីយ៉ា"
        },
        {
            "barcode": "BBWS180210799",
            "dpc": "03022716101",
            "name": "សំ ហឿប"
        },
        {
            "barcode": "BBWS180210800",
            "dpc": "03022716201",
            "name": "លឿង សុខា"
        },
        {
            "barcode": "BBWS180210801",
            "dpc": "03022716701",
            "name": "ហួត ការី"
        },
        {
            "barcode": "BBWS180210802",
            "dpc": "03022716901",
            "name": "ទៀ ហ៊នី"
        },
        {
            "barcode": "BBWS180210803",
            "dpc": "03022717901",
            "name": "ឡៅ ប៉េងលី"
        },
        {
            "barcode": "BBWS180210804",
            "dpc": "03022718401",
            "name": "សំ គីមសេង"
        },
        {
            "barcode": "BBWS180210805",
            "dpc": "03022718801",
            "name": "ឯល រ៉ូហ្សាត"
        },
        {
            "barcode": "BBWS180210806",
            "dpc": "03022718901",
            "name": "ហាប់ ស្រីមុំ"
        },
        {
            "barcode": "BBWS180210807",
            "dpc": "03022719001",
            "name": "ថាប់ សុធានី"
        },
        {
            "barcode": "BBWS180210808",
            "dpc": "03022719101",
            "name": "វ៉ាន់ ថា"
        },
        {
            "barcode": "BBWS180210809",
            "dpc": "03022719201",
            "name": "ម៉ៅ ដារ៉ា"
        },
        {
            "barcode": "BBWS180210810",
            "dpc": "03022719601",
            "name": "សំ ហេង"
        },
        {
            "barcode": "BBWS180210811",
            "dpc": "03022720601",
            "name": "ហួយ ចន្នី"
        },
        {
            "barcode": "BBWS180210812",
            "dpc": "03022721401",
            "name": "ឈិត ចាន់ភីរម្យ"
        },
        {
            "barcode": "BBWS180210813",
            "dpc": "03022721501",
            "name": "ម៉ូត សាគីរីន"
        },
        {
            "barcode": "BBWS180210814",
            "dpc": "03022721601",
            "name": "ប៉ោល ថន"
        },
        {
            "barcode": "BBWS180210815",
            "dpc": "03022721701",
            "name": "សំអែល សាវុធ"
        },
        {
            "barcode": "BBWS180210816",
            "dpc": "03022721801",
            "name": "រ័ត្ន សោភ័ណ្ឌ"
        },
        {
            "barcode": "BBWS180210817",
            "dpc": "03022722601",
            "name": "ផ្សារទំនើបភួ ពុយ"
        },
        {
            "barcode": "BBWS180210818",
            "dpc": "03022722701",
            "name": "ភួ ពុយ"
        },
        {
            "barcode": "BBWS180210819",
            "dpc": "03022722801",
            "name": "អ៊ឹង រស្មី"
        },
        {
            "barcode": "BBWS180210820",
            "dpc": "03022723301",
            "name": "ឡាច សម្បត្តិ"
        },
        {
            "barcode": "BBWS180210821",
            "dpc": "03022724701",
            "name": "ចៅ ហា"
        },
        {
            "barcode": "BBWS180210822",
            "dpc": "03022724801",
            "name": "គឹម ចន្ថា"
        },
        {
            "barcode": "BBWS180210823",
            "dpc": "03022725101",
            "name": "សុខ នី"
        },
        {
            "barcode": "BBWS180210824",
            "dpc": "03022725801",
            "name": "អ៊ុន សុផាត"
        },
        {
            "barcode": "BBWS180210825",
            "dpc": "03022726201",
            "name": "ហាំង ឡេង"
        },
        {
            "barcode": "BBWS180210826",
            "dpc": "03022726301",
            "name": "កុយ ណាឬទ្ធិ"
        },
        {
            "barcode": "BBWS180210827",
            "dpc": "03022726401",
            "name": "រ៉ែម ចឹក"
        },
        {
            "barcode": "BBWS180210828",
            "dpc": "03022726601",
            "name": "មាស ភី"
        },
        {
            "barcode": "BBWS180210829",
            "dpc": "03022726701",
            "name": "ញ៉ិល បូណាវី"
        },
        {
            "barcode": "BBWS180210830",
            "dpc": "03022726901",
            "name": "បាន សាវ៉េត"
        },
        {
            "barcode": "BBWS180210831",
            "dpc": "03022727001",
            "name": "ងី ហេង"
        },
        {
            "barcode": "BBWS180210832",
            "dpc": "03022727401",
            "name": "កូយ ម៉ុយ"
        },
        {
            "barcode": "BBWS180210833",
            "dpc": "03022727601",
            "name": "សែម សារ៉ាត់"
        },
        {
            "barcode": "BBWS180210834",
            "dpc": "03022727701",
            "name": "ងួន ភារម្យ"
        },
        {
            "barcode": "BBWS180210835",
            "dpc": "03022728201",
            "name": "ទួត រ៉ើន"
        },
        {
            "barcode": "BBWS180210836",
            "dpc": "03022728401",
            "name": "ឱ ចំរ៉ុង ២"
        },
        {
            "barcode": "BBWS180210837",
            "dpc": "03022728501",
            "name": "លី ម៉ាត់តារេៈ"
        },
        {
            "barcode": "BBWS180210838",
            "dpc": "03022728601",
            "name": "ស៊ីន ផាទីម៉ាស់"
        },
        {
            "barcode": "BBWS180210839",
            "dpc": "03022728801",
            "name": "ឃុត សេន"
        },
        {
            "barcode": "BBWS180210840",
            "dpc": "03022728901",
            "name": "ទី ធី"
        },
        {
            "barcode": "BBWS180210841",
            "dpc": "03022729201",
            "name": "ង៉ត ញ៉ាញ់"
        },
        {
            "barcode": "BBWS180210842",
            "dpc": "03022729301",
            "name": "ផន វិចិត្រ"
        },
        {
            "barcode": "BBWS180210843",
            "dpc": "03022729401",
            "name": "ហែម ណារ័ត្ន"
        },
        {
            "barcode": "BBWS180210844",
            "dpc": "03022729501",
            "name": "ប៉ិច រដ្ឋា"
        },
        {
            "barcode": "BBWS180210845",
            "dpc": "03022729601",
            "name": "ចាន់ សំនាង"
        },
        {
            "barcode": "BBWS180210846",
            "dpc": "03022729701",
            "name": "អុំ ឌិន"
        },
        {
            "barcode": "BBWS180210847",
            "dpc": "03022730001",
            "name": "ទូច ហ៊ីង"
        },
        {
            "barcode": "BBWS180210848",
            "dpc": "03022730101",
            "name": "ឃុន យឿន"
        },
        {
            "barcode": "BBWS180210849",
            "dpc": "03022730201",
            "name": "ប៉ុល ពេជ្រ"
        },
        {
            "barcode": "BBWS180210850",
            "dpc": "03022730601",
            "name": "ថៃ ចិន្តា"
        },
        {
            "barcode": "BBWS180210851",
            "dpc": "03022730701",
            "name": "មិន នាង"
        },
        {
            "barcode": "BBWS180210852",
            "dpc": "03022730901",
            "name": "ឯក សុត្តារ៉ា"
        },
        {
            "barcode": "BBWS180210853",
            "dpc": "03022731101",
            "name": "យិន លាងហេង"
        },
        {
            "barcode": "BBWS180210854",
            "dpc": "03022731201",
            "name": "ម៉ៃ សាមុត"
        },
        {
            "barcode": "BBWS180210855",
            "dpc": "03022731501",
            "name": "ឡាយ សុខឡេង"
        },
        {
            "barcode": "BBWS180210856",
            "dpc": "03022731701",
            "name": "អ៊ុក ធឹម"
        },
        {
            "barcode": "BBWS180210857",
            "dpc": "03022731901",
            "name": "ថ ធឿន"
        },
        {
            "barcode": "BBWS180210858",
            "dpc": "03022732401",
            "name": "អ៊ឹម ម៉ុន់"
        },
        {
            "barcode": "BBWS180210859",
            "dpc": "03022732501",
            "name": "ស៊ិន វណ្ណា"
        },
        {
            "barcode": "BBWS180210860",
            "dpc": "03022733401",
            "name": "សាំង សំណាង"
        },
        {
            "barcode": "BBWS180210861",
            "dpc": "03022733601",
            "name": "សួន សុខគា"
        },
        {
            "barcode": "BBWS180210862",
            "dpc": "03022733701",
            "name": "អឿង ប៉ាង"
        },
        {
            "barcode": "BBWS180210863",
            "dpc": "03022733901",
            "name": "ជួន កៅ"
        },
        {
            "barcode": "BBWS180210864",
            "dpc": "03022734001",
            "name": "អៀម ប៊ុននី"
        },
        {
            "barcode": "BBWS180210865",
            "dpc": "03022734201",
            "name": "សើន ចំរើន"
        },
        {
            "barcode": "BBWS180210866",
            "dpc": "03022734301",
            "name": "ទៀ ស៊ានី"
        },
        {
            "barcode": "BBWS180210867",
            "dpc": "03022734401",
            "name": "ម៉ុក សុថារី"
        },
        {
            "barcode": "BBWS180210868",
            "dpc": "03022734801",
            "name": "សន សុធី"
        },
        {
            "barcode": "BBWS180210869",
            "dpc": "03022734901",
            "name": "អ៊ុំ​ ឡ្ញុញ"
        },
        {
            "barcode": "BBWS180210870",
            "dpc": "03022735701",
            "name": "និល យឿត"
        },
        {
            "barcode": "BBWS180210871",
            "dpc": "03022735801",
            "name": "ឡឹក សុភា"
        },
        {
            "barcode": "BBWS180210872",
            "dpc": "03022735901",
            "name": "អ៊ុក ឧសភា"
        },
        {
            "barcode": "BBWS180210873",
            "dpc": "03022736001",
            "name": "ហម រិទ្ឋី១"
        },
        {
            "barcode": "BBWS180210874",
            "dpc": "03022736201",
            "name": "ឆន ណារី"
        },
        {
            "barcode": "BBWS180210875",
            "dpc": "03022736301",
            "name": "ឈុំ សិទ្ឋិ"
        },
        {
            "barcode": "BBWS180210876",
            "dpc": "03022736701",
            "name": "ងិន ចំរើន"
        },
        {
            "barcode": "BBWS180210877",
            "dpc": "03022738001",
            "name": "ពៅ សុជិន"
        },
        {
            "barcode": "BBWS180210878",
            "dpc": "03022738601",
            "name": "ម៉ាក់ នឿន"
        },
        {
            "barcode": "BBWS180210879",
            "dpc": "03022738701",
            "name": "ខន សុខលី"
        },
        {
            "barcode": "BBWS180210880",
            "dpc": "03022738801",
            "name": "សៀង សែម"
        },
        {
            "barcode": "BBWS180210881",
            "dpc": "03022738901",
            "name": "សូត្រ លិម"
        },
        {
            "barcode": "BBWS180210882",
            "dpc": "03022739001",
            "name": "ឯល យូសុះ"
        },
        {
            "barcode": "BBWS180210883",
            "dpc": "03022739101",
            "name": "កាត សាវ៉ាត"
        },
        {
            "barcode": "BBWS180210884",
            "dpc": "03022739201",
            "name": "និល ណារ៉ាន់"
        },
        {
            "barcode": "BBWS180210885",
            "dpc": "03022739301",
            "name": "គីន រ៉ម៉ាហ្វ្សី់"
        },
        {
            "barcode": "BBWS180210886",
            "dpc": "03022739401",
            "name": "រស់ ថន"
        },
        {
            "barcode": "BBWS180210887",
            "dpc": "03022740301",
            "name": "ឌឿប រិទ្វី"
        },
        {
            "barcode": "BBWS180210888",
            "dpc": "03022741601",
            "name": "អ៊ុក សំអូន"
        },
        {
            "barcode": "BBWS180210889",
            "dpc": "03022741701",
            "name": "ពុំ ចាន់"
        },
        {
            "barcode": "BBWS180210890",
            "dpc": "03022741801",
            "name": "ងិន ពៅ"
        },
        {
            "barcode": "BBWS180210891",
            "dpc": "03022741901",
            "name": "មួន គង់"
        },
        {
            "barcode": "BBWS180210892",
            "dpc": "03022742001",
            "name": "គឹម រូឡង់"
        },
        {
            "barcode": "BBWS180210893",
            "dpc": "03022742101",
            "name": "វង្ស សារឿន"
        },
        {
            "barcode": "BBWS180210894",
            "dpc": "03022743301",
            "name": "ឆា ឆួប"
        },
        {
            "barcode": "BBWS180210895",
            "dpc": "03022743401",
            "name": "សុទ្វ សុន"
        },
        {
            "barcode": "BBWS180210896",
            "dpc": "03022743501",
            "name": "ខ្លូត សុខ"
        },
        {
            "barcode": "BBWS180210897",
            "dpc": "03022743601",
            "name": "ឌុច វិចិត្រ"
        },
        {
            "barcode": "BBWS180210898",
            "dpc": "03022743701",
            "name": "អ៊ុក យ៉េន"
        },
        {
            "barcode": "BBWS180210899",
            "dpc": "03022743801",
            "name": "ស៊ុន សុះ"
        },
        {
            "barcode": "BBWS180210900",
            "dpc": "03022745401",
            "name": "ចន្ទ័ ហេង"
        },
        {
            "barcode": "BBWS180210901",
            "dpc": "03022745501",
            "name": "ងឺ ម៉ារឌី"
        },
        {
            "barcode": "BBWS180210902",
            "dpc": "03022747701",
            "name": "សំ ពៅ"
        },
        {
            "barcode": "BBWS180210903",
            "dpc": "03022747801",
            "name": "រៀប ឆេងគាម"
        },
        {
            "barcode": "BBWS180210904",
            "dpc": "03022718101",
            "name": "ពៅ បុប្ជា"
        },
        {
            "barcode": "BBWS180210905",
            "dpc": "03022717801",
            "name": "ឡៅ ឆាយទ្រី"
        },
        {
            "barcode": "BBWS180210906",
            "dpc": "03022745701",
            "name": "ហ៊ុយ ហេង"
        },
        {
            "barcode": "BBWS180210907",
            "dpc": "03022734101",
            "name": "ម៉ៅ វែង"
        },
        {
            "barcode": "BBWS180210908",
            "dpc": "03022722901",
            "name": "សៅ មិនាអង្គារ៉ា"
        },
        {
            "barcode": "BBWS180210909",
            "dpc": "03022717201",
            "name": "សេក សាគុណ"
        },
        {
            "barcode": "BBWS180210910",
            "dpc": "03022712301",
            "name": "អ៊ុង សុផាត"
        },
        {
            "barcode": "BBWS180210911",
            "dpc": "03022710201",
            "name": "លុយ សារុន"
        },
        {
            "barcode": "BBWS180210912",
            "dpc": "03022717301",
            "name": "ឈិន សឿន"
        },
        {
            "barcode": "BBWS180210913",
            "dpc": "03022745901",
            "name": "លន់ ឡោ"
        },
        {
            "barcode": "BBWS180210914",
            "dpc": "03022724901",
            "name": "ឡោ ប៊ុនឡេង"
        },
        {
            "barcode": "BBWS180210915",
            "dpc": "03022710401",
            "name": "សំ សារុន"
        },
        {
            "barcode": "BBWS180210916",
            "dpc": "03022710101",
            "name": "ហ៊ុន ដារា"
        },
        {
            "barcode": "BBWS180210917",
            "dpc": "03022704101",
            "name": "អឿង សាវិញ"
        },
        {
            "barcode": "BBWS180210918",
            "dpc": "03022704001",
            "name": "ជា ដារ៉ា"
        },
        {
            "barcode": "BBWS180210919",
            "dpc": "03022700101",
            "name": "យក់ សំអឿន"
        },
        {
            "barcode": "BBWS180210920",
            "dpc": "03022746101",
            "name": "យឿម សុភ័ណដារ៉ា"
        },
        {
            "barcode": "BBWS180210921",
            "dpc": "03022746001",
            "name": "និល គុយហេង"
        },
        {
            "barcode": "BBWS180210922",
            "dpc": "03022723001",
            "name": "គង់ ដារ័ត្ន"
        },
        {
            "barcode": "BBWS180210923",
            "dpc": "03022720401",
            "name": "ជា​ សុខ"
        },
        {
            "barcode": "BBWS180210924",
            "dpc": "03022714101",
            "name": "អ៊ុំ ចាន់ណា"
        },
        {
            "barcode": "BBWS180210925",
            "dpc": "03022709101",
            "name": "ឃួយ ហ៊ាង"
        },
        {
            "barcode": "BBWS180210926",
            "dpc": "03022702501",
            "name": "យន យេន"
        },
        {
            "barcode": "BBWS180210927",
            "dpc": "03022746501",
            "name": "ឌី ឃាង"
        },
        {
            "barcode": "BBWS180210928",
            "dpc": "03022746301",
            "name": "ដិប ឪរ័ត្នន៍"
        },
        {
            "barcode": "BBWS180210929",
            "dpc": "03022746201",
            "name": "ហ៊ន សុភ័ណ"
        },
        {
            "barcode": "BBWS180210930",
            "dpc": "03022729901",
            "name": "វង់ ពិដោ"
        },
        {
            "barcode": "BBWS180210931",
            "dpc": "03022729801",
            "name": "ខាវ ណារ៉េត"
        },
        {
            "barcode": "BBWS180210932",
            "dpc": "03022725001",
            "name": "យឹម ប៊ុនរឿន"
        },
        {
            "barcode": "BBWS180210933",
            "dpc": "03022723101",
            "name": "ស៊ាន ណៃធី"
        },
        {
            "barcode": "BBWS180210934",
            "dpc": "03022718001",
            "name": "កុច រីណា"
        },
        {
            "barcode": "BBWS180210935",
            "dpc": "03022712401",
            "name": "អុំ ស៊ីណាត"
        },
        {
            "barcode": "BBWS180210936",
            "dpc": "03022710601",
            "name": "វែង គឹមហៀក"
        },
        {
            "barcode": "BBWS180210937",
            "dpc": "03022710501",
            "name": "ឯក ពេជ្រ"
        },
        {
            "barcode": "BBWS180210938",
            "dpc": "03022746401",
            "name": "សួន សារុំ"
        },
        {
            "barcode": "BBWS180210939",
            "dpc": "03022739601",
            "name": "ង៉ែត សាវ៉ុន"
        },
        {
            "barcode": "BBWS180210940",
            "dpc": "03022718201",
            "name": "ទុយ អារ៉ាម"
        },
        {
            "barcode": "BBWS180210941",
            "dpc": "03022712501",
            "name": "លីវ មុំ"
        },
        {
            "barcode": "BBWS180210942",
            "dpc": "03022739901",
            "name": "មុំ អ៊ាន"
        },
        {
            "barcode": "BBWS180210943",
            "dpc": "03022739801",
            "name": "វន អេននី"
        },
        {
            "barcode": "BBWS180210944",
            "dpc": "03022739701",
            "name": "ខាវ យៀង"
        },
        {
            "barcode": "BBWS180210945",
            "dpc": "03022727101",
            "name": "លី គឹមធី"
        },
        {
            "barcode": "BBWS180210946",
            "dpc": "03022719901",
            "name": "ឃួន សុផាន់ណា"
        },
        {
            "barcode": "BBWS180210947",
            "dpc": "03022714201",
            "name": "ធា ចិន"
        },
        {
            "barcode": "BBWS180210948",
            "dpc": "03022704301",
            "name": "គុំ វង្សមុន្នី"
        },
        {
            "barcode": "BBWS180210949",
            "dpc": "03022720501",
            "name": "លី ពិសេត"
        },
        {
            "barcode": "BBWS180210950",
            "dpc": "03022717501",
            "name": "មុត សុធា"
        },
        {
            "barcode": "BBWS180210951",
            "dpc": "03022717601",
            "name": "រស់ ណារ៉ុង"
        },
        {
            "barcode": "BBWS180210952",
            "dpc": "03022700201",
            "name": "សំអុន សំណាង"
        },
        {
            "barcode": "BBWS180210953",
            "dpc": "03022712201",
            "name": "គីម សយ"
        },
        {
            "barcode": "BBWS180210954",
            "dpc": "03022721001",
            "name": "ហោ សុតន"
        },
        {
            "barcode": "BBWS180210955",
            "dpc": "03022725401",
            "name": "ស៊្រី ម៉េង"
        },
        {
            "barcode": "BBWS180210956",
            "dpc": "03022725301",
            "name": "សាន ប៉ូរ៉េត"
        },
        {
            "barcode": "BBWS180210957",
            "dpc": "03022731401",
            "name": "ផាង ស៊ីលូថូ"
        },
        {
            "barcode": "BBWS180210958",
            "dpc": "03022708201",
            "name": "ជា​ ហ៊ាង"
        },
        {
            "barcode": "BBWS180210959",
            "dpc": "03022745301",
            "name": "គឹម ហួត"
        },
        {
            "barcode": "BBWS180210960",
            "dpc": "03022745201",
            "name": "ចាន់ បូរ៉ា"
        },
        {
            "barcode": "BBWS180210961",
            "dpc": "03022744001",
            "name": "តាំង សុផល"
        },
        {
            "barcode": "BBWS180210962",
            "dpc": "03022744101",
            "name": "កែវ វុទ្ធី"
        },
        {
            "barcode": "BBWS180210963",
            "dpc": "03022744301",
            "name": "ប៉ោ មី"
        },
        {
            "barcode": "BBWS180210964",
            "dpc": "03022744401",
            "name": "ហ៊ាង"
        },
        {
            "barcode": "BBWS180210965",
            "dpc": "03022744501",
            "name": "មាស គន្ធេង"
        },
        {
            "barcode": "BBWS180210966",
            "dpc": "03022744601",
            "name": "ម៉ៅ ម៉ន"
        },
        {
            "barcode": "BBWS180210967",
            "dpc": "03022744701",
            "name": "អៀង សុធា"
        },
        {
            "barcode": "BBWS180210968",
            "dpc": "03022744801",
            "name": "គ្រូ រ័ត្ន"
        },
        {
            "barcode": "BBWS180210969",
            "dpc": "03022744901",
            "name": "ណឹង បូណា"
        },
        {
            "barcode": "BBWS180210970",
            "dpc": "03022745001",
            "name": "គ្រូ ភីរម្យ"
        },
        {
            "barcode": "BBWS180210971",
            "dpc": "03022745101",
            "name": "ជឹង ម៉ុយលី"
        },
        {
            "barcode": "BBWS180210972",
            "dpc": "03022708301",
            "name": "ចុង ផែត"
        },
        {
            "barcode": "BBWS180210973",
            "dpc": "03022724601",
            "name": "ហេង វែងឈាន"
        },
        {
            "barcode": "BBWS180210974",
            "dpc": "03022702301",
            "name": "ហេង នារតី"
        },
        {
            "barcode": "BBWS180210975",
            "dpc": "03022701501",
            "name": "ឡោះ ម៉ាស់"
        },
        {
            "barcode": "BBWS180210976",
            "dpc": "03022701701",
            "name": "ឯល លីណា"
        },
        {
            "barcode": "BBWS180210977",
            "dpc": "03022701401",
            "name": "យ៉េន សាវី"
        },
        {
            "barcode": "BBWS180210978",
            "dpc": "03022707701",
            "name": "ម៉ាន ម៉ាត់លី"
        },
        {
            "barcode": "BBWS180210979",
            "dpc": "03022701601",
            "name": "ខៀវ ពេជ្ររស្មីសុវណ្ណ"
        },
        {
            "barcode": "BBWS180210980",
            "dpc": "03022748001",
            "name": "ឌី សុខ"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
