let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=
    [
        {
            "barcode": "BBWS180200001",
            "dpc": "03013004501",
            "name": "គឹម ហៀក"
        },
        {
            "barcode": "BBWS180200002",
            "dpc": "03013007401",
            "name": "ប៉ិច ស៊ីណា"
        },
        {
            "barcode": "BBWS180200003",
            "dpc": "03013006801",
            "name": "យឿម ដារ៉ៃ"
        },
        {
            "barcode": "BBWS180200004",
            "dpc": "03013006701",
            "name": "ទីន ហាន"
        },
        {
            "barcode": "BBWS180200005",
            "dpc": "03013006601",
            "name": "ម៉ៅ រ៉ាម៉ន"
        },
        {
            "barcode": "BBWS180200006",
            "dpc": "03013002101",
            "name": "ផាន លីហុង"
        },
        {
            "barcode": "BBWS180200007",
            "dpc": "03013001001",
            "name": "ហេង ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180200008",
            "dpc": "03013013201",
            "name": "ស៊ន ហាន"
        },
        {
            "barcode": "BBWS180200009",
            "dpc": "03013018201",
            "name": "ហេង ចំរើន"
        },
        {
            "barcode": "BBWS180200010",
            "dpc": "03013012701",
            "name": "អ៊ុក គឹមឡេក"
        },
        {
            "barcode": "BBWS180200011",
            "dpc": "03013003801",
            "name": "រឿន ភារុណ"
        },
        {
            "barcode": "BBWS180200012",
            "dpc": "03013012001",
            "name": "គឹម បុផា"
        },
        {
            "barcode": "BBWS180200013",
            "dpc": "03013005701",
            "name": "ម៉ៅ ហួយ"
        },
        {
            "barcode": "BBWS180200014",
            "dpc": "03013011901",
            "name": "តូច ចេវ"
        },
        {
            "barcode": "BBWS180200015",
            "dpc": "03013001401",
            "name": "សន ពៅ"
        },
        {
            "barcode": "BBWS180200016",
            "dpc": "03013013001",
            "name": "រស្មី គឹមហេង"
        },
        {
            "barcode": "BBWS180200017",
            "dpc": "03013001201",
            "name": "រ៉ាយ នូរ"
        },
        {
            "barcode": "BBWS180200018",
            "dpc": "03013017801",
            "name": "អ៊ុ ចាន់សួរ"
        },
        {
            "barcode": "BBWS180200019",
            "dpc": "03013001601",
            "name": "រឿន រ៉េត"
        },
        {
            "barcode": "BBWS180200020",
            "dpc": "03013001701",
            "name": "តឹក រ៉ាវុធ"
        },
        {
            "barcode": "BBWS180200021",
            "dpc": "03013004301",
            "name": "អ៊ុក សុខហេង"
        },
        {
            "barcode": "BBWS180200022",
            "dpc": "03013012101",
            "name": "ប្រាក់ ស៊ីវត្ថា"
        },
        {
            "barcode": "BBWS180200023",
            "dpc": "03013015201",
            "name": "សាលារៀន រតនៈ"
        },
        {
            "barcode": "BBWS180200024",
            "dpc": "03013003901",
            "name": "ប៊ុន រីន"
        },
        {
            "barcode": "BBWS180200025",
            "dpc": "03013007001",
            "name": "សូ សាវី"
        },
        {
            "barcode": "BBWS180200026",
            "dpc": "03013007301",
            "name": "ពុំ ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "BBWS180200027",
            "dpc": "03013012801",
            "name": "យស់ យឿន"
        },
        {
            "barcode": "BBWS180200028",
            "dpc": "03013013101",
            "name": "គង់ ស៊ីវន"
        },
        {
            "barcode": "BBWS180200029",
            "dpc": "03013004801",
            "name": "ស៊ុន សំបូរ"
        },
        {
            "barcode": "BBWS180200030",
            "dpc": "03013020201",
            "name": "ព្រំ ឌីផាណេត"
        },
        {
            "barcode": "BBWS180200031",
            "dpc": "03013020501",
            "name": "តាន់ ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180200032",
            "dpc": "03013007201",
            "name": "ភិន ភារិទ្ធ"
        },
        {
            "barcode": "BBWS180200033",
            "dpc": "03013000901",
            "name": "ប៉ាន់ វូចឡា"
        },
        {
            "barcode": "BBWS180200034",
            "dpc": "03013020301",
            "name": "សុខ ជួង"
        },
        {
            "barcode": "BBWS180200035",
            "dpc": "03013020401",
            "name": "ពុំ រតនា"
        },
        {
            "barcode": "BBWS180200036",
            "dpc": "03013024501",
            "name": "យូ វុទ្ធី"
        },
        {
            "barcode": "BBWS180200037",
            "dpc": "03013024601",
            "name": "ថាច់ រដើយ"
        },
        {
            "barcode": "BBWS180200038",
            "dpc": "03013013701",
            "name": "សេន ហ៊ូយ"
        },
        {
            "barcode": "BBWS180200039",
            "dpc": "03013013801",
            "name": "គង់ ឡុច"
        },
        {
            "barcode": "BBWS180200040",
            "dpc": "03013004901",
            "name": "សុត គឹមរ៉ា"
        },
        {
            "barcode": "BBWS180200041",
            "dpc": "03013003601",
            "name": "តាំង ជាវសែ"
        },
        {
            "barcode": "BBWS180200042",
            "dpc": "03013024401",
            "name": "ស្រែ ធី"
        },
        {
            "barcode": "BBWS180200043",
            "dpc": "03013000201",
            "name": "ស៊ិន ឡៃ"
        },
        {
            "barcode": "BBWS180200044",
            "dpc": "03013000301",
            "name": "ប៊ន សុវណ្ណ"
        },
        {
            "barcode": "BBWS180200045",
            "dpc": "03013000401",
            "name": "ពែល អមរា"
        },
        {
            "barcode": "BBWS180200046",
            "dpc": "03013000501",
            "name": "នន់ សាវីន"
        },
        {
            "barcode": "BBWS180200047",
            "dpc": "03013008901",
            "name": "ឈុំ ឈុន"
        },
        {
            "barcode": "BBWS180200048",
            "dpc": "03013005601",
            "name": "ឈាវ តែម"
        },
        {
            "barcode": "BBWS180200049",
            "dpc": "03013000701",
            "name": "គ្រឿន ណាំ"
        },
        {
            "barcode": "BBWS180200050",
            "dpc": "03013001101",
            "name": "ហរ សាន"
        },
        {
            "barcode": "BBWS180200051",
            "dpc": "03013001301",
            "name": "ប្រាក់ រ៉ាឌី"
        },
        {
            "barcode": "BBWS180200052",
            "dpc": "03013001801",
            "name": "ម៉ៅ មន្នី"
        },
        {
            "barcode": "BBWS180200053",
            "dpc": "03013001901",
            "name": "ហាក់ ប៊ុនថាន"
        },
        {
            "barcode": "BBWS180200054",
            "dpc": "03013002001",
            "name": "កែវ សុខា"
        },
        {
            "barcode": "BBWS180200055",
            "dpc": "03013002201",
            "name": "ពិន ធារី"
        },
        {
            "barcode": "BBWS180200056",
            "dpc": "03013002301",
            "name": "ណុប រ៉ាវុធ"
        },
        {
            "barcode": "BBWS180200057",
            "dpc": "03013002401",
            "name": "ស្រេង ស៊ីនួ ១"
        },
        {
            "barcode": "BBWS180200058",
            "dpc": "03013003101",
            "name": "ម៉េង សោផា"
        },
        {
            "barcode": "BBWS180200059",
            "dpc": "03013003301",
            "name": "ហេង រីណា"
        },
        {
            "barcode": "BBWS180200060",
            "dpc": "03013003501",
            "name": "មីត សាឡេះ"
        },
        {
            "barcode": "BBWS180200061",
            "dpc": "03013004001",
            "name": "ចាប ថុល"
        },
        {
            "barcode": "BBWS180200062",
            "dpc": "03013004101",
            "name": "ហុង លីណា"
        },
        {
            "barcode": "BBWS180200063",
            "dpc": "03013004201",
            "name": "ប៉ាល់ គឹមស៊ាន"
        },
        {
            "barcode": "BBWS180200064",
            "dpc": "03013004401",
            "name": "ឡុង ធារិន"
        },
        {
            "barcode": "BBWS180200065",
            "dpc": "03013005101",
            "name": "សុ វឺត"
        },
        {
            "barcode": "BBWS180200066",
            "dpc": "03013005201",
            "name": "ណាង ស្រីនី"
        },
        {
            "barcode": "BBWS180200067",
            "dpc": "03013005401",
            "name": "អេង ង៉ោ"
        },
        {
            "barcode": "BBWS180200068",
            "dpc": "03013005501",
            "name": "ង៉ែត លាង"
        },
        {
            "barcode": "BBWS180200069",
            "dpc": "03013005801",
            "name": "ឈាវ រី"
        },
        {
            "barcode": "BBWS180200070",
            "dpc": "03013005901",
            "name": "ជា ទូច"
        },
        {
            "barcode": "BBWS180200071",
            "dpc": "03013006001",
            "name": "យិន លីនដា"
        },
        {
            "barcode": "BBWS180200072",
            "dpc": "03013006101",
            "name": "សំ វណ្ណា"
        },
        {
            "barcode": "BBWS180200073",
            "dpc": "03013006201",
            "name": "តឹក ជ័យមង្គល"
        },
        {
            "barcode": "BBWS180200074",
            "dpc": "03013006301",
            "name": "ម៉ី បុរី"
        },
        {
            "barcode": "BBWS180200075",
            "dpc": "03013006401",
            "name": "ចាន់ គឹមអេង"
        },
        {
            "barcode": "BBWS180200076",
            "dpc": "03013006501",
            "name": "តាំង ផេងហ៊ី"
        },
        {
            "barcode": "BBWS180200077",
            "dpc": "03013006901",
            "name": "ស៊ីម ទៀង"
        },
        {
            "barcode": "BBWS180200078",
            "dpc": "03013007101",
            "name": "ប៊ុត ទូច"
        },
        {
            "barcode": "BBWS180200079",
            "dpc": "03013007501",
            "name": "ហុង ផេង"
        },
        {
            "barcode": "BBWS180200080",
            "dpc": "03013007601",
            "name": "គីវ បុប្ជា"
        },
        {
            "barcode": "BBWS180200081",
            "dpc": "03013008101",
            "name": "ស៊ុន សុភាព"
        },
        {
            "barcode": "BBWS180200082",
            "dpc": "03013008201",
            "name": "ពូ សុភា"
        },
        {
            "barcode": "BBWS180200083",
            "dpc": "03013008401",
            "name": "កុយ ដោក"
        },
        {
            "barcode": "BBWS180200084",
            "dpc": "03013008701",
            "name": "ហេង សុខម្នី"
        },
        {
            "barcode": "BBWS180200085",
            "dpc": "03013009001",
            "name": "ហុង ហាវ"
        },
        {
            "barcode": "BBWS180200086",
            "dpc": "03013009101",
            "name": "ស៊ុត សុផល"
        },
        {
            "barcode": "BBWS180200087",
            "dpc": "03013009201",
            "name": "ម៉ុត រឹម"
        },
        {
            "barcode": "BBWS180200088",
            "dpc": "03013009301",
            "name": "តុល សុផល"
        },
        {
            "barcode": "BBWS180200089",
            "dpc": "03013009401",
            "name": "កិច ង៉ោ"
        },
        {
            "barcode": "BBWS180200090",
            "dpc": "03013009601",
            "name": "លឹម ផៃ"
        },
        {
            "barcode": "BBWS180200091",
            "dpc": "03013009701",
            "name": "ម៉េង សុគិត"
        },
        {
            "barcode": "BBWS180200092",
            "dpc": "03013009801",
            "name": "នី លីហេង"
        },
        {
            "barcode": "BBWS180200093",
            "dpc": "03013009901",
            "name": "ឈិត ប៊ុនឆន"
        },
        {
            "barcode": "BBWS180200094",
            "dpc": "03013010101",
            "name": "លី គុយឡុង"
        },
        {
            "barcode": "BBWS180200095",
            "dpc": "03013010201",
            "name": "សៀន ស៊ីនួន"
        },
        {
            "barcode": "BBWS180200096",
            "dpc": "03013010301",
            "name": "អៀន សារឿន"
        },
        {
            "barcode": "BBWS180200097",
            "dpc": "03013010401",
            "name": "សឿន សឿង"
        },
        {
            "barcode": "BBWS180200098",
            "dpc": "03013010501",
            "name": "ភឹម ឌី"
        },
        {
            "barcode": "BBWS180200099",
            "dpc": "03013010601",
            "name": "សុង សឹម"
        },
        {
            "barcode": "BBWS180200100",
            "dpc": "03013010701",
            "name": "សែម សាន្ត"
        },
        {
            "barcode": "BBWS180200101",
            "dpc": "03013010801",
            "name": "ឯក វណ្ណៈ"
        },
        {
            "barcode": "BBWS180200102",
            "dpc": "03013010901",
            "name": "ឯក ចំរើន"
        },
        {
            "barcode": "BBWS180200103",
            "dpc": "03013011001",
            "name": "ហួត ចក្រី"
        },
        {
            "barcode": "BBWS180200104",
            "dpc": "03013011101",
            "name": "ហេត រើត"
        },
        {
            "barcode": "BBWS180200105",
            "dpc": "03013011301",
            "name": "ហាស ប៊ុនហាប់"
        },
        {
            "barcode": "BBWS180200106",
            "dpc": "03013011401",
            "name": "អុំ សារិន"
        },
        {
            "barcode": "BBWS180200107",
            "dpc": "03013011501",
            "name": "ឡក់ បូរ៉េត"
        },
        {
            "barcode": "BBWS180200108",
            "dpc": "03013011601",
            "name": "ពៅ មាន"
        },
        {
            "barcode": "BBWS180200109",
            "dpc": "03013011701",
            "name": "ងួន ធូ"
        },
        {
            "barcode": "BBWS180200110",
            "dpc": "03013011801",
            "name": "ប៉ែត ហ៊ាងកាំង"
        },
        {
            "barcode": "BBWS180200111",
            "dpc": "03013012201",
            "name": "វណ្ណ ចន្លី"
        },
        {
            "barcode": "BBWS180200112",
            "dpc": "03013012401",
            "name": "ឡាន ប៊ុនរ៉ូស៊ី"
        },
        {
            "barcode": "BBWS180200113",
            "dpc": "03013012501",
            "name": "ពេជ្រ វណ្ណា ៤"
        },
        {
            "barcode": "BBWS180200114",
            "dpc": "03013012601",
            "name": "វន សម្បត្តិ"
        },
        {
            "barcode": "BBWS180200115",
            "dpc": "03013013301",
            "name": "មៀច មុន្នីរដ្ឋ"
        },
        {
            "barcode": "BBWS180200116",
            "dpc": "03013013601",
            "name": "លី ឡាយហុង"
        },
        {
            "barcode": "BBWS180200117",
            "dpc": "03013013901",
            "name": "វិទ្យាល័យនេតយ៉ង់"
        },
        {
            "barcode": "BBWS180200118",
            "dpc": "03013014001",
            "name": "សាលាធនធាន វិទ្យាល័យនេតយ៉ង់"
        },
        {
            "barcode": "BBWS180200119",
            "dpc": "03013014101",
            "name": "សាលាបឋមសិក្សា សម្តេចជាស៊ីម"
        },
        {
            "barcode": "BBWS180200120",
            "dpc": "03013014601",
            "name": "កែវ សាម៉ុន"
        },
        {
            "barcode": "BBWS180200121",
            "dpc": "03013014701",
            "name": "សែម ផង់"
        },
        {
            "barcode": "BBWS180200122",
            "dpc": "03013014901",
            "name": "ស៊ូ សុភាវី"
        },
        {
            "barcode": "BBWS180200123",
            "dpc": "03013015001",
            "name": "ហៀង ខន"
        },
        {
            "barcode": "BBWS180200124",
            "dpc": "03013015101",
            "name": "មាស ដារ៉ា"
        },
        {
            "barcode": "BBWS180200125",
            "dpc": "03013015301",
            "name": "វែង នឿត"
        },
        {
            "barcode": "BBWS180200126",
            "dpc": "03013015401",
            "name": "ផាន សារឿន"
        },
        {
            "barcode": "BBWS180200127",
            "dpc": "03013015501",
            "name": "សួរ តឿ"
        },
        {
            "barcode": "BBWS180200128",
            "dpc": "03013015601",
            "name": "សៀង ឌី"
        },
        {
            "barcode": "BBWS180200129",
            "dpc": "03013015701",
            "name": "ឡាច សុខា"
        },
        {
            "barcode": "BBWS180200130",
            "dpc": "03013015801",
            "name": "ងួន សុផល"
        },
        {
            "barcode": "BBWS180200131",
            "dpc": "03013016001",
            "name": "ឈឹម រដ្ឋា"
        },
        {
            "barcode": "BBWS180200132",
            "dpc": "03013016201",
            "name": "អ៊ាង ប៉ូច"
        },
        {
            "barcode": "BBWS180200133",
            "dpc": "03013016401",
            "name": "នន់ វណ្ណះ"
        },
        {
            "barcode": "BBWS180200134",
            "dpc": "03013016801",
            "name": "លីន គុយហេង"
        },
        {
            "barcode": "BBWS180200135",
            "dpc": "03013017001",
            "name": "ធា ងួនត្រាយ ២"
        },
        {
            "barcode": "BBWS180200136",
            "dpc": "03013017101",
            "name": "លី ហៀន"
        },
        {
            "barcode": "BBWS180200137",
            "dpc": "03013017301",
            "name": "ដាំ សីហា"
        },
        {
            "barcode": "BBWS180200138",
            "dpc": "03013017401",
            "name": "ណៃ រត្ថនី"
        },
        {
            "barcode": "BBWS180200139",
            "dpc": "03013017501",
            "name": "កៅ អ៊ាងឡាយ"
        },
        {
            "barcode": "BBWS180200140",
            "dpc": "03013017601",
            "name": "អេង សុខនេត"
        },
        {
            "barcode": "BBWS180200141",
            "dpc": "03013017701",
            "name": "សាន សម្បត្តិ"
        },
        {
            "barcode": "BBWS180200142",
            "dpc": "03013017901",
            "name": "លាង អេង"
        },
        {
            "barcode": "BBWS180200143",
            "dpc": "03013018101",
            "name": "ស៊ឹម សុភា"
        },
        {
            "barcode": "BBWS180200144",
            "dpc": "03013018301",
            "name": "ឃុន ប៊ុនុផាត"
        },
        {
            "barcode": "BBWS180200145",
            "dpc": "03013018801",
            "name": "ស៊ាន ពៅ"
        },
        {
            "barcode": "BBWS180200146",
            "dpc": "03013018901",
            "name": "ទឹម តារាខេមរិត្យ"
        },
        {
            "barcode": "BBWS180200147",
            "dpc": "03013019001",
            "name": "ឌុច សំណាង"
        },
        {
            "barcode": "BBWS180200148",
            "dpc": "03013019101",
            "name": "ឆាយ ស៊ីថា"
        },
        {
            "barcode": "BBWS180200149",
            "dpc": "03013019201",
            "name": "សេរី ពិសិដ្ឋ"
        },
        {
            "barcode": "BBWS180200150",
            "dpc": "03013019301",
            "name": "ចេង គ្រឹះស្នា"
        },
        {
            "barcode": "BBWS180200151",
            "dpc": "03013019401",
            "name": "យ៉ុង ឆៃយុត ២"
        },
        {
            "barcode": "BBWS180200152",
            "dpc": "03013019601",
            "name": "ទុយ គី"
        },
        {
            "barcode": "BBWS180200153",
            "dpc": "03013019801",
            "name": "អៀវ នី"
        },
        {
            "barcode": "BBWS180200154",
            "dpc": "03013019901",
            "name": "ឆេង សោភណ័"
        },
        {
            "barcode": "BBWS180200155",
            "dpc": "03013020001",
            "name": "ព្រាប ចិន្តា"
        },
        {
            "barcode": "BBWS180200156",
            "dpc": "03013020101",
            "name": "គីវ គឹមផា"
        },
        {
            "barcode": "BBWS180200157",
            "dpc": "03013020601",
            "name": "ឈឹន សុគន្ធា"
        },
        {
            "barcode": "BBWS180200158",
            "dpc": "03013020701",
            "name": "ទេស ស៊ីន"
        },
        {
            "barcode": "BBWS180200159",
            "dpc": "03013020801",
            "name": "ឡេង ងី"
        },
        {
            "barcode": "BBWS180200160",
            "dpc": "03013020901",
            "name": "សាយ រស់"
        },
        {
            "barcode": "BBWS180200161",
            "dpc": "03013021001",
            "name": "សៀន ឈួក"
        },
        {
            "barcode": "BBWS180200162",
            "dpc": "03013021101",
            "name": "កុត ជួ"
        },
        {
            "barcode": "BBWS180200163",
            "dpc": "03013021201",
            "name": "យោម ណារិន"
        },
        {
            "barcode": "BBWS180200164",
            "dpc": "03013021301",
            "name": "លឹម ភីន"
        },
        {
            "barcode": "BBWS180200165",
            "dpc": "03013021401",
            "name": "ទូច សុឃឿត"
        },
        {
            "barcode": "BBWS180200166",
            "dpc": "03013021501",
            "name": "ភាច វែង"
        },
        {
            "barcode": "BBWS180200167",
            "dpc": "03013021601",
            "name": "បូ ធា"
        },
        {
            "barcode": "BBWS180200168",
            "dpc": "03013021701",
            "name": "ញឹម ជេដ្ឋា"
        },
        {
            "barcode": "BBWS180200169",
            "dpc": "03013021801",
            "name": "អ៊ាន សារ៉ែន"
        },
        {
            "barcode": "BBWS180200170",
            "dpc": "03013021901",
            "name": "ចាប លន់"
        },
        {
            "barcode": "BBWS180200171",
            "dpc": "03013022001",
            "name": "មាឃ សាមិត្ត"
        },
        {
            "barcode": "BBWS180200172",
            "dpc": "03013022101",
            "name": "យ៉ាន់ យូន"
        },
        {
            "barcode": "BBWS180200173",
            "dpc": "03013022201",
            "name": "ប៊ុត ម៉ាឡា"
        },
        {
            "barcode": "BBWS180200174",
            "dpc": "03013022301",
            "name": "ស៊ុយ ឈួប"
        },
        {
            "barcode": "BBWS180200175",
            "dpc": "03013022401",
            "name": "ឃឹម លំទោន"
        },
        {
            "barcode": "BBWS180200176",
            "dpc": "03013022501",
            "name": "ធុច សំណាង"
        },
        {
            "barcode": "BBWS180200177",
            "dpc": "03013022701",
            "name": "កាន សុខខួច"
        },
        {
            "barcode": "BBWS180200178",
            "dpc": "03013022801",
            "name": "ប៉ិន ហេងផល្លា"
        },
        {
            "barcode": "BBWS180200179",
            "dpc": "03013022901",
            "name": "ម៉េត សុបញ្ញា"
        },
        {
            "barcode": "BBWS180200180",
            "dpc": "03013023001",
            "name": "ម៉ៅ ហៀក"
        },
        {
            "barcode": "BBWS180200181",
            "dpc": "03013023101",
            "name": "សួស ម៉ន"
        },
        {
            "barcode": "BBWS180200182",
            "dpc": "03013023201",
            "name": "ពក វណ្ណា"
        },
        {
            "barcode": "BBWS180200183",
            "dpc": "03013023301",
            "name": "ជឹម អាត"
        },
        {
            "barcode": "BBWS180200184",
            "dpc": "03013023401",
            "name": "យក់ គា"
        },
        {
            "barcode": "BBWS180200185",
            "dpc": "03013023501",
            "name": "សោម ពៅ"
        },
        {
            "barcode": "BBWS180200186",
            "dpc": "03013023601",
            "name": "ប្រឹម យឿត"
        },
        {
            "barcode": "BBWS180200187",
            "dpc": "03013023901",
            "name": "ម៉ៅ សុភាព"
        },
        {
            "barcode": "BBWS180200188",
            "dpc": "03013024001",
            "name": "សារឿន សំអាត"
        },
        {
            "barcode": "BBWS180200189",
            "dpc": "03013024101",
            "name": "អឿង ខេង"
        },
        {
            "barcode": "BBWS180200190",
            "dpc": "03013024201",
            "name": "លី លឿត"
        },
        {
            "barcode": "BBWS180200191",
            "dpc": "03013024301",
            "name": "កែប ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180200192",
            "dpc": "03013024801",
            "name": "ជិន ចន្ថា"
        },
        {
            "barcode": "BBWS180200193",
            "dpc": "03013025001",
            "name": "ង៉ា ដៀប"
        },
        {
            "barcode": "BBWS180200194",
            "dpc": "03013025101",
            "name": "អឿម អេម"
        },
        {
            "barcode": "BBWS180200195",
            "dpc": "03013025201",
            "name": "ដឿន អ៊ុច"
        },
        {
            "barcode": "BBWS180200196",
            "dpc": "03013025301",
            "name": "កន រ៉ា"
        },
        {
            "barcode": "BBWS180200197",
            "dpc": "03013025401",
            "name": "ឆាន ថេត"
        },
        {
            "barcode": "BBWS180200198",
            "dpc": "03013025501",
            "name": "ហុង ហ៊ួម"
        },
        {
            "barcode": "BBWS180200199",
            "dpc": "03013025701",
            "name": "ពៅ ចន្ទ័សីលា"
        },
        {
            "barcode": "BBWS180200200",
            "dpc": "03013025801",
            "name": "ឡុង អ៊ីដារ៉ូ"
        },
        {
            "barcode": "BBWS180200201",
            "dpc": "03013025901",
            "name": "ថាច ស្រីពៅ"
        },
        {
            "barcode": "BBWS180200202",
            "dpc": "03013026001",
            "name": "ណុប ណារ៉ា"
        },
        {
            "barcode": "BBWS180200203",
            "dpc": "03013026101",
            "name": "សុខ ណាំ"
        },
        {
            "barcode": "BBWS180200204",
            "dpc": "03013026301",
            "name": "ប៊ុត សាវង្ស"
        },
        {
            "barcode": "BBWS180200205",
            "dpc": "03013026401",
            "name": "ស៊ាង ចាន់ធាម"
        },
        {
            "barcode": "BBWS180200206",
            "dpc": "03013026501",
            "name": "អូច ញឹម"
        },
        {
            "barcode": "BBWS180200207",
            "dpc": "03013026601",
            "name": "មុំ ស៊ុមនា"
        },
        {
            "barcode": "BBWS180200208",
            "dpc": "03013026701",
            "name": "មាន់ ពីវន"
        },
        {
            "barcode": "BBWS180200209",
            "dpc": "03013026801",
            "name": "ហែម ថាលីកា"
        },
        {
            "barcode": "BBWS180200210",
            "dpc": "03013026901",
            "name": "អួន ហ៊ុល"
        },
        {
            "barcode": "BBWS180200211",
            "dpc": "03013027001",
            "name": "សៀង វ៉ាន់"
        },
        {
            "barcode": "BBWS180200212",
            "dpc": "03013027101",
            "name": "តាំង សៀកគង់"
        },
        {
            "barcode": "BBWS180200213",
            "dpc": "03013027201",
            "name": "ឌុច រ៉ាមី"
        },
        {
            "barcode": "BBWS180200214",
            "dpc": "03013027301",
            "name": "យស ឈុនលី"
        },
        {
            "barcode": "BBWS180200215",
            "dpc": "03013027401",
            "name": "ជឿន សុភា"
        },
        {
            "barcode": "BBWS180200216",
            "dpc": "03013027501",
            "name": "ហុង សុវណ្ណ"
        },
        {
            "barcode": "BBWS180200217",
            "dpc": "03013027701",
            "name": "សៅ សាលឿន"
        },
        {
            "barcode": "BBWS180200218",
            "dpc": "03013027801",
            "name": "អ៊ូច ស៊ីវត្ថា"
        },
        {
            "barcode": "BBWS180200219",
            "dpc": "03013027901",
            "name": "ម៉ម ណាត"
        },
        {
            "barcode": "BBWS180200220",
            "dpc": "03013028001",
            "name": "តាំង ប៉េងអាន"
        },
        {
            "barcode": "BBWS180200221",
            "dpc": "03013028101",
            "name": "ឃួន ឈឿត ៤"
        },
        {
            "barcode": "BBWS180200222",
            "dpc": "03013028201",
            "name": "ហុក វីរៈ"
        },
        {
            "barcode": "BBWS180200223",
            "dpc": "03013028301",
            "name": "វ៉ាន់ សុភ័ណ"
        },
        {
            "barcode": "BBWS180200224",
            "dpc": "03013028401",
            "name": "មាស ឆេង"
        },
        {
            "barcode": "BBWS180200225",
            "dpc": "03013028801",
            "name": "ឡៅ ហ៊នី"
        },
        {
            "barcode": "BBWS180200226",
            "dpc": "03013029101",
            "name": "ហ៊ី បូរិទ្ធ"
        },
        {
            "barcode": "BBWS180200227",
            "dpc": "03013029201",
            "name": "អ៊ឹង ជីណាំ"
        },
        {
            "barcode": "BBWS180200228",
            "dpc": "03013029301",
            "name": "ឆាត់ ចាន់ឌី"
        },
        {
            "barcode": "BBWS180200229",
            "dpc": "03013029601",
            "name": "ឈន ទីន"
        },
        {
            "barcode": "BBWS180200230",
            "dpc": "03013029801",
            "name": "កែវ រ៉ា"
        },
        {
            "barcode": "BBWS180200231",
            "dpc": "03013029901",
            "name": "ធឿន សាវេត"
        },
        {
            "barcode": "BBWS180200232",
            "dpc": "03013030001",
            "name": "ណាត វណ្ណដូ"
        },
        {
            "barcode": "BBWS180200233",
            "dpc": "03013030101",
            "name": "អឿង លាង"
        },
        {
            "barcode": "BBWS180200234",
            "dpc": "03013030201",
            "name": "កែវ ណាវី"
        },
        {
            "barcode": "BBWS180200235",
            "dpc": "03013030301",
            "name": "រ៉ុម រី"
        },
        {
            "barcode": "BBWS180200236",
            "dpc": "03013030501",
            "name": "ប៉ាល់ សុវណ្ណារិទ្ធ"
        },
        {
            "barcode": "BBWS180200237",
            "dpc": "03013030601",
            "name": "ស៊ុំ សុវត្ថាយ"
        },
        {
            "barcode": "BBWS180200238",
            "dpc": "03013030701",
            "name": "កីម ញ៉"
        },
        {
            "barcode": "BBWS180200239",
            "dpc": "03013030801",
            "name": "ពេជ្រ សុខា"
        },
        {
            "barcode": "BBWS180200240",
            "dpc": "03013030901",
            "name": "ជិន សឹងហុន"
        },
        {
            "barcode": "BBWS180200241",
            "dpc": "03013031001",
            "name": "ឡែន ចិត្ត្រា"
        },
        {
            "barcode": "BBWS180200242",
            "dpc": "03013031101",
            "name": "ម៉ៅ មុនី"
        },
        {
            "barcode": "BBWS180200243",
            "dpc": "03013031201",
            "name": "ប៉ែន សាវឿន"
        },
        {
            "barcode": "BBWS180200244",
            "dpc": "03013031301",
            "name": "ឈិន សុភៈ"
        },
        {
            "barcode": "BBWS180200245",
            "dpc": "03013031501",
            "name": "យូ ម៉ុងហូត"
        },
        {
            "barcode": "BBWS180200246",
            "dpc": "03013031601",
            "name": "កែវ សាវ័ន្ត"
        },
        {
            "barcode": "BBWS180200247",
            "dpc": "03013031701",
            "name": "អ៊ូ សារឿន"
        },
        {
            "barcode": "BBWS180200248",
            "dpc": "03013031801",
            "name": "សឹង ម៉ារិទ្ធ ២"
        },
        {
            "barcode": "BBWS180200249",
            "dpc": "03013031901",
            "name": "ណៃ ប៉ុនរិទ្ធ"
        },
        {
            "barcode": "BBWS180200250",
            "dpc": "03013032001",
            "name": "ព្រំ ស្រីមុំ"
        },
        {
            "barcode": "BBWS180200251",
            "dpc": "03013032101",
            "name": "ទន ចាន់ទី"
        },
        {
            "barcode": "BBWS180200252",
            "dpc": "03013032201",
            "name": "យ៉ូន រដ្ឋា"
        },
        {
            "barcode": "BBWS180200253",
            "dpc": "03013032401",
            "name": "សាយ ប៊ុនលី"
        },
        {
            "barcode": "BBWS180200254",
            "dpc": "03013032501",
            "name": "ហ៊ីង ស៊ាត"
        },
        {
            "barcode": "BBWS180200255",
            "dpc": "03013032601",
            "name": "ឡាច ចន្ថា"
        },
        {
            "barcode": "BBWS180200256",
            "dpc": "03013032701",
            "name": "ឌិម ចន្ថា"
        },
        {
            "barcode": "BBWS180200257",
            "dpc": "03013032801",
            "name": "ជូប ត្រា"
        },
        {
            "barcode": "BBWS180200258",
            "dpc": "03013032901",
            "name": "គឹម សារ៉ន"
        },
        {
            "barcode": "BBWS180200259",
            "dpc": "03013033001",
            "name": "ម៉ា មន្ថា"
        },
        {
            "barcode": "BBWS180200260",
            "dpc": "03013033101",
            "name": "សួន ជា"
        },
        {
            "barcode": "BBWS180200261",
            "dpc": "03013033201",
            "name": "យីវ គឹមស៊ាន"
        },
        {
            "barcode": "BBWS180200262",
            "dpc": "03013033301",
            "name": "មាន ឡាយ"
        },
        {
            "barcode": "BBWS180200263",
            "dpc": "03013033401",
            "name": "មាស វោន"
        },
        {
            "barcode": "BBWS180200264",
            "dpc": "03013033501",
            "name": "ទី គឹមហង្ស"
        },
        {
            "barcode": "BBWS180200265",
            "dpc": "03013033601",
            "name": "ទិញ ហៀង"
        },
        {
            "barcode": "BBWS180200266",
            "dpc": "03013033701",
            "name": "សយ សេរី"
        },
        {
            "barcode": "BBWS180200267",
            "dpc": "03013033801",
            "name": "ជឿម រដ្ឋា"
        },
        {
            "barcode": "BBWS180200268",
            "dpc": "03013033901",
            "name": "ល័ក្ខ ផល្លីន"
        },
        {
            "barcode": "BBWS180200269",
            "dpc": "03013034001",
            "name": "ព្រំ ដារ៉ា"
        },
        {
            "barcode": "BBWS180200270",
            "dpc": "03013034101",
            "name": "រ៉ុង យ៉ាង"
        },
        {
            "barcode": "BBWS180200271",
            "dpc": "03013034201",
            "name": "មាន ដូន"
        },
        {
            "barcode": "BBWS180200272",
            "dpc": "03013034401",
            "name": "ឡាំ ញឹក"
        },
        {
            "barcode": "BBWS180200273",
            "dpc": "03013034501",
            "name": "ជា សៅឌី"
        },
        {
            "barcode": "BBWS180200274",
            "dpc": "03013034601",
            "name": "ងឹន សារិន"
        },
        {
            "barcode": "BBWS180200275",
            "dpc": "03013034701",
            "name": "ពៅ វិត"
        },
        {
            "barcode": "BBWS180200276",
            "dpc": "03013034901",
            "name": "សុខ សុវណ្ណ"
        },
        {
            "barcode": "BBWS180200277",
            "dpc": "03013035001",
            "name": "លី សុផាត"
        },
        {
            "barcode": "BBWS180200278",
            "dpc": "03013035101",
            "name": "ទឹម ភិរុណ"
        },
        {
            "barcode": "BBWS180200279",
            "dpc": "03013035201",
            "name": "ព្រំ សាឃឿន"
        },
        {
            "barcode": "BBWS180200280",
            "dpc": "03013035301",
            "name": "ម៉ក់ សឿន"
        },
        {
            "barcode": "BBWS180200281",
            "dpc": "03013035401",
            "name": "ជា សាមាន"
        },
        {
            "barcode": "BBWS180200282",
            "dpc": "03013035501",
            "name": "សេង នឿត"
        },
        {
            "barcode": "BBWS180200283",
            "dpc": "03013035601",
            "name": "ស៊ីន ឃីម"
        },
        {
            "barcode": "BBWS180200284",
            "dpc": "03013035701",
            "name": "ជួន សុខខួច"
        },
        {
            "barcode": "BBWS180200285",
            "dpc": "03013035801",
            "name": "អ៊ូច វណ្ណៈ"
        },
        {
            "barcode": "BBWS180200286",
            "dpc": "03013035901",
            "name": "សៅ សារិន"
        },
        {
            "barcode": "BBWS180200287",
            "dpc": "03013036001",
            "name": "ស សារិន"
        },
        {
            "barcode": "BBWS180200288",
            "dpc": "03013036101",
            "name": "យ៉ាត យៀង"
        },
        {
            "barcode": "BBWS180200289",
            "dpc": "03013036201",
            "name": "សៀង ហេង"
        },
        {
            "barcode": "BBWS180200290",
            "dpc": "03013036301",
            "name": "ចាន់ ផូ"
        },
        {
            "barcode": "BBWS180200291",
            "dpc": "03013036401",
            "name": "ហ៊ី គា"
        },
        {
            "barcode": "BBWS180200292",
            "dpc": "03013036601",
            "name": "ចៅ ភឿត"
        },
        {
            "barcode": "BBWS180200293",
            "dpc": "03013036701",
            "name": "អ៊ឹង ម៉េងសេង"
        },
        {
            "barcode": "BBWS180200294",
            "dpc": "03013036801",
            "name": "ជា បូរី"
        },
        {
            "barcode": "BBWS180200295",
            "dpc": "03013036901",
            "name": "សុខ សុខុន"
        },
        {
            "barcode": "BBWS180200296",
            "dpc": "03013037001",
            "name": "នង បំណង"
        },
        {
            "barcode": "BBWS180200297",
            "dpc": "03013037101",
            "name": "ស៊ុំ មុំ"
        },
        {
            "barcode": "BBWS180200298",
            "dpc": "03013037201",
            "name": "យូ ចាន់ធារី"
        },
        {
            "barcode": "BBWS180200299",
            "dpc": "03013037301",
            "name": "ទិត្យ សោភ័ណ្ឌ"
        },
        {
            "barcode": "BBWS180200300",
            "dpc": "03013037401",
            "name": "ហួត ផានិត"
        },
        {
            "barcode": "BBWS180200301",
            "dpc": "03013037501",
            "name": "ម៉េង ប្រាកដ"
        },
        {
            "barcode": "BBWS180200302",
            "dpc": "03013037601",
            "name": "ឡម គឹមយូ"
        },
        {
            "barcode": "BBWS180200303",
            "dpc": "03013037701",
            "name": "ប៊ុន ឡេកូ"
        },
        {
            "barcode": "BBWS180200304",
            "dpc": "03013037801",
            "name": "ផុន ផាវុធ៣"
        },
        {
            "barcode": "BBWS180200305",
            "dpc": "03013037901",
            "name": "សៅ ម៉េងសែ"
        },
        {
            "barcode": "BBWS180200306",
            "dpc": "03013038001",
            "name": "សៅ ម៉េងសែ២"
        },
        {
            "barcode": "BBWS180200307",
            "dpc": "03013038101",
            "name": "ដួង ណាគ្រី"
        },
        {
            "barcode": "BBWS180200308",
            "dpc": "03013038201",
            "name": "វ៉ាន់ គឹមហុង"
        },
        {
            "barcode": "BBWS180200309",
            "dpc": "03013038401",
            "name": "ជោត សំណាង"
        },
        {
            "barcode": "BBWS180200310",
            "dpc": "03013038501",
            "name": "ជោត ដារ៉ា"
        },
        {
            "barcode": "BBWS180200311",
            "dpc": "03013038601",
            "name": "សាំង សារ៉េត"
        },
        {
            "barcode": "BBWS180200312",
            "dpc": "03013038701",
            "name": "ឃឹម ពិសី"
        },
        {
            "barcode": "BBWS180200313",
            "dpc": "03013038801",
            "name": "ឈិន វុទ្ឋី"
        },
        {
            "barcode": "BBWS180200314",
            "dpc": "03013038901",
            "name": "អ៊ុំ សារ៉េត"
        },
        {
            "barcode": "BBWS180200315",
            "dpc": "03013039001",
            "name": "សឺន ប៊ុនផាត"
        },
        {
            "barcode": "BBWS180200316",
            "dpc": "03013039101",
            "name": "ឈិត បុទុម"
        },
        {
            "barcode": "BBWS180200317",
            "dpc": "03013039301",
            "name": "លើម ពោដេត"
        },
        {
            "barcode": "BBWS180200318",
            "dpc": "03013039401",
            "name": "គង់ ប៊ន"
        },
        {
            "barcode": "BBWS180200319",
            "dpc": "03013039501",
            "name": "ចាន់ វ៉ាន់ថេន"
        },
        {
            "barcode": "BBWS180200320",
            "dpc": "03013031401",
            "name": "សេង ជ័យវុទ្ធី"
        },
        {
            "barcode": "BBWS180200321",
            "dpc": "03013007901",
            "name": "ប៊ុន គឹមតេង"
        },
        {
            "barcode": "BBWS180200322",
            "dpc": "03013016301",
            "name": "អ៊ុន លាភ"
        },
        {
            "barcode": "BBWS180200323",
            "dpc": "03013032301",
            "name": "ចៅ ធឿន"
        },
        {
            "barcode": "BBWS180200324",
            "dpc": "03013023801",
            "name": "តោ ចាន់សីលា"
        },
        {
            "barcode": "BBWS180200325",
            "dpc": "03013003701",
            "name": "គន្ធ គឹមលាភ"
        },
        {
            "barcode": "BBWS180200326",
            "dpc": "03013008001",
            "name": "រៀម សារ៉េត"
        },
        {
            "barcode": "BBWS180200327",
            "dpc": "03013024901",
            "name": "អ៊ី ធី"
        },
        {
            "barcode": "BBWS180200328",
            "dpc": "03013002601",
            "name": "ណុប សម្បត្តិ"
        },
        {
            "barcode": "BBWS180200329",
            "dpc": "03013002501",
            "name": "ស្រេង ស៊ីនួន ២"
        },
        {
            "barcode": "BBWS180200330",
            "dpc": "03013000101",
            "name": "អ៊ន ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180200331",
            "dpc": "03013005001",
            "name": "សុខ វណ្ណី"
        },
        {
            "barcode": "BBWS180200332",
            "dpc": "03013015901",
            "name": "សោម ធី"
        },
        {
            "barcode": "BBWS180200333",
            "dpc": "03013013501",
            "name": "ជិម មុនី"
        },
        {
            "barcode": "BBWS180200334",
            "dpc": "03013010001",
            "name": "គុម សុខុម"
        },
        {
            "barcode": "BBWS180200335",
            "dpc": "03013007701",
            "name": "ញ៉ែម ប៉ក់"
        },
        {
            "barcode": "BBWS180200336",
            "dpc": "03013004701",
            "name": "សេង វិស័ក្ត"
        },
        {
            "barcode": "BBWS180200337",
            "dpc": "03013009501",
            "name": "គុណ ឆាយ"
        },
        {
            "barcode": "BBWS180200338",
            "dpc": "03013014401",
            "name": "បាន រដ្ឋ"
        },
        {
            "barcode": "BBWS180200339",
            "dpc": "03013014501",
            "name": "ព្រហ្ម សំណាង"
        },
        {
            "barcode": "BBWS180200340",
            "dpc": "03013004601",
            "name": "សល់ សុរ័ត្ត"
        },
        {
            "barcode": "BBWS180200341",
            "dpc": "03013014301",
            "name": "ឃុន សាមិត្ត"
        },
        {
            "barcode": "BBWS180200342",
            "dpc": "03013008501",
            "name": "ទេព ធិញ"
        },
        {
            "barcode": "BBWS180200343",
            "dpc": "03013008601",
            "name": "ងួន កិត្យា"
        },
        {
            "barcode": "BBWS180200344",
            "dpc": "03013022601",
            "name": "ភួង អេង"
        },
        {
            "barcode": "BBWS180200345",
            "dpc": "03013002901",
            "name": "លី ហ៊ាង"
        },
        {
            "barcode": "BBWS180200346",
            "dpc": "03013003001",
            "name": "ជាង សាវ៉េន"
        },
        {
            "barcode": "BBWS180200347",
            "dpc": "03013008301",
            "name": "ឈឹម សុភា"
        },
        {
            "barcode": "BBWS180200348",
            "dpc": "03013002801",
            "name": "ចៅ ញ៉ា"
        },
        {
            "barcode": "BBWS180200349",
            "dpc": "03013018501",
            "name": "ហ៊ាញ ហ៊ួរ"
        },
        {
            "barcode": "BBWS180200350",
            "dpc": "03013018601",
            "name": "យ៉ាន សុភា"
        },
        {
            "barcode": "BBWS180200351",
            "dpc": "03013018701",
            "name": "ឆាយ សេរី ២"
        },
        {
            "barcode": "BBWS180200352",
            "dpc": "03013003201",
            "name": "អ៊ិត អាន"
        },
        {
            "barcode": "BBWS180200353",
            "dpc": "03013003401",
            "name": "លី ណូ ២"
        },
        {
            "barcode": "BBWS180200354",
            "dpc": "03013002701",
            "name": "អ៊ាន សារឿត"
        },
        {
            "barcode": "BBWS180200355",
            "dpc": "03013001501",
            "name": "ចាន់ សឺត"
        },
        {
            "barcode": "BBWS180200356",
            "dpc": "03013039601",
            "name": "ដែង សាធិត"
        },
        {
            "barcode": "BBWS180200357",
            "dpc": "03013039701",
            "name": "គង់ ចន្ថា"
        },
        {
            "barcode": "BBWS180200358",
            "dpc": "03013039801",
            "name": "កង ផល្លា"
        },
        {
            "barcode": "BBWS180200359",
            "dpc": "03013039901",
            "name": "សឹង សុវណ្ណ"
        },
        {
            "barcode": "BBWS180200360",
            "dpc": "03013040001",
            "name": "ញៀវ សាអង"
        },
        {
            "barcode": "BBWS180200361",
            "dpc": "03013040101",
            "name": "រឿម សុផល"
        },
        {
            "barcode": "BBWS180200362",
            "dpc": "03013040201",
            "name": "ផល សុភាព"
        },
        {
            "barcode": "BBWS180200363",
            "dpc": "03013040301",
            "name": "ទេព ឈឿន"
        },
        {
            "barcode": "BBWS180200364",
            "dpc": "03013040401",
            "name": "ខេ ភី"
        },
        {
            "barcode": "BBWS180200365",
            "dpc": "03013040501",
            "name": "ចាន់ ដារ៉ា"
        },
        {
            "barcode": "BBWS180200366",
            "dpc": "03013040601",
            "name": "លី ឈុំ"
        },
        {
            "barcode": "BBWS180200367",
            "dpc": "03013040701",
            "name": "ជា ហឿន"
        },
        {
            "barcode": "BBWS180200368",
            "dpc": "03013040801",
            "name": "ឈិន ហ៊ន"
        },
        {
            "barcode": "BBWS180200369",
            "dpc": "03013040901",
            "name": "ដួង ជីវ៊ន្ត"
        },
        {
            "barcode": "BBWS180200370",
            "dpc": "03013041001",
            "name": "ប៉ន ឈៀង"
        },
        {
            "barcode": "BBWS180200371",
            "dpc": "03013041101",
            "name": "យួម សានី"
        },
        {
            "barcode": "BBWS180200372",
            "dpc": "03013041201",
            "name": "អង្គការខ្មែរជំនាន់ថ្មី"
        },
        {
            "barcode": "BBWS180200373",
            "dpc": "03013041301",
            "name": "ឈឿម ណារិទ្ឋ"
        },
        {
            "barcode": "BBWS180200374",
            "dpc": "03013041401",
            "name": "ទស់ ធឿត"
        },
        {
            "barcode": "BBWS180200375",
            "dpc": "03013041501",
            "name": "អែម សុឃឿន"
        },
        {
            "barcode": "BBWS180200376",
            "dpc": "03013041601",
            "name": "ហឿន បុផ្ផា"
        },
        {
            "barcode": "BBWS180200377",
            "dpc": "03013041701",
            "name": "ហេង ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180200378",
            "dpc": "03013041801",
            "name": "ទាម ម៉េងហុក"
        },
        {
            "barcode": "BBWS180200379",
            "dpc": "03013041901",
            "name": "លន់ វិទូ"
        },
        {
            "barcode": "BBWS180200380",
            "dpc": "03013042001",
            "name": "ឆេង ឃេង"
        },
        {
            "barcode": "BBWS180200381",
            "dpc": "03013042101",
            "name": "ឃេ សុធឿន"
        },
        {
            "barcode": "BBWS180200382",
            "dpc": "03013042201",
            "name": "ឡេង ទូច"
        },
        {
            "barcode": "BBWS180200383",
            "dpc": "03013042301",
            "name": "ខៀវ វ៉ាន់ស៊ី"
        },
        {
            "barcode": "BBWS180200384",
            "dpc": "03013042401",
            "name": "ឈួន សុវណ្ណារី"
        },
        {
            "barcode": "BBWS180200385",
            "dpc": "03013042501",
            "name": "ម៉ិល សាវ៉ុន"
        },
        {
            "barcode": "BBWS180200386",
            "dpc": "03013042601",
            "name": "ហូន លន់សីហា"
        },
        {
            "barcode": "BBWS180200387",
            "dpc": "03013042701",
            "name": "ថន ស្រីរ៊ត្ន"
        },
        {
            "barcode": "BBWS180200388",
            "dpc": "03013042801",
            "name": "អ៊ូច សំអាង"
        },
        {
            "barcode": "BBWS180200389",
            "dpc": "03013042901",
            "name": "ស្វាយ រតនា"
        },
        {
            "barcode": "BBWS180200390",
            "dpc": "03013043001",
            "name": "ផាត់ ម៉ា"
        },
        {
            "barcode": "BBWS180200391",
            "dpc": "03013043101",
            "name": "ឡុង សុខា"
        },
        {
            "barcode": "BBWS180200392",
            "dpc": "03013043201",
            "name": "ឡាំង ជន"
        },
        {
            "barcode": "BBWS180200393",
            "dpc": "03013043301",
            "name": "គឹម ឡាង"
        },
        {
            "barcode": "BBWS180200394",
            "dpc": "03013043401",
            "name": "មឿន ឈុន"
        },
        {
            "barcode": "BBWS180200395",
            "dpc": "03013043501",
            "name": "រួម ចេង"
        },
        {
            "barcode": "BBWS180200396",
            "dpc": "03013043601",
            "name": "យឿន ពៅ"
        },
        {
            "barcode": "BBWS180200397",
            "dpc": "03013043701",
            "name": "ឈៀង សាវុធ"
        },
        {
            "barcode": "BBWS180200398",
            "dpc": "03013043801",
            "name": "ម៉ី លី"
        },
        {
            "barcode": "BBWS180200399",
            "dpc": "03013043901",
            "name": "ញឹក ឈុនហាង"
        },
        {
            "barcode": "BBWS180200400",
            "dpc": "03013044001",
            "name": "ហ៊ាង អូន"
        },
        {
            "barcode": "BBWS180200401",
            "dpc": "03013044101",
            "name": "មឿន សុគន្ឋា"
        },
        {
            "barcode": "BBWS180200402",
            "dpc": "03013044201",
            "name": "ឈិត សាលឿន"
        },
        {
            "barcode": "BBWS180200403",
            "dpc": "03013044301",
            "name": "ឈិត ពៅ"
        },
        {
            "barcode": "BBWS180200404",
            "dpc": "03013044401",
            "name": "មឿន ថេត"
        },
        {
            "barcode": "BBWS180200405",
            "dpc": "03013044501",
            "name": "ឃុំ សុភី"
        },
        {
            "barcode": "BBWS180200406",
            "dpc": "03013044601",
            "name": "ឃុំ សោភ៊ណ្ឌ"
        },
        {
            "barcode": "BBWS180200407",
            "dpc": "03013044701",
            "name": "ឡុង គឹមសាន្ត"
        },
        {
            "barcode": "BBWS180200408",
            "dpc": "03013044801",
            "name": "ឃុំ អ៊ុល"
        },
        {
            "barcode": "BBWS180200409",
            "dpc": "03013044901",
            "name": "វាត សារី"
        },
        {
            "barcode": "BBWS180200410",
            "dpc": "03013045001",
            "name": "លី ជុំនឿន"
        },
        {
            "barcode": "BBWS180200411",
            "dpc": "03013045101",
            "name": "ធូក ធិរិទ្ឋ"
        },
        {
            "barcode": "BBWS180200412",
            "dpc": "03013045301",
            "name": "ជួន ស្រីមុំ"
        },
        {
            "barcode": "BBWS180200413",
            "dpc": "03013045401",
            "name": "ឡាច ភីរម្យ"
        },
        {
            "barcode": "BBWS180200414",
            "dpc": "03013045501",
            "name": "ឡាច មុន្នី"
        },
        {
            "barcode": "BBWS180200415",
            "dpc": "03013045601",
            "name": "ខ្វៃ សំបូរ"
        },
        {
            "barcode": "BBWS180200416",
            "dpc": "03013045701",
            "name": "ទូច ចាន់រ៉េត"
        },
        {
            "barcode": "BBWS180200417",
            "dpc": "03013045801",
            "name": "ទេព មិន"
        },
        {
            "barcode": "BBWS180200418",
            "dpc": "03013046001",
            "name": "គឹម ជាវី"
        },
        {
            "barcode": "BBWS180200419",
            "dpc": "03013046101",
            "name": "សរ យឿង"
        },
        {
            "barcode": "BBWS180200420",
            "dpc": "03013046301",
            "name": "សុខ សេរី"
        },
        {
            "barcode": "BBWS180200421",
            "dpc": "03013046401",
            "name": "ពិន ធានា"
        },
        {
            "barcode": "BBWS180200422",
            "dpc": "03013046501",
            "name": "សុទ្ឋ សុធា"
        },
        {
            "barcode": "BBWS180200423",
            "dpc": "03013046601",
            "name": "ស៊ុម ចន្ថា"
        },
        {
            "barcode": "BBWS180200424",
            "dpc": "03013046701",
            "name": "ម៉ី សាអ៊ឹម"
        },
        {
            "barcode": "BBWS180200425",
            "dpc": "03013046801",
            "name": "ស្រេង គីនា"
        },
        {
            "barcode": "BBWS180200426",
            "dpc": "03013046901",
            "name": "សុវណ្ណ ដារ៉ា"
        },
        {
            "barcode": "BBWS180200427",
            "dpc": "03013047001",
            "name": "ស្រី ឃីវសុខុម"
        },
        {
            "barcode": "BBWS180200428",
            "dpc": "03013047101",
            "name": "រស់ ចាន់រ៉ា"
        },
        {
            "barcode": "BBWS180200429",
            "dpc": "03013047201",
            "name": "អ៊ាប ម៉ារ៉ាឌី"
        },
        {
            "barcode": "BBWS180200430",
            "dpc": "03013047301",
            "name": "យឿង យិន"
        },
        {
            "barcode": "BBWS180200431",
            "dpc": "03013047401",
            "name": "លឿត ម៉ៅ"
        },
        {
            "barcode": "BBWS180200432",
            "dpc": "03013047501",
            "name": "ព្រិល ឆោម"
        },
        {
            "barcode": "BBWS180200433",
            "dpc": "03013047601",
            "name": "មុត សំអឿន"
        },
        {
            "barcode": "BBWS180200434",
            "dpc": "03013047701",
            "name": "ង៉ែត ឈឿត"
        },
        {
            "barcode": "BBWS180200435",
            "dpc": "03013047801",
            "name": "និត សុភាព"
        },
        {
            "barcode": "BBWS180200436",
            "dpc": "03013047901",
            "name": "ឆន ស៊ីថា"
        },
        {
            "barcode": "BBWS180200437",
            "dpc": "03013048001",
            "name": "គឹម សាន្ត"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
