let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=
    [
        {
            "barcode": "BBWS180201233",
            "dpc": "03013103101",
            "name": "ឆម  ធឿន"
        },
        {
            "barcode": "BBWS180201234",
            "dpc": "03013110401",
            "name": "សែម  ឃន"
        },
        {
            "barcode": "BBWS180201235",
            "dpc": "03013111801",
            "name": "ញ៉  លីម៉ា"
        },
        {
            "barcode": "BBWS180201236",
            "dpc": "03013136501",
            "name": "ដែង សុវណ្ណរ៉ា"
        },
        {
            "barcode": "BBWS180201237",
            "dpc": "03013136201",
            "name": "ហួត  កប"
        },
        {
            "barcode": "BBWS180201238",
            "dpc": "03013100101",
            "name": "ឈន   ណាវី"
        },
        {
            "barcode": "BBWS180201239",
            "dpc": "03013100201",
            "name": "អ៊ុក  សុធា"
        },
        {
            "barcode": "BBWS180201240",
            "dpc": "03013100301",
            "name": "មុត  សាវន្ត័"
        },
        {
            "barcode": "BBWS180201241",
            "dpc": "03013100401",
            "name": "យស  យឿន"
        },
        {
            "barcode": "BBWS180201242",
            "dpc": "03013100501",
            "name": "ញ៉េម  ស្រូង"
        },
        {
            "barcode": "BBWS180201243",
            "dpc": "03013100601",
            "name": "អ៊ូ  សាវ័ន្ត"
        },
        {
            "barcode": "BBWS180201244",
            "dpc": "03013100701",
            "name": "សឹង  សុផាត"
        },
        {
            "barcode": "BBWS180201245",
            "dpc": "03013100801",
            "name": "តេន  ឡេន"
        },
        {
            "barcode": "BBWS180201246",
            "dpc": "03013100901",
            "name": "ធូ  មុន្នីរិទ្ធិ"
        },
        {
            "barcode": "BBWS180201247",
            "dpc": "03013101001",
            "name": "កែវ   តាំង"
        },
        {
            "barcode": "BBWS180201248",
            "dpc": "03013101101",
            "name": "ស  ស៊ីម"
        },
        {
            "barcode": "BBWS180201249",
            "dpc": "03013101201",
            "name": "ឈិន  សារុំ"
        },
        {
            "barcode": "BBWS180201250",
            "dpc": "03013101301",
            "name": "ជា  ជួម"
        },
        {
            "barcode": "BBWS180201251",
            "dpc": "03013101401",
            "name": "ផែន  ហ៊ីម"
        },
        {
            "barcode": "BBWS180201252",
            "dpc": "03013101501",
            "name": "ម៉ិត  ឃន"
        },
        {
            "barcode": "BBWS180201253",
            "dpc": "03013101601",
            "name": "ឃុំ  ជ្រា"
        },
        {
            "barcode": "BBWS180201254",
            "dpc": "03013101701",
            "name": "ចៅ  ធឿន"
        },
        {
            "barcode": "BBWS180201255",
            "dpc": "03013101801",
            "name": "ង៉ា  គឹមឡន"
        },
        {
            "barcode": "BBWS180201256",
            "dpc": "03013101901",
            "name": "អ៊ុំ  សាឡាត"
        },
        {
            "barcode": "BBWS180201257",
            "dpc": "03013102001",
            "name": "វ៉ាត  ស៊ីម"
        },
        {
            "barcode": "BBWS180201258",
            "dpc": "03013102101",
            "name": "ស៊ុន  គីមអូន"
        },
        {
            "barcode": "BBWS180201259",
            "dpc": "03013102201",
            "name": "ទី  កុសល់"
        },
        {
            "barcode": "BBWS180201260",
            "dpc": "03013102301",
            "name": "វ៉ាត់  ចិន្តា"
        },
        {
            "barcode": "BBWS180201261",
            "dpc": "03013102401",
            "name": "ឡូ  ប៊ុនប៉ា"
        },
        {
            "barcode": "BBWS180201262",
            "dpc": "03013102501",
            "name": "ងិន  សុផល"
        },
        {
            "barcode": "BBWS180201263",
            "dpc": "03013102601",
            "name": "លឹម  ខេង"
        },
        {
            "barcode": "BBWS180201264",
            "dpc": "03013102701",
            "name": "ស៊ុន  វឿន"
        },
        {
            "barcode": "BBWS180201265",
            "dpc": "03013102801",
            "name": "អ៊ុច  អឿន"
        },
        {
            "barcode": "BBWS180201266",
            "dpc": "03013102901",
            "name": "ថៃ  យ៉ុន"
        },
        {
            "barcode": "BBWS180201267",
            "dpc": "03013103001",
            "name": "ទិត្យ  ថា"
        },
        {
            "barcode": "BBWS180201268",
            "dpc": "03013103201",
            "name": "ព្រឿង  ឆៀប"
        },
        {
            "barcode": "BBWS180201269",
            "dpc": "03013103301",
            "name": "ហុក  ហាន"
        },
        {
            "barcode": "BBWS180201270",
            "dpc": "03013103401",
            "name": "ពុំ  ប្រុស"
        },
        {
            "barcode": "BBWS180201271",
            "dpc": "03013103601",
            "name": "តាំង  ហ័ត"
        },
        {
            "barcode": "BBWS180201272",
            "dpc": "03013103701",
            "name": "មាស  រិន"
        },
        {
            "barcode": "BBWS180201273",
            "dpc": "03013103801",
            "name": "សុក  រតនះ"
        },
        {
            "barcode": "BBWS180201274",
            "dpc": "03013103901",
            "name": "កែ  ផល្លា"
        },
        {
            "barcode": "BBWS180201275",
            "dpc": "03013104001",
            "name": "ព្រឿង  ព្រិច"
        },
        {
            "barcode": "BBWS180201276",
            "dpc": "03013104101",
            "name": "អៀវ  វ៉ាន់ដេត"
        },
        {
            "barcode": "BBWS180201277",
            "dpc": "03013104201",
            "name": "យ៉ាំ  ចាន់"
        },
        {
            "barcode": "BBWS180201278",
            "dpc": "03013104301",
            "name": "វ៉ាន់  សារិទ្ធិ"
        },
        {
            "barcode": "BBWS180201279",
            "dpc": "03013104401",
            "name": "អ៊ឹម  សុខចំរើន"
        },
        {
            "barcode": "BBWS180201280",
            "dpc": "03013104501",
            "name": "សាយ  ចន្ថា"
        },
        {
            "barcode": "BBWS180201281",
            "dpc": "03013104601",
            "name": "ឯក  វឿង"
        },
        {
            "barcode": "BBWS180201282",
            "dpc": "03013104701",
            "name": "ផន  សាវឿង"
        },
        {
            "barcode": "BBWS180201283",
            "dpc": "03013104801",
            "name": "ទូច  ស៊ីណាត"
        },
        {
            "barcode": "BBWS180201284",
            "dpc": "03013104901",
            "name": "ទូច"
        },
        {
            "barcode": "BBWS180201285",
            "dpc": "03013105001",
            "name": "អាន  សំណាង"
        },
        {
            "barcode": "BBWS180201286",
            "dpc": "03013105101",
            "name": "គៀង  ប៊ុនលី"
        },
        {
            "barcode": "BBWS180201287",
            "dpc": "03013105201",
            "name": "ផាន់  ផល្លី"
        },
        {
            "barcode": "BBWS180201288",
            "dpc": "03013105301",
            "name": "យ៉េន  យឿត"
        },
        {
            "barcode": "BBWS180201289",
            "dpc": "03013105401",
            "name": "ចាន់ រី"
        },
        {
            "barcode": "BBWS180201290",
            "dpc": "03013105501",
            "name": "ង៉ា  ផារី"
        },
        {
            "barcode": "BBWS180201291",
            "dpc": "03013105601",
            "name": "គៀង  ចាន់ណា"
        },
        {
            "barcode": "BBWS180201292",
            "dpc": "03013105701",
            "name": "គឹង  វឿង"
        },
        {
            "barcode": "BBWS180201293",
            "dpc": "03013105801",
            "name": "ហង់  ឈឿយ"
        },
        {
            "barcode": "BBWS180201294",
            "dpc": "03013105901",
            "name": "ថោង  សាេវត"
        },
        {
            "barcode": "BBWS180201295",
            "dpc": "03013106101",
            "name": "ជិន  ធារី"
        },
        {
            "barcode": "BBWS180201296",
            "dpc": "03013106201",
            "name": "ប៊យ  ពូន"
        },
        {
            "barcode": "BBWS180201297",
            "dpc": "03013106301",
            "name": "ហ៊ុន  យ៉ត"
        },
        {
            "barcode": "BBWS180201298",
            "dpc": "03013106401",
            "name": "វ៉ិត  កំសាន្ត"
        },
        {
            "barcode": "BBWS180201299",
            "dpc": "03013106501",
            "name": "យួម  ស៊ីយ៉េត"
        },
        {
            "barcode": "BBWS180201300",
            "dpc": "03013106601",
            "name": "យ៉ុង  វុធ"
        },
        {
            "barcode": "BBWS180201301",
            "dpc": "03013106701",
            "name": "ហ៊ុន  សាម៉េត"
        },
        {
            "barcode": "BBWS180201302",
            "dpc": "03013106801",
            "name": "ស៊ុន  សាខាត"
        },
        {
            "barcode": "BBWS180201303",
            "dpc": "03013106901",
            "name": "ហេង  ឈឿ"
        },
        {
            "barcode": "BBWS180201304",
            "dpc": "03013107001",
            "name": "ញឹក  ពុំ"
        },
        {
            "barcode": "BBWS180201305",
            "dpc": "03013107101",
            "name": "សោម  សឺនឺ"
        },
        {
            "barcode": "BBWS180201306",
            "dpc": "03013107201",
            "name": "ហេង  ហ៊ាង"
        },
        {
            "barcode": "BBWS180201307",
            "dpc": "03013107401",
            "name": "លឿង  លុយ"
        },
        {
            "barcode": "BBWS180201308",
            "dpc": "03013107601",
            "name": "ទេព  សាវឿន"
        },
        {
            "barcode": "BBWS180201309",
            "dpc": "03013107701",
            "name": "ញឹក  សាវ៉ង"
        },
        {
            "barcode": "BBWS180201310",
            "dpc": "03013107801",
            "name": "ឡោ  ឈឿត"
        },
        {
            "barcode": "BBWS180201311",
            "dpc": "03013107901",
            "name": "ព្រីង  យ៉េត"
        },
        {
            "barcode": "BBWS180201312",
            "dpc": "03013108101",
            "name": "ហេង  ថុល"
        },
        {
            "barcode": "BBWS180201313",
            "dpc": "03013108201",
            "name": "ស៊ុន  យូណាន"
        },
        {
            "barcode": "BBWS180201314",
            "dpc": "03013108301",
            "name": "វាន់   សុខា"
        },
        {
            "barcode": "BBWS180201315",
            "dpc": "03013108401",
            "name": "ស៊ុន  គឹមហៃ"
        },
        {
            "barcode": "BBWS180201316",
            "dpc": "03013108501",
            "name": "ង៉ាត់  នឿត"
        },
        {
            "barcode": "BBWS180201317",
            "dpc": "03013108601",
            "name": "ចិន  រើត"
        },
        {
            "barcode": "BBWS180201318",
            "dpc": "03013108701",
            "name": "ឡាត់  លី"
        },
        {
            "barcode": "BBWS180201319",
            "dpc": "03013108801",
            "name": "គឹម  សេង"
        },
        {
            "barcode": "BBWS180201320",
            "dpc": "03013108901",
            "name": "ផាត់  មុំ"
        },
        {
            "barcode": "BBWS180201321",
            "dpc": "03013109001",
            "name": "ម៉ឹង  សាវ៉ាត់"
        },
        {
            "barcode": "BBWS180201322",
            "dpc": "03013109101",
            "name": "វ៉ាត  សុខា"
        },
        {
            "barcode": "BBWS180201323",
            "dpc": "03013109201",
            "name": "ឈៀង  ឆវន្ត័"
        },
        {
            "barcode": "BBWS180201324",
            "dpc": "03013109301",
            "name": "ជាស  សម្បត្តិ"
        },
        {
            "barcode": "BBWS180201325",
            "dpc": "03013109401",
            "name": "គៀង  យ៉ា"
        },
        {
            "barcode": "BBWS180201326",
            "dpc": "03013109501",
            "name": "ស៊ុំ  សំអ៊ុល"
        },
        {
            "barcode": "BBWS180201327",
            "dpc": "03013109601",
            "name": "ហេង  លាភ"
        },
        {
            "barcode": "BBWS180201328",
            "dpc": "03013109701",
            "name": "តុង  មារីកា"
        },
        {
            "barcode": "BBWS180201329",
            "dpc": "03013109801",
            "name": "ជា  វ៉ាន់ណូ"
        },
        {
            "barcode": "BBWS180201330",
            "dpc": "03013109901",
            "name": "ឈិត  គន្ធី"
        },
        {
            "barcode": "BBWS180201331",
            "dpc": "03013110001",
            "name": "ថេត  សុធា"
        },
        {
            "barcode": "BBWS180201332",
            "dpc": "03013110101",
            "name": "សេង  ហ៊ាង"
        },
        {
            "barcode": "BBWS180201333",
            "dpc": "03013110201",
            "name": "មាន  សុភ័ក្រ"
        },
        {
            "barcode": "BBWS180201334",
            "dpc": "03013110301",
            "name": "មាន  ផាវ"
        },
        {
            "barcode": "BBWS180201335",
            "dpc": "03013110501",
            "name": "ម៉ី  ជា"
        },
        {
            "barcode": "BBWS180201336",
            "dpc": "03013110601",
            "name": "ទឹតលី ចំរើន"
        },
        {
            "barcode": "BBWS180201337",
            "dpc": "03013110701",
            "name": "ថាច់  កូដាវី"
        },
        {
            "barcode": "BBWS180201338",
            "dpc": "03013110801",
            "name": "ឆេង  ឌី"
        },
        {
            "barcode": "BBWS180201339",
            "dpc": "03013110901",
            "name": "ព្រំ  សុភិន"
        },
        {
            "barcode": "BBWS180201340",
            "dpc": "03013111001",
            "name": "ហេង  ឃន"
        },
        {
            "barcode": "BBWS180201341",
            "dpc": "03013111101",
            "name": "ចំរើន វិច្ឆិកា"
        },
        {
            "barcode": "BBWS180201342",
            "dpc": "03013111201",
            "name": "ទុយ  ចិន្តា"
        },
        {
            "barcode": "BBWS180201343",
            "dpc": "03013111301",
            "name": "តឹង  នៅ"
        },
        {
            "barcode": "BBWS180201344",
            "dpc": "03013111401",
            "name": "ប៉ុល  ពេជ្រ"
        },
        {
            "barcode": "BBWS180201345",
            "dpc": "03013111501",
            "name": "ចាន់   សាវិត"
        },
        {
            "barcode": "BBWS180201346",
            "dpc": "03013111601",
            "name": "ឈៀង  លីណា"
        },
        {
            "barcode": "BBWS180201347",
            "dpc": "03013111701",
            "name": "ឃួន  វិច្ឆិកា"
        },
        {
            "barcode": "BBWS180201348",
            "dpc": "03013111901",
            "name": "ហេង  សុភាព"
        },
        {
            "barcode": "BBWS180201349",
            "dpc": "03013112001",
            "name": "គង់  ចាន់ណាត"
        },
        {
            "barcode": "BBWS180201350",
            "dpc": "03013112101",
            "name": "ប៉ុង  សុផាត"
        },
        {
            "barcode": "BBWS180201351",
            "dpc": "03013112201",
            "name": "សំ  រិតកង"
        },
        {
            "barcode": "BBWS180201352",
            "dpc": "03013112301",
            "name": "សឿម  ទ្រី"
        },
        {
            "barcode": "BBWS180201353",
            "dpc": "03013112401",
            "name": "ជឿម ណារិន"
        },
        {
            "barcode": "BBWS180201354",
            "dpc": "03013112501",
            "name": "ឡុង  វិចិត្រ"
        },
        {
            "barcode": "BBWS180201355",
            "dpc": "03013112601",
            "name": "ង៉ែត  ជឿង"
        },
        {
            "barcode": "BBWS180201356",
            "dpc": "03013112701",
            "name": "ស្ងួន  សឿម"
        },
        {
            "barcode": "BBWS180201357",
            "dpc": "03013112801",
            "name": "អ៊ិត  ដាវុធ"
        },
        {
            "barcode": "BBWS180201358",
            "dpc": "03013112901",
            "name": "ចាន់  សុវណ្ណ"
        },
        {
            "barcode": "BBWS180201359",
            "dpc": "03013113001",
            "name": "យ៉ុន  វឿត"
        },
        {
            "barcode": "BBWS180201360",
            "dpc": "03013113101",
            "name": "ប៉ែន  សុខា"
        },
        {
            "barcode": "BBWS180201361",
            "dpc": "03013113201",
            "name": "សួ  មិញ"
        },
        {
            "barcode": "BBWS180201362",
            "dpc": "03013113301",
            "name": "ប៊ុត សេរី"
        },
        {
            "barcode": "BBWS180201363",
            "dpc": "03013113401",
            "name": "ទូច ផល្លី"
        },
        {
            "barcode": "BBWS180201364",
            "dpc": "03013113501",
            "name": "វ៉ាន់  វណ្ណា"
        },
        {
            "barcode": "BBWS180201365",
            "dpc": "03013113601",
            "name": "សោម  ស៊ាន"
        },
        {
            "barcode": "BBWS180201366",
            "dpc": "03013113801",
            "name": "ស៊ឹម  សំប៊ួ"
        },
        {
            "barcode": "BBWS180201367",
            "dpc": "03013113901",
            "name": "ញឹម  ស៊ីថាន"
        },
        {
            "barcode": "BBWS180201368",
            "dpc": "03013114001",
            "name": "ឈួន  ឈូរ៉ា"
        },
        {
            "barcode": "BBWS180201369",
            "dpc": "03013114101",
            "name": "ប៊ី  ប៉េង"
        },
        {
            "barcode": "BBWS180201370",
            "dpc": "03013114201",
            "name": "គឹម  វណ្ណា"
        },
        {
            "barcode": "BBWS180201371",
            "dpc": "03013114301",
            "name": "ងឿន  ចាន់សុជាតិ"
        },
        {
            "barcode": "BBWS180201372",
            "dpc": "03013114401",
            "name": "ឡម  មៀង"
        },
        {
            "barcode": "BBWS180201373",
            "dpc": "03013114501",
            "name": "ឆើត  កន្យាណ"
        },
        {
            "barcode": "BBWS180201374",
            "dpc": "03013114601",
            "name": "ផែង  សាវរី"
        },
        {
            "barcode": "BBWS180201375",
            "dpc": "03013114701",
            "name": "គី  គាន"
        },
        {
            "barcode": "BBWS180201376",
            "dpc": "03013114801",
            "name": "សោម  សាន្ត"
        },
        {
            "barcode": "BBWS180201377",
            "dpc": "03013114901",
            "name": "ហួច  ចន្នី"
        },
        {
            "barcode": "BBWS180201378",
            "dpc": "03013115001",
            "name": "មុត  ភារម្យ"
        },
        {
            "barcode": "BBWS180201379",
            "dpc": "03013115101",
            "name": "ស្រី  សុភក្រ័"
        },
        {
            "barcode": "BBWS180201380",
            "dpc": "03013115201",
            "name": "ឆាត  កាម៉ាច"
        },
        {
            "barcode": "BBWS180201381",
            "dpc": "03013115301",
            "name": "ភឿក  អ៊ីង"
        },
        {
            "barcode": "BBWS180201382",
            "dpc": "03013115401",
            "name": "ស៊ាន  វុទ្ធី"
        },
        {
            "barcode": "BBWS180201383",
            "dpc": "03013115501",
            "name": "អូច  ភាព"
        },
        {
            "barcode": "BBWS180201384",
            "dpc": "03013115601",
            "name": "អ៊ុច  សាវុន"
        },
        {
            "barcode": "BBWS180201385",
            "dpc": "03013115701",
            "name": "រ៉េត  ប៊ុនថង"
        },
        {
            "barcode": "BBWS180201386",
            "dpc": "03013115801",
            "name": "អាង  អានីតា"
        },
        {
            "barcode": "BBWS180201387",
            "dpc": "03013115901",
            "name": "ឆាន   ស៊ីភន"
        },
        {
            "barcode": "BBWS180201388",
            "dpc": "03013116001",
            "name": "ឆាន  សារឿន"
        },
        {
            "barcode": "BBWS180201389",
            "dpc": "03013116101",
            "name": "អ៊ុំ  គុំភឿន"
        },
        {
            "barcode": "BBWS180201390",
            "dpc": "03013116201",
            "name": "ភិន  សារ៉ុន"
        },
        {
            "barcode": "BBWS180201391",
            "dpc": "03013116301",
            "name": "វើយ  ថា"
        },
        {
            "barcode": "BBWS180201392",
            "dpc": "03013116501",
            "name": "ថាប់  ចាន់ដាវី"
        },
        {
            "barcode": "BBWS180201393",
            "dpc": "03013116601",
            "name": "កាន់  សាម៉េត"
        },
        {
            "barcode": "BBWS180201394",
            "dpc": "03013116701",
            "name": "រាជ  ឈិន"
        },
        {
            "barcode": "BBWS180201395",
            "dpc": "03013116801",
            "name": "សំ  រីណា"
        },
        {
            "barcode": "BBWS180201396",
            "dpc": "03013116901",
            "name": "សេក  ភី"
        },
        {
            "barcode": "BBWS180201397",
            "dpc": "03013117001",
            "name": "សាន់  វ៉ុន"
        },
        {
            "barcode": "BBWS180201398",
            "dpc": "03013117101",
            "name": "ហុង  សុខេន"
        },
        {
            "barcode": "BBWS180201399",
            "dpc": "03013117201",
            "name": "បួ  ផានិត"
        },
        {
            "barcode": "BBWS180201400",
            "dpc": "03013117301",
            "name": "ឆោង  គឹមយឿប"
        },
        {
            "barcode": "BBWS180201401",
            "dpc": "03013117401",
            "name": "អ៊ូច  សាវុធ"
        },
        {
            "barcode": "BBWS180201402",
            "dpc": "03013117501",
            "name": "ចាន់  ស៊ត"
        },
        {
            "barcode": "BBWS180201403",
            "dpc": "03013117601",
            "name": "ទូច  សម្បត្តិ"
        },
        {
            "barcode": "BBWS180201404",
            "dpc": "03013117701",
            "name": "ទូច  សំបូរ"
        },
        {
            "barcode": "BBWS180201405",
            "dpc": "03013117801",
            "name": "ទូច  រំចេក"
        },
        {
            "barcode": "BBWS180201406",
            "dpc": "03013117901",
            "name": "អៀង  ចិន្តា"
        },
        {
            "barcode": "BBWS180201407",
            "dpc": "03013118001",
            "name": "យ៉ាង  ឈួម"
        },
        {
            "barcode": "BBWS180201408",
            "dpc": "03013118101",
            "name": "យូ  លីន"
        },
        {
            "barcode": "BBWS180201409",
            "dpc": "03013118201",
            "name": "សាលារៀនបោះពោធិ"
        },
        {
            "barcode": "BBWS180201410",
            "dpc": "03013118301",
            "name": "ថាច់  ដុក"
        },
        {
            "barcode": "BBWS180201411",
            "dpc": "03013118401",
            "name": "លឹម  គឹមអេង"
        },
        {
            "barcode": "BBWS180201412",
            "dpc": "03013118501",
            "name": "ម៉ៅ  វឿង"
        },
        {
            "barcode": "BBWS180201413",
            "dpc": "03013118601",
            "name": "លុច  លី"
        },
        {
            "barcode": "BBWS180201414",
            "dpc": "03013118701",
            "name": "ហ៊ុយ  ឈឿន"
        },
        {
            "barcode": "BBWS180201415",
            "dpc": "03013118801",
            "name": "នៅ  សាលឹម"
        },
        {
            "barcode": "BBWS180201416",
            "dpc": "03013118901",
            "name": "គឹម  រិទ្ធ"
        },
        {
            "barcode": "BBWS180201417",
            "dpc": "03013119001",
            "name": "ហួត  សំបាន"
        },
        {
            "barcode": "BBWS180201418",
            "dpc": "03013119101",
            "name": "យ៉ែម  គឹមស៊ុន"
        },
        {
            "barcode": "BBWS180201419",
            "dpc": "03013119201",
            "name": "ញឹក  ផល"
        },
        {
            "barcode": "BBWS180201420",
            "dpc": "03013119301",
            "name": "ហម  រតនា"
        },
        {
            "barcode": "BBWS180201421",
            "dpc": "03013119401",
            "name": "នង  ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180201422",
            "dpc": "03013119501",
            "name": "កែវ  អូន"
        },
        {
            "barcode": "BBWS180201423",
            "dpc": "03013119801",
            "name": "សឿន   សុខា"
        },
        {
            "barcode": "BBWS180201424",
            "dpc": "03013119901",
            "name": "ង៉ុល  ងួន"
        },
        {
            "barcode": "BBWS180201425",
            "dpc": "03013120001",
            "name": "ងើយ  សំបូរ"
        },
        {
            "barcode": "BBWS180201426",
            "dpc": "03013120101",
            "name": "ឈុន  សៅយ៉ុត"
        },
        {
            "barcode": "BBWS180201427",
            "dpc": "03013120201",
            "name": "លឹម  ដារ៉ា"
        },
        {
            "barcode": "BBWS180201428",
            "dpc": "03013120301",
            "name": "ហុង  ហេង"
        },
        {
            "barcode": "BBWS180201429",
            "dpc": "03013120401",
            "name": "ផន  សុខុម"
        },
        {
            "barcode": "BBWS180201430",
            "dpc": "03013120501",
            "name": "ភួង  ភណ័្ឌ"
        },
        {
            "barcode": "BBWS180201431",
            "dpc": "03013120701",
            "name": "ង៉ូវ  សារិទ្ធ"
        },
        {
            "barcode": "BBWS180201432",
            "dpc": "03013120801",
            "name": "ផាន់  អូន"
        },
        {
            "barcode": "BBWS180201433",
            "dpc": "03013120901",
            "name": "ជា  រស់"
        },
        {
            "barcode": "BBWS180201434",
            "dpc": "03013121001",
            "name": "សម  ម៉េត"
        },
        {
            "barcode": "BBWS180201435",
            "dpc": "03013121101",
            "name": "ប៉ែន  សុផល"
        },
        {
            "barcode": "BBWS180201436",
            "dpc": "03013121201",
            "name": "ស៊ុយ អ៊ឹង"
        },
        {
            "barcode": "BBWS180201437",
            "dpc": "03013121301",
            "name": "ម៉ៅ  រើន"
        },
        {
            "barcode": "BBWS180201438",
            "dpc": "03013121401",
            "name": "ហៀ  ម៉ៅ"
        },
        {
            "barcode": "BBWS180201439",
            "dpc": "03013121501",
            "name": "ហួត  ឈើយ"
        },
        {
            "barcode": "BBWS180201440",
            "dpc": "03013121601",
            "name": "សៀន  ជុំ"
        },
        {
            "barcode": "BBWS180201441",
            "dpc": "03013121701",
            "name": "អុង  ដារ៉ា"
        },
        {
            "barcode": "BBWS180201442",
            "dpc": "03013121801",
            "name": "ទៀវ  យូហឿល"
        },
        {
            "barcode": "BBWS180201443",
            "dpc": "03013121901",
            "name": "សាំង  សុខា"
        },
        {
            "barcode": "BBWS180201444",
            "dpc": "03013122001",
            "name": "ប៉ែន  មី"
        },
        {
            "barcode": "BBWS180201445",
            "dpc": "03013122101",
            "name": "មាស  នឿន"
        },
        {
            "barcode": "BBWS180201446",
            "dpc": "03013122201",
            "name": "ហេង  ឃន"
        },
        {
            "barcode": "BBWS180201447",
            "dpc": "03013122301",
            "name": "ហេង  គឹម"
        },
        {
            "barcode": "BBWS180201448",
            "dpc": "03013122401",
            "name": "ទៀវ  គឹមវ៉ាន់"
        },
        {
            "barcode": "BBWS180201449",
            "dpc": "03013122501",
            "name": "គី  ឡុង"
        },
        {
            "barcode": "BBWS180201450",
            "dpc": "03013122601",
            "name": "តាំង  ប៊ុនធឿយ"
        },
        {
            "barcode": "BBWS180201451",
            "dpc": "03013122701",
            "name": "សោ  ចន្ទ័រី"
        },
        {
            "barcode": "BBWS180201452",
            "dpc": "03013122801",
            "name": "សៀង  កាំងហ៊ុន"
        },
        {
            "barcode": "BBWS180201453",
            "dpc": "03013122901",
            "name": "សៀង  ម៉ាប់"
        },
        {
            "barcode": "BBWS180201454",
            "dpc": "03013123001",
            "name": "សៀង  ខុន"
        },
        {
            "barcode": "BBWS180201455",
            "dpc": "03013123101",
            "name": "សៀង  ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "BBWS180201456",
            "dpc": "03013123201",
            "name": "មិត  យ៉ត"
        },
        {
            "barcode": "BBWS180201457",
            "dpc": "03013123301",
            "name": "អ៊ិត  ហ៊ុំ"
        },
        {
            "barcode": "BBWS180201458",
            "dpc": "03013123401",
            "name": "ឃុន  លក្ខិណា"
        },
        {
            "barcode": "BBWS180201459",
            "dpc": "03013123501",
            "name": "វ៉ន លឿត"
        },
        {
            "barcode": "BBWS180201460",
            "dpc": "03013123601",
            "name": "ចាយ  ផល្លី"
        },
        {
            "barcode": "BBWS180201461",
            "dpc": "03013123701",
            "name": "តូច  ប៊ុនធី"
        },
        {
            "barcode": "BBWS180201462",
            "dpc": "03013123801",
            "name": "តូច  ធីណូ"
        },
        {
            "barcode": "BBWS180201463",
            "dpc": "03013123901",
            "name": "គីរី  សត្យា"
        },
        {
            "barcode": "BBWS180201464",
            "dpc": "03013124001",
            "name": "យ៉ក់  តាំងលី"
        },
        {
            "barcode": "BBWS180201465",
            "dpc": "03013124101",
            "name": "ផាត់  ភីវីរៈ"
        },
        {
            "barcode": "BBWS180201466",
            "dpc": "03013124201",
            "name": "តាត់  ហ៊ន"
        },
        {
            "barcode": "BBWS180201467",
            "dpc": "03013124601",
            "name": "រ៉េន  វឿន"
        },
        {
            "barcode": "BBWS180201468",
            "dpc": "03013124701",
            "name": "វិត  មូណូ"
        },
        {
            "barcode": "BBWS180201469",
            "dpc": "03013124801",
            "name": "រ៉ន  ណាន"
        },
        {
            "barcode": "BBWS180201470",
            "dpc": "03013124901",
            "name": "មួង  មន៉"
        },
        {
            "barcode": "BBWS180201471",
            "dpc": "03013125001",
            "name": "ផុន  មុំ"
        },
        {
            "barcode": "BBWS180201472",
            "dpc": "03013125101",
            "name": "ពុទ្ធ  យោធិន"
        },
        {
            "barcode": "BBWS180201473",
            "dpc": "03013125201",
            "name": "ប៉ូលី  ង៉ាន់"
        },
        {
            "barcode": "BBWS180201474",
            "dpc": "03013125301",
            "name": "ឈៀង  ហៀប"
        },
        {
            "barcode": "BBWS180201475",
            "dpc": "03013125401",
            "name": "ហម  សាម"
        },
        {
            "barcode": "BBWS180201476",
            "dpc": "03013125501",
            "name": "នួន  ផាត"
        },
        {
            "barcode": "BBWS180201477",
            "dpc": "03013125601",
            "name": "អ៊ឹង សុគន្ធ"
        },
        {
            "barcode": "BBWS180201478",
            "dpc": "03013125701",
            "name": "វង្ស  សុផា"
        },
        {
            "barcode": "BBWS180201479",
            "dpc": "03013125801",
            "name": "ប៉ិច  ប៉ូ"
        },
        {
            "barcode": "BBWS180201480",
            "dpc": "03013125901",
            "name": "នួន  វាសនា"
        },
        {
            "barcode": "BBWS180201481",
            "dpc": "03013126001",
            "name": "ភ័ក្រ"
        },
        {
            "barcode": "BBWS180201482",
            "dpc": "03013126101",
            "name": "ប្រាក់ ថា"
        },
        {
            "barcode": "BBWS180201483",
            "dpc": "03013126201",
            "name": "កាយ  ចាន់ថន់"
        },
        {
            "barcode": "BBWS180201484",
            "dpc": "03013126401",
            "name": "អៀ  វេងម៉ុង"
        },
        {
            "barcode": "BBWS180201485",
            "dpc": "03013126501",
            "name": "ធូ  សុខណា"
        },
        {
            "barcode": "BBWS180201486",
            "dpc": "03013126601",
            "name": "កែវ  ចំចន្ទ័"
        },
        {
            "barcode": "BBWS180201487",
            "dpc": "03013126801",
            "name": "តាំង  ណាំសែ"
        },
        {
            "barcode": "BBWS180201488",
            "dpc": "03013126901",
            "name": "ឈុន  លក្ខិណា"
        },
        {
            "barcode": "BBWS180201489",
            "dpc": "03013127001",
            "name": "វ៉ាត  ស៊ីម"
        },
        {
            "barcode": "BBWS180201490",
            "dpc": "03013127101",
            "name": "តាំង  ប៊ូហេង"
        },
        {
            "barcode": "BBWS180201491",
            "dpc": "03013127201",
            "name": "សួស  យ៉ុតថាណូ"
        },
        {
            "barcode": "BBWS180201492",
            "dpc": "03013127301",
            "name": "ជា  ពិសិទ្ធ"
        },
        {
            "barcode": "BBWS180201493",
            "dpc": "03013127501",
            "name": "សៀម សុន"
        },
        {
            "barcode": "BBWS180201494",
            "dpc": "03013127601",
            "name": "សុខ  ឈៀន"
        },
        {
            "barcode": "BBWS180201495",
            "dpc": "03013127701",
            "name": "ឆៃ   ណារិទ្ធ"
        },
        {
            "barcode": "BBWS180201496",
            "dpc": "03013127801",
            "name": "អ៊ូ  វឿត"
        },
        {
            "barcode": "BBWS180201497",
            "dpc": "03013127901",
            "name": "អ៊ូ  ចំរើន"
        },
        {
            "barcode": "BBWS180201498",
            "dpc": "03013128101",
            "name": "សុខ  ធី"
        },
        {
            "barcode": "BBWS180201499",
            "dpc": "03013128201",
            "name": "ផា  គឹមហៀក"
        },
        {
            "barcode": "BBWS180201500",
            "dpc": "03013128301",
            "name": "វែន  សុខុម"
        },
        {
            "barcode": "BBWS180201501",
            "dpc": "03013128401",
            "name": "ប្រស់  សឿប"
        },
        {
            "barcode": "BBWS180201502",
            "dpc": "03013128501",
            "name": "បែត  អឿម"
        },
        {
            "barcode": "BBWS180201503",
            "dpc": "03013128601",
            "name": "វង់   សាវ៉ុង"
        },
        {
            "barcode": "BBWS180201504",
            "dpc": "03013128701",
            "name": "សុក  រតនា"
        },
        {
            "barcode": "BBWS180201505",
            "dpc": "03013128801",
            "name": "ស៊ីន  ថា"
        },
        {
            "barcode": "BBWS180201506",
            "dpc": "03013128901",
            "name": "ស៊ីម  ស៊ាន"
        },
        {
            "barcode": "BBWS180201507",
            "dpc": "03013129001",
            "name": "ភិន  ប៊ុនណ្ណាត"
        },
        {
            "barcode": "BBWS180201508",
            "dpc": "03013129101",
            "name": "លី  សម្បត្តិ"
        },
        {
            "barcode": "BBWS180201509",
            "dpc": "03013129201",
            "name": "ភទ្ធ  មុន្នី"
        },
        {
            "barcode": "BBWS180201510",
            "dpc": "03013129301",
            "name": "ពេជ្រ  ឆោមឆវណ្ណ"
        },
        {
            "barcode": "BBWS180201511",
            "dpc": "03013129401",
            "name": "សំ   នៅ"
        },
        {
            "barcode": "BBWS180201512",
            "dpc": "03013129501",
            "name": "មឿន  ពុយ"
        },
        {
            "barcode": "BBWS180201513",
            "dpc": "03013129601",
            "name": "ហែម  សុធា"
        },
        {
            "barcode": "BBWS180201514",
            "dpc": "03013129701",
            "name": "នួន  ផន"
        },
        {
            "barcode": "BBWS180201515",
            "dpc": "03013129801",
            "name": "សុខ  សំណាង"
        },
        {
            "barcode": "BBWS180201516",
            "dpc": "03013129901",
            "name": "ចេត យី"
        },
        {
            "barcode": "BBWS180201517",
            "dpc": "03013130001",
            "name": "វង្ស  ប៉ោលី"
        },
        {
            "barcode": "BBWS180201518",
            "dpc": "03013130101",
            "name": "ភុំ  រក្សា ​"
        },
        {
            "barcode": "BBWS180201519",
            "dpc": "03013130201",
            "name": "សុច  សូនី"
        },
        {
            "barcode": "BBWS180201520",
            "dpc": "03013130301",
            "name": "ឡុង  ហុង"
        },
        {
            "barcode": "BBWS180201521",
            "dpc": "03013130401",
            "name": "សឿន  ធី"
        },
        {
            "barcode": "BBWS180201522",
            "dpc": "03013130501",
            "name": "ក្រេម  សាវ៉ាង"
        },
        {
            "barcode": "BBWS180201523",
            "dpc": "03013130601",
            "name": "សែស  រ៉ា"
        },
        {
            "barcode": "BBWS180201524",
            "dpc": "03013130701",
            "name": "សាន  សម្បត្តិ"
        },
        {
            "barcode": "BBWS180201525",
            "dpc": "03013130801",
            "name": "ចាន់  សុធា"
        },
        {
            "barcode": "BBWS180201526",
            "dpc": "03013130901",
            "name": "ម៉េត  មករា"
        },
        {
            "barcode": "BBWS180201527",
            "dpc": "03013131001",
            "name": "លឹម  ឃុន"
        },
        {
            "barcode": "BBWS180201528",
            "dpc": "03013131101",
            "name": "មុំ  សុភាព"
        },
        {
            "barcode": "BBWS180201529",
            "dpc": "03013131201",
            "name": "ឈួន  សេងហួង"
        },
        {
            "barcode": "BBWS180201530",
            "dpc": "03013131301",
            "name": "ម៉ី  វាសនា"
        },
        {
            "barcode": "BBWS180201531",
            "dpc": "03013131401",
            "name": "យឹម  សុជាតិ"
        },
        {
            "barcode": "BBWS180201532",
            "dpc": "03013131501",
            "name": "ជឿង  បូណា"
        },
        {
            "barcode": "BBWS180201533",
            "dpc": "03013131601",
            "name": "សុខ  តណ"
        },
        {
            "barcode": "BBWS180201534",
            "dpc": "03013131701",
            "name": "ផន  ផល្លា"
        },
        {
            "barcode": "BBWS180201535",
            "dpc": "03013131901",
            "name": "យ៉ែម  យឿម"
        },
        {
            "barcode": "BBWS180201536",
            "dpc": "03013132001",
            "name": "ជា  មឿត"
        },
        {
            "barcode": "BBWS180201537",
            "dpc": "03013132101",
            "name": "ហ៊ត  ពឿត"
        },
        {
            "barcode": "BBWS180201538",
            "dpc": "03013132201",
            "name": "ទូត  កក្កដា"
        },
        {
            "barcode": "BBWS180201539",
            "dpc": "03013132301",
            "name": "វ័រ  វ៉ាត"
        },
        {
            "barcode": "BBWS180201540",
            "dpc": "03013132501",
            "name": "ឈៀន  សុភាព"
        },
        {
            "barcode": "BBWS180201541",
            "dpc": "03013132601",
            "name": "សាន  ទូច"
        },
        {
            "barcode": "BBWS180201542",
            "dpc": "03013132701",
            "name": "គឹម  រ៉ុរឿង"
        },
        {
            "barcode": "BBWS180201543",
            "dpc": "03013132801",
            "name": "រៀន  ហាប"
        },
        {
            "barcode": "BBWS180201544",
            "dpc": "03013132901",
            "name": "សៀង យឹងខាន់"
        },
        {
            "barcode": "BBWS180201545",
            "dpc": "03013133001",
            "name": "មាន សុវណ្ណធីតា"
        },
        {
            "barcode": "BBWS180201546",
            "dpc": "03013133101",
            "name": "មាន  សុវណ្ណសូនី"
        },
        {
            "barcode": "BBWS180201547",
            "dpc": "03013133201",
            "name": "ព្រូ  ដា"
        },
        {
            "barcode": "BBWS180201548",
            "dpc": "03013133301",
            "name": "ចាន់  សិលា"
        },
        {
            "barcode": "BBWS180201549",
            "dpc": "03013133501",
            "name": "ឈុន  ប៊ុនឈួង"
        },
        {
            "barcode": "BBWS180201550",
            "dpc": "03013133601",
            "name": "ហែល  ហម"
        },
        {
            "barcode": "BBWS180201551",
            "dpc": "03013133701",
            "name": "ប៊ុន  សាឃឹន"
        },
        {
            "barcode": "BBWS180201552",
            "dpc": "03013133801",
            "name": "មិត្ត  ឆើន"
        },
        {
            "barcode": "BBWS180201553",
            "dpc": "03013133901",
            "name": "រ៉ន  សារ៉េន"
        },
        {
            "barcode": "BBWS180201554",
            "dpc": "03013134001",
            "name": "ឈុន  ធី"
        },
        {
            "barcode": "BBWS180201555",
            "dpc": "03013134201",
            "name": "កិៈ  ចិន្តា"
        },
        {
            "barcode": "BBWS180201556",
            "dpc": "03013134301",
            "name": "ផន  ស្រីដា"
        },
        {
            "barcode": "BBWS180201557",
            "dpc": "03013134401",
            "name": "ហេង  វណ្ណា"
        },
        {
            "barcode": "BBWS180201558",
            "dpc": "03013134501",
            "name": "ឡាច  វីរៈ"
        },
        {
            "barcode": "BBWS180201559",
            "dpc": "03013134601",
            "name": "ម៉ែន  បូរី"
        },
        {
            "barcode": "BBWS180201560",
            "dpc": "03013134701",
            "name": "ឈាង  ចន្ធូ"
        },
        {
            "barcode": "BBWS180201561",
            "dpc": "03013134801",
            "name": "សុទ្ថ  សុផារត្ន័"
        },
        {
            "barcode": "BBWS180201562",
            "dpc": "03013134901",
            "name": "ថុក  ហ៊ឺ"
        },
        {
            "barcode": "BBWS180201563",
            "dpc": "03013135001",
            "name": "អ៊ុក  សុផល"
        },
        {
            "barcode": "BBWS180201564",
            "dpc": "03013135101",
            "name": "គង់  សម្ជស្ស"
        },
        {
            "barcode": "BBWS180201565",
            "dpc": "03013135201",
            "name": "សៅ  រ៉ា"
        },
        {
            "barcode": "BBWS180201566",
            "dpc": "03013135301",
            "name": "ឡែម  ដូត"
        },
        {
            "barcode": "BBWS180201567",
            "dpc": "03013135401",
            "name": "អ៊ុង  សុវណ្ណ"
        },
        {
            "barcode": "BBWS180201568",
            "dpc": "03013135501",
            "name": "ទេព  គឹមសា"
        },
        {
            "barcode": "BBWS180201569",
            "dpc": "03013135601",
            "name": "អ៊ិង  កុច"
        },
        {
            "barcode": "BBWS180201570",
            "dpc": "03013135801",
            "name": "សៅ  សេក"
        },
        {
            "barcode": "BBWS180201571",
            "dpc": "03013135901",
            "name": "សុខ  យ៉េត"
        },
        {
            "barcode": "BBWS180201572",
            "dpc": "03013136001",
            "name": "យិន  វណ្ណារី"
        },
        {
            "barcode": "BBWS180201573",
            "dpc": "03013136101",
            "name": "ឈួម"
        },
        {
            "barcode": "BBWS180201574",
            "dpc": "03013136301",
            "name": "ថោង ប្រានី"
        },
        {
            "barcode": "BBWS180201575",
            "dpc": "03013136401",
            "name": "ប្រា កូណាល"
        },
        {
            "barcode": "BBWS180201576",
            "dpc": "03013136601",
            "name": "ឡុង  វឿត"
        },
        {
            "barcode": "BBWS180201577",
            "dpc": "03013136701",
            "name": "សុផានី"
        },
        {
            "barcode": "BBWS180201578",
            "dpc": "03013136801",
            "name": "ហម  ប៊ុនរិទ្ឋ"
        },
        {
            "barcode": "BBWS180201579",
            "dpc": "03013136901",
            "name": "ប្រាក់ គីណា"
        },
        {
            "barcode": "BBWS180201580",
            "dpc": "03013137001",
            "name": "កោ  ចិត្ត្រា"
        },
        {
            "barcode": "BBWS180201581",
            "dpc": "03013137101",
            "name": "អ៊ិត  មាលា"
        },
        {
            "barcode": "BBWS180201582",
            "dpc": "03013137201",
            "name": "រុំ  វ៉ាន់ធី"
        },
        {
            "barcode": "BBWS180201583",
            "dpc": "03013137301",
            "name": "ទូត រុំម្លាស់"
        },
        {
            "barcode": "BBWS180201584",
            "dpc": "03013137401",
            "name": "សោម មុនី"
        },
        {
            "barcode": "BBWS180201585",
            "dpc": "03013137501",
            "name": "ខែម  ខេន"
        },
        {
            "barcode": "BBWS180201586",
            "dpc": "03013137601",
            "name": "ជាំ  ចាន់"
        },
        {
            "barcode": "BBWS180201587",
            "dpc": "03013137701",
            "name": "ម៉  ឈៀប"
        },
        {
            "barcode": "BBWS180201588",
            "dpc": "03013137801",
            "name": "ហ៊ីម  ឈួប"
        },
        {
            "barcode": "BBWS180201589",
            "dpc": "03013137901",
            "name": "សេង  ចាន់"
        },
        {
            "barcode": "BBWS180201590",
            "dpc": "03013138001",
            "name": "យ៉ុង  យ៉ាន់"
        },
        {
            "barcode": "BBWS180201591",
            "dpc": "03013138101",
            "name": "គ្រី  ហ៊ាង"
        },
        {
            "barcode": "BBWS180201592",
            "dpc": "03013138201",
            "name": "សោម ឆាន់"
        },
        {
            "barcode": "BBWS180201593",
            "dpc": "03013138301",
            "name": "តិច  គឹមស៊ា"
        },
        {
            "barcode": "BBWS180201594",
            "dpc": "03013138401",
            "name": "ងិន សុវណ្ណ"
        },
        {
            "barcode": "BBWS180201595",
            "dpc": "03013138501",
            "name": "ម៉ាន់  អ៊ុំមី"
        },
        {
            "barcode": "BBWS180201596",
            "dpc": "03013138601",
            "name": "ម៉ាន់  អ៊ុលឡាវី"
        },
        {
            "barcode": "BBWS180201597",
            "dpc": "03013138701",
            "name": "គា​​  ឡៃ"
        },
        {
            "barcode": "BBWS180201598",
            "dpc": "03013138801",
            "name": "មួន  ម៉ាប់"
        },
        {
            "barcode": "BBWS180201599",
            "dpc": "03013138901",
            "name": "ជា និស្ស័យ"
        },
        {
            "barcode": "BBWS180201600",
            "dpc": "03013139001",
            "name": "ហួយ  គឹមឈរ"
        },
        {
            "barcode": "BBWS180201601",
            "dpc": "03013139101",
            "name": "ម៉េង  សុផៃ"
        },
        {
            "barcode": "BBWS180201602",
            "dpc": "03013139201",
            "name": "អេង មួយហ៊ាក"
        },
        {
            "barcode": "BBWS180201603",
            "dpc": "03013139301",
            "name": "បឹង  បាន"
        },
        {
            "barcode": "BBWS180201604",
            "dpc": "03013139401",
            "name": "ម៉ៅ  ថាន់"
        },
        {
            "barcode": "BBWS180201605",
            "dpc": "03013139501",
            "name": "អ៊ន សារិទ្ឋិ"
        },
        {
            "barcode": "BBWS180201606",
            "dpc": "03013139601",
            "name": "ជា ឆៃយ៉ា"
        },
        {
            "barcode": "BBWS180201607",
            "dpc": "03013139701",
            "name": "រ៉ាត ស៊ុនណារី"
        },
        {
            "barcode": "BBWS180201608",
            "dpc": "03013139801",
            "name": "គា  ធូន"
        },
        {
            "barcode": "BBWS180201609",
            "dpc": "03013139901",
            "name": "សៀវ មន្ថា"
        },
        {
            "barcode": "BBWS180201610",
            "dpc": "03013140001",
            "name": "លី លន់"
        },
        {
            "barcode": "BBWS180201611",
            "dpc": "03013140101",
            "name": "ហម ផារី"
        },
        {
            "barcode": "BBWS180201612",
            "dpc": "03013140201",
            "name": "សុត ចន្ថា"
        },
        {
            "barcode": "BBWS180201613",
            "dpc": "03013140301",
            "name": "សេន  ផល្លា"
        },
        {
            "barcode": "BBWS180201614",
            "dpc": "03013140401",
            "name": "ផល ណាវី"
        },
        {
            "barcode": "BBWS180201615",
            "dpc": "03013140501",
            "name": "ស៊ូ  រឿន"
        },
        {
            "barcode": "BBWS180201616",
            "dpc": "03013140601",
            "name": "ឆុន វណ្ណឌឿន"
        },
        {
            "barcode": "BBWS180201617",
            "dpc": "03013140701",
            "name": "លីន ស៊ីណាត"
        },
        {
            "barcode": "BBWS180201618",
            "dpc": "03013141001",
            "name": "គុយ ឆោមរ័ត្ន"
        },
        {
            "barcode": "BBWS180201619",
            "dpc": "03013141101",
            "name": "បេង ចេង"
        },
        {
            "barcode": "BBWS180201620",
            "dpc": "03013141201",
            "name": "ពៅ រី"
        },
        {
            "barcode": "BBWS180201621",
            "dpc": "03013141301",
            "name": "ណាំ រ៉ាវ័ន្ត"
        },
        {
            "barcode": "BBWS180201622",
            "dpc": "03013141401",
            "name": "ឆាយ ឡូយ"
        },
        {
            "barcode": "BBWS180201623",
            "dpc": "03013141501",
            "name": "ប៉ែន សុវណ្ណារ៉ា"
        },
        {
            "barcode": "BBWS180201624",
            "dpc": "03013141601",
            "name": "កៅ  ចំរើន"
        },
        {
            "barcode": "BBWS180201625",
            "dpc": "03013141701",
            "name": "ស្រូច លឹម២"
        },
        {
            "barcode": "BBWS180201626",
            "dpc": "03013141801",
            "name": "វ៉ាន់  ខូវ"
        },
        {
            "barcode": "BBWS180201627",
            "dpc": "03013141901",
            "name": "វ៉ាន់ សាវី"
        },
        {
            "barcode": "BBWS180201628",
            "dpc": "03013142101",
            "name": "ស្រី សុខឃាង"
        },
        {
            "barcode": "BBWS180201629",
            "dpc": "03013142201",
            "name": "ស៊ុន សុវណ្ណារិទ្ឋ"
        },
        {
            "barcode": "BBWS180201630",
            "dpc": "03013142301",
            "name": "រីន វណ្ណារ័ត្ន"
        },
        {
            "barcode": "BBWS180201631",
            "dpc": "03013142401",
            "name": "គង់ ទុំ"
        },
        {
            "barcode": "BBWS180201632",
            "dpc": "03013142501",
            "name": "ស៊ាង សឿន"
        },
        {
            "barcode": "BBWS180201633",
            "dpc": "03013142601",
            "name": "រិ ធាវី"
        },
        {
            "barcode": "BBWS180201634",
            "dpc": "03013142701",
            "name": "ហ៊ុយ សំផន"
        },
        {
            "barcode": "BBWS180201635",
            "dpc": "03013142801",
            "name": "ទុំ  ឈឿត"
        },
        {
            "barcode": "BBWS180201636",
            "dpc": "03013142901",
            "name": "វង្ស  ទូច"
        },
        {
            "barcode": "BBWS180201637",
            "dpc": "03013143001",
            "name": "មិត្ត  ឡៃហួយ"
        },
        {
            "barcode": "BBWS180201638",
            "dpc": "03013143101",
            "name": "មិត្ត សំណាង"
        },
        {
            "barcode": "BBWS180201639",
            "dpc": "03013143201",
            "name": "សុខ សាត់"
        },
        {
            "barcode": "BBWS180201640",
            "dpc": "03013143301",
            "name": "ណឹប តាវ"
        },
        {
            "barcode": "BBWS180201641",
            "dpc": "03013143401",
            "name": "ធឿន  សេងហៃ"
        },
        {
            "barcode": "BBWS180201642",
            "dpc": "03013143501",
            "name": "លក រ៉ា"
        },
        {
            "barcode": "BBWS180201643",
            "dpc": "03013143601",
            "name": "សាម រិទ្ឋ"
        },
        {
            "barcode": "BBWS180201644",
            "dpc": "03013143701",
            "name": "ប៉ែន សយ"
        },
        {
            "barcode": "BBWS180201645",
            "dpc": "03013143801",
            "name": "នួន  វេន"
        },
        {
            "barcode": "BBWS180201646",
            "dpc": "03013143901",
            "name": "អ៊ុន សុវណ្ណ"
        },
        {
            "barcode": "BBWS180201647",
            "dpc": "03013144001",
            "name": "សាញ់ កាំង"
        },
        {
            "barcode": "BBWS180201648",
            "dpc": "03013144101",
            "name": "ស្រី ចិន្តា"
        },
        {
            "barcode": "BBWS180201649",
            "dpc": "03013144201",
            "name": "ម៉ម សុខា"
        },
        {
            "barcode": "BBWS180201650",
            "dpc": "03013144301",
            "name": "ភួង សុនិតា"
        },
        {
            "barcode": "BBWS180201651",
            "dpc": "03013144401",
            "name": "ទេព កុសល់"
        },
        {
            "barcode": "BBWS180201652",
            "dpc": "03013144501",
            "name": "ឯក  ស្រីមុំ"
        },
        {
            "barcode": "BBWS180201653",
            "dpc": "03013144601",
            "name": "យ៉ត សាវឿត១"
        },
        {
            "barcode": "BBWS180201654",
            "dpc": "03013144701",
            "name": "យ៉ត វុទ្ឋី"
        },
        {
            "barcode": "BBWS180201655",
            "dpc": "03013144901",
            "name": "នង ចាន់ថាល់"
        },
        {
            "barcode": "BBWS180201656",
            "dpc": "03013145001",
            "name": "យាំ ចាន់ត្រា"
        },
        {
            "barcode": "BBWS180201657",
            "dpc": "03013145101",
            "name": "ឡាំ ណើយ"
        },
        {
            "barcode": "BBWS180201658",
            "dpc": "03013145201",
            "name": "ទេស សារឿន"
        },
        {
            "barcode": "BBWS180201659",
            "dpc": "03013145301",
            "name": "វិន សុធាវី"
        },
        {
            "barcode": "BBWS180201660",
            "dpc": "03013145401",
            "name": "តន សុខា"
        },
        {
            "barcode": "BBWS180201661",
            "dpc": "03013145501",
            "name": "រឿន រើក"
        },
        {
            "barcode": "BBWS180201662",
            "dpc": "03013145601",
            "name": "វ៉ុង សារុន"
        },
        {
            "barcode": "BBWS180201663",
            "dpc": "03013145701",
            "name": "រឹម សារុំ"
        },
        {
            "barcode": "BBWS180201664",
            "dpc": "03013145801",
            "name": "ឆាំ  សារ៉ា"
        },
        {
            "barcode": "BBWS180201665",
            "dpc": "03013145901",
            "name": "វ៉ាន់ ង៉ែត"
        },
        {
            "barcode": "BBWS180201666",
            "dpc": "03013146001",
            "name": "សាន្ត សារ៉ា"
        },
        {
            "barcode": "BBWS180201667",
            "dpc": "03013146301",
            "name": "ឈួយ  ទឺ"
        },
        {
            "barcode": "BBWS180201668",
            "dpc": "03013146401",
            "name": "មុក វាសនា"
        },
        {
            "barcode": "BBWS180201669",
            "dpc": "03013146501",
            "name": "សឿ សុភា"
        },
        {
            "barcode": "BBWS180201670",
            "dpc": "03013146601",
            "name": "សឿ  សុភ័ណ"
        },
        {
            "barcode": "BBWS180201671",
            "dpc": "03013146701",
            "name": "វ៉ាន  វ៉ុន"
        },
        {
            "barcode": "BBWS180201672",
            "dpc": "03013146801",
            "name": "ជួន សារឿម"
        },
        {
            "barcode": "BBWS180201673",
            "dpc": "03013146901",
            "name": "ទេព ជឿន"
        },
        {
            "barcode": "BBWS180201674",
            "dpc": "03013147001",
            "name": "ទុំ  ខ្លេត"
        },
        {
            "barcode": "BBWS180201675",
            "dpc": "03013147101",
            "name": "តូ ផានិត"
        },
        {
            "barcode": "BBWS180201676",
            "dpc": "03013147201",
            "name": "សំ  ណារ៉េត"
        },
        {
            "barcode": "BBWS180201677",
            "dpc": "03013147401",
            "name": "សាយ  ចំនាន"
        },
        {
            "barcode": "BBWS180201678",
            "dpc": "03013147501",
            "name": "មឿត សុគន្ធ"
        },
        {
            "barcode": "BBWS180201679",
            "dpc": "03013147601",
            "name": "ទេព  ចាន់ដារ៉ា"
        },
        {
            "barcode": "BBWS180201680",
            "dpc": "03013147701",
            "name": "អៀវ សារឿន"
        },
        {
            "barcode": "BBWS180201681",
            "dpc": "03013147801",
            "name": "លី សាឡែន"
        },
        {
            "barcode": "BBWS180201682",
            "dpc": "03013147901",
            "name": "ផេង សាវឹង"
        },
        {
            "barcode": "BBWS180201683",
            "dpc": "03013148001",
            "name": "សុខ សារ៉ាត់"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
