let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=
    [
        {
            "barcode": "BBWS180208067",
            "dpc": "03023211201",
            "name": "នួន សម្បត្តិ"
        },
        {
            "barcode": "BBWS180208068",
            "dpc": "03023206301",
            "name": "សេត សាឡែសវណ្ណា"
        },
        {
            "barcode": "BBWS180208069",
            "dpc": "03023214301",
            "name": "សើ វុទ្ធី"
        },
        {
            "barcode": "BBWS180208070",
            "dpc": "03023211301",
            "name": "ស៊ុន សុជាតិ"
        },
        {
            "barcode": "BBWS180208071",
            "dpc": "03023214401",
            "name": "ស៊ឹម សុវណ្ណ"
        },
        {
            "barcode": "BBWS180208072",
            "dpc": "03023219001",
            "name": "សូរ គន្ធា"
        },
        {
            "barcode": "BBWS180208073",
            "dpc": "03023203101",
            "name": "ឡឹក រិវឌ្ឍន៍"
        },
        {
            "barcode": "BBWS180208074",
            "dpc": "03023210901",
            "name": "ទេព តាល់"
        },
        {
            "barcode": "BBWS180208075",
            "dpc": "03023213701",
            "name": "ភីវ ផល្លី"
        },
        {
            "barcode": "BBWS180208076",
            "dpc": "03023205301",
            "name": "សុខ ចាន់ថន"
        },
        {
            "barcode": "BBWS180208077",
            "dpc": "03023205201",
            "name": "ហ៊ាន ស៊ុំ"
        },
        {
            "barcode": "BBWS180208078",
            "dpc": "03023204301",
            "name": "ហម  សំអាត"
        },
        {
            "barcode": "BBWS180208079",
            "dpc": "03023204101",
            "name": "ម៉ៅ ឡុង"
        },
        {
            "barcode": "BBWS180208080",
            "dpc": "03023204001",
            "name": "យ៉ាន់ សារឿន"
        },
        {
            "barcode": "BBWS180208081",
            "dpc": "03023204201",
            "name": "ពុធ ចំរើន"
        },
        {
            "barcode": "BBWS180208082",
            "dpc": "03023213201",
            "name": "ព្រំ ព្រឿត"
        },
        {
            "barcode": "BBWS180208083",
            "dpc": "03023213101",
            "name": "ឈឿន សាវ៉ន"
        },
        {
            "barcode": "BBWS180208084",
            "dpc": "03023213001",
            "name": "ញ៉ែម សុវណ្ណ"
        },
        {
            "barcode": "BBWS180208085",
            "dpc": "03023217301",
            "name": "រស់ វុទ្ធី"
        },
        {
            "barcode": "BBWS180208086",
            "dpc": "03023217401",
            "name": "ខុន នារី"
        },
        {
            "barcode": "BBWS180208087",
            "dpc": "03023217501",
            "name": "ឆៃ ដារ៉ា"
        },
        {
            "barcode": "BBWS180208088",
            "dpc": "03023219501",
            "name": "សេង ហ៊ួត"
        },
        {
            "barcode": "BBWS180208089",
            "dpc": "03023207701",
            "name": "សាំង ប៊ុនលី"
        },
        {
            "barcode": "BBWS180208090",
            "dpc": "03023207601",
            "name": "ឡាយ នី"
        },
        {
            "barcode": "BBWS180208091",
            "dpc": "03023220701",
            "name": "យ៉ាន់ ឌឿន"
        },
        {
            "barcode": "BBWS180208092",
            "dpc": "03023219301",
            "name": "ផេង សិទ្ធ"
        },
        {
            "barcode": "BBWS180208093",
            "dpc": "03023210601",
            "name": "ម៉ា ប៉ូ"
        },
        {
            "barcode": "BBWS180208094",
            "dpc": "03023205701",
            "name": "ស៊ិន សុផល"
        },
        {
            "barcode": "BBWS180208095",
            "dpc": "03023205601",
            "name": "ចែ វណ្ណី"
        },
        {
            "barcode": "BBWS180208096",
            "dpc": "03023205401",
            "name": "ស៊ិន សុគី"
        },
        {
            "barcode": "BBWS180208097",
            "dpc": "03023214701",
            "name": "ភួយ សុណារ័ត្ន"
        },
        {
            "barcode": "BBWS180208098",
            "dpc": "03023205501",
            "name": "យឹម សាមឿន"
        },
        {
            "barcode": "BBWS180208099",
            "dpc": "03023205801",
            "name": "សួន គួន"
        },
        {
            "barcode": "BBWS180208100",
            "dpc": "03023205901",
            "name": "ពេជ្រ វ៉ាង"
        },
        {
            "barcode": "BBWS180208101",
            "dpc": "03023202801",
            "name": "ឡាយ បូរ៉ាវី"
        },
        {
            "barcode": "BBWS180208102",
            "dpc": "03023217701",
            "name": "យឹម ឌឿន"
        },
        {
            "barcode": "BBWS180208103",
            "dpc": "03023218201",
            "name": "ហ៊ន សុខា"
        },
        {
            "barcode": "BBWS180208104",
            "dpc": "03023218401",
            "name": "សំ សៀន"
        },
        {
            "barcode": "BBWS180208105",
            "dpc": "03023218601",
            "name": "ឡុង ដារ៉ា"
        },
        {
            "barcode": "BBWS180208106",
            "dpc": "03023218701",
            "name": "ជួន សុផល"
        },
        {
            "barcode": "BBWS180208107",
            "dpc": "03023218801",
            "name": "ឈៀន ឈឹម"
        },
        {
            "barcode": "BBWS180208108",
            "dpc": "03023203001",
            "name": "សៅ ស៊ុនណារ៉ា"
        },
        {
            "barcode": "BBWS180208109",
            "dpc": "03023219101",
            "name": "តឹក ស៊ីណា"
        },
        {
            "barcode": "BBWS180208110",
            "dpc": "03023202901",
            "name": "អ៊ុយ វណ្ណៈ"
        },
        {
            "barcode": "BBWS180208111",
            "dpc": "03023210501",
            "name": "ឈ លីហ៊ាង"
        },
        {
            "barcode": "BBWS180208112",
            "dpc": "03023214001",
            "name": "សឿន សីម៉ា"
        },
        {
            "barcode": "BBWS180208113",
            "dpc": "03023214201",
            "name": "ហ៊ួត ស៊ិន"
        },
        {
            "barcode": "BBWS180208114",
            "dpc": "03023213601",
            "name": "ហ៊ួ យ៉ាង"
        },
        {
            "barcode": "BBWS180208115",
            "dpc": "03023219601",
            "name": "ជួង  សុខុម"
        },
        {
            "barcode": "BBWS180208116",
            "dpc": "03023218501",
            "name": "នី វុទ្ធី"
        },
        {
            "barcode": "BBWS180208117",
            "dpc": "03023218001",
            "name": "នូ វី"
        },
        {
            "barcode": "BBWS180208118",
            "dpc": "03023220601",
            "name": "នាម សម្បត្តិ"
        },
        {
            "barcode": "BBWS180208119",
            "dpc": "03023220501",
            "name": "អូន គន្ធា"
        },
        {
            "barcode": "BBWS180208120",
            "dpc": "03023220401",
            "name": "កែវ សុខុម"
        },
        {
            "barcode": "BBWS180208121",
            "dpc": "03023220301",
            "name": "ពេជ្រ ស្រីអូន"
        },
        {
            "barcode": "BBWS180208122",
            "dpc": "03023220201",
            "name": "ជា គី"
        },
        {
            "barcode": "BBWS180208123",
            "dpc": "03023220101",
            "name": "សាំង សៀប"
        },
        {
            "barcode": "BBWS180208124",
            "dpc": "03023220001",
            "name": "ស៊ឹម សុខចំរើន"
        },
        {
            "barcode": "BBWS180208125",
            "dpc": "03023219901",
            "name": "កែវ ស្រីទូច"
        },
        {
            "barcode": "BBWS180208126",
            "dpc": "03023219801",
            "name": "មូល ផល្លា"
        },
        {
            "barcode": "BBWS180208127",
            "dpc": "03023206101",
            "name": "ប៉េង សុខេង"
        },
        {
            "barcode": "BBWS180208128",
            "dpc": "03023200401",
            "name": "អេង សុធីរិទ្ធ"
        },
        {
            "barcode": "BBWS180208129",
            "dpc": "03023206001",
            "name": "ឆេង ឆាន់"
        },
        {
            "barcode": "BBWS180208130",
            "dpc": "03023218901",
            "name": "ហុង គឹមឡុង"
        },
        {
            "barcode": "BBWS180208131",
            "dpc": "03023201901",
            "name": "អ៊ី សាមិត្ត"
        },
        {
            "barcode": "BBWS180208132",
            "dpc": "03023202001",
            "name": "ផល សុភឿត"
        },
        {
            "barcode": "BBWS180208133",
            "dpc": "03023210201",
            "name": "ទូច វែង"
        },
        {
            "barcode": "BBWS180208134",
            "dpc": "03023210101",
            "name": "អ៊ី សាវ៉ើន"
        },
        {
            "barcode": "BBWS180208135",
            "dpc": "03023210001",
            "name": "គឹម  ទ្រី"
        },
        {
            "barcode": "BBWS180208136",
            "dpc": "03023209901",
            "name": "សុង សុខា"
        },
        {
            "barcode": "BBWS180208137",
            "dpc": "03023209701",
            "name": "ស៊ុំ ភាព"
        },
        {
            "barcode": "BBWS180208138",
            "dpc": "03023209601",
            "name": "សួន សុភ័ក្រ"
        },
        {
            "barcode": "BBWS180208139",
            "dpc": "03023205101",
            "name": "ទេព វល័ក្ខ"
        },
        {
            "barcode": "BBWS180208140",
            "dpc": "03023209101",
            "name": "សាម ឆាង"
        },
        {
            "barcode": "BBWS180208141",
            "dpc": "03023209201",
            "name": "បន៉ា  សុខ"
        },
        {
            "barcode": "BBWS180208142",
            "dpc": "03023201101",
            "name": "លី  គឹមបឿន"
        },
        {
            "barcode": "BBWS180208143",
            "dpc": "03023224501",
            "name": "អ៊ាង   អ៊ី"
        },
        {
            "barcode": "BBWS180208144",
            "dpc": "03023201401",
            "name": "ខាំ  ស្រស់"
        },
        {
            "barcode": "BBWS180208145",
            "dpc": "03023201601",
            "name": "យាយ ឡៃ"
        },
        {
            "barcode": "BBWS180208146",
            "dpc": "03023202601",
            "name": "សួន ស្រីល័ក្ខ"
        },
        {
            "barcode": "BBWS180208147",
            "dpc": "03023208501",
            "name": "ខឹម ពៅ"
        },
        {
            "barcode": "BBWS180208148",
            "dpc": "03023208401",
            "name": "ឡាច សម្ជស្ស"
        },
        {
            "barcode": "BBWS180208149",
            "dpc": "03023213401",
            "name": "សេង ណុប"
        },
        {
            "barcode": "BBWS180208150",
            "dpc": "03023209001",
            "name": "ម៉ន សុភាព"
        },
        {
            "barcode": "BBWS180208151",
            "dpc": "03023209301",
            "name": "ស៊ន សាវី"
        },
        {
            "barcode": "BBWS180208152",
            "dpc": "03023204501",
            "name": "ឈិត សុខ"
        },
        {
            "barcode": "BBWS180208153",
            "dpc": "03023211501",
            "name": "ណូត យ៉ារី"
        },
        {
            "barcode": "BBWS180208154",
            "dpc": "03023202501",
            "name": "គង់ សុផល"
        },
        {
            "barcode": "BBWS180208155",
            "dpc": "03023201201",
            "name": "ទូច យ៉ុង"
        },
        {
            "barcode": "BBWS180208156",
            "dpc": "03023201301",
            "name": "ហៀក សឿង"
        },
        {
            "barcode": "BBWS180208157",
            "dpc": "03023220901",
            "name": "អ៊ិត វុទ្ធីរិទ្ធ"
        },
        {
            "barcode": "BBWS180208158",
            "dpc": "03023201001",
            "name": "ពិន ថាវី"
        },
        {
            "barcode": "BBWS180208159",
            "dpc": "03023200801",
            "name": "សុខ សាមន្នី៥"
        },
        {
            "barcode": "BBWS180208160",
            "dpc": "03023200601",
            "name": "សុខ សាមន្ន៧"
        },
        {
            "barcode": "BBWS180208161",
            "dpc": "03023216901",
            "name": "សុច សឺត"
        },
        {
            "barcode": "BBWS180208162",
            "dpc": "03023216801",
            "name": "ស្រី នីម"
        },
        {
            "barcode": "BBWS180208163",
            "dpc": "03023216701",
            "name": "លឿង ឡេង"
        },
        {
            "barcode": "BBWS180208164",
            "dpc": "03023216601",
            "name": "សាំង ចន្ធី"
        },
        {
            "barcode": "BBWS180208165",
            "dpc": "03023216501",
            "name": "សេង តូយ"
        },
        {
            "barcode": "BBWS180208166",
            "dpc": "03023216201",
            "name": "ឌុល ជា"
        },
        {
            "barcode": "BBWS180208167",
            "dpc": "03023215901",
            "name": "ហយ មនោ"
        },
        {
            "barcode": "BBWS180208168",
            "dpc": "03023215701",
            "name": "គី​ ឆី"
        },
        {
            "barcode": "BBWS180208169",
            "dpc": "03023212301",
            "name": "តឹក លន"
        },
        {
            "barcode": "BBWS180208170",
            "dpc": "03023212201",
            "name": "គី ពេជ្រ"
        },
        {
            "barcode": "BBWS180208171",
            "dpc": "03023212101",
            "name": "ខន ខេមរិទ្ធ"
        },
        {
            "barcode": "BBWS180208172",
            "dpc": "03023216401",
            "name": "មិត្ត សុភាព"
        },
        {
            "barcode": "BBWS180208173",
            "dpc": "03023212501",
            "name": "កែវ អ៊ីម"
        },
        {
            "barcode": "BBWS180208174",
            "dpc": "03023203701",
            "name": "វ៉ាត សាវ៉ុន"
        },
        {
            "barcode": "BBWS180208175",
            "dpc": "03023212601",
            "name": "យ៉ាង កាំងស្រ៊ុន"
        },
        {
            "barcode": "BBWS180208176",
            "dpc": "03023212401",
            "name": "គឹម ភារី"
        },
        {
            "barcode": "BBWS180208177",
            "dpc": "03023203801",
            "name": "ឡុង គឹមងួន"
        },
        {
            "barcode": "BBWS180208178",
            "dpc": "03023201801",
            "name": "គិត  ឆេងលី"
        },
        {
            "barcode": "BBWS180208179",
            "dpc": "03023200101",
            "name": "សោ ស្រីណុច"
        },
        {
            "barcode": "BBWS180208180",
            "dpc": "03023210801",
            "name": "ឆាយ សារិ"
        },
        {
            "barcode": "BBWS180208181",
            "dpc": "03023200201",
            "name": "គ្រុយ  ប៉ាមុន្នី"
        },
        {
            "barcode": "BBWS180208182",
            "dpc": "03023200301",
            "name": "ប៉ែន  ហាប់"
        },
        {
            "barcode": "BBWS180208183",
            "dpc": "03023200501",
            "name": "សំ  សុភ័ក្រ"
        },
        {
            "barcode": "BBWS180208184",
            "dpc": "03023200901",
            "name": "ប៉ែន  ថាញ់"
        },
        {
            "barcode": "BBWS180208185",
            "dpc": "03023201501",
            "name": "ហៀក  កែម"
        },
        {
            "barcode": "BBWS180208186",
            "dpc": "03023201701",
            "name": "ព្រាប  យ៉ុន"
        },
        {
            "barcode": "BBWS180208187",
            "dpc": "03023202201",
            "name": "ឆៃ  ចិន្តា"
        },
        {
            "barcode": "BBWS180208188",
            "dpc": "03023202301",
            "name": "ខឹម  លក្ខណា"
        },
        {
            "barcode": "BBWS180208189",
            "dpc": "03023202401",
            "name": "លុក  វ៉ន"
        },
        {
            "barcode": "BBWS180208190",
            "dpc": "03023202701",
            "name": "សៅ  ភីរ៉ា"
        },
        {
            "barcode": "BBWS180208191",
            "dpc": "03023203201",
            "name": "កែវ សំបូរ"
        },
        {
            "barcode": "BBWS180208192",
            "dpc": "03023203301",
            "name": "ស្មាន  សាន់"
        },
        {
            "barcode": "BBWS180208193",
            "dpc": "03023203401",
            "name": "ណុះ  គុំម៉ារី"
        },
        {
            "barcode": "BBWS180208194",
            "dpc": "03023204401",
            "name": "ឌី  វណ្ណដេត"
        },
        {
            "barcode": "BBWS180208195",
            "dpc": "03023204701",
            "name": "សួន  ផល្លី"
        },
        {
            "barcode": "BBWS180208196",
            "dpc": "03023204801",
            "name": "លី  គីនឃុន"
        },
        {
            "barcode": "BBWS180208197",
            "dpc": "03023204901",
            "name": "វ៉ាន់  ចាន់"
        },
        {
            "barcode": "BBWS180208198",
            "dpc": "03023205001",
            "name": "ជៀម  មន្ថា"
        },
        {
            "barcode": "BBWS180208199",
            "dpc": "03023206201",
            "name": "ម៉េត  សាឡេះ"
        },
        {
            "barcode": "BBWS180208200",
            "dpc": "03023206401",
            "name": "ឆាន់  រិទ្ធី"
        },
        {
            "barcode": "BBWS180208201",
            "dpc": "03023206501",
            "name": "ប៉ែន  អឿន"
        },
        {
            "barcode": "BBWS180208202",
            "dpc": "03023206601",
            "name": "ឡាយ  លួម"
        },
        {
            "barcode": "BBWS180208203",
            "dpc": "03023206701",
            "name": "ជុំ  គីមសេង"
        },
        {
            "barcode": "BBWS180208204",
            "dpc": "03023206801",
            "name": "ខន  មុនី"
        },
        {
            "barcode": "BBWS180208205",
            "dpc": "03023206901",
            "name": "ជិន ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180208206",
            "dpc": "03023207001",
            "name": "លិៈ  ខេន"
        },
        {
            "barcode": "BBWS180208207",
            "dpc": "03023207101",
            "name": "សេង  សំអុល"
        },
        {
            "barcode": "BBWS180208208",
            "dpc": "03023207201",
            "name": "ង៉ែត  ចិត្រា"
        },
        {
            "barcode": "BBWS180208209",
            "dpc": "03023207301",
            "name": "ឡាញ់  បូរ៉ា"
        },
        {
            "barcode": "BBWS180208210",
            "dpc": "03023207401",
            "name": "ភួ  វាសនា"
        },
        {
            "barcode": "BBWS180208211",
            "dpc": "03023207501",
            "name": "វណ្ណ តូម៉ា"
        },
        {
            "barcode": "BBWS180208212",
            "dpc": "03023207801",
            "name": "ខឹម ចន្ទរដ្ឋា"
        },
        {
            "barcode": "BBWS180208213",
            "dpc": "03023208001",
            "name": "នឿន  សាវឿន"
        },
        {
            "barcode": "BBWS180208214",
            "dpc": "03023208101",
            "name": "តាំង ហេងលីី"
        },
        {
            "barcode": "BBWS180208215",
            "dpc": "03023208201",
            "name": "បនា  សាវឿត"
        },
        {
            "barcode": "BBWS180208216",
            "dpc": "03023208301",
            "name": "កែវ  សំណាង"
        },
        {
            "barcode": "BBWS180208217",
            "dpc": "03023208601",
            "name": "នុត  យឿត"
        },
        {
            "barcode": "BBWS180208218",
            "dpc": "03023208701",
            "name": "ឈិត  សំអុល"
        },
        {
            "barcode": "BBWS180208219",
            "dpc": "03023208801",
            "name": "ហ៊ុល  ឆាង"
        },
        {
            "barcode": "BBWS180208220",
            "dpc": "03023208901",
            "name": "ម៉ៅ  ចិន្តាណា"
        },
        {
            "barcode": "BBWS180208221",
            "dpc": "03023209501",
            "name": "ទូច  សំអុល"
        },
        {
            "barcode": "BBWS180208222",
            "dpc": "03023209801",
            "name": "សែម  រិន"
        },
        {
            "barcode": "BBWS180208223",
            "dpc": "03023210301",
            "name": "អឿ  ប៉ាន"
        },
        {
            "barcode": "BBWS180208224",
            "dpc": "03023210401",
            "name": "អ៊ា ចាន់នឿន"
        },
        {
            "barcode": "BBWS180208225",
            "dpc": "03023210701",
            "name": "ដែង  វិជ្ជា"
        },
        {
            "barcode": "BBWS180208226",
            "dpc": "03023211401",
            "name": "ឡាយ ប៊ុនហុង"
        },
        {
            "barcode": "BBWS180208227",
            "dpc": "03023211601",
            "name": "យ៉ើ ម៉ូហាំម៉ាតតៅ់ហ្វិច"
        },
        {
            "barcode": "BBWS180208228",
            "dpc": "03023211701",
            "name": "ចឹក ធី"
        },
        {
            "barcode": "BBWS180208229",
            "dpc": "03023211801",
            "name": "ហ្វាល់ ម៉ាលី"
        },
        {
            "barcode": "BBWS180208230",
            "dpc": "03023212001",
            "name": "ឆុល សុភ័ណ"
        },
        {
            "barcode": "BBWS180208231",
            "dpc": "03023212801",
            "name": "យ៉ាំ សុផាត"
        },
        {
            "barcode": "BBWS180208232",
            "dpc": "03023212901",
            "name": "ឈុន  អាង"
        },
        {
            "barcode": "BBWS180208233",
            "dpc": "03023213301",
            "name": "សាឡេះ  រូហ្វីី"
        },
        {
            "barcode": "BBWS180208234",
            "dpc": "03023213501",
            "name": "វ៉ាន់  ខេម៉ា"
        },
        {
            "barcode": "BBWS180208235",
            "dpc": "03023213901",
            "name": "ឡេង  សុខា"
        },
        {
            "barcode": "BBWS180208236",
            "dpc": "03023214101",
            "name": "ទិត្យ  ថាវី"
        },
        {
            "barcode": "BBWS180208237",
            "dpc": "03023214501",
            "name": "រឿន  ទីវន្ត័"
        },
        {
            "barcode": "BBWS180208238",
            "dpc": "03023214601",
            "name": "ឡាន  ចន្ធី"
        },
        {
            "barcode": "BBWS180208239",
            "dpc": "03023214801",
            "name": "ហ៊ុត  ឆៃ"
        },
        {
            "barcode": "BBWS180208240",
            "dpc": "03023214901",
            "name": "ភោគ  ចាន់លា"
        },
        {
            "barcode": "BBWS180208241",
            "dpc": "03023215001",
            "name": "សាញ់  វី"
        },
        {
            "barcode": "BBWS180208242",
            "dpc": "03023215101",
            "name": "ជៀប  សាវឿត"
        },
        {
            "barcode": "BBWS180208243",
            "dpc": "03023215201",
            "name": "ហៀក ឆឹង"
        },
        {
            "barcode": "BBWS180208244",
            "dpc": "03023215301",
            "name": "ហោ  ស៊ីណា"
        },
        {
            "barcode": "BBWS180208245",
            "dpc": "03023215401",
            "name": "ហោ  មុំ"
        },
        {
            "barcode": "BBWS180208246",
            "dpc": "03023215501",
            "name": "ហោ  ផារិទ្ធ"
        },
        {
            "barcode": "BBWS180208247",
            "dpc": "03023215601",
            "name": "ចាន់  រ៉ុង"
        },
        {
            "barcode": "BBWS180208248",
            "dpc": "03023215801",
            "name": "ទុយ  ប៊ុនរត្ន័"
        },
        {
            "barcode": "BBWS180208249",
            "dpc": "03023216001",
            "name": "សង  ចន្ថា"
        },
        {
            "barcode": "BBWS180208250",
            "dpc": "03023216301",
            "name": "សុទ្ធ  សុវណ្ណាវី"
        },
        {
            "barcode": "BBWS180208251",
            "dpc": "03023217001",
            "name": "រស់  ញ៉ិល"
        },
        {
            "barcode": "BBWS180208252",
            "dpc": "03023217101",
            "name": "និល  ហ៊ីង"
        },
        {
            "barcode": "BBWS180208253",
            "dpc": "03023217201",
            "name": "រ៉ែម  វីរៈ"
        },
        {
            "barcode": "BBWS180208254",
            "dpc": "03023217801",
            "name": "អ៊ុន  សម្បត្តិ"
        },
        {
            "barcode": "BBWS180208255",
            "dpc": "03023217901",
            "name": "ជុំ  រតនា"
        },
        {
            "barcode": "BBWS180208256",
            "dpc": "03023218101",
            "name": "ហ៊ាន  សុន"
        },
        {
            "barcode": "BBWS180208257",
            "dpc": "03023218301",
            "name": "ឃឿង  សាវី"
        },
        {
            "barcode": "BBWS180208258",
            "dpc": "03023219201",
            "name": "គីម  ចាន់ឡាយ"
        },
        {
            "barcode": "BBWS180208259",
            "dpc": "03023219401",
            "name": "ហេង  ហាច"
        },
        {
            "barcode": "BBWS180208260",
            "dpc": "03023219701",
            "name": "សួន  សាវ៉ាង"
        },
        {
            "barcode": "BBWS180208261",
            "dpc": "03023220801",
            "name": "អ៊ឹង   លីហេង"
        },
        {
            "barcode": "BBWS180208262",
            "dpc": "03023221001",
            "name": "ទឹម  សុធា"
        },
        {
            "barcode": "BBWS180208263",
            "dpc": "03023221101",
            "name": "សោម  នឿន"
        },
        {
            "barcode": "BBWS180208264",
            "dpc": "03023221201",
            "name": "ង៉ាក់  ធន"
        },
        {
            "barcode": "BBWS180208265",
            "dpc": "03023221301",
            "name": "ធី"
        },
        {
            "barcode": "BBWS180208266",
            "dpc": "03023221401",
            "name": "សាន  សំវី"
        },
        {
            "barcode": "BBWS180208267",
            "dpc": "03023221501",
            "name": "ឃឹម ស៊ីម"
        },
        {
            "barcode": "BBWS180208268",
            "dpc": "03023221601",
            "name": "ឃឹម  លាង"
        },
        {
            "barcode": "BBWS180208269",
            "dpc": "03023221701",
            "name": "ទ្រីវ  ធី"
        },
        {
            "barcode": "BBWS180208270",
            "dpc": "03023221801",
            "name": "ជា  ប៊ុនថា"
        },
        {
            "barcode": "BBWS180208271",
            "dpc": "03023221901",
            "name": "ពេញ  សំបូរ"
        },
        {
            "barcode": "BBWS180208272",
            "dpc": "03023222001",
            "name": "សាលាបឋមសិក្សាអណ្តូងចេញ"
        },
        {
            "barcode": "BBWS180208273",
            "dpc": "03023222101",
            "name": "ទេស  សាវុធធីយ៉ា"
        },
        {
            "barcode": "BBWS180208274",
            "dpc": "03023222201",
            "name": "ទេស រតនា"
        },
        {
            "barcode": "BBWS180208275",
            "dpc": "03023222301",
            "name": "ទេស  សុរតនី"
        },
        {
            "barcode": "BBWS180208276",
            "dpc": "03023222401",
            "name": "ឆន  សាវ៉ន"
        },
        {
            "barcode": "BBWS180208277",
            "dpc": "03023222501",
            "name": "យូ  ហា"
        },
        {
            "barcode": "BBWS180208278",
            "dpc": "03023222601",
            "name": "ប៊ុន  សច្ចរ៉ា"
        },
        {
            "barcode": "BBWS180208279",
            "dpc": "03023222701",
            "name": "ពេជ្រ សុផារី"
        },
        {
            "barcode": "BBWS180208280",
            "dpc": "03023222801",
            "name": "គង់  ស្រស់"
        },
        {
            "barcode": "BBWS180208281",
            "dpc": "03023222901",
            "name": "ឈុន  សេង"
        },
        {
            "barcode": "BBWS180208282",
            "dpc": "03023223001",
            "name": "ហេង  ប៊ុនសួរ"
        },
        {
            "barcode": "BBWS180208283",
            "dpc": "03023223101",
            "name": "ឡេង  ស៊្រុន"
        },
        {
            "barcode": "BBWS180208284",
            "dpc": "03023223201",
            "name": "ឡុច   សន្តិករ"
        },
        {
            "barcode": "BBWS180208285",
            "dpc": "03023223301",
            "name": "មួយ  គក់"
        },
        {
            "barcode": "BBWS180208286",
            "dpc": "03023223401",
            "name": "ខាវ  នៅ"
        },
        {
            "barcode": "BBWS180208287",
            "dpc": "03023223501",
            "name": "ប៉ោ  រ៉េក្រិន្ត"
        },
        {
            "barcode": "BBWS180208288",
            "dpc": "03023223601",
            "name": "លឹម ឆាយងួន"
        },
        {
            "barcode": "BBWS180208289",
            "dpc": "03023223901",
            "name": "កែវ  ចន្ថា"
        },
        {
            "barcode": "BBWS180208290",
            "dpc": "03023224001",
            "name": "រិន"
        },
        {
            "barcode": "BBWS180208291",
            "dpc": "03023224101",
            "name": "នៅ  ហ៊ីម"
        },
        {
            "barcode": "BBWS180208292",
            "dpc": "03023224201",
            "name": "ជ័យ  ដួងសិលា"
        },
        {
            "barcode": "BBWS180208293",
            "dpc": "03023224301",
            "name": "ជិន  សឿម"
        },
        {
            "barcode": "BBWS180208294",
            "dpc": "03023224401",
            "name": "ផុក  សុក"
        },
        {
            "barcode": "BBWS180208295",
            "dpc": "03023224601",
            "name": "តុង  ហេង"
        },
        {
            "barcode": "BBWS180208296",
            "dpc": "03023224701",
            "name": "ក្រិន  ម៉ូវ"
        },
        {
            "barcode": "BBWS180208297",
            "dpc": "03023224801",
            "name": "ងួន  សុបញ្ញា"
        },
        {
            "barcode": "BBWS180208298",
            "dpc": "03023224901",
            "name": "អ៊ុប  ភីឡាយ"
        },
        {
            "barcode": "BBWS180208299",
            "dpc": "03023225001",
            "name": "ស៊ិន  ង៉ុន"
        },
        {
            "barcode": "BBWS180208300",
            "dpc": "03023225101",
            "name": "ភួង  សេងហាន"
        },
        {
            "barcode": "BBWS180208301",
            "dpc": "03023225201",
            "name": "មុំ  ដេត"
        },
        {
            "barcode": "BBWS180208302",
            "dpc": "03023225301",
            "name": "ជា  សួរ"
        },
        {
            "barcode": "BBWS180208303",
            "dpc": "03023225401",
            "name": "ស៊ុន  សុវិជ្ជា"
        },
        {
            "barcode": "BBWS180208304",
            "dpc": "03023225501",
            "name": "ជុំ  ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180208305",
            "dpc": "03023225601",
            "name": "ផេង  កុសល់"
        },
        {
            "barcode": "BBWS180208306",
            "dpc": "03023225701",
            "name": "ហ៊ឺ  ហាន"
        },
        {
            "barcode": "BBWS180208307",
            "dpc": "03023225801",
            "name": "គង់  អៅ"
        },
        {
            "barcode": "BBWS180208308",
            "dpc": "03023225901",
            "name": "ផ្ទះ. ក. ភ.ពពាលខែ ឃ.ជ្រៃ"
        },
        {
            "barcode": "BBWS180208309",
            "dpc": "03023226001",
            "name": "ស៊ុំ  សុខុម"
        },
        {
            "barcode": "BBWS180208310",
            "dpc": "03023226101",
            "name": "ជីវ  រ៉ា"
        },
        {
            "barcode": "BBWS180208311",
            "dpc": "03023226301",
            "name": "ឃឹម  ប៊ុនហៀក"
        },
        {
            "barcode": "BBWS180208312",
            "dpc": "03023226401",
            "name": "ហុង  តូម៉ា"
        },
        {
            "barcode": "BBWS180208313",
            "dpc": "03023226501",
            "name": "យីម   យ៉ុង"
        },
        {
            "barcode": "BBWS180208314",
            "dpc": "03023226601",
            "name": "ឆេង  គីម"
        },
        {
            "barcode": "BBWS180208315",
            "dpc": "03023226701",
            "name": "ជា  ឆាយបូរណ៍"
        },
        {
            "barcode": "BBWS180208316",
            "dpc": "03023226801",
            "name": "ហុង  សុភី"
        },
        {
            "barcode": "BBWS180208317",
            "dpc": "03023226901",
            "name": "ម៉ៅ សុគន្ឌឌី"
        },
        {
            "barcode": "BBWS180208318",
            "dpc": "03023227001",
            "name": "ដៀប  សុមន្ថា"
        },
        {
            "barcode": "BBWS180208319",
            "dpc": "03023227101",
            "name": "សាយ   ស៊ីវហេង"
        },
        {
            "barcode": "BBWS180208320",
            "dpc": "03023227301",
            "name": "ស្វាយ  សែត"
        },
        {
            "barcode": "BBWS180208321",
            "dpc": "03023227401",
            "name": "ច្រុច   អ៊ូ"
        },
        {
            "barcode": "BBWS180208322",
            "dpc": "03023227501",
            "name": "រិទ្ធី  អៀមរក្ស"
        },
        {
            "barcode": "BBWS180208323",
            "dpc": "03023227601",
            "name": "ម៉ៅ ថេត"
        },
        {
            "barcode": "BBWS180208324",
            "dpc": "03023227701",
            "name": "ឈាម លីន"
        },
        {
            "barcode": "BBWS180208325",
            "dpc": "03023227801",
            "name": "ឡេង ចំរើន"
        },
        {
            "barcode": "BBWS180208326",
            "dpc": "03023227901",
            "name": "រឿន ដុងប៉ា"
        },
        {
            "barcode": "BBWS180208327",
            "dpc": "03023228001",
            "name": "ឈួម ហៀង"
        },
        {
            "barcode": "BBWS180208328",
            "dpc": "03023228201",
            "name": "ប្រាក់ ឆុំ"
        },
        {
            "barcode": "BBWS180208329",
            "dpc": "03023228301",
            "name": "ហ៊ុន គឹមសួក៍"
        },
        {
            "barcode": "BBWS180208330",
            "dpc": "03023228401",
            "name": "អេង លិញ"
        },
        {
            "barcode": "BBWS180208331",
            "dpc": "03023228501",
            "name": "សេង ពេក"
        },
        {
            "barcode": "BBWS180208332",
            "dpc": "03023228601",
            "name": "ឃឺ សុផល"
        },
        {
            "barcode": "BBWS180208333",
            "dpc": "03023228701",
            "name": "ឆម អឿម"
        },
        {
            "barcode": "BBWS180208334",
            "dpc": "03023228801",
            "name": "លឹម ឆាយងួន"
        },
        {
            "barcode": "BBWS180208335",
            "dpc": "03023228901",
            "name": "គង់ អ៊ឺន"
        },
        {
            "barcode": "BBWS180208336",
            "dpc": "03023229001",
            "name": "អឿន សុភក្តិ"
        },
        {
            "barcode": "BBWS180208337",
            "dpc": "03023229101",
            "name": "អឿន សុភាព"
        },
        {
            "barcode": "BBWS180208338",
            "dpc": "03023229201",
            "name": "ស៊ឹម សាវិត"
        },
        {
            "barcode": "BBWS180208339",
            "dpc": "03023229301",
            "name": "ភុន ចាន់ណា"
        },
        {
            "barcode": "BBWS180208340",
            "dpc": "03023229401",
            "name": "ភុន កុសល់"
        },
        {
            "barcode": "BBWS180208341",
            "dpc": "03023229501",
            "name": "អ៊ុំ ឈឿត"
        },
        {
            "barcode": "BBWS180208342",
            "dpc": "03023229701",
            "name": "សួស ឃឿត"
        },
        {
            "barcode": "BBWS180208343",
            "dpc": "03023229801",
            "name": "ឃី សុខុម"
        },
        {
            "barcode": "BBWS180208344",
            "dpc": "03023229901",
            "name": "ហេង សាមន្នី"
        },
        {
            "barcode": "BBWS180208345",
            "dpc": "03023230001",
            "name": "ស៊ុយ ផេង"
        },
        {
            "barcode": "BBWS180208346",
            "dpc": "03023230101",
            "name": "ហ៊ាង នី"
        },
        {
            "barcode": "BBWS180208347",
            "dpc": "03023230201",
            "name": "នី សេដ្ឋា"
        },
        {
            "barcode": "BBWS180208348",
            "dpc": "03023230301",
            "name": "ឡុន ស៊ីណាត"
        },
        {
            "barcode": "BBWS180208349",
            "dpc": "03023230401",
            "name": "ប៉ែន សំអុល"
        },
        {
            "barcode": "BBWS180208350",
            "dpc": "03023230501",
            "name": "ង៉ិន ព្រឿន"
        },
        {
            "barcode": "BBWS180208351",
            "dpc": "03023230601",
            "name": "ងួន ភីរុណ"
        },
        {
            "barcode": "BBWS180208352",
            "dpc": "03023230701",
            "name": "ថ្លាង ផល្គុន"
        },
        {
            "barcode": "BBWS180208353",
            "dpc": "03023230801",
            "name": "លឹម សុខហេង"
        },
        {
            "barcode": "BBWS180208354",
            "dpc": "03023230901",
            "name": "ឈាន រតនៈ"
        },
        {
            "barcode": "BBWS180208355",
            "dpc": "03023231001",
            "name": "ងួន ភារម្យ"
        },
        {
            "barcode": "BBWS180208356",
            "dpc": "03023231101",
            "name": "សុង ហេង១"
        },
        {
            "barcode": "BBWS180208357",
            "dpc": "03023231201",
            "name": "សុង ហេង២"
        },
        {
            "barcode": "BBWS180208358",
            "dpc": "03023231301",
            "name": "យ៉ាន់ ទី"
        },
        {
            "barcode": "BBWS180208359",
            "dpc": "03023231401",
            "name": "គង់ យ៉ុម១"
        },
        {
            "barcode": "BBWS180208360",
            "dpc": "03023231501",
            "name": "គង់ យ៉ុម២"
        },
        {
            "barcode": "BBWS180208361",
            "dpc": "03023231601",
            "name": "យ៉ាន អង"
        },
        {
            "barcode": "BBWS180208362",
            "dpc": "03023231701",
            "name": "ព្រំ សួម"
        },
        {
            "barcode": "BBWS180208363",
            "dpc": "03023231801",
            "name": "ចិន សុវណ្ណដា"
        },
        {
            "barcode": "BBWS180208364",
            "dpc": "03023231901",
            "name": "គង់ យ៉ាន"
        },
        {
            "barcode": "BBWS180208365",
            "dpc": "03023232001",
            "name": "សឿត ហូយ"
        },
        {
            "barcode": "BBWS180208366",
            "dpc": "03023232101",
            "name": "សឿត ពិសាក់"
        },
        {
            "barcode": "BBWS180208367",
            "dpc": "03023232201",
            "name": "ប្រិម ផល្លី២៦"
        },
        {
            "barcode": "BBWS180208368",
            "dpc": "03023232301",
            "name": "សឿន ពិសិទ្ធ"
        },
        {
            "barcode": "BBWS180208369",
            "dpc": "03023232401",
            "name": "ឈុន ប៊ុនរក្ស"
        },
        {
            "barcode": "BBWS180208370",
            "dpc": "03023232501",
            "name": "ជា ចន្ទ្រា"
        },
        {
            "barcode": "BBWS180208371",
            "dpc": "03023232601",
            "name": "ស៊ិន សុមេធា១"
        },
        {
            "barcode": "BBWS180208372",
            "dpc": "03023232701",
            "name": "ស៊ិន សាវុធ"
        },
        {
            "barcode": "BBWS180208373",
            "dpc": "03023232801",
            "name": "ស៊ិន សុមេធា២"
        },
        {
            "barcode": "BBWS180208374",
            "dpc": "03023232901",
            "name": "កា ប៉ូឡូ"
        },
        {
            "barcode": "BBWS180208375",
            "dpc": "03023233001",
            "name": "លី ម៉ៃ"
        },
        {
            "barcode": "BBWS180208376",
            "dpc": "03023233101",
            "name": "ស៊ុត  ពីង"
        },
        {
            "barcode": "BBWS180208377",
            "dpc": "03023233201",
            "name": "វ៉ាន់ ឡូវ"
        },
        {
            "barcode": "BBWS180208378",
            "dpc": "03023233301",
            "name": "រឿង ភីរុណ"
        },
        {
            "barcode": "BBWS180208379",
            "dpc": "03023233401",
            "name": "គីម លី"
        },
        {
            "barcode": "BBWS180208380",
            "dpc": "03023233501",
            "name": "ស៊ូរ បូរ"
        },
        {
            "barcode": "BBWS180208381",
            "dpc": "03023233601",
            "name": "មាង យ៉ុង"
        },
        {
            "barcode": "BBWS180208382",
            "dpc": "03023233701",
            "name": "មាស ទី"
        },
        {
            "barcode": "BBWS180208383",
            "dpc": "03023233801",
            "name": "ហ៊ូ ង៉ុយ"
        },
        {
            "barcode": "BBWS180208384",
            "dpc": "03023233901",
            "name": "ស ហ៊ួន"
        },
        {
            "barcode": "BBWS180208385",
            "dpc": "03023234001",
            "name": "ឈួង សាន់"
        },
        {
            "barcode": "BBWS180208386",
            "dpc": "03023234101",
            "name": "អីវ វ៉ៅ"
        },
        {
            "barcode": "BBWS180208387",
            "dpc": "03023234201",
            "name": "ចាន់ ប៉ច៉ូ"
        },
        {
            "barcode": "BBWS180208388",
            "dpc": "03023234301",
            "name": "សួន សុគុណ"
        },
        {
            "barcode": "BBWS180208389",
            "dpc": "03023234501",
            "name": "ឡាច ពេជ្រ"
        },
        {
            "barcode": "BBWS180208390",
            "dpc": "03023234601",
            "name": "ដាង ចាន់ណា"
        },
        {
            "barcode": "BBWS180208391",
            "dpc": "03023234701",
            "name": "ង៉ូវ ហ្គិចទៀង"
        },
        {
            "barcode": "BBWS180208392",
            "dpc": "03023234801",
            "name": "ដាន ផេង"
        },
        {
            "barcode": "BBWS180208393",
            "dpc": "03023234901",
            "name": "ចាន់ ដារ៉ា"
        },
        {
            "barcode": "BBWS180208394",
            "dpc": "03023235001",
            "name": "ផ្លុង ឆាយ៉ា"
        },
        {
            "barcode": "BBWS180208395",
            "dpc": "03023235101",
            "name": "សុខ យីម"
        },
        {
            "barcode": "BBWS180208396",
            "dpc": "03023235201",
            "name": "សាយ សំណាង"
        },
        {
            "barcode": "BBWS180208397",
            "dpc": "03023235301",
            "name": "ប៉ង ធី"
        },
        {
            "barcode": "BBWS180208398",
            "dpc": "03023235401",
            "name": "ហួន ស៊ុន"
        },
        {
            "barcode": "BBWS180208399",
            "dpc": "03023235501",
            "name": "ប៊ុត វីរិៈ"
        },
        {
            "barcode": "BBWS180208400",
            "dpc": "03023235601",
            "name": "ប៊ិន ចន្ថា"
        },
        {
            "barcode": "BBWS180208401",
            "dpc": "03023235701",
            "name": "កា ប៉ូឡុង"
        },
        {
            "barcode": "BBWS180208402",
            "dpc": "03023235801",
            "name": "មិន វី"
        },
        {
            "barcode": "BBWS180208403",
            "dpc": "03023235901",
            "name": "គឹម សោភា"
        },
        {
            "barcode": "BBWS180208404",
            "dpc": "03023236001",
            "name": "ជុន កក"
        },
        {
            "barcode": "BBWS180208405",
            "dpc": "03023236101",
            "name": "នូ ជីវ៉ា"
        },
        {
            "barcode": "BBWS180208406",
            "dpc": "03023236201",
            "name": "ជុំ គូរ៉ា"
        },
        {
            "barcode": "BBWS180208407",
            "dpc": "03023236301",
            "name": "ទៀ បាក់ស្រេ់ង"
        },
        {
            "barcode": "BBWS180208408",
            "dpc": "03023236401",
            "name": "លី វិមាន"
        },
        {
            "barcode": "BBWS180208409",
            "dpc": "03023236501",
            "name": "លី វិល័យ"
        },
        {
            "barcode": "BBWS180208410",
            "dpc": "03023236601",
            "name": "ហាច ចុង"
        },
        {
            "barcode": "BBWS180208411",
            "dpc": "03023236701",
            "name": "ង៉ុយ ហ៊រហុង"
        },
        {
            "barcode": "BBWS180208412",
            "dpc": "03023236801",
            "name": "ង៉ុយ វ៊រម៉េង"
        },
        {
            "barcode": "BBWS180208413",
            "dpc": "03023236901",
            "name": "ចៅ  ធី"
        },
        {
            "barcode": "BBWS180208414",
            "dpc": "03023237001",
            "name": "ទីវ រី"
        },
        {
            "barcode": "BBWS180208415",
            "dpc": "03023237101",
            "name": "រឿត សារុន"
        },
        {
            "barcode": "BBWS180208416",
            "dpc": "03023237201",
            "name": "ឡុច រ៉ា"
        },
        {
            "barcode": "BBWS180208417",
            "dpc": "03023237301",
            "name": "សឿ  ឃឿត"
        },
        {
            "barcode": "BBWS180208418",
            "dpc": "03023237401",
            "name": "តាន់ តុង"
        },
        {
            "barcode": "BBWS180208419",
            "dpc": "03023237501",
            "name": "រឿន សំអឿន"
        },
        {
            "barcode": "BBWS180208420",
            "dpc": "03023237601",
            "name": "អ៊ិត ប៉ូន"
        },
        {
            "barcode": "BBWS180208421",
            "dpc": "03023237701",
            "name": "តាន់  ម៉ៅ"
        },
        {
            "barcode": "BBWS180208422",
            "dpc": "03023237801",
            "name": "គណៈបក្សប្រជាជនឃុំជ្រៃ"
        },
        {
            "barcode": "BBWS180208423",
            "dpc": "03023237901",
            "name": "ហ៊ី ជា ដើមឬស្ស៊ី"
        },
        {
            "barcode": "BBWS180208424",
            "dpc": "03023238001",
            "name": "ខោ ប្រផា"
        },
        {
            "barcode": "BBWS180208425",
            "dpc": "03023238101",
            "name": "សុខ សំអាង"
        },
        {
            "barcode": "BBWS180208426",
            "dpc": "03023238201",
            "name": "ចេក ប៊ុននឿន"
        },
        {
            "barcode": "BBWS180208427",
            "dpc": "03023238301",
            "name": "ពុំ  យឿត"
        },
        {
            "barcode": "BBWS180208428",
            "dpc": "03023238401",
            "name": "ប្រុក យ៉ាន"
        },
        {
            "barcode": "BBWS180208429",
            "dpc": "03023238501",
            "name": "អឿម ស៊្រីម"
        },
        {
            "barcode": "BBWS180208430",
            "dpc": "03023238601",
            "name": "ជៀប សឿប"
        },
        {
            "barcode": "BBWS180208431",
            "dpc": "03023238701",
            "name": "ឡឹក ឡាន"
        },
        {
            "barcode": "BBWS180208432",
            "dpc": "03023238801",
            "name": "ឡឹក លាភ"
        },
        {
            "barcode": "BBWS180208433",
            "dpc": "03023238901",
            "name": "ហ៊ុល សុខន"
        },
        {
            "barcode": "BBWS180208434",
            "dpc": "03023239301",
            "name": "ស៊ុំ ឌី"
        },
        {
            "barcode": "BBWS180208435",
            "dpc": "03023239401",
            "name": "ម៉ន សាមឿត"
        },
        {
            "barcode": "BBWS180208436",
            "dpc": "03023239501",
            "name": "ឡឹក លឿត"
        },
        {
            "barcode": "BBWS180208437",
            "dpc": "03023239601",
            "name": "រឿន ភីង"
        },
        {
            "barcode": "BBWS180208438",
            "dpc": "03023239701",
            "name": "ចយ ជឿន"
        },
        {
            "barcode": "BBWS180208439",
            "dpc": "03023239801",
            "name": "សន សំ"
        },
        {
            "barcode": "BBWS180208440",
            "dpc": "03023239901",
            "name": "ជួនូ ពេជ្រ"
        },
        {
            "barcode": "BBWS180208441",
            "dpc": "03023240001",
            "name": "ចាន់ សាវី"
        },
        {
            "barcode": "BBWS180208442",
            "dpc": "03023240101",
            "name": "លេម ធី"
        },
        {
            "barcode": "BBWS180208443",
            "dpc": "03023240201",
            "name": "កៅ សាវេន"
        },
        {
            "barcode": "BBWS180208444",
            "dpc": "03023240501",
            "name": "ឡាក់ ម៉េងវិបុល"
        },
        {
            "barcode": "BBWS180208445",
            "dpc": "03023240601",
            "name": "លី ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180208446",
            "dpc": "03023240701",
            "name": "កុយ សាម៉ៃ"
        },
        {
            "barcode": "BBWS180208447",
            "dpc": "03023240901",
            "name": "យ៉ន គីមអឿន"
        },
        {
            "barcode": "BBWS180208448",
            "dpc": "03023241001",
            "name": "ប៊ុន សារឿន"
        },
        {
            "barcode": "BBWS180208449",
            "dpc": "03023241101",
            "name": "ប៉ាត់ សុខែម"
        },
        {
            "barcode": "BBWS180208450",
            "dpc": "03023241201",
            "name": "សាន់  វេន"
        },
        {
            "barcode": "BBWS180208451",
            "dpc": "03023241301",
            "name": "ទឹម ដែន"
        },
        {
            "barcode": "BBWS180208452",
            "dpc": "03023241401",
            "name": "កែវ ភីរក្ស"
        },
        {
            "barcode": "BBWS180208453",
            "dpc": "03023241501",
            "name": "សៅ យន់"
        },
        {
            "barcode": "BBWS180208454",
            "dpc": "03023241601",
            "name": "ជា នង់"
        },
        {
            "barcode": "BBWS180208455",
            "dpc": "03023241701",
            "name": "ស៊ាង អឿន"
        },
        {
            "barcode": "BBWS180208456",
            "dpc": "03023241801",
            "name": "គង់ អេង"
        },
        {
            "barcode": "BBWS180208457",
            "dpc": "03023241901",
            "name": "ម៉ុង ស៊ុយ"
        },
        {
            "barcode": "BBWS180208458",
            "dpc": "03023242001",
            "name": "ពីវ ហូយ"
        },
        {
            "barcode": "BBWS180208459",
            "dpc": "03023242101",
            "name": "ស៊ឹម សាលីន"
        },
        {
            "barcode": "BBWS180208460",
            "dpc": "03023242201",
            "name": "ស៊ឹម សាឡី"
        },
        {
            "barcode": "BBWS180208461",
            "dpc": "03023242301",
            "name": "យូ សាវ៉ន"
        },
        {
            "barcode": "BBWS180208462",
            "dpc": "03023242401",
            "name": "ស៊ឹម លន់"
        },
        {
            "barcode": "BBWS180208463",
            "dpc": "03023242501",
            "name": "គង់ ឆេងលួត"
        },
        {
            "barcode": "BBWS180208464",
            "dpc": "03023242601",
            "name": "យៀង សាវ៉ុង"
        },
        {
            "barcode": "BBWS180208465",
            "dpc": "03023242701",
            "name": "សាលា ឆទាន"
        },
        {
            "barcode": "BBWS180208466",
            "dpc": "03023242801",
            "name": "យឹម យ៉ង់"
        },
        {
            "barcode": "BBWS180208467",
            "dpc": "03023242901",
            "name": "ហេង សាលី"
        },
        {
            "barcode": "BBWS180208468",
            "dpc": "03023243001",
            "name": "ប៊ូ សាលីម"
        },
        {
            "barcode": "BBWS180208469",
            "dpc": "03023243101",
            "name": "ងួន យឺន"
        },
        {
            "barcode": "BBWS180208470",
            "dpc": "03023243201",
            "name": "ឆម  ឈុន"
        },
        {
            "barcode": "BBWS180208471",
            "dpc": "03023243401",
            "name": "ប៊ុន សាវី"
        },
        {
            "barcode": "BBWS180208472",
            "dpc": "03023243501",
            "name": "សួង ចាន់សុន"
        },
        {
            "barcode": "BBWS180208473",
            "dpc": "03023243601",
            "name": "គឹម វ៉ាន់ធី"
        },
        {
            "barcode": "BBWS180208474",
            "dpc": "03023243701",
            "name": "ងួន  ស៊ាងហេង"
        },
        {
            "barcode": "BBWS180208475",
            "dpc": "03023243801",
            "name": "ងួន រឿន"
        },
        {
            "barcode": "BBWS180208476",
            "dpc": "03023243901",
            "name": "ឈា ឈាន"
        },
        {
            "barcode": "BBWS180208477",
            "dpc": "03023244001",
            "name": "ថាប់  សាវ័ន្ត"
        },
        {
            "barcode": "BBWS180208478",
            "dpc": "03023244101",
            "name": "ភូមិ មូលីកា"
        },
        {
            "barcode": "BBWS180208479",
            "dpc": "03023244201",
            "name": "ស៊ឹម ទូច"
        },
        {
            "barcode": "BBWS180208480",
            "dpc": "03023244301",
            "name": "ទី សារិទ្ធ"
        },
        {
            "barcode": "BBWS180208481",
            "dpc": "03023244401",
            "name": "ស៊ឹម ឈឿត"
        },
        {
            "barcode": "BBWS180208482",
            "dpc": "03023244601",
            "name": "គុជ ឈិន"
        },
        {
            "barcode": "BBWS180208483",
            "dpc": "03023244701",
            "name": "សុង គឹមសួរ២"
        },
        {
            "barcode": "BBWS180208484",
            "dpc": "03023244801",
            "name": "អឿន សារឿន"
        },
        {
            "barcode": "BBWS180208485",
            "dpc": "03023244901",
            "name": "សេង មុំ"
        },
        {
            "barcode": "BBWS180208486",
            "dpc": "03023245001",
            "name": "សេង ធី"
        },
        {
            "barcode": "BBWS180208487",
            "dpc": "03023245101",
            "name": "ចន ញាណ"
        },
        {
            "barcode": "BBWS180208488",
            "dpc": "03023245201",
            "name": "សួន សំណាង"
        },
        {
            "barcode": "BBWS180208489",
            "dpc": "03023245301",
            "name": "ឌុក ស្រីសក្ខ"
        },
        {
            "barcode": "BBWS180208490",
            "dpc": "03023245401",
            "name": "មាន កុសល់"
        },
        {
            "barcode": "BBWS180208491",
            "dpc": "03023245501",
            "name": "សន យ៉ាន"
        },
        {
            "barcode": "BBWS180208492",
            "dpc": "03023245601",
            "name": "ខាត់ យឿន"
        },
        {
            "barcode": "BBWS180208493",
            "dpc": "03023245701",
            "name": "ខាត់ ប៉ូយ"
        },
        {
            "barcode": "BBWS180208494",
            "dpc": "03023245801",
            "name": "នូ គឹមនាង"
        },
        {
            "barcode": "BBWS180208495",
            "dpc": "03023245901",
            "name": "លន់ រ៉ា"
        },
        {
            "barcode": "BBWS180208496",
            "dpc": "03023246001",
            "name": "ហម សារ៉ាត់"
        },
        {
            "barcode": "BBWS180208497",
            "dpc": "03023246101",
            "name": "ជា វិបុល"
        },
        {
            "barcode": "BBWS180208498",
            "dpc": "03023246201",
            "name": "អ៊ឹង គីមងួន"
        },
        {
            "barcode": "BBWS180208499",
            "dpc": "03023246501",
            "name": "ស្វាយ ឈុនលឿន"
        },
        {
            "barcode": "BBWS180208500",
            "dpc": "03023246901",
            "name": "ពាន់ អឿន"
        },
        {
            "barcode": "BBWS180208501",
            "dpc": "03023247001",
            "name": "ប៉ែន នុយ"
        },
        {
            "barcode": "BBWS180208502",
            "dpc": "03023247101",
            "name": "ផុន លីមសេង"
        },
        {
            "barcode": "BBWS180208503",
            "dpc": "03023247201",
            "name": "ទី សុភាព"
        },
        {
            "barcode": "BBWS180208504",
            "dpc": "03023247301",
            "name": "ឡាក់ ឈួម"
        },
        {
            "barcode": "BBWS180208505",
            "dpc": "03023247401",
            "name": "ខន សុផាត"
        },
        {
            "barcode": "BBWS180208506",
            "dpc": "03023247501",
            "name": "ភឿន វ៉ាន់ដា"
        },
        {
            "barcode": "BBWS180208507",
            "dpc": "03023247601",
            "name": "សៅ សឿត"
        },
        {
            "barcode": "BBWS180208508",
            "dpc": "03023247701",
            "name": "អ៊ឹម វ៉ាន់ឌី"
        },
        {
            "barcode": "BBWS180208509",
            "dpc": "03023247801",
            "name": "គឹម វ៉ាន់ថា"
        },
        {
            "barcode": "BBWS180208510",
            "dpc": "03023247901",
            "name": "ចាន់ សាមឿន"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
