let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=
    [
        {
            "barcode": "BBWS180202476",
            "dpc": "03013444901",
            "name": "យឿង សាវី"
        },
        {
            "barcode": "BBWS180202477",
            "dpc": "03013400101",
            "name": "ជា គឹមឆេង"
        },
        {
            "barcode": "BBWS180202478",
            "dpc": "03013400201",
            "name": "ជីយ សំណាង"
        },
        {
            "barcode": "BBWS180202479",
            "dpc": "03013400301",
            "name": "ជ័យ គឹមឈុន"
        },
        {
            "barcode": "BBWS180202480",
            "dpc": "03013400401",
            "name": "ញ៉ា គឹមលី"
        },
        {
            "barcode": "BBWS180202481",
            "dpc": "03013400501",
            "name": "ឌី សូភី"
        },
        {
            "barcode": "BBWS180202482",
            "dpc": "03013400601",
            "name": "ហ៊ឺម ចន្ទធី"
        },
        {
            "barcode": "BBWS180202483",
            "dpc": "03013400701",
            "name": "តៅ គឹមវែង"
        },
        {
            "barcode": "BBWS180202484",
            "dpc": "03013400801",
            "name": "ឈឹត ចន្ថា"
        },
        {
            "barcode": "BBWS180202485",
            "dpc": "03013400901",
            "name": "ឈឹត សៀវបេង"
        },
        {
            "barcode": "BBWS180202486",
            "dpc": "03013401001",
            "name": "ឈុត សុជា"
        },
        {
            "barcode": "BBWS180202487",
            "dpc": "03013401101",
            "name": "ជ រ៉ែន"
        },
        {
            "barcode": "BBWS180202488",
            "dpc": "03013401201",
            "name": "ឈុត សាឃូម"
        },
        {
            "barcode": "BBWS180202489",
            "dpc": "03013401301",
            "name": "សេក វាសនា"
        },
        {
            "barcode": "BBWS180202490",
            "dpc": "03013401401",
            "name": "សេក វីបុល"
        },
        {
            "barcode": "BBWS180202491",
            "dpc": "03013401501",
            "name": "ផូ សុវណ្ណរិទ្ធ"
        },
        {
            "barcode": "BBWS180202492",
            "dpc": "03013401601",
            "name": "ហូ នរ៉ា"
        },
        {
            "barcode": "BBWS180202493",
            "dpc": "03013401701",
            "name": "ជា ប៊ុននី"
        },
        {
            "barcode": "BBWS180202494",
            "dpc": "03013401801",
            "name": "កង សារៀប"
        },
        {
            "barcode": "BBWS180202495",
            "dpc": "03013401901",
            "name": "ជេត ម៉ារ៉ាឌី"
        },
        {
            "barcode": "BBWS180202496",
            "dpc": "03013402001",
            "name": "ឈឹត សំផុន"
        },
        {
            "barcode": "BBWS180202497",
            "dpc": "03013402101",
            "name": "ឈឿន សុវណ្ណរិទ្ធ"
        },
        {
            "barcode": "BBWS180202498",
            "dpc": "03013402201",
            "name": "ទៀង ពត"
        },
        {
            "barcode": "BBWS180202499",
            "dpc": "03013402301",
            "name": "ហេង សារឿត"
        },
        {
            "barcode": "BBWS180202500",
            "dpc": "03013402401",
            "name": "លាង វិច្ឆិកា"
        },
        {
            "barcode": "BBWS180202501",
            "dpc": "03013402501",
            "name": "ពុំ ប្រុស"
        },
        {
            "barcode": "BBWS180202502",
            "dpc": "03013402601",
            "name": "ពិន សារ៉ែត"
        },
        {
            "barcode": "BBWS180202503",
            "dpc": "03013402801",
            "name": "ជុំ មិថុនា"
        },
        {
            "barcode": "BBWS180202504",
            "dpc": "03013402901",
            "name": "ឡុង សត្យា"
        },
        {
            "barcode": "BBWS180202505",
            "dpc": "03013403001",
            "name": "សុង សុភ័ក្រ្ត"
        },
        {
            "barcode": "BBWS180202506",
            "dpc": "03013403101",
            "name": "មឹក ចន្ថា"
        },
        {
            "barcode": "BBWS180202507",
            "dpc": "03013403201",
            "name": "មឹក មករា"
        },
        {
            "barcode": "BBWS180202508",
            "dpc": "03013403301",
            "name": "យួន ចាន់យ៉ា"
        },
        {
            "barcode": "BBWS180202509",
            "dpc": "03013403401",
            "name": "ហេង សុភារី"
        },
        {
            "barcode": "BBWS180202510",
            "dpc": "03013403501",
            "name": "សៅ ម៉េង"
        },
        {
            "barcode": "BBWS180202511",
            "dpc": "03013403601",
            "name": "ធៀម ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "BBWS180202512",
            "dpc": "03013403701",
            "name": "គី គឿម"
        },
        {
            "barcode": "BBWS180202513",
            "dpc": "03013403801",
            "name": "ខេង ប៊ុនណា"
        },
        {
            "barcode": "BBWS180202514",
            "dpc": "03013403901",
            "name": "ប៉ុក ចាន់រស្មី"
        },
        {
            "barcode": "BBWS180202515",
            "dpc": "03013404001",
            "name": "សង លីណា"
        },
        {
            "barcode": "BBWS180202516",
            "dpc": "03013404101",
            "name": "គ្រុយ ចាន់រិទ្ធិ"
        },
        {
            "barcode": "BBWS180202517",
            "dpc": "03013404201",
            "name": "សៅ សុភាព"
        },
        {
            "barcode": "BBWS180202518",
            "dpc": "03013404401",
            "name": "ឈឿ វាសនា"
        },
        {
            "barcode": "BBWS180202519",
            "dpc": "03013404501",
            "name": "រួម ហេង"
        },
        {
            "barcode": "BBWS180202520",
            "dpc": "03013404601",
            "name": "កែវ វណ្ណា"
        },
        {
            "barcode": "BBWS180202521",
            "dpc": "03013404701",
            "name": "អង់ មុន្នីរត័្ន"
        },
        {
            "barcode": "BBWS180202522",
            "dpc": "03013404801",
            "name": "នង បូរណា"
        },
        {
            "barcode": "BBWS180202523",
            "dpc": "03013404901",
            "name": "នង ចន្ថា"
        },
        {
            "barcode": "BBWS180202524",
            "dpc": "03013405001",
            "name": "សេក បូរណ"
        },
        {
            "barcode": "BBWS180202525",
            "dpc": "03013405101",
            "name": "ជា អាង"
        },
        {
            "barcode": "BBWS180202526",
            "dpc": "03013405201",
            "name": "នង ចាន់នី"
        },
        {
            "barcode": "BBWS180202527",
            "dpc": "03013405301",
            "name": "ឆៃ វណ្ណរិទ្ធ"
        },
        {
            "barcode": "BBWS180202528",
            "dpc": "03013405401",
            "name": "ឆេង ប៉េងលន់"
        },
        {
            "barcode": "BBWS180202529",
            "dpc": "03013405501",
            "name": "នង សារ៉ាន"
        },
        {
            "barcode": "BBWS180202530",
            "dpc": "03013405601",
            "name": "អ៊ាម ណៃ"
        },
        {
            "barcode": "BBWS180202531",
            "dpc": "03013405701",
            "name": "ដេត អេងលី"
        },
        {
            "barcode": "BBWS180202532",
            "dpc": "03013405801",
            "name": "កឹម ឈួយ"
        },
        {
            "barcode": "BBWS180202533",
            "dpc": "03013405901",
            "name": "សិន ធី"
        },
        {
            "barcode": "BBWS180202534",
            "dpc": "03013406101",
            "name": "លុត ផល្លា"
        },
        {
            "barcode": "BBWS180202535",
            "dpc": "03013406201",
            "name": "ផូ មុំ"
        },
        {
            "barcode": "BBWS180202536",
            "dpc": "03013406301",
            "name": "ផូ វណ្ណ"
        },
        {
            "barcode": "BBWS180202537",
            "dpc": "03013406401",
            "name": "ឃី ឆេងសុកសាន្ត"
        },
        {
            "barcode": "BBWS180202538",
            "dpc": "03013406601",
            "name": "អុន លីវីណា"
        },
        {
            "barcode": "BBWS180202539",
            "dpc": "03013406701",
            "name": "វ៉ាត ហឹង"
        },
        {
            "barcode": "BBWS180202540",
            "dpc": "03013406801",
            "name": "វ៉ាត វ៉ាន់ថា"
        },
        {
            "barcode": "BBWS180202541",
            "dpc": "03013406901",
            "name": "ប៉ុក សុជាតិ"
        },
        {
            "barcode": "BBWS180202542",
            "dpc": "03013407001",
            "name": "ទឹម ហ៊ុច"
        },
        {
            "barcode": "BBWS180202543",
            "dpc": "03013407101",
            "name": "លឹម ហួត"
        },
        {
            "barcode": "BBWS180202544",
            "dpc": "03013407201",
            "name": "អាង គឹមឈាន"
        },
        {
            "barcode": "BBWS180202545",
            "dpc": "03013407301",
            "name": "ខឹម វឿត"
        },
        {
            "barcode": "BBWS180202546",
            "dpc": "03013407401",
            "name": "ផាវ សុផានី"
        },
        {
            "barcode": "BBWS180202547",
            "dpc": "03013407501",
            "name": "យី ស៊ុយ"
        },
        {
            "barcode": "BBWS180202548",
            "dpc": "03013407601",
            "name": "គឹម ហុង"
        },
        {
            "barcode": "BBWS180202549",
            "dpc": "03013407701",
            "name": "ស្រុន លាងវូច"
        },
        {
            "barcode": "BBWS180202550",
            "dpc": "03013407801",
            "name": "សេង រដ្ខា"
        },
        {
            "barcode": "BBWS180202551",
            "dpc": "03013407901",
            "name": "យុយ ប៉ា"
        },
        {
            "barcode": "BBWS180202552",
            "dpc": "03013408001",
            "name": "ទូច គុណណែ"
        },
        {
            "barcode": "BBWS180202553",
            "dpc": "03013408101",
            "name": "វា ហាក"
        },
        {
            "barcode": "BBWS180202554",
            "dpc": "03013408201",
            "name": "ណាំ សុវណ្ណរ៉ា"
        },
        {
            "barcode": "BBWS180202555",
            "dpc": "03013408301",
            "name": "ជាម ជម្ពរត័្ន"
        },
        {
            "barcode": "BBWS180202556",
            "dpc": "03013408401",
            "name": "បេង ស៊ុយ"
        },
        {
            "barcode": "BBWS180202557",
            "dpc": "03013408501",
            "name": "ហ៊ិន សឿម"
        },
        {
            "barcode": "BBWS180202558",
            "dpc": "03013408601",
            "name": "ឆ្លាម សម្បត្តិ"
        },
        {
            "barcode": "BBWS180202559",
            "dpc": "03013408701",
            "name": "យាន ឡងឌី"
        },
        {
            "barcode": "BBWS180202560",
            "dpc": "03013408801",
            "name": "ឈុំ វ័ន"
        },
        {
            "barcode": "BBWS180202561",
            "dpc": "03013408901",
            "name": "យិន ជួយ"
        },
        {
            "barcode": "BBWS180202562",
            "dpc": "03013409001",
            "name": "សំ វូហា"
        },
        {
            "barcode": "BBWS180202563",
            "dpc": "03013409101",
            "name": "រៀន សម្បត្តិ"
        },
        {
            "barcode": "BBWS180202564",
            "dpc": "03013409201",
            "name": "រិត សុឃិន"
        },
        {
            "barcode": "BBWS180202565",
            "dpc": "03013409301",
            "name": "ខៀវ ហួន"
        },
        {
            "barcode": "BBWS180202566",
            "dpc": "03013409401",
            "name": "ភាជ ប៊ុនថង"
        },
        {
            "barcode": "BBWS180202567",
            "dpc": "03013409601",
            "name": "រិត សុខាន់"
        },
        {
            "barcode": "BBWS180202568",
            "dpc": "03013409701",
            "name": "អ៊ិត សំណាង"
        },
        {
            "barcode": "BBWS180202569",
            "dpc": "03013409801",
            "name": "ចៅ សៅ"
        },
        {
            "barcode": "BBWS180202570",
            "dpc": "03013409901",
            "name": "ចៀម រត័្ន"
        },
        {
            "barcode": "BBWS180202571",
            "dpc": "03013410001",
            "name": "មិល សាវិន"
        },
        {
            "barcode": "BBWS180202572",
            "dpc": "03013410101",
            "name": "អ៊ឹម សារូន"
        },
        {
            "barcode": "BBWS180202573",
            "dpc": "03013410201",
            "name": "សាមី សាវែង"
        },
        {
            "barcode": "BBWS180202574",
            "dpc": "03013410301",
            "name": "ចៅ ជៀវ"
        },
        {
            "barcode": "BBWS180202575",
            "dpc": "03013410401",
            "name": "សំ លីង"
        },
        {
            "barcode": "BBWS180202576",
            "dpc": "03013410501",
            "name": "ហុក ហេង"
        },
        {
            "barcode": "BBWS180202577",
            "dpc": "03013410701",
            "name": "នី សុខឃៀង"
        },
        {
            "barcode": "BBWS180202578",
            "dpc": "03013410801",
            "name": "គីម វណ្ណា"
        },
        {
            "barcode": "BBWS180202579",
            "dpc": "03013410901",
            "name": "យាំង សុវណ្ណារា"
        },
        {
            "barcode": "BBWS180202580",
            "dpc": "03013411001",
            "name": "ទ្រី វុត្ថា"
        },
        {
            "barcode": "BBWS180202581",
            "dpc": "03013411101",
            "name": "ទិព្វ សុហេង"
        },
        {
            "barcode": "BBWS180202582",
            "dpc": "03013411201",
            "name": "តូច កុសល់"
        },
        {
            "barcode": "BBWS180202583",
            "dpc": "03013411301",
            "name": "រី រ៉ាន"
        },
        {
            "barcode": "BBWS180202584",
            "dpc": "03013411401",
            "name": "លី សុវណ្ណ"
        },
        {
            "barcode": "BBWS180202585",
            "dpc": "03013411501",
            "name": "សំ យ៉េត"
        },
        {
            "barcode": "BBWS180202586",
            "dpc": "03013411601",
            "name": "ឃួន សារ៉ាន់"
        },
        {
            "barcode": "BBWS180202587",
            "dpc": "03013411801",
            "name": "ញៀវ ប៊ូរ"
        },
        {
            "barcode": "BBWS180202588",
            "dpc": "03013411901",
            "name": "មាស សាអែម"
        },
        {
            "barcode": "BBWS180202589",
            "dpc": "03013412001",
            "name": "តូច សុខុម"
        },
        {
            "barcode": "BBWS180202590",
            "dpc": "03013412101",
            "name": "រ៉ម យឹង"
        },
        {
            "barcode": "BBWS180202591",
            "dpc": "03013412201",
            "name": "ធូន ពេជ្រ"
        },
        {
            "barcode": "BBWS180202592",
            "dpc": "03013412301",
            "name": "ហុង សេដ្ឋា"
        },
        {
            "barcode": "BBWS180202593",
            "dpc": "03013412401",
            "name": "សៀន វើន"
        },
        {
            "barcode": "BBWS180202594",
            "dpc": "03013412501",
            "name": "ជឹង ជីវន័្ត"
        },
        {
            "barcode": "BBWS180202595",
            "dpc": "03013412601",
            "name": "នីរត័្ន"
        },
        {
            "barcode": "BBWS180202596",
            "dpc": "03013412701",
            "name": "យឹន យីវ"
        },
        {
            "barcode": "BBWS180202597",
            "dpc": "03013412801",
            "name": "ហង់​ លឿត"
        },
        {
            "barcode": "BBWS180202598",
            "dpc": "03013412901",
            "name": "ធឹង គឹមហេង"
        },
        {
            "barcode": "BBWS180202599",
            "dpc": "03013413001",
            "name": "យោក ស្វាង"
        },
        {
            "barcode": "BBWS180202600",
            "dpc": "03013413201",
            "name": "យាំ ទូច"
        },
        {
            "barcode": "BBWS180202601",
            "dpc": "03013413401",
            "name": "យាំ ខាន់"
        },
        {
            "barcode": "BBWS180202602",
            "dpc": "03013413501",
            "name": "លី តឹក"
        },
        {
            "barcode": "BBWS180202603",
            "dpc": "03013413701",
            "name": "យូម ធារ៉ា"
        },
        {
            "barcode": "BBWS180202604",
            "dpc": "03013413801",
            "name": "ប៊ុន លឹមអេង"
        },
        {
            "barcode": "BBWS180202605",
            "dpc": "03013413901",
            "name": "សុខ បាន"
        },
        {
            "barcode": "BBWS180202606",
            "dpc": "03013414001",
            "name": "ថា សំរិត"
        },
        {
            "barcode": "BBWS180202607",
            "dpc": "03013414101",
            "name": "ជូម ប៊ុនទៀង"
        },
        {
            "barcode": "BBWS180202608",
            "dpc": "03013414201",
            "name": "សាន្ត ពីសី"
        },
        {
            "barcode": "BBWS180202609",
            "dpc": "03013414301",
            "name": "ហឿង ហ្វូ"
        },
        {
            "barcode": "BBWS180202610",
            "dpc": "03013414401",
            "name": "នូម ចក់"
        },
        {
            "barcode": "BBWS180202611",
            "dpc": "03013414501",
            "name": "ម៊ុយ"
        },
        {
            "barcode": "BBWS180202612",
            "dpc": "03013414601",
            "name": "ហឿង ទី"
        },
        {
            "barcode": "BBWS180202613",
            "dpc": "03013414701",
            "name": "ហូម ខ្វែក"
        },
        {
            "barcode": "BBWS180202614",
            "dpc": "03013414801",
            "name": "យឹម ផងឌី"
        },
        {
            "barcode": "BBWS180202615",
            "dpc": "03013414901",
            "name": "ស៊ុន រតនា"
        },
        {
            "barcode": "BBWS180202616",
            "dpc": "03013415001",
            "name": "ប៉ន យើន"
        },
        {
            "barcode": "BBWS180202617",
            "dpc": "03013415101",
            "name": "អ៊ុច សាវង"
        },
        {
            "barcode": "BBWS180202618",
            "dpc": "03013415201",
            "name": "ញឹក រ៉ាត់"
        },
        {
            "barcode": "BBWS180202619",
            "dpc": "03013415301",
            "name": "ញឹក ឃុន្នី"
        },
        {
            "barcode": "BBWS180202620",
            "dpc": "03013415401",
            "name": "ញឹក សំណាង"
        },
        {
            "barcode": "BBWS180202621",
            "dpc": "03013415501",
            "name": "ញឹក ពន្លឹ"
        },
        {
            "barcode": "BBWS180202622",
            "dpc": "03013415601",
            "name": "នុត ប្រណិត"
        },
        {
            "barcode": "BBWS180202623",
            "dpc": "03013415701",
            "name": "មឿន ស្រីលក្ខណ៌"
        },
        {
            "barcode": "BBWS180202624",
            "dpc": "03013415801",
            "name": "មាន ឡាយ"
        },
        {
            "barcode": "BBWS180202625",
            "dpc": "03013416001",
            "name": "សង ប៊ុនលត"
        },
        {
            "barcode": "BBWS180202626",
            "dpc": "03013416101",
            "name": "ស្រី សុភក្រ័"
        },
        {
            "barcode": "BBWS180202627",
            "dpc": "03013416201",
            "name": "ម៉ិល បោះ"
        },
        {
            "barcode": "BBWS180202628",
            "dpc": "03013416301",
            "name": "ឆឿម ឈឿយ"
        },
        {
            "barcode": "BBWS180202629",
            "dpc": "03013416401",
            "name": "សិត រិត"
        },
        {
            "barcode": "BBWS180202630",
            "dpc": "03013416501",
            "name": "កូច គឹមលី"
        },
        {
            "barcode": "BBWS180202631",
            "dpc": "03013416601",
            "name": "លឹម សុភីណា"
        },
        {
            "barcode": "BBWS180202632",
            "dpc": "03013416701",
            "name": "ផ្លុង សាត"
        },
        {
            "barcode": "BBWS180202633",
            "dpc": "03013416801",
            "name": "ខៀក វណ្ណស៊ី"
        },
        {
            "barcode": "BBWS180202634",
            "dpc": "03013416901",
            "name": "ស៊ុន រ៉ែម"
        },
        {
            "barcode": "BBWS180202635",
            "dpc": "03013417001",
            "name": "ជា សារ៉ាតឌី"
        },
        {
            "barcode": "BBWS180202636",
            "dpc": "03013417101",
            "name": "ផាត វុទ្ធី"
        },
        {
            "barcode": "BBWS180202637",
            "dpc": "03013417201",
            "name": "រឺទ្ធ មុន្នី"
        },
        {
            "barcode": "BBWS180202638",
            "dpc": "03013417301",
            "name": "សូន ភេន"
        },
        {
            "barcode": "BBWS180202639",
            "dpc": "03013417401",
            "name": "អាត ប៊ុនរត័្ន"
        },
        {
            "barcode": "BBWS180202640",
            "dpc": "03013417501",
            "name": "ដូ ម៉េងអង់"
        },
        {
            "barcode": "BBWS180202641",
            "dpc": "03013417601",
            "name": "បាន ចន្ធី"
        },
        {
            "barcode": "BBWS180202642",
            "dpc": "03013417701",
            "name": "ម៉ម មាន"
        },
        {
            "barcode": "BBWS180202643",
            "dpc": "03013417801",
            "name": "ណាល់ ពៅ"
        },
        {
            "barcode": "BBWS180202644",
            "dpc": "03013418001",
            "name": "គឹម ថង"
        },
        {
            "barcode": "BBWS180202645",
            "dpc": "03013418101",
            "name": "ជា យឹន"
        },
        {
            "barcode": "BBWS180202646",
            "dpc": "03013418201",
            "name": "កែង រ៉ា"
        },
        {
            "barcode": "BBWS180202647",
            "dpc": "03013418301",
            "name": "សេង សាត"
        },
        {
            "barcode": "BBWS180202648",
            "dpc": "03013418401",
            "name": "អែម សៀ"
        },
        {
            "barcode": "BBWS180202649",
            "dpc": "03013418501",
            "name": "ចៅ ឈឿត"
        },
        {
            "barcode": "BBWS180202650",
            "dpc": "03013418601",
            "name": "សំ សុធា"
        },
        {
            "barcode": "BBWS180202651",
            "dpc": "03013418701",
            "name": "ឃឹម កន្យាណ"
        },
        {
            "barcode": "BBWS180202652",
            "dpc": "03013418901",
            "name": "ណម គង់"
        },
        {
            "barcode": "BBWS180202653",
            "dpc": "03013419001",
            "name": "សឹម កំណត់"
        },
        {
            "barcode": "BBWS180202654",
            "dpc": "03013419201",
            "name": "យូ ចន្ថា"
        },
        {
            "barcode": "BBWS180202655",
            "dpc": "03013419301",
            "name": "ហាច គឹមហុង"
        },
        {
            "barcode": "BBWS180202656",
            "dpc": "03013419401",
            "name": "ស្រី បេង"
        },
        {
            "barcode": "BBWS180202657",
            "dpc": "03013419701",
            "name": "ចៅ លី"
        },
        {
            "barcode": "BBWS180202658",
            "dpc": "03013419801",
            "name": "ឃួយ ស៊ីម"
        },
        {
            "barcode": "BBWS180202659",
            "dpc": "03013419901",
            "name": "វ័រ ហេង"
        },
        {
            "barcode": "BBWS180202660",
            "dpc": "03013420001",
            "name": "យ៉ាំ បូ"
        },
        {
            "barcode": "BBWS180202661",
            "dpc": "03013420101",
            "name": "ចុង ជួយ"
        },
        {
            "barcode": "BBWS180202662",
            "dpc": "03013420201",
            "name": "ឈឿង សំណាង"
        },
        {
            "barcode": "BBWS180202663",
            "dpc": "03013420301",
            "name": "អំ សំអុន"
        },
        {
            "barcode": "BBWS180202664",
            "dpc": "03013420401",
            "name": "ឡោ រង់"
        },
        {
            "barcode": "BBWS180202665",
            "dpc": "03013420501",
            "name": "ហោ លី"
        },
        {
            "barcode": "BBWS180202666",
            "dpc": "03013420601",
            "name": "ស សុវណ្ណ"
        },
        {
            "barcode": "BBWS180202667",
            "dpc": "03013420701",
            "name": "ហោ គឹមតុល"
        },
        {
            "barcode": "BBWS180202668",
            "dpc": "03013420801",
            "name": "ចាន់ គឹមអន"
        },
        {
            "barcode": "BBWS180202669",
            "dpc": "03013420901",
            "name": "អេង មួយលី"
        },
        {
            "barcode": "BBWS180202670",
            "dpc": "03013421001",
            "name": "យឹន វុតធី"
        },
        {
            "barcode": "BBWS180202671",
            "dpc": "03013421101",
            "name": "ថែ  ឡាន់"
        },
        {
            "barcode": "BBWS180202672",
            "dpc": "03013421201",
            "name": "ផាន  ជៀម"
        },
        {
            "barcode": "BBWS180202673",
            "dpc": "03013421301",
            "name": "កោ  សុថា"
        },
        {
            "barcode": "BBWS180202674",
            "dpc": "03013421501",
            "name": "ឡាយ  រត្ន័"
        },
        {
            "barcode": "BBWS180202675",
            "dpc": "03013421601",
            "name": "ផាន  ភឿន"
        },
        {
            "barcode": "BBWS180202676",
            "dpc": "03013421801",
            "name": "ចៅ  និញ"
        },
        {
            "barcode": "BBWS180202677",
            "dpc": "03013422001",
            "name": "កេវ  រីជុំ"
        },
        {
            "barcode": "BBWS180202678",
            "dpc": "03013422101",
            "name": "ជែ  ជង់"
        },
        {
            "barcode": "BBWS180202679",
            "dpc": "03013422201",
            "name": "ប៉ោង  ម៉េង"
        },
        {
            "barcode": "BBWS180202680",
            "dpc": "03013422301",
            "name": "អនុវិទ្យាល័យ អូរដំបង ១"
        },
        {
            "barcode": "BBWS180202681",
            "dpc": "03013422401",
            "name": "ជិន  ចាន់រស្មី"
        },
        {
            "barcode": "BBWS180202682",
            "dpc": "03013422501",
            "name": "ចាន់  នូ"
        },
        {
            "barcode": "BBWS180202683",
            "dpc": "03013422601",
            "name": "យិង  កាង"
        },
        {
            "barcode": "BBWS180202684",
            "dpc": "03013422701",
            "name": "យិន  កុង"
        },
        {
            "barcode": "BBWS180202685",
            "dpc": "03013422801",
            "name": "ចៅ  សាន់ហ្វាត"
        },
        {
            "barcode": "BBWS180202686",
            "dpc": "03013422901",
            "name": "ឡាច  វឌ្ឍនៈ"
        },
        {
            "barcode": "BBWS180202687",
            "dpc": "03013423001",
            "name": "ជា  ហេង"
        },
        {
            "barcode": "BBWS180202688",
            "dpc": "03013423101",
            "name": "ជិន សាម៊ុយ"
        },
        {
            "barcode": "BBWS180202689",
            "dpc": "03013423201",
            "name": "ថ្លាង  សាវឿត"
        },
        {
            "barcode": "BBWS180202690",
            "dpc": "03013423301",
            "name": "កឹម  ឡុង"
        },
        {
            "barcode": "BBWS180202691",
            "dpc": "03013423401",
            "name": "ឈុន  ហុង"
        },
        {
            "barcode": "BBWS180202692",
            "dpc": "03013423601",
            "name": "ហម  គឹមឈួយ"
        },
        {
            "barcode": "BBWS180202693",
            "dpc": "03013423701",
            "name": "ឡាច  តូច"
        },
        {
            "barcode": "BBWS180202694",
            "dpc": "03013423801",
            "name": "ស្វាយ  ចំរ៉ាត់"
        },
        {
            "barcode": "BBWS180202695",
            "dpc": "03013423901",
            "name": "ជុំ  សំបូរ"
        },
        {
            "barcode": "BBWS180202696",
            "dpc": "03013424001",
            "name": "ណៃ  ហេង"
        },
        {
            "barcode": "BBWS180202697",
            "dpc": "03013424101",
            "name": "វឿន  សុផុន"
        },
        {
            "barcode": "BBWS180202698",
            "dpc": "03013424401",
            "name": "សួន  ឈៀង"
        },
        {
            "barcode": "BBWS180202699",
            "dpc": "03013424501",
            "name": "ហុង  គង់"
        },
        {
            "barcode": "BBWS180202700",
            "dpc": "03013424601",
            "name": "ឡុច  ហួរលាង"
        },
        {
            "barcode": "BBWS180202701",
            "dpc": "03013424701",
            "name": "ព្រឿង  ពៅ"
        },
        {
            "barcode": "BBWS180202702",
            "dpc": "03013424801",
            "name": "មឿន  ពុយ ៣"
        },
        {
            "barcode": "BBWS180202703",
            "dpc": "03013424901",
            "name": "មឿន  ពុយ ២"
        },
        {
            "barcode": "BBWS180202704",
            "dpc": "03013425001",
            "name": "ហម  រដ្ឋា"
        },
        {
            "barcode": "BBWS180202705",
            "dpc": "03013425101",
            "name": "និន  រិន"
        },
        {
            "barcode": "BBWS180202706",
            "dpc": "03013425201",
            "name": "យិម  ប៊ុនឆប"
        },
        {
            "barcode": "BBWS180202707",
            "dpc": "03013425301",
            "name": "ម៉ាក  ចិន"
        },
        {
            "barcode": "BBWS180202708",
            "dpc": "03013425401",
            "name": "ហៀង  សាវ៉ន"
        },
        {
            "barcode": "BBWS180202709",
            "dpc": "03013425501",
            "name": "ចាន់  អាន"
        },
        {
            "barcode": "BBWS180202710",
            "dpc": "03013425601",
            "name": "ជុំ  ណារិទ្ធ"
        },
        {
            "barcode": "BBWS180202711",
            "dpc": "03013425701",
            "name": "ហាក  ចំរើន"
        },
        {
            "barcode": "BBWS180202712",
            "dpc": "03013425801",
            "name": "ឌុច  គន្ធា"
        },
        {
            "barcode": "BBWS180202713",
            "dpc": "03013426001",
            "name": "ឡុច  ស៊ុន"
        },
        {
            "barcode": "BBWS180202714",
            "dpc": "03013426101",
            "name": "មាស  សាវឿត"
        },
        {
            "barcode": "BBWS180202715",
            "dpc": "03013426201",
            "name": "សួន  ហឿង"
        },
        {
            "barcode": "BBWS180202716",
            "dpc": "03013426301",
            "name": "លី  អូន"
        },
        {
            "barcode": "BBWS180202717",
            "dpc": "03013426401",
            "name": "ឡៅ  ហុង"
        },
        {
            "barcode": "BBWS180202718",
            "dpc": "03013426501",
            "name": "ឈីវ គង់"
        },
        {
            "barcode": "BBWS180202719",
            "dpc": "03013426601",
            "name": "ស៊ុយ  សុវត្ថារ៉ា"
        },
        {
            "barcode": "BBWS180202720",
            "dpc": "03013426701",
            "name": "កុយ  ម៉េង"
        },
        {
            "barcode": "BBWS180202721",
            "dpc": "03013426801",
            "name": "វរ័  ដារ៉ា"
        },
        {
            "barcode": "BBWS180202722",
            "dpc": "03013426901",
            "name": "លឹម  ស៊ីណា"
        },
        {
            "barcode": "BBWS180202723",
            "dpc": "03013427001",
            "name": "ហេង   សេត្ថា"
        },
        {
            "barcode": "BBWS180202724",
            "dpc": "03013427101",
            "name": "ដុស  ម៉ៅ"
        },
        {
            "barcode": "BBWS180202725",
            "dpc": "03013427201",
            "name": "ដុស  ផល"
        },
        {
            "barcode": "BBWS180202726",
            "dpc": "03013427301",
            "name": "គឹម  សុវណ្ណ"
        },
        {
            "barcode": "BBWS180202727",
            "dpc": "03013427401",
            "name": "ឈី  គឹមឆៃ"
        },
        {
            "barcode": "BBWS180202728",
            "dpc": "03013428201",
            "name": "ឌី  តុលា"
        },
        {
            "barcode": "BBWS180202729",
            "dpc": "03013428301",
            "name": "សៅ  ពិសិដ្ឋ"
        },
        {
            "barcode": "BBWS180202730",
            "dpc": "03013428501",
            "name": "ដាំ  សុង"
        },
        {
            "barcode": "BBWS180202731",
            "dpc": "03013428601",
            "name": "តាំង  ប៊ុនហឿម"
        },
        {
            "barcode": "BBWS180202732",
            "dpc": "03013429201",
            "name": "កែវ  ភិរុណ"
        },
        {
            "barcode": "BBWS180202733",
            "dpc": "03013429301",
            "name": "ឈឿន  ភេង"
        },
        {
            "barcode": "BBWS180202734",
            "dpc": "03013429401",
            "name": "ឌី  ចិន្តា"
        },
        {
            "barcode": "BBWS180202735",
            "dpc": "03013429601",
            "name": "អូច  ចាន់លី"
        },
        {
            "barcode": "BBWS180202736",
            "dpc": "03013429701",
            "name": "ផល  សុធា"
        },
        {
            "barcode": "BBWS180202737",
            "dpc": "03013429801",
            "name": "ប្រាក់  កូណាល់"
        },
        {
            "barcode": "BBWS180202738",
            "dpc": "03013429901",
            "name": "ជូន  លឿត"
        },
        {
            "barcode": "BBWS180202739",
            "dpc": "03013430001",
            "name": "ដុស  ពេញ"
        },
        {
            "barcode": "BBWS180202740",
            "dpc": "03013430101",
            "name": "ហាក់  ឡឹង"
        },
        {
            "barcode": "BBWS180202741",
            "dpc": "03013430201",
            "name": "អូច  ភី"
        },
        {
            "barcode": "BBWS180202742",
            "dpc": "03013430301",
            "name": "ស៊ឹម  ប៊ុនវី"
        },
        {
            "barcode": "BBWS180202743",
            "dpc": "03013430401",
            "name": "ញឹក  ផល្លា"
        },
        {
            "barcode": "BBWS180202744",
            "dpc": "03013430501",
            "name": "ហឹម  សុភាព"
        },
        {
            "barcode": "BBWS180202745",
            "dpc": "03013430601",
            "name": "សេង  ហ៊ត"
        },
        {
            "barcode": "BBWS180202746",
            "dpc": "03013430701",
            "name": "ហ៊ាន  ម៉ុនសុវណ្ណ"
        },
        {
            "barcode": "BBWS180202747",
            "dpc": "03013430801",
            "name": "យឿត  ប៊ុនយីម"
        },
        {
            "barcode": "BBWS180202748",
            "dpc": "03013430901",
            "name": "ធឿម  ធឿន"
        },
        {
            "barcode": "BBWS180202749",
            "dpc": "03013431001",
            "name": "ចាន់  ឌីភិរម្យ"
        },
        {
            "barcode": "BBWS180202750",
            "dpc": "03013431101",
            "name": "ខុង  សុវណ្ណ"
        },
        {
            "barcode": "BBWS180202751",
            "dpc": "03013431301",
            "name": "ហ៊ុយ  ចន្ថា"
        },
        {
            "barcode": "BBWS180202752",
            "dpc": "03013431401",
            "name": "ស៊ុម  សាន្ត"
        },
        {
            "barcode": "BBWS180202753",
            "dpc": "03013431501",
            "name": "តោ   ចន្ធូ"
        },
        {
            "barcode": "BBWS180202754",
            "dpc": "03013431601",
            "name": "ម៉ៅ  វិជិត"
        },
        {
            "barcode": "BBWS180202755",
            "dpc": "03013431701",
            "name": "ហែម  សុជាតិ"
        },
        {
            "barcode": "BBWS180202756",
            "dpc": "03013431901",
            "name": "េព្រឿង  ឃាន"
        },
        {
            "barcode": "BBWS180202757",
            "dpc": "03013432001",
            "name": "ជាង  លី"
        },
        {
            "barcode": "BBWS180202758",
            "dpc": "03013432101",
            "name": "ជា  វណ្ណា"
        },
        {
            "barcode": "BBWS180202759",
            "dpc": "03013432301",
            "name": "មិន  ណូយ"
        },
        {
            "barcode": "BBWS180202760",
            "dpc": "03013432401",
            "name": "ឈុត  សំណាង"
        },
        {
            "barcode": "BBWS180202761",
            "dpc": "03013432501",
            "name": "ហ៊ុល  គឹមហៀង"
        },
        {
            "barcode": "BBWS180202762",
            "dpc": "03013432601",
            "name": "ម៉ុក  យឿម"
        },
        {
            "barcode": "BBWS180202763",
            "dpc": "03013432901",
            "name": "ព្រំ  ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "BBWS180202764",
            "dpc": "03013433001",
            "name": "ឃី  សុភាព"
        },
        {
            "barcode": "BBWS180202765",
            "dpc": "03013433101",
            "name": "យូ  មេត្តា"
        },
        {
            "barcode": "BBWS180202766",
            "dpc": "03013433201",
            "name": "ព្រំ  មាសគ្រឹះស្នា"
        },
        {
            "barcode": "BBWS180202767",
            "dpc": "03013433301",
            "name": "ញ៉ុក  ចន្តា"
        },
        {
            "barcode": "BBWS180202768",
            "dpc": "03013433501",
            "name": "ឈុត  យ៉ាន"
        },
        {
            "barcode": "BBWS180202769",
            "dpc": "03013433601",
            "name": "សាត  សាលី"
        },
        {
            "barcode": "BBWS180202770",
            "dpc": "03013433701",
            "name": "កង  ចាន់សុធី"
        },
        {
            "barcode": "BBWS180202771",
            "dpc": "03013433801",
            "name": "ម៉ៅ  ណារិន"
        },
        {
            "barcode": "BBWS180202772",
            "dpc": "03013434001",
            "name": "កើត  ប៊ុនុឈើន"
        },
        {
            "barcode": "BBWS180202773",
            "dpc": "03013434101",
            "name": "ម៉ៅ  ណារឿន"
        },
        {
            "barcode": "BBWS180202774",
            "dpc": "03013434201",
            "name": "ជូប  ប៊ុនទៀង"
        },
        {
            "barcode": "BBWS180202775",
            "dpc": "03013434301",
            "name": "សោម  ហ៊ុន"
        },
        {
            "barcode": "BBWS180202776",
            "dpc": "03013434401",
            "name": "ប៉ូ  អូន"
        },
        {
            "barcode": "BBWS180202777",
            "dpc": "03013434501",
            "name": "ប៉ូ  សឿត"
        },
        {
            "barcode": "BBWS180202778",
            "dpc": "03013434601",
            "name": "ពុំ  នឹម"
        },
        {
            "barcode": "BBWS180202779",
            "dpc": "03013434701",
            "name": "គង់  សុខ"
        },
        {
            "barcode": "BBWS180202780",
            "dpc": "03013434901",
            "name": "កើត  សារិន"
        },
        {
            "barcode": "BBWS180202781",
            "dpc": "03013435001",
            "name": "ញឹក  ស៊ត"
        },
        {
            "barcode": "BBWS180202782",
            "dpc": "03013435101",
            "name": "ថង  ណយ"
        },
        {
            "barcode": "BBWS180202783",
            "dpc": "03013435201",
            "name": "សឿង  ទី"
        },
        {
            "barcode": "BBWS180202784",
            "dpc": "03013435301",
            "name": "ឡាំ  មឿន"
        },
        {
            "barcode": "BBWS180202785",
            "dpc": "03013435401",
            "name": "យាយ អូស្ត្រាលី"
        },
        {
            "barcode": "BBWS180202786",
            "dpc": "03013435501",
            "name": "ថាច់  ចិន្តា"
        },
        {
            "barcode": "BBWS180202787",
            "dpc": "03013435601",
            "name": "ហ៊ឹម  សុខុម"
        },
        {
            "barcode": "BBWS180202788",
            "dpc": "03013435701",
            "name": "យឹន  ឃុន"
        },
        {
            "barcode": "BBWS180202789",
            "dpc": "03013435801",
            "name": "យឹន ចាន់ណា"
        },
        {
            "barcode": "BBWS180202790",
            "dpc": "03013435901",
            "name": "ឆែម  ប៊ុនឈឹន"
        },
        {
            "barcode": "BBWS180202791",
            "dpc": "03013436001",
            "name": "ទ្រី  គឹមសួន"
        },
        {
            "barcode": "BBWS180202792",
            "dpc": "03013436101",
            "name": "ឡោះ  សាវុធ"
        },
        {
            "barcode": "BBWS180202793",
            "dpc": "03013436201",
            "name": "ឡោះ  សំណាង"
        },
        {
            "barcode": "BBWS180202794",
            "dpc": "03013436301",
            "name": "ឡុញ  ឌឿន"
        },
        {
            "barcode": "BBWS180202795",
            "dpc": "03013436401",
            "name": "សុខ  ប្រុស"
        },
        {
            "barcode": "BBWS180202796",
            "dpc": "03013436501",
            "name": "សី  ស៊ី"
        },
        {
            "barcode": "BBWS180202797",
            "dpc": "03013436601",
            "name": "ហឹម  ប៊ុនហឿន"
        },
        {
            "barcode": "BBWS180202798",
            "dpc": "03013436701",
            "name": "ប៊ុត  ស៊ីណា"
        },
        {
            "barcode": "BBWS180202799",
            "dpc": "03013436801",
            "name": "គឹម  ប៊ុនឈៀប ២"
        },
        {
            "barcode": "BBWS180202800",
            "dpc": "03013436901",
            "name": "ញ៉ែម  សំអឿន"
        },
        {
            "barcode": "BBWS180202801",
            "dpc": "03013437001",
            "name": "សេង  សុវណ្ណ"
        },
        {
            "barcode": "BBWS180202802",
            "dpc": "03013437101",
            "name": "ឡេង  បូរ៉ា"
        },
        {
            "barcode": "BBWS180202803",
            "dpc": "03013437201",
            "name": "ឡោ  ស៊ីនួន"
        },
        {
            "barcode": "BBWS180202804",
            "dpc": "03013437301",
            "name": "គង់  ឈួន"
        },
        {
            "barcode": "BBWS180202805",
            "dpc": "03013437401",
            "name": "សៀវ  រឿប"
        },
        {
            "barcode": "BBWS180202806",
            "dpc": "03013437501",
            "name": "សៅ  ស៊ីណា"
        },
        {
            "barcode": "BBWS180202807",
            "dpc": "03013437601",
            "name": "ស្ងួន  រៀប"
        },
        {
            "barcode": "BBWS180202808",
            "dpc": "03013437701",
            "name": "ហ៊ីន  រ៉ែម"
        },
        {
            "barcode": "BBWS180202809",
            "dpc": "03013437801",
            "name": "ឡោ  ណាល់"
        },
        {
            "barcode": "BBWS180202810",
            "dpc": "03013437901",
            "name": "សែន  ចំរើន"
        },
        {
            "barcode": "BBWS180202811",
            "dpc": "03013438001",
            "name": "សឹម  លី"
        },
        {
            "barcode": "BBWS180202812",
            "dpc": "03013438101",
            "name": "អេង  សុគន្ធា"
        },
        {
            "barcode": "BBWS180202813",
            "dpc": "03013438201",
            "name": "ផន  សុភាព"
        },
        {
            "barcode": "BBWS180202814",
            "dpc": "03013438301",
            "name": "លឿង  បូ"
        },
        {
            "barcode": "BBWS180202815",
            "dpc": "03013438401",
            "name": "ផល  សេងហ៊ួន"
        },
        {
            "barcode": "BBWS180202816",
            "dpc": "03013438501",
            "name": "ជុំំ  ណារិន"
        },
        {
            "barcode": "BBWS180202817",
            "dpc": "03013438601",
            "name": "ហ៊ឹម  យ៉ាន់"
        },
        {
            "barcode": "BBWS180202818",
            "dpc": "03013438701",
            "name": "ប៉ៅ  សបិន"
        },
        {
            "barcode": "BBWS180202819",
            "dpc": "03013438801",
            "name": "ផ្ទះ. ក. ភ.វត្តតាមិម​"
        },
        {
            "barcode": "BBWS180202820",
            "dpc": "03013438901",
            "name": "សេន  សុធី"
        },
        {
            "barcode": "BBWS180202821",
            "dpc": "03013439001",
            "name": "ហួត  ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180202822",
            "dpc": "03013439101",
            "name": "យឹប   គង់"
        },
        {
            "barcode": "BBWS180202823",
            "dpc": "03013439201",
            "name": "មឿត  ស្រីមុំ"
        },
        {
            "barcode": "BBWS180202824",
            "dpc": "03013439301",
            "name": "ស  សារ៉ុន"
        },
        {
            "barcode": "BBWS180202825",
            "dpc": "03013439401",
            "name": "ម៉ៅ  មឿត"
        },
        {
            "barcode": "BBWS180202826",
            "dpc": "03013439501",
            "name": "តិ  ហុង"
        },
        {
            "barcode": "BBWS180202827",
            "dpc": "03013439601",
            "name": "តិ  ហ៊ុយ"
        },
        {
            "barcode": "BBWS180202828",
            "dpc": "03013439701",
            "name": "អ៊ុំ  មៀន"
        },
        {
            "barcode": "BBWS180202829",
            "dpc": "03013439801",
            "name": "សារុំ  ចាន់ថា"
        },
        {
            "barcode": "BBWS180202830",
            "dpc": "03013439901",
            "name": "នួម  ណារី"
        },
        {
            "barcode": "BBWS180202831",
            "dpc": "03013440001",
            "name": "តូច  ជុំ"
        },
        {
            "barcode": "BBWS180202832",
            "dpc": "03013440101",
            "name": "ម៉ៅ  វណ្ណនី"
        },
        {
            "barcode": "BBWS180202833",
            "dpc": "03013440201",
            "name": "ញ៉ែម  ជាបឡេង"
        },
        {
            "barcode": "BBWS180202834",
            "dpc": "03013440301",
            "name": "ឈន   វណ្ណឌី"
        },
        {
            "barcode": "BBWS180202835",
            "dpc": "03013440401",
            "name": "ហូរ  ឈុន"
        },
        {
            "barcode": "BBWS180202836",
            "dpc": "03013440501",
            "name": "លី  រដ្ឋា"
        },
        {
            "barcode": "BBWS180202837",
            "dpc": "03013440601",
            "name": "យ៉ាត  ជឿត"
        },
        {
            "barcode": "BBWS180202838",
            "dpc": "03013440701",
            "name": "គង់  ស៊ីយ៉ូន"
        },
        {
            "barcode": "BBWS180202839",
            "dpc": "03013440801",
            "name": "វ៉ាន  ប៊ុនឆៃ"
        },
        {
            "barcode": "BBWS180202840",
            "dpc": "03013440901",
            "name": "ផាត  ភារៈ"
        },
        {
            "barcode": "BBWS180202841",
            "dpc": "03013441001",
            "name": "ផាត  សាន្តប៉ា"
        },
        {
            "barcode": "BBWS180202842",
            "dpc": "03013441101",
            "name": "សាន់  ចិត្ត"
        },
        {
            "barcode": "BBWS180202843",
            "dpc": "03013441201",
            "name": "គង់  សុគន្ធី"
        },
        {
            "barcode": "BBWS180202844",
            "dpc": "03013441301",
            "name": "ចាប  ជេតនា"
        },
        {
            "barcode": "BBWS180202845",
            "dpc": "03013441401",
            "name": "គង់  សំណាង"
        },
        {
            "barcode": "BBWS180202846",
            "dpc": "03013441501",
            "name": "សុខ  អេង"
        },
        {
            "barcode": "BBWS180202847",
            "dpc": "03013441601",
            "name": "ឆាយ  កុសល"
        },
        {
            "barcode": "BBWS180202848",
            "dpc": "03013441701",
            "name": "ចែ  សៀកគីម"
        },
        {
            "barcode": "BBWS180202849",
            "dpc": "03013441801",
            "name": "ហេង  ហម"
        },
        {
            "barcode": "BBWS180202850",
            "dpc": "03013441901",
            "name": "ឡុច  វន"
        },
        {
            "barcode": "BBWS180202851",
            "dpc": "03013442001",
            "name": "វឿត  សម្ផស្ស"
        },
        {
            "barcode": "BBWS180202852",
            "dpc": "03013442101",
            "name": "មាស  សំអឿន"
        },
        {
            "barcode": "BBWS180202853",
            "dpc": "03013442201",
            "name": "ហ៊ុន  ធើន"
        },
        {
            "barcode": "BBWS180202854",
            "dpc": "03013442301",
            "name": "មាស  ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180202855",
            "dpc": "03013442401",
            "name": "សើ  ប៊ុននឿន"
        },
        {
            "barcode": "BBWS180202856",
            "dpc": "03013442501",
            "name": "ព្រហ្ម  ស៊ីណាត"
        },
        {
            "barcode": "BBWS180202857",
            "dpc": "03013442601",
            "name": "ផា  សូវ"
        },
        {
            "barcode": "BBWS180202858",
            "dpc": "03013442701",
            "name": "រស់  សារ៉ុន"
        },
        {
            "barcode": "BBWS180202859",
            "dpc": "03013442801",
            "name": "តាន់  ហុងលឹម"
        },
        {
            "barcode": "BBWS180202860",
            "dpc": "03013442901",
            "name": "លឹម  ហឿម"
        },
        {
            "barcode": "BBWS180202861",
            "dpc": "03013443001",
            "name": "កេត  សារិទ្ធ"
        },
        {
            "barcode": "BBWS180202862",
            "dpc": "03013443201",
            "name": "រ៉ាយ ភីរម្យ"
        },
        {
            "barcode": "BBWS180202863",
            "dpc": "03013443301",
            "name": "ម៉ា  ទីនេ"
        },
        {
            "barcode": "BBWS180202864",
            "dpc": "03013443401",
            "name": "រឿន   ប៊ុនរ៉ាត់"
        },
        {
            "barcode": "BBWS180202865",
            "dpc": "03013443501",
            "name": "ប៊ូ  ថា"
        },
        {
            "barcode": "BBWS180202866",
            "dpc": "03013443601",
            "name": "ឈ  សាវ៉ុន"
        },
        {
            "barcode": "BBWS180202867",
            "dpc": "03013443701",
            "name": "លឹម ចាន់ដារ៉ា"
        },
        {
            "barcode": "BBWS180202868",
            "dpc": "03013443801",
            "name": "គឹម  វ៉ានថា"
        },
        {
            "barcode": "BBWS180202869",
            "dpc": "03013443901",
            "name": "ថុន  បាន"
        },
        {
            "barcode": "BBWS180202870",
            "dpc": "03013444101",
            "name": "វ៉ាន  តារ៉ា"
        },
        {
            "barcode": "BBWS180202871",
            "dpc": "03013444201",
            "name": "ផាន  សំណាង"
        },
        {
            "barcode": "BBWS180202872",
            "dpc": "03013444301",
            "name": "ផាន  រ៉ា"
        },
        {
            "barcode": "BBWS180202873",
            "dpc": "03013444501",
            "name": "ជៀម  សេង"
        },
        {
            "barcode": "BBWS180202874",
            "dpc": "03013444601",
            "name": "តូយ  ស្រីមុំ"
        },
        {
            "barcode": "BBWS180202875",
            "dpc": "03013444701",
            "name": "ណាត  ចិន្តា"
        },
        {
            "barcode": "BBWS180202876",
            "dpc": "03013444801",
            "name": "ថើន  ដួងចន្ទ័"
        },
        {
            "barcode": "BBWS180202877",
            "dpc": "03013445001",
            "name": "ម៉ាប់  កេត"
        },
        {
            "barcode": "BBWS180202878",
            "dpc": "03013445201",
            "name": "ម៉ក ប៊ុនទិត្យ"
        },
        {
            "barcode": "BBWS180202879",
            "dpc": "03013445501",
            "name": "លាស់  ហាង"
        },
        {
            "barcode": "BBWS180202880",
            "dpc": "03013445601",
            "name": "ជា  ម៉េង"
        },
        {
            "barcode": "BBWS180202881",
            "dpc": "03013445801",
            "name": "លី  ខ្លឿន"
        },
        {
            "barcode": "BBWS180202882",
            "dpc": "03013445901",
            "name": "តឹក  សាវង្ស"
        },
        {
            "barcode": "BBWS180202883",
            "dpc": "03013446201",
            "name": "ហូរ   ផានី"
        },
        {
            "barcode": "BBWS180202884",
            "dpc": "03013446301",
            "name": "អឿ  កំសាន្ត"
        },
        {
            "barcode": "BBWS180202885",
            "dpc": "03013446401",
            "name": "ខួញ  សាម៉េត"
        },
        {
            "barcode": "BBWS180202886",
            "dpc": "03013446501",
            "name": "ញ៉ែម  សំណាង"
        },
        {
            "barcode": "BBWS180202887",
            "dpc": "03013446601",
            "name": "ប៊ុត  សុធី"
        },
        {
            "barcode": "BBWS180202888",
            "dpc": "03013446701",
            "name": "ហាយ  សំណាង"
        },
        {
            "barcode": "BBWS180202889",
            "dpc": "03013446801",
            "name": "ណន  ម៉ៅ"
        },
        {
            "barcode": "BBWS180202890",
            "dpc": "03013446901",
            "name": "តឿ  សាវុន"
        },
        {
            "barcode": "BBWS180202891",
            "dpc": "03013447001",
            "name": "ភោ ស៊ីថា"
        },
        {
            "barcode": "BBWS180202892",
            "dpc": "03013447101",
            "name": "ភោ សម្បត្តិ"
        },
        {
            "barcode": "BBWS180202893",
            "dpc": "03013447201",
            "name": "នី អេង"
        },
        {
            "barcode": "BBWS180202894",
            "dpc": "03013447301",
            "name": "មឿន  ម៉ារ័ត្ន"
        },
        {
            "barcode": "BBWS180202895",
            "dpc": "03013447501",
            "name": "រឿន ទឿម"
        },
        {
            "barcode": "BBWS180202896",
            "dpc": "03013447701",
            "name": "ខិល លឿ"
        },
        {
            "barcode": "BBWS180202897",
            "dpc": "03013447801",
            "name": "មឿន សិត"
        },
        {
            "barcode": "BBWS180202898",
            "dpc": "03013447901",
            "name": "វ៉ាត សុហេង"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
