let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=

    [
        {
            "barcode": "BBWS180203241",
            "dpc": "03023500201",
            "name": "យូ ថៃ"
        },
        {
            "barcode": "BBWS180203242",
            "dpc": "03023500301",
            "name": "អ៊ុក រ៉ាន់"
        },
        {
            "barcode": "BBWS180203243",
            "dpc": "03023500401",
            "name": "ន៉ូ ចាន់ណារី"
        },
        {
            "barcode": "BBWS180203244",
            "dpc": "03023500501",
            "name": "ចៅ សំរិត"
        },
        {
            "barcode": "BBWS180203245",
            "dpc": "03023500601",
            "name": "ហេង គឹមសួ"
        },
        {
            "barcode": "BBWS180203246",
            "dpc": "03023500701",
            "name": "ហុក គីម"
        },
        {
            "barcode": "BBWS180203247",
            "dpc": "03023500801",
            "name": "ហ៊ួន ឃុត"
        },
        {
            "barcode": "BBWS180203248",
            "dpc": "03023500901",
            "name": "ទ្រី ភក្តី"
        },
        {
            "barcode": "BBWS180203249",
            "dpc": "03023501001",
            "name": "សៀង មុំ"
        },
        {
            "barcode": "BBWS180203250",
            "dpc": "03023501101",
            "name": "សែម សំអាត"
        },
        {
            "barcode": "BBWS180203251",
            "dpc": "03023501201",
            "name": "សយ សម្ជស្ស"
        },
        {
            "barcode": "BBWS180203252",
            "dpc": "03023501301",
            "name": "ម៉ៅ សាម៉ុយ"
        },
        {
            "barcode": "BBWS180203253",
            "dpc": "03023501401",
            "name": "ម៉ៅ វិចិត្រ"
        },
        {
            "barcode": "BBWS180203254",
            "dpc": "03023501501",
            "name": "លី រ៉ាសាត"
        },
        {
            "barcode": "BBWS180203255",
            "dpc": "03023501701",
            "name": "ឆាយ ផាត"
        },
        {
            "barcode": "BBWS180203256",
            "dpc": "03023501801",
            "name": "ឃឿន សំ"
        },
        {
            "barcode": "BBWS180203257",
            "dpc": "03023501901",
            "name": "អ៊ួច ឪរ៉ាល់"
        },
        {
            "barcode": "BBWS180203258",
            "dpc": "03023502001",
            "name": "គង់ ប៊ុនលី"
        },
        {
            "barcode": "BBWS180203259",
            "dpc": "03023502101",
            "name": "ហេង ឡុង"
        },
        {
            "barcode": "BBWS180203260",
            "dpc": "03023502201",
            "name": "សាត សុខា"
        },
        {
            "barcode": "BBWS180203261",
            "dpc": "03023502301",
            "name": "ផុន សំ"
        },
        {
            "barcode": "BBWS180203262",
            "dpc": "03023502401",
            "name": "ញ៉ឹក សាគុណ"
        },
        {
            "barcode": "BBWS180203263",
            "dpc": "03023502601",
            "name": "ពេជ្រ ចាន់ដារ៉ា"
        },
        {
            "barcode": "BBWS180203264",
            "dpc": "03023502701",
            "name": "ឯក កុសល់"
        },
        {
            "barcode": "BBWS180203265",
            "dpc": "03023502801",
            "name": "កែវ សុខសាន្ត"
        },
        {
            "barcode": "BBWS180203266",
            "dpc": "03023502901",
            "name": "ដាំ សារុន"
        },
        {
            "barcode": "BBWS180203267",
            "dpc": "03023503001",
            "name": "នង មាសរិទ្ធិ"
        },
        {
            "barcode": "BBWS180203268",
            "dpc": "03023503101",
            "name": "ឈិត ឆោម"
        },
        {
            "barcode": "BBWS180203269",
            "dpc": "03023503201",
            "name": "ណន នី"
        },
        {
            "barcode": "BBWS180203270",
            "dpc": "03023503301",
            "name": "កុក ហាន"
        },
        {
            "barcode": "BBWS180203271",
            "dpc": "03023503401",
            "name": "យ៉ូ អាលីស្សា"
        },
        {
            "barcode": "BBWS180203272",
            "dpc": "03023503601",
            "name": "ដិប គឹមនី"
        },
        {
            "barcode": "BBWS180203273",
            "dpc": "03023503701",
            "name": "ទៀប វិរ:"
        },
        {
            "barcode": "BBWS180203274",
            "dpc": "03023503801",
            "name": "វង្ស ចំរើន"
        },
        {
            "barcode": "BBWS180203275",
            "dpc": "03023503901",
            "name": "ចាន់ វិច្ចិកា"
        },
        {
            "barcode": "BBWS180203276",
            "dpc": "03023504001",
            "name": "វ៉ាន់ ហម"
        },
        {
            "barcode": "BBWS180203277",
            "dpc": "03023504101",
            "name": "គី យូឡុង"
        },
        {
            "barcode": "BBWS180203278",
            "dpc": "03023504201",
            "name": "ព្រហ្ម សេរីបុត្រ"
        },
        {
            "barcode": "BBWS180203279",
            "dpc": "03023504301",
            "name": "សោម ពិសិដ្ធ"
        },
        {
            "barcode": "BBWS180203280",
            "dpc": "03023504401",
            "name": "ទេស ឈមុសាម៉ុន"
        },
        {
            "barcode": "BBWS180203281",
            "dpc": "03023504501",
            "name": "ជ័យ សារី"
        },
        {
            "barcode": "BBWS180203282",
            "dpc": "03023504601",
            "name": "សួន សានិត"
        },
        {
            "barcode": "BBWS180203283",
            "dpc": "03023504701",
            "name": "ម៉ុម សឿន"
        },
        {
            "barcode": "BBWS180203284",
            "dpc": "03023504801",
            "name": "ស៊ុន គង់"
        },
        {
            "barcode": "BBWS180203285",
            "dpc": "03023504901",
            "name": "ស្តង់ លេខ៧១"
        },
        {
            "barcode": "BBWS180203286",
            "dpc": "03023505001",
            "name": "ប៉ាល ស្រីលក្ខ"
        },
        {
            "barcode": "BBWS180203287",
            "dpc": "03023505101",
            "name": "សឿត តឿ"
        },
        {
            "barcode": "BBWS180203288",
            "dpc": "03023505201",
            "name": "​ប្រាក់ សុទ្ទដារ៉ា"
        },
        {
            "barcode": "BBWS180203289",
            "dpc": "03023505301",
            "name": "វ៉ាន់ រត្ន័"
        },
        {
            "barcode": "BBWS180203290",
            "dpc": "03023505501",
            "name": "ចាន់ សារិន"
        },
        {
            "barcode": "BBWS180203291",
            "dpc": "03023505601",
            "name": "យ៉ាត ពៅ"
        },
        {
            "barcode": "BBWS180203292",
            "dpc": "03023505701",
            "name": "ពោធិ មានរិទ្ធ"
        },
        {
            "barcode": "BBWS180203293",
            "dpc": "03023505801",
            "name": "តុន សុគុណ"
        },
        {
            "barcode": "BBWS180203294",
            "dpc": "03023505901",
            "name": "ប្រាក់ ណាវី"
        },
        {
            "barcode": "BBWS180203295",
            "dpc": "03023506001",
            "name": "ឡង អឿន"
        },
        {
            "barcode": "BBWS180203296",
            "dpc": "03023506101",
            "name": "ប្រាក់ ឌារ៉ា"
        },
        {
            "barcode": "BBWS180203297",
            "dpc": "03023506201",
            "name": "សុខ សឿន"
        },
        {
            "barcode": "BBWS180203298",
            "dpc": "03023506301",
            "name": "ប៉ា យ៉ន"
        },
        {
            "barcode": "BBWS180203299",
            "dpc": "03023506401",
            "name": "ពៅ ណាវី"
        },
        {
            "barcode": "BBWS180203300",
            "dpc": "03023506501",
            "name": "សារ ភក្តី"
        },
        {
            "barcode": "BBWS180203301",
            "dpc": "03023506601",
            "name": "ហៀង ហ៊ុច"
        },
        {
            "barcode": "BBWS180203302",
            "dpc": "03023506701",
            "name": "ពេញ សុន"
        },
        {
            "barcode": "BBWS180203303",
            "dpc": "03023506801",
            "name": "ខោល ពៅ"
        },
        {
            "barcode": "BBWS180203304",
            "dpc": "03023506901",
            "name": "ខោល មីឌី"
        },
        {
            "barcode": "BBWS180203305",
            "dpc": "03023507001",
            "name": "គឹម ស្រ៊ុន"
        },
        {
            "barcode": "BBWS180203306",
            "dpc": "03023507101",
            "name": "ឃួន ចំរើន"
        },
        {
            "barcode": "BBWS180203307",
            "dpc": "03023507201",
            "name": "ចាន់ សួរ"
        },
        {
            "barcode": "BBWS180203308",
            "dpc": "03023507301",
            "name": "ញ៊ឹក សុខា"
        },
        {
            "barcode": "BBWS180203309",
            "dpc": "03023507401",
            "name": "ថុល ស៊ីថាត"
        },
        {
            "barcode": "BBWS180203310",
            "dpc": "03023507501",
            "name": "បូ ភី២"
        },
        {
            "barcode": "BBWS180203311",
            "dpc": "03023507601",
            "name": "ឈឹម ស៊ី"
        },
        {
            "barcode": "BBWS180203312",
            "dpc": "03023507701",
            "name": "បាន ឡង"
        },
        {
            "barcode": "BBWS180203313",
            "dpc": "03023507801",
            "name": "ណី ស្រីដា"
        },
        {
            "barcode": "BBWS180203314",
            "dpc": "03023507901",
            "name": "គីម សុខនី"
        },
        {
            "barcode": "BBWS180203315",
            "dpc": "03023508001",
            "name": "សុខ សាវ៉ាត"
        },
        {
            "barcode": "BBWS180203316",
            "dpc": "03023508101",
            "name": "លឹម ហេង"
        },
        {
            "barcode": "BBWS180203317",
            "dpc": "03023508201",
            "name": "សុះ សុខគី"
        },
        {
            "barcode": "BBWS180203318",
            "dpc": "03023508301",
            "name": "សេន រ៉ាវី"
        },
        {
            "barcode": "BBWS180203319",
            "dpc": "03023508401",
            "name": "ហង ម៉ាន់"
        },
        {
            "barcode": "BBWS180203320",
            "dpc": "03023508501",
            "name": "លឿន ម៉ាទីនី"
        },
        {
            "barcode": "BBWS180203321",
            "dpc": "03023508601",
            "name": "សំ អូន"
        },
        {
            "barcode": "BBWS180203322",
            "dpc": "03023508701",
            "name": "ជុំ ផល្លី"
        },
        {
            "barcode": "BBWS180203323",
            "dpc": "03023508801",
            "name": "សាវី ម៉ូហាំម៉ាត"
        },
        {
            "barcode": "BBWS180203324",
            "dpc": "03023508901",
            "name": "ហក់ សាហ្វី"
        },
        {
            "barcode": "BBWS180203325",
            "dpc": "03023509001",
            "name": "ឡោះ អ៊ីសើ"
        },
        {
            "barcode": "BBWS180203326",
            "dpc": "03023509101",
            "name": "ឯល សាហ្វី"
        },
        {
            "barcode": "BBWS180203327",
            "dpc": "03023509201",
            "name": "សារ៉ូ សាលី"
        },
        {
            "barcode": "BBWS180203328",
            "dpc": "03023509301",
            "name": "ម៉ាត់ លី"
        },
        {
            "barcode": "BBWS180203329",
            "dpc": "03023509401",
            "name": "ស៊ុប រីម"
        },
        {
            "barcode": "BBWS180203330",
            "dpc": "03023509501",
            "name": "រ៉េះ ជា"
        },
        {
            "barcode": "BBWS180203331",
            "dpc": "03023509601",
            "name": "ទូច អាស៊ីយ៉ាល់"
        },
        {
            "barcode": "BBWS180203332",
            "dpc": "03023509701",
            "name": "ហ៊ីម សាលី"
        },
        {
            "barcode": "BBWS180203333",
            "dpc": "03023509801",
            "name": "ស៊ុប ហ្វាត់"
        },
        {
            "barcode": "BBWS180203334",
            "dpc": "03023509901",
            "name": "គង់ សុវណ្ណ"
        },
        {
            "barcode": "BBWS180203335",
            "dpc": "03023510001",
            "name": "ទី ម៉ារីសា"
        },
        {
            "barcode": "BBWS180203336",
            "dpc": "03023510101",
            "name": "ម៉ាត់ អ៊ីសើ"
        },
        {
            "barcode": "BBWS180203337",
            "dpc": "03023510201",
            "name": "ឡេះ ម៉ាត់តែម"
        },
        {
            "barcode": "BBWS180203338",
            "dpc": "03023510301",
            "name": "ឡោ វណ្ណដា"
        },
        {
            "barcode": "BBWS180203339",
            "dpc": "03023510401",
            "name": "លី រ៉ូហ្សាល"
        },
        {
            "barcode": "BBWS180203340",
            "dpc": "03023510501",
            "name": "អ៊ឹង ធៀនប៉ាវ"
        },
        {
            "barcode": "BBWS180203341",
            "dpc": "03023510601",
            "name": "ឡឹប យើ"
        },
        {
            "barcode": "BBWS180203342",
            "dpc": "03023510701",
            "name": "យល់ វុទ្ធី"
        },
        {
            "barcode": "BBWS180203343",
            "dpc": "03023510801",
            "name": "អ៊ឹម សុត្តា"
        },
        {
            "barcode": "BBWS180203344",
            "dpc": "03023510901",
            "name": "សុទ្ធ វាសនា"
        },
        {
            "barcode": "BBWS180203345",
            "dpc": "03023511001",
            "name": "ធឿម គឹមលាង"
        },
        {
            "barcode": "BBWS180203346",
            "dpc": "03023511101",
            "name": "កឹម ផល្លា"
        },
        {
            "barcode": "BBWS180203347",
            "dpc": "03023511201",
            "name": "ធឿន ចាន់ថា"
        },
        {
            "barcode": "BBWS180203348",
            "dpc": "03023511301",
            "name": "កែវ សិទ្ធ"
        },
        {
            "barcode": "BBWS180203349",
            "dpc": "03023511401",
            "name": "ស៊ីន ស៊ីវន"
        },
        {
            "barcode": "BBWS180203350",
            "dpc": "03023511501",
            "name": "ស៊ុន ស្នា"
        },
        {
            "barcode": "BBWS180203351",
            "dpc": "03023511601",
            "name": "ស្មាន់ វីរ៉ូ"
        },
        {
            "barcode": "BBWS180203352",
            "dpc": "03023511701",
            "name": "ខ្លូត សារ៉ាត់"
        },
        {
            "barcode": "BBWS180203353",
            "dpc": "03023511801",
            "name": "ប៉ិល វិសារ"
        },
        {
            "barcode": "BBWS180203354",
            "dpc": "03023511901",
            "name": "សុខ ប៊ិន"
        },
        {
            "barcode": "BBWS180203355",
            "dpc": "03023512001",
            "name": "ម៉ោញ ណាល់"
        },
        {
            "barcode": "BBWS180203356",
            "dpc": "03023512101",
            "name": "លី ហេងណាំអេង"
        },
        {
            "barcode": "BBWS180203357",
            "dpc": "03023512201",
            "name": "តែល នុច"
        },
        {
            "barcode": "BBWS180203358",
            "dpc": "03023512301",
            "name": "ហម សុធី"
        },
        {
            "barcode": "BBWS180203359",
            "dpc": "03023512401",
            "name": "សាប់ សារេត"
        },
        {
            "barcode": "BBWS180203360",
            "dpc": "03023512501",
            "name": "លឿម ភេន"
        },
        {
            "barcode": "BBWS180203361",
            "dpc": "03023512601",
            "name": "យិប ភី"
        },
        {
            "barcode": "BBWS180203362",
            "dpc": "03023512701",
            "name": "ងួន ឃាន"
        },
        {
            "barcode": "BBWS180203363",
            "dpc": "03023512901",
            "name": "លឹម ធិចហ៊ុន"
        },
        {
            "barcode": "BBWS180203364",
            "dpc": "03023513001",
            "name": "ហម សម្បត្តិ"
        },
        {
            "barcode": "BBWS180203365",
            "dpc": "03023513101",
            "name": "ជួន សាវង្ស"
        },
        {
            "barcode": "BBWS180203366",
            "dpc": "03023513201",
            "name": "សួង រី"
        },
        {
            "barcode": "BBWS180203367",
            "dpc": "03023513401",
            "name": "មាន និច្ច"
        },
        {
            "barcode": "BBWS180203368",
            "dpc": "03023513601",
            "name": "ឌី នាង"
        },
        {
            "barcode": "BBWS180203369",
            "dpc": "03023513701",
            "name": "ណូ សេន"
        },
        {
            "barcode": "BBWS180203370",
            "dpc": "03023513801",
            "name": "ឌុច ផន"
        },
        {
            "barcode": "BBWS180203371",
            "dpc": "03023513901",
            "name": "ប្រាក់ ផាន់នី"
        },
        {
            "barcode": "BBWS180203372",
            "dpc": "03023514001",
            "name": "កាន់ កង"
        },
        {
            "barcode": "BBWS180203373",
            "dpc": "03023514101",
            "name": "មុន មុំ"
        },
        {
            "barcode": "BBWS180203374",
            "dpc": "03023514201",
            "name": "អ៊ុន សុគុណ"
        },
        {
            "barcode": "BBWS180203375",
            "dpc": "03023514301",
            "name": "ហ៊ួន នៅ"
        },
        {
            "barcode": "BBWS180203376",
            "dpc": "03023514401",
            "name": "យ៉ន សារុន"
        },
        {
            "barcode": "BBWS180203377",
            "dpc": "03023514501",
            "name": "ឃុន ថាវ"
        },
        {
            "barcode": "BBWS180203378",
            "dpc": "03023514601",
            "name": "ផ្លោក សាវ៉ាង"
        },
        {
            "barcode": "BBWS180203379",
            "dpc": "03023514701",
            "name": "មុត វ៉ាន់"
        },
        {
            "barcode": "BBWS180203380",
            "dpc": "03023514801",
            "name": "វិន ដា"
        },
        {
            "barcode": "BBWS180203381",
            "dpc": "03023514901",
            "name": "ប្រាក់ សន"
        },
        {
            "barcode": "BBWS180203382",
            "dpc": "03023515101",
            "name": "ជា​ ដារ៉ា"
        },
        {
            "barcode": "BBWS180203383",
            "dpc": "03023515201",
            "name": "ញ៊ីម ស៊ីនួន"
        },
        {
            "barcode": "BBWS180203384",
            "dpc": "03023515301",
            "name": "យ៉ុន រឿត"
        },
        {
            "barcode": "BBWS180203385",
            "dpc": "03023515401",
            "name": "ជា ជឿន"
        },
        {
            "barcode": "BBWS180203386",
            "dpc": "03023515501",
            "name": "គង់ សុខ"
        },
        {
            "barcode": "BBWS180203387",
            "dpc": "03023515601",
            "name": "វ៉ាន់ ណារិទ្ធ"
        },
        {
            "barcode": "BBWS180203388",
            "dpc": "03023515701",
            "name": "លី នានិត"
        },
        {
            "barcode": "BBWS180203389",
            "dpc": "03023515801",
            "name": "ស៊ី រីវណ្ណី"
        },
        {
            "barcode": "BBWS180203390",
            "dpc": "03023515901",
            "name": "ថោ វណ្ណ"
        },
        {
            "barcode": "BBWS180203391",
            "dpc": "03023516001",
            "name": "ស៊ុត សុវណ្ណ"
        },
        {
            "barcode": "BBWS180203392",
            "dpc": "03023516101",
            "name": "ស៊ុត គីមលីន"
        },
        {
            "barcode": "BBWS180203393",
            "dpc": "03023516201",
            "name": "លី ដាវី"
        },
        {
            "barcode": "BBWS180203394",
            "dpc": "03023516301",
            "name": "លី ដា"
        },
        {
            "barcode": "BBWS180203395",
            "dpc": "03023516401",
            "name": "ប៉ុល ង៉ូវ"
        },
        {
            "barcode": "BBWS180203396",
            "dpc": "03023516501",
            "name": "សែម ពន្លក"
        },
        {
            "barcode": "BBWS180203397",
            "dpc": "03023516601",
            "name": "ស៊ិន កីនី"
        },
        {
            "barcode": "BBWS180203398",
            "dpc": "03023516801",
            "name": "យឿប វីរះ"
        },
        {
            "barcode": "BBWS180203399",
            "dpc": "03023516901",
            "name": "ឡុង ស៊ីថា"
        },
        {
            "barcode": "BBWS180203400",
            "dpc": "03023517001",
            "name": "កុយ ណាឫទ្ធិ"
        },
        {
            "barcode": "BBWS180203401",
            "dpc": "03023517101",
            "name": "ម៉ូត សារីយ៉ា"
        },
        {
            "barcode": "BBWS180203402",
            "dpc": "03023517201",
            "name": "មឿន រ័នណា"
        },
        {
            "barcode": "BBWS180203403",
            "dpc": "03023517301",
            "name": "មឿន សុម៉ាត្រា"
        },
        {
            "barcode": "BBWS180203404",
            "dpc": "03023517401",
            "name": "ឯម សំអឿន"
        },
        {
            "barcode": "BBWS180203405",
            "dpc": "03023517501",
            "name": "សំ រ៉ាត់"
        },
        {
            "barcode": "BBWS180203406",
            "dpc": "03023517601",
            "name": "ឃឹម ចំរើន"
        },
        {
            "barcode": "BBWS180203407",
            "dpc": "03023517701",
            "name": "ចាន់ អេង"
        },
        {
            "barcode": "BBWS180203408",
            "dpc": "03023517801",
            "name": "មាស សារុន"
        },
        {
            "barcode": "BBWS180203409",
            "dpc": "03023517901",
            "name": "ងឿប ណាត"
        },
        {
            "barcode": "BBWS180203410",
            "dpc": "03023518001",
            "name": "សា សើរ"
        },
        {
            "barcode": "BBWS180203411",
            "dpc": "03023518101",
            "name": "លឹម​ ប៊ូឡា"
        },
        {
            "barcode": "BBWS180203412",
            "dpc": "03023518201",
            "name": "មល់ បុប្ជា"
        },
        {
            "barcode": "BBWS180203413",
            "dpc": "03023518301",
            "name": "ជា សិទ្ធិ១"
        },
        {
            "barcode": "BBWS180203414",
            "dpc": "03023518401",
            "name": "ជា ឆនណារិទ្ធ"
        },
        {
            "barcode": "BBWS180203415",
            "dpc": "03023518501",
            "name": "យួម ម៉ៅ"
        },
        {
            "barcode": "BBWS180203416",
            "dpc": "03023518601",
            "name": "ជា ណារិន"
        },
        {
            "barcode": "BBWS180203417",
            "dpc": "03023518701",
            "name": "ឡុង សីលា"
        },
        {
            "barcode": "BBWS180203418",
            "dpc": "03023518801",
            "name": "ឃឿត ទូច"
        },
        {
            "barcode": "BBWS180203419",
            "dpc": "03023519001",
            "name": "ឈួ ហាក់គាង"
        },
        {
            "barcode": "BBWS180203420",
            "dpc": "03023519101",
            "name": "វណ្ណា ចំរើន"
        },
        {
            "barcode": "BBWS180203421",
            "dpc": "03023519201",
            "name": "នូ ធារឿន"
        },
        {
            "barcode": "BBWS180203422",
            "dpc": "03023519301",
            "name": "ទិត្យ សុផាន"
        },
        {
            "barcode": "BBWS180203423",
            "dpc": "03023519501",
            "name": "ប៉ាង ភីរម្យ"
        },
        {
            "barcode": "BBWS180203424",
            "dpc": "03023519601",
            "name": "ចាន់ ថុល"
        },
        {
            "barcode": "BBWS180203425",
            "dpc": "03023519701",
            "name": "ហ៊ិន សំរ៉ង"
        },
        {
            "barcode": "BBWS180203426",
            "dpc": "03023519801",
            "name": "ឯក ខាំ"
        },
        {
            "barcode": "BBWS180203427",
            "dpc": "03023520101",
            "name": "ផាន់ សុផុន"
        },
        {
            "barcode": "BBWS180203428",
            "dpc": "03023520201",
            "name": "ឈូក ឆុន"
        },
        {
            "barcode": "BBWS180203429",
            "dpc": "03023520301",
            "name": "សយ អ៊ី"
        },
        {
            "barcode": "BBWS180203430",
            "dpc": "03023520501",
            "name": "យី សាវឿន"
        },
        {
            "barcode": "BBWS180203431",
            "dpc": "03023520601",
            "name": "សារ៉ង សារ:សិន្ធុ"
        },
        {
            "barcode": "BBWS180203432",
            "dpc": "03023520701",
            "name": "កែវ សារ៉េត"
        },
        {
            "barcode": "BBWS180203433",
            "dpc": "03023520801",
            "name": "នឹម សោភា"
        },
        {
            "barcode": "BBWS180203434",
            "dpc": "03023520901",
            "name": "ម៉ៅ ពឿន"
        },
        {
            "barcode": "BBWS180203435",
            "dpc": "03023521001",
            "name": "ងួន ចិន្តា"
        },
        {
            "barcode": "BBWS180203436",
            "dpc": "03023521101",
            "name": "ង៉ែត យានី"
        },
        {
            "barcode": "BBWS180203437",
            "dpc": "03023521301",
            "name": "ញ៉ឹក ថេត"
        },
        {
            "barcode": "BBWS180203438",
            "dpc": "03023521401",
            "name": "សោម សារ៉េត"
        },
        {
            "barcode": "BBWS180203439",
            "dpc": "03023521501",
            "name": "គង់ សុខុម"
        },
        {
            "barcode": "BBWS180203440",
            "dpc": "03023521601",
            "name": "ភាច ផល"
        },
        {
            "barcode": "BBWS180203441",
            "dpc": "03023521701",
            "name": "លី​ សាមឌី"
        },
        {
            "barcode": "BBWS180203442",
            "dpc": "03023521801",
            "name": "ប៊ុត សៃ"
        },
        {
            "barcode": "BBWS180203443",
            "dpc": "03023522001",
            "name": "យី សារឿត"
        },
        {
            "barcode": "BBWS180203444",
            "dpc": "03023522201",
            "name": "អ៊ុយ សារឿប"
        },
        {
            "barcode": "BBWS180203445",
            "dpc": "03023522301",
            "name": "អ៊ុក គឹមហេង"
        },
        {
            "barcode": "BBWS180203446",
            "dpc": "03023522401",
            "name": "កន ផល"
        },
        {
            "barcode": "BBWS180203447",
            "dpc": "03023522501",
            "name": "សាំង វួចគាង"
        },
        {
            "barcode": "BBWS180203448",
            "dpc": "03023522601",
            "name": "សៀង ចាន់សេថា"
        },
        {
            "barcode": "BBWS180203449",
            "dpc": "03023522701",
            "name": "រឹន គឹមហ៊ន"
        },
        {
            "barcode": "BBWS180203450",
            "dpc": "03023522801",
            "name": "ប៉ែន បុប្ផា"
        },
        {
            "barcode": "BBWS180203451",
            "dpc": "03023522901",
            "name": "ប្រាក់ ច័ន្ទសេរី"
        },
        {
            "barcode": "BBWS180203452",
            "dpc": "03023523001",
            "name": "ហ៊ន សុវណ្ណ"
        },
        {
            "barcode": "BBWS180203453",
            "dpc": "03023523101",
            "name": "និន សុភ័ក្រ"
        },
        {
            "barcode": "BBWS180203454",
            "dpc": "03023523201",
            "name": "អ៊ុក មន្ថា"
        },
        {
            "barcode": "BBWS180203455",
            "dpc": "03023523301",
            "name": "ឌី សុនថុល"
        },
        {
            "barcode": "BBWS180203456",
            "dpc": "03023523401",
            "name": "កុយ ឆាយ"
        },
        {
            "barcode": "BBWS180203457",
            "dpc": "03023523501",
            "name": "ស៊ីវ ស៊ីណែត"
        },
        {
            "barcode": "BBWS180203458",
            "dpc": "03023523601",
            "name": "ប៊ុន ឈន"
        },
        {
            "barcode": "BBWS180203459",
            "dpc": "03023523701",
            "name": "ប៊ុន ឈឿត"
        },
        {
            "barcode": "BBWS180203460",
            "dpc": "03023523801",
            "name": "វត្តក្តុល១"
        },
        {
            "barcode": "BBWS180203461",
            "dpc": "03023524101",
            "name": "វិទ្យាល័យក្តុលដូនទាវ"
        },
        {
            "barcode": "BBWS180203462",
            "dpc": "03023524201",
            "name": "ជា ឡង់"
        },
        {
            "barcode": "BBWS180203463",
            "dpc": "03023524301",
            "name": "លឹម សំណាង"
        },
        {
            "barcode": "BBWS180203464",
            "dpc": "03023524401",
            "name": "សាយ ពិសិទ្ធ"
        },
        {
            "barcode": "BBWS180203465",
            "dpc": "03023524501",
            "name": "ឡឹង សេរី"
        },
        {
            "barcode": "BBWS180203466",
            "dpc": "03023524601",
            "name": "អន មិនា"
        },
        {
            "barcode": "BBWS180203467",
            "dpc": "03023524701",
            "name": "ឈុំ សោហ៉ា"
        },
        {
            "barcode": "BBWS180203468",
            "dpc": "03023524801",
            "name": "ឡឹង ហ៊ួរ"
        },
        {
            "barcode": "BBWS180203469",
            "dpc": "03023524901",
            "name": "ណយ ណារ៉ុង"
        },
        {
            "barcode": "BBWS180203470",
            "dpc": "03023525001",
            "name": "ស៊ឹម សាខន"
        },
        {
            "barcode": "BBWS180203471",
            "dpc": "03023525101",
            "name": "ឃឹម ប៊ុនឈឿម"
        },
        {
            "barcode": "BBWS180203472",
            "dpc": "03023525201",
            "name": "ហ៊ន វុទ្ទី"
        },
        {
            "barcode": "BBWS180203473",
            "dpc": "03023525301",
            "name": "ឡោ ឈៀង"
        },
        {
            "barcode": "BBWS180203474",
            "dpc": "03023525401",
            "name": "សាលាសង្កាត់ក្តុលដូនទាវ"
        },
        {
            "barcode": "BBWS180203475",
            "dpc": "03023525501",
            "name": "សី យិច"
        },
        {
            "barcode": "BBWS180203476",
            "dpc": "03023525701",
            "name": "លឹម ខេ"
        },
        {
            "barcode": "BBWS180203477",
            "dpc": "03023525801",
            "name": "ភាព សុផាត"
        },
        {
            "barcode": "BBWS180203478",
            "dpc": "03023526001",
            "name": "ញឹម ប្រាង"
        },
        {
            "barcode": "BBWS180203479",
            "dpc": "03023526101",
            "name": "អ៊ឹម ព្រែក"
        },
        {
            "barcode": "BBWS180203480",
            "dpc": "03023526201",
            "name": "សុខ ហុង"
        },
        {
            "barcode": "BBWS180203481",
            "dpc": "03023526301",
            "name": "ស៊ាន សាន"
        },
        {
            "barcode": "BBWS180203482",
            "dpc": "03023526501",
            "name": "ហេង តិល"
        },
        {
            "barcode": "BBWS180203483",
            "dpc": "03023526601",
            "name": "សូរ សេន"
        },
        {
            "barcode": "BBWS180203484",
            "dpc": "03023526701",
            "name": "ឈុំ ឈួម"
        },
        {
            "barcode": "BBWS180203485",
            "dpc": "03023526901",
            "name": "ខឹម យ៉ូន"
        },
        {
            "barcode": "BBWS180203486",
            "dpc": "03023527001",
            "name": "នង ប៊ឺន"
        },
        {
            "barcode": "BBWS180203487",
            "dpc": "03023527101",
            "name": "ឡែប សុផែ"
        },
        {
            "barcode": "BBWS180203488",
            "dpc": "03023527201",
            "name": "ឃឹម សាវុធ"
        },
        {
            "barcode": "BBWS180203489",
            "dpc": "03023527301",
            "name": "សុខ លីដានី"
        },
        {
            "barcode": "BBWS180203490",
            "dpc": "03023527401",
            "name": "ព្រៀង ស៊ីណាត"
        },
        {
            "barcode": "BBWS180203491",
            "dpc": "03023527501",
            "name": "ស្ងៀម សុខា"
        },
        {
            "barcode": "BBWS180203492",
            "dpc": "03023527601",
            "name": "ប៉យ សាវ៉ាន"
        },
        {
            "barcode": "BBWS180203493",
            "dpc": "03023527701",
            "name": "ម៉ៅ ចាន់លី"
        },
        {
            "barcode": "BBWS180203494",
            "dpc": "03023527801",
            "name": "ជុន គឹមហ៊ួរ"
        },
        {
            "barcode": "BBWS180203495",
            "dpc": "03023527901",
            "name": "ចាន់ ផល្លា"
        },
        {
            "barcode": "BBWS180203496",
            "dpc": "03023528001",
            "name": "សឿម រិន"
        },
        {
            "barcode": "BBWS180203497",
            "dpc": "03023528101",
            "name": "អេង ឆែម១"
        },
        {
            "barcode": "BBWS180203498",
            "dpc": "03023528301",
            "name": "ចន សុន្យា"
        },
        {
            "barcode": "BBWS180203499",
            "dpc": "03023528401",
            "name": "ចន សុន្យា១"
        },
        {
            "barcode": "BBWS180203500",
            "dpc": "03023528601",
            "name": "ពេជ្រ ច័ន្ទមុនី"
        },
        {
            "barcode": "BBWS180203501",
            "dpc": "03023528701",
            "name": "ម៉ៅ ចាន់លី"
        },
        {
            "barcode": "BBWS180203502",
            "dpc": "03023528801",
            "name": "គង់ សុន"
        },
        {
            "barcode": "BBWS180203503",
            "dpc": "03023528901",
            "name": "ហៀក ពុទ្ធី"
        },
        {
            "barcode": "BBWS180203504",
            "dpc": "03023529001",
            "name": "ទន់ ខេន"
        },
        {
            "barcode": "BBWS180203505",
            "dpc": "03023529101",
            "name": "ជុំ លក្ខណា"
        },
        {
            "barcode": "BBWS180203506",
            "dpc": "03023529201",
            "name": "ញ៉េប ភីរម្យ"
        },
        {
            "barcode": "BBWS180203507",
            "dpc": "03023529401",
            "name": "ភួង សូម"
        },
        {
            "barcode": "BBWS180203508",
            "dpc": "03023529501",
            "name": "ពុំ សុជាតា"
        },
        {
            "barcode": "BBWS180203509",
            "dpc": "03023529601",
            "name": "ប៉ុល ណារ៉ែន"
        },
        {
            "barcode": "BBWS180203510",
            "dpc": "03023529701",
            "name": "អ៊ាន ណារៀង"
        },
        {
            "barcode": "BBWS180203511",
            "dpc": "03023529801",
            "name": "ផាវី ភី"
        },
        {
            "barcode": "BBWS180203512",
            "dpc": "03023529901",
            "name": "លៀង គឹមស៊ា"
        },
        {
            "barcode": "BBWS180203513",
            "dpc": "03023530001",
            "name": "រ៉ែម ណារ៉ុង"
        },
        {
            "barcode": "BBWS180203514",
            "dpc": "03023530101",
            "name": "រិទ្ថ សារី"
        },
        {
            "barcode": "BBWS180203515",
            "dpc": "03023530201",
            "name": "ម៉ ចាន់"
        },
        {
            "barcode": "BBWS180203516",
            "dpc": "03023530301",
            "name": "ជុំ សារីណា"
        },
        {
            "barcode": "BBWS180203517",
            "dpc": "03023530401",
            "name": "តាំ ម៉ាប់"
        },
        {
            "barcode": "BBWS180203518",
            "dpc": "03023530501",
            "name": "ឪក សាមៀន"
        },
        {
            "barcode": "BBWS180203519",
            "dpc": "03023530601",
            "name": "ថាត រុន"
        },
        {
            "barcode": "BBWS180203520",
            "dpc": "03023530701",
            "name": "ចេក សារិទ្ធ"
        },
        {
            "barcode": "BBWS180203521",
            "dpc": "03023530801",
            "name": "ហុង ស៊ីវ"
        },
        {
            "barcode": "BBWS180203522",
            "dpc": "03023530901",
            "name": "សួន ឆុន"
        },
        {
            "barcode": "BBWS180203523",
            "dpc": "03023531001",
            "name": "ញៀប សារុន"
        },
        {
            "barcode": "BBWS180203524",
            "dpc": "03023531101",
            "name": "ឡង់ វុទ្ទី"
        },
        {
            "barcode": "BBWS180203525",
            "dpc": "03023531201",
            "name": "សៀង ចយ"
        },
        {
            "barcode": "BBWS180203526",
            "dpc": "03023531301",
            "name": "ថ្លុង សឹរី"
        },
        {
            "barcode": "BBWS180203527",
            "dpc": "03023531501",
            "name": "ឈឿង ឆែម"
        },
        {
            "barcode": "BBWS180203528",
            "dpc": "03023531601",
            "name": "ម៉ក់ សុធា"
        },
        {
            "barcode": "BBWS180203529",
            "dpc": "03023531701",
            "name": "សាន ហ៊ុន"
        },
        {
            "barcode": "BBWS180203530",
            "dpc": "03023531801",
            "name": "ច្រែង ឈឿម"
        },
        {
            "barcode": "BBWS180203531",
            "dpc": "03023531901",
            "name": "ពៅ ប៊ុន ថា"
        },
        {
            "barcode": "BBWS180203532",
            "dpc": "03023532001",
            "name": "ហ៊ន យក់ហៀប"
        },
        {
            "barcode": "BBWS180203533",
            "dpc": "03023532101",
            "name": "ហាក់ សន"
        },
        {
            "barcode": "BBWS180203534",
            "dpc": "03023532201",
            "name": "តោ ឈូក"
        },
        {
            "barcode": "BBWS180203535",
            "dpc": "03023532301",
            "name": "រួម បូរី"
        },
        {
            "barcode": "BBWS180203536",
            "dpc": "03023532401",
            "name": "ឈិន សំអឿន"
        },
        {
            "barcode": "BBWS180203537",
            "dpc": "03023532501",
            "name": "ម៉ៅ សំបុណ្យ"
        },
        {
            "barcode": "BBWS180203538",
            "dpc": "03023532601",
            "name": "សុខ ស៊ីម"
        },
        {
            "barcode": "BBWS180203539",
            "dpc": "03023532701",
            "name": "កែម ស៊ីណៃ"
        },
        {
            "barcode": "BBWS180203540",
            "dpc": "03023532801",
            "name": "ឈួន ផាត"
        },
        {
            "barcode": "BBWS180203541",
            "dpc": "03023532901",
            "name": "យឹម យុន"
        },
        {
            "barcode": "BBWS180203542",
            "dpc": "03023533001",
            "name": "ស៊ឹម សៃនី"
        },
        {
            "barcode": "BBWS180203543",
            "dpc": "03023533101",
            "name": "ម៉ន រឿត"
        },
        {
            "barcode": "BBWS180203544",
            "dpc": "03023533201",
            "name": "ហេង វាសនា"
        },
        {
            "barcode": "BBWS180203545",
            "dpc": "03023533301",
            "name": "សំ ចាន់"
        },
        {
            "barcode": "BBWS180203546",
            "dpc": "03023533401",
            "name": "សួន ម៉ាប់"
        },
        {
            "barcode": "BBWS180203547",
            "dpc": "03023533501",
            "name": "គង់ វាសនា"
        },
        {
            "barcode": "BBWS180203548",
            "dpc": "03023533601",
            "name": "ហាក់ ឈឿន"
        },
        {
            "barcode": "BBWS180203549",
            "dpc": "03023533701",
            "name": "ម៉ង សុធី"
        },
        {
            "barcode": "BBWS180203550",
            "dpc": "03023533801",
            "name": "សេង ញឹម"
        },
        {
            "barcode": "BBWS180203551",
            "dpc": "03023533901",
            "name": "សួន នឹម"
        },
        {
            "barcode": "BBWS180203552",
            "dpc": "03023534001",
            "name": "ម៉ូត សេរី"
        },
        {
            "barcode": "BBWS180203553",
            "dpc": "03023534101",
            "name": "ជី សុជាតិ"
        },
        {
            "barcode": "BBWS180203554",
            "dpc": "03023534301",
            "name": "ម៉ូត ខន"
        },
        {
            "barcode": "BBWS180203555",
            "dpc": "03023534401",
            "name": "ម៉ូ ប៊ុន"
        },
        {
            "barcode": "BBWS180203556",
            "dpc": "03023534501",
            "name": "ជី សុខរ៉ន"
        },
        {
            "barcode": "BBWS180203557",
            "dpc": "03023534601",
            "name": "យូ ទី"
        },
        {
            "barcode": "BBWS180203558",
            "dpc": "03023534701",
            "name": "ហ៊ូ ហេង"
        },
        {
            "barcode": "BBWS180203559",
            "dpc": "03023534801",
            "name": "មុត ម៉ុច"
        },
        {
            "barcode": "BBWS180203560",
            "dpc": "03023534901",
            "name": "ព្រុំ មុនី"
        },
        {
            "barcode": "BBWS180203561",
            "dpc": "03023535001",
            "name": "លឹម គី"
        },
        {
            "barcode": "BBWS180203562",
            "dpc": "03023535101",
            "name": "ឡេង ម៉ាស៊ីន"
        },
        {
            "barcode": "BBWS180203563",
            "dpc": "03023535301",
            "name": "អ៊ាន សុធី"
        },
        {
            "barcode": "BBWS180203564",
            "dpc": "03023535501",
            "name": "អឿន ហ៊ត"
        },
        {
            "barcode": "BBWS180203565",
            "dpc": "03023535601",
            "name": "ពេជ្រ ណូក"
        },
        {
            "barcode": "BBWS180203566",
            "dpc": "03023535801",
            "name": "លឹម គឹមស៊ុន"
        },
        {
            "barcode": "BBWS180203567",
            "dpc": "03023536001",
            "name": "ម៉ូ រ៉ាត់"
        },
        {
            "barcode": "BBWS180203568",
            "dpc": "03023536201",
            "name": "ហុង ដារ៉ា"
        },
        {
            "barcode": "BBWS180203569",
            "dpc": "03023536401",
            "name": "ឪ ដែន"
        },
        {
            "barcode": "BBWS180203570",
            "dpc": "03023536501",
            "name": "សុខ ទូច"
        },
        {
            "barcode": "BBWS180203571",
            "dpc": "03023536601",
            "name": "ជា សារ៉េន"
        },
        {
            "barcode": "BBWS180203572",
            "dpc": "03023536701",
            "name": "ជា ញាន"
        },
        {
            "barcode": "BBWS180203573",
            "dpc": "03023536801",
            "name": "យឿត សាវី"
        },
        {
            "barcode": "BBWS180203574",
            "dpc": "03023536901",
            "name": "យ៉ង់ យឿត"
        },
        {
            "barcode": "BBWS180203575",
            "dpc": "03023537001",
            "name": "សណ្តែក ម៉ុច"
        },
        {
            "barcode": "BBWS180203576",
            "dpc": "03023537101",
            "name": "យ៉ង ធី"
        },
        {
            "barcode": "BBWS180203577",
            "dpc": "03023537401",
            "name": "យ៉ង់ សារេន"
        },
        {
            "barcode": "BBWS180203578",
            "dpc": "03023537501",
            "name": "អ៊ិត ហឿត"
        },
        {
            "barcode": "BBWS180203579",
            "dpc": "03023537601",
            "name": "នៅ តាំង"
        },
        {
            "barcode": "BBWS180203580",
            "dpc": "03023537701",
            "name": "ឈា សិលា"
        },
        {
            "barcode": "BBWS180203581",
            "dpc": "03023537801",
            "name": "ព្រុំ  ស៊ីថុល"
        },
        {
            "barcode": "BBWS180203582",
            "dpc": "03023537901",
            "name": "ព្រុំ ស៊ីថុល២"
        },
        {
            "barcode": "BBWS180203583",
            "dpc": "03023538001",
            "name": "ឈាង សោមា"
        },
        {
            "barcode": "BBWS180203584",
            "dpc": "03023538101",
            "name": "ឈា សុផានី"
        },
        {
            "barcode": "BBWS180203585",
            "dpc": "03023538201",
            "name": "លឹម នាង"
        },
        {
            "barcode": "BBWS180203586",
            "dpc": "03023538301",
            "name": "សែម សុខុម"
        },
        {
            "barcode": "BBWS180203587",
            "dpc": "03023538401",
            "name": "ចន សុផាណា"
        },
        {
            "barcode": "BBWS180203588",
            "dpc": "03023538501",
            "name": "ង៉ោ ប៉ុនពេជ្រ"
        },
        {
            "barcode": "BBWS180203589",
            "dpc": "03023538701",
            "name": "ប៉ូច សុភណ្ណារិទ្ធ"
        },
        {
            "barcode": "BBWS180203590",
            "dpc": "03023538801",
            "name": "អុំ រដ្ធា"
        },
        {
            "barcode": "BBWS180203591",
            "dpc": "03023538901",
            "name": "ទី ថា"
        },
        {
            "barcode": "BBWS180203592",
            "dpc": "03023539001",
            "name": "ជេត កុសល់"
        },
        {
            "barcode": "BBWS180203593",
            "dpc": "03023539101",
            "name": "ឡាប វណ្ណឌី"
        },
        {
            "barcode": "BBWS180203594",
            "dpc": "03023539201",
            "name": "យុន តៃអាន"
        },
        {
            "barcode": "BBWS180203595",
            "dpc": "03023539301",
            "name": "ផេង សំប៊ូន"
        },
        {
            "barcode": "BBWS180203596",
            "dpc": "03023539401",
            "name": "ហាន ហ៊ីង"
        },
        {
            "barcode": "BBWS180203597",
            "dpc": "03023539501",
            "name": "ហេង សុវណ្ណ"
        },
        {
            "barcode": "BBWS180203598",
            "dpc": "03023539601",
            "name": "សោម ទីន"
        },
        {
            "barcode": "BBWS180203599",
            "dpc": "03023539701",
            "name": "យ៉ត សាង"
        },
        {
            "barcode": "BBWS180203600",
            "dpc": "03023539801",
            "name": "គង់ សុផន"
        },
        {
            "barcode": "BBWS180203601",
            "dpc": "03023539901",
            "name": "ទឹម រី​"
        },
        {
            "barcode": "BBWS180203602",
            "dpc": "03023540001",
            "name": "ហឿន នាង"
        },
        {
            "barcode": "BBWS180203603",
            "dpc": "03023540101",
            "name": "ឡាច ព្រីន"
        },
        {
            "barcode": "BBWS180203604",
            "dpc": "03023540201",
            "name": "ប៉ាន សុខា"
        },
        {
            "barcode": "BBWS180203605",
            "dpc": "03023540301",
            "name": "មុំ សុភាព"
        },
        {
            "barcode": "BBWS180203606",
            "dpc": "03023540401",
            "name": "ព្រីង ចាប"
        },
        {
            "barcode": "BBWS180203607",
            "dpc": "03023540501",
            "name": "ពៅ ប៊ុនថា"
        },
        {
            "barcode": "BBWS180203608",
            "dpc": "03023540801",
            "name": "ពេជ្រ ណារ៉ាន់"
        },
        {
            "barcode": "BBWS180203609",
            "dpc": "03023540901",
            "name": "ហែម សារ៉េត"
        },
        {
            "barcode": "BBWS180203610",
            "dpc": "03023541001",
            "name": "ឆៃ សារ៉ា"
        },
        {
            "barcode": "BBWS180203611",
            "dpc": "03023541101",
            "name": "ឡត ប៊ុនថុន"
        },
        {
            "barcode": "BBWS180203612",
            "dpc": "03023541201",
            "name": "ឡត ប៊ុនថុន១"
        },
        {
            "barcode": "BBWS180203613",
            "dpc": "03023541301",
            "name": "ពេជ្រ ថោងលឿម"
        },
        {
            "barcode": "BBWS180203614",
            "dpc": "03023541401",
            "name": "នៅ នី"
        },
        {
            "barcode": "BBWS180203615",
            "dpc": "03023541501",
            "name": "ឈ ហេងទាវ"
        },
        {
            "barcode": "BBWS180203616",
            "dpc": "03023541601",
            "name": "ទិត្យ សុខុម"
        },
        {
            "barcode": "BBWS180203617",
            "dpc": "03023541701",
            "name": "តុល ថុល"
        },
        {
            "barcode": "BBWS180203618",
            "dpc": "03023541801",
            "name": "ជុំ នឿម"
        },
        {
            "barcode": "BBWS180203619",
            "dpc": "03023542101",
            "name": "វ៉ាន វ៉ៃ"
        },
        {
            "barcode": "BBWS180203620",
            "dpc": "03023542301",
            "name": "ញ៉ុក យ៉េន"
        },
        {
            "barcode": "BBWS180203621",
            "dpc": "03023542601",
            "name": "ឆាន់ គឹមសេង"
        },
        {
            "barcode": "BBWS180203622",
            "dpc": "03023542701",
            "name": "សោរ ទូច"
        },
        {
            "barcode": "BBWS180203623",
            "dpc": "03023542801",
            "name": "យុន ឡៅស៊ិត"
        },
        {
            "barcode": "BBWS180203624",
            "dpc": "03023542901",
            "name": "យ៉ុន ឡៅសត្តិ១"
        },
        {
            "barcode": "BBWS180203625",
            "dpc": "03023543001",
            "name": "ព្រុំ  វុទ្ធី"
        },
        {
            "barcode": "BBWS180203626",
            "dpc": "03023543101",
            "name": "ថេត រីឆាន"
        },
        {
            "barcode": "BBWS180203627",
            "dpc": "03023543201",
            "name": "រៀល ថងសឺត"
        },
        {
            "barcode": "BBWS180203628",
            "dpc": "03023543301",
            "name": "ចាន់ ឆឿង"
        },
        {
            "barcode": "BBWS180203629",
            "dpc": "03023543401",
            "name": "សោម វណ្ណី"
        },
        {
            "barcode": "BBWS180203630",
            "dpc": "03023543501",
            "name": "ប្រាក់ យស់ផា"
        },
        {
            "barcode": "BBWS180203631",
            "dpc": "03023543601",
            "name": "ផាន ហ៊ុន"
        },
        {
            "barcode": "BBWS180203632",
            "dpc": "03023543701",
            "name": "អ៊ិន សេរី"
        },
        {
            "barcode": "BBWS180203633",
            "dpc": "03023543801",
            "name": "អេង លីសាលុយ"
        },
        {
            "barcode": "BBWS180203634",
            "dpc": "03023543901",
            "name": "ទិត្យ អាន"
        },
        {
            "barcode": "BBWS180203635",
            "dpc": "03023544101",
            "name": "ឡេង ធារី"
        },
        {
            "barcode": "BBWS180203636",
            "dpc": "03023544301",
            "name": "សយ យ៉េត"
        },
        {
            "barcode": "BBWS180203637",
            "dpc": "03023544501",
            "name": "ហោ លឿប"
        },
        {
            "barcode": "BBWS180203638",
            "dpc": "03023544601",
            "name": "ឡេង ប៊ុនរ៉ុង"
        },
        {
            "barcode": "BBWS180203639",
            "dpc": "03023544701",
            "name": "សាលាបឋមសិក្សាថ្កូវ"
        },
        {
            "barcode": "BBWS180203640",
            "dpc": "03023544801",
            "name": "យ៉ុង ទី"
        },
        {
            "barcode": "BBWS180203641",
            "dpc": "03023544901",
            "name": "ផុន ភឿត"
        },
        {
            "barcode": "BBWS180203642",
            "dpc": "03023545001",
            "name": "ផុន សុខ"
        },
        {
            "barcode": "BBWS180203643",
            "dpc": "03023545101",
            "name": "អ៊ុច រ៉ាត់"
        },
        {
            "barcode": "BBWS180203644",
            "dpc": "03023545201",
            "name": "សោម ស៊ួរ"
        },
        {
            "barcode": "BBWS180203645",
            "dpc": "03023545301",
            "name": "ហែម វត្តី"
        },
        {
            "barcode": "BBWS180203646",
            "dpc": "03023545401",
            "name": "ទិត្យ ផេង"
        },
        {
            "barcode": "BBWS180203647",
            "dpc": "03023545501",
            "name": "វ៉ាត សារ៉ាត់"
        },
        {
            "barcode": "BBWS180203648",
            "dpc": "03023545601",
            "name": "ឡេង សុខុម"
        },
        {
            "barcode": "BBWS180203649",
            "dpc": "03023545701",
            "name": "សៅ យ៉ា"
        },
        {
            "barcode": "BBWS180203650",
            "dpc": "03023545801",
            "name": "អ៊ុន សំណាង"
        },
        {
            "barcode": "BBWS180203651",
            "dpc": "03023546101",
            "name": "ឆែម ឆន"
        },
        {
            "barcode": "BBWS180203652",
            "dpc": "03023546201",
            "name": "រឿន ឈូក"
        },
        {
            "barcode": "BBWS180203653",
            "dpc": "03023546301",
            "name": "អេង ចាន់ថង"
        },
        {
            "barcode": "BBWS180203654",
            "dpc": "03023546401",
            "name": "យឿត ហ៊ាង"
        },
        {
            "barcode": "BBWS180203655",
            "dpc": "03023546501",
            "name": "យឿត ហាង១"
        },
        {
            "barcode": "BBWS180203656",
            "dpc": "03023546701",
            "name": "យឿត ហ៊ាង៣"
        },
        {
            "barcode": "BBWS180203657",
            "dpc": "03023546801",
            "name": "ងួន រ៉ានី"
        },
        {
            "barcode": "BBWS180203658",
            "dpc": "03023547001",
            "name": "ហ៊ន ហឿន"
        },
        {
            "barcode": "BBWS180203659",
            "dpc": "03023547101",
            "name": "វូ គិញ"
        },
        {
            "barcode": "BBWS180203660",
            "dpc": "03023547201",
            "name": "ឈាន ភីរ៉ា"
        },
        {
            "barcode": "BBWS180203661",
            "dpc": "03023547301",
            "name": "យូរ សាយ៍ណ្ត"
        },
        {
            "barcode": "BBWS180203662",
            "dpc": "03023547401",
            "name": "សាំង សុវត្តិ"
        },
        {
            "barcode": "BBWS180203663",
            "dpc": "03023547501",
            "name": "សង ណារ៉ែន"
        },
        {
            "barcode": "BBWS180203664",
            "dpc": "03023547601",
            "name": "ប៊ុន តុងបូរ៉ារិទ្ធ"
        },
        {
            "barcode": "BBWS180203665",
            "dpc": "03023547701",
            "name": "ជួង ចន្ជី"
        },
        {
            "barcode": "BBWS180203666",
            "dpc": "03023547801",
            "name": "លី សម្បត្តិ"
        },
        {
            "barcode": "BBWS180203667",
            "dpc": "03023547901",
            "name": "ឆូ រដ្ឋមូលី"
        },
        {
            "barcode": "BBWS180203668",
            "dpc": "03023502501",
            "name": "យន់ សាវ័ន្ត"
        },
        {
            "barcode": "BBWS180203669",
            "dpc": "03023541901",
            "name": "ពៅ ឡម"
        },
        {
            "barcode": "BBWS180203670",
            "dpc": "03023548001",
            "name": "នូរ ប៊ុណ្ណារ៉ា"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
