let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=

    [
        {
            "barcode": "BBWS180203671",
            "dpc": "03013700101",
            "name": "ហុក សុខា"
        },
        {
            "barcode": "BBWS180203672",
            "dpc": "03013700201",
            "name": "ជុំ សុគុណ"
        },
        {
            "barcode": "BBWS180203673",
            "dpc": "03013700301",
            "name": "ភួង ចន្ថា"
        },
        {
            "barcode": "BBWS180203674",
            "dpc": "03013700401",
            "name": "ទី ប៊ុនរឿង"
        },
        {
            "barcode": "BBWS180203675",
            "dpc": "03013700501",
            "name": "ឈូក សាមឿន"
        },
        {
            "barcode": "BBWS180203676",
            "dpc": "03013700701",
            "name": "លឹម សន្ទនា"
        },
        {
            "barcode": "BBWS180203677",
            "dpc": "03013700801",
            "name": "ក្រួច ឈួន"
        },
        {
            "barcode": "BBWS180203678",
            "dpc": "03013700901",
            "name": "ទិត្យ នី"
        },
        {
            "barcode": "BBWS180203679",
            "dpc": "03013701001",
            "name": "រួត ចន្ទ័សុហា"
        },
        {
            "barcode": "BBWS180203680",
            "dpc": "03013701101",
            "name": "សេង ណាវី"
        },
        {
            "barcode": "BBWS180203681",
            "dpc": "03013701201",
            "name": "លាង ប៊ុន"
        },
        {
            "barcode": "BBWS180203682",
            "dpc": "03013701301",
            "name": "មឹង ខុម"
        },
        {
            "barcode": "BBWS180203683",
            "dpc": "03013701401",
            "name": "ឆែក សាវន្ត័"
        },
        {
            "barcode": "BBWS180203684",
            "dpc": "03013701501",
            "name": "សួន ចិត្រ"
        },
        {
            "barcode": "BBWS180203685",
            "dpc": "03013701601",
            "name": "ហាក រ៉ាវី"
        },
        {
            "barcode": "BBWS180203686",
            "dpc": "03013701701",
            "name": "ស្រី សំបាន"
        },
        {
            "barcode": "BBWS180203687",
            "dpc": "03013701801",
            "name": "អ៊ឹម ផារ៉ា"
        },
        {
            "barcode": "BBWS180203688",
            "dpc": "03013701901",
            "name": "តាប់ កឿន"
        },
        {
            "barcode": "BBWS180203689",
            "dpc": "03013702001",
            "name": "ឯក សុវណ្ណ២"
        },
        {
            "barcode": "BBWS180203690",
            "dpc": "03013702101",
            "name": "ផាត់ ម៉ូវ"
        },
        {
            "barcode": "BBWS180203691",
            "dpc": "03013702201",
            "name": "ឃុត សារ៉ែត"
        },
        {
            "barcode": "BBWS180203692",
            "dpc": "03013702301",
            "name": "សៀវ គឹមសាន្ត"
        },
        {
            "barcode": "BBWS180203693",
            "dpc": "03013702401",
            "name": "វី ម៉ៅ"
        },
        {
            "barcode": "BBWS180203694",
            "dpc": "03013702501",
            "name": "ស៊ួរ ប៉េង"
        },
        {
            "barcode": "BBWS180203695",
            "dpc": "03013702601",
            "name": "ប្លង់ សុជាតិ"
        },
        {
            "barcode": "BBWS180203696",
            "dpc": "03013702701",
            "name": "រ៉ន និន"
        },
        {
            "barcode": "BBWS180203697",
            "dpc": "03013702801",
            "name": "សួង សុភា"
        },
        {
            "barcode": "BBWS180203698",
            "dpc": "03013702901",
            "name": "ប៉ុក ថេង"
        },
        {
            "barcode": "BBWS180203699",
            "dpc": "03013703001",
            "name": "ឈឹម សំអុល"
        },
        {
            "barcode": "BBWS180203700",
            "dpc": "03013703101",
            "name": "សុខ ផល្លី"
        },
        {
            "barcode": "BBWS180203701",
            "dpc": "03013703201",
            "name": "ជា រដ្ឋា"
        },
        {
            "barcode": "BBWS180203702",
            "dpc": "03013703301",
            "name": "សាលាបឋមសិក្សា ស្វាយធំ"
        },
        {
            "barcode": "BBWS180203703",
            "dpc": "03013703401",
            "name": "ប៉ង រិទ្វនី"
        },
        {
            "barcode": "BBWS180203704",
            "dpc": "03013703501",
            "name": "តូច សៅវ៉ារ៉ា"
        },
        {
            "barcode": "BBWS180203705",
            "dpc": "03013703601",
            "name": "ប៉ួត វុន"
        },
        {
            "barcode": "BBWS180203706",
            "dpc": "03013703701",
            "name": "ហោម មន្នី"
        },
        {
            "barcode": "BBWS180203707",
            "dpc": "03013703901",
            "name": "សៀង សុគន្ធ"
        },
        {
            "barcode": "BBWS180203708",
            "dpc": "03013704001",
            "name": "អេង ស៊ីណា"
        },
        {
            "barcode": "BBWS180203709",
            "dpc": "03013704201",
            "name": "អោក ភាព"
        },
        {
            "barcode": "BBWS180203710",
            "dpc": "03013704301",
            "name": "កែង គឹមតេង"
        },
        {
            "barcode": "BBWS180203711",
            "dpc": "03013704401",
            "name": "អាង កែវ"
        },
        {
            "barcode": "BBWS180203712",
            "dpc": "03013704601",
            "name": "ជី ស៊ង"
        },
        {
            "barcode": "BBWS180203713",
            "dpc": "03013704801",
            "name": "វឿន វ៉ាន់"
        },
        {
            "barcode": "BBWS180203714",
            "dpc": "03013704901",
            "name": "ហ៊ា កង់"
        },
        {
            "barcode": "BBWS180203715",
            "dpc": "03013705001",
            "name": "ហេង ម៉ៅ"
        },
        {
            "barcode": "BBWS180203716",
            "dpc": "03013705201",
            "name": "ស្រស់ គីមហាក់"
        },
        {
            "barcode": "BBWS180203717",
            "dpc": "03013705301",
            "name": "រឿង ឆាន"
        },
        {
            "barcode": "BBWS180203718",
            "dpc": "03013705401",
            "name": "លិញ សុផល"
        },
        {
            "barcode": "BBWS180203719",
            "dpc": "03013705501",
            "name": "ជៀប រីណា"
        },
        {
            "barcode": "BBWS180203720",
            "dpc": "03013705601",
            "name": "ឈុំ ស្រីអូន"
        },
        {
            "barcode": "BBWS180203721",
            "dpc": "03013705701",
            "name": "ប៊ុន រើន"
        },
        {
            "barcode": "BBWS180203722",
            "dpc": "03013705801",
            "name": "តុប ចាន់ផល្លា"
        },
        {
            "barcode": "BBWS180203723",
            "dpc": "03013705901",
            "name": "យឹម ទ្រី"
        },
        {
            "barcode": "BBWS180203724",
            "dpc": "03013706001",
            "name": "រស់ ចាន់ដារ៉ា"
        },
        {
            "barcode": "BBWS180203725",
            "dpc": "03013706101",
            "name": "គា សុខ"
        },
        {
            "barcode": "BBWS180203726",
            "dpc": "03013706201",
            "name": "អ៊ូ វុទ្ធី"
        },
        {
            "barcode": "BBWS180203727",
            "dpc": "03013706301",
            "name": "ហែម ឡាប"
        },
        {
            "barcode": "BBWS180203728",
            "dpc": "03013706401",
            "name": "អូច ម៉ៅ"
        },
        {
            "barcode": "BBWS180203729",
            "dpc": "03013706501",
            "name": "សយ សៀង"
        },
        {
            "barcode": "BBWS180203730",
            "dpc": "03013706601",
            "name": "ជៀម ចិន្តា"
        },
        {
            "barcode": "BBWS180203731",
            "dpc": "03013706801",
            "name": "អ៊ុក ឆនន្ត័"
        },
        {
            "barcode": "BBWS180203732",
            "dpc": "03013706901",
            "name": "អ៊ុក ណាវុធ"
        },
        {
            "barcode": "BBWS180203733",
            "dpc": "03013707001",
            "name": "ជុំ សុភា"
        },
        {
            "barcode": "BBWS180203734",
            "dpc": "03013707101",
            "name": "អៀម រិននឿត"
        },
        {
            "barcode": "BBWS180203735",
            "dpc": "03013707201",
            "name": "នេត មុំ"
        },
        {
            "barcode": "BBWS180203736",
            "dpc": "03013707301",
            "name": "ញាណ ផន"
        },
        {
            "barcode": "BBWS180203737",
            "dpc": "03013707401",
            "name": "ឆេង ចាន់រ៉ា"
        },
        {
            "barcode": "BBWS180203738",
            "dpc": "03013707501",
            "name": "ឃឹម ឆុំ"
        },
        {
            "barcode": "BBWS180203739",
            "dpc": "03013707601",
            "name": "ព្រំ ក្រាញ់"
        },
        {
            "barcode": "BBWS180203740",
            "dpc": "03013707701",
            "name": "មុំ ណូក"
        },
        {
            "barcode": "BBWS180203741",
            "dpc": "03013708001",
            "name": "គង់ ពីណា"
        },
        {
            "barcode": "BBWS180203742",
            "dpc": "03013708101",
            "name": "ឆាយ រិទ្វី"
        },
        {
            "barcode": "BBWS180203743",
            "dpc": "03013708201",
            "name": "ផា សុភាវី"
        },
        {
            "barcode": "BBWS180203744",
            "dpc": "03013708301",
            "name": "ចេង សុខហៀង"
        },
        {
            "barcode": "BBWS180203745",
            "dpc": "03013708401",
            "name": "លឹម ម៉េង"
        },
        {
            "barcode": "BBWS180203746",
            "dpc": "03013708501",
            "name": "ឈឿម ឆៃយ៉ា"
        },
        {
            "barcode": "BBWS180203747",
            "dpc": "03013708601",
            "name": "គង់ អៀប"
        },
        {
            "barcode": "BBWS180203748",
            "dpc": "03013708801",
            "name": "ជឿន សុជា"
        },
        {
            "barcode": "BBWS180203749",
            "dpc": "03013709001",
            "name": "ឌុង សំណាង"
        },
        {
            "barcode": "BBWS180203750",
            "dpc": "03013709101",
            "name": "ទឹម វុន"
        },
        {
            "barcode": "BBWS180203751",
            "dpc": "03013709201",
            "name": "ធឿន សោភា"
        },
        {
            "barcode": "BBWS180203752",
            "dpc": "03013709301",
            "name": "ហ៊ីម ហួច"
        },
        {
            "barcode": "BBWS180203753",
            "dpc": "03013709401",
            "name": "ង៉ែត អ៊ុន"
        },
        {
            "barcode": "BBWS180203754",
            "dpc": "03013709501",
            "name": "ហឹង សាវើន"
        },
        {
            "barcode": "BBWS180203755",
            "dpc": "03013709601",
            "name": "ឡុង វុន"
        },
        {
            "barcode": "BBWS180203756",
            "dpc": "03013709701",
            "name": "ឌៀប រិទ្ធស្យា"
        },
        {
            "barcode": "BBWS180203757",
            "dpc": "03013709801",
            "name": "ប៉ា សារ៉ា"
        },
        {
            "barcode": "BBWS180203758",
            "dpc": "03013709901",
            "name": "ឡយ លី"
        },
        {
            "barcode": "BBWS180203759",
            "dpc": "03013710001",
            "name": "ឌូង សូត្រ"
        },
        {
            "barcode": "BBWS180203760",
            "dpc": "03013710101",
            "name": "លី ស្រីអេង"
        },
        {
            "barcode": "BBWS180203761",
            "dpc": "03013710201",
            "name": "ស៊ុន សារី"
        },
        {
            "barcode": "BBWS180203762",
            "dpc": "03013710301",
            "name": "នៅ រតនា"
        },
        {
            "barcode": "BBWS180203763",
            "dpc": "03013710401",
            "name": "ណាត ហឿន"
        },
        {
            "barcode": "BBWS180203764",
            "dpc": "03013710501",
            "name": "សាំង សុគន្ធារិទ្ធ"
        },
        {
            "barcode": "BBWS180203765",
            "dpc": "03013710601",
            "name": "ង៉ែត សុខ"
        },
        {
            "barcode": "BBWS180203766",
            "dpc": "03013710701",
            "name": "ឃ្លាំង អៀន"
        },
        {
            "barcode": "BBWS180203767",
            "dpc": "03013710801",
            "name": "ស៊ន កឺ"
        },
        {
            "barcode": "BBWS180203768",
            "dpc": "03013710901",
            "name": "ហ៊ត ដារៀង"
        },
        {
            "barcode": "BBWS180203769",
            "dpc": "03013711001",
            "name": "ហ៊ត សារឿប"
        },
        {
            "barcode": "BBWS180203770",
            "dpc": "03013711101",
            "name": "អឿម ប៉ោក"
        },
        {
            "barcode": "BBWS180203771",
            "dpc": "03013711201",
            "name": "ប្រាក់ ហន"
        },
        {
            "barcode": "BBWS180203772",
            "dpc": "03013711301",
            "name": "លី ចិន្តា"
        },
        {
            "barcode": "BBWS180203773",
            "dpc": "03013711401",
            "name": "កូន ផល្លា"
        },
        {
            "barcode": "BBWS180203774",
            "dpc": "03013711501",
            "name": "ឆេង ឆន"
        },
        {
            "barcode": "BBWS180203775",
            "dpc": "03013711601",
            "name": "រៀប សុពណ៏"
        },
        {
            "barcode": "BBWS180203776",
            "dpc": "03013711801",
            "name": "វ៉ាន សៅរិទ្ទ"
        },
        {
            "barcode": "BBWS180203777",
            "dpc": "03013711901",
            "name": "អ៊ុក សំភួន"
        },
        {
            "barcode": "BBWS180203778",
            "dpc": "03013712001",
            "name": "កែវ វុទ្ធី"
        },
        {
            "barcode": "BBWS180203779",
            "dpc": "03013712101",
            "name": "ខៀវ ពៅ"
        },
        {
            "barcode": "BBWS180203780",
            "dpc": "03013712201",
            "name": "ចាន់ សុភ័ណ្ឌ"
        },
        {
            "barcode": "BBWS180203781",
            "dpc": "03013712301",
            "name": "សិន ភេន"
        },
        {
            "barcode": "BBWS180203782",
            "dpc": "03013712401",
            "name": "ទូច ចន្ថា"
        },
        {
            "barcode": "BBWS180203783",
            "dpc": "03013712501",
            "name": "ភុំ លី"
        },
        {
            "barcode": "BBWS180203784",
            "dpc": "03013712601",
            "name": "ជា ឡេង"
        },
        {
            "barcode": "BBWS180203785",
            "dpc": "03013712701",
            "name": "ទេព លឿប"
        },
        {
            "barcode": "BBWS180203786",
            "dpc": "03013712801",
            "name": "និត ជីវន័្ត"
        },
        {
            "barcode": "BBWS180203787",
            "dpc": "03013712901",
            "name": "ប៊ុននាង សុនន្ទ"
        },
        {
            "barcode": "BBWS180203788",
            "dpc": "03013713001",
            "name": "ហេង ហ៊ុន"
        },
        {
            "barcode": "BBWS180203789",
            "dpc": "03013713101",
            "name": "ទិត្យ សេរីយស"
        },
        {
            "barcode": "BBWS180203790",
            "dpc": "03013713201",
            "name": "បាង រ៉ា"
        },
        {
            "barcode": "BBWS180203791",
            "dpc": "03013713301",
            "name": "លី ជីអ៊ី"
        },
        {
            "barcode": "BBWS180203792",
            "dpc": "03013713401",
            "name": "តែម គឹមសួង"
        },
        {
            "barcode": "BBWS180203793",
            "dpc": "03013713501",
            "name": "ហុង ឃឿត"
        },
        {
            "barcode": "BBWS180203794",
            "dpc": "03013713701",
            "name": "រ៉ុង រតនៈ"
        },
        {
            "barcode": "BBWS180203795",
            "dpc": "03013713801",
            "name": "ផា ជៀវ"
        },
        {
            "barcode": "BBWS180203796",
            "dpc": "03013714001",
            "name": "ស៊ុយ សូវៀត"
        },
        {
            "barcode": "BBWS180203797",
            "dpc": "03013714101",
            "name": "អ៊ឹង តាំងហេង"
        },
        {
            "barcode": "BBWS180203798",
            "dpc": "03013714201",
            "name": "អ៊ី វិច្ឋិកា"
        },
        {
            "barcode": "BBWS180203799",
            "dpc": "03013714301",
            "name": "សេក ណារ៉េត"
        },
        {
            "barcode": "BBWS180203800",
            "dpc": "03013714401",
            "name": "ហួត ភ័ណ្ឌ"
        },
        {
            "barcode": "BBWS180203801",
            "dpc": "03013714501",
            "name": "ហង្ស វណ្ណសុទ្ធ"
        },
        {
            "barcode": "BBWS180203802",
            "dpc": "03013714601",
            "name": "ទន់ ភក្តី"
        },
        {
            "barcode": "BBWS180203803",
            "dpc": "03013714701",
            "name": "កង់ រឿត"
        },
        {
            "barcode": "BBWS180203804",
            "dpc": "03013714801",
            "name": "ឈីវ ខុម"
        },
        {
            "barcode": "BBWS180203805",
            "dpc": "03013714901",
            "name": "ម៉ម ឈន"
        },
        {
            "barcode": "BBWS180203806",
            "dpc": "03013715001",
            "name": "ហេង មុន្នីចិន្តា"
        },
        {
            "barcode": "BBWS180203807",
            "dpc": "03013715101",
            "name": "ប៉ោ សុវណ្ណ:"
        },
        {
            "barcode": "BBWS180203808",
            "dpc": "03013715201",
            "name": "លាប ទីប"
        },
        {
            "barcode": "BBWS180203809",
            "dpc": "03013715301",
            "name": "យឿន សុជាតិ"
        },
        {
            "barcode": "BBWS180203810",
            "dpc": "03013715401",
            "name": "រៀម ធាត់"
        },
        {
            "barcode": "BBWS180203811",
            "dpc": "03013715601",
            "name": "យូ រ៉ាដេត"
        },
        {
            "barcode": "BBWS180203812",
            "dpc": "03013715801",
            "name": "កិន គីនណារិន"
        },
        {
            "barcode": "BBWS180203813",
            "dpc": "03013715901",
            "name": "កិន គីរំដួល"
        },
        {
            "barcode": "BBWS180203814",
            "dpc": "03013716001",
            "name": "កិន គីរ៉ានី"
        },
        {
            "barcode": "BBWS180203815",
            "dpc": "03013716101",
            "name": "កិន សាខាឌី"
        },
        {
            "barcode": "BBWS180203816",
            "dpc": "03013716201",
            "name": "ជា ហេង"
        },
        {
            "barcode": "BBWS180203817",
            "dpc": "03013716301",
            "name": "ជ័យ ឆាយ"
        },
        {
            "barcode": "BBWS180203818",
            "dpc": "03013716401",
            "name": "ចេង ទ្រី"
        },
        {
            "barcode": "BBWS180203819",
            "dpc": "03013716501",
            "name": "លាប គាវ"
        },
        {
            "barcode": "BBWS180203820",
            "dpc": "03013716601",
            "name": "ប៉ែន ឃីម"
        },
        {
            "barcode": "BBWS180203821",
            "dpc": "03013716701",
            "name": "ចាន់ បូរិន"
        },
        {
            "barcode": "BBWS180203822",
            "dpc": "03013716801",
            "name": "វិទ្យាល័យ អន្លង់វិល"
        },
        {
            "barcode": "BBWS180203823",
            "dpc": "03013716901",
            "name": "ប៊ុនឈឿយ សុម៉ាលី"
        },
        {
            "barcode": "BBWS180203824",
            "dpc": "03013717001",
            "name": "ប៊ុនឈឿយ ចាន់មុន្នី"
        },
        {
            "barcode": "BBWS180203825",
            "dpc": "03013717101",
            "name": "ឈឺត សួម"
        },
        {
            "barcode": "BBWS180203826",
            "dpc": "03013717201",
            "name": "ណុប ពោល២"
        },
        {
            "barcode": "BBWS180203827",
            "dpc": "03013717301",
            "name": "ណុប ស៊ីន"
        },
        {
            "barcode": "BBWS180203828",
            "dpc": "03013717401",
            "name": "យិប គង់"
        },
        {
            "barcode": "BBWS180203829",
            "dpc": "03013717501",
            "name": "ស៊ុយ សុវណ្ណា"
        },
        {
            "barcode": "BBWS180203830",
            "dpc": "03013717601",
            "name": "លឹម គឹមហេង"
        },
        {
            "barcode": "BBWS180203831",
            "dpc": "03013717701",
            "name": "​ហឺសេរីលក្ខណ មន្នី"
        },
        {
            "barcode": "BBWS180203832",
            "dpc": "03013717801",
            "name": "រុំ ឈាងលី"
        },
        {
            "barcode": "BBWS180203833",
            "dpc": "03013717901",
            "name": "ស៊ាន នី"
        },
        {
            "barcode": "BBWS180203834",
            "dpc": "03013718001",
            "name": "ហុក រៀង"
        },
        {
            "barcode": "BBWS180203835",
            "dpc": "03013718101",
            "name": "ពយ ឈាន"
        },
        {
            "barcode": "BBWS180203836",
            "dpc": "03013718201",
            "name": "ចែម សៀន"
        },
        {
            "barcode": "BBWS180203837",
            "dpc": "03013718401",
            "name": "ហ៊ុន ផាន់ណា"
        },
        {
            "barcode": "BBWS180203838",
            "dpc": "03013718601",
            "name": "កូន ប៊ុនឈាន"
        },
        {
            "barcode": "BBWS180203839",
            "dpc": "03013718701",
            "name": "ឃួន ស៊ីនួន"
        },
        {
            "barcode": "BBWS180203840",
            "dpc": "03013718801",
            "name": "គឹម ហ៊រ"
        },
        {
            "barcode": "BBWS180203841",
            "dpc": "03013718901",
            "name": "តែង ឡឹម"
        },
        {
            "barcode": "BBWS180203842",
            "dpc": "03013719001",
            "name": "ម៉ម មួន"
        },
        {
            "barcode": "BBWS180203843",
            "dpc": "03013719101",
            "name": "ឈួយ យ៉ុន"
        },
        {
            "barcode": "BBWS180203844",
            "dpc": "03013719201",
            "name": "ចាន់ ឈួក"
        },
        {
            "barcode": "BBWS180203845",
            "dpc": "03013719301",
            "name": "ភឿង សាវុធ"
        },
        {
            "barcode": "BBWS180203846",
            "dpc": "03013719401",
            "name": "សំ បូណា"
        },
        {
            "barcode": "BBWS180203847",
            "dpc": "03013719501",
            "name": "សំ សុជី"
        },
        {
            "barcode": "BBWS180203848",
            "dpc": "03013719601",
            "name": "គង់ គឿត"
        },
        {
            "barcode": "BBWS180203849",
            "dpc": "03013719701",
            "name": "អ៊ាន សុខអេង"
        },
        {
            "barcode": "BBWS180203850",
            "dpc": "03013719901",
            "name": "កេន សាវី"
        },
        {
            "barcode": "BBWS180203851",
            "dpc": "03013720001",
            "name": "ប៉ុច សុឃឿន"
        },
        {
            "barcode": "BBWS180203852",
            "dpc": "03013720101",
            "name": "ទេព មុំ"
        },
        {
            "barcode": "BBWS180203853",
            "dpc": "03013720201",
            "name": "ប៊ុន សារុន"
        },
        {
            "barcode": "BBWS180203854",
            "dpc": "03013720301",
            "name": "កែវ ភាវី"
        },
        {
            "barcode": "BBWS180203855",
            "dpc": "03013720401",
            "name": "អាន បឿន"
        },
        {
            "barcode": "BBWS180203856",
            "dpc": "03013720501",
            "name": "ដន មែងជា"
        },
        {
            "barcode": "BBWS180203857",
            "dpc": "03013720601",
            "name": "ហេង ឆាយ"
        },
        {
            "barcode": "BBWS180203858",
            "dpc": "03013720701",
            "name": "អាន ចិន្ថា"
        },
        {
            "barcode": "BBWS180203859",
            "dpc": "03013720801",
            "name": "ជួ កែវពិសិដ្ឋ"
        },
        {
            "barcode": "BBWS180203860",
            "dpc": "03013720901",
            "name": "នួរ សារ៉ាត់ធី"
        },
        {
            "barcode": "BBWS180203861",
            "dpc": "03013721001",
            "name": "យ៉ន ចន្ធួ"
        },
        {
            "barcode": "BBWS180203862",
            "dpc": "03013721101",
            "name": "ម៉ៅ ម៉ាលីលី"
        },
        {
            "barcode": "BBWS180203863",
            "dpc": "03013721201",
            "name": "ឌី សុខលីម"
        },
        {
            "barcode": "BBWS180203864",
            "dpc": "03013721301",
            "name": "ដោ ដារ៉ាវី"
        },
        {
            "barcode": "BBWS180203865",
            "dpc": "03013721401",
            "name": "ទេព សាម៉ុន"
        },
        {
            "barcode": "BBWS180203866",
            "dpc": "03013721501",
            "name": "យឹម ប៉ូលីន"
        },
        {
            "barcode": "BBWS180203867",
            "dpc": "03013721601",
            "name": "មាន សុវណ្នធីតា"
        },
        {
            "barcode": "BBWS180203868",
            "dpc": "03013721701",
            "name": "អ៊ឹត ភឿន"
        },
        {
            "barcode": "BBWS180203869",
            "dpc": "03013721901",
            "name": "សយ ធឿន"
        },
        {
            "barcode": "BBWS180203870",
            "dpc": "03013722001",
            "name": "ម៉េង សុម៉ាន់៣"
        },
        {
            "barcode": "BBWS180203871",
            "dpc": "03013722101",
            "name": "សៀង វ៉ន់ថា"
        },
        {
            "barcode": "BBWS180203872",
            "dpc": "03013722201",
            "name": "សៀងអែម មរកត"
        },
        {
            "barcode": "BBWS180203873",
            "dpc": "03013722301",
            "name": "សៀង វ៉ាន"
        },
        {
            "barcode": "BBWS180203874",
            "dpc": "03013722401",
            "name": "ឈុន សាវុត"
        },
        {
            "barcode": "BBWS180203875",
            "dpc": "03013722501",
            "name": "លុក ចាន់រ៉ាស៊ី"
        },
        {
            "barcode": "BBWS180203876",
            "dpc": "03013722601",
            "name": "អាង សំអ៊ុន"
        },
        {
            "barcode": "BBWS180203877",
            "dpc": "03013722701",
            "name": "អៀង សារឿន"
        },
        {
            "barcode": "BBWS180203878",
            "dpc": "03013722801",
            "name": "ខាវ អ៊ាង"
        },
        {
            "barcode": "BBWS180203879",
            "dpc": "03013722901",
            "name": "ស សុភ័ក្រ"
        },
        {
            "barcode": "BBWS180203880",
            "dpc": "03013723001",
            "name": "ពឿត រិន"
        },
        {
            "barcode": "BBWS180203881",
            "dpc": "03013723201",
            "name": "ងិន ទូច"
        },
        {
            "barcode": "BBWS180203882",
            "dpc": "03013723301",
            "name": "ហាត ម៉ាប់"
        },
        {
            "barcode": "BBWS180203883",
            "dpc": "03013723401",
            "name": "ធឿន សុផាន់នី"
        },
        {
            "barcode": "BBWS180203884",
            "dpc": "03013723501",
            "name": "ឈុន សាវើន"
        },
        {
            "barcode": "BBWS180203885",
            "dpc": "03013723601",
            "name": "ឈុន សាខុម"
        },
        {
            "barcode": "BBWS180203886",
            "dpc": "03013723701",
            "name": "ឈុត ប៊ុនលឿត"
        },
        {
            "barcode": "BBWS180203887",
            "dpc": "03013723801",
            "name": "សាម ម៉ារិន"
        },
        {
            "barcode": "BBWS180203888",
            "dpc": "03013723901",
            "name": "សិន សាន្ត"
        },
        {
            "barcode": "BBWS180203889",
            "dpc": "03013724001",
            "name": "អៀង លួត"
        },
        {
            "barcode": "BBWS180203890",
            "dpc": "03013724101",
            "name": "ឈួយ សុធី"
        },
        {
            "barcode": "BBWS180203891",
            "dpc": "03013724201",
            "name": "អែម រ៉ាឌី"
        },
        {
            "barcode": "BBWS180203892",
            "dpc": "03013724301",
            "name": "លឹម ហូង"
        },
        {
            "barcode": "BBWS180203893",
            "dpc": "03013724401",
            "name": "លន គ្រួច"
        },
        {
            "barcode": "BBWS180203894",
            "dpc": "03013724501",
            "name": "វ៉ន កំសត់"
        },
        {
            "barcode": "BBWS180203895",
            "dpc": "03013724601",
            "name": "មឿន ពៅ"
        },
        {
            "barcode": "BBWS180203896",
            "dpc": "03013724701",
            "name": "ង៉ូវ ឌៀប"
        },
        {
            "barcode": "BBWS180203897",
            "dpc": "03013724801",
            "name": "ស គ្រីម៉ុត"
        },
        {
            "barcode": "BBWS180203898",
            "dpc": "03013724901",
            "name": "យឹម វិចិត្រ"
        },
        {
            "barcode": "BBWS180203899",
            "dpc": "03013725001",
            "name": "ឆៃ ប៊ុនយៀន"
        },
        {
            "barcode": "BBWS180203900",
            "dpc": "03013725101",
            "name": "ឌឿន ណាវី"
        },
        {
            "barcode": "BBWS180203901",
            "dpc": "03013725201",
            "name": "ឌឿន ណារ៉ុង"
        },
        {
            "barcode": "BBWS180203902",
            "dpc": "03013725301",
            "name": "រុណ វណ្ណរ៉ា"
        },
        {
            "barcode": "BBWS180203903",
            "dpc": "03013725401",
            "name": "អ៊ូរ សាវ៉ុង"
        },
        {
            "barcode": "BBWS180203904",
            "dpc": "03013725501",
            "name": "សុខ នរិន្ទ"
        },
        {
            "barcode": "BBWS180203905",
            "dpc": "03013725601",
            "name": "សួ គឹមឡាង"
        },
        {
            "barcode": "BBWS180203906",
            "dpc": "03013725701",
            "name": "ឆោម រ៉ាន់"
        },
        {
            "barcode": "BBWS180203907",
            "dpc": "03013725801",
            "name": "ហុក គឹមស្រុន"
        },
        {
            "barcode": "BBWS180203908",
            "dpc": "03013725901",
            "name": "អ៊ុន វណ្ណា"
        },
        {
            "barcode": "BBWS180203909",
            "dpc": "03013726001",
            "name": "មុន ហ៊ុំ"
        },
        {
            "barcode": "BBWS180203910",
            "dpc": "03013726101",
            "name": "ស្រស់ អូន"
        },
        {
            "barcode": "BBWS180203911",
            "dpc": "03013726201",
            "name": "ឆឺត នេត"
        },
        {
            "barcode": "BBWS180203912",
            "dpc": "03013726301",
            "name": "ម៉ី ដារ៉ា"
        },
        {
            "barcode": "BBWS180203913",
            "dpc": "03013726401",
            "name": "នង បណ្ណា"
        },
        {
            "barcode": "BBWS180203914",
            "dpc": "03013726501",
            "name": "ឈួន សំណាង"
        },
        {
            "barcode": "BBWS180203915",
            "dpc": "03013726601",
            "name": "គង់ ណារិន"
        },
        {
            "barcode": "BBWS180203916",
            "dpc": "03013726801",
            "name": "យិន តូ"
        },
        {
            "barcode": "BBWS180203917",
            "dpc": "03013726901",
            "name": "ឡេង បាន"
        },
        {
            "barcode": "BBWS180203918",
            "dpc": "03013727001",
            "name": "សាយ ធួន"
        },
        {
            "barcode": "BBWS180203919",
            "dpc": "03013727201",
            "name": "សុខ សុផល"
        },
        {
            "barcode": "BBWS180203920",
            "dpc": "03013727301",
            "name": "ឈិត បុទុម"
        },
        {
            "barcode": "BBWS180203921",
            "dpc": "03013727401",
            "name": "សុង សុភាព"
        },
        {
            "barcode": "BBWS180203922",
            "dpc": "03013727601",
            "name": "មីក្រូមហានគរ"
        },
        {
            "barcode": "BBWS180203923",
            "dpc": "03013727701",
            "name": "ម៉ែន ភារុណ"
        },
        {
            "barcode": "BBWS180203924",
            "dpc": "03013727801",
            "name": "ប៊ី ម៉េងស៊"
        },
        {
            "barcode": "BBWS180203925",
            "dpc": "03013727901",
            "name": "ឌួង វាសនា"
        },
        {
            "barcode": "BBWS180203926",
            "dpc": "03013728001",
            "name": "តូច ប៊ុនថន"
        },
        {
            "barcode": "BBWS180203927",
            "dpc": "03013728101",
            "name": "យិ ល្មម"
        },
        {
            "barcode": "BBWS180203928",
            "dpc": "03013728201",
            "name": "សេង ហឺ"
        },
        {
            "barcode": "BBWS180203929",
            "dpc": "03013728301",
            "name": "ស៊ុម វុធ"
        },
        {
            "barcode": "BBWS180203930",
            "dpc": "03013728501",
            "name": "ធូគឹម លន់"
        },
        {
            "barcode": "BBWS180203931",
            "dpc": "03013728601",
            "name": "ប៉ុល សុភេង"
        },
        {
            "barcode": "BBWS180203932",
            "dpc": "03013728701",
            "name": "កៅ ធារ៉ា"
        },
        {
            "barcode": "BBWS180203933",
            "dpc": "03013728801",
            "name": "ឌុច វាសនា"
        },
        {
            "barcode": "BBWS180203934",
            "dpc": "03013728901",
            "name": "ម៉ៅ ប៊ុនថន"
        },
        {
            "barcode": "BBWS180203935",
            "dpc": "03013729001",
            "name": "ម៉ី មន្តា"
        },
        {
            "barcode": "BBWS180203936",
            "dpc": "03013729101",
            "name": "ហេង ប៊ុនឡាយ"
        },
        {
            "barcode": "BBWS180203937",
            "dpc": "03013729201",
            "name": "ហេង វិចិត្រ"
        },
        {
            "barcode": "BBWS180203938",
            "dpc": "03013729301",
            "name": "ស៊ីម ផល្លី"
        },
        {
            "barcode": "BBWS180203939",
            "dpc": "03013729401",
            "name": "ឡោ ប៊ុនទួន"
        },
        {
            "barcode": "BBWS180203940",
            "dpc": "03013729501",
            "name": "សាក់ ស៊ុន"
        },
        {
            "barcode": "BBWS180203941",
            "dpc": "03013729601",
            "name": "ម៉ុត ចន្ជី"
        },
        {
            "barcode": "BBWS180203942",
            "dpc": "03013729701",
            "name": "ឡេង ឌី"
        },
        {
            "barcode": "BBWS180203943",
            "dpc": "03013729801",
            "name": "ចក សុខុម"
        },
        {
            "barcode": "BBWS180203944",
            "dpc": "03013729901",
            "name": "ឡង វាសនា"
        },
        {
            "barcode": "BBWS180203945",
            "dpc": "03013730101",
            "name": "សួន រស"
        },
        {
            "barcode": "BBWS180203946",
            "dpc": "03013730201",
            "name": "វិញ ហង់"
        },
        {
            "barcode": "BBWS180203947",
            "dpc": "03013730301",
            "name": "គា ពេជ្រនេត្រា"
        },
        {
            "barcode": "BBWS180203948",
            "dpc": "03013730401",
            "name": "គា មករា"
        },
        {
            "barcode": "BBWS180203949",
            "dpc": "03013730501",
            "name": "តន ចន្ទី"
        },
        {
            "barcode": "BBWS180203950",
            "dpc": "03013730601",
            "name": "តន ចាន់ទុំ"
        },
        {
            "barcode": "BBWS180203951",
            "dpc": "03013730701",
            "name": "តូច ណម"
        },
        {
            "barcode": "BBWS180203952",
            "dpc": "03013730801",
            "name": "លូង ស្រីរ៏ត្ន"
        },
        {
            "barcode": "BBWS180203953",
            "dpc": "03013730901",
            "name": "តូច តែម"
        },
        {
            "barcode": "BBWS180203954",
            "dpc": "03013731001",
            "name": "ឈុំ ប៉ិច"
        },
        {
            "barcode": "BBWS180203955",
            "dpc": "03013731101",
            "name": "ផន ផល្លី"
        },
        {
            "barcode": "BBWS180203956",
            "dpc": "03013731201",
            "name": "ស្រេង សេងហ៊ា"
        },
        {
            "barcode": "BBWS180203957",
            "dpc": "03013731301",
            "name": "ចាន់ សុធី"
        },
        {
            "barcode": "BBWS180203958",
            "dpc": "03013731401",
            "name": "ឈួន ឈួរា"
        },
        {
            "barcode": "BBWS180203959",
            "dpc": "03013731501",
            "name": "អៀន ណារិន"
        },
        {
            "barcode": "BBWS180203960",
            "dpc": "03013731601",
            "name": "ញ៉ែ ឡាយ"
        },
        {
            "barcode": "BBWS180203961",
            "dpc": "03013731701",
            "name": "មាន នី"
        },
        {
            "barcode": "BBWS180203962",
            "dpc": "03013731801",
            "name": "ឆាន់ កែម"
        },
        {
            "barcode": "BBWS180203963",
            "dpc": "03013731901",
            "name": "ឈិត លំអង"
        },
        {
            "barcode": "BBWS180203964",
            "dpc": "03013732001",
            "name": "ពេជ្រ ខាន់"
        },
        {
            "barcode": "BBWS180203965",
            "dpc": "03013732101",
            "name": "ប៉ែន ស្រីលីន"
        },
        {
            "barcode": "BBWS180203966",
            "dpc": "03013732201",
            "name": "អាង រ៉េន"
        },
        {
            "barcode": "BBWS180203967",
            "dpc": "03013732301",
            "name": "រ៉េត សត្តារតន៏"
        },
        {
            "barcode": "BBWS180203968",
            "dpc": "03013732401",
            "name": "ជិន វីរៈ"
        },
        {
            "barcode": "BBWS180203969",
            "dpc": "03013732501",
            "name": "វ៉ើន ផល្លី"
        },
        {
            "barcode": "BBWS180203970",
            "dpc": "03013732601",
            "name": "និត សោភា"
        },
        {
            "barcode": "BBWS180203971",
            "dpc": "03013732701",
            "name": "ហ៊ីម ប៊ុនទិត្យ"
        },
        {
            "barcode": "BBWS180203972",
            "dpc": "03013732801",
            "name": "ងួន រដ្ឋា"
        },
        {
            "barcode": "BBWS180203973",
            "dpc": "03013732901",
            "name": "ង៉ែត សាវុធ"
        },
        {
            "barcode": "BBWS180203974",
            "dpc": "03013733001",
            "name": "ទេព វុទ្ទី"
        },
        {
            "barcode": "BBWS180203975",
            "dpc": "03013733101",
            "name": "សាតា​ ហ៊រ"
        },
        {
            "barcode": "BBWS180203976",
            "dpc": "03013733201",
            "name": "ស សារឿន"
        },
        {
            "barcode": "BBWS180203977",
            "dpc": "03013733401",
            "name": "ជា ស្រ៊ុន"
        },
        {
            "barcode": "BBWS180203978",
            "dpc": "03013733501",
            "name": "ម៉ៅ ស្រស់"
        },
        {
            "barcode": "BBWS180203979",
            "dpc": "03013733701",
            "name": "ងួន អាដាមស៊ី"
        },
        {
            "barcode": "BBWS180203980",
            "dpc": "03013733801",
            "name": "លី គឹមសាន្ត"
        },
        {
            "barcode": "BBWS180203981",
            "dpc": "03013733901",
            "name": "កែវ សារុំ"
        },
        {
            "barcode": "BBWS180203982",
            "dpc": "03013734001",
            "name": "សែម គឹមហ៊ិន"
        },
        {
            "barcode": "BBWS180203983",
            "dpc": "03013734101",
            "name": "អន អៀម"
        },
        {
            "barcode": "BBWS180203984",
            "dpc": "03013734201",
            "name": "ធឿម ប៊ុនធីម"
        },
        {
            "barcode": "BBWS180203985",
            "dpc": "03013734301",
            "name": "ស៊ូ ភល្លិយ៉ា"
        },
        {
            "barcode": "BBWS180203986",
            "dpc": "03013734401",
            "name": "ជោក រស្មី"
        },
        {
            "barcode": "BBWS180203987",
            "dpc": "03013734501",
            "name": "កុក ឡៃយាន"
        },
        {
            "barcode": "BBWS180203988",
            "dpc": "03013734601",
            "name": "រួន វណ្ណះ"
        },
        {
            "barcode": "BBWS180203989",
            "dpc": "03013734701",
            "name": "ឡឹក ស្រីលក្ខ័"
        },
        {
            "barcode": "BBWS180203990",
            "dpc": "03013734801",
            "name": "ខា ផាន"
        },
        {
            "barcode": "BBWS180203991",
            "dpc": "03013734901",
            "name": "សយ សារ៉ាក់"
        },
        {
            "barcode": "BBWS180203992",
            "dpc": "03013735001",
            "name": "សូរ​ សុភក្ត្រា"
        },
        {
            "barcode": "BBWS180203993",
            "dpc": "03013735101",
            "name": "តង ចិន្តា"
        },
        {
            "barcode": "BBWS180203994",
            "dpc": "03013735201",
            "name": "រើន ម៉ាឡា"
        },
        {
            "barcode": "BBWS180203995",
            "dpc": "03013735301",
            "name": "អេង សោភា"
        },
        {
            "barcode": "BBWS180203996",
            "dpc": "03013735401",
            "name": "អ៊ូ វណ្ណារ៉ា"
        },
        {
            "barcode": "BBWS180203997",
            "dpc": "03013735501",
            "name": "ឈឹម ចាន់ចរិយា"
        },
        {
            "barcode": "BBWS180203998",
            "dpc": "03013735601",
            "name": "ឈីវ រចនា"
        },
        {
            "barcode": "BBWS180203999",
            "dpc": "03013735801",
            "name": "ចាយ អាន"
        },
        {
            "barcode": "BBWS180204000",
            "dpc": "03013735901",
            "name": "កែន ឆើយ"
        },
        {
            "barcode": "BBWS180204001",
            "dpc": "03013736001",
            "name": "ចង់ រឿត"
        },
        {
            "barcode": "BBWS180204002",
            "dpc": "03013736101",
            "name": "ទូច អុល"
        },
        {
            "barcode": "BBWS180204003",
            "dpc": "03013736201",
            "name": "ឈឿន ភូ"
        },
        {
            "barcode": "BBWS180204004",
            "dpc": "03013736301",
            "name": "ណាន់ ចិន្តា"
        },
        {
            "barcode": "BBWS180204005",
            "dpc": "03013736401",
            "name": "តូស សុផុន"
        },
        {
            "barcode": "BBWS180204006",
            "dpc": "03013736501",
            "name": "ម៉ន ផាន់ណា"
        },
        {
            "barcode": "BBWS180204007",
            "dpc": "03013736601",
            "name": "កែវ ណារត្ន័"
        },
        {
            "barcode": "BBWS180204008",
            "dpc": "03013736701",
            "name": "ព្រីង វណ្ណនី"
        },
        {
            "barcode": "BBWS180204009",
            "dpc": "03013736801",
            "name": "ញ៉ាន ហ៊ាន"
        },
        {
            "barcode": "BBWS180204010",
            "dpc": "03013736901",
            "name": "វ៉ាន់ សឿន"
        },
        {
            "barcode": "BBWS180204011",
            "dpc": "03013737001",
            "name": "ខឹង សំណាង"
        },
        {
            "barcode": "BBWS180204012",
            "dpc": "03013737101",
            "name": "ម៉ា វ៉ុង"
        },
        {
            "barcode": "BBWS180204013",
            "dpc": "03013737201",
            "name": "ឡាច វ៉ុង"
        },
        {
            "barcode": "BBWS180204014",
            "dpc": "03013737301",
            "name": "ឆែម សារឿត"
        },
        {
            "barcode": "BBWS180204015",
            "dpc": "03013737401",
            "name": "ខេង ពិសី"
        },
        {
            "barcode": "BBWS180204016",
            "dpc": "03013737501",
            "name": "ឆឺន ណាន់"
        },
        {
            "barcode": "BBWS180204017",
            "dpc": "03013737601",
            "name": "ឈួក វិចិត្រ"
        },
        {
            "barcode": "BBWS180204018",
            "dpc": "03013737701",
            "name": "ផុន សាលីម"
        },
        {
            "barcode": "BBWS180204019",
            "dpc": "03013737801",
            "name": "ប៉ិច ស៊ីហា"
        },
        {
            "barcode": "BBWS180204020",
            "dpc": "03013737901",
            "name": "សោម សុធា"
        },
        {
            "barcode": "BBWS180204021",
            "dpc": "03013738001",
            "name": "អុំ សៅរ៉ានី"
        },
        {
            "barcode": "BBWS180204022",
            "dpc": "03013738101",
            "name": "សាវ៉ាត ទីណា"
        },
        {
            "barcode": "BBWS180204023",
            "dpc": "03013738201",
            "name": "ឆែម រី"
        },
        {
            "barcode": "BBWS180204024",
            "dpc": "03013738301",
            "name": "ជា ប៉ូឡូ"
        },
        {
            "barcode": "BBWS180204025",
            "dpc": "03013738501",
            "name": "នៅ សេដ្ឋា"
        },
        {
            "barcode": "BBWS180204026",
            "dpc": "03013738601",
            "name": "នួម សំរិទ្ទ"
        },
        {
            "barcode": "BBWS180204027",
            "dpc": "03013738701",
            "name": "ខុម សុឃឿន"
        },
        {
            "barcode": "BBWS180204028",
            "dpc": "03013738801",
            "name": "សុខ ធីតា"
        },
        {
            "barcode": "BBWS180204029",
            "dpc": "03013738901",
            "name": "ជឹម ឈន"
        },
        {
            "barcode": "BBWS180204030",
            "dpc": "03013739001",
            "name": "អ៊ុន រី"
        },
        {
            "barcode": "BBWS180204031",
            "dpc": "03013739101",
            "name": "ជិន រិន"
        },
        {
            "barcode": "BBWS180204032",
            "dpc": "03013739201",
            "name": "ហម ធី"
        },
        {
            "barcode": "BBWS180204033",
            "dpc": "03013739401",
            "name": "ហូត​ វិច្ចិកា"
        },
        {
            "barcode": "BBWS180204034",
            "dpc": "03013739501",
            "name": "ម៉ាត ម៉ារីយ៉ង"
        },
        {
            "barcode": "BBWS180204035",
            "dpc": "03013739601",
            "name": "ជន រី"
        },
        {
            "barcode": "BBWS180204036",
            "dpc": "03013739801",
            "name": "ត្រឿង រដ្ខសាស្តា"
        },
        {
            "barcode": "BBWS180204037",
            "dpc": "03013739901",
            "name": "ទ្រឿង រដ្ខតេវី"
        },
        {
            "barcode": "BBWS180204038",
            "dpc": "03013740001",
            "name": "ប៉ាច ចិន្តា"
        },
        {
            "barcode": "BBWS180204039",
            "dpc": "03013740101",
            "name": "កង់ ចំរើន"
        },
        {
            "barcode": "BBWS180204040",
            "dpc": "03013740301",
            "name": "អ៊ី ហ្គិចលីម"
        },
        {
            "barcode": "BBWS180204041",
            "dpc": "03013740401",
            "name": "ព្រហ្ម ស៊ីនណាត"
        },
        {
            "barcode": "BBWS180204042",
            "dpc": "03013740501",
            "name": "ញូង ចំរើន"
        },
        {
            "barcode": "BBWS180204043",
            "dpc": "03013740601",
            "name": "វ៉ាន ធៀវ"
        },
        {
            "barcode": "BBWS180204044",
            "dpc": "03013740701",
            "name": "នុត នាង ៣"
        },
        {
            "barcode": "BBWS180204045",
            "dpc": "03013740801",
            "name": "ង៉ែត វ៉ានថាវ"
        },
        {
            "barcode": "BBWS180204046",
            "dpc": "03013740901",
            "name": "គឹម សុខា"
        },
        {
            "barcode": "BBWS180204047",
            "dpc": "03013741001",
            "name": "ចាន់ ហួយ"
        },
        {
            "barcode": "BBWS180204048",
            "dpc": "03013741101",
            "name": "ណន សុនាថ"
        },
        {
            "barcode": "BBWS180204049",
            "dpc": "03013741301",
            "name": "រស វណ្ណរ៉ា"
        },
        {
            "barcode": "BBWS180204050",
            "dpc": "03013741401",
            "name": "ផា បាណូ"
        },
        {
            "barcode": "BBWS180204051",
            "dpc": "03013741501",
            "name": "រើយ រឿត"
        },
        {
            "barcode": "BBWS180204052",
            "dpc": "03013741601",
            "name": "មុត សម្បត្តិ"
        },
        {
            "barcode": "BBWS180204053",
            "dpc": "03013741701",
            "name": "ថេត ណាវ៉ាន់នី"
        },
        {
            "barcode": "BBWS180204054",
            "dpc": "03013741801",
            "name": "រៀម សុធា"
        },
        {
            "barcode": "BBWS180204055",
            "dpc": "03013741901",
            "name": "ម៉ៅ គន្ធា"
        },
        {
            "barcode": "BBWS180204056",
            "dpc": "03013742001",
            "name": "ជួន ប៊ុនធួក"
        },
        {
            "barcode": "BBWS180204057",
            "dpc": "03013742101",
            "name": "វុត ណៃ"
        },
        {
            "barcode": "BBWS180204058",
            "dpc": "03013742201",
            "name": "អឿម ជីម"
        },
        {
            "barcode": "BBWS180204059",
            "dpc": "03013742301",
            "name": "ចៅ តីញឹម"
        },
        {
            "barcode": "BBWS180204060",
            "dpc": "03013742401",
            "name": "មឿន ពុយ"
        },
        {
            "barcode": "BBWS180204061",
            "dpc": "03013742501",
            "name": "ហឿង សារ៉ាត់៣"
        },
        {
            "barcode": "BBWS180204062",
            "dpc": "03013742601",
            "name": "ទេព សុខុម"
        },
        {
            "barcode": "BBWS180204063",
            "dpc": "03013742701",
            "name": "ប៊ុន រិទ្ធលួន"
        },
        {
            "barcode": "BBWS180204064",
            "dpc": "03013742801",
            "name": "សូ សាវឿត"
        },
        {
            "barcode": "BBWS180204065",
            "dpc": "03013743001",
            "name": "ប៊ុត សុម៉ាលី"
        },
        {
            "barcode": "BBWS180204066",
            "dpc": "03013743101",
            "name": "ឆំ ជី"
        },
        {
            "barcode": "BBWS180204067",
            "dpc": "03013743201",
            "name": "ទុយ ពៅ"
        },
        {
            "barcode": "BBWS180204068",
            "dpc": "03013743401",
            "name": "ទុយ ហាន"
        },
        {
            "barcode": "BBWS180204069",
            "dpc": "03013743501",
            "name": "ង៉ា សិញ"
        },
        {
            "barcode": "BBWS180204070",
            "dpc": "03013743601",
            "name": "កៀង សាលួម"
        },
        {
            "barcode": "BBWS180204071",
            "dpc": "03013743901",
            "name": "សួ ស្រីលីន"
        },
        {
            "barcode": "BBWS180204072",
            "dpc": "03013744001",
            "name": "ផៃ មុន្នី"
        },
        {
            "barcode": "BBWS180204073",
            "dpc": "03013744101",
            "name": "កែវ វណ្ណារី"
        },
        {
            "barcode": "BBWS180204074",
            "dpc": "03013744201",
            "name": "ម៉ឹង វិត្ត"
        },
        {
            "barcode": "BBWS180204075",
            "dpc": "03013744401",
            "name": "សួន ដារ៉ា"
        },
        {
            "barcode": "BBWS180204076",
            "dpc": "03013744501",
            "name": "ហួន ថូយ"
        },
        {
            "barcode": "BBWS180204077",
            "dpc": "03013744601",
            "name": "ជៀម ប៉ិ"
        },
        {
            "barcode": "BBWS180204078",
            "dpc": "03013744701",
            "name": "មាន ចិន្តាមុន្នី"
        },
        {
            "barcode": "BBWS180204079",
            "dpc": "03013744801",
            "name": "នូ ដាលីន"
        },
        {
            "barcode": "BBWS180204080",
            "dpc": "03013744901",
            "name": "ពេជ្រ វណ្ណី"
        },
        {
            "barcode": "BBWS180204081",
            "dpc": "03013745001",
            "name": "ហេង សុខន"
        },
        {
            "barcode": "BBWS180204082",
            "dpc": "03013745101",
            "name": "សឿង ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180204083",
            "dpc": "03013745201",
            "name": "សៀវ យី"
        },
        {
            "barcode": "BBWS180204084",
            "dpc": "03013745301",
            "name": "ប៉ែន សោភ័ណ្ឌ"
        },
        {
            "barcode": "BBWS180204085",
            "dpc": "03013745401",
            "name": "ប៊ុ​ន ជ្រឹង"
        },
        {
            "barcode": "BBWS180204086",
            "dpc": "03013745501",
            "name": "មុំ ចាន់នីតា"
        },
        {
            "barcode": "BBWS180204087",
            "dpc": "03013745601",
            "name": "ទុំ លីដា"
        },
        {
            "barcode": "BBWS180204088",
            "dpc": "03013745701",
            "name": "តៀត ស្រស់"
        },
        {
            "barcode": "BBWS180204089",
            "dpc": "03013745801",
            "name": "សេន បូរី"
        },
        {
            "barcode": "BBWS180204090",
            "dpc": "03013745901",
            "name": "ញ៉ែម សារឿន"
        },
        {
            "barcode": "BBWS180204091",
            "dpc": "03013746001",
            "name": "រឿន ប៊ុនរ័ត្ន"
        },
        {
            "barcode": "BBWS180204092",
            "dpc": "03013746101",
            "name": "ម៉ាត ថាន់"
        },
        {
            "barcode": "BBWS180204093",
            "dpc": "03013746201",
            "name": "ដាញ់ សុទ្ធាវី"
        },
        {
            "barcode": "BBWS180204094",
            "dpc": "03013746301",
            "name": "កុយ ថន"
        },
        {
            "barcode": "BBWS180204095",
            "dpc": "03013746401",
            "name": "ឈឹន ចំរើន"
        },
        {
            "barcode": "BBWS180204096",
            "dpc": "03013746501",
            "name": "លី កៀត"
        },
        {
            "barcode": "BBWS180204097",
            "dpc": "03013746701",
            "name": "សុខ ពឿន"
        },
        {
            "barcode": "BBWS180204098",
            "dpc": "03013746801",
            "name": "ណែម បុត្រ"
        },
        {
            "barcode": "BBWS180204099",
            "dpc": "03013746901",
            "name": "យ៉េន សាម៉ុន"
        },
        {
            "barcode": "BBWS180204100",
            "dpc": "03013747001",
            "name": "ទេព ហុង"
        },
        {
            "barcode": "BBWS180204101",
            "dpc": "03013747101",
            "name": "ទូច ចុះ"
        },
        {
            "barcode": "BBWS180204102",
            "dpc": "03013747201",
            "name": "យឿន ច្រឹប"
        },
        {
            "barcode": "BBWS180204103",
            "dpc": "03013747301",
            "name": "អឿង សុឆាន់"
        },
        {
            "barcode": "BBWS180204104",
            "dpc": "03013747401",
            "name": "ឆេង ឆៃលី"
        },
        {
            "barcode": "BBWS180204105",
            "dpc": "03013747501",
            "name": "ទី គីមហួង"
        },
        {
            "barcode": "BBWS180204106",
            "dpc": "03013747601",
            "name": "ម៉េង ផល្លីន"
        },
        {
            "barcode": "BBWS180204107",
            "dpc": "03013747701",
            "name": "ទេស ហុង"
        },
        {
            "barcode": "BBWS180204108",
            "dpc": "03013747801",
            "name": "មុំ ចំរើន"
        },
        {
            "barcode": "BBWS180204109",
            "dpc": "03013747901",
            "name": "ស៊ីម ស៊ីត្រា"
        },
        {
            "barcode": "BBWS180204110",
            "dpc": "03013748001",
            "name": "ជួប ស្រីរត្ន័"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
