let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=

    [
        {
            "barcode": "BBWS180201684",
            "dpc": "03023800101",
            "name": "ហ៊ឹម ម៉ានី"
        },
        {
            "barcode": "BBWS180201685",
            "dpc": "03023800301",
            "name": "ម៉ក់ ម៉េងហុង"
        },
        {
            "barcode": "BBWS180201686",
            "dpc": "03023800401",
            "name": "ប៊ុត ចន្ធី"
        },
        {
            "barcode": "BBWS180201687",
            "dpc": "03023800601",
            "name": "ផាត់ ម៉ៅ"
        },
        {
            "barcode": "BBWS180201688",
            "dpc": "03023800701",
            "name": "ផាត រឿន"
        },
        {
            "barcode": "BBWS180201689",
            "dpc": "03023800801",
            "name": "អ៊ឹង ចាន់សុខា"
        },
        {
            "barcode": "BBWS180201690",
            "dpc": "03023800901",
            "name": "អ៊ាត ណារ៉ែន"
        },
        {
            "barcode": "BBWS180201691",
            "dpc": "03023801001",
            "name": "ហ៊ឹម ប៉េងគា"
        },
        {
            "barcode": "BBWS180201692",
            "dpc": "03023801101",
            "name": "ហុង ចានរី"
        },
        {
            "barcode": "BBWS180201693",
            "dpc": "03023801201",
            "name": "លឹម គឹមស៊ុន"
        },
        {
            "barcode": "BBWS180201694",
            "dpc": "03023801301",
            "name": "អ៊ឹម ឈត"
        },
        {
            "barcode": "BBWS180201695",
            "dpc": "03023801401",
            "name": "គុជ ក្អាត់"
        },
        {
            "barcode": "BBWS180201696",
            "dpc": "03023801501",
            "name": "អន បូណា"
        },
        {
            "barcode": "BBWS180201697",
            "dpc": "03023801601",
            "name": "ហម រដ្ឋ"
        },
        {
            "barcode": "BBWS180201698",
            "dpc": "03023801701",
            "name": "ឡុញ សុវណ្ណ"
        },
        {
            "barcode": "BBWS180201699",
            "dpc": "03023801801",
            "name": "ហម លាង"
        },
        {
            "barcode": "BBWS180201700",
            "dpc": "03023801901",
            "name": "ហម សមរំ"
        },
        {
            "barcode": "BBWS180201701",
            "dpc": "03023802001",
            "name": "រើន សាវុធ"
        },
        {
            "barcode": "BBWS180201702",
            "dpc": "03023802101",
            "name": "រឿង មិត្ត"
        },
        {
            "barcode": "BBWS180201703",
            "dpc": "03023802201",
            "name": "កែវ លឿត"
        },
        {
            "barcode": "BBWS180201704",
            "dpc": "03023802401",
            "name": "សាំង ខាន់"
        },
        {
            "barcode": "BBWS180201705",
            "dpc": "03023802501",
            "name": "មី មៀច"
        },
        {
            "barcode": "BBWS180201706",
            "dpc": "03023802601",
            "name": "មៀច ប៊ុនរៀម"
        },
        {
            "barcode": "BBWS180201707",
            "dpc": "03023802701",
            "name": "ស៊ីម សាខន"
        },
        {
            "barcode": "BBWS180201708",
            "dpc": "03023802801",
            "name": "ផេង សុខហេង"
        },
        {
            "barcode": "BBWS180201709",
            "dpc": "03023802901",
            "name": "លី គឹមលីន"
        },
        {
            "barcode": "BBWS180201710",
            "dpc": "03023803001",
            "name": "ភឹម ថង"
        },
        {
            "barcode": "BBWS180201711",
            "dpc": "03023803401",
            "name": "ឡេង ព្រំមាល័យ"
        },
        {
            "barcode": "BBWS180201712",
            "dpc": "03023803501",
            "name": "អ៊ុក មន្ថា"
        },
        {
            "barcode": "BBWS180201713",
            "dpc": "03023803601",
            "name": "សាយ អួម"
        },
        {
            "barcode": "BBWS180201714",
            "dpc": "03023803701",
            "name": "លឹម នាង"
        },
        {
            "barcode": "BBWS180201715",
            "dpc": "03023803801",
            "name": "ហួត រី"
        },
        {
            "barcode": "BBWS180201716",
            "dpc": "03023803901",
            "name": "ស្រី សមសិទ្ធ"
        },
        {
            "barcode": "BBWS180201717",
            "dpc": "03023804101",
            "name": "ឆាយ សាន"
        },
        {
            "barcode": "BBWS180201718",
            "dpc": "03023804201",
            "name": "ហាក់ លី"
        },
        {
            "barcode": "BBWS180201719",
            "dpc": "03023804301",
            "name": "សេង ថា"
        },
        {
            "barcode": "BBWS180201720",
            "dpc": "03023804401",
            "name": "យ៉ន ពៅ"
        },
        {
            "barcode": "BBWS180201721",
            "dpc": "03023804501",
            "name": "កូយ វិបុល"
        },
        {
            "barcode": "BBWS180201722",
            "dpc": "03023804601",
            "name": "លី វណ្ណា"
        },
        {
            "barcode": "BBWS180201723",
            "dpc": "03023804701",
            "name": "ឈិញ លយ"
        },
        {
            "barcode": "BBWS180201724",
            "dpc": "03023804801",
            "name": "រិន ភួង"
        },
        {
            "barcode": "BBWS180201725",
            "dpc": "03023805001",
            "name": "តិច សារ៉ាវុធ"
        },
        {
            "barcode": "BBWS180201726",
            "dpc": "03023805101",
            "name": "យ៉ន វុទ្ធី"
        },
        {
            "barcode": "BBWS180201727",
            "dpc": "03023805201",
            "name": "ស៊ិន សាយ"
        },
        {
            "barcode": "BBWS180201728",
            "dpc": "03023805301",
            "name": "អ៊ុង កាចរ"
        },
        {
            "barcode": "BBWS180201729",
            "dpc": "03023805501",
            "name": "ណម លីន"
        },
        {
            "barcode": "BBWS180201730",
            "dpc": "03023805601",
            "name": "ចេង អូន"
        },
        {
            "barcode": "BBWS180201731",
            "dpc": "03023805701",
            "name": "មុត សោភ័ណ្ឌ"
        },
        {
            "barcode": "BBWS180201732",
            "dpc": "03023805801",
            "name": "នួ បូរី"
        },
        {
            "barcode": "BBWS180201733",
            "dpc": "03023805901",
            "name": "ឡុញ សុវណ្ណ"
        },
        {
            "barcode": "BBWS180201734",
            "dpc": "03023806001",
            "name": "យឹម ប៊ុនឈឿន"
        },
        {
            "barcode": "BBWS180201735",
            "dpc": "03023806101",
            "name": "វុន ហ៊ូវ"
        },
        {
            "barcode": "BBWS180201736",
            "dpc": "03023806201",
            "name": "ស៊ុន សម្ឋស្ស"
        },
        {
            "barcode": "BBWS180201737",
            "dpc": "03023806301",
            "name": "ឈឹម គីមស្រីម"
        },
        {
            "barcode": "BBWS180201738",
            "dpc": "03023806501",
            "name": "ភិន ចាន់សេដា"
        },
        {
            "barcode": "BBWS180201739",
            "dpc": "03023806601",
            "name": "នួន វៃ"
        },
        {
            "barcode": "BBWS180201740",
            "dpc": "03023806801",
            "name": "ឈុត សេ"
        },
        {
            "barcode": "BBWS180201741",
            "dpc": "03023806901",
            "name": "គង់ ហេង"
        },
        {
            "barcode": "BBWS180201742",
            "dpc": "03023807001",
            "name": "រិន វ៉ានធឿន"
        },
        {
            "barcode": "BBWS180201743",
            "dpc": "03023807101",
            "name": "រិន វ៉ាន់ថា"
        },
        {
            "barcode": "BBWS180201744",
            "dpc": "03023807201",
            "name": "អ៊ុង ចាន់ផល"
        },
        {
            "barcode": "BBWS180201745",
            "dpc": "03023807301",
            "name": "សយ សុគន្ធា"
        },
        {
            "barcode": "BBWS180201746",
            "dpc": "03023807401",
            "name": "យី ហេង"
        },
        {
            "barcode": "BBWS180201747",
            "dpc": "03023807501",
            "name": "ផាត សុផល"
        },
        {
            "barcode": "BBWS180201748",
            "dpc": "03023807601",
            "name": "ផន សុភា"
        },
        {
            "barcode": "BBWS180201749",
            "dpc": "03023807701",
            "name": "ផន ផា"
        },
        {
            "barcode": "BBWS180201750",
            "dpc": "03023807801",
            "name": "បូរ សក្កិវណ្ណា"
        },
        {
            "barcode": "BBWS180201751",
            "dpc": "03023807901",
            "name": "ថុក ប៊ុនរីវ"
        },
        {
            "barcode": "BBWS180201752",
            "dpc": "03023808001",
            "name": "អ៊ុំ ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180201753",
            "dpc": "03023808101",
            "name": "យី អ៊ី"
        },
        {
            "barcode": "BBWS180201754",
            "dpc": "03023808201",
            "name": "ម៉ៅ មឿន"
        },
        {
            "barcode": "BBWS180201755",
            "dpc": "03023808401",
            "name": "ព្រហ្ម វិចិត្រ"
        },
        {
            "barcode": "BBWS180201756",
            "dpc": "03023808601",
            "name": "លី ប៊ុនឡេង"
        },
        {
            "barcode": "BBWS180201757",
            "dpc": "03023808701",
            "name": "សុត លាប"
        },
        {
            "barcode": "BBWS180201758",
            "dpc": "03023808801",
            "name": "ប្រាក់ ស្រ៊ូ"
        },
        {
            "barcode": "BBWS180201759",
            "dpc": "03023809101",
            "name": "ចាន់ សុវណ្ណ"
        },
        {
            "barcode": "BBWS180201760",
            "dpc": "03023809201",
            "name": "ឡុច រ៉ា"
        },
        {
            "barcode": "BBWS180201761",
            "dpc": "03023809301",
            "name": "សាប់ សុត"
        },
        {
            "barcode": "BBWS180201762",
            "dpc": "03023809401",
            "name": "យិប ចំរើន"
        },
        {
            "barcode": "BBWS180201763",
            "dpc": "03023809501",
            "name": "យិប ដាវី"
        },
        {
            "barcode": "BBWS180201764",
            "dpc": "03023809601",
            "name": "គង់ គន្ធា"
        },
        {
            "barcode": "BBWS180201765",
            "dpc": "03023809701",
            "name": "ប្រម សឺន"
        },
        {
            "barcode": "BBWS180201766",
            "dpc": "03023809801",
            "name": "ស៊ឹម ចន្ធី"
        },
        {
            "barcode": "BBWS180201767",
            "dpc": "03023809901",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "BBWS180201768",
            "dpc": "03023810001",
            "name": "សេង ហ៊ូវ"
        },
        {
            "barcode": "BBWS180201769",
            "dpc": "03023810101",
            "name": "អ៊ន ឌី"
        },
        {
            "barcode": "BBWS180201770",
            "dpc": "03023810201",
            "name": "អៀង សាខន"
        },
        {
            "barcode": "BBWS180201771",
            "dpc": "03023810401",
            "name": "លី ថារ៉ា"
        },
        {
            "barcode": "BBWS180201772",
            "dpc": "03023810501",
            "name": "រី រ៉ា"
        },
        {
            "barcode": "BBWS180201773",
            "dpc": "03023810601",
            "name": "ថៃ សាវី"
        },
        {
            "barcode": "BBWS180201774",
            "dpc": "03023810801",
            "name": "ឡុង សារុន"
        },
        {
            "barcode": "BBWS180201775",
            "dpc": "03023810901",
            "name": "យ៉ាន រ៉ហ្វាន់"
        },
        {
            "barcode": "BBWS180201776",
            "dpc": "03023811001",
            "name": "សើរ និល"
        },
        {
            "barcode": "BBWS180201777",
            "dpc": "03023811101",
            "name": "ស៊ត ម៉ាត់ឃីត"
        },
        {
            "barcode": "BBWS180201778",
            "dpc": "03023811201",
            "name": "សើរ មីន"
        },
        {
            "barcode": "BBWS180201779",
            "dpc": "03023811301",
            "name": "សេន ហាន"
        },
        {
            "barcode": "BBWS180201780",
            "dpc": "03023811401",
            "name": "ណុស ជា"
        },
        {
            "barcode": "BBWS180201781",
            "dpc": "03023811501",
            "name": "រ៉ូន ម៉ៅ"
        },
        {
            "barcode": "BBWS180201782",
            "dpc": "03023811601",
            "name": "ខឹម ភាព"
        },
        {
            "barcode": "BBWS180201783",
            "dpc": "03023811701",
            "name": "ឡុង ស៊ុនថារ៉ា"
        },
        {
            "barcode": "BBWS180201784",
            "dpc": "03023811901",
            "name": "យី ម៉ាតស៊ត"
        },
        {
            "barcode": "BBWS180201785",
            "dpc": "03023812001",
            "name": "ឡោះ រី"
        },
        {
            "barcode": "BBWS180201786",
            "dpc": "03023812101",
            "name": "ហា សាន់"
        },
        {
            "barcode": "BBWS180201787",
            "dpc": "03023812201",
            "name": "ហឿង សុឃាង"
        },
        {
            "barcode": "BBWS180201788",
            "dpc": "03023812301",
            "name": "ម៉ាត់ ស្មានឯល"
        },
        {
            "barcode": "BBWS180201789",
            "dpc": "03023812401",
            "name": "វឿត ដារ៉ា"
        },
        {
            "barcode": "BBWS180201790",
            "dpc": "03023812501",
            "name": "វឿត ណាសៀត"
        },
        {
            "barcode": "BBWS180201791",
            "dpc": "03023812601",
            "name": "អ៊ុច វណ្ណះ"
        },
        {
            "barcode": "BBWS180201792",
            "dpc": "03023812701",
            "name": "ម៉ើ ប៉ែល"
        },
        {
            "barcode": "BBWS180201793",
            "dpc": "03023812801",
            "name": "ចៅ សម្បត្តិ"
        },
        {
            "barcode": "BBWS180201794",
            "dpc": "03023812901",
            "name": "សន រិត"
        },
        {
            "barcode": "BBWS180201795",
            "dpc": "03023813001",
            "name": "សើ គុជ"
        },
        {
            "barcode": "BBWS180201796",
            "dpc": "03023813101",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "BBWS180201797",
            "dpc": "03023813401",
            "name": "ទ្រី ប៊ុនតុង"
        },
        {
            "barcode": "BBWS180201798",
            "dpc": "03023813501",
            "name": "វណ្ណ សំអាត"
        },
        {
            "barcode": "BBWS180201799",
            "dpc": "03023813601",
            "name": "រិទ្ធិ សម្ភា"
        },
        {
            "barcode": "BBWS180201800",
            "dpc": "03023813701",
            "name": "ណាង លីណា"
        },
        {
            "barcode": "BBWS180201801",
            "dpc": "03023813801",
            "name": "វុធ វណ្ណា"
        },
        {
            "barcode": "BBWS180201802",
            "dpc": "03023814001",
            "name": "ញ៉ែម ម៉េងគា១"
        },
        {
            "barcode": "BBWS180201803",
            "dpc": "03023814101",
            "name": "ធិន ទី"
        },
        {
            "barcode": "BBWS180201804",
            "dpc": "03023814301",
            "name": "ភាជ សឿត"
        },
        {
            "barcode": "BBWS180201805",
            "dpc": "03023814401",
            "name": "ផ្លុង ចំរើន១"
        },
        {
            "barcode": "BBWS180201806",
            "dpc": "03023814501",
            "name": "ព្រំ មន្និរិទ្ធ"
        },
        {
            "barcode": "BBWS180201807",
            "dpc": "03023814601",
            "name": "ផ្លុង សារឿប"
        },
        {
            "barcode": "BBWS180201808",
            "dpc": "03023814701",
            "name": "ជ័យ សេងហាប់"
        },
        {
            "barcode": "BBWS180201809",
            "dpc": "03023814801",
            "name": "ហួន បណ្ឌិត"
        },
        {
            "barcode": "BBWS180201810",
            "dpc": "03023814901",
            "name": "តាន់ គឹមទៀង"
        },
        {
            "barcode": "BBWS180201811",
            "dpc": "03023815001",
            "name": "កៀន យឿង"
        },
        {
            "barcode": "BBWS180201812",
            "dpc": "03023815101",
            "name": "ម៉ក់ សុវណ្ណ"
        },
        {
            "barcode": "BBWS180201813",
            "dpc": "03023815201",
            "name": "ជីង ម៉ូលីរតន៏"
        },
        {
            "barcode": "BBWS180201814",
            "dpc": "03023815301",
            "name": "នៅ ចិនរ៉ាត់"
        },
        {
            "barcode": "BBWS180201815",
            "dpc": "03023815501",
            "name": "សឿន សុរិទ្ធ"
        },
        {
            "barcode": "BBWS180201816",
            "dpc": "03023815601",
            "name": "ប៊ូ ស៊ិនដា"
        },
        {
            "barcode": "BBWS180201817",
            "dpc": "03023815801",
            "name": "ឈូក ចំរើនរត័្ន"
        },
        {
            "barcode": "BBWS180201818",
            "dpc": "03023815901",
            "name": "ព្រេង ចិន្តា"
        },
        {
            "barcode": "BBWS180201819",
            "dpc": "03023816001",
            "name": "ប្រេង ប្រសិទ្ធ"
        },
        {
            "barcode": "BBWS180201820",
            "dpc": "03023816101",
            "name": "ចាប សាមឿន"
        },
        {
            "barcode": "BBWS180201821",
            "dpc": "03023816201",
            "name": "សុខ វុទ្ធី"
        },
        {
            "barcode": "BBWS180201822",
            "dpc": "03023816301",
            "name": "សៀង វន្នី"
        },
        {
            "barcode": "BBWS180201823",
            "dpc": "03023816401",
            "name": "ញ៉ែម មេងគាង២"
        },
        {
            "barcode": "BBWS180201824",
            "dpc": "03023816601",
            "name": "ឌឿន សារី"
        },
        {
            "barcode": "BBWS180201825",
            "dpc": "03023816801",
            "name": "តោ សាវ៉ាត់"
        },
        {
            "barcode": "BBWS180201826",
            "dpc": "03023816901",
            "name": "អុំ សារ៉ឹម"
        },
        {
            "barcode": "BBWS180201827",
            "dpc": "03023817001",
            "name": "អ៊ុំ ជីម"
        },
        {
            "barcode": "BBWS180201828",
            "dpc": "03023817101",
            "name": "រស់ គឹមឡេង"
        },
        {
            "barcode": "BBWS180201829",
            "dpc": "03023817201",
            "name": "ឆៃ សុផាត"
        },
        {
            "barcode": "BBWS180201830",
            "dpc": "03023817401",
            "name": "នង ចិន្តា"
        },
        {
            "barcode": "BBWS180201831",
            "dpc": "03023817501",
            "name": "ណុប សុខុនណី"
        },
        {
            "barcode": "BBWS180201832",
            "dpc": "03023817601",
            "name": "ណុប សុខុន"
        },
        {
            "barcode": "BBWS180201833",
            "dpc": "03023817701",
            "name": "នង ហូវ"
        },
        {
            "barcode": "BBWS180201834",
            "dpc": "03023817801",
            "name": "ជឿន ហេង"
        },
        {
            "barcode": "BBWS180201835",
            "dpc": "03023818001",
            "name": "ហម សុវណ្ណ"
        },
        {
            "barcode": "BBWS180201836",
            "dpc": "03023818501",
            "name": "ឡាក សុភី"
        },
        {
            "barcode": "BBWS180201837",
            "dpc": "03023818601",
            "name": "អ៊ឹង ម៉ាលី"
        },
        {
            "barcode": "BBWS180201838",
            "dpc": "03023818701",
            "name": "ឌុក បូរ៉ុម"
        },
        {
            "barcode": "BBWS180201839",
            "dpc": "03023818801",
            "name": "សុខ ភូសិត"
        },
        {
            "barcode": "BBWS180201840",
            "dpc": "03023819101",
            "name": "ដិប សារឿន"
        },
        {
            "barcode": "BBWS180201841",
            "dpc": "03023819201",
            "name": "មឿន រូម"
        },
        {
            "barcode": "BBWS180201842",
            "dpc": "03023819301",
            "name": "សួន សារិន"
        },
        {
            "barcode": "BBWS180201843",
            "dpc": "03023819401",
            "name": "ហៀន ណារី"
        },
        {
            "barcode": "BBWS180201844",
            "dpc": "03023819501",
            "name": "ហៀន ណារ៉ាត"
        },
        {
            "barcode": "BBWS180201845",
            "dpc": "03023819801",
            "name": "រឿត សាវ៉ើន"
        },
        {
            "barcode": "BBWS180201846",
            "dpc": "03023820001",
            "name": "វែង សុភ័ណ"
        },
        {
            "barcode": "BBWS180201847",
            "dpc": "03023820701",
            "name": "ធិប ច្រិប"
        },
        {
            "barcode": "BBWS180201848",
            "dpc": "03023820901",
            "name": "ម៉ូ ចាន់ថង"
        },
        {
            "barcode": "BBWS180201849",
            "dpc": "03023821001",
            "name": "ម៉ូ ខឿត"
        },
        {
            "barcode": "BBWS180201850",
            "dpc": "03023821201",
            "name": "ផា ចំរើន"
        },
        {
            "barcode": "BBWS180201851",
            "dpc": "03023821301",
            "name": "ផ្លុង សុខ"
        },
        {
            "barcode": "BBWS180201852",
            "dpc": "03023821601",
            "name": "ទូច ប៊ុនអឿត"
        },
        {
            "barcode": "BBWS180201853",
            "dpc": "03023821801",
            "name": "នៅ សារឿង"
        },
        {
            "barcode": "BBWS180201854",
            "dpc": "03023821901",
            "name": "ជា សារ៉ាត់"
        },
        {
            "barcode": "BBWS180201855",
            "dpc": "03023822101",
            "name": "វ៉ាន់ សុភា"
        },
        {
            "barcode": "BBWS180201856",
            "dpc": "03023822201",
            "name": "ប៉ិច សាលឿន"
        },
        {
            "barcode": "BBWS180201857",
            "dpc": "03023822301",
            "name": "យ៉ាន់ លង"
        },
        {
            "barcode": "BBWS180201858",
            "dpc": "03023822401",
            "name": "យ៉ាន់ ជីម៉ុយ"
        },
        {
            "barcode": "BBWS180201859",
            "dpc": "03023822501",
            "name": "មុត សំណាង"
        },
        {
            "barcode": "BBWS180201860",
            "dpc": "03023822701",
            "name": "ធា ភីរម្យ"
        },
        {
            "barcode": "BBWS180201861",
            "dpc": "03023823001",
            "name": "ម៉ាង ទ័រ"
        },
        {
            "barcode": "BBWS180201862",
            "dpc": "03023823101",
            "name": "អ៊ុន សឿង"
        },
        {
            "barcode": "BBWS180201863",
            "dpc": "03023823201",
            "name": "សុខ ភឿន"
        },
        {
            "barcode": "BBWS180201864",
            "dpc": "03023823401",
            "name": "ឡាន់ ចាន់ឌីធារ៉ា"
        },
        {
            "barcode": "BBWS180201865",
            "dpc": "03023823501",
            "name": "សំ ចាន់រិទ្ធ"
        },
        {
            "barcode": "BBWS180201866",
            "dpc": "03023823601",
            "name": "សែម ប៊ុនសេង"
        },
        {
            "barcode": "BBWS180201867",
            "dpc": "03023823701",
            "name": "យឿន ជឿង"
        },
        {
            "barcode": "BBWS180201868",
            "dpc": "03023823801",
            "name": "ហ៊ាង ម៉ាលីន"
        },
        {
            "barcode": "BBWS180201869",
            "dpc": "03023823901",
            "name": "ជា សវី"
        },
        {
            "barcode": "BBWS180201870",
            "dpc": "03023824001",
            "name": "ហេង ដាលីស"
        },
        {
            "barcode": "BBWS180201871",
            "dpc": "03023824101",
            "name": "មឿន បូរី"
        },
        {
            "barcode": "BBWS180201872",
            "dpc": "03023824201",
            "name": "ខ្លូត ប៉ាន"
        },
        {
            "barcode": "BBWS180201873",
            "dpc": "03023824301",
            "name": "ប៊ុន គន្ធា"
        },
        {
            "barcode": "BBWS180201874",
            "dpc": "03023824401",
            "name": "ប៉ិច ឃន"
        },
        {
            "barcode": "BBWS180201875",
            "dpc": "03023824501",
            "name": "ពុធ ទ្រី"
        },
        {
            "barcode": "BBWS180201876",
            "dpc": "03023824601",
            "name": "អ៊ុំ សាវែន"
        },
        {
            "barcode": "BBWS180201877",
            "dpc": "03023824701",
            "name": "ខ្លួត ផាន់ណា"
        },
        {
            "barcode": "BBWS180201878",
            "dpc": "03023824901",
            "name": "ប៉ិ រុន"
        },
        {
            "barcode": "BBWS180201879",
            "dpc": "03023825301",
            "name": "លាង​ ហេង"
        },
        {
            "barcode": "BBWS180201880",
            "dpc": "03023825501",
            "name": "ជា ស៊ីនិត"
        },
        {
            "barcode": "BBWS180201881",
            "dpc": "03023825601",
            "name": "មឿន ឡា"
        },
        {
            "barcode": "BBWS180201882",
            "dpc": "03023825801",
            "name": "វ៉ន ឈ្នាង"
        },
        {
            "barcode": "BBWS180201883",
            "dpc": "03023825901",
            "name": "រ៉ា ធីណា"
        },
        {
            "barcode": "BBWS180201884",
            "dpc": "03023826001",
            "name": "នូ សុខុម"
        },
        {
            "barcode": "BBWS180201885",
            "dpc": "03023826101",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "BBWS180201886",
            "dpc": "03023826301",
            "name": "ព្រេង ដារ៉ា"
        },
        {
            "barcode": "BBWS180201887",
            "dpc": "03023826401",
            "name": "រស់ អឿន"
        },
        {
            "barcode": "BBWS180201888",
            "dpc": "03023826501",
            "name": "កុយ ចំរើន"
        },
        {
            "barcode": "BBWS180201889",
            "dpc": "03023826601",
            "name": "គឹម ផល្លា"
        },
        {
            "barcode": "BBWS180201890",
            "dpc": "03023826701",
            "name": "កុយ សាន"
        },
        {
            "barcode": "BBWS180201891",
            "dpc": "03023826801",
            "name": "ព្រំ វី"
        },
        {
            "barcode": "BBWS180201892",
            "dpc": "03023826901",
            "name": "ឌី ស៊ីណា"
        },
        {
            "barcode": "BBWS180201893",
            "dpc": "03023827101",
            "name": "ឃឿម សុខុម"
        },
        {
            "barcode": "BBWS180201894",
            "dpc": "03023827201",
            "name": "អ៊ុច ពៅ"
        },
        {
            "barcode": "BBWS180201895",
            "dpc": "03023827301",
            "name": "ជា សុគន្ធា"
        },
        {
            "barcode": "BBWS180201896",
            "dpc": "03023827401",
            "name": "ប៉ិច សុខុម"
        },
        {
            "barcode": "BBWS180201897",
            "dpc": "03023827501",
            "name": "រឿន កែប"
        },
        {
            "barcode": "BBWS180201898",
            "dpc": "03023827601",
            "name": "យស អុន"
        },
        {
            "barcode": "BBWS180201899",
            "dpc": "03023827701",
            "name": "លាង ផាងហេង"
        },
        {
            "barcode": "BBWS180201900",
            "dpc": "03023827801",
            "name": "ដៅ សាំងអ៊ាត"
        },
        {
            "barcode": "BBWS180201901",
            "dpc": "03023827901",
            "name": "អាន សំអឿន"
        },
        {
            "barcode": "BBWS180201902",
            "dpc": "03023828201",
            "name": "ព្រាប សឿម"
        },
        {
            "barcode": "BBWS180201903",
            "dpc": "03023828301",
            "name": "វ៉ឹង សុផុស"
        },
        {
            "barcode": "BBWS180201904",
            "dpc": "03023828401",
            "name": "វ៉ឹង សាន"
        },
        {
            "barcode": "BBWS180201905",
            "dpc": "03023828501",
            "name": "វ៉ឹង វ៉ាន់ស៊ីន"
        },
        {
            "barcode": "BBWS180201906",
            "dpc": "03023828901",
            "name": "ផៃ មិថុនា"
        },
        {
            "barcode": "BBWS180201907",
            "dpc": "03023829001",
            "name": "ហ៊ួរ នេត"
        },
        {
            "barcode": "BBWS180201908",
            "dpc": "03023829101",
            "name": "ហេ​ វ៉ា"
        },
        {
            "barcode": "BBWS180201909",
            "dpc": "03023829201",
            "name": "ភិន សរ៉េត"
        },
        {
            "barcode": "BBWS180201910",
            "dpc": "03023829301",
            "name": "លោត ស្រួន"
        },
        {
            "barcode": "BBWS180201911",
            "dpc": "03023829701",
            "name": "សយ លឿប"
        },
        {
            "barcode": "BBWS180201912",
            "dpc": "03023829801",
            "name": "តឹង សុវណ្ណ"
        },
        {
            "barcode": "BBWS180201913",
            "dpc": "03023829901",
            "name": "សា ចន្ថា"
        },
        {
            "barcode": "BBWS180201914",
            "dpc": "03023830001",
            "name": "យូ ស៊ីភឿន"
        },
        {
            "barcode": "BBWS180201915",
            "dpc": "03023830101",
            "name": "អ៊ុន ណារ៉ុង"
        },
        {
            "barcode": "BBWS180201916",
            "dpc": "03023830201",
            "name": "សុំ ចាន់សេរី"
        },
        {
            "barcode": "BBWS180201917",
            "dpc": "03023830301",
            "name": "ភាជ ចំរើន"
        },
        {
            "barcode": "BBWS180201918",
            "dpc": "03023830501",
            "name": "ភាជ ម៉ិ"
        },
        {
            "barcode": "BBWS180201919",
            "dpc": "03023830601",
            "name": "សេង មឿន"
        },
        {
            "barcode": "BBWS180201920",
            "dpc": "03023830701",
            "name": "លី វណ្ណី"
        },
        {
            "barcode": "BBWS180201921",
            "dpc": "03023831001",
            "name": "យ៉ា ប៊ុនរឿន"
        },
        {
            "barcode": "BBWS180201922",
            "dpc": "03023831101",
            "name": "ខ្លូត នី"
        },
        {
            "barcode": "BBWS180201923",
            "dpc": "03023831201",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "BBWS180201924",
            "dpc": "03023831401",
            "name": "មឿន លក"
        },
        {
            "barcode": "BBWS180201925",
            "dpc": "03023831501",
            "name": "យ៉ាត វ័យ"
        },
        {
            "barcode": "BBWS180201926",
            "dpc": "03023831701",
            "name": "សឿម គឹមអេង"
        },
        {
            "barcode": "BBWS180201927",
            "dpc": "03023831801",
            "name": "ឡុច សារ៉េត"
        },
        {
            "barcode": "BBWS180201928",
            "dpc": "03023831901",
            "name": "ផ្លុង សាមិន"
        },
        {
            "barcode": "BBWS180201929",
            "dpc": "03023832101",
            "name": "ឡាំង ឃន"
        },
        {
            "barcode": "BBWS180201930",
            "dpc": "03023832201",
            "name": "ផ្លុង ចំរើន២"
        },
        {
            "barcode": "BBWS180201931",
            "dpc": "03023832301",
            "name": "ឆន រ៉េត"
        },
        {
            "barcode": "BBWS180201932",
            "dpc": "03023832401",
            "name": "វ៉ាន់ ពន្លីរិទ្ធ"
        },
        {
            "barcode": "BBWS180201933",
            "dpc": "03023832601",
            "name": "គង់ វ៉ាន់ឌី"
        },
        {
            "barcode": "BBWS180201934",
            "dpc": "03023832701",
            "name": "ទុយ ឆៃយ៉ា"
        },
        {
            "barcode": "BBWS180201935",
            "dpc": "03023832801",
            "name": "ស៊ាន សាវឿត"
        },
        {
            "barcode": "BBWS180201936",
            "dpc": "03023832901",
            "name": "ដាំ ចំរើន"
        },
        {
            "barcode": "BBWS180201937",
            "dpc": "03023833001",
            "name": "ឈុត យ៉ាត់"
        },
        {
            "barcode": "BBWS180201938",
            "dpc": "03023833101",
            "name": "នៅ សំណាង"
        },
        {
            "barcode": "BBWS180201939",
            "dpc": "03023833201",
            "name": "ផាត់ សុភាព"
        },
        {
            "barcode": "BBWS180201940",
            "dpc": "03023833301",
            "name": "ហែម សិលា"
        },
        {
            "barcode": "BBWS180201941",
            "dpc": "03023833401",
            "name": "សៅ សឺន"
        },
        {
            "barcode": "BBWS180201942",
            "dpc": "03023833601",
            "name": "ទៀង សុផាន់ណា"
        },
        {
            "barcode": "BBWS180201943",
            "dpc": "03023833701",
            "name": "ខូវ ស៊ាងវី"
        },
        {
            "barcode": "BBWS180201944",
            "dpc": "03023833801",
            "name": "ស៊ន កុក"
        },
        {
            "barcode": "BBWS180201945",
            "dpc": "03023833901",
            "name": "ហ៊ វ៉ា"
        },
        {
            "barcode": "BBWS180201946",
            "dpc": "03023834001",
            "name": "លី អាន"
        },
        {
            "barcode": "BBWS180201947",
            "dpc": "03023834201",
            "name": "ញ៉េប អៀក"
        },
        {
            "barcode": "BBWS180201948",
            "dpc": "03023834401",
            "name": "ទូច សំអឿន"
        },
        {
            "barcode": "BBWS180201949",
            "dpc": "03023834501",
            "name": "ទូច អឿម"
        },
        {
            "barcode": "BBWS180201950",
            "dpc": "03023834601",
            "name": "ហួន កក្កដា"
        },
        {
            "barcode": "BBWS180201951",
            "dpc": "03023834701",
            "name": "សៀង ថូ"
        },
        {
            "barcode": "BBWS180201952",
            "dpc": "03023834801",
            "name": "គន់ តុល"
        },
        {
            "barcode": "BBWS180201953",
            "dpc": "03023834901",
            "name": "សុច សាង"
        },
        {
            "barcode": "BBWS180201954",
            "dpc": "03023835001",
            "name": "ប្រិម ហួន"
        },
        {
            "barcode": "BBWS180201955",
            "dpc": "03023835101",
            "name": "ក្រាន់ ដូប"
        },
        {
            "barcode": "BBWS180201956",
            "dpc": "03023835301",
            "name": "ប្រិម ភឿត"
        },
        {
            "barcode": "BBWS180201957",
            "dpc": "03023835401",
            "name": "ប្រិម សារិន"
        },
        {
            "barcode": "BBWS180201958",
            "dpc": "03023835501",
            "name": "ប្រិម លេង"
        },
        {
            "barcode": "BBWS180201959",
            "dpc": "03023835601",
            "name": "ដុំ រុំ"
        },
        {
            "barcode": "BBWS180201960",
            "dpc": "03023835701",
            "name": "ឈន ផល្លី"
        },
        {
            "barcode": "BBWS180201961",
            "dpc": "03023835801",
            "name": "យ៉ាន់ ទូច"
        },
        {
            "barcode": "BBWS180201962",
            "dpc": "03023835901",
            "name": "ស៊ុយ ជិត"
        },
        {
            "barcode": "BBWS180201963",
            "dpc": "03023836001",
            "name": "អ៊ុច យឿត"
        },
        {
            "barcode": "BBWS180201964",
            "dpc": "03023836201",
            "name": "ឈឿន ដារ៉ា"
        },
        {
            "barcode": "BBWS180201965",
            "dpc": "03023836901",
            "name": "ប៉ែន នាង"
        },
        {
            "barcode": "BBWS180201966",
            "dpc": "03023837001",
            "name": "លៀង សំអុល"
        },
        {
            "barcode": "BBWS180201967",
            "dpc": "03023837101",
            "name": "សឿន សួម"
        },
        {
            "barcode": "BBWS180201968",
            "dpc": "03023837201",
            "name": "សាលាបឋមសិក្សា តាព្រួច"
        },
        {
            "barcode": "BBWS180201969",
            "dpc": "03023837301",
            "name": "និត ចាន់រ៉ា"
        },
        {
            "barcode": "BBWS180201970",
            "dpc": "03023837401",
            "name": "នេតា លៀង"
        },
        {
            "barcode": "BBWS180201971",
            "dpc": "03023837501",
            "name": "សុគន វាសនា"
        },
        {
            "barcode": "BBWS180201972",
            "dpc": "03023837601",
            "name": "ភាព សុភ័ក្រ"
        },
        {
            "barcode": "BBWS180201973",
            "dpc": "03023837701",
            "name": "ជឹម សាវេត"
        },
        {
            "barcode": "BBWS180201974",
            "dpc": "03023838001",
            "name": "ឆន យ៉េត"
        },
        {
            "barcode": "BBWS180201975",
            "dpc": "03023838101",
            "name": "ធឿង ឈឿត"
        },
        {
            "barcode": "BBWS180201976",
            "dpc": "03023838201",
            "name": "លៀប ជឿត"
        },
        {
            "barcode": "BBWS180201977",
            "dpc": "03023838301",
            "name": "ហេង យ៉ាន់"
        },
        {
            "barcode": "BBWS180201978",
            "dpc": "03023838601",
            "name": "វិន រៀម"
        },
        {
            "barcode": "BBWS180201979",
            "dpc": "03023838801",
            "name": "ឌី ស្រីរិទ្ធ"
        },
        {
            "barcode": "BBWS180201980",
            "dpc": "03023838901",
            "name": "គឹម គឹមជឿន"
        },
        {
            "barcode": "BBWS180201981",
            "dpc": "03023839001",
            "name": "ទូច មឿន"
        },
        {
            "barcode": "BBWS180201982",
            "dpc": "03023839101",
            "name": "ប៊ិច ឡូញ"
        },
        {
            "barcode": "BBWS180201983",
            "dpc": "03023839201",
            "name": "ម៉ុត វុន"
        },
        {
            "barcode": "BBWS180201984",
            "dpc": "03023839301",
            "name": "ម៉ុត សំណាង"
        },
        {
            "barcode": "BBWS180201985",
            "dpc": "03023839401",
            "name": "បេង ហឿត"
        },
        {
            "barcode": "BBWS180201986",
            "dpc": "03023839601",
            "name": "ស៊ីវ សារឿង"
        },
        {
            "barcode": "BBWS180201987",
            "dpc": "03023839801",
            "name": "ខុម ធឿន"
        },
        {
            "barcode": "BBWS180201988",
            "dpc": "03023839901",
            "name": "រីម ម៉ាត"
        },
        {
            "barcode": "BBWS180201989",
            "dpc": "03023840001",
            "name": "សោម ឡុងឌី"
        },
        {
            "barcode": "BBWS180201990",
            "dpc": "03023840101",
            "name": "ផេង សិទ្ធី"
        },
        {
            "barcode": "BBWS180201991",
            "dpc": "03023840301",
            "name": "មឿន សាវន"
        },
        {
            "barcode": "BBWS180201992",
            "dpc": "03023840401",
            "name": "យឹម ហ៊ីង"
        },
        {
            "barcode": "BBWS180201993",
            "dpc": "03023840501",
            "name": "លីណា"
        },
        {
            "barcode": "BBWS180201994",
            "dpc": "03023840601",
            "name": "លីម លីណា"
        },
        {
            "barcode": "BBWS180201995",
            "dpc": "03023840701",
            "name": "រិន ដារិត"
        },
        {
            "barcode": "BBWS180201996",
            "dpc": "03023841001",
            "name": "សាន ស៊ា"
        },
        {
            "barcode": "BBWS180201997",
            "dpc": "03023841201",
            "name": "ឡុង ស៊ីណារ៉េត"
        },
        {
            "barcode": "BBWS180201998",
            "dpc": "03023841301",
            "name": "គូ សាឡន"
        },
        {
            "barcode": "BBWS180201999",
            "dpc": "03023841601",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "BBWS180202000",
            "dpc": "03023841701",
            "name": "ណង ចំណាន"
        },
        {
            "barcode": "BBWS180202001",
            "dpc": "03023842101",
            "name": "ឆេង លឿត"
        },
        {
            "barcode": "BBWS180202002",
            "dpc": "03023842201",
            "name": "មុត វាសនា"
        },
        {
            "barcode": "BBWS180202003",
            "dpc": "03023842301",
            "name": "ស៊ឹម សុខលាង"
        },
        {
            "barcode": "BBWS180202004",
            "dpc": "03023842401",
            "name": "វួច លីម"
        },
        {
            "barcode": "BBWS180202005",
            "dpc": "03023842501",
            "name": "ហួង សំណាង"
        },
        {
            "barcode": "BBWS180202006",
            "dpc": "03023842601",
            "name": "ឃឹម យឿប"
        },
        {
            "barcode": "BBWS180202007",
            "dpc": "03023842701",
            "name": "ឡុង លឿង"
        },
        {
            "barcode": "BBWS180202008",
            "dpc": "03023842801",
            "name": "ហួន ហ៊ត"
        },
        {
            "barcode": "BBWS180202009",
            "dpc": "03023843001",
            "name": "រឿម ស៊ន"
        },
        {
            "barcode": "BBWS180202010",
            "dpc": "03023843101",
            "name": "យ៉ាន់ សេរីរត្ន័"
        },
        {
            "barcode": "BBWS180202011",
            "dpc": "03023843201",
            "name": "ផ្លុង រ៉ាត់"
        },
        {
            "barcode": "BBWS180202012",
            "dpc": "03023843301",
            "name": "តុល អួន"
        },
        {
            "barcode": "BBWS180202013",
            "dpc": "03023843401",
            "name": "ជា លាប"
        },
        {
            "barcode": "BBWS180202014",
            "dpc": "03023843501",
            "name": "អ៊ឹង សឿត"
        },
        {
            "barcode": "BBWS180202015",
            "dpc": "03023843601",
            "name": "ចាន់ សារ៉េន"
        },
        {
            "barcode": "BBWS180202016",
            "dpc": "03023843701",
            "name": "ជី សៀន"
        },
        {
            "barcode": "BBWS180202017",
            "dpc": "03023843901",
            "name": "ឆាត គាន"
        },
        {
            "barcode": "BBWS180202018",
            "dpc": "03023844001",
            "name": "វុន សាវើន"
        },
        {
            "barcode": "BBWS180202019",
            "dpc": "03023844101",
            "name": "ផាត អាន"
        },
        {
            "barcode": "BBWS180202020",
            "dpc": "03023844201",
            "name": "លឹម សុខយ៉ែម"
        },
        {
            "barcode": "BBWS180202021",
            "dpc": "03023844901",
            "name": "យួម យ៉ាវី"
        },
        {
            "barcode": "BBWS180202022",
            "dpc": "03023845101",
            "name": "សឿន សៀក"
        },
        {
            "barcode": "BBWS180202023",
            "dpc": "03023845201",
            "name": "យួម វ៉ាគី"
        },
        {
            "barcode": "BBWS180202024",
            "dpc": "03023845301",
            "name": "សែម ជន"
        },
        {
            "barcode": "BBWS180202025",
            "dpc": "03023845401",
            "name": "ណែម រិទ្ទ"
        },
        {
            "barcode": "BBWS180202026",
            "dpc": "03023845501",
            "name": "យ៉ែម ឈឿប"
        },
        {
            "barcode": "BBWS180202027",
            "dpc": "03023845601",
            "name": "តាន់ យូរ៉ា"
        },
        {
            "barcode": "BBWS180202028",
            "dpc": "03023845801",
            "name": "ឈាន គឹមម្លិះ"
        },
        {
            "barcode": "BBWS180202029",
            "dpc": "03023845901",
            "name": "លឹង ឃន"
        },
        {
            "barcode": "BBWS180202030",
            "dpc": "03023847001",
            "name": "ទួច សារឿត"
        },
        {
            "barcode": "BBWS180202031",
            "dpc": "03023847301",
            "name": "ស្រែ ទិន"
        },
        {
            "barcode": "BBWS180202032",
            "dpc": "03023847501",
            "name": "ឈឿន ហឿប"
        },
        {
            "barcode": "BBWS180202033",
            "dpc": "03023847801",
            "name": "សុង ម៉ុន"
        },
        {
            "barcode": "BBWS180202034",
            "dpc": "03023847901",
            "name": "សំ វណ្ណះ"
        },
        {
            "barcode": "BBWS180202035",
            "dpc": "03023848001",
            "name": "ឈឿង សុធីម"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
