let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=
    [
        {
            "barcode": "BBWS180202036",
            "dpc": "03023909301",
            "name": "សេក សារ៉ុម"
        },
        {
            "barcode": "BBWS180202037",
            "dpc": "03023900201",
            "name": "សាគុណ ប្រាកដ"
        },
        {
            "barcode": "BBWS180202038",
            "dpc": "03023900301",
            "name": "ចក់ ចន្ថា"
        },
        {
            "barcode": "BBWS180202039",
            "dpc": "03023900401",
            "name": "ថោង សេរីវត្ស"
        },
        {
            "barcode": "BBWS180202040",
            "dpc": "03023900601",
            "name": "ចក់ ចន្ថា"
        },
        {
            "barcode": "BBWS180202041",
            "dpc": "03023900701",
            "name": "ហេង លាង"
        },
        {
            "barcode": "BBWS180202042",
            "dpc": "03023901201",
            "name": "ឆឹម សម្បត្តិ"
        },
        {
            "barcode": "BBWS180202043",
            "dpc": "03023901301",
            "name": "សាង លាងគីម"
        },
        {
            "barcode": "BBWS180202044",
            "dpc": "03023901601",
            "name": "គឹម សុឃី"
        },
        {
            "barcode": "BBWS180202045",
            "dpc": "03023901901",
            "name": "លៀប ប៊ុនជឿន"
        },
        {
            "barcode": "BBWS180202046",
            "dpc": "03023902001",
            "name": "សួស មករា"
        },
        {
            "barcode": "BBWS180202047",
            "dpc": "03023902301",
            "name": "ឆេង ប៊ុនសួ"
        },
        {
            "barcode": "BBWS180202048",
            "dpc": "03023902401",
            "name": "ឈឿន សារួត"
        },
        {
            "barcode": "BBWS180202049",
            "dpc": "03023902501",
            "name": "អ៊ន ឈឿន"
        },
        {
            "barcode": "BBWS180202050",
            "dpc": "03023902601",
            "name": "សាត ស្វាង"
        },
        {
            "barcode": "BBWS180202051",
            "dpc": "03023902701",
            "name": "ដាំ ភាព"
        },
        {
            "barcode": "BBWS180202052",
            "dpc": "03023902801",
            "name": "សេង សុន"
        },
        {
            "barcode": "BBWS180202053",
            "dpc": "03023902901",
            "name": "ម៉ៅ សារឿត"
        },
        {
            "barcode": "BBWS180202054",
            "dpc": "03023903101",
            "name": "ឈៀង ឈាន"
        },
        {
            "barcode": "BBWS180202055",
            "dpc": "03023903201",
            "name": "ជ័យ ម៉ារឌី"
        },
        {
            "barcode": "BBWS180202056",
            "dpc": "03023903401",
            "name": "ណាង ថង"
        },
        {
            "barcode": "BBWS180202057",
            "dpc": "03023903801",
            "name": "ឆៀង លឿត"
        },
        {
            "barcode": "BBWS180202058",
            "dpc": "03023903901",
            "name": "ឌិត ភាព"
        },
        {
            "barcode": "BBWS180202059",
            "dpc": "03023904001",
            "name": "បួន ពៅ"
        },
        {
            "barcode": "BBWS180202060",
            "dpc": "03023904101",
            "name": "វេត ចំណាន"
        },
        {
            "barcode": "BBWS180202061",
            "dpc": "03023904201",
            "name": "ហ៊ន ហូ"
        },
        {
            "barcode": "BBWS180202062",
            "dpc": "03023904301",
            "name": "ស៊ីម ប៉ន"
        },
        {
            "barcode": "BBWS180202063",
            "dpc": "03023904401",
            "name": "ផាន សុខ"
        },
        {
            "barcode": "BBWS180202064",
            "dpc": "03023904501",
            "name": "ធឿន សារិន"
        },
        {
            "barcode": "BBWS180202065",
            "dpc": "03023904601",
            "name": "សុខ ទេនពិសិដ្ឋ"
        },
        {
            "barcode": "BBWS180202066",
            "dpc": "03023904701",
            "name": "សុខ សុផល"
        },
        {
            "barcode": "BBWS180202067",
            "dpc": "03023904801",
            "name": "ស៊ូ សុភី"
        },
        {
            "barcode": "BBWS180202068",
            "dpc": "03023904901",
            "name": "ឡុង ម៉ាលី"
        },
        {
            "barcode": "BBWS180202069",
            "dpc": "03023905001",
            "name": "ជួន ឆុំ"
        },
        {
            "barcode": "BBWS180202070",
            "dpc": "03023905201",
            "name": "វ៉ាន់ ណយ"
        },
        {
            "barcode": "BBWS180202071",
            "dpc": "03023905301",
            "name": "ឆន សុផល"
        },
        {
            "barcode": "BBWS180202072",
            "dpc": "03023905401",
            "name": "ផ្លុង វុឌ្ឍី"
        },
        {
            "barcode": "BBWS180202073",
            "dpc": "03023905501",
            "name": "ទូច សានិត"
        },
        {
            "barcode": "BBWS180202074",
            "dpc": "03023905601",
            "name": "យ៉ាត ម៉ៅ"
        },
        {
            "barcode": "BBWS180202075",
            "dpc": "03023905701",
            "name": "ថាប់ ឆម"
        },
        {
            "barcode": "BBWS180202076",
            "dpc": "03023905801",
            "name": "ទេព ហ៊ីំម"
        },
        {
            "barcode": "BBWS180202077",
            "dpc": "03023905901",
            "name": "ម៉ក់ ឈួន"
        },
        {
            "barcode": "BBWS180202078",
            "dpc": "03023906001",
            "name": "ឆឿន រដ្ឋា"
        },
        {
            "barcode": "BBWS180202079",
            "dpc": "03023906101",
            "name": "សយ សត្យា"
        },
        {
            "barcode": "BBWS180202080",
            "dpc": "03023906201",
            "name": "ថុល ចាន់ណា"
        },
        {
            "barcode": "BBWS180202081",
            "dpc": "03023906301",
            "name": "សឿន អឿន"
        },
        {
            "barcode": "BBWS180202082",
            "dpc": "03023906401",
            "name": "សំ សុខ"
        },
        {
            "barcode": "BBWS180202083",
            "dpc": "03023906501",
            "name": "សៀង សំ"
        },
        {
            "barcode": "BBWS180202084",
            "dpc": "03023906601",
            "name": "គឹម សុភារម្យ"
        },
        {
            "barcode": "BBWS180202085",
            "dpc": "03023906701",
            "name": "ចេង សុផល"
        },
        {
            "barcode": "BBWS180202086",
            "dpc": "03023906801",
            "name": "ប៉ោ គឹមសុង"
        },
        {
            "barcode": "BBWS180202087",
            "dpc": "03023906901",
            "name": "លក ចេក"
        },
        {
            "barcode": "BBWS180202088",
            "dpc": "03023907001",
            "name": "ប៉ុន សំអាត"
        },
        {
            "barcode": "BBWS180202089",
            "dpc": "03023907101",
            "name": "គង់ សុខា"
        },
        {
            "barcode": "BBWS180202090",
            "dpc": "03023907201",
            "name": "សាយ វណ្ណះ"
        },
        {
            "barcode": "BBWS180202091",
            "dpc": "03023907301",
            "name": "ហម ឆា"
        },
        {
            "barcode": "BBWS180202092",
            "dpc": "03023907401",
            "name": "ទុយ កុសល់"
        },
        {
            "barcode": "BBWS180202093",
            "dpc": "03023907501",
            "name": "ខៀវ ម៉ាលី"
        },
        {
            "barcode": "BBWS180202094",
            "dpc": "03023907601",
            "name": "ឆួត ហ៊ាប"
        },
        {
            "barcode": "BBWS180202095",
            "dpc": "03023907701",
            "name": "បេង សុគន្ធា"
        },
        {
            "barcode": "BBWS180202096",
            "dpc": "03023907801",
            "name": "ចាន់ វណ្ណា"
        },
        {
            "barcode": "BBWS180202097",
            "dpc": "03023907901",
            "name": "ហ៊ួ ផុនវិចិត្រ"
        },
        {
            "barcode": "BBWS180202098",
            "dpc": "03023908001",
            "name": "ហេង ស្រីរ័ត្ន"
        },
        {
            "barcode": "BBWS180202099",
            "dpc": "03023908101",
            "name": "សោម រិទ្ធ"
        },
        {
            "barcode": "BBWS180202100",
            "dpc": "03023908201",
            "name": "សំ វណ្ណាក់"
        },
        {
            "barcode": "BBWS180202101",
            "dpc": "03023908301",
            "name": "ខេង បញ្ញា"
        },
        {
            "barcode": "BBWS180202102",
            "dpc": "03023908401",
            "name": "ម៉ែន ចាន់ធឿន"
        },
        {
            "barcode": "BBWS180202103",
            "dpc": "03023908501",
            "name": "ជួន សុខហេង"
        },
        {
            "barcode": "BBWS180202104",
            "dpc": "03023908601",
            "name": "ផាត់ ទៀង"
        },
        {
            "barcode": "BBWS180202105",
            "dpc": "03023908801",
            "name": "អឿន ចាន់នី"
        },
        {
            "barcode": "BBWS180202106",
            "dpc": "03023908901",
            "name": "ប៊ន ខន"
        },
        {
            "barcode": "BBWS180202107",
            "dpc": "03023909101",
            "name": "កុល សំណាង"
        },
        {
            "barcode": "BBWS180202108",
            "dpc": "03023909201",
            "name": "ភឿក វីរៈ"
        },
        {
            "barcode": "BBWS180202109",
            "dpc": "03023909401",
            "name": "ហ៊ីម ហ្វារីត"
        },
        {
            "barcode": "BBWS180202110",
            "dpc": "03023909501",
            "name": "ទត ហ្វា"
        },
        {
            "barcode": "BBWS180202111",
            "dpc": "03023909601",
            "name": "ស៊ុន ធី"
        },
        {
            "barcode": "BBWS180202112",
            "dpc": "03023909701",
            "name": "បូ វឿត"
        },
        {
            "barcode": "BBWS180202113",
            "dpc": "03023909801",
            "name": "ស៊ិន សុភាព"
        },
        {
            "barcode": "BBWS180202114",
            "dpc": "03023909901",
            "name": "បេង សុខ ណា"
        },
        {
            "barcode": "BBWS180202115",
            "dpc": "03023910001",
            "name": "ម៉ម វណ្ណា"
        },
        {
            "barcode": "BBWS180202116",
            "dpc": "03023910101",
            "name": "ម៉ៅ លន់"
        },
        {
            "barcode": "BBWS180202117",
            "dpc": "03023910201",
            "name": "ឡឹប សាមឿន"
        },
        {
            "barcode": "BBWS180202118",
            "dpc": "03023910301",
            "name": "ហុក គឹមហួង"
        },
        {
            "barcode": "BBWS180202119",
            "dpc": "03023910401",
            "name": "ឈឹម រ៉ៃម៉ុង"
        },
        {
            "barcode": "BBWS180202120",
            "dpc": "03023910501",
            "name": "ខាត់ វ៉ិត"
        },
        {
            "barcode": "BBWS180202121",
            "dpc": "03023910601",
            "name": "អុំ កៅ"
        },
        {
            "barcode": "BBWS180202122",
            "dpc": "03023910701",
            "name": "គ្រួច សុវណ្ណ"
        },
        {
            "barcode": "BBWS180202123",
            "dpc": "03023910801",
            "name": "សេង ថេង"
        },
        {
            "barcode": "BBWS180202124",
            "dpc": "03023910901",
            "name": "គុយ គា"
        },
        {
            "barcode": "BBWS180202125",
            "dpc": "03023911001",
            "name": "ម៉ម ស៊ីម៉ុន"
        },
        {
            "barcode": "BBWS180202126",
            "dpc": "03023911101",
            "name": "ទេស សុភាព"
        },
        {
            "barcode": "BBWS180202127",
            "dpc": "03023911201",
            "name": "ហេង សុដាលីន"
        },
        {
            "barcode": "BBWS180202128",
            "dpc": "03023911301",
            "name": "ជួប រិទ្ធី"
        },
        {
            "barcode": "BBWS180202129",
            "dpc": "03023911401",
            "name": "ម៉ា សល់"
        },
        {
            "barcode": "BBWS180202130",
            "dpc": "03023911501",
            "name": "អៀង ខាន់យ៉ា"
        },
        {
            "barcode": "BBWS180202131",
            "dpc": "03023911601",
            "name": "មាស សុខុម"
        },
        {
            "barcode": "BBWS180202132",
            "dpc": "03023911701",
            "name": "ទី សុផល"
        },
        {
            "barcode": "BBWS180202133",
            "dpc": "03023911801",
            "name": "ម៉ៅ ដាលី"
        },
        {
            "barcode": "BBWS180202134",
            "dpc": "03023911901",
            "name": "រដ្ឋ រឿន"
        },
        {
            "barcode": "BBWS180202135",
            "dpc": "03023912001",
            "name": "ហេង រ៉ា"
        },
        {
            "barcode": "BBWS180202136",
            "dpc": "03023912101",
            "name": "ដួង ចាន់ថន"
        },
        {
            "barcode": "BBWS180202137",
            "dpc": "03023912201",
            "name": "អ៊ឹម រិន"
        },
        {
            "barcode": "BBWS180202138",
            "dpc": "03023912301",
            "name": "វីរះ សុណ្ណារ៉ុង"
        },
        {
            "barcode": "BBWS180202139",
            "dpc": "03023912401",
            "name": "ប្រាក់ សាមឿន"
        },
        {
            "barcode": "BBWS180202140",
            "dpc": "03023912501",
            "name": "អ៊ួង ម៉ានី"
        },
        {
            "barcode": "BBWS180202141",
            "dpc": "03023912601",
            "name": "ឡុង វី"
        },
        {
            "barcode": "BBWS180202142",
            "dpc": "03023912701",
            "name": "រត័្ន សាវី"
        },
        {
            "barcode": "BBWS180202143",
            "dpc": "03023912801",
            "name": "អុន រ៉ាណ"
        },
        {
            "barcode": "BBWS180202144",
            "dpc": "03023912901",
            "name": "រៀម យន"
        },
        {
            "barcode": "BBWS180202145",
            "dpc": "03023913001",
            "name": "មាស វ៉ុន"
        },
        {
            "barcode": "BBWS180202146",
            "dpc": "03023913101",
            "name": "ព្រំ ភូរ៉ាត់"
        },
        {
            "barcode": "BBWS180202147",
            "dpc": "03023913201",
            "name": "យិន ប៊ុនតេន"
        },
        {
            "barcode": "BBWS180202148",
            "dpc": "03023913301",
            "name": "ឡាម សារ៉ុម"
        },
        {
            "barcode": "BBWS180202149",
            "dpc": "03023913501",
            "name": "រស់ រីម"
        },
        {
            "barcode": "BBWS180202150",
            "dpc": "03023913601",
            "name": "គីម សម្បត្តិ"
        },
        {
            "barcode": "BBWS180202151",
            "dpc": "03023913701",
            "name": "ស៊ិន ឈុនលី"
        },
        {
            "barcode": "BBWS180202152",
            "dpc": "03023913801",
            "name": "គូរ ខ្លា"
        },
        {
            "barcode": "BBWS180202153",
            "dpc": "03023913901",
            "name": "ស៊ុន ចិន្តា"
        },
        {
            "barcode": "BBWS180202154",
            "dpc": "03023914001",
            "name": "អ៊ូ យ៉ាន"
        },
        {
            "barcode": "BBWS180202155",
            "dpc": "03023914101",
            "name": "តី ដានី"
        },
        {
            "barcode": "BBWS180202156",
            "dpc": "03023914201",
            "name": "សែម សុខជា"
        },
        {
            "barcode": "BBWS180202157",
            "dpc": "03023914301",
            "name": "ឈុន លី"
        },
        {
            "barcode": "BBWS180202158",
            "dpc": "03023914401",
            "name": "សី សារី"
        },
        {
            "barcode": "BBWS180202159",
            "dpc": "03023914501",
            "name": "លី ហ៊ើស"
        },
        {
            "barcode": "BBWS180202160",
            "dpc": "03023914601",
            "name": "លី ប៊ិត"
        },
        {
            "barcode": "BBWS180202161",
            "dpc": "03023914701",
            "name": "ពេជ្រ សាខន"
        },
        {
            "barcode": "BBWS180202162",
            "dpc": "03023914801",
            "name": "លឹម ចន័្ទ"
        },
        {
            "barcode": "BBWS180202163",
            "dpc": "03023914901",
            "name": "ហម ភឿន"
        },
        {
            "barcode": "BBWS180202164",
            "dpc": "03023915001",
            "name": "ឈន កំសត់"
        },
        {
            "barcode": "BBWS180202165",
            "dpc": "03023915101",
            "name": "ប៉ិច ញ៉ាក់"
        },
        {
            "barcode": "BBWS180202166",
            "dpc": "03023915201",
            "name": "សី រិទ្ធី"
        },
        {
            "barcode": "BBWS180202167",
            "dpc": "03023915301",
            "name": "ប៉ែន កិ"
        },
        {
            "barcode": "BBWS180202168",
            "dpc": "03023915501",
            "name": "សួស សុផល"
        },
        {
            "barcode": "BBWS180202169",
            "dpc": "03023915601",
            "name": "សៅ សុភឿន"
        },
        {
            "barcode": "BBWS180202170",
            "dpc": "03023915701",
            "name": "មូល សុវត្តិ"
        },
        {
            "barcode": "BBWS180202171",
            "dpc": "03023915801",
            "name": "គង់ សុឃន"
        },
        {
            "barcode": "BBWS180202172",
            "dpc": "03023915901",
            "name": "ម៉ាង គា"
        },
        {
            "barcode": "BBWS180202173",
            "dpc": "03023916001",
            "name": "ប៉ុក ស៊ិប"
        },
        {
            "barcode": "BBWS180202174",
            "dpc": "03023916101",
            "name": "ណុប ចាន់បូរ៉ា"
        },
        {
            "barcode": "BBWS180202175",
            "dpc": "03023916201",
            "name": "ធួន រ៉ាវុធ"
        },
        {
            "barcode": "BBWS180202176",
            "dpc": "03023916301",
            "name": "ណុប ណារ៉ា១"
        },
        {
            "barcode": "BBWS180202177",
            "dpc": "03023916401",
            "name": "ណុប ណារ៉ា២"
        },
        {
            "barcode": "BBWS180202178",
            "dpc": "03023916501",
            "name": "ណុប ណារ៉ា៣"
        },
        {
            "barcode": "BBWS180202179",
            "dpc": "03023916601",
            "name": "ណុប ណារ៉ា២៤"
        },
        {
            "barcode": "BBWS180202180",
            "dpc": "03023916701",
            "name": "សួង យ៉ាន់"
        },
        {
            "barcode": "BBWS180202181",
            "dpc": "03023916801",
            "name": "តាំង ស៊ូគៀវ"
        },
        {
            "barcode": "BBWS180202182",
            "dpc": "03023916901",
            "name": "ញ៉ែម ឡា"
        },
        {
            "barcode": "BBWS180202183",
            "dpc": "03023917001",
            "name": "ឈិន ឃឿន"
        },
        {
            "barcode": "BBWS180202184",
            "dpc": "03023917101",
            "name": "នៅ ចាន់ណា"
        },
        {
            "barcode": "BBWS180202185",
            "dpc": "03023917201",
            "name": "ឈឿន សុភឿត"
        },
        {
            "barcode": "BBWS180202186",
            "dpc": "03023917401",
            "name": "យិន លាងឆេង"
        },
        {
            "barcode": "BBWS180202187",
            "dpc": "03023917501",
            "name": "សម្ព័នយុវជនម៉ូស្លីម"
        },
        {
            "barcode": "BBWS180202188",
            "dpc": "03023917601",
            "name": "ឡៅ ប៉ោជូ"
        },
        {
            "barcode": "BBWS180202189",
            "dpc": "03023917701",
            "name": "ពៅ សុខជា"
        },
        {
            "barcode": "BBWS180202190",
            "dpc": "03023917801",
            "name": "សំ សំណាង"
        },
        {
            "barcode": "BBWS180202191",
            "dpc": "03023917901",
            "name": "ស្លេះ ម៉ារីយ៉ាន"
        },
        {
            "barcode": "BBWS180202192",
            "dpc": "03023918001",
            "name": "ណៃ ណាម"
        },
        {
            "barcode": "BBWS180202193",
            "dpc": "03023918101",
            "name": "ព្រឿង ផារ៉ាត់"
        },
        {
            "barcode": "BBWS180202194",
            "dpc": "03023918201",
            "name": "ហេង តេង"
        },
        {
            "barcode": "BBWS180202195",
            "dpc": "03023918301",
            "name": "ភុន ហ៊ួង"
        },
        {
            "barcode": "BBWS180202196",
            "dpc": "03023918401",
            "name": "វឹង វុទ្ធី១"
        },
        {
            "barcode": "BBWS180202197",
            "dpc": "03023918501",
            "name": "គង់ រដ្ឋា"
        },
        {
            "barcode": "BBWS180202198",
            "dpc": "03023918601",
            "name": "ងួន ហួត"
        },
        {
            "barcode": "BBWS180202199",
            "dpc": "03023918701",
            "name": "ជ័យ ចក់២"
        },
        {
            "barcode": "BBWS180202200",
            "dpc": "03023918801",
            "name": "ឈុន អូន"
        },
        {
            "barcode": "BBWS180202201",
            "dpc": "03023918901",
            "name": "ឃិន អឿន"
        },
        {
            "barcode": "BBWS180202202",
            "dpc": "03023919101",
            "name": "ឃឹម ម៉ន"
        },
        {
            "barcode": "BBWS180202203",
            "dpc": "03023919201",
            "name": "ញឹម គន្ធា"
        },
        {
            "barcode": "BBWS180202204",
            "dpc": "03023919401",
            "name": "ឯក ជីវ័ន"
        },
        {
            "barcode": "BBWS180202205",
            "dpc": "03023919501",
            "name": "សាន់ ម៉ាត់លី"
        },
        {
            "barcode": "BBWS180202206",
            "dpc": "03023919601",
            "name": "យើ នូរី"
        },
        {
            "barcode": "BBWS180202207",
            "dpc": "03023919701",
            "name": "នូ សំណាង"
        },
        {
            "barcode": "BBWS180202208",
            "dpc": "03023919801",
            "name": "ណា រ៉ាមនោរិទ្ទ"
        },
        {
            "barcode": "BBWS180202209",
            "dpc": "03023919901",
            "name": "ស៊ុប ហ្វារីត"
        },
        {
            "barcode": "BBWS180202210",
            "dpc": "03023920001",
            "name": "គុណ សុវណ្ណដា"
        },
        {
            "barcode": "BBWS180202211",
            "dpc": "03023920101",
            "name": "សុន ចាន់ធា"
        },
        {
            "barcode": "BBWS180202212",
            "dpc": "03023920201",
            "name": "តឿង តុន"
        },
        {
            "barcode": "BBWS180202213",
            "dpc": "03023920301",
            "name": "ម៉េត រី"
        },
        {
            "barcode": "BBWS180202214",
            "dpc": "03023920401",
            "name": "ណាស់ ឡោះ"
        },
        {
            "barcode": "BBWS180202215",
            "dpc": "03023920501",
            "name": "ឡស់ លីម"
        },
        {
            "barcode": "BBWS180202216",
            "dpc": "03023920601",
            "name": "ប្រាក់ ស៊ុន"
        },
        {
            "barcode": "BBWS180202217",
            "dpc": "03023920701",
            "name": "សុខ រឿត"
        },
        {
            "barcode": "BBWS180202218",
            "dpc": "03023920801",
            "name": "ស៊ុន ណង"
        },
        {
            "barcode": "BBWS180202219",
            "dpc": "03023920901",
            "name": "ស៊ុន សំបូរ"
        },
        {
            "barcode": "BBWS180202220",
            "dpc": "03023921001",
            "name": "សុខ ពូក"
        },
        {
            "barcode": "BBWS180202221",
            "dpc": "03023921101",
            "name": "ឯល យើ"
        },
        {
            "barcode": "BBWS180202222",
            "dpc": "03023921201",
            "name": "សូ ពេជ្រ"
        },
        {
            "barcode": "BBWS180202223",
            "dpc": "03023921301",
            "name": "វិន វីឆៃ"
        },
        {
            "barcode": "BBWS180202224",
            "dpc": "03023921401",
            "name": "ភឿន សម្ជស្ស"
        },
        {
            "barcode": "BBWS180202225",
            "dpc": "03023921501",
            "name": "ផេង សេរី"
        },
        {
            "barcode": "BBWS180202226",
            "dpc": "03023921601",
            "name": "អ៊ិន នៅ"
        },
        {
            "barcode": "BBWS180202227",
            "dpc": "03023921701",
            "name": "សួស រ៉ន"
        },
        {
            "barcode": "BBWS180202228",
            "dpc": "03023921801",
            "name": "អឿន សម្បត្តិ"
        },
        {
            "barcode": "BBWS180202229",
            "dpc": "03023921901",
            "name": "ខឹម សេង"
        },
        {
            "barcode": "BBWS180202230",
            "dpc": "03023922101",
            "name": "ហ៊ីម ណារិទ្ធ"
        },
        {
            "barcode": "BBWS180202231",
            "dpc": "03023922201",
            "name": "វណ្ណ យន"
        },
        {
            "barcode": "BBWS180202232",
            "dpc": "03023922301",
            "name": "លឹម វ៉េងគៀង"
        },
        {
            "barcode": "BBWS180202233",
            "dpc": "03023922401",
            "name": "ផ្លុង ដារ៉ា"
        },
        {
            "barcode": "BBWS180202234",
            "dpc": "03023922501",
            "name": "វ៉ាន់ ស្រីទូច"
        },
        {
            "barcode": "BBWS180202235",
            "dpc": "03023922601",
            "name": "ចែម ដាណា"
        },
        {
            "barcode": "BBWS180202236",
            "dpc": "03023922701",
            "name": "ហ៊ុត ផារិទ្ធ"
        },
        {
            "barcode": "BBWS180202237",
            "dpc": "03023922801",
            "name": "ស៊ី សំប៊ុន"
        },
        {
            "barcode": "BBWS180202238",
            "dpc": "03023922901",
            "name": "សុខ សុគុណ"
        },
        {
            "barcode": "BBWS180202239",
            "dpc": "03023923001",
            "name": "អ៊ុន វណ្ណះ"
        },
        {
            "barcode": "BBWS180202240",
            "dpc": "03023923101",
            "name": "លក ឆាយលី"
        },
        {
            "barcode": "BBWS180202241",
            "dpc": "03023923201",
            "name": "ឈ ហ៊ូ"
        },
        {
            "barcode": "BBWS180202242",
            "dpc": "03023923301",
            "name": "អ៊ុក សុភានាថ"
        },
        {
            "barcode": "BBWS180202243",
            "dpc": "03023923401",
            "name": "ជិន សម័យ"
        },
        {
            "barcode": "BBWS180202244",
            "dpc": "03023923501",
            "name": "មឿន សុទ្ធ"
        },
        {
            "barcode": "BBWS180202245",
            "dpc": "03023923601",
            "name": "ហេង កន្និកា"
        },
        {
            "barcode": "BBWS180202246",
            "dpc": "03023923801",
            "name": "ណូត ស៊ីនួន"
        },
        {
            "barcode": "BBWS180202247",
            "dpc": "03023923901",
            "name": "ជា សំអូន"
        },
        {
            "barcode": "BBWS180202248",
            "dpc": "03023924001",
            "name": "បុង រិទ្ធីរ៉េន"
        },
        {
            "barcode": "BBWS180202249",
            "dpc": "03023924101",
            "name": "ប្រាក់ ចាន់ឌី"
        },
        {
            "barcode": "BBWS180202250",
            "dpc": "03023924201",
            "name": "សឹង ចំរើន"
        },
        {
            "barcode": "BBWS180202251",
            "dpc": "03023924401",
            "name": "ចន្ទ សុភាព"
        },
        {
            "barcode": "BBWS180202252",
            "dpc": "03023924501",
            "name": "ជុំ សុខសេរី"
        },
        {
            "barcode": "BBWS180202253",
            "dpc": "03023924601",
            "name": "គូ ចន្ទ្រា"
        },
        {
            "barcode": "BBWS180202254",
            "dpc": "03023924701",
            "name": "ជី គីមីសៀង"
        },
        {
            "barcode": "BBWS180202255",
            "dpc": "03023924801",
            "name": "ហួត ឈុន"
        },
        {
            "barcode": "BBWS180202256",
            "dpc": "03023924901",
            "name": "ស៊ុត លីម"
        },
        {
            "barcode": "BBWS180202257",
            "dpc": "03023925001",
            "name": "ឌឿន រ៉េត"
        },
        {
            "barcode": "BBWS180202258",
            "dpc": "03023925101",
            "name": "ស៊ិន សាវុធ"
        },
        {
            "barcode": "BBWS180202259",
            "dpc": "03023925201",
            "name": "ប៊ុន ឆឿន"
        },
        {
            "barcode": "BBWS180202260",
            "dpc": "03023925401",
            "name": "ឯម សុវណ្ណារី"
        },
        {
            "barcode": "BBWS180202261",
            "dpc": "03023925501",
            "name": "អ៊ឹង ហេងគ្រុប២"
        },
        {
            "barcode": "BBWS180202262",
            "dpc": "03023925601",
            "name": "យ៉េង កុសល់"
        },
        {
            "barcode": "BBWS180202263",
            "dpc": "03023925701",
            "name": "ព្រំ​ ផន"
        },
        {
            "barcode": "BBWS180202264",
            "dpc": "03023925801",
            "name": "យ៉ែម ទូច"
        },
        {
            "barcode": "BBWS180202265",
            "dpc": "03023925901",
            "name": "អឿន សុវណ្ណរ៉ា"
        },
        {
            "barcode": "BBWS180202266",
            "dpc": "03023926101",
            "name": "លី ឃុនរ៉ាត់"
        },
        {
            "barcode": "BBWS180202267",
            "dpc": "03023926201",
            "name": "ផាន ចាន់ថន"
        },
        {
            "barcode": "BBWS180202268",
            "dpc": "03023926301",
            "name": "រស់ មឿត"
        },
        {
            "barcode": "BBWS180202269",
            "dpc": "03023926401",
            "name": "កូន ហ៊ិម"
        },
        {
            "barcode": "BBWS180202270",
            "dpc": "03023926501",
            "name": "សេង ធឿក"
        },
        {
            "barcode": "BBWS180202271",
            "dpc": "03023926701",
            "name": "អិន កេត"
        },
        {
            "barcode": "BBWS180202272",
            "dpc": "03023926801",
            "name": "សួស ផល្លា"
        },
        {
            "barcode": "BBWS180202273",
            "dpc": "03023926901",
            "name": "នូវ សំណាង"
        },
        {
            "barcode": "BBWS180202274",
            "dpc": "03023927001",
            "name": "មៃ ខេម"
        },
        {
            "barcode": "BBWS180202275",
            "dpc": "03023927101",
            "name": "ជា សូរិយា"
        },
        {
            "barcode": "BBWS180202276",
            "dpc": "03023927201",
            "name": "វ៉ាន់ ថា"
        },
        {
            "barcode": "BBWS180202277",
            "dpc": "03023927301",
            "name": "ហេង សិរីវឌ្ឍនះ"
        },
        {
            "barcode": "BBWS180202278",
            "dpc": "03023927401",
            "name": "តាំង ប៊ុនណាន"
        },
        {
            "barcode": "BBWS180202279",
            "dpc": "03023927501",
            "name": "ហម សារួន"
        },
        {
            "barcode": "BBWS180202280",
            "dpc": "03023927601",
            "name": "កា សាលី"
        },
        {
            "barcode": "BBWS180202281",
            "dpc": "03023927701",
            "name": "អែល រ៉ូស្សា"
        },
        {
            "barcode": "BBWS180202282",
            "dpc": "03023927801",
            "name": "លឹម កេស្មី"
        },
        {
            "barcode": "BBWS180202283",
            "dpc": "03023927901",
            "name": "ម៉ាន់ ព្រីត"
        },
        {
            "barcode": "BBWS180202284",
            "dpc": "03023928001",
            "name": "សុះ ម៉ៅ"
        },
        {
            "barcode": "BBWS180202285",
            "dpc": "03023928101",
            "name": "តាំង ស៊ីវជីន"
        },
        {
            "barcode": "BBWS180202286",
            "dpc": "03023928201",
            "name": "ម៉ាន លី"
        },
        {
            "barcode": "BBWS180202287",
            "dpc": "03023928301",
            "name": "ឡោះ ម៉ាត់"
        },
        {
            "barcode": "BBWS180202288",
            "dpc": "03023928401",
            "name": "ម៉ុន សុខុម"
        },
        {
            "barcode": "BBWS180202289",
            "dpc": "03023928501",
            "name": "បឋមសិក្សាក្តុល"
        },
        {
            "barcode": "BBWS180202290",
            "dpc": "03023928601",
            "name": "ឃ្លោក ម៉ក់"
        },
        {
            "barcode": "BBWS180202291",
            "dpc": "03023928701",
            "name": "ប៉ា ប៉ូ"
        },
        {
            "barcode": "BBWS180202292",
            "dpc": "03023928801",
            "name": "លី សារី"
        },
        {
            "barcode": "BBWS180202293",
            "dpc": "03023928901",
            "name": "ហ៊ាង រស្មី"
        },
        {
            "barcode": "BBWS180202294",
            "dpc": "03023929001",
            "name": "ពិន យ៉ា"
        },
        {
            "barcode": "BBWS180202295",
            "dpc": "03023929101",
            "name": "ឃូ លីមជីវ"
        },
        {
            "barcode": "BBWS180202296",
            "dpc": "03023929201",
            "name": "ប៉ិច សុផល"
        },
        {
            "barcode": "BBWS180202297",
            "dpc": "03023929301",
            "name": "សួង សាវ៉េត"
        },
        {
            "barcode": "BBWS180202298",
            "dpc": "03023929401",
            "name": "តែម ធានី"
        },
        {
            "barcode": "BBWS180202299",
            "dpc": "03023929501",
            "name": "អោម ពន្លក"
        },
        {
            "barcode": "BBWS180202300",
            "dpc": "03023929601",
            "name": "សួង គាន"
        },
        {
            "barcode": "BBWS180202301",
            "dpc": "03023929801",
            "name": "ស៊ុន ធឿន"
        },
        {
            "barcode": "BBWS180202302",
            "dpc": "03023929901",
            "name": "ឃ្ងិន សុម៉ាលី"
        },
        {
            "barcode": "BBWS180202303",
            "dpc": "03023930001",
            "name": "សឹម សុខ"
        },
        {
            "barcode": "BBWS180202304",
            "dpc": "03023930101",
            "name": "ជា អាន"
        },
        {
            "barcode": "BBWS180202305",
            "dpc": "03023930201",
            "name": "ឡោក ហឿម"
        },
        {
            "barcode": "BBWS180202306",
            "dpc": "03023930301",
            "name": "ហ៊ួត គឹមលាង"
        },
        {
            "barcode": "BBWS180202307",
            "dpc": "03023930401",
            "name": "ឌិន វណ្ណា"
        },
        {
            "barcode": "BBWS180202308",
            "dpc": "03023930501",
            "name": "ឌិន វ៉ាន់ឌី"
        },
        {
            "barcode": "BBWS180202309",
            "dpc": "03023930601",
            "name": "ជួប សុខុម"
        },
        {
            "barcode": "BBWS180202310",
            "dpc": "03023930701",
            "name": "ឌិន វ៉ាន់ដា"
        },
        {
            "barcode": "BBWS180202311",
            "dpc": "03023930801",
            "name": "សាន មករា"
        },
        {
            "barcode": "BBWS180202312",
            "dpc": "03023930901",
            "name": "ឃ្លិន និវឌ្ឍន៍"
        },
        {
            "barcode": "BBWS180202313",
            "dpc": "03023931001",
            "name": "ហ៊ួត ពេញ"
        },
        {
            "barcode": "BBWS180202314",
            "dpc": "03023931101",
            "name": "ហ៊ួត សំបូរ"
        },
        {
            "barcode": "BBWS180202315",
            "dpc": "03023931301",
            "name": "ហួត ចន្ថា"
        },
        {
            "barcode": "BBWS180202316",
            "dpc": "03023931401",
            "name": "ហ៊ួត ចាន់ឌី"
        },
        {
            "barcode": "BBWS180202317",
            "dpc": "03023931501",
            "name": "ហ៊ួត ចាន់ដេត"
        },
        {
            "barcode": "BBWS180202318",
            "dpc": "03023931601",
            "name": "ហ៊ុន ចៅសម្បត្តិ"
        },
        {
            "barcode": "BBWS180202319",
            "dpc": "03023931701",
            "name": "ព ពៅ"
        },
        {
            "barcode": "BBWS180202320",
            "dpc": "03023931901",
            "name": "រុន ចាន់និត"
        },
        {
            "barcode": "BBWS180202321",
            "dpc": "03023932001",
            "name": "ហ៊ិន វ៉ាន់នាងសូលីដា"
        },
        {
            "barcode": "BBWS180202322",
            "dpc": "03023932101",
            "name": "ឃឿន ខឿត"
        },
        {
            "barcode": "BBWS180202323",
            "dpc": "03023932201",
            "name": "ហ៊ួត សុផល"
        },
        {
            "barcode": "BBWS180202324",
            "dpc": "03023932301",
            "name": "គង់ គូររុន"
        },
        {
            "barcode": "BBWS180202325",
            "dpc": "03023932401",
            "name": "មល់ សុដានី"
        },
        {
            "barcode": "BBWS180202326",
            "dpc": "03023932501",
            "name": "ឡោក ហឿត"
        },
        {
            "barcode": "BBWS180202327",
            "dpc": "03023932601",
            "name": "ហ៊ន ឈុនលី"
        },
        {
            "barcode": "BBWS180202328",
            "dpc": "03023932701",
            "name": "ចែត្រ ឌឿន"
        },
        {
            "barcode": "BBWS180202329",
            "dpc": "03023932801",
            "name": "ប៊ុន សុខេង"
        },
        {
            "barcode": "BBWS180202330",
            "dpc": "03023932901",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "BBWS180202331",
            "dpc": "03023933001",
            "name": "ពេជ្រ សាវរ៉ា"
        },
        {
            "barcode": "BBWS180202332",
            "dpc": "03023933101",
            "name": "ពេជ្រ សារួន"
        },
        {
            "barcode": "BBWS180202333",
            "dpc": "03023933201",
            "name": "វ៉ាន់ ថន"
        },
        {
            "barcode": "BBWS180202334",
            "dpc": "03023933301",
            "name": "ឯម សោភ័ណ្ឌ"
        },
        {
            "barcode": "BBWS180202335",
            "dpc": "03023933401",
            "name": "ឈូក សុភាព"
        },
        {
            "barcode": "BBWS180202336",
            "dpc": "03023933501",
            "name": "រស់ សានិត"
        },
        {
            "barcode": "BBWS180202337",
            "dpc": "03023933601",
            "name": "ធឿន សំណាង"
        },
        {
            "barcode": "BBWS180202338",
            "dpc": "03023933701",
            "name": "អិត ធឿន"
        },
        {
            "barcode": "BBWS180202339",
            "dpc": "03023933801",
            "name": "កង សុខា"
        },
        {
            "barcode": "BBWS180202340",
            "dpc": "03023933901",
            "name": "ពិន ចាន់ឡា"
        },
        {
            "barcode": "BBWS180202341",
            "dpc": "03023934001",
            "name": "ពិន ថាវរិន"
        },
        {
            "barcode": "BBWS180202342",
            "dpc": "03023934101",
            "name": "បូ មុំ"
        },
        {
            "barcode": "BBWS180202343",
            "dpc": "03023934201",
            "name": "បូ សុខខូ"
        },
        {
            "barcode": "BBWS180202344",
            "dpc": "03023934301",
            "name": "កង រំ"
        },
        {
            "barcode": "BBWS180202345",
            "dpc": "03023934401",
            "name": "សំ រិន"
        },
        {
            "barcode": "BBWS180202346",
            "dpc": "03023934501",
            "name": "ខេង សំនៀង"
        },
        {
            "barcode": "BBWS180202347",
            "dpc": "03023934601",
            "name": "ជា ឆុន"
        },
        {
            "barcode": "BBWS180202348",
            "dpc": "03023934701",
            "name": "ថោង សារឿន"
        },
        {
            "barcode": "BBWS180202349",
            "dpc": "03023934801",
            "name": "ស្រី​ សុភី"
        },
        {
            "barcode": "BBWS180202350",
            "dpc": "03023934901",
            "name": "សាត គឿន"
        },
        {
            "barcode": "BBWS180202351",
            "dpc": "03023935001",
            "name": "ចាន់ អៃ"
        },
        {
            "barcode": "BBWS180202352",
            "dpc": "03023935101",
            "name": "គង់ កង"
        },
        {
            "barcode": "BBWS180202353",
            "dpc": "03023935201",
            "name": "គង់ សុភា"
        },
        {
            "barcode": "BBWS180202354",
            "dpc": "03023935301",
            "name": "អុល អឿន"
        },
        {
            "barcode": "BBWS180202355",
            "dpc": "03023935401",
            "name": "សំ ណារិទ្ថ"
        },
        {
            "barcode": "BBWS180202356",
            "dpc": "03023935501",
            "name": "សឿន សុខា"
        },
        {
            "barcode": "BBWS180202357",
            "dpc": "03023935601",
            "name": "ផន រឿម"
        },
        {
            "barcode": "BBWS180202358",
            "dpc": "03023935701",
            "name": "ម៉ន សារ៉ង"
        },
        {
            "barcode": "BBWS180202359",
            "dpc": "03023935801",
            "name": "ស ច្រិប"
        },
        {
            "barcode": "BBWS180202360",
            "dpc": "03023935901",
            "name": "ប៉ាន យឿត"
        },
        {
            "barcode": "BBWS180202361",
            "dpc": "03023936001",
            "name": "មល់ សក្ត័"
        },
        {
            "barcode": "BBWS180202362",
            "dpc": "03023936101",
            "name": "ទី កី"
        },
        {
            "barcode": "BBWS180202363",
            "dpc": "03023936201",
            "name": "ថ្លាង សឹម"
        },
        {
            "barcode": "BBWS180202364",
            "dpc": "03023936301",
            "name": "ហុក វណ្ណី"
        },
        {
            "barcode": "BBWS180202365",
            "dpc": "03023936501",
            "name": "ប៉ែន វុទ្ធី"
        },
        {
            "barcode": "BBWS180202366",
            "dpc": "03023936601",
            "name": "ញ៉ក ភាន"
        },
        {
            "barcode": "BBWS180202367",
            "dpc": "03023936701",
            "name": "ហម មឿន"
        },
        {
            "barcode": "BBWS180202368",
            "dpc": "03023936801",
            "name": "ឈឿន ឈឿត"
        },
        {
            "barcode": "BBWS180202369",
            "dpc": "03023936901",
            "name": "រឿន ហុក"
        },
        {
            "barcode": "BBWS180202370",
            "dpc": "03023937001",
            "name": "ឡឹក សារ៉ាត់"
        },
        {
            "barcode": "BBWS180202371",
            "dpc": "03023937101",
            "name": "រ៉ែម មុំ"
        },
        {
            "barcode": "BBWS180202372",
            "dpc": "03023937201",
            "name": "រ៉ែម រ៉ាន់"
        },
        {
            "barcode": "BBWS180202373",
            "dpc": "03023937301",
            "name": "ផន ប៊ុនថន"
        },
        {
            "barcode": "BBWS180202374",
            "dpc": "03023937401",
            "name": "គីម សុខវណ្ណា"
        },
        {
            "barcode": "BBWS180202375",
            "dpc": "03023937501",
            "name": "ហ៊រ យ៉ៃ"
        },
        {
            "barcode": "BBWS180202376",
            "dpc": "03023937601",
            "name": "ហ៊រ ជួប"
        },
        {
            "barcode": "BBWS180202377",
            "dpc": "03023937701",
            "name": "ញ៉ែម សារ៉េត"
        },
        {
            "barcode": "BBWS180202378",
            "dpc": "03023937801",
            "name": "ជេស គឹមសល់"
        },
        {
            "barcode": "BBWS180202379",
            "dpc": "03023937901",
            "name": "ខ្លូត សៀក"
        },
        {
            "barcode": "BBWS180202380",
            "dpc": "03023938001",
            "name": "ម៉ែន ស្រស់"
        },
        {
            "barcode": "BBWS180202381",
            "dpc": "03023938101",
            "name": "ម៉ែន វី"
        },
        {
            "barcode": "BBWS180202382",
            "dpc": "03023938201",
            "name": "ផឹក ផាន់នេ"
        },
        {
            "barcode": "BBWS180202383",
            "dpc": "03023938301",
            "name": "ស្វាយ រចនា"
        },
        {
            "barcode": "BBWS180202384",
            "dpc": "03023938401",
            "name": "រ័ត្ន វាន់យ៉ា"
        },
        {
            "barcode": "BBWS180202385",
            "dpc": "03023938501",
            "name": "គង់ ផ្លសា"
        },
        {
            "barcode": "BBWS180202386",
            "dpc": "03023938601",
            "name": "វ៉ាត់ សឺត"
        },
        {
            "barcode": "BBWS180202387",
            "dpc": "03023938701",
            "name": "វុន សំណាង"
        },
        {
            "barcode": "BBWS180202388",
            "dpc": "03023938801",
            "name": "ភី ចាន់ដារ៉ា"
        },
        {
            "barcode": "BBWS180202389",
            "dpc": "03023938901",
            "name": "ខាវ វីរ៉ា"
        },
        {
            "barcode": "BBWS180202390",
            "dpc": "03023939001",
            "name": "រ៉េត ច្រិប"
        },
        {
            "barcode": "BBWS180202391",
            "dpc": "03023939101",
            "name": "សេង ប៊ុនសុង"
        },
        {
            "barcode": "BBWS180202392",
            "dpc": "03023939201",
            "name": "ប៊ុន ហុង"
        },
        {
            "barcode": "BBWS180202393",
            "dpc": "03023939301",
            "name": "ប៉ិច យូហាក់"
        },
        {
            "barcode": "BBWS180202394",
            "dpc": "03023939401",
            "name": "ឡោះ តាំ"
        },
        {
            "barcode": "BBWS180202395",
            "dpc": "03023939501",
            "name": "រិន សារ៉ន"
        },
        {
            "barcode": "BBWS180202396",
            "dpc": "03023939601",
            "name": "ផាន់ សច្ចា"
        },
        {
            "barcode": "BBWS180202397",
            "dpc": "03023939701",
            "name": "លី ចាន់ថា"
        },
        {
            "barcode": "BBWS180202398",
            "dpc": "03023939801",
            "name": "ស្រស់ មៃសុំ"
        },
        {
            "barcode": "BBWS180202399",
            "dpc": "03023939901",
            "name": "ម៉ាត់ ម៉ាស់"
        },
        {
            "barcode": "BBWS180202400",
            "dpc": "03023940001",
            "name": "អ៊ុង វត្ថា"
        },
        {
            "barcode": "BBWS180202401",
            "dpc": "03023940101",
            "name": "ប៉ាក់ ហ៊ូរ"
        },
        {
            "barcode": "BBWS180202402",
            "dpc": "03023940201",
            "name": "លី ឆេង"
        },
        {
            "barcode": "BBWS180202403",
            "dpc": "03023940301",
            "name": "អ៊ិត ឆា"
        },
        {
            "barcode": "BBWS180202404",
            "dpc": "03023940501",
            "name": "ហឿត សុដារី"
        },
        {
            "barcode": "BBWS180202405",
            "dpc": "03023940601",
            "name": "យុន ខ្ចៅ"
        },
        {
            "barcode": "BBWS180202406",
            "dpc": "03023940701",
            "name": "ជៀម ថោង"
        },
        {
            "barcode": "BBWS180202407",
            "dpc": "03023940801",
            "name": "ឡោក សាវុធ"
        },
        {
            "barcode": "BBWS180202408",
            "dpc": "03023940901",
            "name": "អ៊ុត ភក្តី"
        },
        {
            "barcode": "BBWS180202409",
            "dpc": "03023941001",
            "name": "សុង សុភាព"
        },
        {
            "barcode": "BBWS180202410",
            "dpc": "03023941101",
            "name": "កៅ កង"
        },
        {
            "barcode": "BBWS180202411",
            "dpc": "03023941201",
            "name": "សួង សាវុទ្ទ"
        },
        {
            "barcode": "BBWS180202412",
            "dpc": "03023941301",
            "name": "សារិន ឃីម"
        },
        {
            "barcode": "BBWS180202413",
            "dpc": "03023941401",
            "name": "មេត ដារី"
        },
        {
            "barcode": "BBWS180202414",
            "dpc": "03023941501",
            "name": "ផៃ រដ្ឋា"
        },
        {
            "barcode": "BBWS180202415",
            "dpc": "03023941601",
            "name": "កឹម រ៉េត"
        },
        {
            "barcode": "BBWS180202416",
            "dpc": "03023941801",
            "name": "សាលាបាយវត្តពោធិវង្ស"
        },
        {
            "barcode": "BBWS180202417",
            "dpc": "03023941901",
            "name": "សុខ សុភី"
        },
        {
            "barcode": "BBWS180202418",
            "dpc": "03023942001",
            "name": "សឹម ចន្នី"
        },
        {
            "barcode": "BBWS180202419",
            "dpc": "03023942101",
            "name": "សៅ សុធា"
        },
        {
            "barcode": "BBWS180202420",
            "dpc": "03023942201",
            "name": "សយ ផាត"
        },
        {
            "barcode": "BBWS180202421",
            "dpc": "03023942301",
            "name": "មួង សុខវាសនា"
        },
        {
            "barcode": "BBWS180202422",
            "dpc": "03023942401",
            "name": "ហេង លាង"
        },
        {
            "barcode": "BBWS180202423",
            "dpc": "03023942501",
            "name": "សេង សឿម"
        },
        {
            "barcode": "BBWS180202424",
            "dpc": "03023942601",
            "name": "សុង សំឡី"
        },
        {
            "barcode": "BBWS180202425",
            "dpc": "03023942701",
            "name": "សុច សាវឿង"
        },
        {
            "barcode": "BBWS180202426",
            "dpc": "03023942801",
            "name": "រឿត បូរ"
        },
        {
            "barcode": "BBWS180202427",
            "dpc": "03023942901",
            "name": "ង៉ុយ រឿត"
        },
        {
            "barcode": "BBWS180202428",
            "dpc": "03023943001",
            "name": "ឌួង សាវុធ"
        },
        {
            "barcode": "BBWS180202429",
            "dpc": "03023943101",
            "name": "រឿត បូរ២"
        },
        {
            "barcode": "BBWS180202430",
            "dpc": "03023943201",
            "name": "កៀត សុជាតិ"
        },
        {
            "barcode": "BBWS180202431",
            "dpc": "03023943301",
            "name": "រ៉ាន សំអឿន"
        },
        {
            "barcode": "BBWS180202432",
            "dpc": "03023943401",
            "name": "លាយ រៀម"
        },
        {
            "barcode": "BBWS180202433",
            "dpc": "03023943501",
            "name": "អ៊ីត ម៉ុន"
        },
        {
            "barcode": "BBWS180202434",
            "dpc": "03023943601",
            "name": "វ៉ាន់ សុផាត"
        },
        {
            "barcode": "BBWS180202435",
            "dpc": "03023943701",
            "name": "ឡុង ស៊ីថា"
        },
        {
            "barcode": "BBWS180202436",
            "dpc": "03023943801",
            "name": "អាន់ មុំ"
        },
        {
            "barcode": "BBWS180202437",
            "dpc": "03023943901",
            "name": "ស៊ត ឡុង"
        },
        {
            "barcode": "BBWS180202438",
            "dpc": "03023944001",
            "name": "ខន ត្រប់"
        },
        {
            "barcode": "BBWS180202439",
            "dpc": "03023944101",
            "name": "សៀ សៅលីន"
        },
        {
            "barcode": "BBWS180202440",
            "dpc": "03023944201",
            "name": "វិន វ៉ិត"
        },
        {
            "barcode": "BBWS180202441",
            "dpc": "03023944301",
            "name": "ទូច សុភាព"
        },
        {
            "barcode": "BBWS180202442",
            "dpc": "03023944401",
            "name": "រួន រិត"
        },
        {
            "barcode": "BBWS180202443",
            "dpc": "03023944501",
            "name": "មាជ មាន"
        },
        {
            "barcode": "BBWS180202444",
            "dpc": "03023944601",
            "name": "ណក់ សារួង"
        },
        {
            "barcode": "BBWS180202445",
            "dpc": "03023944701",
            "name": "គីវ ពុជ"
        },
        {
            "barcode": "BBWS180202446",
            "dpc": "03023944801",
            "name": "សន កំសត់"
        },
        {
            "barcode": "BBWS180202447",
            "dpc": "03023944901",
            "name": "វ៉ន អូន"
        },
        {
            "barcode": "BBWS180202448",
            "dpc": "03023945101",
            "name": "យឿន យ៉ិត"
        },
        {
            "barcode": "BBWS180202449",
            "dpc": "03023945301",
            "name": "ឡុង សាលីំម"
        },
        {
            "barcode": "BBWS180202450",
            "dpc": "03023945401",
            "name": "សេង សុសាង"
        },
        {
            "barcode": "BBWS180202451",
            "dpc": "03023945501",
            "name": "ផែង ចំរើន"
        },
        {
            "barcode": "BBWS180202452",
            "dpc": "03023945601",
            "name": "ហឿន ធា"
        },
        {
            "barcode": "BBWS180202453",
            "dpc": "03023945701",
            "name": "កែម កាក់"
        },
        {
            "barcode": "BBWS180202454",
            "dpc": "03023945801",
            "name": "ឆាយ សំណាង"
        },
        {
            "barcode": "BBWS180202455",
            "dpc": "03023945901",
            "name": "វ៉ាត់ ប៉ន"
        },
        {
            "barcode": "BBWS180202456",
            "dpc": "03023946001",
            "name": "រ៉ាត់ រ៉ូ"
        },
        {
            "barcode": "BBWS180202457",
            "dpc": "03023946101",
            "name": "សោម មករា"
        },
        {
            "barcode": "BBWS180202458",
            "dpc": "03023946201",
            "name": "រ៉ុម គុំ"
        },
        {
            "barcode": "BBWS180202459",
            "dpc": "03023946301",
            "name": "ឡុង សារឿន"
        },
        {
            "barcode": "BBWS180202460",
            "dpc": "03023946401",
            "name": "ប៉េង ប៊ាន"
        },
        {
            "barcode": "BBWS180202461",
            "dpc": "03023946501",
            "name": "ខន សារឿន"
        },
        {
            "barcode": "BBWS180202462",
            "dpc": "03023946601",
            "name": "ខន មករា"
        },
        {
            "barcode": "BBWS180202463",
            "dpc": "03023946701",
            "name": "តុប សុផល"
        },
        {
            "barcode": "BBWS180202464",
            "dpc": "03023946801",
            "name": "សេង សារិន"
        },
        {
            "barcode": "BBWS180202465",
            "dpc": "03023946901",
            "name": "ម៉ៅ រួប"
        },
        {
            "barcode": "BBWS180202466",
            "dpc": "03023947001",
            "name": "ស្មី"
        },
        {
            "barcode": "BBWS180202467",
            "dpc": "03023947101",
            "name": "ផា ឆឿប"
        },
        {
            "barcode": "BBWS180202468",
            "dpc": "03023947201",
            "name": "ផ្ទះលេខ៣០០"
        },
        {
            "barcode": "BBWS180202469",
            "dpc": "03023947301",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "BBWS180202470",
            "dpc": "03023947401",
            "name": "ឈី នឿន"
        },
        {
            "barcode": "BBWS180202471",
            "dpc": "03023947501",
            "name": "ផ្ទះលេខ៣០២"
        },
        {
            "barcode": "BBWS180202472",
            "dpc": "03023947601",
            "name": "ផ្ទលេខ៣០៣"
        },
        {
            "barcode": "BBWS180202473",
            "dpc": "03023947701",
            "name": "សែន សារីទ្ធ"
        },
        {
            "barcode": "BBWS180202474",
            "dpc": "03023947801",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "BBWS180202475",
            "dpc": "03023948001",
            "name": "ឃឹម សាវ៉ឺន"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
