let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=
    [
        {
            "barcode": "BBWS180200438",
            "dpc": "03034000101",
            "name": "ជិន សុខុន"
        },
        {
            "barcode": "BBWS180200439",
            "dpc": "03034000201",
            "name": "ញ៉ាន វឿត"
        },
        {
            "barcode": "BBWS180200440",
            "dpc": "03034000301",
            "name": "សេក ចាន់ដារ៉ា"
        },
        {
            "barcode": "BBWS180200441",
            "dpc": "03034000401",
            "name": "ស៊ិន សុផល"
        },
        {
            "barcode": "BBWS180200442",
            "dpc": "03034000501",
            "name": "ស៊ាន សេត"
        },
        {
            "barcode": "BBWS180200443",
            "dpc": "03034000601",
            "name": "រួម ផន"
        },
        {
            "barcode": "BBWS180200444",
            "dpc": "03034000701",
            "name": "ជិន ពៅ"
        },
        {
            "barcode": "BBWS180200445",
            "dpc": "03034000901",
            "name": "ថង ឡុង"
        },
        {
            "barcode": "BBWS180200446",
            "dpc": "03034001001",
            "name": "ង៉ែត ងិន"
        },
        {
            "barcode": "BBWS180200447",
            "dpc": "03034001201",
            "name": "ធន ថារី"
        },
        {
            "barcode": "BBWS180200448",
            "dpc": "03034001301",
            "name": "ងិន សំបូរ"
        },
        {
            "barcode": "BBWS180200449",
            "dpc": "03034001401",
            "name": "សុខ វ៉ាត់ធី"
        },
        {
            "barcode": "BBWS180200450",
            "dpc": "03034001501",
            "name": "ហួន ចិន្តា"
        },
        {
            "barcode": "BBWS180200451",
            "dpc": "03034001601",
            "name": "ឆាយ ចំណង់"
        },
        {
            "barcode": "BBWS180200452",
            "dpc": "03034001701",
            "name": "នឹង សុភាព"
        },
        {
            "barcode": "BBWS180200453",
            "dpc": "03034001801",
            "name": "ហុក វាសនា"
        },
        {
            "barcode": "BBWS180200454",
            "dpc": "03034001901",
            "name": "ប៊ិន វ៉ាន់នី"
        },
        {
            "barcode": "BBWS180200455",
            "dpc": "03034002001",
            "name": "យ៉ង់ វ៉ុន"
        },
        {
            "barcode": "BBWS180200456",
            "dpc": "03034002101",
            "name": "ចាប ស៊ីថា"
        },
        {
            "barcode": "BBWS180200457",
            "dpc": "03034002201",
            "name": "ហង្ស សីហា"
        },
        {
            "barcode": "BBWS180200458",
            "dpc": "03034002301",
            "name": "សុខ សំណាង"
        },
        {
            "barcode": "BBWS180200459",
            "dpc": "03034002401",
            "name": "កាន់ វិសេដ្ឋ"
        },
        {
            "barcode": "BBWS180200460",
            "dpc": "03034002501",
            "name": "ស៊ុន សុខុន"
        },
        {
            "barcode": "BBWS180200461",
            "dpc": "03034002601",
            "name": "ឈឿ រុក្ខា"
        },
        {
            "barcode": "BBWS180200462",
            "dpc": "03034002701",
            "name": "ឈឿត វុទ្ធី"
        },
        {
            "barcode": "BBWS180200463",
            "dpc": "03034002801",
            "name": "ឡេង គឹមទៀង"
        },
        {
            "barcode": "BBWS180200464",
            "dpc": "03034002901",
            "name": "ឃឿម សាវិញ"
        },
        {
            "barcode": "BBWS180200465",
            "dpc": "03034003001",
            "name": "កង ចាន់លី"
        },
        {
            "barcode": "BBWS180200466",
            "dpc": "03034003101",
            "name": "ជួន សុផុន"
        },
        {
            "barcode": "BBWS180200467",
            "dpc": "03034003201",
            "name": "ជួប ជឿប"
        },
        {
            "barcode": "BBWS180200468",
            "dpc": "03034003301",
            "name": "ភុំ សុជាតិ"
        },
        {
            "barcode": "BBWS180200469",
            "dpc": "03034003401",
            "name": "ប៊ី ឌឿន"
        },
        {
            "barcode": "BBWS180200470",
            "dpc": "03034003501",
            "name": "ជួប សុខណាំ"
        },
        {
            "barcode": "BBWS180200471",
            "dpc": "03034003601",
            "name": "ម៉េង ហុង"
        },
        {
            "barcode": "BBWS180200472",
            "dpc": "03034003701",
            "name": "វ៉ន សាវ័ន្ត"
        },
        {
            "barcode": "BBWS180200473",
            "dpc": "03034003801",
            "name": "ភុន ភៀង"
        },
        {
            "barcode": "BBWS180200474",
            "dpc": "03034003901",
            "name": "សេង សុខនី"
        },
        {
            "barcode": "BBWS180200475",
            "dpc": "03034004001",
            "name": "អុប វណ្ណី"
        },
        {
            "barcode": "BBWS180200476",
            "dpc": "03034004101",
            "name": "អុប យឿត"
        },
        {
            "barcode": "BBWS180200477",
            "dpc": "03034004201",
            "name": "ស៊ីម សឿន"
        },
        {
            "barcode": "BBWS180200478",
            "dpc": "03034004301",
            "name": "ឆម រដ្ឋា"
        },
        {
            "barcode": "BBWS180200479",
            "dpc": "03034004401",
            "name": "សឿត វ៉ាត"
        },
        {
            "barcode": "BBWS180200480",
            "dpc": "03034004501",
            "name": "យឿម សុភា"
        },
        {
            "barcode": "BBWS180200481",
            "dpc": "03034004601",
            "name": "បណ្ណាគារសន្តិភាព"
        },
        {
            "barcode": "BBWS180200482",
            "dpc": "03034004701",
            "name": "ងិន ម៉ាប់"
        },
        {
            "barcode": "BBWS180200483",
            "dpc": "03034004801",
            "name": "ហម សាវេត"
        },
        {
            "barcode": "BBWS180200484",
            "dpc": "03034004901",
            "name": "យឿន រ៉ម"
        },
        {
            "barcode": "BBWS180200485",
            "dpc": "03034005001",
            "name": "យឹម សោម"
        },
        {
            "barcode": "BBWS180200486",
            "dpc": "03034005101",
            "name": "សោម ភក្តី"
        },
        {
            "barcode": "BBWS180200487",
            "dpc": "03034005201",
            "name": "រ៉ុត សារ៉ូ"
        },
        {
            "barcode": "BBWS180200488",
            "dpc": "03034005301",
            "name": "ជួន ឆុត"
        },
        {
            "barcode": "BBWS180200489",
            "dpc": "03034005501",
            "name": "ឆុន ព្រុំ"
        },
        {
            "barcode": "BBWS180200490",
            "dpc": "03034005601",
            "name": "ខូវ វួតហៀង"
        },
        {
            "barcode": "BBWS180200491",
            "dpc": "03034005701",
            "name": "ហួ រដ្ឋា"
        },
        {
            "barcode": "BBWS180200492",
            "dpc": "03034005801",
            "name": "ជា ដារ៉ា"
        },
        {
            "barcode": "BBWS180200493",
            "dpc": "03034005901",
            "name": "នួន សិលា"
        },
        {
            "barcode": "BBWS180200494",
            "dpc": "03034006001",
            "name": "យុន ខេន"
        },
        {
            "barcode": "BBWS180200495",
            "dpc": "03034006101",
            "name": "សៀង សុគ្គន្ធ"
        },
        {
            "barcode": "BBWS180200496",
            "dpc": "03034006201",
            "name": "ណម សយ"
        },
        {
            "barcode": "BBWS180200497",
            "dpc": "03034006301",
            "name": "នុង ឡឹង"
        },
        {
            "barcode": "BBWS180200498",
            "dpc": "03034006401",
            "name": "ហៃ សារត្ន័"
        },
        {
            "barcode": "BBWS180200499",
            "dpc": "03034006501",
            "name": "គីម ចំរើន"
        },
        {
            "barcode": "BBWS180200500",
            "dpc": "03034006601",
            "name": "ខេង ទី"
        },
        {
            "barcode": "BBWS180200501",
            "dpc": "03034006701",
            "name": "ជិន សុដានី"
        },
        {
            "barcode": "BBWS180200502",
            "dpc": "03034006801",
            "name": "សឿង សុភ័ក្រ្ត"
        },
        {
            "barcode": "BBWS180200503",
            "dpc": "03034006901",
            "name": "ហេង ពៅ"
        },
        {
            "barcode": "BBWS180200504",
            "dpc": "03034007001",
            "name": "អ៊ឹម សុទ្ធ"
        },
        {
            "barcode": "BBWS180200505",
            "dpc": "03034007101",
            "name": "ឡុង ពិសី"
        },
        {
            "barcode": "BBWS180200506",
            "dpc": "03034007201",
            "name": "ហាយ ប៉ូឡូ"
        },
        {
            "barcode": "BBWS180200507",
            "dpc": "03034007301",
            "name": "ប៉ាញ ហឿន"
        },
        {
            "barcode": "BBWS180200508",
            "dpc": "03034007401",
            "name": "ជុំ គង"
        },
        {
            "barcode": "BBWS180200509",
            "dpc": "03034007501",
            "name": "ហួន វិជ័យ"
        },
        {
            "barcode": "BBWS180200510",
            "dpc": "03034007601",
            "name": "ជា អេង"
        },
        {
            "barcode": "BBWS180200511",
            "dpc": "03034008001",
            "name": "ម៉ា​ លីយ៉ា"
        },
        {
            "barcode": "BBWS180200512",
            "dpc": "03034008201",
            "name": "ឆាត់ សុធា"
        },
        {
            "barcode": "BBWS180200513",
            "dpc": "03034009401",
            "name": "ហួត សុជាតិ"
        },
        {
            "barcode": "BBWS180200514",
            "dpc": "03034010001",
            "name": "ឈិន ណាតុង"
        },
        {
            "barcode": "BBWS180200515",
            "dpc": "03034010201",
            "name": "ជាន ណូរ៉ា"
        },
        {
            "barcode": "BBWS180200516",
            "dpc": "03034010301",
            "name": "រឿន សារុំ"
        },
        {
            "barcode": "BBWS180200517",
            "dpc": "03034010401",
            "name": "ផន ចាន់ថារិទ្ធ"
        },
        {
            "barcode": "BBWS180200518",
            "dpc": "03034010501",
            "name": "អ៊ឹម សាញ"
        },
        {
            "barcode": "BBWS180200519",
            "dpc": "03034010601",
            "name": "ហេង សុខឡេង"
        },
        {
            "barcode": "BBWS180200520",
            "dpc": "03034010701",
            "name": "សោម សុផល"
        },
        {
            "barcode": "BBWS180200521",
            "dpc": "03034010801",
            "name": "លឹម ចេង"
        },
        {
            "barcode": "BBWS180200522",
            "dpc": "03034022701",
            "name": "រ៉ាត់ ស្រីយ៉ា"
        },
        {
            "barcode": "BBWS180200523",
            "dpc": "03034010901",
            "name": "កំ ហ៊ីង"
        },
        {
            "barcode": "BBWS180200524",
            "dpc": "03034011001",
            "name": "ប៉ក់ រស់"
        },
        {
            "barcode": "BBWS180200525",
            "dpc": "03034011101",
            "name": "ឈិន សាលី"
        },
        {
            "barcode": "BBWS180200526",
            "dpc": "03034011201",
            "name": "ស៊ុម នឿន"
        },
        {
            "barcode": "BBWS180200527",
            "dpc": "03034011301",
            "name": "កំ ស៊ត"
        },
        {
            "barcode": "BBWS180200528",
            "dpc": "03034011401",
            "name": "សេង ហួរ"
        },
        {
            "barcode": "BBWS180200529",
            "dpc": "03034011501",
            "name": "សុខ ហេន"
        },
        {
            "barcode": "BBWS180200530",
            "dpc": "03034011601",
            "name": "ហួយ សុខរឿន"
        },
        {
            "barcode": "BBWS180200531",
            "dpc": "03034011701",
            "name": "ស៊ឹម រួម"
        },
        {
            "barcode": "BBWS180200532",
            "dpc": "03034011801",
            "name": "ទិត្យ តែម"
        },
        {
            "barcode": "BBWS180200533",
            "dpc": "03034011901",
            "name": "ប្រិម សារិន"
        },
        {
            "barcode": "BBWS180200534",
            "dpc": "03034022801",
            "name": "ញឹម ប៉ុន"
        },
        {
            "barcode": "BBWS180200535",
            "dpc": "03034012001",
            "name": "ថន ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180200536",
            "dpc": "03034012101",
            "name": "បេន លាង"
        },
        {
            "barcode": "BBWS180200537",
            "dpc": "03034012201",
            "name": "សេក សារវឿន"
        },
        {
            "barcode": "BBWS180200538",
            "dpc": "03034012301",
            "name": "ឆុន ចាន់ថុល"
        },
        {
            "barcode": "BBWS180200539",
            "dpc": "03034012401",
            "name": "មុំ ផាត"
        },
        {
            "barcode": "BBWS180200540",
            "dpc": "03034012501",
            "name": "អោម ពីសី"
        },
        {
            "barcode": "BBWS180200541",
            "dpc": "03034012601",
            "name": "សួន សំណាង"
        },
        {
            "barcode": "BBWS180200542",
            "dpc": "03034012701",
            "name": "ហ៊ន សុខឃួន"
        },
        {
            "barcode": "BBWS180200543",
            "dpc": "03034012801",
            "name": "សាឯម សេដ្ឋា"
        },
        {
            "barcode": "BBWS180200544",
            "dpc": "03034012901",
            "name": "ច្រែង រិទ្ធ"
        },
        {
            "barcode": "BBWS180200545",
            "dpc": "03034013001",
            "name": "តិ មាស"
        },
        {
            "barcode": "BBWS180200546",
            "dpc": "03034013101",
            "name": "រឿន ចំរើន"
        },
        {
            "barcode": "BBWS180200547",
            "dpc": "03034013201",
            "name": "ម៉ក់ សាវុធ"
        },
        {
            "barcode": "BBWS180200548",
            "dpc": "03034013301",
            "name": "ស៊ូ ប៊ូ"
        },
        {
            "barcode": "BBWS180200549",
            "dpc": "03034013401",
            "name": "ថៃ ប៊ុនណៃ"
        },
        {
            "barcode": "BBWS180200550",
            "dpc": "03034013501",
            "name": "អេង គន្ធា"
        },
        {
            "barcode": "BBWS180200551",
            "dpc": "03034013601",
            "name": "ខាត់ ថេត"
        },
        {
            "barcode": "BBWS180200552",
            "dpc": "03034013701",
            "name": "ទី ចាន់ដារ៉ា"
        },
        {
            "barcode": "BBWS180200553",
            "dpc": "03034013901",
            "name": "ឈឹម សុភ័ណ្ណា"
        },
        {
            "barcode": "BBWS180200554",
            "dpc": "03034014001",
            "name": "ឃី សុផា"
        },
        {
            "barcode": "BBWS180200555",
            "dpc": "03034014101",
            "name": "ឃី សុផល"
        },
        {
            "barcode": "BBWS180200556",
            "dpc": "03034014501",
            "name": "នូ អេងសំរិទ្ធ"
        },
        {
            "barcode": "BBWS180200557",
            "dpc": "03034014601",
            "name": "សុខ អ៊ីម"
        },
        {
            "barcode": "BBWS180200558",
            "dpc": "03034014801",
            "name": "ស៊ីម គឹមណា"
        },
        {
            "barcode": "BBWS180200559",
            "dpc": "03034014901",
            "name": "វង់ នីកា"
        },
        {
            "barcode": "BBWS180200560",
            "dpc": "03034015001",
            "name": "សុខ ធីតា"
        },
        {
            "barcode": "BBWS180200561",
            "dpc": "03034015701",
            "name": "ហង់ លីលី"
        },
        {
            "barcode": "BBWS180200562",
            "dpc": "03034015801",
            "name": "ឯក ពៅ"
        },
        {
            "barcode": "BBWS180200563",
            "dpc": "03034015901",
            "name": "សម្បត្តិ សោភ័ណ្ខ"
        },
        {
            "barcode": "BBWS180200564",
            "dpc": "03034016001",
            "name": "ហ៊ុន គា"
        },
        {
            "barcode": "BBWS180200565",
            "dpc": "03034016101",
            "name": "ម៉េង លី"
        },
        {
            "barcode": "BBWS180200566",
            "dpc": "03034016201",
            "name": "ងិន ម៉ៅ"
        },
        {
            "barcode": "BBWS180200567",
            "dpc": "03034016301",
            "name": "ផុស សុគា"
        },
        {
            "barcode": "BBWS180200568",
            "dpc": "03034016401",
            "name": "រាជ សុវណ្ណារិទ្ធ"
        },
        {
            "barcode": "BBWS180200569",
            "dpc": "03034016501",
            "name": "តាំង ឡាយហ៊ាង"
        },
        {
            "barcode": "BBWS180200570",
            "dpc": "03034016601",
            "name": "ប៉ែន កុលវុធ"
        },
        {
            "barcode": "BBWS180200571",
            "dpc": "03034016701",
            "name": "ឡុង ធារី"
        },
        {
            "barcode": "BBWS180200572",
            "dpc": "03034016801",
            "name": "ជៀវ វុធន"
        },
        {
            "barcode": "BBWS180200573",
            "dpc": "03034016901",
            "name": "ប៊ាន ហុកតេ"
        },
        {
            "barcode": "BBWS180200574",
            "dpc": "03034017001",
            "name": "ខន សោភា"
        },
        {
            "barcode": "BBWS180200575",
            "dpc": "03034017101",
            "name": "សៅ ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180200576",
            "dpc": "03034017301",
            "name": "សេង វណ្ណី"
        },
        {
            "barcode": "BBWS180200577",
            "dpc": "03034017401",
            "name": "អៀ ឈុនលាង"
        },
        {
            "barcode": "BBWS180200578",
            "dpc": "03034017501",
            "name": "ប៊ិន សុផាត"
        },
        {
            "barcode": "BBWS180200579",
            "dpc": "03034017601",
            "name": "សុខ ជា"
        },
        {
            "barcode": "BBWS180200580",
            "dpc": "03034017701",
            "name": "ផែន វេត"
        },
        {
            "barcode": "BBWS180200581",
            "dpc": "03034017801",
            "name": "គី ជុនអេង"
        },
        {
            "barcode": "BBWS180200582",
            "dpc": "03034017901",
            "name": "គឹម សុវឌ្ឍនា"
        },
        {
            "barcode": "BBWS180200583",
            "dpc": "03034018001",
            "name": "ឆាយ បូរ៉ា"
        },
        {
            "barcode": "BBWS180200584",
            "dpc": "03034018101",
            "name": "ឆាន់ ពៅ"
        },
        {
            "barcode": "BBWS180200585",
            "dpc": "03034018201",
            "name": "ឃុន ហេង"
        },
        {
            "barcode": "BBWS180200586",
            "dpc": "03034018301",
            "name": "គក គីម"
        },
        {
            "barcode": "BBWS180200587",
            "dpc": "03034018401",
            "name": "ហុក ចាន់កញ្ញា"
        },
        {
            "barcode": "BBWS180200588",
            "dpc": "03034018501",
            "name": "ឆ អ៊ីង"
        },
        {
            "barcode": "BBWS180200589",
            "dpc": "03034018601",
            "name": "ជា សុជាតិ"
        },
        {
            "barcode": "BBWS180200590",
            "dpc": "03034018701",
            "name": "ញ៉ែម ចាន់ថន"
        },
        {
            "barcode": "BBWS180200591",
            "dpc": "03034018801",
            "name": "វ៉ុង សារ៉ាត់"
        },
        {
            "barcode": "BBWS180200592",
            "dpc": "03034018901",
            "name": "សុខ ងិ"
        },
        {
            "barcode": "BBWS180200593",
            "dpc": "03034019001",
            "name": "ស៊ន ហួត"
        },
        {
            "barcode": "BBWS180200594",
            "dpc": "03034019101",
            "name": "អឿន ព្រំ"
        },
        {
            "barcode": "BBWS180200595",
            "dpc": "03034019201",
            "name": "ចិន សន"
        },
        {
            "barcode": "BBWS180200596",
            "dpc": "03034019301",
            "name": "ឆូ គង់ម៉េង"
        },
        {
            "barcode": "BBWS180200597",
            "dpc": "03034019401",
            "name": "ហេង យាន"
        },
        {
            "barcode": "BBWS180200598",
            "dpc": "03034019501",
            "name": "កៅ សាវិន"
        },
        {
            "barcode": "BBWS180200599",
            "dpc": "03034019601",
            "name": "នួន សុភា"
        },
        {
            "barcode": "BBWS180200600",
            "dpc": "03034019701",
            "name": "ឃុំ សួម"
        },
        {
            "barcode": "BBWS180200601",
            "dpc": "03034019801",
            "name": "ណែម សុខសាន"
        },
        {
            "barcode": "BBWS180200602",
            "dpc": "03034019901",
            "name": "ស៊ុំ សុវណ្ណា"
        },
        {
            "barcode": "BBWS180200603",
            "dpc": "03034020001",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "BBWS180200604",
            "dpc": "03034020101",
            "name": "សឿម សារិទ្ធ"
        },
        {
            "barcode": "BBWS180200605",
            "dpc": "03034020201",
            "name": "ព្រឿង សាវុន"
        },
        {
            "barcode": "BBWS180200606",
            "dpc": "03034020301",
            "name": "មាឃ ស្រូយ"
        },
        {
            "barcode": "BBWS180200607",
            "dpc": "03034020401",
            "name": "សាន សាហ៊ុន"
        },
        {
            "barcode": "BBWS180200608",
            "dpc": "03034020501",
            "name": "ផា ស៊ីណា"
        },
        {
            "barcode": "BBWS180200609",
            "dpc": "03034020601",
            "name": "កេត ផាន"
        },
        {
            "barcode": "BBWS180200610",
            "dpc": "03034020701",
            "name": "មាស នីតា"
        },
        {
            "barcode": "BBWS180200611",
            "dpc": "03034020801",
            "name": "ស្រឹង ប៊ុនសឿន"
        },
        {
            "barcode": "BBWS180200612",
            "dpc": "03034020901",
            "name": "ជុំ ចំណាន"
        },
        {
            "barcode": "BBWS180200613",
            "dpc": "03034021001",
            "name": "រ៉េន ផល្លា"
        },
        {
            "barcode": "BBWS180200614",
            "dpc": "03034021101",
            "name": "ជុន និមល៏"
        },
        {
            "barcode": "BBWS180200615",
            "dpc": "03034021201",
            "name": "សួ ចំរើន"
        },
        {
            "barcode": "BBWS180200616",
            "dpc": "03034021301",
            "name": "លាង​​​ មុំ"
        },
        {
            "barcode": "BBWS180200617",
            "dpc": "03034021401",
            "name": "អៀង សេងលី"
        },
        {
            "barcode": "BBWS180200618",
            "dpc": "03034021501",
            "name": "ហេង ស៊ុនវេង"
        },
        {
            "barcode": "BBWS180200619",
            "dpc": "03034021601",
            "name": "សំ សុខ"
        },
        {
            "barcode": "BBWS180200620",
            "dpc": "03034021701",
            "name": "ញឹម ញ៉ុន"
        },
        {
            "barcode": "BBWS180200621",
            "dpc": "03034021801",
            "name": "ហោ សុខលន់"
        },
        {
            "barcode": "BBWS180200622",
            "dpc": "03034021901",
            "name": "អា ស្រី"
        },
        {
            "barcode": "BBWS180200623",
            "dpc": "03034022001",
            "name": "លី ស៊ីវហួយ"
        },
        {
            "barcode": "BBWS180200624",
            "dpc": "03034022101",
            "name": "ម៉ៅ សំកុល"
        },
        {
            "barcode": "BBWS180200625",
            "dpc": "03034022301",
            "name": "ចាន់ យាត្រា"
        },
        {
            "barcode": "BBWS180200626",
            "dpc": "03034022401",
            "name": "អ៊ុក យឹម"
        },
        {
            "barcode": "BBWS180200627",
            "dpc": "03034022501",
            "name": "កែវ កុសល"
        },
        {
            "barcode": "BBWS180200628",
            "dpc": "03034022601",
            "name": "សេក សាន្ត"
        },
        {
            "barcode": "BBWS180200629",
            "dpc": "03034022901",
            "name": "គង់ លី"
        },
        {
            "barcode": "BBWS180200630",
            "dpc": "03034023001",
            "name": "ប៉ុក ពណ្ណរាយ"
        },
        {
            "barcode": "BBWS180200631",
            "dpc": "03034023201",
            "name": "សៅ កុសល"
        },
        {
            "barcode": "BBWS180200632",
            "dpc": "03034023101",
            "name": "គា សុគន្ធី"
        },
        {
            "barcode": "BBWS180200633",
            "dpc": "03034023301",
            "name": "ផាន់ វ៉ាត់"
        },
        {
            "barcode": "BBWS180200634",
            "dpc": "03034023401",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "BBWS180200635",
            "dpc": "03034023601",
            "name": "ជួន កក្តដា"
        },
        {
            "barcode": "BBWS180200636",
            "dpc": "03034023701",
            "name": "ជួន រីន"
        },
        {
            "barcode": "BBWS180200637",
            "dpc": "03034023801",
            "name": "ជួន វណ្ណា"
        },
        {
            "barcode": "BBWS180200638",
            "dpc": "03034023901",
            "name": "ហ៊ី គឹមលាង"
        },
        {
            "barcode": "BBWS180200639",
            "dpc": "03034024001",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "BBWS180200640",
            "dpc": "03034024101",
            "name": "សួន សុទ្ទស្រីតា"
        },
        {
            "barcode": "BBWS180200641",
            "dpc": "03034024201",
            "name": "ពៅ ថាវតី"
        },
        {
            "barcode": "BBWS180200642",
            "dpc": "03034024301",
            "name": "ចាន់ មករា"
        },
        {
            "barcode": "BBWS180200643",
            "dpc": "03034024401",
            "name": "ចាន់ សុវណ្ណរ័ត្ន"
        },
        {
            "barcode": "BBWS180200644",
            "dpc": "03034024501",
            "name": "លឹម យ៉ុង"
        },
        {
            "barcode": "BBWS180200645",
            "dpc": "03034024601",
            "name": "លាង ដាឡាត់"
        },
        {
            "barcode": "BBWS180200646",
            "dpc": "03034024701",
            "name": "ឈៀង សុផល"
        },
        {
            "barcode": "BBWS180200647",
            "dpc": "03034024801",
            "name": "សាមុត ប៉ិច"
        },
        {
            "barcode": "BBWS180200648",
            "dpc": "03034024901",
            "name": "អ៊ុក ចិន្តា"
        },
        {
            "barcode": "BBWS180200649",
            "dpc": "03034025001",
            "name": "ហែម សំណាង"
        },
        {
            "barcode": "BBWS180200650",
            "dpc": "03034025101",
            "name": "នួន សីលា"
        },
        {
            "barcode": "BBWS180200651",
            "dpc": "03034025201",
            "name": "ហួត ម៉ាន់"
        },
        {
            "barcode": "BBWS180200652",
            "dpc": "03034025301",
            "name": "ម៉ៅ ឈឿន"
        },
        {
            "barcode": "BBWS180200653",
            "dpc": "03034025401",
            "name": "ញឹក សុភ័ណ្ឌ"
        },
        {
            "barcode": "BBWS180200654",
            "dpc": "03034025501",
            "name": "ឡាយ សុខន"
        },
        {
            "barcode": "BBWS180200655",
            "dpc": "03034025601",
            "name": "ឡុង ស៊ីណា"
        },
        {
            "barcode": "BBWS180200656",
            "dpc": "03034025701",
            "name": "ជន ចាន់ស្រី"
        },
        {
            "barcode": "BBWS180200657",
            "dpc": "03034025801",
            "name": "លី សូរិយា"
        },
        {
            "barcode": "BBWS180200658",
            "dpc": "03034025901",
            "name": "ហេង ឆាយលី"
        },
        {
            "barcode": "BBWS180200659",
            "dpc": "03034026001",
            "name": "វត្តដំរីសកុដិលេខ១០"
        },
        {
            "barcode": "BBWS180200660",
            "dpc": "03034026101",
            "name": "ឌុក ឆវុត"
        },
        {
            "barcode": "BBWS180200661",
            "dpc": "03034026201",
            "name": "ញ៉ែម ហឿន"
        },
        {
            "barcode": "BBWS180200662",
            "dpc": "03034026301",
            "name": "សុំ សម្បត្តិ"
        },
        {
            "barcode": "BBWS180200663",
            "dpc": "03034026401",
            "name": "ផល ភោគចំរើន"
        },
        {
            "barcode": "BBWS180200664",
            "dpc": "03034026501",
            "name": "ហ៊ន ណូក"
        },
        {
            "barcode": "BBWS180200665",
            "dpc": "03034026601",
            "name": "វង្ស យកហូ"
        },
        {
            "barcode": "BBWS180200666",
            "dpc": "03034026701",
            "name": "អ៊ុក ខន"
        },
        {
            "barcode": "BBWS180200667",
            "dpc": "03034026801",
            "name": "វែង សារ៉ន"
        },
        {
            "barcode": "BBWS180200668",
            "dpc": "03034026901",
            "name": "ម៉ៅ រតនះ"
        },
        {
            "barcode": "BBWS180200669",
            "dpc": "03034027001",
            "name": "ថេង សំអាត"
        },
        {
            "barcode": "BBWS180200670",
            "dpc": "03034027101",
            "name": "ជា វិសេត"
        },
        {
            "barcode": "BBWS180200671",
            "dpc": "03034027201",
            "name": "ហុក ស្រេច"
        },
        {
            "barcode": "BBWS180200672",
            "dpc": "03034027301",
            "name": "ព្រុំ សារឿត"
        },
        {
            "barcode": "BBWS180200673",
            "dpc": "03034027501",
            "name": "ឈិន ម៉ាលីល"
        },
        {
            "barcode": "BBWS180200674",
            "dpc": "03034027401",
            "name": "អ៊ុក ម៉ាលី"
        },
        {
            "barcode": "BBWS180200675",
            "dpc": "03034027601",
            "name": "យ៉ត សឹម"
        },
        {
            "barcode": "BBWS180200676",
            "dpc": "03034027701",
            "name": "វ៉ាន វុទ្ធី"
        },
        {
            "barcode": "BBWS180200677",
            "dpc": "03034027801",
            "name": "វ៉ាន់ វ៉ាត"
        },
        {
            "barcode": "BBWS180200678",
            "dpc": "03034027901",
            "name": "កង មិញ"
        },
        {
            "barcode": "BBWS180200679",
            "dpc": "03034028001",
            "name": "ស៊ាន ថារិន"
        },
        {
            "barcode": "BBWS180200680",
            "dpc": "03034028101",
            "name": "មួង សុភ័ណ្ខ"
        },
        {
            "barcode": "BBWS180200681",
            "dpc": "03034028201",
            "name": "មឿង រឿន"
        },
        {
            "barcode": "BBWS180200682",
            "dpc": "03034028301",
            "name": "វឿន ទូច"
        },
        {
            "barcode": "BBWS180200683",
            "dpc": "03034028401",
            "name": "ហល់ រួច"
        },
        {
            "barcode": "BBWS180200684",
            "dpc": "03034028501",
            "name": "ឡុង ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180200685",
            "dpc": "03034028601",
            "name": "ឡុង ច្រិប"
        },
        {
            "barcode": "BBWS180200686",
            "dpc": "03034028701",
            "name": "រ៉េង សារឿន"
        },
        {
            "barcode": "BBWS180200687",
            "dpc": "03034028801",
            "name": "ង៉ែត ងឿន"
        },
        {
            "barcode": "BBWS180200688",
            "dpc": "03034028901",
            "name": "ម៉ម ប៉ុន"
        },
        {
            "barcode": "BBWS180200689",
            "dpc": "03034029001",
            "name": "ហង់​ ផល្លា"
        },
        {
            "barcode": "BBWS180200690",
            "dpc": "03034029401",
            "name": "ព្រឿង ជឿម"
        },
        {
            "barcode": "BBWS180200691",
            "dpc": "03034029501",
            "name": "ម៉ៅ រ៉ង់"
        },
        {
            "barcode": "BBWS180200692",
            "dpc": "03034029601",
            "name": "សាំង ប៊ុន ធៀន"
        },
        {
            "barcode": "BBWS180200693",
            "dpc": "03034029801",
            "name": "កែម សារឿន"
        },
        {
            "barcode": "BBWS180200694",
            "dpc": "03034029901",
            "name": "សោម សុភា"
        },
        {
            "barcode": "BBWS180200695",
            "dpc": "03034030001",
            "name": "កែវ ស៊ីណាត"
        },
        {
            "barcode": "BBWS180200696",
            "dpc": "03034030101",
            "name": "ពុំ វណ្ណារត្ន័"
        },
        {
            "barcode": "BBWS180200697",
            "dpc": "03034030201",
            "name": "ទី ឃាវុធ"
        },
        {
            "barcode": "BBWS180200698",
            "dpc": "03034030301",
            "name": "ឯម និល"
        },
        {
            "barcode": "BBWS180200699",
            "dpc": "03034030401",
            "name": "មាស​ វល័ក្ខ"
        },
        {
            "barcode": "BBWS180200700",
            "dpc": "03034031001",
            "name": "លឿង ជ"
        },
        {
            "barcode": "BBWS180200701",
            "dpc": "03034031201",
            "name": "ប៊ូ ឃី"
        },
        {
            "barcode": "BBWS180200702",
            "dpc": "03034031301",
            "name": "ជា សុផល"
        },
        {
            "barcode": "BBWS180200703",
            "dpc": "03034031401",
            "name": "ថេត វណ្ណះ"
        },
        {
            "barcode": "BBWS180200704",
            "dpc": "03034031501",
            "name": "ថេត វណ្ណេត"
        },
        {
            "barcode": "BBWS180200705",
            "dpc": "03034032001",
            "name": "ទូច សែ"
        },
        {
            "barcode": "BBWS180200706",
            "dpc": "03034032101",
            "name": "ខៀវ រិទ្ទី"
        },
        {
            "barcode": "BBWS180200707",
            "dpc": "03034032201",
            "name": "ប៉ាន យូសែ"
        },
        {
            "barcode": "BBWS180200708",
            "dpc": "03034000801",
            "name": "ឆឹង មិន"
        },
        {
            "barcode": "BBWS180200709",
            "dpc": "03034000701",
            "name": "ជិន ពៅ"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
