let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=

    [
        {
            "barcode": "BBWS171148962",
            "dpc": "03044100101",
            "name": "ផុន ផល្លី"
        },
        {
            "barcode": "BBWS171148963",
            "dpc": "03044100201",
            "name": "តេង ឆាវយិន"
        },
        {
            "barcode": "BBWS171148964",
            "dpc": "03044100301",
            "name": "ពេជ្រ វណ្ណី"
        },
        {
            "barcode": "BBWS171148965",
            "dpc": "03044100401",
            "name": "ឡាយ គីមឡុង"
        },
        {
            "barcode": "BBWS171148966",
            "dpc": "03044100501",
            "name": "ទេព​ ចាន់និច"
        },
        {
            "barcode": "BBWS171148967",
            "dpc": "03044100601",
            "name": "តែ វិញរ៉យជ័រ"
        },
        {
            "barcode": "BBWS171148968",
            "dpc": "03044100701",
            "name": "ប៉ោ វណ្ណះ"
        },
        {
            "barcode": "BBWS171148969",
            "dpc": "03044100801",
            "name": "យ៉ាត សីហា"
        },
        {
            "barcode": "BBWS171148970",
            "dpc": "03044100901",
            "name": "ញាណ ជី"
        },
        {
            "barcode": "BBWS171148971",
            "dpc": "03044101001",
            "name": "ប៊ូ ពៅ"
        },
        {
            "barcode": "BBWS171148972",
            "dpc": "03044101101",
            "name": "អឿ ហាន"
        },
        {
            "barcode": "BBWS171148973",
            "dpc": "03044101201",
            "name": "ម៉េ ស៊ីហាស"
        },
        {
            "barcode": "BBWS171148974",
            "dpc": "03044101301",
            "name": "យីត រ៉ហ្វីឡះ"
        },
        {
            "barcode": "BBWS171148975",
            "dpc": "03044101501",
            "name": "ឡាង  សៀក"
        },
        {
            "barcode": "BBWS171148976",
            "dpc": "03044101801",
            "name": "ជិម រៀន"
        },
        {
            "barcode": "BBWS171148977",
            "dpc": "03044101901",
            "name": "តន់ សារ៉ត"
        },
        {
            "barcode": "BBWS171148978",
            "dpc": "03044102101",
            "name": "សារី សេត"
        },
        {
            "barcode": "BBWS171148979",
            "dpc": "03044102201",
            "name": "ឡាន ប៊ូន២"
        },
        {
            "barcode": "BBWS171148980",
            "dpc": "03044102301",
            "name": "ឆៀម បារាំង"
        },
        {
            "barcode": "BBWS171148981",
            "dpc": "03044102401",
            "name": "ឡាន ប៊ុនសឹន"
        },
        {
            "barcode": "BBWS171148982",
            "dpc": "03044102501",
            "name": "ឡុក ចិត្ត"
        },
        {
            "barcode": "BBWS171148983",
            "dpc": "03044102601",
            "name": "វ៉ាន់ ឌី"
        },
        {
            "barcode": "BBWS171148984",
            "dpc": "03044102801",
            "name": "ញឹក ធា"
        },
        {
            "barcode": "BBWS171148985",
            "dpc": "03044103001",
            "name": "យិន យ៉ុន"
        },
        {
            "barcode": "BBWS171148986",
            "dpc": "03044103101",
            "name": "ហ៊ីម ស៊ីថុន"
        },
        {
            "barcode": "BBWS171148987",
            "dpc": "03044103301",
            "name": "ម៉ាន ម៉ាត់ស៊ូណៃ"
        },
        {
            "barcode": "BBWS171148988",
            "dpc": "03044103401",
            "name": "វិន ណុះ"
        },
        {
            "barcode": "BBWS171148989",
            "dpc": "03044103501",
            "name": "អ៊ុន សុជាតិ"
        },
        {
            "barcode": "BBWS171148990",
            "dpc": "03044103601",
            "name": "យេត ស៊ុនគីហ្ចាលី"
        },
        {
            "barcode": "BBWS171148991",
            "dpc": "03044103701",
            "name": "ទិន ស្ម័នអ័ល"
        },
        {
            "barcode": "BBWS171148992",
            "dpc": "03044103801",
            "name": "រួន សាន"
        },
        {
            "barcode": "BBWS171148993",
            "dpc": "03044103901",
            "name": "ឡាន់ យូសុះ"
        },
        {
            "barcode": "BBWS171148994",
            "dpc": "03044104101",
            "name": "សិទ្ធ វាសនា"
        },
        {
            "barcode": "BBWS171148995",
            "dpc": "03044104201",
            "name": "ទុយ ប៊ុនហៀង"
        },
        {
            "barcode": "BBWS171148996",
            "dpc": "03044104301",
            "name": "គិត ដាវិត"
        },
        {
            "barcode": "BBWS171148997",
            "dpc": "03044104401",
            "name": "ពៅ ដាលីយ៉ា"
        },
        {
            "barcode": "BBWS171148998",
            "dpc": "03044104501",
            "name": "នី វណ្ណៈ"
        },
        {
            "barcode": "BBWS171148999",
            "dpc": "03044104601",
            "name": "គុំ សុខុម ១"
        },
        {
            "barcode": "BBWS171149000",
            "dpc": "03044104701",
            "name": "គុំ សុខុម ២"
        },
        {
            "barcode": "BBWS171149001",
            "dpc": "03044104801",
            "name": "គុំ សុខុម ៣"
        },
        {
            "barcode": "BBWS171149002",
            "dpc": "03044104901",
            "name": "ម៉ា ឌិម"
        },
        {
            "barcode": "BBWS171149003",
            "dpc": "03044105001",
            "name": "ស៊យ សាក់ឡូ"
        },
        {
            "barcode": "BBWS171149004",
            "dpc": "03044105101",
            "name": "គុជ នាង"
        },
        {
            "barcode": "BBWS171149005",
            "dpc": "03044105201",
            "name": "កេតុ ម៉ានី"
        },
        {
            "barcode": "BBWS171149006",
            "dpc": "03044105301",
            "name": "ពិន សិរីវិន"
        },
        {
            "barcode": "BBWS171149007",
            "dpc": "03044105401",
            "name": "លឹម ស៊ុយសុវត្ថិ"
        },
        {
            "barcode": "BBWS171149008",
            "dpc": "03044105501",
            "name": "ហេង ចន្ថា"
        },
        {
            "barcode": "BBWS171149009",
            "dpc": "03044105601",
            "name": "យ៉ាន ហ៊ម"
        },
        {
            "barcode": "BBWS171149010",
            "dpc": "03044105701",
            "name": "ញាញ ប៊ុនឆប"
        },
        {
            "barcode": "BBWS171149011",
            "dpc": "03044105801",
            "name": "សុទ្ធ ថា"
        },
        {
            "barcode": "BBWS171149012",
            "dpc": "03044105901",
            "name": "ឡិប អារ៉ាហ្សាត"
        },
        {
            "barcode": "BBWS171149013",
            "dpc": "03044106001",
            "name": "ដឹក អាត"
        },
        {
            "barcode": "BBWS171149014",
            "dpc": "03044106101",
            "name": "សែន តារ៉ា"
        },
        {
            "barcode": "BBWS171149015",
            "dpc": "03044106201",
            "name": "សុះ ហាស់លី"
        },
        {
            "barcode": "BBWS171149016",
            "dpc": "03044106301",
            "name": "សូ សុះរ៉ាសេត"
        },
        {
            "barcode": "BBWS171149017",
            "dpc": "03044106401",
            "name": "កង ភាព"
        },
        {
            "barcode": "BBWS171149018",
            "dpc": "03044106501",
            "name": "បួន ស៊ីណាត"
        },
        {
            "barcode": "BBWS171149019",
            "dpc": "03044106601",
            "name": "ម៉ាត់ ហ៊ុលគីភ្លី"
        },
        {
            "barcode": "BBWS171149020",
            "dpc": "03044106701",
            "name": "រ៉ុម ម៉ាឡាស់"
        },
        {
            "barcode": "BBWS171149021",
            "dpc": "03044106801",
            "name": "វ៉ន ជឿម"
        },
        {
            "barcode": "BBWS171149022",
            "dpc": "03044106901",
            "name": "ដេន ណាត"
        },
        {
            "barcode": "BBWS171149023",
            "dpc": "03044107001",
            "name": "រិទ្ធ រ៉ានី"
        },
        {
            "barcode": "BBWS171149024",
            "dpc": "03044107201",
            "name": "ប៉ង់ សុវណ្ណដានី"
        },
        {
            "barcode": "BBWS171149025",
            "dpc": "03044107301",
            "name": "ផាត់ សិលា"
        },
        {
            "barcode": "BBWS171149026",
            "dpc": "03044107401",
            "name": "ប្រង់ វល័ក្ខ"
        },
        {
            "barcode": "BBWS171149027",
            "dpc": "03044107501",
            "name": "វង្ស ស៊ីណុល"
        },
        {
            "barcode": "BBWS171149028",
            "dpc": "03044107601",
            "name": "សាន ហ៊ិន"
        },
        {
            "barcode": "BBWS171149029",
            "dpc": "03044107701",
            "name": "អ៊ុក ឆវ័ន្ត"
        },
        {
            "barcode": "BBWS171149030",
            "dpc": "03044107801",
            "name": "ហុក ចំរើន"
        },
        {
            "barcode": "BBWS171149031",
            "dpc": "03044107901",
            "name": "សែម ពឿន"
        },
        {
            "barcode": "BBWS171149032",
            "dpc": "03044108001",
            "name": "គឹម ឡេង"
        },
        {
            "barcode": "BBWS171149033",
            "dpc": "03044108101",
            "name": "ជួង ណារ៉ែន"
        },
        {
            "barcode": "BBWS171149034",
            "dpc": "03044108201",
            "name": "ជៀម ដា"
        },
        {
            "barcode": "BBWS171149035",
            "dpc": "03044108301",
            "name": "មូ ល្លិកា"
        },
        {
            "barcode": "BBWS171149036",
            "dpc": "03044108401",
            "name": "ស៊ិម សារឿន"
        },
        {
            "barcode": "BBWS171149037",
            "dpc": "03044108501",
            "name": "ធឿត សាលឿន"
        },
        {
            "barcode": "BBWS171149038",
            "dpc": "03044108601",
            "name": "ម៉ៅ ភារម្យ"
        },
        {
            "barcode": "BBWS171149039",
            "dpc": "03044108701",
            "name": "សាំង សុផាត"
        },
        {
            "barcode": "BBWS171149040",
            "dpc": "03044108801",
            "name": "សុខ ប៊ុនុយឹម"
        },
        {
            "barcode": "BBWS171149041",
            "dpc": "03044109001",
            "name": "សន សៅ"
        },
        {
            "barcode": "BBWS171149042",
            "dpc": "03044109101",
            "name": "ច័ន្ទ ហ៊ាញ"
        },
        {
            "barcode": "BBWS171149043",
            "dpc": "03044109201",
            "name": "បាន ឃន"
        },
        {
            "barcode": "BBWS171149044",
            "dpc": "03044109301",
            "name": "ប៊ូ បូ"
        },
        {
            "barcode": "BBWS171149045",
            "dpc": "03044109401",
            "name": "ប៊ូ ភាន"
        },
        {
            "barcode": "BBWS171149046",
            "dpc": "03044109501",
            "name": "នី លីដា"
        },
        {
            "barcode": "BBWS171149047",
            "dpc": "03044109601",
            "name": "កែវ រ៉ិច"
        },
        {
            "barcode": "BBWS171149048",
            "dpc": "03044109701",
            "name": "អៀង អិដ្ឋ"
        },
        {
            "barcode": "BBWS171149049",
            "dpc": "03044109901",
            "name": "លឹម គឹមស៊ីម"
        },
        {
            "barcode": "BBWS171149050",
            "dpc": "03044110001",
            "name": "លឹម សុលីនដា"
        },
        {
            "barcode": "BBWS171149051",
            "dpc": "03044110101",
            "name": "ហម វាសនា"
        },
        {
            "barcode": "BBWS171149052",
            "dpc": "03044110301",
            "name": "ហ៊ាង លីណា"
        },
        {
            "barcode": "BBWS171149053",
            "dpc": "03044110401",
            "name": "សឿ ណន"
        },
        {
            "barcode": "BBWS171149054",
            "dpc": "03044110501",
            "name": "គង់ ម៉េង"
        },
        {
            "barcode": "BBWS171149055",
            "dpc": "03044110701",
            "name": "ជា ប៉ូច"
        },
        {
            "barcode": "BBWS171149056",
            "dpc": "03044110801",
            "name": "ហ៊ុល ស៊ីម"
        },
        {
            "barcode": "BBWS171149057",
            "dpc": "03044110901",
            "name": "ប៊ួ សៅ"
        },
        {
            "barcode": "BBWS171149058",
            "dpc": "03044111001",
            "name": "ប៊ួ តឿ"
        },
        {
            "barcode": "BBWS171149059",
            "dpc": "03044111101",
            "name": "សៅ រ៉េន"
        },
        {
            "barcode": "BBWS171149060",
            "dpc": "03044111201",
            "name": "បួ វ៉ើន"
        },
        {
            "barcode": "BBWS171149061",
            "dpc": "03044111301",
            "name": "កែវ យី"
        },
        {
            "barcode": "BBWS171149062",
            "dpc": "03044111401",
            "name": "ឈឿប ប៉ុច"
        },
        {
            "barcode": "BBWS171149063",
            "dpc": "03044111501",
            "name": "ធុច បូណា"
        },
        {
            "barcode": "BBWS171149064",
            "dpc": "03044111601",
            "name": "ប្រាក់ ចំរឿន"
        },
        {
            "barcode": "BBWS171149065",
            "dpc": "03044111701",
            "name": "មាស រតនៈ"
        },
        {
            "barcode": "BBWS171149066",
            "dpc": "03044111801",
            "name": "ប៉ិច ផាត"
        },
        {
            "barcode": "BBWS171149067",
            "dpc": "03044111901",
            "name": "ប៉ិច ឈឿត"
        },
        {
            "barcode": "BBWS171149068",
            "dpc": "03044112001",
            "name": "សុខ សារ៉ន"
        },
        {
            "barcode": "BBWS171149069",
            "dpc": "03044112101",
            "name": "ចាន់ សុគុណ"
        },
        {
            "barcode": "BBWS171149070",
            "dpc": "03044112401",
            "name": "មុំ អ៊ួន"
        },
        {
            "barcode": "BBWS171149071",
            "dpc": "03044112501",
            "name": "ហ៊ុល សុខហេង"
        },
        {
            "barcode": "BBWS171149072",
            "dpc": "03044112601",
            "name": "ប៊ុត ប៊ុនថា"
        },
        {
            "barcode": "BBWS171149073",
            "dpc": "03044112701",
            "name": "តាម វ៉ៃ ២"
        },
        {
            "barcode": "BBWS171149074",
            "dpc": "03044112801",
            "name": "ទង់ ស៊ីម"
        },
        {
            "barcode": "BBWS171149075",
            "dpc": "03044112901",
            "name": "ទេព មិន"
        },
        {
            "barcode": "BBWS171149076",
            "dpc": "03044113001",
            "name": "ភិន សោភ័ណ្ឌ"
        },
        {
            "barcode": "BBWS171149077",
            "dpc": "03044113101",
            "name": "លាង ស៊ីថារ៉ាត់"
        },
        {
            "barcode": "BBWS171149078",
            "dpc": "03044113201",
            "name": "ម៉ុត ម៉ាន់"
        },
        {
            "barcode": "BBWS171149079",
            "dpc": "03044113301",
            "name": "ហាក់ សុផល"
        },
        {
            "barcode": "BBWS171149080",
            "dpc": "03044113401",
            "name": "នួន ភារម្យ"
        },
        {
            "barcode": "BBWS171149081",
            "dpc": "03044113501",
            "name": "សាត សាមិន"
        },
        {
            "barcode": "BBWS171149082",
            "dpc": "03044113601",
            "name": "ណោ សុខុម"
        },
        {
            "barcode": "BBWS171149083",
            "dpc": "03044113901",
            "name": "វង្ស ឆេង"
        },
        {
            "barcode": "BBWS171149084",
            "dpc": "03044114001",
            "name": "ណោ សុំអ៊ុន"
        },
        {
            "barcode": "BBWS171149085",
            "dpc": "03044114101",
            "name": "យៀង ចាន់វិរៈ"
        },
        {
            "barcode": "BBWS171149086",
            "dpc": "03044114201",
            "name": "ឃិប ឌី"
        },
        {
            "barcode": "BBWS171149087",
            "dpc": "03044114301",
            "name": "អ៊ុន ណារ៉េត"
        },
        {
            "barcode": "BBWS171149088",
            "dpc": "03044114401",
            "name": "ជួត សឿន"
        },
        {
            "barcode": "BBWS171149089",
            "dpc": "03044114501",
            "name": "ស៊ូ បិន"
        },
        {
            "barcode": "BBWS171149090",
            "dpc": "03044114601",
            "name": "អ៊ី រិន"
        },
        {
            "barcode": "BBWS171149091",
            "dpc": "03044114701",
            "name": "សុខ គឹមសួរ"
        },
        {
            "barcode": "BBWS171149092",
            "dpc": "03044114801",
            "name": "អ៊ុយ ចាន់ថន"
        },
        {
            "barcode": "BBWS171149093",
            "dpc": "03044114901",
            "name": "ទឺ ទាវី"
        },
        {
            "barcode": "BBWS171149094",
            "dpc": "03044115001",
            "name": "សួន ណារិន"
        },
        {
            "barcode": "BBWS171149095",
            "dpc": "03044115101",
            "name": "កែវ ពិន"
        },
        {
            "barcode": "BBWS171149096",
            "dpc": "03044115201",
            "name": "ព្រឹម សាលី"
        },
        {
            "barcode": "BBWS171149097",
            "dpc": "03044115301",
            "name": "ង៉ាម នងរដ្ឋា"
        },
        {
            "barcode": "BBWS171149098",
            "dpc": "03044115401",
            "name": "ញឹម ច្រៀប២"
        },
        {
            "barcode": "BBWS171149099",
            "dpc": "03044115501",
            "name": "ថាប់ ប៊ុនលឿ"
        },
        {
            "barcode": "BBWS171149100",
            "dpc": "03044115601",
            "name": "ម៉ាត់ ចំរើន"
        },
        {
            "barcode": "BBWS171149101",
            "dpc": "03044115701",
            "name": "សិម សេន"
        },
        {
            "barcode": "BBWS171149102",
            "dpc": "03044115801",
            "name": "វ៉ន ស្លាម៉ាស់"
        },
        {
            "barcode": "BBWS171149103",
            "dpc": "03044115901",
            "name": "ទិន វ៉ាន់នី់"
        },
        {
            "barcode": "BBWS171149104",
            "dpc": "03044116001",
            "name": "ឃួន ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS171149105",
            "dpc": "03044116101",
            "name": "កែ មឿន"
        },
        {
            "barcode": "BBWS171149106",
            "dpc": "03044116201",
            "name": "សឿង សាវី"
        },
        {
            "barcode": "BBWS171149107",
            "dpc": "03044116301",
            "name": "វត្តកំពង់សីម៉ា"
        },
        {
            "barcode": "BBWS171149108",
            "dpc": "03044116401",
            "name": "ជី វុត"
        },
        {
            "barcode": "BBWS171149109",
            "dpc": "03044116501",
            "name": "ឡឥដ្ឋអង់"
        },
        {
            "barcode": "BBWS171149110",
            "dpc": "03044116601",
            "name": "បែន ផាត"
        },
        {
            "barcode": "BBWS171149111",
            "dpc": "03044116701",
            "name": "កូវ សុឃឿន"
        },
        {
            "barcode": "BBWS171149112",
            "dpc": "03044116801",
            "name": "អ៊ែម សុភ័ក្ត្រ"
        },
        {
            "barcode": "BBWS171149113",
            "dpc": "03044116901",
            "name": "ម៉ាត់ កើ"
        },
        {
            "barcode": "BBWS171149114",
            "dpc": "03044117101",
            "name": "ម៉ាត់ លី"
        },
        {
            "barcode": "BBWS171149115",
            "dpc": "03044117201",
            "name": "រេះ សៀត"
        },
        {
            "barcode": "BBWS171149116",
            "dpc": "03044117301",
            "name": "លុន អ៊ាន"
        },
        {
            "barcode": "BBWS171149117",
            "dpc": "03044117501",
            "name": "ឡាត់ រស្មី"
        },
        {
            "barcode": "BBWS171149118",
            "dpc": "03044117601",
            "name": "អិត សំបូ២"
        },
        {
            "barcode": "BBWS171149119",
            "dpc": "03044117701",
            "name": "រស់ គឹមសុខា"
        },
        {
            "barcode": "BBWS171149120",
            "dpc": "03044117801",
            "name": "អ៊ុល ចំរើន"
        },
        {
            "barcode": "BBWS171149121",
            "dpc": "03044117901",
            "name": "ប៉ាន់ សុភ័ក្ត្រ"
        },
        {
            "barcode": "BBWS171149122",
            "dpc": "03044118001",
            "name": "លន់ វីរះ"
        },
        {
            "barcode": "BBWS171149123",
            "dpc": "03044118101",
            "name": "ទី រិឌ្ឍី"
        },
        {
            "barcode": "BBWS171149124",
            "dpc": "03044118201",
            "name": "អ៊ូច សុភាន"
        },
        {
            "barcode": "BBWS171149125",
            "dpc": "03044118301",
            "name": "ម៉ៅ សុខឡៃ"
        },
        {
            "barcode": "BBWS171149126",
            "dpc": "03044118401",
            "name": "ផាត ស្រីរដ្ឋ"
        },
        {
            "barcode": "BBWS171149127",
            "dpc": "03044118501",
            "name": "ម៉ាស់ បញ្ញាវុត"
        },
        {
            "barcode": "BBWS171149128",
            "dpc": "03044118601",
            "name": "តែ សុវណ្ណរ៊ត្ន"
        },
        {
            "barcode": "BBWS171149129",
            "dpc": "03044118701",
            "name": "ទុំ សុខាន"
        },
        {
            "barcode": "BBWS171149130",
            "dpc": "03044118801",
            "name": "កាង វណ្ណៈ"
        },
        {
            "barcode": "BBWS171149131",
            "dpc": "03044118901",
            "name": "លួម ផាន"
        },
        {
            "barcode": "BBWS171149132",
            "dpc": "03044119001",
            "name": "លួម សុជាតិ"
        },
        {
            "barcode": "BBWS171149133",
            "dpc": "03044119101",
            "name": "រ៉េះ ហាយឹត"
        },
        {
            "barcode": "BBWS171149134",
            "dpc": "03044119201",
            "name": "លី ម៉ា"
        },
        {
            "barcode": "BBWS171149135",
            "dpc": "03044119301",
            "name": "ពៅ ម៉ាលី"
        },
        {
            "barcode": "BBWS171149136",
            "dpc": "03044119401",
            "name": "យ៉ាត យឿត"
        },
        {
            "barcode": "BBWS171149137",
            "dpc": "03044119501",
            "name": "រ៉ាត់ ចំរើន"
        },
        {
            "barcode": "BBWS171149138",
            "dpc": "03044119601",
            "name": "លៀម មាល"
        },
        {
            "barcode": "BBWS171149139",
            "dpc": "03044119701",
            "name": "ថូ ប៊ុនរ៉េត"
        },
        {
            "barcode": "BBWS171149140",
            "dpc": "03044119801",
            "name": "ផា សំផេន១"
        },
        {
            "barcode": "BBWS171149141",
            "dpc": "03044119901",
            "name": "ផា សំផេន២"
        },
        {
            "barcode": "BBWS171149142",
            "dpc": "03044120001",
            "name": "ផា សំផេន៣"
        },
        {
            "barcode": "BBWS171149143",
            "dpc": "03044120101",
            "name": "គ្រី ប្រានី"
        },
        {
            "barcode": "BBWS171149144",
            "dpc": "03044120301",
            "name": "ឈីវ វាន់នី"
        },
        {
            "barcode": "BBWS171149145",
            "dpc": "03044120401",
            "name": "ហាស់ សុខគ្រី"
        },
        {
            "barcode": "BBWS171149146",
            "dpc": "03044120601",
            "name": "ថាប់ ឡាំង"
        },
        {
            "barcode": "BBWS171149147",
            "dpc": "03044120701",
            "name": "ឯល នាង"
        },
        {
            "barcode": "BBWS171149148",
            "dpc": "03044120801",
            "name": "នី ណុះ"
        },
        {
            "barcode": "BBWS171149149",
            "dpc": "03044120901",
            "name": "ជាង សុភា"
        },
        {
            "barcode": "BBWS171149150",
            "dpc": "03044121101",
            "name": "បេ សុគន្ឋារី"
        },
        {
            "barcode": "BBWS171149151",
            "dpc": "03044121201",
            "name": "ហុង តូមា"
        },
        {
            "barcode": "BBWS171149152",
            "dpc": "03044121301",
            "name": "សួស រ៉ាម៉ូ"
        },
        {
            "barcode": "BBWS171149153",
            "dpc": "03044121401",
            "name": "នួន គឹមសេង"
        },
        {
            "barcode": "BBWS171149154",
            "dpc": "03044121501",
            "name": "ចិត តុង"
        },
        {
            "barcode": "BBWS171149155",
            "dpc": "03044121601",
            "name": "មណ្ឌលសុខភាព"
        },
        {
            "barcode": "BBWS171149156",
            "dpc": "03044121701",
            "name": "កុយ សុម៉ាលី"
        },
        {
            "barcode": "BBWS171149157",
            "dpc": "03044121801",
            "name": "សាលារៀនកំពង់សីម៉ា"
        },
        {
            "barcode": "BBWS171149158",
            "dpc": "03044121901",
            "name": "ជ៊យ និរោធ"
        },
        {
            "barcode": "BBWS171149159",
            "dpc": "03044122001",
            "name": "ទូច សុខុម"
        },
        {
            "barcode": "BBWS171149160",
            "dpc": "03044122101",
            "name": "ផែ ណាំជិវ"
        },
        {
            "barcode": "BBWS171149161",
            "dpc": "03044122201",
            "name": "អ្នកគ្រូណារី"
        },
        {
            "barcode": "BBWS171149162",
            "dpc": "03044122301",
            "name": "មាស សុផល"
        },
        {
            "barcode": "BBWS171149163",
            "dpc": "03044122401",
            "name": "ញូង ស្រស់"
        },
        {
            "barcode": "BBWS171149164",
            "dpc": "03044122501",
            "name": "ស៊ិន កុសល"
        },
        {
            "barcode": "BBWS171149165",
            "dpc": "03044122601",
            "name": "ទៀង បូរ៉ា"
        },
        {
            "barcode": "BBWS171149166",
            "dpc": "03044122701",
            "name": "ឡោះ ថា"
        },
        {
            "barcode": "BBWS171149167",
            "dpc": "03044122801",
            "name": "យួម ទូច"
        },
        {
            "barcode": "BBWS171149168",
            "dpc": "03044122901",
            "name": "អ៊ុយ សុផាន"
        },
        {
            "barcode": "BBWS171149169",
            "dpc": "03044123001",
            "name": "ប៊ុន គង់"
        },
        {
            "barcode": "BBWS171149170",
            "dpc": "03044123101",
            "name": "ស៊ត គឹមប្រុស"
        },
        {
            "barcode": "BBWS171149171",
            "dpc": "03044123201",
            "name": "ឡាស៊ី អ៊ុំ"
        },
        {
            "barcode": "BBWS171149172",
            "dpc": "03044123301",
            "name": "ផៃ សុផាត"
        },
        {
            "barcode": "BBWS171149173",
            "dpc": "03044123401",
            "name": "មាស សារួន"
        },
        {
            "barcode": "BBWS171149174",
            "dpc": "03044123501",
            "name": "គង់ សិលា"
        },
        {
            "barcode": "BBWS171149175",
            "dpc": "03044123601",
            "name": "អឿន ឈឹន"
        },
        {
            "barcode": "BBWS171149176",
            "dpc": "03044123701",
            "name": "លេង មែន"
        },
        {
            "barcode": "BBWS171149177",
            "dpc": "03044123801",
            "name": "នឿប ឬទ្ឋី"
        },
        {
            "barcode": "BBWS171149178",
            "dpc": "03044123901",
            "name": "នួន សុវណ្ណ"
        },
        {
            "barcode": "BBWS171149179",
            "dpc": "03044124001",
            "name": "ប៉ក សុផល"
        },
        {
            "barcode": "BBWS171149180",
            "dpc": "03044124101",
            "name": "ផាត ភឿត"
        },
        {
            "barcode": "BBWS171149181",
            "dpc": "03044124201",
            "name": "ផុន សានឿត"
        },
        {
            "barcode": "BBWS171149182",
            "dpc": "03044124301",
            "name": "ផុន សំភឿត"
        },
        {
            "barcode": "BBWS171149183",
            "dpc": "03044124401",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "BBWS171149184",
            "dpc": "03044124601",
            "name": "រិទ្ឋ សុផល"
        },
        {
            "barcode": "BBWS171149185",
            "dpc": "03044124701",
            "name": "ស្រែ កុសល់"
        },
        {
            "barcode": "BBWS171149186",
            "dpc": "03044124801",
            "name": "រៀម ឌុង"
        },
        {
            "barcode": "BBWS171149187",
            "dpc": "03044124901",
            "name": "ប្រាក់ សុខេន"
        },
        {
            "barcode": "BBWS171149188",
            "dpc": "03044125001",
            "name": "ឆុយ ធឿន"
        },
        {
            "barcode": "BBWS171149189",
            "dpc": "03044125101",
            "name": "សរ សារិទ្ឋ"
        },
        {
            "barcode": "BBWS171149190",
            "dpc": "03044125201",
            "name": "សោម សុវណ្ណ"
        },
        {
            "barcode": "BBWS171149191",
            "dpc": "03044125301",
            "name": "ឈិន ឆឹន"
        },
        {
            "barcode": "BBWS171149192",
            "dpc": "03044125401",
            "name": "ឆាយ ឆុំ"
        },
        {
            "barcode": "BBWS171149193",
            "dpc": "03044125501",
            "name": "កី ឆាយសេង"
        },
        {
            "barcode": "BBWS171149194",
            "dpc": "03044125601",
            "name": "អ៊ុន សាវី"
        },
        {
            "barcode": "BBWS171149195",
            "dpc": "03044125801",
            "name": "សំ ប៉ាន់ ឌីណា"
        },
        {
            "barcode": "BBWS171149196",
            "dpc": "03044125901",
            "name": "លន ហ្សីឌី"
        },
        {
            "barcode": "BBWS171149197",
            "dpc": "03044126001",
            "name": "ជួន ហ៊ី"
        },
        {
            "barcode": "BBWS171149198",
            "dpc": "03044126201",
            "name": "កា គឺមឡែន"
        },
        {
            "barcode": "BBWS171149199",
            "dpc": "03044126301",
            "name": "កា ឃីន"
        },
        {
            "barcode": "BBWS171149200",
            "dpc": "03044126401",
            "name": "កា ចាន់ធី"
        },
        {
            "barcode": "BBWS171149201",
            "dpc": "03044126501",
            "name": "កឹម ឆែម"
        },
        {
            "barcode": "BBWS171149202",
            "dpc": "03044126601",
            "name": "ជា ច័ន្ទស្ធារ៉ាត់"
        },
        {
            "barcode": "BBWS171149203",
            "dpc": "03044126701",
            "name": "ហេង វិច្ឆ័យ"
        },
        {
            "barcode": "BBWS171149204",
            "dpc": "03044126801",
            "name": "សន សោម"
        },
        {
            "barcode": "BBWS171149205",
            "dpc": "03044126901",
            "name": "សួន ណារ៉ុង"
        },
        {
            "barcode": "BBWS171149206",
            "dpc": "03044127001",
            "name": "សឿន ចន្ថា"
        },
        {
            "barcode": "BBWS171149207",
            "dpc": "03044127101",
            "name": "គូយ កឿន"
        },
        {
            "barcode": "BBWS171149208",
            "dpc": "03044127201",
            "name": "ឃុន ឃួន"
        },
        {
            "barcode": "BBWS171149209",
            "dpc": "03044127301",
            "name": "មឿត គន្ឋា"
        },
        {
            "barcode": "BBWS171149210",
            "dpc": "03044127401",
            "name": "ភិន ផុន"
        },
        {
            "barcode": "BBWS171149211",
            "dpc": "03044127501",
            "name": "មេត ប៊ុនថន"
        },
        {
            "barcode": "BBWS171149212",
            "dpc": "03044127601",
            "name": "មេត កុសល់"
        },
        {
            "barcode": "BBWS171149213",
            "dpc": "03044127701",
            "name": "ណុប សុង"
        },
        {
            "barcode": "BBWS171149214",
            "dpc": "03044127801",
            "name": "ថោង សុឃឿត"
        },
        {
            "barcode": "BBWS171149215",
            "dpc": "03044127901",
            "name": "មឿន មឿត"
        },
        {
            "barcode": "BBWS171149216",
            "dpc": "03044128001",
            "name": "ហម ប៊ុនឃឿត"
        },
        {
            "barcode": "BBWS171149217",
            "dpc": "03044128101",
            "name": "កា សំបុក"
        },
        {
            "barcode": "BBWS171149218",
            "dpc": "03044128201",
            "name": "សូ មៀង"
        },
        {
            "barcode": "BBWS171149219",
            "dpc": "03044128301",
            "name": "ស្រុន សុវណ្ណា"
        },
        {
            "barcode": "BBWS171149220",
            "dpc": "03044128401",
            "name": "សួង ចាន់នី"
        },
        {
            "barcode": "BBWS171149221",
            "dpc": "03044128501",
            "name": "អ៊ុយ វណ្ណរី"
        },
        {
            "barcode": "BBWS171149222",
            "dpc": "03044128601",
            "name": "ពិន ឆែម"
        },
        {
            "barcode": "BBWS171149223",
            "dpc": "03044128701",
            "name": "ហិន យុន"
        },
        {
            "barcode": "BBWS171149224",
            "dpc": "03044128801",
            "name": "ជួង សារិន"
        },
        {
            "barcode": "BBWS171149225",
            "dpc": "03044129001",
            "name": "វេង សុង"
        },
        {
            "barcode": "BBWS171149226",
            "dpc": "03044129101",
            "name": "ឆាំ សុង"
        },
        {
            "barcode": "BBWS171149227",
            "dpc": "03044129201",
            "name": "ភិម សុផា"
        },
        {
            "barcode": "BBWS171149228",
            "dpc": "03044129301",
            "name": "ឈុំ ថន"
        },
        {
            "barcode": "BBWS171149229",
            "dpc": "03044129401",
            "name": "ស៊ ចាន់នី"
        },
        {
            "barcode": "BBWS171149230",
            "dpc": "03044129501",
            "name": "រ៉ិត ឈៀត"
        },
        {
            "barcode": "BBWS171149231",
            "dpc": "03044129601",
            "name": "រួត ញង"
        },
        {
            "barcode": "BBWS171149232",
            "dpc": "03044129701",
            "name": "តឿ លីន"
        },
        {
            "barcode": "BBWS171149233",
            "dpc": "03044129801",
            "name": "ហ៊ន ហុន"
        },
        {
            "barcode": "BBWS171149234",
            "dpc": "03044129901",
            "name": "រួម ភឿត"
        },
        {
            "barcode": "BBWS171149235",
            "dpc": "03044130001",
            "name": "សន រួន"
        },
        {
            "barcode": "BBWS171149236",
            "dpc": "03044130101",
            "name": "រឿន សារេត"
        },
        {
            "barcode": "BBWS171149237",
            "dpc": "03044130201",
            "name": "ម៉ប់ សាមេត"
        },
        {
            "barcode": "BBWS171149238",
            "dpc": "03044130301",
            "name": "ហួ ចាន់យ៉ា"
        },
        {
            "barcode": "BBWS171149239",
            "dpc": "03044130401",
            "name": "ឆឹង សុវិន"
        },
        {
            "barcode": "BBWS171149240",
            "dpc": "03044130501",
            "name": "ឆឹង ចិន្តា"
        },
        {
            "barcode": "BBWS171149241",
            "dpc": "03044130601",
            "name": "ង៉ាម សុន"
        },
        {
            "barcode": "BBWS171149242",
            "dpc": "03044130701",
            "name": "សឿន វណ្ណី"
        },
        {
            "barcode": "BBWS171149243",
            "dpc": "03044130801",
            "name": "សោ ទី"
        },
        {
            "barcode": "BBWS171149244",
            "dpc": "03044130901",
            "name": "លុយ សាលី"
        },
        {
            "barcode": "BBWS171149245",
            "dpc": "03044131001",
            "name": "ឆឹង ម៉ារ៉ាឌី"
        },
        {
            "barcode": "BBWS171149246",
            "dpc": "03044131101",
            "name": "លុយ អ៊ិន"
        },
        {
            "barcode": "BBWS171149247",
            "dpc": "03044131201",
            "name": "ឬទ្ឋី"
        },
        {
            "barcode": "BBWS171149248",
            "dpc": "03044131301",
            "name": "អឿន រឿប"
        },
        {
            "barcode": "BBWS171149249",
            "dpc": "03044131401",
            "name": "ថូ ប៉ាវ"
        },
        {
            "barcode": "BBWS171149250",
            "dpc": "03044131501",
            "name": "កែវ សំអូន"
        },
        {
            "barcode": "BBWS171149251",
            "dpc": "03044131601",
            "name": "គង់ ថន"
        },
        {
            "barcode": "BBWS171149252",
            "dpc": "03044131701",
            "name": "សំ ចិត្រា"
        },
        {
            "barcode": "BBWS171149253",
            "dpc": "03044131801",
            "name": "យូ គាវ"
        },
        {
            "barcode": "BBWS171149254",
            "dpc": "03044131901",
            "name": "ហ៊ុន ភេត្រា"
        },
        {
            "barcode": "BBWS171149255",
            "dpc": "03044132001",
            "name": "វឿង សាវេត"
        },
        {
            "barcode": "BBWS171149256",
            "dpc": "03044132101",
            "name": "តេង ថុល"
        },
        {
            "barcode": "BBWS171149257",
            "dpc": "03044132201",
            "name": "គង់ សម្បត្តិ"
        },
        {
            "barcode": "BBWS171149258",
            "dpc": "03044132301",
            "name": "អ៊ុក ណន"
        },
        {
            "barcode": "BBWS171149259",
            "dpc": "03044132401",
            "name": "ប៉េង ឡុង"
        },
        {
            "barcode": "BBWS171149260",
            "dpc": "03044132501",
            "name": "អៀង យ៉ាត់"
        },
        {
            "barcode": "BBWS171149261",
            "dpc": "03044132601",
            "name": "អាន ប៊ុនធៀង"
        },
        {
            "barcode": "BBWS171149262",
            "dpc": "03044132701",
            "name": "ជិន សុផានី"
        },
        {
            "barcode": "BBWS171149263",
            "dpc": "03044132801",
            "name": "យៀត យ៉ា"
        },
        {
            "barcode": "BBWS171149264",
            "dpc": "03044132901",
            "name": "លន់ ចាន់រី"
        },
        {
            "barcode": "BBWS171149265",
            "dpc": "03044133001",
            "name": "ហួត គឺមណារី"
        },
        {
            "barcode": "BBWS171149266",
            "dpc": "03044133101",
            "name": "តោ វ៉ាន់ហ៊ត"
        },
        {
            "barcode": "BBWS171149267",
            "dpc": "03044133301",
            "name": "ងឿន សាវឿត"
        },
        {
            "barcode": "BBWS171149268",
            "dpc": "03044133401",
            "name": "ព្រៀន លួន"
        },
        {
            "barcode": "BBWS171149269",
            "dpc": "03044133501",
            "name": "ទុយ អឿត"
        },
        {
            "barcode": "BBWS171149270",
            "dpc": "03044133601",
            "name": "រើយ រើន"
        },
        {
            "barcode": "BBWS171149271",
            "dpc": "03044133701",
            "name": "ហាង ផារ័ត្ន"
        },
        {
            "barcode": "BBWS171149272",
            "dpc": "03044133801",
            "name": "យី សុភាវី"
        },
        {
            "barcode": "BBWS171149273",
            "dpc": "03044133901",
            "name": "វែន សាវឿយ"
        },
        {
            "barcode": "BBWS171149274",
            "dpc": "03044134001",
            "name": "ឈួន វិច្ឆិកា"
        },
        {
            "barcode": "BBWS171149275",
            "dpc": "03044134101",
            "name": "ឈន រឿត"
        },
        {
            "barcode": "BBWS171149276",
            "dpc": "03044134201",
            "name": "ស៊ិម ឃឿន"
        },
        {
            "barcode": "BBWS171149277",
            "dpc": "03044134301",
            "name": "ឆន ភី"
        },
        {
            "barcode": "BBWS171149278",
            "dpc": "03044134401",
            "name": "គឿន សំរើប"
        },
        {
            "barcode": "BBWS171149279",
            "dpc": "03044134501",
            "name": "លន សូភ័ក្រត្រា"
        },
        {
            "barcode": "BBWS171149280",
            "dpc": "03044134601",
            "name": "ប៊ុន បំណង"
        },
        {
            "barcode": "BBWS171149281",
            "dpc": "03044134701",
            "name": "វ៉ា កង"
        },
        {
            "barcode": "BBWS171149282",
            "dpc": "03044134801",
            "name": "អោក បូទុំ"
        },
        {
            "barcode": "BBWS171149283",
            "dpc": "03044134901",
            "name": "យ៉ា សុខុម"
        },
        {
            "barcode": "BBWS171149284",
            "dpc": "03044135001",
            "name": "យ៉ាត កី"
        },
        {
            "barcode": "BBWS171149285",
            "dpc": "03044135101",
            "name": "ប៉ម ធី"
        },
        {
            "barcode": "BBWS171149286",
            "dpc": "03044135201",
            "name": "សុខ នី"
        },
        {
            "barcode": "BBWS171149287",
            "dpc": "03044135301",
            "name": "អ៊ិន សារី"
        },
        {
            "barcode": "BBWS171149288",
            "dpc": "03044135401",
            "name": "ប៉ិច សារិទ្ឋ"
        },
        {
            "barcode": "BBWS171149289",
            "dpc": "03044135501",
            "name": "ឡាប លឿម"
        },
        {
            "barcode": "BBWS171149290",
            "dpc": "03044135601",
            "name": "ស៊ន សុំ"
        },
        {
            "barcode": "BBWS171149291",
            "dpc": "03044135801",
            "name": "ស៊ន ពីង"
        },
        {
            "barcode": "BBWS171149292",
            "dpc": "03044135901",
            "name": "រី ង៉ែត"
        },
        {
            "barcode": "BBWS171149293",
            "dpc": "03044136001",
            "name": "ម៉ានី ឈុនណៃ"
        },
        {
            "barcode": "BBWS171149294",
            "dpc": "03044136201",
            "name": "ជឿម សុខារី"
        },
        {
            "barcode": "BBWS171149295",
            "dpc": "03044136301",
            "name": "ជា សារ៉ីម"
        },
        {
            "barcode": "BBWS171149296",
            "dpc": "03044136401",
            "name": "ជឿម ចន្ថូ"
        },
        {
            "barcode": "BBWS171149297",
            "dpc": "03044136501",
            "name": "ផន សុជាតិ"
        },
        {
            "barcode": "BBWS171149298",
            "dpc": "03044136601",
            "name": "លួង រេម"
        },
        {
            "barcode": "BBWS171149299",
            "dpc": "03044136701",
            "name": "ខាន់ មករា"
        },
        {
            "barcode": "BBWS171149300",
            "dpc": "03044136801",
            "name": "យ៉ាន់ វិជ្ជា"
        },
        {
            "barcode": "BBWS171149301",
            "dpc": "03044136901",
            "name": "សេង ងយ"
        },
        {
            "barcode": "BBWS171149302",
            "dpc": "03044137001",
            "name": "យ៉ុន ចាន់ថា"
        },
        {
            "barcode": "BBWS171149303",
            "dpc": "03044137101",
            "name": "មិត្ត ម៉ន"
        },
        {
            "barcode": "BBWS171149304",
            "dpc": "03044137201",
            "name": "សាន់ អ៊ិតប្រហ៊ីម"
        },
        {
            "barcode": "BBWS171149305",
            "dpc": "03044137301",
            "name": "ឈើយ ចយ"
        },
        {
            "barcode": "BBWS171149306",
            "dpc": "03044137401",
            "name": "មាស់ ភាព"
        },
        {
            "barcode": "BBWS171149307",
            "dpc": "03044137501",
            "name": "អ៊ោ ប៊ុនឡាយ"
        },
        {
            "barcode": "BBWS171149308",
            "dpc": "03044137601",
            "name": "រៀង ប៊ុនធាម"
        },
        {
            "barcode": "BBWS171149309",
            "dpc": "03044137701",
            "name": "ឪ ប៊ុនលីន"
        },
        {
            "barcode": "BBWS171149310",
            "dpc": "03044137801",
            "name": "ឪ ចាន់រ៉ុង"
        },
        {
            "barcode": "BBWS171149311",
            "dpc": "03044137901",
            "name": "ឆាយ គឹមយឿន"
        },
        {
            "barcode": "BBWS171149312",
            "dpc": "03044138001",
            "name": "ឈឿត ចន្ថា"
        },
        {
            "barcode": "BBWS171149313",
            "dpc": "03044138101",
            "name": "ឆាយ សុគន្ឋា"
        },
        {
            "barcode": "BBWS171149314",
            "dpc": "03044138201",
            "name": "ឆាយ ប៊ុនរី"
        },
        {
            "barcode": "BBWS171149315",
            "dpc": "03044138301",
            "name": "ឆាយ ផេង"
        },
        {
            "barcode": "BBWS171149316",
            "dpc": "03044138401",
            "name": "ផុន សារិទ្ឋ"
        },
        {
            "barcode": "BBWS171149317",
            "dpc": "03044138501",
            "name": "វិន សុឃីម"
        },
        {
            "barcode": "BBWS171149318",
            "dpc": "03044138601",
            "name": "ហាង គឺមឹសាន"
        },
        {
            "barcode": "BBWS171149319",
            "dpc": "03044138701",
            "name": "ឈាត សុភើយ"
        },
        {
            "barcode": "BBWS171149320",
            "dpc": "03044138801",
            "name": "ផា សំបូរ"
        },
        {
            "barcode": "BBWS171149321",
            "dpc": "03044138901",
            "name": "អ៊ុក ស៊ីថា"
        },
        {
            "barcode": "BBWS171149322",
            "dpc": "03044139001",
            "name": "ខុំ ភឿយ"
        },
        {
            "barcode": "BBWS171149323",
            "dpc": "03044139101",
            "name": "វ៉ាន់ សុវណ្ណា"
        },
        {
            "barcode": "BBWS171149324",
            "dpc": "03044139201",
            "name": "ពិន ហម"
        },
        {
            "barcode": "BBWS171149325",
            "dpc": "03044139301",
            "name": "មុំ សុឃឿន"
        },
        {
            "barcode": "BBWS171149326",
            "dpc": "03044139401",
            "name": "ស៊ុន មឿន"
        },
        {
            "barcode": "BBWS171149327",
            "dpc": "03044139601",
            "name": "មឿន និត"
        },
        {
            "barcode": "BBWS171149328",
            "dpc": "03044139701",
            "name": "មឿន សាម៉ុន"
        },
        {
            "barcode": "BBWS171149329",
            "dpc": "03044139801",
            "name": "សោ ប៊ុនហូ"
        },
        {
            "barcode": "BBWS171149330",
            "dpc": "03044139901",
            "name": "សឿប រដ្ឋា"
        },
        {
            "barcode": "BBWS171149331",
            "dpc": "03044140001",
            "name": "ដៀង វ៉ាន់ធៀង"
        },
        {
            "barcode": "BBWS171149332",
            "dpc": "03044140101",
            "name": "យ៉ាន់ វីរៈ"
        },
        {
            "barcode": "BBWS171149333",
            "dpc": "03044140201",
            "name": "សុន រុម"
        },
        {
            "barcode": "BBWS171149334",
            "dpc": "03044140301",
            "name": "រុំ សារ៉ុម"
        },
        {
            "barcode": "BBWS171149335",
            "dpc": "03044140401",
            "name": "រុំ សារួម"
        },
        {
            "barcode": "BBWS171149336",
            "dpc": "03044140501",
            "name": "សោម នឿន"
        },
        {
            "barcode": "BBWS171149337",
            "dpc": "03044140601",
            "name": "គឹម សេន"
        },
        {
            "barcode": "BBWS171149338",
            "dpc": "03044140701",
            "name": "យឿន អ៊ិត"
        },
        {
            "barcode": "BBWS171149339",
            "dpc": "03044140801",
            "name": "មិន ផាន"
        },
        {
            "barcode": "BBWS171149340",
            "dpc": "03044140901",
            "name": "មាស់ ឆវ័ន"
        },
        {
            "barcode": "BBWS171149341",
            "dpc": "03044141001",
            "name": "ហួត សុខា"
        },
        {
            "barcode": "BBWS171149342",
            "dpc": "03044141101",
            "name": "ផាន់ សុភក្រ័"
        },
        {
            "barcode": "BBWS171149343",
            "dpc": "03044141201",
            "name": "យ៉ាន សំភេទ"
        },
        {
            "barcode": "BBWS171149344",
            "dpc": "03044141301",
            "name": "យ៉ាន ចាន់ថាវ"
        },
        {
            "barcode": "BBWS171149345",
            "dpc": "03044141401",
            "name": "ហ៊ឹម ដាវី"
        },
        {
            "barcode": "BBWS171149346",
            "dpc": "03044141501",
            "name": "យឿន យឺត"
        },
        {
            "barcode": "BBWS171149347",
            "dpc": "03044141601",
            "name": "សូ ម៉ន"
        },
        {
            "barcode": "BBWS171149348",
            "dpc": "03044141701",
            "name": "អុំ ឬទ្ឋី"
        },
        {
            "barcode": "BBWS171149349",
            "dpc": "03044141801",
            "name": "វឿន សំអឿន"
        },
        {
            "barcode": "BBWS171149350",
            "dpc": "03044141901",
            "name": "សួស ប៉ាវ"
        },
        {
            "barcode": "BBWS171149351",
            "dpc": "03044142001",
            "name": "ឆេង រេត"
        },
        {
            "barcode": "BBWS171149352",
            "dpc": "03044142101",
            "name": "អៀង ឌឿន"
        },
        {
            "barcode": "BBWS171149353",
            "dpc": "03044142201",
            "name": "ហ៊ុន ហាន់ថា"
        },
        {
            "barcode": "BBWS171149354",
            "dpc": "03044142301",
            "name": "អ៊ី អ៊ីម"
        },
        {
            "barcode": "BBWS171149355",
            "dpc": "03044142401",
            "name": "ហឿង ហាល់"
        },
        {
            "barcode": "BBWS171149356",
            "dpc": "03044142501",
            "name": "វ័ន ហឿន"
        },
        {
            "barcode": "BBWS171149357",
            "dpc": "03044142601",
            "name": "អ៊ុក វណ្ណារ៉ា"
        },
        {
            "barcode": "BBWS171149358",
            "dpc": "03044142701",
            "name": "ឆោម ចន្នាវ"
        },
        {
            "barcode": "BBWS171149359",
            "dpc": "03044142801",
            "name": "វី ឆែ"
        },
        {
            "barcode": "BBWS171149360",
            "dpc": "03044142901",
            "name": "ទិត្យ សុភាព"
        },
        {
            "barcode": "BBWS171149361",
            "dpc": "03044143001",
            "name": "ផេង ភឿត"
        },
        {
            "barcode": "BBWS171149362",
            "dpc": "03044143101",
            "name": "ប៊ុយ សុខលី"
        },
        {
            "barcode": "BBWS171149363",
            "dpc": "03044143201",
            "name": "ចោប វណ្ណី"
        },
        {
            "barcode": "BBWS171149364",
            "dpc": "03044143301",
            "name": "សាន សុឌីណា"
        },
        {
            "barcode": "BBWS171149365",
            "dpc": "03044143401",
            "name": "តិប សាមុត"
        },
        {
            "barcode": "BBWS171149366",
            "dpc": "03044143501",
            "name": "កៅ ខា"
        },
        {
            "barcode": "BBWS171149367",
            "dpc": "03044143601",
            "name": "ទិត្យ ភារិន"
        },
        {
            "barcode": "BBWS171149368",
            "dpc": "03044143701",
            "name": "ប៉ុន ជេដ្ឋា"
        },
        {
            "barcode": "BBWS171149369",
            "dpc": "03044143801",
            "name": "រ៉ុង ប៉ុក"
        },
        {
            "barcode": "BBWS171149370",
            "dpc": "03044143901",
            "name": "ហេង ពិសិទ្ធ"
        },
        {
            "barcode": "BBWS171149371",
            "dpc": "03044144001",
            "name": "យ៉ា រ៉ុមមាលី"
        },
        {
            "barcode": "BBWS171149372",
            "dpc": "03044144101",
            "name": "ជា លក"
        },
        {
            "barcode": "BBWS171149373",
            "dpc": "03044144201",
            "name": "អេង វុន"
        },
        {
            "barcode": "BBWS171149374",
            "dpc": "03044144301",
            "name": "ស៊ិន សុភា"
        },
        {
            "barcode": "BBWS171149375",
            "dpc": "03044144401",
            "name": "វ៉ាន ភាន"
        },
        {
            "barcode": "BBWS171149376",
            "dpc": "03044144501",
            "name": "គា ចានី"
        },
        {
            "barcode": "BBWS171149377",
            "dpc": "03044144601",
            "name": "ម៉ន យួម"
        },
        {
            "barcode": "BBWS171149378",
            "dpc": "03044144701",
            "name": "ជិន សុខុម"
        },
        {
            "barcode": "BBWS171149379",
            "dpc": "03044144801",
            "name": "សួស ផារ័ត្ន"
        },
        {
            "barcode": "BBWS171149380",
            "dpc": "03044144901",
            "name": "ធាអ៊ី ធៀន"
        },
        {
            "barcode": "BBWS171149381",
            "dpc": "03044145001",
            "name": "មឿន ណាំមី"
        },
        {
            "barcode": "BBWS171149382",
            "dpc": "03044145101",
            "name": "ជឿន ធី"
        },
        {
            "barcode": "BBWS171149383",
            "dpc": "03044145201",
            "name": "មឿន សែប"
        },
        {
            "barcode": "BBWS171149384",
            "dpc": "03044145501",
            "name": "លី លួម"
        },
        {
            "barcode": "BBWS171149385",
            "dpc": "03044145601",
            "name": "ស្រី លីស"
        },
        {
            "barcode": "BBWS171149386",
            "dpc": "03044145701",
            "name": "ហ៊ុន រ៉ូសាលី"
        },
        {
            "barcode": "BBWS171149387",
            "dpc": "03044145801",
            "name": "យ៉ក ថា"
        },
        {
            "barcode": "BBWS171149388",
            "dpc": "03044145901",
            "name": "ស្រឺង ណាលី"
        },
        {
            "barcode": "BBWS171149389",
            "dpc": "03044146001",
            "name": "វឿង សៅយ៉េត"
        },
        {
            "barcode": "BBWS171149390",
            "dpc": "03044146201",
            "name": "ម៉ៅ សុខា"
        },
        {
            "barcode": "BBWS171149391",
            "dpc": "03044146301",
            "name": "ហេង សេងហុង"
        },
        {
            "barcode": "BBWS171149392",
            "dpc": "03044146401",
            "name": "សេង សាវឿន"
        },
        {
            "barcode": "BBWS171149393",
            "dpc": "03044146501",
            "name": "សៅ ឆុង"
        },
        {
            "barcode": "BBWS171149394",
            "dpc": "03044146601",
            "name": "ម៉ី វ៉ាន់ទូច"
        },
        {
            "barcode": "BBWS171149395",
            "dpc": "03044146801",
            "name": "សោម វ៉ាន់ធូ"
        },
        {
            "barcode": "BBWS171149396",
            "dpc": "03044146901",
            "name": "សាវី ម៉ារី"
        },
        {
            "barcode": "BBWS171149397",
            "dpc": "03044147001",
            "name": "ប៊ូ សុថានី"
        },
        {
            "barcode": "BBWS171149398",
            "dpc": "03044147101",
            "name": "យិន ខេមរៈ"
        },
        {
            "barcode": "BBWS171149399",
            "dpc": "03044147201",
            "name": "ហឿន ហឿម"
        },
        {
            "barcode": "BBWS171149400",
            "dpc": "03044147301",
            "name": "ចេវ ជឿន"
        },
        {
            "barcode": "BBWS171149401",
            "dpc": "03044147501",
            "name": "សេង សុផាន់នី"
        },
        {
            "barcode": "BBWS171149402",
            "dpc": "03044147601",
            "name": "ចាន់ សុផល"
        },
        {
            "barcode": "BBWS171149403",
            "dpc": "03044147701",
            "name": "ម៉ាត់ សារីយ៉ាន"
        },
        {
            "barcode": "BBWS171149404",
            "dpc": "03044147801",
            "name": "ស៊ូ ណាសែ"
        },
        {
            "barcode": "BBWS171149405",
            "dpc": "03044147901",
            "name": "ឌួង លី III"
        },
        {
            "barcode": "BBWS171149406",
            "dpc": "03044148001",
            "name": "លួម ជ័យ"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
