let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=

    [
        {
            "barcode": "BBWS180200712",
            "dpc": "03014200101",
            "name": "លាង ស៊ាងហេង"
        },
        {
            "barcode": "BBWS180200713",
            "dpc": "03014200201",
            "name": "នី រ៉ាត់"
        },
        {
            "barcode": "BBWS180200714",
            "dpc": "03014200301",
            "name": "ង៉ូវ ប៉ែត"
        },
        {
            "barcode": "BBWS180200715",
            "dpc": "03014200401",
            "name": "ថៃ ស្រីពៅ"
        },
        {
            "barcode": "BBWS180200716",
            "dpc": "03014200601",
            "name": "ប៊ូ វត្តា"
        },
        {
            "barcode": "BBWS180200717",
            "dpc": "03014200701",
            "name": "គង់ រ៉ាវី"
        },
        {
            "barcode": "BBWS180200718",
            "dpc": "03014200901",
            "name": "គឹម សឿត"
        },
        {
            "barcode": "BBWS180200719",
            "dpc": "03014201001",
            "name": "ហេង ឈុនលី"
        },
        {
            "barcode": "BBWS180200720",
            "dpc": "03014201101",
            "name": "ម៉េង រ៉ា"
        },
        {
            "barcode": "BBWS180200721",
            "dpc": "03014201301",
            "name": "កែវ សុខលាង"
        },
        {
            "barcode": "BBWS180200722",
            "dpc": "03014201401",
            "name": "ស៊ីន ស៊ីធួន"
        },
        {
            "barcode": "BBWS180200723",
            "dpc": "03014201501",
            "name": "មូល ជីវ័ន្ត"
        },
        {
            "barcode": "BBWS180200724",
            "dpc": "03014201601",
            "name": "ស៊ា ចាន់"
        },
        {
            "barcode": "BBWS180200725",
            "dpc": "03014201701",
            "name": "ខៀវ សុផាន់ណា"
        },
        {
            "barcode": "BBWS180200726",
            "dpc": "03014201801",
            "name": "សឿន សោម"
        },
        {
            "barcode": "BBWS180200727",
            "dpc": "03014201901",
            "name": "ទូច សាវី"
        },
        {
            "barcode": "BBWS180200728",
            "dpc": "03014202001",
            "name": "ប៉ិច ធី"
        },
        {
            "barcode": "BBWS180200729",
            "dpc": "03014202101",
            "name": "មី សំ"
        },
        {
            "barcode": "BBWS180200730",
            "dpc": "03014202301",
            "name": "អ៊ឹម វាចា"
        },
        {
            "barcode": "BBWS180200731",
            "dpc": "03014202401",
            "name": "ជា ម៉ូណូ"
        },
        {
            "barcode": "BBWS180200732",
            "dpc": "03014202501",
            "name": "ទូច ស្រីយ៉ា"
        },
        {
            "barcode": "BBWS180200733",
            "dpc": "03014202601",
            "name": "ប៉ុល ស៊ីនួន"
        },
        {
            "barcode": "BBWS180200734",
            "dpc": "03014202701",
            "name": "ប៉ុល ស៊ីនួន២"
        },
        {
            "barcode": "BBWS180200735",
            "dpc": "03014202801",
            "name": "សាយ ស៊ឺនប៉ិច"
        },
        {
            "barcode": "BBWS180200736",
            "dpc": "03014202901",
            "name": "យ៉ន ស៊ីនួន"
        },
        {
            "barcode": "BBWS180200737",
            "dpc": "03014203101",
            "name": "វ៉ាន់ ចាន់រិទ្ធ"
        },
        {
            "barcode": "BBWS180200738",
            "dpc": "03014203301",
            "name": "អាន សុខថៃ"
        },
        {
            "barcode": "BBWS180200739",
            "dpc": "03014203401",
            "name": "វ៉ាន វុធ"
        },
        {
            "barcode": "BBWS180200740",
            "dpc": "03014203501",
            "name": "ប៉ាល គីណាត"
        },
        {
            "barcode": "BBWS180200741",
            "dpc": "03014203601",
            "name": "ហួត ចំរើន"
        },
        {
            "barcode": "BBWS180200742",
            "dpc": "03014203701",
            "name": "និន គឹមលីន"
        },
        {
            "barcode": "BBWS180200743",
            "dpc": "03014203801",
            "name": "អយ សុភាព"
        },
        {
            "barcode": "BBWS180200744",
            "dpc": "03014203901",
            "name": "ឡុច សុងហេង"
        },
        {
            "barcode": "BBWS180200745",
            "dpc": "03014204101",
            "name": "ហ៊ុន សុភាព"
        },
        {
            "barcode": "BBWS180200746",
            "dpc": "03014204201",
            "name": "ប៊ូន សំអុល"
        },
        {
            "barcode": "BBWS180200747",
            "dpc": "03014204301",
            "name": "ទីំម ឆេងអាន"
        },
        {
            "barcode": "BBWS180200748",
            "dpc": "03014204401",
            "name": "អឹម អូន"
        },
        {
            "barcode": "BBWS180200749",
            "dpc": "03014204501",
            "name": "សឿម ឌីណា"
        },
        {
            "barcode": "BBWS180200750",
            "dpc": "03014204601",
            "name": "ហេង ប៊ុនថៃ"
        },
        {
            "barcode": "BBWS180200751",
            "dpc": "03014204801",
            "name": "ភឿក រៀត"
        },
        {
            "barcode": "BBWS180200752",
            "dpc": "03014204901",
            "name": "សែម ចាន់លាភា"
        },
        {
            "barcode": "BBWS180200753",
            "dpc": "03014205001",
            "name": "ឆាង បាន"
        },
        {
            "barcode": "BBWS180200754",
            "dpc": "03014205101",
            "name": "យ៉ត ធឿន"
        },
        {
            "barcode": "BBWS180200755",
            "dpc": "03014205201",
            "name": "យូ ចាន់"
        },
        {
            "barcode": "BBWS180200756",
            "dpc": "03014205301",
            "name": "កែវ នាង"
        },
        {
            "barcode": "BBWS180200757",
            "dpc": "03014205401",
            "name": "រួម រ៉ាត់"
        },
        {
            "barcode": "BBWS180200758",
            "dpc": "03014205601",
            "name": "ទុយ ឆេង"
        },
        {
            "barcode": "BBWS180200759",
            "dpc": "03014205701",
            "name": "អែម ធី"
        },
        {
            "barcode": "BBWS180200760",
            "dpc": "03014205801",
            "name": "ហោ លុច"
        },
        {
            "barcode": "BBWS180200761",
            "dpc": "03014205901",
            "name": "ឌួង ភក្តី"
        },
        {
            "barcode": "BBWS180200762",
            "dpc": "03014206001",
            "name": "ចាន់ ផល្លី"
        },
        {
            "barcode": "BBWS180200763",
            "dpc": "03014206101",
            "name": "ហូវ សុខុម"
        },
        {
            "barcode": "BBWS180200764",
            "dpc": "03014206201",
            "name": "ចេម វាំង"
        },
        {
            "barcode": "BBWS180200765",
            "dpc": "03014206301",
            "name": "សុខ ម៉ៅ"
        },
        {
            "barcode": "BBWS180200766",
            "dpc": "03014206401",
            "name": "ភូ អេង"
        },
        {
            "barcode": "BBWS180200767",
            "dpc": "03014206501",
            "name": "ម៉េង ដារ៉ា"
        },
        {
            "barcode": "BBWS180200768",
            "dpc": "03014206601",
            "name": "អែម អៀង"
        },
        {
            "barcode": "BBWS180200769",
            "dpc": "03014206701",
            "name": "ទូច សាវេត"
        },
        {
            "barcode": "BBWS180200770",
            "dpc": "03014206801",
            "name": "អ៊ុំ ថា"
        },
        {
            "barcode": "BBWS180200771",
            "dpc": "03014206901",
            "name": "ញឹម សុខ"
        },
        {
            "barcode": "BBWS180200772",
            "dpc": "03014207001",
            "name": "អឿន វឿទ"
        },
        {
            "barcode": "BBWS180200773",
            "dpc": "03014207101",
            "name": "ទួម ជាតិ"
        },
        {
            "barcode": "BBWS180200774",
            "dpc": "03014207201",
            "name": "ម៉ាច វណ្ណះ"
        },
        {
            "barcode": "BBWS180200775",
            "dpc": "03014207301",
            "name": "ចៅ ជឿង"
        },
        {
            "barcode": "BBWS180200776",
            "dpc": "03014207501",
            "name": "យុត តុងហាន់"
        },
        {
            "barcode": "BBWS180200777",
            "dpc": "03014207601",
            "name": "យឿន ធីតា"
        },
        {
            "barcode": "BBWS180200778",
            "dpc": "03014207701",
            "name": "ថង ថានី"
        },
        {
            "barcode": "BBWS180200779",
            "dpc": "03014207801",
            "name": "ម៉ាត សាលីន"
        },
        {
            "barcode": "BBWS180200780",
            "dpc": "03014208001",
            "name": "កើត មុំ"
        },
        {
            "barcode": "BBWS180200781",
            "dpc": "03014208101",
            "name": "សេន អាស់ម៉ាតប៉ះទ្រី"
        },
        {
            "barcode": "BBWS180200782",
            "dpc": "03014208201",
            "name": "ឯល សាឡឹម"
        },
        {
            "barcode": "BBWS180200783",
            "dpc": "03014208301",
            "name": "សេន នាង"
        },
        {
            "barcode": "BBWS180200784",
            "dpc": "03014208401",
            "name": "វង់ រ៉េន"
        },
        {
            "barcode": "BBWS180200785",
            "dpc": "03014208501",
            "name": "អោក សុផាត"
        },
        {
            "barcode": "BBWS180200786",
            "dpc": "03014208601",
            "name": "ឌឿក សារួន"
        },
        {
            "barcode": "BBWS180200787",
            "dpc": "03014208701",
            "name": "ងើយ សាមិត"
        },
        {
            "barcode": "BBWS180200788",
            "dpc": "03014208801",
            "name": "ហួត សេរីវុធ"
        },
        {
            "barcode": "BBWS180200789",
            "dpc": "03014208901",
            "name": "សេន សោភា"
        },
        {
            "barcode": "BBWS180200790",
            "dpc": "03014209001",
            "name": "អ៊ុំ ស៊ុនឌី"
        },
        {
            "barcode": "BBWS180200791",
            "dpc": "03014209101",
            "name": "ផុន វុធ"
        },
        {
            "barcode": "BBWS180200792",
            "dpc": "03014209201",
            "name": "ឈួក សាម៉ន"
        },
        {
            "barcode": "BBWS180200793",
            "dpc": "03014209401",
            "name": "ឯក សារ៉ូ"
        },
        {
            "barcode": "BBWS180200794",
            "dpc": "03014209501",
            "name": "គ្រូ ប៉ុច"
        },
        {
            "barcode": "BBWS180200795",
            "dpc": "03014209601",
            "name": "ហេង បាន"
        },
        {
            "barcode": "BBWS180200796",
            "dpc": "03014209701",
            "name": "ប៉ា សារ៉ុម"
        },
        {
            "barcode": "BBWS180200797",
            "dpc": "03014209801",
            "name": "លាង ឆ្លាត"
        },
        {
            "barcode": "BBWS180200798",
            "dpc": "03014209901",
            "name": "កើត វិរះ"
        },
        {
            "barcode": "BBWS180200799",
            "dpc": "03014210001",
            "name": "កើត ប៊ុនថេន"
        },
        {
            "barcode": "BBWS180200800",
            "dpc": "03014210101",
            "name": "ហម ជុំ"
        },
        {
            "barcode": "BBWS180200801",
            "dpc": "03014210201",
            "name": "សួ ឃាង"
        },
        {
            "barcode": "BBWS180200802",
            "dpc": "03014210301",
            "name": "ហួរ សុវឌ្ឍនៈ"
        },
        {
            "barcode": "BBWS180200803",
            "dpc": "03014210401",
            "name": "វី វិចិត្រ"
        },
        {
            "barcode": "BBWS180200804",
            "dpc": "03014210501",
            "name": "លី សុវណ្ណា"
        },
        {
            "barcode": "BBWS180200805",
            "dpc": "03014210701",
            "name": "គី លាងជួ ១"
        },
        {
            "barcode": "BBWS180200806",
            "dpc": "03014211001",
            "name": "សេង ផល្លា"
        },
        {
            "barcode": "BBWS180200807",
            "dpc": "03014211101",
            "name": "សួន រ៉ុន"
        },
        {
            "barcode": "BBWS180200808",
            "dpc": "03014211201",
            "name": "ឌុល ណឹន"
        },
        {
            "barcode": "BBWS180200809",
            "dpc": "03014211301",
            "name": "ផាត់ សុភី"
        },
        {
            "barcode": "BBWS180200810",
            "dpc": "03014211401",
            "name": "ឡាញ់ ឈឿប"
        },
        {
            "barcode": "BBWS180200811",
            "dpc": "03014211501",
            "name": "ឃុន យោន"
        },
        {
            "barcode": "BBWS180200812",
            "dpc": "03014211601",
            "name": "ម៉ក់ កុសល"
        },
        {
            "barcode": "BBWS180200813",
            "dpc": "03014211701",
            "name": "ហ៊ុន ពុត្រា"
        },
        {
            "barcode": "BBWS180200814",
            "dpc": "03014211801",
            "name": "ហ៊ុន សុភក្រ័"
        },
        {
            "barcode": "BBWS180200815",
            "dpc": "03014211901",
            "name": "ទិត្យ បូភី"
        },
        {
            "barcode": "BBWS180200816",
            "dpc": "03014212001",
            "name": "សែ សំអឿន"
        },
        {
            "barcode": "BBWS180200817",
            "dpc": "03014212101",
            "name": "ដូត យន់"
        },
        {
            "barcode": "BBWS180200818",
            "dpc": "03014212201",
            "name": "ឆាន់ ឈួន"
        },
        {
            "barcode": "BBWS180200819",
            "dpc": "03014212401",
            "name": "ធួត រឿម"
        },
        {
            "barcode": "BBWS180200820",
            "dpc": "03014212501",
            "name": "គុយ ស៊ត"
        },
        {
            "barcode": "BBWS180200821",
            "dpc": "03014212601",
            "name": "ឆូត រ៉ម"
        },
        {
            "barcode": "BBWS180200822",
            "dpc": "03014212701",
            "name": "ញឹក ធៀង"
        },
        {
            "barcode": "BBWS180200823",
            "dpc": "03014213001",
            "name": "ឌី វណ្ណៈ"
        },
        {
            "barcode": "BBWS180200824",
            "dpc": "03014213101",
            "name": "គឹម ម៉ាណែត"
        },
        {
            "barcode": "BBWS180200825",
            "dpc": "03014213201",
            "name": "ឆាន សុភី"
        },
        {
            "barcode": "BBWS180200826",
            "dpc": "03014213301",
            "name": "ប៊ូ ហេង"
        },
        {
            "barcode": "BBWS180200827",
            "dpc": "03014213401",
            "name": "វេង ស៊្រុន"
        },
        {
            "barcode": "BBWS180200828",
            "dpc": "03014213501",
            "name": "ជុំ សុវណ្ណ"
        },
        {
            "barcode": "BBWS180200829",
            "dpc": "03014213601",
            "name": "សុខ វណ្ណា"
        },
        {
            "barcode": "BBWS180200830",
            "dpc": "03014213701",
            "name": "សួន សាមឌី"
        },
        {
            "barcode": "BBWS180200831",
            "dpc": "03014213801",
            "name": "ឌុក ចរិយា"
        },
        {
            "barcode": "BBWS180200832",
            "dpc": "03014214001",
            "name": "ដួង បញ្ញា"
        },
        {
            "barcode": "BBWS180200833",
            "dpc": "03014214101",
            "name": "សេង វុទ្ធី"
        },
        {
            "barcode": "BBWS180200834",
            "dpc": "03014214201",
            "name": "តាន់ នីរ័ត្ន"
        },
        {
            "barcode": "BBWS180200835",
            "dpc": "03014214301",
            "name": "សូ វ៉ាឌីណា"
        },
        {
            "barcode": "BBWS180200836",
            "dpc": "03014214401",
            "name": "យឹម ពៅ"
        },
        {
            "barcode": "BBWS180200837",
            "dpc": "03014214501",
            "name": "ពេជ្រ សុជា"
        },
        {
            "barcode": "BBWS180200838",
            "dpc": "03014214601",
            "name": "វាន់ នាង"
        },
        {
            "barcode": "BBWS180200839",
            "dpc": "03014214701",
            "name": "ឆៃ កាវ៉ាត"
        },
        {
            "barcode": "BBWS180200840",
            "dpc": "03014214801",
            "name": "គឹម ស៊ុង"
        },
        {
            "barcode": "BBWS180200841",
            "dpc": "03014214901",
            "name": "អាត ស៊ីថា"
        },
        {
            "barcode": "BBWS180200842",
            "dpc": "03014215001",
            "name": "ឈឹម សុពូន"
        },
        {
            "barcode": "BBWS180200843",
            "dpc": "03014215101",
            "name": "សំ សារ៉ុម"
        },
        {
            "barcode": "BBWS180200844",
            "dpc": "03014215201",
            "name": "អ៊ សំអាន"
        },
        {
            "barcode": "BBWS180200845",
            "dpc": "03014215301",
            "name": "ដាញ់ បុប្ជា"
        },
        {
            "barcode": "BBWS180200846",
            "dpc": "03014215401",
            "name": "ហេង ហឿម"
        },
        {
            "barcode": "BBWS180200847",
            "dpc": "03014215501",
            "name": "សុខ បូ"
        },
        {
            "barcode": "BBWS180200848",
            "dpc": "03014215601",
            "name": "យៀង វាសនា"
        },
        {
            "barcode": "BBWS180200849",
            "dpc": "03014215701",
            "name": "អោម សាវិន"
        },
        {
            "barcode": "BBWS180200850",
            "dpc": "03014215801",
            "name": "ឡាយ ឃុនឌី"
        },
        {
            "barcode": "BBWS180200851",
            "dpc": "03014215901",
            "name": "សុខ មុត"
        },
        {
            "barcode": "BBWS180200852",
            "dpc": "03014216001",
            "name": "គិត ឡាក់"
        },
        {
            "barcode": "BBWS180200853",
            "dpc": "03014216101",
            "name": "អ៊ឹង គង់អ៊ីម"
        },
        {
            "barcode": "BBWS180200854",
            "dpc": "03014216201",
            "name": "ឡូញ វាសនា"
        },
        {
            "barcode": "BBWS180200855",
            "dpc": "03014216301",
            "name": "យឹង សេរីរត្ន័"
        },
        {
            "barcode": "BBWS180200856",
            "dpc": "03014216401",
            "name": "អ៊ូរ ម៉ាល័យ"
        },
        {
            "barcode": "BBWS180200857",
            "dpc": "03014216501",
            "name": "ឯម សុវណ្ណ"
        },
        {
            "barcode": "BBWS180200858",
            "dpc": "03014216601",
            "name": "រុន រតនា"
        },
        {
            "barcode": "BBWS180200859",
            "dpc": "03014216701",
            "name": "សំ ជ័យវិបុល"
        },
        {
            "barcode": "BBWS180200860",
            "dpc": "03014216801",
            "name": "ទេព ម៉ារិទ្ធិ"
        },
        {
            "barcode": "BBWS180200861",
            "dpc": "03014216901",
            "name": "គឹម ចាន់ស៊ីថុន"
        },
        {
            "barcode": "BBWS180200862",
            "dpc": "03014217001",
            "name": "ប៊ុត តៃហេង"
        },
        {
            "barcode": "BBWS180200863",
            "dpc": "03014217101",
            "name": "គី គឹមលាង"
        },
        {
            "barcode": "BBWS180200864",
            "dpc": "03014217201",
            "name": "គី លាងជូ"
        },
        {
            "barcode": "BBWS180200865",
            "dpc": "03014217301",
            "name": "ហ៊ួត ម៉ាឡា"
        },
        {
            "barcode": "BBWS180200866",
            "dpc": "03014217401",
            "name": "ប៉ូច វឌ្ឍនា"
        },
        {
            "barcode": "BBWS180200867",
            "dpc": "03014217501",
            "name": "យ៉ន រិទ្ធី"
        },
        {
            "barcode": "BBWS180200868",
            "dpc": "03014217601",
            "name": "រស់ គង់"
        },
        {
            "barcode": "BBWS180200869",
            "dpc": "03014217701",
            "name": "ឡោ រុណ"
        },
        {
            "barcode": "BBWS180200870",
            "dpc": "03014217801",
            "name": "អេង សេស"
        },
        {
            "barcode": "BBWS180200871",
            "dpc": "03014217901",
            "name": "ម៉ិត សាមុត"
        },
        {
            "barcode": "BBWS180200872",
            "dpc": "03014218001",
            "name": "ឈឹម កុសល"
        },
        {
            "barcode": "BBWS180200873",
            "dpc": "03014218101",
            "name": "ងឿន ប៊ុនថន"
        },
        {
            "barcode": "BBWS180200874",
            "dpc": "03014218201",
            "name": "ដេត សារ៉េត"
        },
        {
            "barcode": "BBWS180200875",
            "dpc": "03014218301",
            "name": "តាំង សេក"
        },
        {
            "barcode": "BBWS180200876",
            "dpc": "03014218401",
            "name": "ថៃ ឃីម"
        },
        {
            "barcode": "BBWS180200877",
            "dpc": "03014218501",
            "name": "ពៅ លកក្រូច"
        },
        {
            "barcode": "BBWS180200878",
            "dpc": "03014218601",
            "name": "សូត្រ និល"
        },
        {
            "barcode": "BBWS180200879",
            "dpc": "03014218701",
            "name": "សូត្រ វៃ"
        },
        {
            "barcode": "BBWS180200880",
            "dpc": "03014218801",
            "name": "ជូន មន្ថា"
        },
        {
            "barcode": "BBWS180200881",
            "dpc": "03014218901",
            "name": "ស សារិទ្ធ"
        },
        {
            "barcode": "BBWS180200882",
            "dpc": "03014219001",
            "name": "សុខ ឆេង"
        },
        {
            "barcode": "BBWS180200883",
            "dpc": "03014219101",
            "name": "លឹម ពេងគា"
        },
        {
            "barcode": "BBWS180200884",
            "dpc": "03014219201",
            "name": "បូ ដាណា"
        },
        {
            "barcode": "BBWS180200885",
            "dpc": "03014219301",
            "name": "ហូប៊ុន ណារឿន"
        },
        {
            "barcode": "BBWS180200886",
            "dpc": "03014219401",
            "name": "ឌួង សុឃុននារី"
        },
        {
            "barcode": "BBWS180200887",
            "dpc": "03014219501",
            "name": "ម៉ែន គង់"
        },
        {
            "barcode": "BBWS180200888",
            "dpc": "03014219601",
            "name": "សំ ប៊ុនណាត"
        },
        {
            "barcode": "BBWS180200889",
            "dpc": "03014219701",
            "name": "គីង វ៉ាត"
        },
        {
            "barcode": "BBWS180200890",
            "dpc": "03014219801",
            "name": "លី ធានប៉ាវ"
        },
        {
            "barcode": "BBWS180200891",
            "dpc": "03014219901",
            "name": "ឈាន ហរទ័យ"
        },
        {
            "barcode": "BBWS180200892",
            "dpc": "03014220001",
            "name": "គួច លាភ"
        },
        {
            "barcode": "BBWS180200893",
            "dpc": "03014220101",
            "name": "ញ៉ រ៉ុម"
        },
        {
            "barcode": "BBWS180200894",
            "dpc": "03014220201",
            "name": "ជូវ ម៉េងពៅ"
        },
        {
            "barcode": "BBWS180200895",
            "dpc": "03014220301",
            "name": "ពៅ"
        },
        {
            "barcode": "BBWS180200896",
            "dpc": "03014220401",
            "name": "ហេង ស៊ត"
        },
        {
            "barcode": "BBWS180200897",
            "dpc": "03014220501",
            "name": "ប៉ូច ភិរម្យ"
        },
        {
            "barcode": "BBWS180200898",
            "dpc": "03014220601",
            "name": "យាន់ ចាន់ឡេង"
        },
        {
            "barcode": "BBWS180200899",
            "dpc": "03014220701",
            "name": "ស្រី ពិសី"
        },
        {
            "barcode": "BBWS180200900",
            "dpc": "03014220801",
            "name": "ឃុត រក្សារដ្ឋ"
        },
        {
            "barcode": "BBWS180200901",
            "dpc": "03014220901",
            "name": "សុខ សាវឿន"
        },
        {
            "barcode": "BBWS180200902",
            "dpc": "03014221201",
            "name": "យ៉ាន យ៉ាស៊ីគីន"
        },
        {
            "barcode": "BBWS180200903",
            "dpc": "03014221301",
            "name": "យ៉ាន រីហ្វីន"
        },
        {
            "barcode": "BBWS180200904",
            "dpc": "03014221401",
            "name": "យឿ សៅយ៉ុត"
        },
        {
            "barcode": "BBWS180200905",
            "dpc": "03014221501",
            "name": "ប្រាក់ គីរី"
        },
        {
            "barcode": "BBWS180200906",
            "dpc": "03014221601",
            "name": "ណុប ឬទ្ធីពង្ស"
        },
        {
            "barcode": "BBWS180200907",
            "dpc": "03014221701",
            "name": "យ៉េក ស៊ីហៀង"
        },
        {
            "barcode": "BBWS180200908",
            "dpc": "03014221801",
            "name": "ម៉ឹង ម៉េង"
        },
        {
            "barcode": "BBWS180200909",
            "dpc": "03014221901",
            "name": "ទិន សាលី"
        },
        {
            "barcode": "BBWS180200910",
            "dpc": "03014222101",
            "name": "ប៉ា ភាណា"
        },
        {
            "barcode": "BBWS180200911",
            "dpc": "03014222201",
            "name": "កែន ហ៊ុន"
        },
        {
            "barcode": "BBWS180200912",
            "dpc": "03014222301",
            "name": "ពីវ ត្រប់"
        },
        {
            "barcode": "BBWS180200913",
            "dpc": "03014222401",
            "name": "ឆាំ សុខុម"
        },
        {
            "barcode": "BBWS180200914",
            "dpc": "03014222501",
            "name": "ម៉ៅ ប៊ុនធី"
        },
        {
            "barcode": "BBWS180200915",
            "dpc": "03014222601",
            "name": "ឈឿត សំអុល"
        },
        {
            "barcode": "BBWS180200916",
            "dpc": "03014222701",
            "name": "លី សឿប"
        },
        {
            "barcode": "BBWS180200917",
            "dpc": "03014222801",
            "name": "លី វិចិត្រ"
        },
        {
            "barcode": "BBWS180200918",
            "dpc": "03014222901",
            "name": "រ៉ាន់ ខា"
        },
        {
            "barcode": "BBWS180200919",
            "dpc": "03014223101",
            "name": "ហម សារ៉ុម"
        },
        {
            "barcode": "BBWS180200920",
            "dpc": "03014223201",
            "name": "ហួត ស៊ីណា"
        },
        {
            "barcode": "BBWS180200921",
            "dpc": "03014223301",
            "name": "ឯល ទីណា"
        },
        {
            "barcode": "BBWS180200922",
            "dpc": "03014223401",
            "name": "ឡេង ច័ន្ទនី"
        },
        {
            "barcode": "BBWS180200923",
            "dpc": "03014223501",
            "name": "ពុំ រដ្ឋា"
        },
        {
            "barcode": "BBWS180200924",
            "dpc": "03014223601",
            "name": "វង្ស ចាន់ថុនា"
        },
        {
            "barcode": "BBWS180200925",
            "dpc": "03014223701",
            "name": "ផាត់ សុភណ័"
        },
        {
            "barcode": "BBWS180200926",
            "dpc": "03014223801",
            "name": "ហេង សេងហុង"
        },
        {
            "barcode": "BBWS180200927",
            "dpc": "03014224001",
            "name": "ស៊ាន ឆវី"
        },
        {
            "barcode": "BBWS180200928",
            "dpc": "03014224101",
            "name": "លី ប៊ុនអេង"
        },
        {
            "barcode": "BBWS180200929",
            "dpc": "03014224201",
            "name": "ជុំ ទៀត"
        },
        {
            "barcode": "BBWS180200930",
            "dpc": "03014224301",
            "name": "ទោ លឿត"
        },
        {
            "barcode": "BBWS180200931",
            "dpc": "03014224401",
            "name": "សុខ រិទ្ធ"
        },
        {
            "barcode": "BBWS180200932",
            "dpc": "03014224501",
            "name": "ប៉ូ វណ្ណា"
        },
        {
            "barcode": "BBWS180200933",
            "dpc": "03014224801",
            "name": "ណយ សាវឿត"
        },
        {
            "barcode": "BBWS180200934",
            "dpc": "03014224901",
            "name": "ឆាយ លាភា"
        },
        {
            "barcode": "BBWS180200935",
            "dpc": "03014225001",
            "name": "វង់ រដ្ឋា"
        },
        {
            "barcode": "BBWS180200936",
            "dpc": "03014225101",
            "name": "តា លឿង"
        },
        {
            "barcode": "BBWS180200937",
            "dpc": "03014225201",
            "name": "ឆាយ សេងឌឿម"
        },
        {
            "barcode": "BBWS180200938",
            "dpc": "03014225301",
            "name": "ចាន់ រ៉ូឡែន"
        },
        {
            "barcode": "BBWS180200939",
            "dpc": "03014225401",
            "name": "សាន់ ហឿ"
        },
        {
            "barcode": "BBWS180200940",
            "dpc": "03014225501",
            "name": "អ៊ុច ម៉ៅ"
        },
        {
            "barcode": "BBWS180200941",
            "dpc": "03014225601",
            "name": "ឈួន ឈឿត"
        },
        {
            "barcode": "BBWS180200942",
            "dpc": "03014225701",
            "name": "រឿន រ៉េត"
        },
        {
            "barcode": "BBWS180200943",
            "dpc": "03014225801",
            "name": "មាឃ សុគន្ធី"
        },
        {
            "barcode": "BBWS180200944",
            "dpc": "03014225901",
            "name": "លី ហេង"
        },
        {
            "barcode": "BBWS180200945",
            "dpc": "03014226001",
            "name": "តន ចាន់នឿន"
        },
        {
            "barcode": "BBWS180200946",
            "dpc": "03014226101",
            "name": "ហួត សេរីវុឌ្ឍ"
        },
        {
            "barcode": "BBWS180200947",
            "dpc": "03014226201",
            "name": "គុណ សីហា"
        },
        {
            "barcode": "BBWS180200948",
            "dpc": "03014226301",
            "name": "ហែល សុធី"
        },
        {
            "barcode": "BBWS180200949",
            "dpc": "03014226401",
            "name": "ជុង ស៊ុងតេត"
        },
        {
            "barcode": "BBWS180200950",
            "dpc": "03014226501",
            "name": "ពេជ្រ សារឿន"
        },
        {
            "barcode": "BBWS180200951",
            "dpc": "03014226701",
            "name": "ព្រឿង ប្រឹម"
        },
        {
            "barcode": "BBWS180200952",
            "dpc": "03014226801",
            "name": "ឆាយ លាង"
        },
        {
            "barcode": "BBWS180200953",
            "dpc": "03014226901",
            "name": "នៅ ថា"
        },
        {
            "barcode": "BBWS180200954",
            "dpc": "03014227001",
            "name": "រឹត យី"
        },
        {
            "barcode": "BBWS180200955",
            "dpc": "03014227101",
            "name": "វុធ គន្ធា"
        },
        {
            "barcode": "BBWS180200956",
            "dpc": "03014227201",
            "name": "ឈួន តុល"
        },
        {
            "barcode": "BBWS180200957",
            "dpc": "03014227301",
            "name": "ធឿម សុផា"
        },
        {
            "barcode": "BBWS180200958",
            "dpc": "03014227401",
            "name": "អប់ ឡៃហុង"
        },
        {
            "barcode": "BBWS180200959",
            "dpc": "03014227501",
            "name": "ខ្វាត ភាព"
        },
        {
            "barcode": "BBWS180200960",
            "dpc": "03014227601",
            "name": "ពី សារ៉ាត់"
        },
        {
            "barcode": "BBWS180200961",
            "dpc": "03014227701",
            "name": "រិន ផល្លាភ"
        },
        {
            "barcode": "BBWS180200962",
            "dpc": "03014227801",
            "name": "សោម សុខលី"
        },
        {
            "barcode": "BBWS180200963",
            "dpc": "03014227901",
            "name": "ងួន អេង"
        },
        {
            "barcode": "BBWS180200964",
            "dpc": "03014228001",
            "name": "ហឿង សាវុធ"
        },
        {
            "barcode": "BBWS180200965",
            "dpc": "03014228101",
            "name": "ជុំ សាវន"
        },
        {
            "barcode": "BBWS180200966",
            "dpc": "03014228201",
            "name": "ចិន ដារ៉ា"
        },
        {
            "barcode": "BBWS180200967",
            "dpc": "03014228301",
            "name": "កុត ដុះ"
        },
        {
            "barcode": "BBWS180200968",
            "dpc": "03014228401",
            "name": "សួន ស៊ាន"
        },
        {
            "barcode": "BBWS180200969",
            "dpc": "03014228501",
            "name": "មឿ យឿត"
        },
        {
            "barcode": "BBWS180200970",
            "dpc": "03014228601",
            "name": "ប៉ូ សាក់នី"
        },
        {
            "barcode": "BBWS180200971",
            "dpc": "03014228701",
            "name": "ខៀវ សត្យា"
        },
        {
            "barcode": "BBWS180200972",
            "dpc": "03014228801",
            "name": "វ៉ន ពេជ្រ"
        },
        {
            "barcode": "BBWS180200973",
            "dpc": "03014228901",
            "name": "រ៉ុន សារឿត"
        },
        {
            "barcode": "BBWS180200974",
            "dpc": "03014229001",
            "name": "ហឿម ហឿត"
        },
        {
            "barcode": "BBWS180200975",
            "dpc": "03014229101",
            "name": "រ៉ែម សារិន"
        },
        {
            "barcode": "BBWS180200976",
            "dpc": "03014229201",
            "name": "គឹម ផន"
        },
        {
            "barcode": "BBWS180200977",
            "dpc": "03014229301",
            "name": "យ៉ុម ឡាត"
        },
        {
            "barcode": "BBWS180200978",
            "dpc": "03014229401",
            "name": "កៀម កុយ"
        },
        {
            "barcode": "BBWS180200979",
            "dpc": "03014229501",
            "name": "ឆេង កុជលាង"
        },
        {
            "barcode": "BBWS180200980",
            "dpc": "03014229601",
            "name": "ថូ"
        },
        {
            "barcode": "BBWS180200981",
            "dpc": "03014229701",
            "name": "តាន់ ឡេងថៃ"
        },
        {
            "barcode": "BBWS180200982",
            "dpc": "03014229801",
            "name": "យ៉ុង ពេជ្រ"
        },
        {
            "barcode": "BBWS180200983",
            "dpc": "03014229901",
            "name": "នឿន សារ៉េត"
        },
        {
            "barcode": "BBWS180200984",
            "dpc": "03014230001",
            "name": "សូត ពឿន"
        },
        {
            "barcode": "BBWS180200985",
            "dpc": "03014230101",
            "name": "សូត ឆឿត"
        },
        {
            "barcode": "BBWS180200986",
            "dpc": "03014230201",
            "name": "ឡឹង វ៉ាត់"
        },
        {
            "barcode": "BBWS180200987",
            "dpc": "03014230301",
            "name": "ហង្ស ម៉ុក"
        },
        {
            "barcode": "BBWS180200988",
            "dpc": "03014230401",
            "name": "យុត វ៉ែន"
        },
        {
            "barcode": "BBWS180200989",
            "dpc": "03014230501",
            "name": "លឿប ម៉ៅ"
        },
        {
            "barcode": "BBWS180200990",
            "dpc": "03014230601",
            "name": "ញៅ យៀត"
        },
        {
            "barcode": "BBWS180200991",
            "dpc": "03014230701",
            "name": "ហោង ផាន"
        },
        {
            "barcode": "BBWS180200992",
            "dpc": "03014230801",
            "name": "ឡុង លន់"
        },
        {
            "barcode": "BBWS180200993",
            "dpc": "03014230901",
            "name": "ណូច គ"
        },
        {
            "barcode": "BBWS180200994",
            "dpc": "03014231001",
            "name": "អោប អ៊ឹម"
        },
        {
            "barcode": "BBWS180200995",
            "dpc": "03014231101",
            "name": "ហាច សុខុម"
        },
        {
            "barcode": "BBWS180200996",
            "dpc": "03014231201",
            "name": "ញៅ យឿត"
        },
        {
            "barcode": "BBWS180200997",
            "dpc": "03014231301",
            "name": "វឿន វី"
        },
        {
            "barcode": "BBWS180200998",
            "dpc": "03014231401",
            "name": "យិន សារឿន"
        },
        {
            "barcode": "BBWS180200999",
            "dpc": "03014231501",
            "name": "ឡុង ឈន"
        },
        {
            "barcode": "BBWS180201000",
            "dpc": "03014231601",
            "name": "ខៀវ សេរីរត្ន័"
        },
        {
            "barcode": "BBWS180201001",
            "dpc": "03014231701",
            "name": "កែវ កឹមណៃ"
        },
        {
            "barcode": "BBWS180201002",
            "dpc": "03014231801",
            "name": "គី ហក់"
        },
        {
            "barcode": "BBWS180201003",
            "dpc": "03014231901",
            "name": "ធួក សាវេត"
        },
        {
            "barcode": "BBWS180201004",
            "dpc": "03014232001",
            "name": "ឆោម សារើ"
        },
        {
            "barcode": "BBWS180201005",
            "dpc": "03014232101",
            "name": "គង់ សុខុន"
        },
        {
            "barcode": "BBWS180201006",
            "dpc": "03014232201",
            "name": "កង់ ខេង"
        },
        {
            "barcode": "BBWS180201007",
            "dpc": "03014232301",
            "name": "នី ភើយ"
        },
        {
            "barcode": "BBWS180201008",
            "dpc": "03014232401",
            "name": "ហៀម ហឿត"
        },
        {
            "barcode": "BBWS180201009",
            "dpc": "03014232501",
            "name": "រើយ ថារត៊្ន"
        },
        {
            "barcode": "BBWS180201010",
            "dpc": "03014232701",
            "name": "ហឿ សុខា"
        },
        {
            "barcode": "BBWS180201011",
            "dpc": "03014232801",
            "name": "ប៉ែន ឃាង"
        },
        {
            "barcode": "BBWS180201012",
            "dpc": "03014232901",
            "name": "រៀង រ៉ាឌី"
        },
        {
            "barcode": "BBWS180201013",
            "dpc": "03014233001",
            "name": "ស៊ាន អ៊ន"
        },
        {
            "barcode": "BBWS180201014",
            "dpc": "03014233101",
            "name": "ឆម ឡឹម"
        },
        {
            "barcode": "BBWS180201015",
            "dpc": "03014233201",
            "name": "គឹម ហូរ"
        },
        {
            "barcode": "BBWS180201016",
            "dpc": "03014233301",
            "name": "ព្រហ្ម ស៊ីដេត"
        },
        {
            "barcode": "BBWS180201017",
            "dpc": "03014233401",
            "name": "លួត លី"
        },
        {
            "barcode": "BBWS180201018",
            "dpc": "03014233501",
            "name": "ហៀប សាវត្តី"
        },
        {
            "barcode": "BBWS180201019",
            "dpc": "03014233601",
            "name": "អ៊ុន វើន"
        },
        {
            "barcode": "BBWS180201020",
            "dpc": "03014233701",
            "name": "ឡាច ផាត"
        },
        {
            "barcode": "BBWS180201021",
            "dpc": "03014233801",
            "name": "រ៉េត កក្កដា"
        },
        {
            "barcode": "BBWS180201022",
            "dpc": "03014233901",
            "name": "កឹក កន"
        },
        {
            "barcode": "BBWS180201023",
            "dpc": "03014234001",
            "name": "ហៀន វឿត"
        },
        {
            "barcode": "BBWS180201024",
            "dpc": "03014234101",
            "name": "ប្រឹង យើន"
        },
        {
            "barcode": "BBWS180201025",
            "dpc": "03014234201",
            "name": "ចាន់ ថេន"
        },
        {
            "barcode": "BBWS180201026",
            "dpc": "03014234301",
            "name": "យ៉ាត ពឿត"
        },
        {
            "barcode": "BBWS180201027",
            "dpc": "03014234401",
            "name": "ឆយ សារ៉ាត"
        },
        {
            "barcode": "BBWS180201028",
            "dpc": "03014234501",
            "name": "ហៀន រ៉េត"
        },
        {
            "barcode": "BBWS180201029",
            "dpc": "03014234601",
            "name": "ណុប រ៉ាវង្ស"
        },
        {
            "barcode": "BBWS180201030",
            "dpc": "03014234701",
            "name": "អៀម ស៊ីណា"
        },
        {
            "barcode": "BBWS180201031",
            "dpc": "03014234801",
            "name": "អៀប ចំណាប់"
        },
        {
            "barcode": "BBWS180201032",
            "dpc": "03014234901",
            "name": "ឡុង ហាក់"
        },
        {
            "barcode": "BBWS180201033",
            "dpc": "03014235001",
            "name": "អ៊ឹម ឈឹន"
        },
        {
            "barcode": "BBWS180201034",
            "dpc": "03014235101",
            "name": "នង សុខា"
        },
        {
            "barcode": "BBWS180201035",
            "dpc": "03014235201",
            "name": "មាឃ ណារី"
        },
        {
            "barcode": "BBWS180201036",
            "dpc": "03014235301",
            "name": "រត្ន័ ថា"
        },
        {
            "barcode": "BBWS180201037",
            "dpc": "03014235401",
            "name": "គួច ផល្លា ១"
        },
        {
            "barcode": "BBWS180201038",
            "dpc": "03014235501",
            "name": "លី ង៉ា"
        },
        {
            "barcode": "BBWS180201039",
            "dpc": "03014235701",
            "name": "សេង សុឈីង"
        },
        {
            "barcode": "BBWS180201040",
            "dpc": "03014235801",
            "name": "អ៊ុក សៀងហ៊ុន"
        },
        {
            "barcode": "BBWS180201041",
            "dpc": "03014236001",
            "name": "ហ៊ូ មេងស៊ាន"
        },
        {
            "barcode": "BBWS180201042",
            "dpc": "03014236101",
            "name": "ហ៊ន ធី"
        },
        {
            "barcode": "BBWS180201043",
            "dpc": "03014236201",
            "name": "ក្តិប សារិន"
        },
        {
            "barcode": "BBWS180201044",
            "dpc": "03014236301",
            "name": "ពេញ រដ្ធា"
        },
        {
            "barcode": "BBWS180201045",
            "dpc": "03014236401",
            "name": "រ៉ែម ឈឿត"
        },
        {
            "barcode": "BBWS180201046",
            "dpc": "03014236501",
            "name": "រុន សារិទ្ធ"
        },
        {
            "barcode": "BBWS180201047",
            "dpc": "03014236601",
            "name": "អ៊ឹម ឌីណា"
        },
        {
            "barcode": "BBWS180201048",
            "dpc": "03014236701",
            "name": "ស៊ីម សីវគីម"
        },
        {
            "barcode": "BBWS180201049",
            "dpc": "03014236801",
            "name": "ខាំ សារ៉ាវុត"
        },
        {
            "barcode": "BBWS180201050",
            "dpc": "03014237101",
            "name": "ថន ណារិទ្ធ"
        },
        {
            "barcode": "BBWS180201051",
            "dpc": "03014237201",
            "name": "ឈុន ណៃ"
        },
        {
            "barcode": "BBWS180201052",
            "dpc": "03014237301",
            "name": "អ៊ី គីមគួន"
        },
        {
            "barcode": "BBWS180201053",
            "dpc": "03014237401",
            "name": "រីន សុភាព"
        },
        {
            "barcode": "BBWS180201054",
            "dpc": "03014237501",
            "name": "យ៉ែម សុផល"
        },
        {
            "barcode": "BBWS180201055",
            "dpc": "03014237601",
            "name": "ថៃ ស្រីប៉ូច"
        },
        {
            "barcode": "BBWS180201056",
            "dpc": "03014237801",
            "name": "សឿប សារ៉ុន"
        },
        {
            "barcode": "BBWS180201057",
            "dpc": "03014237901",
            "name": "រ៉ា សុភ័ក្រ"
        },
        {
            "barcode": "BBWS180201058",
            "dpc": "03014238001",
            "name": "ទួន សីហា"
        },
        {
            "barcode": "BBWS180201059",
            "dpc": "03014238101",
            "name": "អូន ចាន់ណារី"
        },
        {
            "barcode": "BBWS180201060",
            "dpc": "03014238201",
            "name": "យឹម ណារី"
        },
        {
            "barcode": "BBWS180201061",
            "dpc": "03014238301",
            "name": "ចំរើន បញ្ញា"
        },
        {
            "barcode": "BBWS180201062",
            "dpc": "03014238401",
            "name": "លេខ វណ្ណា"
        },
        {
            "barcode": "BBWS180201063",
            "dpc": "03014244001",
            "name": "ចាន់ សំអុល"
        },
        {
            "barcode": "BBWS180201064",
            "dpc": "03014238601",
            "name": "យី សារ៉ូ"
        },
        {
            "barcode": "BBWS180201065",
            "dpc": "03014238701",
            "name": "គឹម ឡាយ"
        },
        {
            "barcode": "BBWS180201066",
            "dpc": "03014244101",
            "name": "កៅ ហួរ"
        },
        {
            "barcode": "BBWS180201067",
            "dpc": "03014238801",
            "name": "ទន់ សូលីណែត"
        },
        {
            "barcode": "BBWS180201068",
            "dpc": "03014244201",
            "name": "យិន ហឿម"
        },
        {
            "barcode": "BBWS180201069",
            "dpc": "03014244301",
            "name": "ហួន សារឿត"
        },
        {
            "barcode": "BBWS180201070",
            "dpc": "03014244401",
            "name": "ម៉ូ ចន្ទ័កុសល"
        },
        {
            "barcode": "BBWS180201071",
            "dpc": "03014238901",
            "name": "នង វ៉ាន់ថន"
        },
        {
            "barcode": "BBWS180201072",
            "dpc": "03014239001",
            "name": "អាប ឈុនអេង"
        },
        {
            "barcode": "BBWS180201073",
            "dpc": "03014239101",
            "name": "ជុន ហួត"
        },
        {
            "barcode": "BBWS180201074",
            "dpc": "03014239201",
            "name": "កៅ អ៊ាងឡាយ"
        },
        {
            "barcode": "BBWS180201075",
            "dpc": "03014244501",
            "name": "លេង វណ្ណៈ"
        },
        {
            "barcode": "BBWS180201076",
            "dpc": "03014239401",
            "name": "ស៊្រាន ពៅ"
        },
        {
            "barcode": "BBWS180201077",
            "dpc": "03014244601",
            "name": "ជា សុរស់"
        },
        {
            "barcode": "BBWS180201078",
            "dpc": "03014239601",
            "name": "ឌី ស្រីល័ក្ខ"
        },
        {
            "barcode": "BBWS180201079",
            "dpc": "03014239701",
            "name": "ទិន យ៉េក"
        },
        {
            "barcode": "BBWS180201080",
            "dpc": "03014239801",
            "name": "ស ប៊ុនធី"
        },
        {
            "barcode": "BBWS180201081",
            "dpc": "03014244701",
            "name": "ផៃ រ៉ា"
        },
        {
            "barcode": "BBWS180201082",
            "dpc": "03014239901",
            "name": "ហែម ពិសល់"
        },
        {
            "barcode": "BBWS180201083",
            "dpc": "03014244801",
            "name": "ឆៃ ឈន"
        },
        {
            "barcode": "BBWS180201084",
            "dpc": "03014240001",
            "name": "ពេជ្រ សុភ័ក្រ"
        },
        {
            "barcode": "BBWS180201085",
            "dpc": "03014240101",
            "name": "ជនពិការឡាប៉ាឡូម៉ា"
        },
        {
            "barcode": "BBWS180201086",
            "dpc": "03014240201",
            "name": "ឈើត ប៉ារ៉ាឌី"
        },
        {
            "barcode": "BBWS180201087",
            "dpc": "03014240301",
            "name": "ជី សុខហ៊ុន"
        },
        {
            "barcode": "BBWS180201088",
            "dpc": "03014240401",
            "name": "ប្រាក់ បូណេត"
        },
        {
            "barcode": "BBWS180201089",
            "dpc": "03014240501",
            "name": "ធី ដូណ"
        },
        {
            "barcode": "BBWS180201090",
            "dpc": "03014240601",
            "name": "សេង សុខុម"
        },
        {
            "barcode": "BBWS180201091",
            "dpc": "03014240701",
            "name": "ជា ផល្លី"
        },
        {
            "barcode": "BBWS180201092",
            "dpc": "03014240801",
            "name": "សុខ សុវណ្ណរ៉ា"
        },
        {
            "barcode": "BBWS180201093",
            "dpc": "03014240901",
            "name": "ភូង វុទ្ធី"
        },
        {
            "barcode": "BBWS180201094",
            "dpc": "03014241001",
            "name": "ដាញ់ សុវណ្ណរ៉ា"
        },
        {
            "barcode": "BBWS180201095",
            "dpc": "03014241101",
            "name": "វ័រ វីឡា"
        },
        {
            "barcode": "BBWS180201096",
            "dpc": "03014241201",
            "name": "ថា វុទ្ធី"
        },
        {
            "barcode": "BBWS180201097",
            "dpc": "03014241401",
            "name": "ឃឹម សំណុម"
        },
        {
            "barcode": "BBWS180201098",
            "dpc": "03014241501",
            "name": "អឿ ណាន់"
        },
        {
            "barcode": "BBWS180201099",
            "dpc": "03014241601",
            "name": "អ៊ុន សុផាត"
        },
        {
            "barcode": "BBWS180201100",
            "dpc": "03014241701",
            "name": "ហម ថារី"
        },
        {
            "barcode": "BBWS180201101",
            "dpc": "03014241801",
            "name": "ពៅ លក្ខិណា"
        },
        {
            "barcode": "BBWS180201102",
            "dpc": "03014241901",
            "name": "ហូ ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180201103",
            "dpc": "03014242001",
            "name": "អែវ សុជា"
        },
        {
            "barcode": "BBWS180201104",
            "dpc": "03014242101",
            "name": "សឿម វណ្ណី"
        },
        {
            "barcode": "BBWS180201105",
            "dpc": "03014242201",
            "name": "សេក សៀង"
        },
        {
            "barcode": "BBWS180201106",
            "dpc": "03014242301",
            "name": "ជួប ស៊ីដា"
        },
        {
            "barcode": "BBWS180201107",
            "dpc": "03014242401",
            "name": "ប៉ូយ ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180201108",
            "dpc": "03014242501",
            "name": "ឈើយ ឆុន"
        },
        {
            "barcode": "BBWS180201109",
            "dpc": "03014242601",
            "name": "ថា វុទ្ធូ"
        },
        {
            "barcode": "BBWS180201110",
            "dpc": "03014242701",
            "name": "គង ណូ"
        },
        {
            "barcode": "BBWS180201111",
            "dpc": "03014244901",
            "name": "សាន វាសនា"
        },
        {
            "barcode": "BBWS180201112",
            "dpc": "03014242801",
            "name": "សឿម សំណាង"
        },
        {
            "barcode": "BBWS180201113",
            "dpc": "03014242901",
            "name": "សុ លី"
        },
        {
            "barcode": "BBWS180201114",
            "dpc": "03014243001",
            "name": "ទន់ ស៊ាម"
        },
        {
            "barcode": "BBWS180201115",
            "dpc": "03014243101",
            "name": "ជូ ធីនី"
        },
        {
            "barcode": "BBWS180201116",
            "dpc": "03014243201",
            "name": "យិន វង់"
        },
        {
            "barcode": "BBWS180201117",
            "dpc": "03014243301",
            "name": "រុន រ៉ា"
        },
        {
            "barcode": "BBWS180201118",
            "dpc": "03014243401",
            "name": "ឈឿន សុខឃឿន"
        },
        {
            "barcode": "BBWS180201119",
            "dpc": "03014243501",
            "name": "សោម វិត"
        },
        {
            "barcode": "BBWS180201120",
            "dpc": "03014243701",
            "name": "ទួត សុខន"
        },
        {
            "barcode": "BBWS180201121",
            "dpc": "03014243801",
            "name": "ស្រី រ័ត្ន"
        },
        {
            "barcode": "BBWS180201122",
            "dpc": "03014243901",
            "name": "ឃីម សោភ័ណ្ឌ"
        },
        {
            "barcode": "BBWS180201123",
            "dpc": "03014245001",
            "name": "ឌួង សោភ័ណ្ឌ"
        },
        {
            "barcode": "BBWS180201124",
            "dpc": "03014245101",
            "name": "ឆម ឆវី"
        },
        {
            "barcode": "BBWS180201125",
            "dpc": "03014245201",
            "name": "លឿម សំខាន់"
        },
        {
            "barcode": "BBWS180201126",
            "dpc": "03014245301",
            "name": "ប៉េង តុលា"
        },
        {
            "barcode": "BBWS180201127",
            "dpc": "03014245401",
            "name": "ឃួន កំសាន"
        },
        {
            "barcode": "BBWS180201128",
            "dpc": "03014245501",
            "name": "ពៅ ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180201129",
            "dpc": "03014245601",
            "name": "បាន ម៉ី"
        },
        {
            "barcode": "BBWS180201130",
            "dpc": "03014245701",
            "name": "ឆាន សាវន"
        },
        {
            "barcode": "BBWS180201131",
            "dpc": "03014245801",
            "name": "ប៉ាត ភូម៉ារិទ្ធ"
        },
        {
            "barcode": "BBWS180201132",
            "dpc": "03014248001",
            "name": "ឈាង គង់"
        },
        {
            "barcode": "BBWS180201133",
            "dpc": "03014247901",
            "name": "សុខ ម៉ាណែត"
        },
        {
            "barcode": "BBWS180201134",
            "dpc": "03014247801",
            "name": "ប៉ែន ណារី"
        },
        {
            "barcode": "BBWS180201135",
            "dpc": "03014247701",
            "name": "ប៉ិច ស៊ីណា"
        },
        {
            "barcode": "BBWS180201136",
            "dpc": "03014245901",
            "name": "អឿ សុដានី"
        },
        {
            "barcode": "BBWS180201137",
            "dpc": "03014246001",
            "name": "ផ្លែក នី"
        },
        {
            "barcode": "BBWS180201138",
            "dpc": "03014247601",
            "name": "អ៊ាប ហុកលី"
        },
        {
            "barcode": "BBWS180201139",
            "dpc": "03014247501",
            "name": "លាង ហេង"
        },
        {
            "barcode": "BBWS180201140",
            "dpc": "03014246201",
            "name": "ម៉ៃ ចិន្តា"
        },
        {
            "barcode": "BBWS180201141",
            "dpc": "03014246301",
            "name": "វិន ឈៀប"
        },
        {
            "barcode": "BBWS180201142",
            "dpc": "03014247401",
            "name": "ងួន រ៉ានី"
        },
        {
            "barcode": "BBWS180201143",
            "dpc": "03014246401",
            "name": "វិន អ៊ាន"
        },
        {
            "barcode": "BBWS180201144",
            "dpc": "03014246501",
            "name": "សារ៉ាន ផារ៉ាត់"
        },
        {
            "barcode": "BBWS180201145",
            "dpc": "03014247301",
            "name": "ទេស សារឿន"
        },
        {
            "barcode": "BBWS180201146",
            "dpc": "03014246601",
            "name": "ឆុន សុភាន់"
        },
        {
            "barcode": "BBWS180201147",
            "dpc": "03014246701",
            "name": "សុខ ឆន"
        },
        {
            "barcode": "BBWS180201148",
            "dpc": "03014247201",
            "name": "សុខ ប៊ុណារី"
        },
        {
            "barcode": "BBWS180201149",
            "dpc": "03014246801",
            "name": "ចេវ ថាវី"
        },
        {
            "barcode": "BBWS180201150",
            "dpc": "03014246901",
            "name": "តាំង សូសិលា"
        },
        {
            "barcode": "BBWS180201151",
            "dpc": "03014247101",
            "name": "ជុំ សូនីតា"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
