let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=
    [
        {
            "barcode": "BBWS180204111",
            "dpc": "03024300101",
            "name": "កែម រតនា"
        },
        {
            "barcode": "BBWS180204112",
            "dpc": "03024300201",
            "name": "ស៊ិន សុទ្ធ"
        },
        {
            "barcode": "BBWS180204113",
            "dpc": "03024300301",
            "name": "តុក ស៊ីវគៀង"
        },
        {
            "barcode": "BBWS180204114",
            "dpc": "03024300401",
            "name": "ទាវ កៅ"
        },
        {
            "barcode": "BBWS180204115",
            "dpc": "03024300501",
            "name": "ឡុង ស៊ាងអេន"
        },
        {
            "barcode": "BBWS180204116",
            "dpc": "03024300601",
            "name": "ជៀម រ៉ាន់"
        },
        {
            "barcode": "BBWS180204117",
            "dpc": "03024300701",
            "name": "យីវ វណ្ណ:"
        },
        {
            "barcode": "BBWS180204118",
            "dpc": "03024300801",
            "name": "ប៊ូ ពេជ្រ"
        },
        {
            "barcode": "BBWS180204119",
            "dpc": "03024300901",
            "name": "ឈឺន សារឿន"
        },
        {
            "barcode": "BBWS180204120",
            "dpc": "03024301001",
            "name": "សឿន កុសល់"
        },
        {
            "barcode": "BBWS180204121",
            "dpc": "03024301101",
            "name": "ងូន ភា"
        },
        {
            "barcode": "BBWS180204122",
            "dpc": "03024301201",
            "name": "អ៊ុំ ឡុញ"
        },
        {
            "barcode": "BBWS180204123",
            "dpc": "03024301301",
            "name": "ប៊ូ ម៉ាច"
        },
        {
            "barcode": "BBWS180204124",
            "dpc": "03024301501",
            "name": "សូត្រ សង"
        },
        {
            "barcode": "BBWS180204125",
            "dpc": "03024301601",
            "name": "ស៊ុប ម៉ាន"
        },
        {
            "barcode": "BBWS180204126",
            "dpc": "03024301701",
            "name": "ស្រី យ៉ាត"
        },
        {
            "barcode": "BBWS180204127",
            "dpc": "03024301801",
            "name": "ម៉ម សុផា"
        },
        {
            "barcode": "BBWS180204128",
            "dpc": "03024301901",
            "name": "សៅ វឿត"
        },
        {
            "barcode": "BBWS180204129",
            "dpc": "03024302001",
            "name": "ហ៊ុន ធីម"
        },
        {
            "barcode": "BBWS180204130",
            "dpc": "03024302101",
            "name": "វ៉ន សុវណ្ណ"
        },
        {
            "barcode": "BBWS180204131",
            "dpc": "03024302201",
            "name": "ភាជ សុខុម"
        },
        {
            "barcode": "BBWS180204132",
            "dpc": "03024302301",
            "name": "មឿក សុភា"
        },
        {
            "barcode": "BBWS180204133",
            "dpc": "03024302401",
            "name": "មាស សាម៉ុន"
        },
        {
            "barcode": "BBWS180204134",
            "dpc": "03024302501",
            "name": "សុះ ហុង"
        },
        {
            "barcode": "BBWS180204135",
            "dpc": "03024302801",
            "name": "ផាត់ ទីម៉ាស"
        },
        {
            "barcode": "BBWS180204136",
            "dpc": "03024302901",
            "name": "អួន ឡាត់"
        },
        {
            "barcode": "BBWS180204137",
            "dpc": "03024303001",
            "name": "លី ទូច"
        },
        {
            "barcode": "BBWS180204138",
            "dpc": "03024303101",
            "name": "សូន សារិន"
        },
        {
            "barcode": "BBWS180204139",
            "dpc": "03024303301",
            "name": "លី ឡាយ"
        },
        {
            "barcode": "BBWS180204140",
            "dpc": "03024303401",
            "name": "ឡម ផាន"
        },
        {
            "barcode": "BBWS180204141",
            "dpc": "03024303701",
            "name": "ចាន់ សុផាវី"
        },
        {
            "barcode": "BBWS180204142",
            "dpc": "03024303801",
            "name": "ប៉ិច ផាន"
        },
        {
            "barcode": "BBWS180204143",
            "dpc": "03024303901",
            "name": "ប៉ិច សួស"
        },
        {
            "barcode": "BBWS180204144",
            "dpc": "03024304001",
            "name": "ភួង អឿន"
        },
        {
            "barcode": "BBWS180204145",
            "dpc": "03024304101",
            "name": "គីម សំអុល"
        },
        {
            "barcode": "BBWS180204146",
            "dpc": "03024304201",
            "name": "សំរិទ្ធ លុច"
        },
        {
            "barcode": "BBWS180204147",
            "dpc": "03024304301",
            "name": "វី រ៉ាវ៉ាត់"
        },
        {
            "barcode": "BBWS180204148",
            "dpc": "03024304401",
            "name": "យ័ន ណាត"
        },
        {
            "barcode": "BBWS180204149",
            "dpc": "03024304501",
            "name": "សាន់ ស៊ីន"
        },
        {
            "barcode": "BBWS180204150",
            "dpc": "03024304601",
            "name": "រីម លន់"
        },
        {
            "barcode": "BBWS180204151",
            "dpc": "03024304701",
            "name": "ផាន់ អ៊ីសើ"
        },
        {
            "barcode": "BBWS180204152",
            "dpc": "03024304801",
            "name": "ស៊ិន សុខា"
        },
        {
            "barcode": "BBWS180204153",
            "dpc": "03024304901",
            "name": "នឹម ចំណាន"
        },
        {
            "barcode": "BBWS180204154",
            "dpc": "03024305001",
            "name": "រុន វុទ្ទី"
        },
        {
            "barcode": "BBWS180204155",
            "dpc": "03024305101",
            "name": "ណុម រ៉េត"
        },
        {
            "barcode": "BBWS180204156",
            "dpc": "03024305201",
            "name": "ឈិន ឡា"
        },
        {
            "barcode": "BBWS180204157",
            "dpc": "03024305301",
            "name": "ជា សំហុន"
        },
        {
            "barcode": "BBWS180204158",
            "dpc": "03024305401",
            "name": "សេង រីហ៊"
        },
        {
            "barcode": "BBWS180204159",
            "dpc": "03024305501",
            "name": "ភឿក រ៉ាត"
        },
        {
            "barcode": "BBWS180204160",
            "dpc": "03024305601",
            "name": "លួត ចាន់ថុល"
        },
        {
            "barcode": "BBWS180204161",
            "dpc": "03024305701",
            "name": "សុត ស៊ីណា"
        },
        {
            "barcode": "BBWS180204162",
            "dpc": "03024305801",
            "name": "សឿន សំអាន"
        },
        {
            "barcode": "BBWS180204163",
            "dpc": "03024305901",
            "name": "រឿម មុំ"
        },
        {
            "barcode": "BBWS180204164",
            "dpc": "03024306001",
            "name": "ខែក ឡាង"
        },
        {
            "barcode": "BBWS180204165",
            "dpc": "03024306101",
            "name": "ភាជ ឈាន"
        },
        {
            "barcode": "BBWS180204166",
            "dpc": "03024306201",
            "name": "តូច វួចហួយ"
        },
        {
            "barcode": "BBWS180204167",
            "dpc": "03024306301",
            "name": "ថាវ ឌឿក"
        },
        {
            "barcode": "BBWS180204168",
            "dpc": "03024306401",
            "name": "ផាន់ ប៊ុនធួន"
        },
        {
            "barcode": "BBWS180204169",
            "dpc": "03024306501",
            "name": "ផាន សុភា"
        },
        {
            "barcode": "BBWS180204170",
            "dpc": "03024306601",
            "name": "ឈន ឆាន"
        },
        {
            "barcode": "BBWS180204171",
            "dpc": "03024306701",
            "name": "ប៊ុត សាម៉េត"
        },
        {
            "barcode": "BBWS180204172",
            "dpc": "03024306801",
            "name": "ឈិន កក្កដា"
        },
        {
            "barcode": "BBWS180204173",
            "dpc": "03024306901",
            "name": "មាន មឿត"
        },
        {
            "barcode": "BBWS180204174",
            "dpc": "03024307001",
            "name": "រ៉ាត់ ចិត្រា"
        },
        {
            "barcode": "BBWS180204175",
            "dpc": "03024307101",
            "name": "ផេង សុធា"
        },
        {
            "barcode": "BBWS180204176",
            "dpc": "03024307201",
            "name": "ហម លាភី"
        },
        {
            "barcode": "BBWS180204177",
            "dpc": "03024307301",
            "name": "ហម សេដា"
        },
        {
            "barcode": "BBWS180204178",
            "dpc": "03024307401",
            "name": "ប៊ួ រ៉ាធីម"
        },
        {
            "barcode": "BBWS180204179",
            "dpc": "03024307501",
            "name": "ម៉ុត ស្រីរដ្ឋ"
        },
        {
            "barcode": "BBWS180204180",
            "dpc": "03024307601",
            "name": "ភា កញ្ញា"
        },
        {
            "barcode": "BBWS180204181",
            "dpc": "03024307701",
            "name": "ផ្ទះលេខ215"
        },
        {
            "barcode": "BBWS180204182",
            "dpc": "03024307801",
            "name": "ផ្ទះលេខ214"
        },
        {
            "barcode": "BBWS180204183",
            "dpc": "03024307901",
            "name": "ផ្ទះលេខ139"
        },
        {
            "barcode": "BBWS180204184",
            "dpc": "03024308001",
            "name": "ម៉ាលីស"
        },
        {
            "barcode": "BBWS180204185",
            "dpc": "03024308101",
            "name": "ឡោះ យ៉ាស់"
        },
        {
            "barcode": "BBWS180204186",
            "dpc": "03024308301",
            "name": "សាន សោភា"
        },
        {
            "barcode": "BBWS180204187",
            "dpc": "03024308401",
            "name": "ហម សុជាតិ"
        },
        {
            "barcode": "BBWS180204188",
            "dpc": "03024308501",
            "name": "ប៊ុន សុវណ្ណ"
        },
        {
            "barcode": "BBWS180204189",
            "dpc": "03024308601",
            "name": "អឹម ប៊ីន"
        },
        {
            "barcode": "BBWS180204190",
            "dpc": "03024308701",
            "name": "ទ្រិញ សម្បត្តិ"
        },
        {
            "barcode": "BBWS180204191",
            "dpc": "03024308801",
            "name": "ឆាយ បូរ៉ាទីន"
        },
        {
            "barcode": "BBWS180204192",
            "dpc": "03024308901",
            "name": "ឌឹម រិទ្ធិ"
        },
        {
            "barcode": "BBWS180204193",
            "dpc": "03024309001",
            "name": "ចាន់ ផល្លា"
        },
        {
            "barcode": "BBWS180204194",
            "dpc": "03024309101",
            "name": "ឈុន សាន"
        },
        {
            "barcode": "BBWS180204195",
            "dpc": "03024309201",
            "name": "បាន ឡង២"
        },
        {
            "barcode": "BBWS180204196",
            "dpc": "03024309301",
            "name": "ម៉ៅ សារ៉ាវុធ"
        },
        {
            "barcode": "BBWS180204197",
            "dpc": "03024309401",
            "name": "ហ៊ីង គីរីរ័ត្ន"
        },
        {
            "barcode": "BBWS180204198",
            "dpc": "03024309601",
            "name": "សំរិត ការទ័រ"
        },
        {
            "barcode": "BBWS180204199",
            "dpc": "03024309801",
            "name": "ជឺ តុងសួរ"
        },
        {
            "barcode": "BBWS180204200",
            "dpc": "03024309901",
            "name": "ទ័រ វ៉ាន់២"
        },
        {
            "barcode": "BBWS180204201",
            "dpc": "03024310101",
            "name": "អ៊ុក គឹមហ៊ុន"
        },
        {
            "barcode": "BBWS180204202",
            "dpc": "03024310201",
            "name": "ហេង សុផា"
        },
        {
            "barcode": "BBWS180204203",
            "dpc": "03024310301",
            "name": "ឡុង រ័ត្នមុន្នី"
        },
        {
            "barcode": "BBWS180204204",
            "dpc": "03024310401",
            "name": "នូន ផល្លី"
        },
        {
            "barcode": "BBWS180204205",
            "dpc": "03024310501",
            "name": "ហេង លី"
        },
        {
            "barcode": "BBWS180204206",
            "dpc": "03024310601",
            "name": "សុខ ចំរើន"
        },
        {
            "barcode": "BBWS180204207",
            "dpc": "03024310701",
            "name": "ម៉ក់ ចំណាន"
        },
        {
            "barcode": "BBWS180204208",
            "dpc": "03024310801",
            "name": "ហូរ ទិត្យ"
        },
        {
            "barcode": "BBWS180204209",
            "dpc": "03024311001",
            "name": "ភួ ហុកហ៊ី១"
        },
        {
            "barcode": "BBWS180204210",
            "dpc": "03024311101",
            "name": "ភួ ហុកហ៊ី២"
        },
        {
            "barcode": "BBWS180204211",
            "dpc": "03024311301",
            "name": "ផាត សុផានិត"
        },
        {
            "barcode": "BBWS180204212",
            "dpc": "03024311401",
            "name": "សាយ ស៊ីណា"
        },
        {
            "barcode": "BBWS180204213",
            "dpc": "03024311501",
            "name": "សៅ ឆម"
        },
        {
            "barcode": "BBWS180204214",
            "dpc": "03024311601",
            "name": "ឈាង សារ៉ន"
        },
        {
            "barcode": "BBWS180204215",
            "dpc": "03024311701",
            "name": "ជា កែវ"
        },
        {
            "barcode": "BBWS180204216",
            "dpc": "03024311801",
            "name": "នួន បុប្ភា"
        },
        {
            "barcode": "BBWS180204217",
            "dpc": "03024311901",
            "name": "អ៊ុន ចន្ថា"
        },
        {
            "barcode": "BBWS180204218",
            "dpc": "03024312001",
            "name": "អឿន គីមសេង"
        },
        {
            "barcode": "BBWS180204219",
            "dpc": "03024312101",
            "name": "គង់ ថេត"
        },
        {
            "barcode": "BBWS180204220",
            "dpc": "03024312201",
            "name": "ច័ន្ទ ដារ៉ា"
        },
        {
            "barcode": "BBWS180204221",
            "dpc": "03024312301",
            "name": "សេង ឡេង"
        },
        {
            "barcode": "BBWS180204222",
            "dpc": "03024312401",
            "name": "សាំ ប៊ី"
        },
        {
            "barcode": "BBWS180204223",
            "dpc": "03024312501",
            "name": "ដួង សុភ័ក្រ"
        },
        {
            "barcode": "BBWS180204224",
            "dpc": "03024312601",
            "name": "គង់ សារ៉េត"
        },
        {
            "barcode": "BBWS180204225",
            "dpc": "03024312701",
            "name": "នាង នីម"
        },
        {
            "barcode": "BBWS180204226",
            "dpc": "03024312801",
            "name": "គី ជិនតូ"
        },
        {
            "barcode": "BBWS180204227",
            "dpc": "03024312901",
            "name": "ផាន់ វុទ្ទី"
        },
        {
            "barcode": "BBWS180204228",
            "dpc": "03024313001",
            "name": "ជា វន្ថា"
        },
        {
            "barcode": "BBWS180204229",
            "dpc": "03024313101",
            "name": "យាន យុន"
        },
        {
            "barcode": "BBWS180204230",
            "dpc": "03024313201",
            "name": "រ៉ាត សុភ័ក"
        },
        {
            "barcode": "BBWS180204231",
            "dpc": "03024313301",
            "name": "ធឿន ចេក"
        },
        {
            "barcode": "BBWS180204232",
            "dpc": "03024313501",
            "name": "ជា យ៉ាន"
        },
        {
            "barcode": "BBWS180204233",
            "dpc": "03024313601",
            "name": "ម៉ៅ ឡា"
        },
        {
            "barcode": "BBWS180204234",
            "dpc": "03024313701",
            "name": "ពត សុខេន"
        },
        {
            "barcode": "BBWS180204235",
            "dpc": "03024313801",
            "name": "វឹង រ័ត្ន"
        },
        {
            "barcode": "BBWS180204236",
            "dpc": "03024313901",
            "name": "ចាន់ ត្រា"
        },
        {
            "barcode": "BBWS180204237",
            "dpc": "03024314001",
            "name": "កប គិន"
        },
        {
            "barcode": "BBWS180204238",
            "dpc": "03024314101",
            "name": "ឌី សួរ"
        },
        {
            "barcode": "BBWS180204239",
            "dpc": "03024314201",
            "name": "ភី ជន"
        },
        {
            "barcode": "BBWS180204240",
            "dpc": "03024314301",
            "name": "យ៉ៅ វ៉ា"
        },
        {
            "barcode": "BBWS180204241",
            "dpc": "03024314401",
            "name": "យ៉ៅ អូន"
        },
        {
            "barcode": "BBWS180204242",
            "dpc": "03024314601",
            "name": "ទូច ព្រឿន"
        },
        {
            "barcode": "BBWS180204243",
            "dpc": "03024314701",
            "name": "ទី"
        },
        {
            "barcode": "BBWS180204244",
            "dpc": "03024314801",
            "name": "គី សុជាតិ"
        },
        {
            "barcode": "BBWS180204245",
            "dpc": "03024314901",
            "name": "ឡេង ណាល់"
        },
        {
            "barcode": "BBWS180204246",
            "dpc": "03024315001",
            "name": "គី សាវិញ"
        },
        {
            "barcode": "BBWS180204247",
            "dpc": "03024315101",
            "name": "ហុង វណ្ណដេត"
        },
        {
            "barcode": "BBWS180204248",
            "dpc": "03024315201",
            "name": "ញ៉េន ញ៉ាវ"
        },
        {
            "barcode": "BBWS180204249",
            "dpc": "03024315301",
            "name": "ហេង គុណ"
        },
        {
            "barcode": "BBWS180204250",
            "dpc": "03024315401",
            "name": "ជុំ សារ័ត្ន"
        },
        {
            "barcode": "BBWS180204251",
            "dpc": "03024315501",
            "name": "ហេង បូរី"
        },
        {
            "barcode": "BBWS180204252",
            "dpc": "03024315601",
            "name": "នី អាន"
        },
        {
            "barcode": "BBWS180204253",
            "dpc": "03024315701",
            "name": "សឺន ម៉ៅ"
        },
        {
            "barcode": "BBWS180204254",
            "dpc": "03024315801",
            "name": "សុខ សុភ័ក្រ"
        },
        {
            "barcode": "BBWS180204255",
            "dpc": "03024315901",
            "name": "ស៊ឹម ពេជ្រ"
        },
        {
            "barcode": "BBWS180204256",
            "dpc": "03024316001",
            "name": "ហ៊ត សុធីណា"
        },
        {
            "barcode": "BBWS180204257",
            "dpc": "03024316101",
            "name": "សេង សុយ៉ាដា"
        },
        {
            "barcode": "BBWS180204258",
            "dpc": "03024316201",
            "name": "អឹម ដារ៉ា"
        },
        {
            "barcode": "BBWS180204259",
            "dpc": "03024316301",
            "name": "ជា សុធាវី"
        },
        {
            "barcode": "BBWS180204260",
            "dpc": "03024316401",
            "name": "មាង ឡែន"
        },
        {
            "barcode": "BBWS180204261",
            "dpc": "03024316501",
            "name": "សេង ប៊ុនសួរ"
        },
        {
            "barcode": "BBWS180204262",
            "dpc": "03024316601",
            "name": "សៅ លឹមស្រៀង"
        },
        {
            "barcode": "BBWS180204263",
            "dpc": "03024316701",
            "name": "ហាប់ គឹមហាក់"
        },
        {
            "barcode": "BBWS180204264",
            "dpc": "03024316801",
            "name": "យ៉ង វណ្ណះ"
        },
        {
            "barcode": "BBWS180204265",
            "dpc": "03024316901",
            "name": "រស់ សុផល"
        },
        {
            "barcode": "BBWS180204266",
            "dpc": "03024317101",
            "name": "ចាន់ ប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180204267",
            "dpc": "03024317201",
            "name": "ហ៊ុច សុវណ្ណ"
        },
        {
            "barcode": "BBWS180204268",
            "dpc": "03024317301",
            "name": "ប៉ិញ ឈាងហាក់"
        },
        {
            "barcode": "BBWS180204269",
            "dpc": "03024317401",
            "name": "កែវ ធានី"
        },
        {
            "barcode": "BBWS180204270",
            "dpc": "03024317501",
            "name": "ផាន់ ស្រស់"
        },
        {
            "barcode": "BBWS180204271",
            "dpc": "03024317601",
            "name": "លឹម លេងអៀង"
        },
        {
            "barcode": "BBWS180204272",
            "dpc": "03024317701",
            "name": "ញ៉ឹម ដារ៉ា"
        },
        {
            "barcode": "BBWS180204273",
            "dpc": "03024317801",
            "name": "តឹក សុផល"
        },
        {
            "barcode": "BBWS180204274",
            "dpc": "03024317901",
            "name": "ប៉ុក ប៊ុន"
        },
        {
            "barcode": "BBWS180204275",
            "dpc": "03024318001",
            "name": "ប៉ិច ភៅ"
        },
        {
            "barcode": "BBWS180204276",
            "dpc": "03024318101",
            "name": "ប៉ុក សុផារី"
        },
        {
            "barcode": "BBWS180204277",
            "dpc": "03024318201",
            "name": "សែ ធារិទ្ធ"
        },
        {
            "barcode": "BBWS180204278",
            "dpc": "03024318301",
            "name": "ចាន់ លាភ"
        },
        {
            "barcode": "BBWS180204279",
            "dpc": "03024318401",
            "name": "សុខ សុវណ្ណរិទ្ធ"
        },
        {
            "barcode": "BBWS180204280",
            "dpc": "03024318501",
            "name": "ឈិន ស"
        },
        {
            "barcode": "BBWS180204281",
            "dpc": "03024318601",
            "name": "ទួន ចំរើន"
        },
        {
            "barcode": "BBWS180204282",
            "dpc": "03024318701",
            "name": "សុខ កុសល់"
        },
        {
            "barcode": "BBWS180204283",
            "dpc": "03024318801",
            "name": "ឆៃ សុភាព"
        },
        {
            "barcode": "BBWS180204284",
            "dpc": "03024318901",
            "name": "អ៊ួក រ៉េន"
        },
        {
            "barcode": "BBWS180204285",
            "dpc": "03024319001",
            "name": "លី ខន"
        },
        {
            "barcode": "BBWS180204286",
            "dpc": "03024319101",
            "name": "សុខ ពឿន"
        },
        {
            "barcode": "BBWS180204287",
            "dpc": "03024319201",
            "name": "គឹម ហ៊ុន"
        },
        {
            "barcode": "BBWS180204288",
            "dpc": "03024319301",
            "name": "ឆម សាង"
        },
        {
            "barcode": "BBWS180204289",
            "dpc": "03024319401",
            "name": "សេក សាលី"
        },
        {
            "barcode": "BBWS180204290",
            "dpc": "03024319501",
            "name": "ជ័យ វណ្ណី"
        },
        {
            "barcode": "BBWS180204291",
            "dpc": "03024319601",
            "name": "អ៊ឹម និល"
        },
        {
            "barcode": "BBWS180204292",
            "dpc": "03024319801",
            "name": "ជួន ស៊ីវន្ថា"
        },
        {
            "barcode": "BBWS180204293",
            "dpc": "03024320001",
            "name": "គង់ ទ្រី"
        },
        {
            "barcode": "BBWS180204294",
            "dpc": "03024320101",
            "name": "សុខ នា"
        },
        {
            "barcode": "BBWS180204295",
            "dpc": "03024320201",
            "name": "ក្នាន សម្ផស្ស"
        },
        {
            "barcode": "BBWS180204296",
            "dpc": "03024320301",
            "name": "តឹក សារ៉េត"
        },
        {
            "barcode": "BBWS180204297",
            "dpc": "03024320401",
            "name": "ចិន ឡៃប៉ាល់"
        },
        {
            "barcode": "BBWS180204298",
            "dpc": "03024320501",
            "name": "ឆេង លី"
        },
        {
            "barcode": "BBWS180204299",
            "dpc": "03024320601",
            "name": "រ៉ុម វណ្ណា"
        },
        {
            "barcode": "BBWS180204300",
            "dpc": "03024320701",
            "name": "ឯក សុផល"
        },
        {
            "barcode": "BBWS180204301",
            "dpc": "03024320801",
            "name": "ហេង ហោ"
        },
        {
            "barcode": "BBWS180204302",
            "dpc": "03024320901",
            "name": "ម៉ែត ពេញ"
        },
        {
            "barcode": "BBWS180204303",
            "dpc": "03024321001",
            "name": "ឈឿម សុភាព"
        },
        {
            "barcode": "BBWS180204304",
            "dpc": "03024321101",
            "name": "ហួន សាយ័ន្ត"
        },
        {
            "barcode": "BBWS180204305",
            "dpc": "03024321201",
            "name": "តាំង សុខអេង"
        },
        {
            "barcode": "BBWS180204306",
            "dpc": "03024321301",
            "name": "ចាន់ ធឿន"
        },
        {
            "barcode": "BBWS180204307",
            "dpc": "03024321401",
            "name": "រឿន សុឃឿន"
        },
        {
            "barcode": "BBWS180204308",
            "dpc": "03024321501",
            "name": "ម៉ៅ វុទ្ធី"
        },
        {
            "barcode": "BBWS180204309",
            "dpc": "03024321601",
            "name": "រ័ត្ន ស៊ុននារី"
        },
        {
            "barcode": "BBWS180204310",
            "dpc": "03024321701",
            "name": "សៅ ឈី"
        },
        {
            "barcode": "BBWS180204311",
            "dpc": "03024321801",
            "name": "នី សំអាត"
        },
        {
            "barcode": "BBWS180204312",
            "dpc": "03024321901",
            "name": "ស៊ីម ស៊ីន"
        },
        {
            "barcode": "BBWS180204313",
            "dpc": "03024322001",
            "name": "សុខ សំ"
        },
        {
            "barcode": "BBWS180204314",
            "dpc": "03024322201",
            "name": "រស់ ហាន"
        },
        {
            "barcode": "BBWS180204315",
            "dpc": "03024322301",
            "name": "រស់ ហៀង"
        },
        {
            "barcode": "BBWS180204316",
            "dpc": "03024322401",
            "name": "យិន កុសល់"
        },
        {
            "barcode": "BBWS180204317",
            "dpc": "03024322501",
            "name": "យិន ផា"
        },
        {
            "barcode": "BBWS180204318",
            "dpc": "03024322601",
            "name": "ហៀក គ្រី"
        },
        {
            "barcode": "BBWS180204319",
            "dpc": "03024322701",
            "name": "ជា សឿន"
        },
        {
            "barcode": "BBWS180204320",
            "dpc": "03024322801",
            "name": "ប៊ុន លី"
        },
        {
            "barcode": "BBWS180204321",
            "dpc": "03024323001",
            "name": "លិម ផៃអេង"
        },
        {
            "barcode": "BBWS180204322",
            "dpc": "03024323101",
            "name": "ម៉ក់ សុឆេប"
        },
        {
            "barcode": "BBWS180204323",
            "dpc": "03024323201",
            "name": "តូច សារិទ្ធ"
        },
        {
            "barcode": "BBWS180204324",
            "dpc": "03024323301",
            "name": "ជា សុបិន"
        },
        {
            "barcode": "BBWS180204325",
            "dpc": "03024323401",
            "name": "បៀន ប៉ាក់"
        },
        {
            "barcode": "BBWS180204326",
            "dpc": "03024323501",
            "name": "គីម លី"
        },
        {
            "barcode": "BBWS180204327",
            "dpc": "03024323601",
            "name": "ចេវ នាង"
        },
        {
            "barcode": "BBWS180204328",
            "dpc": "03024323701",
            "name": "ប៉ូច វឌ្ឍនា"
        },
        {
            "barcode": "BBWS180204329",
            "dpc": "03024323801",
            "name": "ទឹម សុភា"
        },
        {
            "barcode": "BBWS180204330",
            "dpc": "03024323901",
            "name": "អ៊ុយ ឈាន"
        },
        {
            "barcode": "BBWS180204331",
            "dpc": "03024324001",
            "name": "ភោគ សុភី"
        },
        {
            "barcode": "BBWS180204332",
            "dpc": "03024324101",
            "name": "ហេង បូរ៉ា"
        },
        {
            "barcode": "BBWS180204333",
            "dpc": "03024324201",
            "name": "ម៉ែន សារិន"
        },
        {
            "barcode": "BBWS180204334",
            "dpc": "03024324301",
            "name": "ផេង សុភា"
        },
        {
            "barcode": "BBWS180204335",
            "dpc": "03024324401",
            "name": "លី សុខា"
        },
        {
            "barcode": "BBWS180204336",
            "dpc": "03024324501",
            "name": "ខឹម វណ្ណារី"
        },
        {
            "barcode": "BBWS180204337",
            "dpc": "03024324701",
            "name": "ឡាង ភី"
        },
        {
            "barcode": "BBWS180204338",
            "dpc": "03024324801",
            "name": "ហេង គឹមលាង"
        },
        {
            "barcode": "BBWS180204339",
            "dpc": "03024324901",
            "name": "គឹម ផេងអាន"
        },
        {
            "barcode": "BBWS180204340",
            "dpc": "03024325001",
            "name": "យាន តិ"
        },
        {
            "barcode": "BBWS180204341",
            "dpc": "03024325101",
            "name": "ប៊ូ ម៉ាប់"
        },
        {
            "barcode": "BBWS180204342",
            "dpc": "03024325201",
            "name": "ស្រ៊ាង ស្រីទូច"
        },
        {
            "barcode": "BBWS180204343",
            "dpc": "03024325301",
            "name": "ហាត ហាក់"
        },
        {
            "barcode": "BBWS180204344",
            "dpc": "03024325401",
            "name": "អ៊ុន ឈួន"
        },
        {
            "barcode": "BBWS180204345",
            "dpc": "03024325501",
            "name": "ប៉ិច ម៉ៅ"
        },
        {
            "barcode": "BBWS180204346",
            "dpc": "03024325601",
            "name": "លឹម លីណា"
        },
        {
            "barcode": "BBWS180204347",
            "dpc": "03024325701",
            "name": "អឿន សំអាត"
        },
        {
            "barcode": "BBWS180204348",
            "dpc": "03024325801",
            "name": "សោម ណារិន"
        },
        {
            "barcode": "BBWS180204349",
            "dpc": "03024325901",
            "name": "ប៉ោក ចាន់ថន"
        },
        {
            "barcode": "BBWS180204350",
            "dpc": "03024326001",
            "name": "លិម ឈៀងហួ"
        },
        {
            "barcode": "BBWS180204351",
            "dpc": "03024326101",
            "name": "ណុប ណារ៉ា ៧"
        },
        {
            "barcode": "BBWS180204352",
            "dpc": "03024326201",
            "name": "ហង់ រស់"
        },
        {
            "barcode": "BBWS180204353",
            "dpc": "03024326301",
            "name": "ណុប ណារ៉ា ៨"
        },
        {
            "barcode": "BBWS180204354",
            "dpc": "03024326401",
            "name": "តឿន ពិសាល"
        },
        {
            "barcode": "BBWS180204355",
            "dpc": "03024326501",
            "name": "ឈឿន ញ៉ិល"
        },
        {
            "barcode": "BBWS180204356",
            "dpc": "03024326601",
            "name": "ឡុង សាវ៉េត"
        },
        {
            "barcode": "BBWS180204357",
            "dpc": "03024326701",
            "name": "សំ ដូង ១៧៣"
        },
        {
            "barcode": "BBWS180204358",
            "dpc": "03024326801",
            "name": "ចាន់ គឹមឡេង ១៧២"
        },
        {
            "barcode": "BBWS180204359",
            "dpc": "03024326901",
            "name": "សុខ រ៉ុន"
        },
        {
            "barcode": "BBWS180204360",
            "dpc": "03024327001",
            "name": "សួង កែន"
        },
        {
            "barcode": "BBWS180204361",
            "dpc": "03024327101",
            "name": "មាស សុវណ្ណ"
        },
        {
            "barcode": "BBWS180204362",
            "dpc": "03024327201",
            "name": "យ៉ាក ដៀត"
        },
        {
            "barcode": "BBWS180204363",
            "dpc": "03024327301",
            "name": "មាត់ លី"
        },
        {
            "barcode": "BBWS180204364",
            "dpc": "03024327401",
            "name": "ចាន់ ណៃ"
        },
        {
            "barcode": "BBWS180204365",
            "dpc": "03024327501",
            "name": "ម៉ៅ ឆាន់"
        },
        {
            "barcode": "BBWS180204366",
            "dpc": "03024327601",
            "name": "អ៊ាន វណ្ណេត"
        },
        {
            "barcode": "BBWS180204367",
            "dpc": "03024327701",
            "name": "ពៅ អ៊ីម"
        },
        {
            "barcode": "BBWS180204368",
            "dpc": "03024327801",
            "name": "សៀវ រតនា"
        },
        {
            "barcode": "BBWS180204369",
            "dpc": "03024327901",
            "name": "ចាន់ ស៊ីថា"
        },
        {
            "barcode": "BBWS180204370",
            "dpc": "03024328001",
            "name": "ឯក គេន"
        },
        {
            "barcode": "BBWS180204371",
            "dpc": "03024328101",
            "name": "និច ម៉ានី"
        },
        {
            "barcode": "BBWS180204372",
            "dpc": "03024328201",
            "name": "វិទ្យាល័យដុងបូសូរ"
        },
        {
            "barcode": "BBWS180204373",
            "dpc": "03024328301",
            "name": "ទេព ហ៊ីម"
        },
        {
            "barcode": "BBWS180204374",
            "dpc": "03024328401",
            "name": "ឡាយ ចិន្ដា"
        },
        {
            "barcode": "BBWS180204375",
            "dpc": "03024328501",
            "name": "អ៊ុច យួម"
        },
        {
            "barcode": "BBWS180204376",
            "dpc": "03024328601",
            "name": "ដន ឌី"
        },
        {
            "barcode": "BBWS180204377",
            "dpc": "03024328701",
            "name": "ច័ន្ទ ថា"
        },
        {
            "barcode": "BBWS180204378",
            "dpc": "03024328801",
            "name": "នៅ យុង"
        },
        {
            "barcode": "BBWS180204379",
            "dpc": "03024328901",
            "name": "ស៊ុក វាសនា"
        },
        {
            "barcode": "BBWS180204380",
            "dpc": "03024329001",
            "name": "សួម ចាន់រស្មី"
        },
        {
            "barcode": "BBWS180204381",
            "dpc": "03024329101",
            "name": "ចាន់ សារ៉ន"
        },
        {
            "barcode": "BBWS180204382",
            "dpc": "03024329201",
            "name": "សុខ រ៉ាន់"
        },
        {
            "barcode": "BBWS180204383",
            "dpc": "03024329401",
            "name": "នី សំអាន"
        },
        {
            "barcode": "BBWS180204384",
            "dpc": "03024329501",
            "name": "វ៉ាយ សារ"
        },
        {
            "barcode": "BBWS180204385",
            "dpc": "03024329601",
            "name": "ប៉េង លីគឹមឡាយ"
        },
        {
            "barcode": "BBWS180204386",
            "dpc": "03024329701",
            "name": "ហេង ដួងចន្ថាដាមុនី"
        },
        {
            "barcode": "BBWS180204387",
            "dpc": "03024329801",
            "name": "ឆាយ សុភាព"
        },
        {
            "barcode": "BBWS180204388",
            "dpc": "03024329901",
            "name": "ជា សុខគង់"
        },
        {
            "barcode": "BBWS180204389",
            "dpc": "03024330001",
            "name": "ប៉ូ រ៉ោស៊ីហាស់"
        },
        {
            "barcode": "BBWS180204390",
            "dpc": "03024330101",
            "name": "សួស ឆិន"
        },
        {
            "barcode": "BBWS180204391",
            "dpc": "03024330201",
            "name": "អាត់ សាឌី"
        },
        {
            "barcode": "BBWS180204392",
            "dpc": "03024330301",
            "name": "ឆឹង ឆុន"
        },
        {
            "barcode": "BBWS180204393",
            "dpc": "03024330401",
            "name": "លឿត លឿប"
        },
        {
            "barcode": "BBWS180204394",
            "dpc": "03024330601",
            "name": "ខេង ហឿន"
        },
        {
            "barcode": "BBWS180204395",
            "dpc": "03024330701",
            "name": "ង៉ែត វ៉ាន់នី"
        },
        {
            "barcode": "BBWS180204396",
            "dpc": "03024330801",
            "name": "ម៉ៅ ច័ន្ទដាណា"
        },
        {
            "barcode": "BBWS180204397",
            "dpc": "03024330901",
            "name": "តូ សេង ២"
        },
        {
            "barcode": "BBWS180204398",
            "dpc": "03024331001",
            "name": "ច្រែង ឌូវ៉ាន់"
        },
        {
            "barcode": "BBWS180204399",
            "dpc": "03024331101",
            "name": "មេ អូន"
        },
        {
            "barcode": "BBWS180204400",
            "dpc": "03024331201",
            "name": "ឡាង ហឿន"
        },
        {
            "barcode": "BBWS180204401",
            "dpc": "03024331301",
            "name": "ក្លឹង បាន់នឿត"
        },
        {
            "barcode": "BBWS180204402",
            "dpc": "03024331401",
            "name": "គឹម ចាន់ធី"
        },
        {
            "barcode": "BBWS180204403",
            "dpc": "03024331501",
            "name": "ស័រ សំណាង"
        },
        {
            "barcode": "BBWS180204404",
            "dpc": "03024331601",
            "name": "ឡោ អ៊ិតលៀ"
        },
        {
            "barcode": "BBWS180204405",
            "dpc": "03024331701",
            "name": "ភី សុខ"
        },
        {
            "barcode": "BBWS180204406",
            "dpc": "03024331801",
            "name": "ង៉ូវ សុខ"
        },
        {
            "barcode": "BBWS180204407",
            "dpc": "03024331901",
            "name": "សោម ណាវី"
        },
        {
            "barcode": "BBWS180204408",
            "dpc": "03024332001",
            "name": "ភួ ពុយ"
        },
        {
            "barcode": "BBWS180204409",
            "dpc": "03024332101",
            "name": "ហេង យាន"
        },
        {
            "barcode": "BBWS180204410",
            "dpc": "03024332201",
            "name": "សាន ពលៈ"
        },
        {
            "barcode": "BBWS180204411",
            "dpc": "03024302601",
            "name": "ស៊ីវ សុផល"
        },
        {
            "barcode": "BBWS180204412",
            "dpc": "03024302701",
            "name": "ឃឿប បូរិន"
        },
        {
            "barcode": "BBWS180204413",
            "dpc": "03024332301",
            "name": "សាឯម ពិសី"
        },
        {
            "barcode": "BBWS180204414",
            "dpc": "03024332401",
            "name": "អ៊ុត លាក់"
        },
        {
            "barcode": "BBWS180204415",
            "dpc": "03024332501",
            "name": "អ៊ុត សុឃឿប"
        },
        {
            "barcode": "BBWS180204416",
            "dpc": "03024332601",
            "name": "ក្រង ភារិន"
        },
        {
            "barcode": "BBWS180204417",
            "dpc": "03024332701",
            "name": "អៀង សុផារ៉ា ១"
        },
        {
            "barcode": "BBWS180204418",
            "dpc": "03024332801",
            "name": "អៀង សុផារ៉ា ២"
        },
        {
            "barcode": "BBWS180204419",
            "dpc": "03024332901",
            "name": "អៀង សុផារ៉ា ៣"
        },
        {
            "barcode": "BBWS180204420",
            "dpc": "03024333001",
            "name": "ណុប ស៊ីដារ៉ា"
        },
        {
            "barcode": "BBWS180204421",
            "dpc": "03024333101",
            "name": "ឃួន ជីឡាំ"
        },
        {
            "barcode": "BBWS180204422",
            "dpc": "03024333201",
            "name": "រឿង យ៉ាណូ"
        },
        {
            "barcode": "BBWS180204423",
            "dpc": "03024333301",
            "name": "យ៉ែម យឿត"
        },
        {
            "barcode": "BBWS180204424",
            "dpc": "03024333401",
            "name": "ទន់ ដា"
        },
        {
            "barcode": "BBWS180204425",
            "dpc": "03024333501",
            "name": "ពៅ សុជាតិ"
        },
        {
            "barcode": "BBWS180204426",
            "dpc": "03024333601",
            "name": "ឆាយ ឡេង"
        },
        {
            "barcode": "BBWS180204427",
            "dpc": "03024333701",
            "name": "សុខ មាន"
        },
        {
            "barcode": "BBWS180204428",
            "dpc": "03024333801",
            "name": "ជា តៃស៊ីន"
        },
        {
            "barcode": "BBWS180204429",
            "dpc": "03024333901",
            "name": "វ៉ាន់ សុត្រា"
        },
        {
            "barcode": "BBWS180204430",
            "dpc": "03024334001",
            "name": "អុំ ណារ៉ន"
        },
        {
            "barcode": "BBWS180204431",
            "dpc": "03024334101",
            "name": "រស់ វ៉ារីណ្ណា"
        },
        {
            "barcode": "BBWS180204432",
            "dpc": "03024334201",
            "name": "ទា ប៊ុនហ៊ាង"
        },
        {
            "barcode": "BBWS180204433",
            "dpc": "03024334301",
            "name": "ឈុំ ពុទ្ធិ"
        },
        {
            "barcode": "BBWS180204434",
            "dpc": "03024334401",
            "name": "ប៊ុន លី"
        },
        {
            "barcode": "BBWS180204435",
            "dpc": "03024334501",
            "name": "ហួត គឹមស៊ា"
        },
        {
            "barcode": "BBWS180204436",
            "dpc": "03024334601",
            "name": "សៅ ឆូយ"
        },
        {
            "barcode": "BBWS180204437",
            "dpc": "03024341901",
            "name": "ឈឿន ដាវុធ៥៩"
        },
        {
            "barcode": "BBWS180204438",
            "dpc": "03024334701",
            "name": "វណ្ណ វិទូ"
        },
        {
            "barcode": "BBWS180204439",
            "dpc": "03024334801",
            "name": "ហេង ចន្ធី"
        },
        {
            "barcode": "BBWS180204440",
            "dpc": "03024341801",
            "name": "ប៊ូ ហេមC1"
        },
        {
            "barcode": "BBWS180204441",
            "dpc": "03024334901",
            "name": "ខេង ពៅ"
        },
        {
            "barcode": "BBWS180204442",
            "dpc": "03024341701",
            "name": "ផ្ទះលេខC2"
        },
        {
            "barcode": "BBWS180204443",
            "dpc": "03024335001",
            "name": "សោម លន់"
        },
        {
            "barcode": "BBWS180204444",
            "dpc": "03024335101",
            "name": "អៀង ឆំ"
        },
        {
            "barcode": "BBWS180204445",
            "dpc": "03024335201",
            "name": "ទិត្យ សុផារី"
        },
        {
            "barcode": "BBWS180204446",
            "dpc": "03024335301",
            "name": "សុខ ម៉ាច"
        },
        {
            "barcode": "BBWS180204447",
            "dpc": "03024335401",
            "name": "ទន់ ធន់"
        },
        {
            "barcode": "BBWS180204448",
            "dpc": "03024335501",
            "name": "អ៊ី សាវន្ត"
        },
        {
            "barcode": "BBWS180204449",
            "dpc": "03024335601",
            "name": "យូ ទូច"
        },
        {
            "barcode": "BBWS180204450",
            "dpc": "03024335701",
            "name": "ទូច គង់"
        },
        {
            "barcode": "BBWS180204451",
            "dpc": "03024335801",
            "name": "ម៉ៅ ចាន់ឡន"
        },
        {
            "barcode": "BBWS180204452",
            "dpc": "03024335901",
            "name": "យ៉េន ណារ៉ា"
        },
        {
            "barcode": "BBWS180204453",
            "dpc": "03024336001",
            "name": "ព្លឿង សាវើន"
        },
        {
            "barcode": "BBWS180204454",
            "dpc": "03024336101",
            "name": "ហៀក សាវុធ"
        },
        {
            "barcode": "BBWS180204455",
            "dpc": "03024336201",
            "name": "ចាន់ ឧត្តម"
        },
        {
            "barcode": "BBWS180204456",
            "dpc": "03024336301",
            "name": "ថ្លាង សុឃឿត"
        },
        {
            "barcode": "BBWS180204457",
            "dpc": "03024336401",
            "name": "ចាន់ គឹមលី"
        },
        {
            "barcode": "BBWS180204458",
            "dpc": "03024336501",
            "name": "ឈន សកុណា"
        },
        {
            "barcode": "BBWS180204459",
            "dpc": "03024336601",
            "name": "វិត រស្មី"
        },
        {
            "barcode": "BBWS180204460",
            "dpc": "03024336701",
            "name": "តាត ឡា"
        },
        {
            "barcode": "BBWS180204461",
            "dpc": "03024336801",
            "name": "ខន ឃឺន"
        },
        {
            "barcode": "BBWS180204462",
            "dpc": "03024336901",
            "name": "គង់ សុវណ្ណារ៉េត"
        },
        {
            "barcode": "BBWS180204463",
            "dpc": "03024337101",
            "name": "ឃឿប សៅណាលី"
        },
        {
            "barcode": "BBWS180204464",
            "dpc": "03024341301",
            "name": "ផ្ទះលេខC6"
        },
        {
            "barcode": "BBWS180204465",
            "dpc": "03024341201",
            "name": "ផ្ទះលេខC7"
        },
        {
            "barcode": "BBWS180204466",
            "dpc": "03024341101",
            "name": "ផ្ទះលេខC8"
        },
        {
            "barcode": "BBWS180204467",
            "dpc": "03024341001",
            "name": "ផ្ទះលេខC9"
        },
        {
            "barcode": "BBWS180204468",
            "dpc": "03024337201",
            "name": "ហ៊ន ម៉ៅ"
        },
        {
            "barcode": "BBWS180204469",
            "dpc": "03024337301",
            "name": "តូ ព្រេក"
        },
        {
            "barcode": "BBWS180204470",
            "dpc": "03024337401",
            "name": "ប៊ុត ឡាប"
        },
        {
            "barcode": "BBWS180204471",
            "dpc": "03024337601",
            "name": "ផា រស្មី"
        },
        {
            "barcode": "BBWS180204472",
            "dpc": "03024337701",
            "name": "ជិន សុផានីD01"
        },
        {
            "barcode": "BBWS180204473",
            "dpc": "03024337801",
            "name": "ផ្ទះលេខD02"
        },
        {
            "barcode": "BBWS180204474",
            "dpc": "03024337901",
            "name": "ឡាំ សុភាវី D03"
        },
        {
            "barcode": "BBWS180204475",
            "dpc": "03024338001",
            "name": "ផ្ទះលេខ D04"
        },
        {
            "barcode": "BBWS180204476",
            "dpc": "03024338301",
            "name": "ផ្ទះលេខ D07"
        },
        {
            "barcode": "BBWS180204477",
            "dpc": "03024338401",
            "name": "ផ្ទះលេខ​ D08"
        },
        {
            "barcode": "BBWS180204478",
            "dpc": "03024338501",
            "name": "វឿន ស៊ីម៉េងD09"
        },
        {
            "barcode": "BBWS180204479",
            "dpc": "03024338601",
            "name": "ម៉ែន សុភក្ដិD10"
        },
        {
            "barcode": "BBWS180204480",
            "dpc": "03024338701",
            "name": "ផ្ទះលេខ D11"
        },
        {
            "barcode": "BBWS180204481",
            "dpc": "03024338801",
            "name": "ផ្ទះលេខ D12"
        },
        {
            "barcode": "BBWS180204482",
            "dpc": "03024338901",
            "name": "ផ្ទះលេខ D13"
        },
        {
            "barcode": "BBWS180204483",
            "dpc": "03024339601",
            "name": "ផ្ទះលេខ D20"
        },
        {
            "barcode": "BBWS180204484",
            "dpc": "03024339901",
            "name": "ផ្ទះលេខ C20"
        },
        {
            "barcode": "BBWS180204485",
            "dpc": "03024340001",
            "name": "ផ្ទះលេខ C19"
        },
        {
            "barcode": "BBWS180204486",
            "dpc": "03024340101",
            "name": "ផ្ទះលេខ C18"
        },
        {
            "barcode": "BBWS180204487",
            "dpc": "03024340201",
            "name": "ផ្ទះលេខ C17"
        },
        {
            "barcode": "BBWS180204488",
            "dpc": "03024340301",
            "name": "ផ្ទះលេខ C16"
        },
        {
            "barcode": "BBWS180204489",
            "dpc": "03024340401",
            "name": "ផ្ទះលេខ C15"
        },
        {
            "barcode": "BBWS180204490",
            "dpc": "03024340501",
            "name": "ផ្ទះលេខ C14"
        },
        {
            "barcode": "BBWS180204491",
            "dpc": "03024340601",
            "name": "ប៉ោយ ឈុនលី C13"
        },
        {
            "barcode": "BBWS180204492",
            "dpc": "03024340701",
            "name": "ច្រៀង ស៊ាងឡេង C12"
        },
        {
            "barcode": "BBWS180204493",
            "dpc": "03024340801",
            "name": "កែវ រតនះ C11"
        },
        {
            "barcode": "BBWS180204494",
            "dpc": "03024342001",
            "name": "ប៉ៅ ចន្ថា"
        },
        {
            "barcode": "BBWS180204495",
            "dpc": "03024342101",
            "name": "ឈិន វុតថុល"
        },
        {
            "barcode": "BBWS180204496",
            "dpc": "03024342201",
            "name": "នួន មុំ"
        },
        {
            "barcode": "BBWS180204497",
            "dpc": "03024342301",
            "name": "សឿន សុខគា"
        },
        {
            "barcode": "BBWS180204498",
            "dpc": "03024342401",
            "name": "សាន់ សាវីន"
        },
        {
            "barcode": "BBWS180204499",
            "dpc": "03024342501",
            "name": "ពេជ្រ ប៊ិន"
        },
        {
            "barcode": "BBWS180204500",
            "dpc": "03024342601",
            "name": "ភុន សម្ផស្ស"
        },
        {
            "barcode": "BBWS180204501",
            "dpc": "03024342701",
            "name": "ផាន់ រ៉ៃយ៉ា"
        },
        {
            "barcode": "BBWS180204502",
            "dpc": "03024342801",
            "name": "រ័ត្ន មុន្នី"
        },
        {
            "barcode": "BBWS180204503",
            "dpc": "03024342901",
            "name": "អ៊ុក វិជ្ជា"
        },
        {
            "barcode": "BBWS180204504",
            "dpc": "03024343001",
            "name": "អ៊ូ រដ្ឋា"
        },
        {
            "barcode": "BBWS180204505",
            "dpc": "03024343101",
            "name": "ម៉ូវ ផាន់ណា"
        },
        {
            "barcode": "BBWS180204506",
            "dpc": "03024343201",
            "name": "ថាយ ប៊ុនថន"
        },
        {
            "barcode": "BBWS180204507",
            "dpc": "03024343301",
            "name": "ផុន សុជាតិ"
        },
        {
            "barcode": "BBWS180204508",
            "dpc": "03024343401",
            "name": "សើន សៀន"
        },
        {
            "barcode": "BBWS180204509",
            "dpc": "03024343501",
            "name": "វ៉ែន ឌី"
        },
        {
            "barcode": "BBWS180204510",
            "dpc": "03024343601",
            "name": "វ័ន សុខា"
        },
        {
            "barcode": "BBWS180204511",
            "dpc": "03024343701",
            "name": "សរ សុភាព"
        },
        {
            "barcode": "BBWS180204512",
            "dpc": "03024343801",
            "name": "គឹម សុផល"
        },
        {
            "barcode": "BBWS180204513",
            "dpc": "03024343901",
            "name": "ផាន់ ឡូន"
        },
        {
            "barcode": "BBWS180204514",
            "dpc": "03024344001",
            "name": "វ៉ាត់ សុភាព"
        },
        {
            "barcode": "BBWS180204515",
            "dpc": "03024344101",
            "name": "យឿម សីហា"
        },
        {
            "barcode": "BBWS180204516",
            "dpc": "03024344201",
            "name": "រ៉ែន អរុណរស្មី"
        },
        {
            "barcode": "BBWS180204517",
            "dpc": "03024344301",
            "name": "រ៉ែន ចាន់ណារ៉ា"
        },
        {
            "barcode": "BBWS180204518",
            "dpc": "03024344401",
            "name": "ខាយ ចន្ធូ"
        },
        {
            "barcode": "BBWS180204519",
            "dpc": "03024344501",
            "name": "រួម ណារិន"
        },
        {
            "barcode": "BBWS180204520",
            "dpc": "03024344601",
            "name": "យ៉ុង វ៉ុន"
        },
        {
            "barcode": "BBWS180204521",
            "dpc": "03024344701",
            "name": "វ៉ន សារិទ្ធ"
        },
        {
            "barcode": "BBWS180204522",
            "dpc": "03024344801",
            "name": "ផង់ ផារី"
        },
        {
            "barcode": "BBWS180204523",
            "dpc": "03024344901",
            "name": "ស្រី អេង"
        },
        {
            "barcode": "BBWS180204524",
            "dpc": "03024345001",
            "name": "យឿង យឿន"
        },
        {
            "barcode": "BBWS180204525",
            "dpc": "03024345101",
            "name": "ហ៊ន ហាច"
        },
        {
            "barcode": "BBWS180204526",
            "dpc": "03024345201",
            "name": "ហ៊ន ហូ"
        },
        {
            "barcode": "BBWS180204527",
            "dpc": "03024345301",
            "name": "អ៊ីង ណាង"
        },
        {
            "barcode": "BBWS180204528",
            "dpc": "03024345401",
            "name": "សុខ យីវ"
        },
        {
            "barcode": "BBWS180204529",
            "dpc": "03024345501",
            "name": "ហ៊ន ហ៊ត"
        },
        {
            "barcode": "BBWS180204530",
            "dpc": "03024345601",
            "name": "ដុះ ដុង"
        },
        {
            "barcode": "BBWS180204531",
            "dpc": "03024345701",
            "name": "សែ ម៉ាច"
        },
        {
            "barcode": "BBWS180204532",
            "dpc": "03024345801",
            "name": "សេ ឌី"
        },
        {
            "barcode": "BBWS180204533",
            "dpc": "03024345901",
            "name": "ភើម ផេន"
        },
        {
            "barcode": "BBWS180204534",
            "dpc": "03024346001",
            "name": "ឆែម ងឿន"
        },
        {
            "barcode": "BBWS180204535",
            "dpc": "03024346101",
            "name": "យ៉ិម សុភី"
        },
        {
            "barcode": "BBWS180204536",
            "dpc": "03024346201",
            "name": "ដាន ផេង"
        },
        {
            "barcode": "BBWS180204537",
            "dpc": "03024346301",
            "name": "អ៊ីង នីម"
        },
        {
            "barcode": "BBWS180204538",
            "dpc": "03024346401",
            "name": "ផន ផានណា"
        },
        {
            "barcode": "BBWS180204539",
            "dpc": "03024348001",
            "name": "ផាត់ ផាន់ណា"
        },
        {
            "barcode": "BBWS180204540",
            "dpc": "03024347901",
            "name": "ជា ហៀក"
        },
        {
            "barcode": "BBWS180204541",
            "dpc": "03024346501",
            "name": "ឌុច ហ៊ន"
        },
        {
            "barcode": "BBWS180204542",
            "dpc": "03024346601",
            "name": "ហ៊ន ហឿម"
        },
        {
            "barcode": "BBWS180204543",
            "dpc": "03024346701",
            "name": "ចេក សារ៉ាន់"
        },
        {
            "barcode": "BBWS180204544",
            "dpc": "03024346801",
            "name": "សួន ឃឿន"
        },
        {
            "barcode": "BBWS180204545",
            "dpc": "03024347801",
            "name": "ហែម វណ្ណី"
        },
        {
            "barcode": "BBWS180204546",
            "dpc": "03024346901",
            "name": "អ៊ុក ស៊ីម៉ែត"
        },
        {
            "barcode": "BBWS180204547",
            "dpc": "03024347001",
            "name": "អ៊ុក ស៊ីម៉ន"
        },
        {
            "barcode": "BBWS180204548",
            "dpc": "03024347701",
            "name": "ឌី ចាន់លុន"
        },
        {
            "barcode": "BBWS180204549",
            "dpc": "03024347101",
            "name": "ខៀវ សួរ"
        },
        {
            "barcode": "BBWS180204550",
            "dpc": "03024347601",
            "name": "ញ៉ែម វិចិត្រ"
        },
        {
            "barcode": "BBWS180204551",
            "dpc": "03024347201",
            "name": "វ៉េង ទៀង"
        },
        {
            "barcode": "BBWS180204552",
            "dpc": "03024347501",
            "name": "ស្រេង សុវណ្ណារ៉ា"
        },
        {
            "barcode": "BBWS180204553",
            "dpc": "03024347301",
            "name": "ឃិន សុផា"
        },
        {
            "barcode": "BBWS180204554",
            "dpc": "03024347401",
            "name": "ឡាច សារ៉ាន់"
        }
    ]

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
