let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=

    [
        {
            "barcode": "BBWS180202899",
            "dpc": "03014400101",
            "name": "ម៉ៅ សារ៉ាត"
        },
        {
            "barcode": "BBWS180202900",
            "dpc": "03014400201",
            "name": "ឌួង វាសនា១"
        },
        {
            "barcode": "BBWS180202901",
            "dpc": "03014400301",
            "name": "ឌួង វាសនា២"
        },
        {
            "barcode": "BBWS180202902",
            "dpc": "03014400401",
            "name": "រ៉ូ រ៉ស់ហ្វី"
        },
        {
            "barcode": "BBWS180202903",
            "dpc": "03014400501",
            "name": "មែ តេង"
        },
        {
            "barcode": "BBWS180202904",
            "dpc": "03014400601",
            "name": "ឆោម ឡងឌី"
        },
        {
            "barcode": "BBWS180202905",
            "dpc": "03014400801",
            "name": "សុត បញ្ញា"
        },
        {
            "barcode": "BBWS180202906",
            "dpc": "03014400901",
            "name": "មុំ ស្រីពៅ"
        },
        {
            "barcode": "BBWS180202907",
            "dpc": "03014401101",
            "name": "យឹម ចាន់ណារី"
        },
        {
            "barcode": "BBWS180202908",
            "dpc": "03014401201",
            "name": "រី សុខគាន"
        },
        {
            "barcode": "BBWS180202909",
            "dpc": "03014401301",
            "name": "រស់ ផលសម្បត្តិ"
        },
        {
            "barcode": "BBWS180202910",
            "dpc": "03014401401",
            "name": "ហេង សៅយ៉ាត"
        },
        {
            "barcode": "BBWS180202911",
            "dpc": "03014401501",
            "name": "វង្ស គឹមឡាង"
        },
        {
            "barcode": "BBWS180202912",
            "dpc": "03014401601",
            "name": "ម៉ៅ សារ៉ាត២"
        },
        {
            "barcode": "BBWS180202913",
            "dpc": "03014401701",
            "name": "ហៀង ថាវី"
        },
        {
            "barcode": "BBWS180202914",
            "dpc": "03014401801",
            "name": "យ៉ុត យ៉ាន់"
        },
        {
            "barcode": "BBWS180202915",
            "dpc": "03014401901",
            "name": "ឆុម វ៊ិត"
        },
        {
            "barcode": "BBWS180202916",
            "dpc": "03014402001",
            "name": "ប៉ូ ពៅ"
        },
        {
            "barcode": "BBWS180202917",
            "dpc": "03014402101",
            "name": "លី លី"
        },
        {
            "barcode": "BBWS180202918",
            "dpc": "03014402201",
            "name": "សេង សុខធារី"
        },
        {
            "barcode": "BBWS180202919",
            "dpc": "03014402301",
            "name": "សំ និមល់"
        },
        {
            "barcode": "BBWS180202920",
            "dpc": "03014402401",
            "name": "អាន គឹមឡាយ"
        },
        {
            "barcode": "BBWS180202921",
            "dpc": "03014402501",
            "name": "លី ផានី"
        },
        {
            "barcode": "BBWS180202922",
            "dpc": "03014402701",
            "name": "ឆាំ មារ៉ា"
        },
        {
            "barcode": "BBWS180202923",
            "dpc": "03014402801",
            "name": "សំ អាងសត្យា"
        },
        {
            "barcode": "BBWS180202924",
            "dpc": "03014402901",
            "name": "ពេជ្រ គន្ធា"
        },
        {
            "barcode": "BBWS180202925",
            "dpc": "03014403001",
            "name": "អ៊ុន សុវិុត"
        },
        {
            "barcode": "BBWS180202926",
            "dpc": "03014403101",
            "name": "ទុំ ក្លឹង"
        },
        {
            "barcode": "BBWS180202927",
            "dpc": "03014403301",
            "name": "ជា សារាន"
        },
        {
            "barcode": "BBWS180202928",
            "dpc": "03014403401",
            "name": "លី ចាន់ណា"
        },
        {
            "barcode": "BBWS180202929",
            "dpc": "03014403501",
            "name": "ចាន់ សារ៉ាត់"
        },
        {
            "barcode": "BBWS180202930",
            "dpc": "03014403701",
            "name": "ព្រំ ផាន"
        },
        {
            "barcode": "BBWS180202931",
            "dpc": "03014403901",
            "name": "អៀប ប៊ុន"
        },
        {
            "barcode": "BBWS180202932",
            "dpc": "03014404001",
            "name": "ដួង លីដា"
        },
        {
            "barcode": "BBWS180202933",
            "dpc": "03014404101",
            "name": "យឹម ស្រស់"
        },
        {
            "barcode": "BBWS180202934",
            "dpc": "03014404201",
            "name": "ហ៊ាន សុធា"
        },
        {
            "barcode": "BBWS180202935",
            "dpc": "03014404401",
            "name": "ទាវ សុផល"
        },
        {
            "barcode": "BBWS180202936",
            "dpc": "03014404501",
            "name": "កយ វី"
        },
        {
            "barcode": "BBWS180202937",
            "dpc": "03014401001",
            "name": "ថាច់ វណ្ណអុន"
        },
        {
            "barcode": "BBWS180202938",
            "dpc": "03014404601",
            "name": "ឡៃ  ឡាត់"
        },
        {
            "barcode": "BBWS180202939",
            "dpc": "03014404701",
            "name": "ស៊ុន ភឿត"
        },
        {
            "barcode": "BBWS180202940",
            "dpc": "03014404801",
            "name": "តឿ រ៉ុង"
        },
        {
            "barcode": "BBWS180202941",
            "dpc": "03014404901",
            "name": "យោក ហ៊ុន"
        },
        {
            "barcode": "BBWS180202942",
            "dpc": "03014405001",
            "name": "យោក ធី"
        },
        {
            "barcode": "BBWS180202943",
            "dpc": "03014405101",
            "name": "ឌី សុភាវី"
        },
        {
            "barcode": "BBWS180202944",
            "dpc": "03014405201",
            "name": "ទុយ ស្រស់"
        },
        {
            "barcode": "BBWS180202945",
            "dpc": "03014405301",
            "name": "ចៅ ហ្វឹង២"
        },
        {
            "barcode": "BBWS180202946",
            "dpc": "03014405401",
            "name": "តែ គី"
        },
        {
            "barcode": "BBWS180202947",
            "dpc": "03014405601",
            "name": "អូច ទូច"
        },
        {
            "barcode": "BBWS180202948",
            "dpc": "03014405701",
            "name": "ហឿន សុធា"
        },
        {
            "barcode": "BBWS180202949",
            "dpc": "03014405801",
            "name": "អាង ហ៊ុយ"
        },
        {
            "barcode": "BBWS180202950",
            "dpc": "03014405901",
            "name": "សុខ ហ៊ុន"
        },
        {
            "barcode": "BBWS180202951",
            "dpc": "03014406001",
            "name": "ញឹក ចំរើន"
        },
        {
            "barcode": "BBWS180202952",
            "dpc": "03014406101",
            "name": "សុខ ភាង"
        },
        {
            "barcode": "BBWS180202953",
            "dpc": "03014406201",
            "name": "គុយ ស្រីណូ"
        },
        {
            "barcode": "BBWS180202954",
            "dpc": "03014406301",
            "name": "ស៊ី ចិន្ដា"
        },
        {
            "barcode": "BBWS180202955",
            "dpc": "03014406401",
            "name": "គី ម៉េងទុយ១"
        },
        {
            "barcode": "BBWS180202956",
            "dpc": "03014406501",
            "name": "គី ម៉េងទុយ"
        },
        {
            "barcode": "BBWS180202957",
            "dpc": "03014406601",
            "name": "វិញ ឡេង"
        },
        {
            "barcode": "BBWS180202958",
            "dpc": "03014406701",
            "name": "វិញ ប៊ុនឆៃ"
        },
        {
            "barcode": "BBWS180202959",
            "dpc": "03014406801",
            "name": "ឈៀង ឈុន"
        },
        {
            "barcode": "BBWS180202960",
            "dpc": "03014406901",
            "name": "អ៊ុង សុធារី"
        },
        {
            "barcode": "BBWS180202961",
            "dpc": "03014407001",
            "name": "ង៉ុក វរី"
        },
        {
            "barcode": "BBWS180202962",
            "dpc": "03014407101",
            "name": "ឡៃ រឿង"
        },
        {
            "barcode": "BBWS180202963",
            "dpc": "03014407201",
            "name": "ពិន ឈឿ"
        },
        {
            "barcode": "BBWS180202964",
            "dpc": "03014407301",
            "name": "ឌុច សំ"
        },
        {
            "barcode": "BBWS180202965",
            "dpc": "03014407401",
            "name": "កែវ សុផល"
        },
        {
            "barcode": "BBWS180202966",
            "dpc": "03014407501",
            "name": "ឡាំ គឹមហៀង"
        },
        {
            "barcode": "BBWS180202967",
            "dpc": "03014407601",
            "name": "ឆាយ សុធា"
        },
        {
            "barcode": "BBWS180202968",
            "dpc": "03014407701",
            "name": "វិន ផល្លី"
        },
        {
            "barcode": "BBWS180202969",
            "dpc": "03014407801",
            "name": "ឈុន គឹមលី"
        },
        {
            "barcode": "BBWS180202970",
            "dpc": "03014408001",
            "name": "យាង យៀប"
        },
        {
            "barcode": "BBWS180202971",
            "dpc": "03014408101",
            "name": "ជា ចំរើន"
        },
        {
            "barcode": "BBWS180202972",
            "dpc": "03014408201",
            "name": "សុខ ភាព"
        },
        {
            "barcode": "BBWS180202973",
            "dpc": "03014408301",
            "name": "ថៃ ស្រីពៅ"
        },
        {
            "barcode": "BBWS180202974",
            "dpc": "03014408401",
            "name": "រស់ វណ្ណារី"
        },
        {
            "barcode": "BBWS180202975",
            "dpc": "03014408501",
            "name": "វង្ស វី"
        },
        {
            "barcode": "BBWS180202976",
            "dpc": "03014408601",
            "name": "ជា តែហុង"
        },
        {
            "barcode": "BBWS180202977",
            "dpc": "03014408701",
            "name": "ស៊្រាង រ៉ាតូ"
        },
        {
            "barcode": "BBWS180202978",
            "dpc": "03014408801",
            "name": "ស៊្រាង រ៉ាតូ ១"
        },
        {
            "barcode": "BBWS180202979",
            "dpc": "03014408901",
            "name": "ស៊ុយ គឹមហៃ"
        },
        {
            "barcode": "BBWS180202980",
            "dpc": "03014409001",
            "name": "ចេង ហ៊ាង ១"
        },
        {
            "barcode": "BBWS180202981",
            "dpc": "03014409101",
            "name": "ចេង ហ៊ាង ២"
        },
        {
            "barcode": "BBWS180202982",
            "dpc": "03014409201",
            "name": "ប្រឹម យឿក"
        },
        {
            "barcode": "BBWS180202983",
            "dpc": "03014409301",
            "name": "គង់ សុភ័ក្រ"
        },
        {
            "barcode": "BBWS180202984",
            "dpc": "03014409401",
            "name": "អ៊ិត ចន្រ្ទា"
        },
        {
            "barcode": "BBWS180202985",
            "dpc": "03014409501",
            "name": "អ៊ឹង សុគុន្ធ"
        },
        {
            "barcode": "BBWS180202986",
            "dpc": "03014409601",
            "name": "ភួង សុភាស់"
        },
        {
            "barcode": "BBWS180202987",
            "dpc": "03014409801",
            "name": "សយ សេរី"
        },
        {
            "barcode": "BBWS180202988",
            "dpc": "03014409901",
            "name": "វ៉ាន់ ថូ"
        },
        {
            "barcode": "BBWS180202989",
            "dpc": "03014410001",
            "name": "ប៉ែន សូនី"
        },
        {
            "barcode": "BBWS180202990",
            "dpc": "03014410101",
            "name": "អួន ហ៊ល"
        },
        {
            "barcode": "BBWS180202991",
            "dpc": "03014410201",
            "name": "ទេព ណារី"
        },
        {
            "barcode": "BBWS180202992",
            "dpc": "03014410301",
            "name": "សៅ សុខម"
        },
        {
            "barcode": "BBWS180202993",
            "dpc": "03014410401",
            "name": "គង់ ចាន់រិទ្ទ"
        },
        {
            "barcode": "BBWS180202994",
            "dpc": "03014410501",
            "name": "កាធ្នូ  ចរិយា"
        },
        {
            "barcode": "BBWS180202995",
            "dpc": "03014410701",
            "name": "ស្រាយ យ៉ង់"
        },
        {
            "barcode": "BBWS180202996",
            "dpc": "03014410801",
            "name": "គង់ ភិញ"
        },
        {
            "barcode": "BBWS180202997",
            "dpc": "03014410901",
            "name": "ជឹម ពៅ"
        },
        {
            "barcode": "BBWS180202998",
            "dpc": "03014411001",
            "name": "ជា មុន្នី"
        },
        {
            "barcode": "BBWS180202999",
            "dpc": "03014411101",
            "name": "ឃឿន ខន"
        },
        {
            "barcode": "BBWS180203000",
            "dpc": "03014411201",
            "name": "ប៉ាន គឹមហៀក"
        },
        {
            "barcode": "BBWS180203001",
            "dpc": "03014411301",
            "name": "វង់ សិលា"
        },
        {
            "barcode": "BBWS180203002",
            "dpc": "03014411401",
            "name": "​ឡេង សេងណា"
        },
        {
            "barcode": "BBWS180203003",
            "dpc": "03014411501",
            "name": "ប៊ុ សុធី"
        },
        {
            "barcode": "BBWS180203004",
            "dpc": "03014411601",
            "name": "គន រដ្ឋា"
        },
        {
            "barcode": "BBWS180203005",
            "dpc": "03014411701",
            "name": "រុណ ភរម្យ"
        },
        {
            "barcode": "BBWS180203006",
            "dpc": "03014411801",
            "name": "ឆៃ លន់"
        },
        {
            "barcode": "BBWS180203007",
            "dpc": "03014411901",
            "name": "ស៊ីម វុត្ថា"
        },
        {
            "barcode": "BBWS180203008",
            "dpc": "03014412001",
            "name": "អ៊ុច សាលៀប"
        },
        {
            "barcode": "BBWS180203009",
            "dpc": "03014412101",
            "name": "អ៊ុច ឆាយឡាយ"
        },
        {
            "barcode": "BBWS180203010",
            "dpc": "03014412201",
            "name": "ពិន សុចរ៉ា"
        },
        {
            "barcode": "BBWS180203011",
            "dpc": "03014412301",
            "name": "ណាង ភានិត"
        },
        {
            "barcode": "BBWS180203012",
            "dpc": "03014412401",
            "name": "បេឡាជាតិសត្តិសុខសង្គម"
        },
        {
            "barcode": "BBWS180203013",
            "dpc": "03014412501",
            "name": "អ៊ុត ចំរើន"
        },
        {
            "barcode": "BBWS180203014",
            "dpc": "03014412601",
            "name": "ប្រាជ្ញ បញ្ញារិទ្ទ"
        },
        {
            "barcode": "BBWS180203015",
            "dpc": "03014412701",
            "name": "ស៊ុយ ចំណាណ"
        },
        {
            "barcode": "BBWS180203016",
            "dpc": "03014412801",
            "name": "សាន សម្បត្តិ"
        },
        {
            "barcode": "BBWS180203017",
            "dpc": "03014412901",
            "name": "អ៊ឹម ផានបញ្ញារិទ្ធ"
        },
        {
            "barcode": "BBWS180203018",
            "dpc": "03014413001",
            "name": "ទឹត ស៊ីណា"
        },
        {
            "barcode": "BBWS180203019",
            "dpc": "03014413101",
            "name": "ហេង សំណាង"
        },
        {
            "barcode": "BBWS180203020",
            "dpc": "03014413201",
            "name": "សុខ ឆវន្ត័"
        },
        {
            "barcode": "BBWS180203021",
            "dpc": "03014413301",
            "name": "មាស គឹមសត្យា"
        },
        {
            "barcode": "BBWS180203022",
            "dpc": "03014413401",
            "name": "គង់ សាវឌី"
        },
        {
            "barcode": "BBWS180203023",
            "dpc": "03014413501",
            "name": "ពក សុវង្ស"
        },
        {
            "barcode": "BBWS180203024",
            "dpc": "03014413601",
            "name": "មាស ស៊ីណាត"
        },
        {
            "barcode": "BBWS180203025",
            "dpc": "03014413701",
            "name": "មាស ចាន់សោភ័ណ"
        },
        {
            "barcode": "BBWS180203026",
            "dpc": "03014413801",
            "name": "ខែម រស្មី"
        },
        {
            "barcode": "BBWS180203027",
            "dpc": "03014413901",
            "name": "ឃុត សំបូរ"
        },
        {
            "barcode": "BBWS180203028",
            "dpc": "03014414001",
            "name": "សេង ហួរ"
        },
        {
            "barcode": "BBWS180203029",
            "dpc": "03014414101",
            "name": "ម៉ី ផល្លី"
        },
        {
            "barcode": "BBWS180203030",
            "dpc": "03014414201",
            "name": "ស៊ីវ រដ្ឌា"
        },
        {
            "barcode": "BBWS180203031",
            "dpc": "03014414301",
            "name": "ប្រាក់ចាន់ធឿន"
        },
        {
            "barcode": "BBWS180203032",
            "dpc": "03014414401",
            "name": "វ៉ន ឃាង"
        },
        {
            "barcode": "BBWS180203033",
            "dpc": "03014414501",
            "name": "ប៊ិន ទិត្យ"
        },
        {
            "barcode": "BBWS180203034",
            "dpc": "03014414601",
            "name": "ម៉ៅ ម៉ន"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
