let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=

    [
        {
            "barcode": "BBWS180203035",
            "dpc": "03014503201",
            "name": "សេក អាយ"
        },
        {
            "barcode": "BBWS180203036",
            "dpc": "03014500101",
            "name": "សាន គឹមឆេង"
        },
        {
            "barcode": "BBWS180203037",
            "dpc": "03014508101",
            "name": "ស្រី ម៉ាណេត"
        },
        {
            "barcode": "BBWS180203038",
            "dpc": "03014508201",
            "name": "ជឿន ស៊ីនឿន"
        },
        {
            "barcode": "BBWS180203039",
            "dpc": "03014508501",
            "name": "មិ សាមឿត"
        },
        {
            "barcode": "BBWS180203040",
            "dpc": "03014508601",
            "name": "វ៉ាន និមល"
        },
        {
            "barcode": "BBWS180203041",
            "dpc": "03014508701",
            "name": "ឡុច និមល"
        },
        {
            "barcode": "BBWS180203042",
            "dpc": "03014508801",
            "name": "យឿន យ៉ុន"
        },
        {
            "barcode": "BBWS180203043",
            "dpc": "03014508901",
            "name": "យ៉ុង យ៉ុន"
        },
        {
            "barcode": "BBWS180203044",
            "dpc": "03014509101",
            "name": "ឈយ រុន"
        },
        {
            "barcode": "BBWS180203045",
            "dpc": "03014509201",
            "name": "ម៉ា ស៊ីថា"
        },
        {
            "barcode": "BBWS180203046",
            "dpc": "03014509301",
            "name": "ឆាយ ណារី"
        },
        {
            "barcode": "BBWS180203047",
            "dpc": "03014509601",
            "name": "អេង គឹមសាន្ត"
        },
        {
            "barcode": "BBWS180203048",
            "dpc": "03014509701",
            "name": "ចាន់ ស៊ីណា"
        },
        {
            "barcode": "BBWS180203049",
            "dpc": "03014509801",
            "name": "ជំ ចំរើន"
        },
        {
            "barcode": "BBWS180203050",
            "dpc": "03014510001",
            "name": "នួរ លីណា"
        },
        {
            "barcode": "BBWS180203051",
            "dpc": "03014510101",
            "name": "តែ ឈុន"
        },
        {
            "barcode": "BBWS180203052",
            "dpc": "03014510401",
            "name": "លន ស៊ីចែម"
        },
        {
            "barcode": "BBWS180203054",
            "dpc": "03014510801",
            "name": "អ៊ី សាវុន"
        },
        {
            "barcode": "BBWS180203055",
            "dpc": "03014510901",
            "name": "ឌុក សារឿត"
        },
        {
            "barcode": "BBWS180203056",
            "dpc": "03014511201",
            "name": "ម៉ៅ សុស"
        },
        {
            "barcode": "BBWS180203057",
            "dpc": "03014511301",
            "name": "សុស សុវណ្ណ"
        },
        {
            "barcode": "BBWS180203058",
            "dpc": "03014511501",
            "name": "ម៉ៅ សាមឿន"
        },
        {
            "barcode": "BBWS180203060",
            "dpc": "03014511801",
            "name": "លៀម ហ៊ុន"
        },
        {
            "barcode": "BBWS180203061",
            "dpc": "03014511901",
            "name": "ឆេង នឿត"
        },
        {
            "barcode": "BBWS180203062",
            "dpc": "03014512001",
            "name": "ផល មុន្នី"
        },
        {
            "barcode": "BBWS180203063",
            "dpc": "03014512101",
            "name": "ណាម ឆាន់"
        },
        {
            "barcode": "BBWS180203064",
            "dpc": "03014512201",
            "name": "យុត ប្រុស"
        },
        {
            "barcode": "BBWS180203065",
            "dpc": "03014512301",
            "name": "ស្វាយ យ៉េន"
        },
        {
            "barcode": "BBWS180203066",
            "dpc": "03014512501",
            "name": "សឿន ស៊ាប"
        },
        {
            "barcode": "BBWS180203067",
            "dpc": "03014512901",
            "name": "យ៉ែក សុរឿន"
        },
        {
            "barcode": "BBWS180203068",
            "dpc": "03014513101",
            "name": "សៀរ អឿម"
        },
        {
            "barcode": "BBWS180203071",
            "dpc": "03014513601",
            "name": "កែវ សារ៉ា"
        },
        {
            "barcode": "BBWS180203072",
            "dpc": "03014513701",
            "name": "ផល វាសនា"
        },
        {
            "barcode": "BBWS180203073",
            "dpc": "03014513901",
            "name": "សត់ ឡី"
        },
        {
            "barcode": "BBWS180203074",
            "dpc": "03014514101",
            "name": "ម៉ាន សំណាងហាន"
        },
        {
            "barcode": "BBWS180203075",
            "dpc": "03014500201",
            "name": "អ៊ុក វី"
        },
        {
            "barcode": "BBWS180203076",
            "dpc": "03014500401",
            "name": "តា កួយ"
        },
        {
            "barcode": "BBWS180203077",
            "dpc": "03014500501",
            "name": "កែវ លីយ៉េន"
        },
        {
            "barcode": "BBWS180203078",
            "dpc": "03014500601",
            "name": "ហួរ ហួន"
        },
        {
            "barcode": "BBWS180203079",
            "dpc": "03014500701",
            "name": "ឆុន សុគង់"
        },
        {
            "barcode": "BBWS180203080",
            "dpc": "03014500901",
            "name": "ប្លង សេដ្ឋា"
        },
        {
            "barcode": "BBWS180203081",
            "dpc": "03014501101",
            "name": "យ៉ូន យ៉ាន"
        },
        {
            "barcode": "BBWS180203082",
            "dpc": "03014501201",
            "name": "យ៉ូន យ៉ាន២"
        },
        {
            "barcode": "BBWS180203083",
            "dpc": "03014501301",
            "name": "គឹម សុង"
        },
        {
            "barcode": "BBWS180203084",
            "dpc": "03014501401",
            "name": "ញឹក ឆាត"
        },
        {
            "barcode": "BBWS180203085",
            "dpc": "03014501501",
            "name": "រ៉េត ឆុន"
        },
        {
            "barcode": "BBWS180203086",
            "dpc": "03014501601",
            "name": "កាំ ស៊ាន"
        },
        {
            "barcode": "BBWS180203087",
            "dpc": "03014501801",
            "name": "សេង សាវឿន"
        },
        {
            "barcode": "BBWS180203088",
            "dpc": "03014501901",
            "name": "កៅ ប៊ួយ"
        },
        {
            "barcode": "BBWS180203089",
            "dpc": "03014502201",
            "name": "វ៉ាន សាវឿង"
        },
        {
            "barcode": "BBWS180203090",
            "dpc": "03014502101",
            "name": "ជឿម ពុធហេង"
        },
        {
            "barcode": "BBWS180203091",
            "dpc": "03014502301",
            "name": "តូ ទុំ"
        },
        {
            "barcode": "BBWS180203092",
            "dpc": "03014502401",
            "name": "រ័ត្ន សារ៉ុម"
        },
        {
            "barcode": "BBWS180203093",
            "dpc": "03014502501",
            "name": "មាន ញ៉ាន"
        },
        {
            "barcode": "BBWS180203094",
            "dpc": "03014502601",
            "name": "តូ ឡៅឆេន"
        },
        {
            "barcode": "BBWS180203095",
            "dpc": "03014502701",
            "name": "ឡាប ឡាង"
        },
        {
            "barcode": "BBWS180203096",
            "dpc": "03014502801",
            "name": "លៀប លឿម"
        },
        {
            "barcode": "BBWS180203097",
            "dpc": "03014502901",
            "name": "ឯក សេង"
        },
        {
            "barcode": "BBWS180203098",
            "dpc": "03014503001",
            "name": "វ៉ាន ស៊ីនួន"
        },
        {
            "barcode": "BBWS180203099",
            "dpc": "03014503101",
            "name": "ហ៊ាន ធឿន"
        },
        {
            "barcode": "BBWS180203100",
            "dpc": "03014503401",
            "name": "ឆ សុធឿត"
        },
        {
            "barcode": "BBWS180203101",
            "dpc": "03014503501",
            "name": "ហ៊ាន តឹកលី"
        },
        {
            "barcode": "BBWS180203102",
            "dpc": "03014503601",
            "name": "អ៊ុក សុធី"
        },
        {
            "barcode": "BBWS180203103",
            "dpc": "03014503801",
            "name": "ឆិន ចន្ទ័សុធី"
        },
        {
            "barcode": "BBWS180203104",
            "dpc": "03014503901",
            "name": "ងិន ខេមរិទ្ធ"
        },
        {
            "barcode": "BBWS180203105",
            "dpc": "03014504001",
            "name": "ខាន់ ផល្លា"
        },
        {
            "barcode": "BBWS180203106",
            "dpc": "03014504201",
            "name": "វិត្ត កូឡា"
        },
        {
            "barcode": "BBWS180203107",
            "dpc": "03014504301",
            "name": "អេង ស៊ីផា"
        },
        {
            "barcode": "BBWS180203108",
            "dpc": "03014504501",
            "name": "អ៊ំ ម៉ាញ"
        },
        {
            "barcode": "BBWS180203109",
            "dpc": "03014504601",
            "name": "ឡី ឡា"
        },
        {
            "barcode": "BBWS180203110",
            "dpc": "03014504701",
            "name": "ឆន ឡី"
        },
        {
            "barcode": "BBWS180203111",
            "dpc": "03014504801",
            "name": "មាស សាវ៉ន"
        },
        {
            "barcode": "BBWS180203112",
            "dpc": "03014505101",
            "name": "វ៉ាន សុខុន"
        },
        {
            "barcode": "BBWS180203113",
            "dpc": "03014505201",
            "name": "ជូន រឿត"
        },
        {
            "barcode": "BBWS180203114",
            "dpc": "03014505401",
            "name": "អំ ពុទ្ធារី"
        },
        {
            "barcode": "BBWS180203115",
            "dpc": "03014505501",
            "name": "អ៊ូរ ហឿង"
        },
        {
            "barcode": "BBWS180203116",
            "dpc": "03014505601",
            "name": "ទុយ ផល"
        },
        {
            "barcode": "BBWS180203117",
            "dpc": "03014505801",
            "name": "អ៊ុក ស៊ីនួន"
        },
        {
            "barcode": "BBWS180203118",
            "dpc": "03014506001",
            "name": "ភិន សុវណ្ណដាវី"
        },
        {
            "barcode": "BBWS180203119",
            "dpc": "03014506201",
            "name": "យ៉ាន ឧស្មាន"
        },
        {
            "barcode": "BBWS180203120",
            "dpc": "03014506401",
            "name": "នេះ យាកតូក"
        },
        {
            "barcode": "BBWS180203121",
            "dpc": "03014506601",
            "name": "វី ចំរើន"
        },
        {
            "barcode": "BBWS180203122",
            "dpc": "03014506701",
            "name": "ផាត ចាន់រិទ្ធ"
        },
        {
            "barcode": "BBWS180203123",
            "dpc": "03014507001",
            "name": "ប៊ូរ វណ្ណនី"
        },
        {
            "barcode": "BBWS180203124",
            "dpc": "03014507101",
            "name": "ចាន់ សេង"
        },
        {
            "barcode": "BBWS180203125",
            "dpc": "03014507501",
            "name": "ឈិន សុចិត្រា"
        },
        {
            "barcode": "BBWS180203126",
            "dpc": "03014507401",
            "name": "ខៀវ វិចិត្ត"
        },
        {
            "barcode": "BBWS180203127",
            "dpc": "03014507701",
            "name": "សុង ញឹប"
        },
        {
            "barcode": "BBWS180203128",
            "dpc": "03014507801",
            "name": "លិក ហ្វិចលាង"
        },
        {
            "barcode": "BBWS180203129",
            "dpc": "03014508001",
            "name": "បឹង រាត្រី"
        },
        {
            "barcode": "BBWS180203130",
            "dpc": "03014511101",
            "name": "សុស សាវន្ត័"
        },
        {
            "barcode": "BBWS180203131",
            "dpc": "03014514401",
            "name": "ធួ គន្ធី"
        },
        {
            "barcode": "BBWS180203132",
            "dpc": "03014514801",
            "name": "គឹម សារី"
        },
        {
            "barcode": "BBWS180203133",
            "dpc": "03014514901",
            "name": "ជ ពន្លឺ"
        },
        {
            "barcode": "BBWS180203134",
            "dpc": "03014515001",
            "name": "អៀង រិន"
        },
        {
            "barcode": "BBWS180203135",
            "dpc": "03014515301",
            "name": "ហ៊ីង សុផល"
        },
        {
            "barcode": "BBWS180203136",
            "dpc": "03014515501",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "BBWS180203137",
            "dpc": "03014515701",
            "name": "ភោគ តុល"
        },
        {
            "barcode": "BBWS180203139",
            "dpc": "03014516101",
            "name": "រូម សារិន"
        },
        {
            "barcode": "BBWS180203140",
            "dpc": "03014516201",
            "name": "ហម យ៉ាង"
        },
        {
            "barcode": "BBWS180203141",
            "dpc": "03014515401",
            "name": "ចាប ដា"
        },
        {
            "barcode": "BBWS180203142",
            "dpc": "03014516301",
            "name": "ធឹម សុផា"
        },
        {
            "barcode": "BBWS180203143",
            "dpc": "03014516701",
            "name": "យ៉ុង តុងហាន់"
        },
        {
            "barcode": "BBWS180203144",
            "dpc": "03014516801",
            "name": "ចែង យិញ"
        },
        {
            "barcode": "BBWS180203145",
            "dpc": "03014517001",
            "name": "ឡោ សុខុម"
        },
        {
            "barcode": "BBWS180203146",
            "dpc": "03014517301",
            "name": "ឈួន ចាន់ណា"
        },
        {
            "barcode": "BBWS180203147",
            "dpc": "03014517501",
            "name": "ថន សុខគង់"
        },
        {
            "barcode": "BBWS180203148",
            "dpc": "03014517701",
            "name": "ឡី មុំ"
        },
        {
            "barcode": "BBWS180203149",
            "dpc": "03014517801",
            "name": "ទេស សុវណ្ណ"
        },
        {
            "barcode": "BBWS180203150",
            "dpc": "03014521501",
            "name": "តែ លីហេង"
        },
        {
            "barcode": "BBWS180203151",
            "dpc": "03014521401",
            "name": "តឹម ទេព"
        },
        {
            "barcode": "BBWS180203152",
            "dpc": "03014517901",
            "name": "ផេង សុពៅ"
        },
        {
            "barcode": "BBWS180203153",
            "dpc": "03014518001",
            "name": "ពេជ្រ វិរៈ"
        },
        {
            "barcode": "BBWS180203154",
            "dpc": "03014521301",
            "name": "ង៉ែត ភ័ណ្ឌ"
        },
        {
            "barcode": "BBWS180203155",
            "dpc": "03014518101",
            "name": "រិន សំភី"
        },
        {
            "barcode": "BBWS180203156",
            "dpc": "03014518201",
            "name": "ពិន វន"
        },
        {
            "barcode": "BBWS180203157",
            "dpc": "03014521201",
            "name": "ឌី សុខខេន"
        },
        {
            "barcode": "BBWS180203158",
            "dpc": "03014518301",
            "name": "យ៉ម សុភារៈ"
        },
        {
            "barcode": "BBWS180203159",
            "dpc": "03014521101",
            "name": "អ៊ុំ ណាលះ"
        },
        {
            "barcode": "BBWS180203160",
            "dpc": "03014518401",
            "name": "យី ម៉ៅ"
        },
        {
            "barcode": "BBWS180203161",
            "dpc": "03014518501",
            "name": "សយ ឈួន"
        },
        {
            "barcode": "BBWS180203162",
            "dpc": "03014518601",
            "name": "ខៀវ ភិរម្យ"
        },
        {
            "barcode": "BBWS180203163",
            "dpc": "03014518701",
            "name": "បាំង ភូមរ៉ា"
        },
        {
            "barcode": "BBWS180203164",
            "dpc": "03014518801",
            "name": "សឿ  ប៊ាន"
        },
        {
            "barcode": "BBWS180203166",
            "dpc": "03014518901",
            "name": "សុន សឿម"
        },
        {
            "barcode": "BBWS180203167",
            "dpc": "03014519001",
            "name": "ខង ខាន់ឌី"
        },
        {
            "barcode": "BBWS180203168",
            "dpc": "03014519101",
            "name": "សំ បូ"
        },
        {
            "barcode": "BBWS180203169",
            "dpc": "03014520901",
            "name": "ជុំ ធឺត"
        },
        {
            "barcode": "BBWS180203170",
            "dpc": "03014519201",
            "name": "ជៀម ឡៃ"
        },
        {
            "barcode": "BBWS180203171",
            "dpc": "03014520801",
            "name": "ម៉ុម ធូរ៉ា"
        },
        {
            "barcode": "BBWS180203172",
            "dpc": "03014520701",
            "name": "ស្មាន ម៉ាស៊ីតោះ"
        },
        {
            "barcode": "BBWS180203173",
            "dpc": "03014520601",
            "name": "អុល សុវណ្ណរិទ្ធ"
        },
        {
            "barcode": "BBWS180203174",
            "dpc": "03014520501",
            "name": "ម៉ក ទូច"
        },
        {
            "barcode": "BBWS180203175",
            "dpc": "03014520401",
            "name": "អា ណេ"
        },
        {
            "barcode": "BBWS180203176",
            "dpc": "03014520301",
            "name": "វី នេត"
        },
        {
            "barcode": "BBWS180203177",
            "dpc": "03014519301",
            "name": "សោម ប៊ន"
        },
        {
            "barcode": "BBWS180203178",
            "dpc": "03014519401",
            "name": "ហួន ច័ន្ទរ៉ា"
        },
        {
            "barcode": "BBWS180203179",
            "dpc": "03014519501",
            "name": "ឈុន យ៉ុន"
        },
        {
            "barcode": "BBWS180203180",
            "dpc": "03014519601",
            "name": "ផាត ភារិទ្ធ"
        },
        {
            "barcode": "BBWS180203181",
            "dpc": "03014519701",
            "name": "មួន ជៀន"
        },
        {
            "barcode": "BBWS180203182",
            "dpc": "03014519801",
            "name": "ជួប ប៉ិច"
        },
        {
            "barcode": "BBWS180203183",
            "dpc": "03014519901",
            "name": "យិន វ៉ានឈួង"
        },
        {
            "barcode": "BBWS180203184",
            "dpc": "03014520001",
            "name": "ពេជ្រ សារ៉ាត"
        },
        {
            "barcode": "BBWS180203185",
            "dpc": "03014520101",
            "name": "ប៉ុសិ៍នគរបាលអូរដំបង"
        },
        {
            "barcode": "BBWS180203186",
            "dpc": "03014520201",
            "name": "សាលាឃុំអូរដំបង"
        },
        {
            "barcode": "BBWS180203187",
            "dpc": "03014508301",
            "name": "សំ វុន"
        },
        {
            "barcode": "BBWS180203188",
            "dpc": "03014508401",
            "name": "ជេត ស៊ន"
        },
        {
            "barcode": "BBWS180203189",
            "dpc": "03014509001",
            "name": "លុយ ដារ៉ា"
        },
        {
            "barcode": "BBWS180203190",
            "dpc": "03014509501",
            "name": "គ្រួច សំអឿន"
        },
        {
            "barcode": "BBWS180203191",
            "dpc": "03014509901",
            "name": "ចេវ ឈើយ"
        },
        {
            "barcode": "BBWS180203192",
            "dpc": "03014510201",
            "name": "យ៉េម អែល"
        },
        {
            "barcode": "BBWS180203193",
            "dpc": "03014510301",
            "name": "ទេព សាមុន"
        },
        {
            "barcode": "BBWS180203194",
            "dpc": "03014511001",
            "name": "សាលាជំនីក"
        },
        {
            "barcode": "BBWS180203195",
            "dpc": "03014511401",
            "name": "រៀម ដារា"
        },
        {
            "barcode": "BBWS180203196",
            "dpc": "03014511601",
            "name": "ទីសត្តឃាត ស/សង្កែរ"
        },
        {
            "barcode": "BBWS180203197",
            "dpc": "03014512401",
            "name": "អ៊ូរ ម៉ាក"
        },
        {
            "barcode": "BBWS180203198",
            "dpc": "03014512601",
            "name": "យ៉ាន ហាន"
        },
        {
            "barcode": "BBWS180203199",
            "dpc": "03014512701",
            "name": "សឿន ធី"
        },
        {
            "barcode": "BBWS180203200",
            "dpc": "03014512801",
            "name": "ឯក ស៊ន"
        },
        {
            "barcode": "BBWS180203201",
            "dpc": "03014513201",
            "name": "វ៉ាត វុន"
        },
        {
            "barcode": "BBWS180203202",
            "dpc": "03014513401",
            "name": "សឿន សឿម"
        },
        {
            "barcode": "BBWS180203203",
            "dpc": "03014513801",
            "name": "ឡាច វីឡា"
        },
        {
            "barcode": "BBWS180203204",
            "dpc": "03014514001",
            "name": "រឿម ឈន"
        },
        {
            "barcode": "BBWS180203205",
            "dpc": "03014514201",
            "name": "ពេជ្រ វើន"
        },
        {
            "barcode": "BBWS180203206",
            "dpc": "03014500301",
            "name": "ស៊ុយ សឿប"
        },
        {
            "barcode": "BBWS180203207",
            "dpc": "03014500801",
            "name": "សោម វុទ្ធី"
        },
        {
            "barcode": "BBWS180203208",
            "dpc": "03014501001",
            "name": "ព្រាប សារឿន"
        },
        {
            "barcode": "BBWS180203209",
            "dpc": "03014501701",
            "name": "ម៉ក់ ទូច"
        },
        {
            "barcode": "BBWS180203210",
            "dpc": "03014502001",
            "name": "ឡេង ណារី"
        },
        {
            "barcode": "BBWS180203211",
            "dpc": "03014503301",
            "name": "ឈឺន វើន"
        },
        {
            "barcode": "BBWS180203212",
            "dpc": "03014503701",
            "name": "ម៉ម មួន"
        },
        {
            "barcode": "BBWS180203213",
            "dpc": "03014504101",
            "name": "ម៉ុក ដារ៉ាឌីកា"
        },
        {
            "barcode": "BBWS180203214",
            "dpc": "03014504401",
            "name": "នី រស្មី"
        },
        {
            "barcode": "BBWS180203215",
            "dpc": "03014504901",
            "name": "ស៊ុន ស៊ែម"
        },
        {
            "barcode": "BBWS180203216",
            "dpc": "03014505001",
            "name": "ឈឿត សារឿត"
        },
        {
            "barcode": "BBWS180203217",
            "dpc": "03014505301",
            "name": "គង់ លន"
        },
        {
            "barcode": "BBWS180203218",
            "dpc": "03014505701",
            "name": "វ៉ាន់ ណាវី"
        },
        {
            "barcode": "BBWS180203219",
            "dpc": "03014505901",
            "name": "វ៉ៃ ប៉ូ"
        },
        {
            "barcode": "BBWS180203220",
            "dpc": "03014506101",
            "name": "អែវ និមល"
        },
        {
            "barcode": "BBWS180203221",
            "dpc": "03014506301",
            "name": "យ៉ើ សោហ្វី"
        },
        {
            "barcode": "BBWS180203222",
            "dpc": "03014506501",
            "name": "ម៉ែន ធារ៉ា"
        },
        {
            "barcode": "BBWS180203223",
            "dpc": "03014506801",
            "name": "ប៊ី ហន"
        },
        {
            "barcode": "BBWS180203224",
            "dpc": "03014506901",
            "name": "ហូវ ហៀប"
        },
        {
            "barcode": "BBWS180203225",
            "dpc": "03014507901",
            "name": "សុត សុជាតិ"
        },
        {
            "barcode": "BBWS180203226",
            "dpc": "03014514301",
            "name": "សាលាបឋមសិក្សាវត្តតាមិម"
        },
        {
            "barcode": "BBWS180203227",
            "dpc": "03014514501",
            "name": "ញ៉ូង​ ប៉ាន់"
        },
        {
            "barcode": "BBWS180203228",
            "dpc": "03014514601",
            "name": "ចៅ សុផានី"
        },
        {
            "barcode": "BBWS180203229",
            "dpc": "03014514701",
            "name": "អ៊ុល ឯក"
        },
        {
            "barcode": "BBWS180203230",
            "dpc": "03014515101",
            "name": "កែវ វេត"
        },
        {
            "barcode": "BBWS180203231",
            "dpc": "03014515201",
            "name": "សៀន កញ្ចារ៉ា"
        },
        {
            "barcode": "BBWS180203232",
            "dpc": "03014515901",
            "name": "ចែម សេង"
        },
        {
            "barcode": "BBWS180203233",
            "dpc": "03014516001",
            "name": "រ៉ុង ចន្តា"
        },
        {
            "barcode": "BBWS180203234",
            "dpc": "03014516401",
            "name": "ស៊ូយ វណ្ណ"
        },
        {
            "barcode": "BBWS180203235",
            "dpc": "03014516601",
            "name": "យន ចាន់ដារ៉ា"
        },
        {
            "barcode": "BBWS180203236",
            "dpc": "03014516901",
            "name": "រុន ដានី"
        },
        {
            "barcode": "BBWS180203237",
            "dpc": "03014517101",
            "name": "កឺ គឹមសៀង"
        },
        {
            "barcode": "BBWS180203238",
            "dpc": "03014517201",
            "name": "អៀង ចាន់ធា"
        },
        {
            "barcode": "BBWS180203239",
            "dpc": "03014517401",
            "name": "សេង ខុម"
        },
        {
            "barcode": "BBWS180203240",
            "dpc": "03014517601",
            "name": "ចាប ស្មាន"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
