let start=moment('2018-02-01').toDate();
let end=moment('2018-02-28').toDate();

let barcodes=

    [
        {
            "barcode": "BBWS180201152",
            "dpc": "03044602001",
            "name": "ហេង ង៉ោ"
        },
        {
            "barcode": "BBWS180201153",
            "dpc": "03044600101",
            "name": "ណាក់ តារា"
        },
        {
            "barcode": "BBWS180201154",
            "dpc": "03044600201",
            "name": "យឿ ចរិត"
        },
        {
            "barcode": "BBWS180201155",
            "dpc": "03044600301",
            "name": "ហេង ណា"
        },
        {
            "barcode": "BBWS180201156",
            "dpc": "03044600401",
            "name": "បាន ឈាន"
        },
        {
            "barcode": "BBWS180201157",
            "dpc": "03044600501",
            "name": "យ៉ម ថន"
        },
        {
            "barcode": "BBWS180201158",
            "dpc": "03044600601",
            "name": "ឆម ធារ៉ា"
        },
        {
            "barcode": "BBWS180201159",
            "dpc": "03044600701",
            "name": "វ៉ា លឿន"
        },
        {
            "barcode": "BBWS180201160",
            "dpc": "03044600801",
            "name": "ខន ឃន"
        },
        {
            "barcode": "BBWS180201161",
            "dpc": "03044600901",
            "name": "ខន សារិ"
        },
        {
            "barcode": "BBWS180201162",
            "dpc": "03044601001",
            "name": "ខេង ប៊ុនយុន"
        },
        {
            "barcode": "BBWS180201163",
            "dpc": "03044601101",
            "name": "ធីន ចំរើន"
        },
        {
            "barcode": "BBWS180201164",
            "dpc": "03044601301",
            "name": "រេ តាប"
        },
        {
            "barcode": "BBWS180201165",
            "dpc": "03044601401",
            "name": "ណៃ ហៀប"
        },
        {
            "barcode": "BBWS180201166",
            "dpc": "03044601501",
            "name": "វ៉ាត់ អួម"
        },
        {
            "barcode": "BBWS180201167",
            "dpc": "03044601601",
            "name": "តូច ឌី"
        },
        {
            "barcode": "BBWS180201168",
            "dpc": "03044601701",
            "name": "ហុន ឈុនហាក់"
        },
        {
            "barcode": "BBWS180201169",
            "dpc": "03044601801",
            "name": "ឃុន តឿ"
        },
        {
            "barcode": "BBWS180201170",
            "dpc": "03044601901",
            "name": "នួន ចំរើន"
        },
        {
            "barcode": "BBWS180201171",
            "dpc": "03044602101",
            "name": "គឹម ចាន់ដេត"
        },
        {
            "barcode": "BBWS180201172",
            "dpc": "03044602201",
            "name": "លី ហួរ"
        },
        {
            "barcode": "BBWS180201173",
            "dpc": "03044602301",
            "name": "ណន រស្មី"
        },
        {
            "barcode": "BBWS180201174",
            "dpc": "03044602401",
            "name": "មួល នី"
        },
        {
            "barcode": "BBWS180201175",
            "dpc": "03044602501",
            "name": "វ៉ាន់ រុនរឿន"
        },
        {
            "barcode": "BBWS180201176",
            "dpc": "03044602601",
            "name": "ស៊ិន ឃួន"
        },
        {
            "barcode": "BBWS180201177",
            "dpc": "03044602701",
            "name": "ប៊ុន ដន"
        },
        {
            "barcode": "BBWS180201178",
            "dpc": "03044603001",
            "name": "សេង សារឿន"
        },
        {
            "barcode": "BBWS180201179",
            "dpc": "03044603101",
            "name": "សួល ដានី"
        },
        {
            "barcode": "BBWS180201180",
            "dpc": "03044603201",
            "name": "សុខ ម៉ា"
        },
        {
            "barcode": "BBWS180201181",
            "dpc": "03044603301",
            "name": "ពៅ វណ្ណា"
        },
        {
            "barcode": "BBWS180201182",
            "dpc": "03044603401",
            "name": "ជិង គឹមហុង"
        },
        {
            "barcode": "BBWS180201183",
            "dpc": "03044603501",
            "name": "ប៉ោ ឌៀប"
        },
        {
            "barcode": "BBWS180201184",
            "dpc": "03044603801",
            "name": "គង់ ភក្តី"
        },
        {
            "barcode": "BBWS180201185",
            "dpc": "03044603901",
            "name": "ឃិន ណារិន"
        },
        {
            "barcode": "BBWS180201186",
            "dpc": "03044604001",
            "name": "ស៊ឹម អេង"
        },
        {
            "barcode": "BBWS180201187",
            "dpc": "03044604101",
            "name": "ប៊ុន តាណា"
        },
        {
            "barcode": "BBWS180201188",
            "dpc": "03044604201",
            "name": "ទី សុខាន់នី"
        },
        {
            "barcode": "BBWS180201189",
            "dpc": "03044604301",
            "name": "ទៀង សំបូរ"
        },
        {
            "barcode": "BBWS180201190",
            "dpc": "03044604401",
            "name": "រឿម ដាលីន"
        },
        {
            "barcode": "BBWS180201191",
            "dpc": "03044604601",
            "name": "សាំ សារុំ"
        },
        {
            "barcode": "BBWS180201192",
            "dpc": "03044604701",
            "name": "ឆ្លង សុខណៃ"
        },
        {
            "barcode": "BBWS180201193",
            "dpc": "03044604801",
            "name": "អ៊ី សុខរ៉ុង"
        },
        {
            "barcode": "BBWS180201194",
            "dpc": "03044604901",
            "name": "គឹម ហេង"
        },
        {
            "barcode": "BBWS180201195",
            "dpc": "03044605001",
            "name": "ម៉ៅ រ៉ាមិជ"
        },
        {
            "barcode": "BBWS180201196",
            "dpc": "03044605101",
            "name": "ហីង ចិន្តា"
        },
        {
            "barcode": "BBWS180201197",
            "dpc": "03044605201",
            "name": "សេង ហ៊ុល"
        },
        {
            "barcode": "BBWS180201198",
            "dpc": "03044605301",
            "name": "ទិត្យ រស្មី"
        },
        {
            "barcode": "BBWS180201199",
            "dpc": "03044605401",
            "name": "ស៊ិន សានឈិន្នី"
        },
        {
            "barcode": "BBWS180201200",
            "dpc": "03044605501",
            "name": "ទឹម សេងហ៊ួ"
        },
        {
            "barcode": "BBWS180201201",
            "dpc": "03044605601",
            "name": "កែវ សារឿន"
        },
        {
            "barcode": "BBWS180201202",
            "dpc": "03044605801",
            "name": "ឌុច ហាក់"
        },
        {
            "barcode": "BBWS180201203",
            "dpc": "03044605901",
            "name": "ថាប់ សាវង្ស"
        },
        {
            "barcode": "BBWS180201204",
            "dpc": "03044606001",
            "name": "នី វណ្ណះ"
        },
        {
            "barcode": "BBWS180201205",
            "dpc": "03044606101",
            "name": "រ៉ាក យ៉ាន"
        },
        {
            "barcode": "BBWS180201206",
            "dpc": "03044606301",
            "name": "ស៊ត សូល័ក"
        },
        {
            "barcode": "BBWS180201207",
            "dpc": "03044606401",
            "name": "ពៅ រ៉ាន"
        },
        {
            "barcode": "BBWS180201208",
            "dpc": "03044606501",
            "name": "រឿន ភឿត"
        },
        {
            "barcode": "BBWS180201209",
            "dpc": "03044606601",
            "name": "ទៀង វុទ្ធី"
        },
        {
            "barcode": "BBWS180201210",
            "dpc": "03044606701",
            "name": "កៅ អ៊ុកប៊ុនធឿន"
        },
        {
            "barcode": "BBWS180201211",
            "dpc": "03044606801",
            "name": "មិញ ចាន់សី"
        },
        {
            "barcode": "BBWS180201212",
            "dpc": "03044606901",
            "name": "ឡោះ រៀម"
        },
        {
            "barcode": "BBWS180201213",
            "dpc": "03044607001",
            "name": "ឈិម សុផល"
        },
        {
            "barcode": "BBWS180201214",
            "dpc": "03044607101",
            "name": "ឃុន ណាក់"
        },
        {
            "barcode": "BBWS180201215",
            "dpc": "03044607201",
            "name": "តន់ ហាន"
        },
        {
            "barcode": "BBWS180201216",
            "dpc": "03044607301",
            "name": "កើ សុជាតិ"
        },
        {
            "barcode": "BBWS180201217",
            "dpc": "03044607401",
            "name": "លី ម៉ាឌី"
        },
        {
            "barcode": "BBWS180201218",
            "dpc": "03044607501",
            "name": "សេង ណប់"
        },
        {
            "barcode": "BBWS180201219",
            "dpc": "03044607601",
            "name": "លឹម សុខា"
        },
        {
            "barcode": "BBWS180201220",
            "dpc": "03044607701",
            "name": "ម៉ាក់ សេន"
        },
        {
            "barcode": "BBWS180201221",
            "dpc": "03044607801",
            "name": "លី តន"
        },
        {
            "barcode": "BBWS180201222",
            "dpc": "03044608001",
            "name": "អ៊ុន សាវុធ"
        },
        {
            "barcode": "BBWS180201223",
            "dpc": "03044608101",
            "name": "ឈូក សារេត"
        },
        {
            "barcode": "BBWS180201224",
            "dpc": "03044608201",
            "name": "បឿ ម៉ុន"
        },
        {
            "barcode": "BBWS180201225",
            "dpc": "03044608301",
            "name": "ព្រេ សាវិន"
        },
        {
            "barcode": "BBWS180201226",
            "dpc": "03044608401",
            "name": "ហៀង ចិត្រា"
        },
        {
            "barcode": "BBWS180201227",
            "dpc": "03044608601",
            "name": "រេន សារី"
        },
        {
            "barcode": "BBWS180201228",
            "dpc": "03044608801",
            "name": "មុត សឿត"
        },
        {
            "barcode": "BBWS180201229",
            "dpc": "03044609101",
            "name": "ហ៊យ ប៊ុនរឿន"
        },
        {
            "barcode": "BBWS180201230",
            "dpc": "03044609201",
            "name": "វង្ស"
        },
        {
            "barcode": "BBWS180201231",
            "dpc": "03044609301",
            "name": "ង៉ែត វណ្ណនី"
        },
        {
            "barcode": "BBWS180201232",
            "dpc": "03044609401",
            "name": "មាន យៀប"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
