let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=

    [
        {
            "barcode": "171137046",
            "dpc": "03010140801",
            "name": "កែវ ឃឿន"
        },
        {
            "barcode": "171137047",
            "dpc": "03010140901",
            "name": "ប៊ូ ប៊ុនសត្ថា"
        },
        {
            "barcode": "171137048",
            "dpc": "03010141001",
            "name": "សេង ឈុនឡាយ"
        },
        {
            "barcode": "171137049",
            "dpc": "03010141101",
            "name": "ជា មន្នា"
        },
        {
            "barcode": "171137050",
            "dpc": "03010141201",
            "name": "ស្រី ប៊ុនម៉ា"
        },
        {
            "barcode": "171137051",
            "dpc": "03010141301",
            "name": "សេក ស៊ីនួន"
        },
        {
            "barcode": "171137052",
            "dpc": "03010141401",
            "name": "ពៅ ឌឿន"
        },
        {
            "barcode": "171137053",
            "dpc": "03010141501",
            "name": "សេក ធីតា"
        },
        {
            "barcode": "171137054",
            "dpc": "03010141601",
            "name": "ប៉ែន ធីតា"
        },
        {
            "barcode": "171137055",
            "dpc": "03010141701",
            "name": "ជិម ចិន្តា"
        },
        {
            "barcode": "171137056",
            "dpc": "03010141801",
            "name": "ជឹម រឿងរិឡ"
        },
        {
            "barcode": "171137057",
            "dpc": "03010141901",
            "name": "គឹម ចាន់ម៉ាលី"
        },
        {
            "barcode": "171137058",
            "dpc": "03010142401",
            "name": "ឡូត ហឿន"
        },
        {
            "barcode": "171137059",
            "dpc": "03010142201",
            "name": "ព្រំ សុផៃ"
        },
        {
            "barcode": "171137060",
            "dpc": "03010142301",
            "name": "ព្រំ សុផង់"
        },
        {
            "barcode": "171137061",
            "dpc": "03010142001",
            "name": "ប៊ុន ចាន់នី"
        },
        {
            "barcode": "171137062",
            "dpc": "03010142701",
            "name": "កែវ គឹមលី"
        },
        {
            "barcode": "171137063",
            "dpc": "03010142801",
            "name": "លឹម សូសាគុណ"
        },
        {
            "barcode": "171137064",
            "dpc": "03010142901",
            "name": "ហេង វុទ្ធី"
        },
        {
            "barcode": "171137065",
            "dpc": "03010143001",
            "name": "ប៉ោ ជិនជូ"
        },
        {
            "barcode": "171137066",
            "dpc": "03010143101",
            "name": "លឹម គៀវ"
        },
        {
            "barcode": "171137067",
            "dpc": "03010143201",
            "name": "ឱ សាអាល់"
        },
        {
            "barcode": "171137068",
            "dpc": "03010143301",
            "name": "ហួត ញ៉"
        },
        {
            "barcode": "171137069",
            "dpc": "03010143401",
            "name": "ហាវ អាន"
        },
        {
            "barcode": "171137070",
            "dpc": "03010143601",
            "name": "លី ហ៊ាង"
        },
        {
            "barcode": "171137071",
            "dpc": "03010143701",
            "name": "នូ សុខឃឿន"
        },
        {
            "barcode": "171137072",
            "dpc": "03010143801",
            "name": "នូ សុខខឿត"
        },
        {
            "barcode": "171137073",
            "dpc": "03010143901",
            "name": "នូ សុគន្ធ"
        },
        {
            "barcode": "171137074",
            "dpc": "03010144001",
            "name": "កែវ រិទ្ធ"
        },
        {
            "barcode": "171137075",
            "dpc": "03010144101",
            "name": "ដាំ សុធា"
        },
        {
            "barcode": "171137076",
            "dpc": "03010144201",
            "name": "សេក សោភ័ណ្ឌ"
        },
        {
            "barcode": "171137077",
            "dpc": "03010144301",
            "name": "ចៅ គឹមឡេង"
        },
        {
            "barcode": "171137078",
            "dpc": "03010144401",
            "name": "លឹម គឹមណា"
        },
        {
            "barcode": "171137079",
            "dpc": "03010144501",
            "name": "តាំង លឹម"
        },
        {
            "barcode": "171137080",
            "dpc": "03010144601",
            "name": "សោ ស្រីណុច"
        },
        {
            "barcode": "171137081",
            "dpc": "03010144701",
            "name": "លី យ៉ាន"
        },
        {
            "barcode": "171137082",
            "dpc": "03010144801",
            "name": "យ៉ាវ គង់"
        },
        {
            "barcode": "171137083",
            "dpc": "03010144901",
            "name": "ឯម សារិន"
        },
        {
            "barcode": "171137084",
            "dpc": "03010145001",
            "name": "លាង ហុង"
        },
        {
            "barcode": "171137085",
            "dpc": "03010145101",
            "name": "ប៉ាល់  កាណា"
        },
        {
            "barcode": "171137086",
            "dpc": "03010145201",
            "name": "យ៉ុម ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171137087",
            "dpc": "03010145301",
            "name": "ស៊ីម ផល្លី"
        },
        {
            "barcode": "171137088",
            "dpc": "03010145401",
            "name": "ប្រាក សារី"
        },
        {
            "barcode": "171137089",
            "dpc": "03010145501",
            "name": "ស្រេង ស្រូន"
        },
        {
            "barcode": "171137090",
            "dpc": "03010145601",
            "name": "គឹម សូភី"
        },
        {
            "barcode": "171137091",
            "dpc": "03010145701",
            "name": "ដេង  ផល់"
        },
        {
            "barcode": "171137092",
            "dpc": "03010145801",
            "name": "ឈន សុភា ១"
        },
        {
            "barcode": "171137093",
            "dpc": "03010145901",
            "name": "ឈន សារឿន"
        },
        {
            "barcode": "171137094",
            "dpc": "03010146101",
            "name": "អង សំអយ"
        },
        {
            "barcode": "171137095",
            "dpc": "03010146201",
            "name": "ឈន សុភា ២"
        },
        {
            "barcode": "171137096",
            "dpc": "03010146301",
            "name": "ស៊ឹម សំណាង"
        },
        {
            "barcode": "171137097",
            "dpc": "03010146401",
            "name": "នាល ហ៊ិន"
        },
        {
            "barcode": "171137098",
            "dpc": "03010146501",
            "name": "សន សុង"
        },
        {
            "barcode": "171137099",
            "dpc": "03010146601",
            "name": "ចាន់ ធូ"
        },
        {
            "barcode": "171137100",
            "dpc": "03010146701",
            "name": "ហូ ង៉ា"
        },
        {
            "barcode": "171137101",
            "dpc": "03010146901",
            "name": "ញ៉ាន់ សុភិន"
        },
        {
            "barcode": "171137102",
            "dpc": "03010147001",
            "name": "នើន ភុំ"
        },
        {
            "barcode": "171137103",
            "dpc": "03010147101",
            "name": "កែន កន"
        },
        {
            "barcode": "171137104",
            "dpc": "03010142501",
            "name": "ក្រម សារឿយ"
        },
        {
            "barcode": "171137105",
            "dpc": "03010142601",
            "name": "ចន ធឿន"
        },
        {
            "barcode": "171137106",
            "dpc": "03010146801",
            "name": "អ៊ឹង សំបូរ"
        },
        {
            "barcode": "171137107",
            "dpc": "03010147201",
            "name": "សេង ថង"
        },
        {
            "barcode": "171137108",
            "dpc": "03010147301",
            "name": "សុង វណ្ណា"
        },
        {
            "barcode": "171137109",
            "dpc": "03010147401",
            "name": "លៀង អ៊ួច"
        },
        {
            "barcode": "171137110",
            "dpc": "03010147501",
            "name": "ស្រូច ម៉ៅ"
        },
        {
            "barcode": "171137111",
            "dpc": "03010147601",
            "name": "ស៊ុន មី"
        },
        {
            "barcode": "171137112",
            "dpc": "03010147801",
            "name": "សួស សារី"
        },
        {
            "barcode": "171137113",
            "dpc": "03010138901",
            "name": "នៅ សោភ័ណ្ឌ"
        },
        {
            "barcode": "171137114",
            "dpc": "03010139001",
            "name": "ហ៊ី គា"
        },
        {
            "barcode": "171137115",
            "dpc": "03010139101",
            "name": "ផែ អ៊ីវ"
        },
        {
            "barcode": "171137116",
            "dpc": "03010139201",
            "name": "ជឹម បូរ៉ា"
        },
        {
            "barcode": "171137117",
            "dpc": "03010139301",
            "name": "វង្ស លន់"
        },
        {
            "barcode": "171137118",
            "dpc": "03010139401",
            "name": "គឹម ហុង"
        },
        {
            "barcode": "171137119",
            "dpc": "03010139501",
            "name": "ងួន ចាន់ថន"
        },
        {
            "barcode": "171137120",
            "dpc": "03010139601",
            "name": "អឿន សារួន"
        },
        {
            "barcode": "171137121",
            "dpc": "03010139801",
            "name": "អឿន កែវ"
        },
        {
            "barcode": "171137122",
            "dpc": "03010139901",
            "name": "គួច   ជួ"
        },
        {
            "barcode": "171137123",
            "dpc": "03010140001",
            "name": "ឈឹម វណ្ណា"
        },
        {
            "barcode": "171137124",
            "dpc": "03010140101",
            "name": "ណ  លីណា"
        },
        {
            "barcode": "171137125",
            "dpc": "03010140201",
            "name": "ប្រាក់ សាមឿន"
        },
        {
            "barcode": "171137126",
            "dpc": "03010140301",
            "name": "លឿម ឡៃ"
        },
        {
            "barcode": "171137127",
            "dpc": "03010147701",
            "name": "រី សារ៉ាក់"
        },
        {
            "barcode": "171137128",
            "dpc": "03010147901",
            "name": "សេង សុរ័ត្ន"
        },
        {
            "barcode": "171137129",
            "dpc": "03010138701",
            "name": "ឈិន វណ្ណដា"
        },
        {
            "barcode": "171137130",
            "dpc": "03010138601",
            "name": "អ៊ិត   វើន"
        },
        {
            "barcode": "171137131",
            "dpc": "03010138401",
            "name": "ឱ សុភី"
        },
        {
            "barcode": "171137132",
            "dpc": "03010138301",
            "name": "ទេព វុទ្ធី"
        },
        {
            "barcode": "171137133",
            "dpc": "03010138201",
            "name": "ម៉ា ជា"
        },
        {
            "barcode": "171137134",
            "dpc": "03010138101",
            "name": "យក់ វ៉ាន់"
        },
        {
            "barcode": "171137135",
            "dpc": "03010138001",
            "name": "តូច សៀក"
        },
        {
            "barcode": "171137136",
            "dpc": "03010137901",
            "name": "ហែម បូរី"
        },
        {
            "barcode": "171137137",
            "dpc": "03010137801",
            "name": "នួន ចំរើន"
        },
        {
            "barcode": "171137138",
            "dpc": "03010137701",
            "name": "កា តិមួយ"
        },
        {
            "barcode": "171137139",
            "dpc": "03010135401",
            "name": "ស៊ីត ស្មាន់"
        },
        {
            "barcode": "171137140",
            "dpc": "03010135501",
            "name": "តា ក្រូច"
        },
        {
            "barcode": "171137141",
            "dpc": "03010138801",
            "name": "ជា ឆេង"
        },
        {
            "barcode": "171137142",
            "dpc": "03010135601",
            "name": "ងួន ហេង"
        },
        {
            "barcode": "171137143",
            "dpc": "03010135701",
            "name": "ឈឹម ម៉ាលី"
        },
        {
            "barcode": "171137144",
            "dpc": "03010135801",
            "name": "សុខ ស៊ីវង្ស"
        },
        {
            "barcode": "171137145",
            "dpc": "03010135901",
            "name": "កៅ សុខា"
        },
        {
            "barcode": "171137146",
            "dpc": "03010136001",
            "name": "សែម សារិន"
        },
        {
            "barcode": "171137147",
            "dpc": "03010136101",
            "name": "ស្រី វឿត"
        },
        {
            "barcode": "171137148",
            "dpc": "03010136201",
            "name": "កាំង ប៊ុនឡុង"
        },
        {
            "barcode": "171137149",
            "dpc": "03010136401",
            "name": "ឆន វណ្ណី"
        },
        {
            "barcode": "171137150",
            "dpc": "03010136501",
            "name": "ហេង ស្រីពៅ"
        },
        {
            "barcode": "171137151",
            "dpc": "03010136601",
            "name": "សំ សំអឿន"
        },
        {
            "barcode": "171137152",
            "dpc": "03010136801",
            "name": "សេង សាហ៊ីម១"
        },
        {
            "barcode": "171137153",
            "dpc": "03010136901",
            "name": "សេង សាហ៊ីម២"
        },
        {
            "barcode": "171137154",
            "dpc": "03010137101",
            "name": "អែម សុផល"
        },
        {
            "barcode": "171137155",
            "dpc": "03010137201",
            "name": "ហ៊ុល លី"
        },
        {
            "barcode": "171137156",
            "dpc": "03010137301",
            "name": "ហែន ផល្លា"
        },
        {
            "barcode": "171137157",
            "dpc": "03010137401",
            "name": "យិន សុវណ្ណរិទ្ធ"
        },
        {
            "barcode": "171137158",
            "dpc": "03010137501",
            "name": "ឆូត តង"
        },
        {
            "barcode": "171137159",
            "dpc": "03010137601",
            "name": "ចាន់​ ផា"
        },
        {
            "barcode": "171137160",
            "dpc": "03010118601",
            "name": "គឹម វេង២"
        },
        {
            "barcode": "171137161",
            "dpc": "03010146001",
            "name": "ឈួន ឈ"
        },
        {
            "barcode": "171137162",
            "dpc": "03010116301",
            "name": "ង៉ែត វុទ្ធី"
        },
        {
            "barcode": "171137163",
            "dpc": "03010116401",
            "name": "សេង សុផល ១"
        },
        {
            "barcode": "171137164",
            "dpc": "03010116501",
            "name": "សេង​ សុផល ២"
        },
        {
            "barcode": "171137165",
            "dpc": "03010114801",
            "name": "ឡាញ់ ផាន់ណេ"
        },
        {
            "barcode": "171137166",
            "dpc": "03010114901",
            "name": "ហ៊ុយ ភាជ"
        },
        {
            "barcode": "171137167",
            "dpc": "03010115101",
            "name": "តាំង សុង"
        },
        {
            "barcode": "171137168",
            "dpc": "03010115401",
            "name": "ប្រាក់ ថុង"
        },
        {
            "barcode": "171137169",
            "dpc": "03010115601",
            "name": "កែវ ឃឿង"
        },
        {
            "barcode": "171137170",
            "dpc": "03010115701",
            "name": "ជា វណ្ណៈ"
        },
        {
            "barcode": "171137171",
            "dpc": "03010115801",
            "name": "គង់ ជាង"
        },
        {
            "barcode": "171137172",
            "dpc": "03010115901",
            "name": "ឌុល ពេជ្រ"
        },
        {
            "barcode": "171137173",
            "dpc": "03010116001",
            "name": "ឈួន  ឈន"
        },
        {
            "barcode": "171137174",
            "dpc": "03010116101",
            "name": "ពិន   ទី"
        },
        {
            "barcode": "171137175",
            "dpc": "03010107701",
            "name": "ចាន់ សេង"
        },
        {
            "barcode": "171137176",
            "dpc": "03010107901",
            "name": "ភិន វុទ្ធី ២"
        },
        {
            "barcode": "171137177",
            "dpc": "03010108001",
            "name": "ម៉ៅ ម៉ន"
        },
        {
            "barcode": "171137178",
            "dpc": "03010108101",
            "name": "អេង ណាង"
        },
        {
            "barcode": "171137179",
            "dpc": "03010108201",
            "name": "លី គឹមសាន្ត"
        },
        {
            "barcode": "171137180",
            "dpc": "03010108301",
            "name": "ជៀម ជិន"
        },
        {
            "barcode": "171137181",
            "dpc": "03010108401",
            "name": "ហ៊ុយ ឈឿន"
        },
        {
            "barcode": "171137182",
            "dpc": "03010108501",
            "name": "ប៊ុន បឿន"
        },
        {
            "barcode": "171137183",
            "dpc": "03010108601",
            "name": "ខៀវ សំហាត"
        },
        {
            "barcode": "171137184",
            "dpc": "03010108701",
            "name": "ហាត់ ឡៃឡែ"
        },
        {
            "barcode": "171137185",
            "dpc": "03010108801",
            "name": "វ៉ឹង ហុង"
        },
        {
            "barcode": "171137186",
            "dpc": "03010108901",
            "name": "យឹម យីន"
        },
        {
            "barcode": "171137187",
            "dpc": "03010107801",
            "name": "ភិន វុទ្ធី ១"
        },
        {
            "barcode": "171137188",
            "dpc": "03010109001",
            "name": "សូ កិធិ"
        },
        {
            "barcode": "171137189",
            "dpc": "03010109101",
            "name": "ម៉ី វណ្ណារ៉េត"
        },
        {
            "barcode": "171137190",
            "dpc": "03010109201",
            "name": "សុក រ៉ិត"
        },
        {
            "barcode": "171137191",
            "dpc": "03010109301",
            "name": "ស្ងួន សុផល"
        },
        {
            "barcode": "171137192",
            "dpc": "03010109401",
            "name": "ផាយ សុភ័ក្រ"
        },
        {
            "barcode": "171137193",
            "dpc": "03010109501",
            "name": "ដែង ចន្ធូ"
        },
        {
            "barcode": "171137194",
            "dpc": "03010109601",
            "name": "តែ សេងហ៊ីម"
        },
        {
            "barcode": "171137195",
            "dpc": "03010109701",
            "name": "លាន បុប្ផា"
        },
        {
            "barcode": "171137196",
            "dpc": "03010109801",
            "name": "សេង វ៉ាស៊ីន"
        },
        {
            "barcode": "171137197",
            "dpc": "03010109901",
            "name": "ផែ សុខ"
        },
        {
            "barcode": "171137198",
            "dpc": "03010110101",
            "name": "អួន វុន ១"
        },
        {
            "barcode": "171137199",
            "dpc": "03010110201",
            "name": "អួន វុន ២"
        },
        {
            "barcode": "171137200",
            "dpc": "03010110301",
            "name": "អួន ផល្លី"
        },
        {
            "barcode": "171137201",
            "dpc": "03010110501",
            "name": "គុយ គឹមឈន"
        },
        {
            "barcode": "171137202",
            "dpc": "03010110801",
            "name": "គង ជិនហោ"
        },
        {
            "barcode": "171137203",
            "dpc": "03010110401",
            "name": "សុង គឹមលាភ"
        },
        {
            "barcode": "171137204",
            "dpc": "03010110601",
            "name": "ទុយ សិទ្ធ"
        },
        {
            "barcode": "171137205",
            "dpc": "03010110701",
            "name": "ហេង សុទីនី"
        },
        {
            "barcode": "171137206",
            "dpc": "03010121201",
            "name": "ខៀវ សែ"
        },
        {
            "barcode": "171137207",
            "dpc": "03010121301",
            "name": "ហម សំបូរ"
        },
        {
            "barcode": "171137208",
            "dpc": "03010121401",
            "name": "គឹម បូរិន"
        },
        {
            "barcode": "171137209",
            "dpc": "03010121601",
            "name": "សឿម ដៀប"
        },
        {
            "barcode": "171137210",
            "dpc": "03010122201",
            "name": "លឹម គឹមអេង"
        },
        {
            "barcode": "171137211",
            "dpc": "03010122001",
            "name": "ម៉ក់ ណាគ្រី"
        },
        {
            "barcode": "171137212",
            "dpc": "03010122101",
            "name": "អ៊ឹង ធឹង"
        },
        {
            "barcode": "171137213",
            "dpc": "03010121801",
            "name": "លឿង សារ៉ុន"
        },
        {
            "barcode": "171137214",
            "dpc": "03010121901",
            "name": "ឆាំ សុខា"
        },
        {
            "barcode": "171137215",
            "dpc": "03010122301",
            "name": "សឿ រៀន"
        },
        {
            "barcode": "171137216",
            "dpc": "03010122401",
            "name": "សឿ រិទ្ធ"
        },
        {
            "barcode": "171137217",
            "dpc": "03010122501",
            "name": "ថឹក ម៉ៅ"
        },
        {
            "barcode": "171137218",
            "dpc": "03010122601",
            "name": "ចាន់ គារ"
        },
        {
            "barcode": "171137219",
            "dpc": "03010122901",
            "name": "ថង ដេក"
        },
        {
            "barcode": "171137220",
            "dpc": "03010123001",
            "name": "ចាយ  សារ៉ាន"
        },
        {
            "barcode": "171137221",
            "dpc": "03010123101",
            "name": "សោម សាមុត"
        },
        {
            "barcode": "171137222",
            "dpc": "03010123201",
            "name": "វ៉ាន់ រិទ្ធី"
        },
        {
            "barcode": "171137223",
            "dpc": "03010123301",
            "name": "ហេង ដាវុធ"
        },
        {
            "barcode": "171137224",
            "dpc": "03010123401",
            "name": "ឈុំ ឈួន"
        },
        {
            "barcode": "171137225",
            "dpc": "03010123501",
            "name": "សៅ ញិប"
        },
        {
            "barcode": "171137226",
            "dpc": "03010120201",
            "name": "កែ ខាន់ថន"
        },
        {
            "barcode": "171137227",
            "dpc": "03010120301",
            "name": "ជា យ៉ុង"
        },
        {
            "barcode": "171137228",
            "dpc": "03010120501",
            "name": "ឆាន់ កង"
        },
        {
            "barcode": "171137229",
            "dpc": "03010120601",
            "name": "លឹម សុវណ្ណរិទ្ធ"
        },
        {
            "barcode": "171137230",
            "dpc": "03010120701",
            "name": "ប្រាក់ សូដាវី"
        },
        {
            "barcode": "171137231",
            "dpc": "03010120801",
            "name": "ម៉ាត់ ផល្លី"
        },
        {
            "barcode": "171137232",
            "dpc": "03010120901",
            "name": "អ៊ុយ សារឿន"
        },
        {
            "barcode": "171137233",
            "dpc": "03010121001",
            "name": "ចាយ សារៀន"
        },
        {
            "barcode": "171137234",
            "dpc": "03010121101",
            "name": "យស់ យឿន"
        },
        {
            "barcode": "171137235",
            "dpc": "03010123601",
            "name": "កា រ៉េត"
        },
        {
            "barcode": "171137236",
            "dpc": "03010123701",
            "name": "ស៊ុន សុគន្ធា"
        },
        {
            "barcode": "171137237",
            "dpc": "03010123801",
            "name": "ឡេង រដ្ឋា"
        },
        {
            "barcode": "171137238",
            "dpc": "03010123901",
            "name": "យន់ ប្រម"
        },
        {
            "barcode": "171137239",
            "dpc": "03010124001",
            "name": "ម៉ឹង ម៉ៅ"
        },
        {
            "barcode": "171137240",
            "dpc": "03010124101",
            "name": "ជឹម ប៊ុនរ៉េត"
        },
        {
            "barcode": "171137241",
            "dpc": "03010124201",
            "name": "ជុក ជួម"
        },
        {
            "barcode": "171137242",
            "dpc": "03010124301",
            "name": "វ៉ាន់ ថា"
        },
        {
            "barcode": "171137243",
            "dpc": "03010124401",
            "name": "អោម ចាន់ថា"
        },
        {
            "barcode": "171137244",
            "dpc": "03010124501",
            "name": "ចាន់ ណៃ"
        },
        {
            "barcode": "171137245",
            "dpc": "03010124601",
            "name": "ផាន ថុល"
        },
        {
            "barcode": "171137246",
            "dpc": "03010124701",
            "name": "មាស កុសល"
        },
        {
            "barcode": "171137247",
            "dpc": "03010124801",
            "name": "ឡិ ប៊ុនលី"
        },
        {
            "barcode": "171137248",
            "dpc": "03010124901",
            "name": "ឆាន់ ឈី"
        },
        {
            "barcode": "171137249",
            "dpc": "03010125001",
            "name": "ឌិ  កុសល់"
        },
        {
            "barcode": "171137250",
            "dpc": "03010125101",
            "name": "ខ្លូត វ៉ាន់ឆៃ"
        },
        {
            "barcode": "171137251",
            "dpc": "03010125201",
            "name": "ភេម សុគុន"
        },
        {
            "barcode": "171137252",
            "dpc": "03010125301",
            "name": "សួស វ៉ាន់ថា"
        },
        {
            "barcode": "171137253",
            "dpc": "03010125401",
            "name": "ខៀវ សារី"
        },
        {
            "barcode": "171137254",
            "dpc": "03010125701",
            "name": "អ៊ីវ វ៉ាន់ដេត"
        },
        {
            "barcode": "171137255",
            "dpc": "03010125501",
            "name": "លឹម ហាក់ហេង"
        },
        {
            "barcode": "171137256",
            "dpc": "03010125801",
            "name": "ម៉ាន់ រ៉េត"
        },
        {
            "barcode": "171137257",
            "dpc": "03010125901",
            "name": "ហុក ជាល្លី"
        },
        {
            "barcode": "171137258",
            "dpc": "03010126001",
            "name": "គឹម ប៊ុនទិត"
        },
        {
            "barcode": "171137259",
            "dpc": "03010126101",
            "name": "ហម ហេង"
        },
        {
            "barcode": "171137260",
            "dpc": "03010126201",
            "name": "គឹម ញិប"
        },
        {
            "barcode": "171137261",
            "dpc": "03010126301",
            "name": "លី រ៉ានី"
        },
        {
            "barcode": "171137262",
            "dpc": "03010126501",
            "name": "ស សុធិ"
        },
        {
            "barcode": "171137263",
            "dpc": "03010126601",
            "name": "ហៃ សាន"
        },
        {
            "barcode": "171137264",
            "dpc": "03010126701",
            "name": "ប៉ា ហឿន"
        },
        {
            "barcode": "171137265",
            "dpc": "03010126801",
            "name": "ស៊ីម អួន"
        },
        {
            "barcode": "171137266",
            "dpc": "03010126901",
            "name": "រើន នី"
        },
        {
            "barcode": "171137267",
            "dpc": "03010127201",
            "name": "អ៊ឹង ប៉ាត"
        },
        {
            "barcode": "171137268",
            "dpc": "03010127401",
            "name": "ខៃ សៃ"
        },
        {
            "barcode": "171137269",
            "dpc": "03010127501",
            "name": "ម៉ៅ ហួយ"
        },
        {
            "barcode": "171137270",
            "dpc": "03010127601",
            "name": "សាយ សូនី"
        },
        {
            "barcode": "171137271",
            "dpc": "03010103101",
            "name": "ប៊ុន ទូច"
        },
        {
            "barcode": "171137272",
            "dpc": "03010118701",
            "name": "ជា រៈវ៉ិត"
        },
        {
            "barcode": "171137273",
            "dpc": "03010118801",
            "name": "តាន់ ឃុនរដ្ឋា"
        },
        {
            "barcode": "171137274",
            "dpc": "03010119001",
            "name": "សុខ វី"
        },
        {
            "barcode": "171137275",
            "dpc": "03010119101",
            "name": "បេង សុវណ្ណ"
        },
        {
            "barcode": "171137276",
            "dpc": "03010119201",
            "name": "ឌិត វ៉ាន់ដន"
        },
        {
            "barcode": "171137277",
            "dpc": "03010119401",
            "name": "តាំង  ម៉េងអាន ១"
        },
        {
            "barcode": "171137278",
            "dpc": "03010119601",
            "name": "តាំង  ម៉េងអាន ២"
        },
        {
            "barcode": "171137279",
            "dpc": "03010119801",
            "name": "សាន បៀន"
        },
        {
            "barcode": "171137280",
            "dpc": "03010119901",
            "name": "ផា សុផាត"
        },
        {
            "barcode": "171137281",
            "dpc": "03010120001",
            "name": "ឃឹម សាខន"
        },
        {
            "barcode": "171137282",
            "dpc": "03010127701",
            "name": "វិញ ង៉ោស៊ី"
        },
        {
            "barcode": "171137283",
            "dpc": "03010127801",
            "name": "វ៉ាន់ ម៉ម"
        },
        {
            "barcode": "171137284",
            "dpc": "03010127901",
            "name": "ម៉ាន សុធា"
        },
        {
            "barcode": "171137285",
            "dpc": "03010128001",
            "name": "ង៉ែត ផេង"
        },
        {
            "barcode": "171137286",
            "dpc": "03010128101",
            "name": "មុយ ឡេង"
        },
        {
            "barcode": "171137287",
            "dpc": "03010128201",
            "name": "សាត វត្ថា"
        },
        {
            "barcode": "171137288",
            "dpc": "03010128301",
            "name": "ជា ប៊ុនលឿត"
        },
        {
            "barcode": "171137289",
            "dpc": "03010128501",
            "name": "ហ៊ិន ឃៀន"
        },
        {
            "barcode": "171137290",
            "dpc": "03010128601",
            "name": "គី ហៀង"
        },
        {
            "barcode": "171137291",
            "dpc": "03010128701",
            "name": "ម៉េង ហៀង"
        },
        {
            "barcode": "171137292",
            "dpc": "03010128801",
            "name": "ឆាយ  ហេង"
        },
        {
            "barcode": "171137293",
            "dpc": "03010128901",
            "name": "ចាប គួយ"
        },
        {
            "barcode": "171137294",
            "dpc": "03010129101",
            "name": "ជ រ៉ាឌី"
        },
        {
            "barcode": "171137295",
            "dpc": "03010129201",
            "name": "ហូយ ណាគ្រី"
        },
        {
            "barcode": "171137296",
            "dpc": "03010129301",
            "name": "តាំង  សេង"
        },
        {
            "barcode": "171137297",
            "dpc": "03010129401",
            "name": "ឆាយ សុភ័ណ"
        },
        {
            "barcode": "171137298",
            "dpc": "03010129501",
            "name": "អ៊ុយ ម៉ាឡា"
        },
        {
            "barcode": "171137299",
            "dpc": "03010118201",
            "name": "ប៉ិច  កន្ទុយគោ"
        },
        {
            "barcode": "171137300",
            "dpc": "03010118301",
            "name": "ចៅ ឈឿង"
        },
        {
            "barcode": "171137301",
            "dpc": "03010118401",
            "name": "លី គឹមសៀន ១"
        },
        {
            "barcode": "171137302",
            "dpc": "03010118501",
            "name": "គឹម ថៃ"
        },
        {
            "barcode": "171137303",
            "dpc": "03010129601",
            "name": "ជា ផាត"
        },
        {
            "barcode": "171137304",
            "dpc": "03010129701",
            "name": "ហាក់ អេង"
        },
        {
            "barcode": "171137305",
            "dpc": "03010129801",
            "name": "គួ លន់"
        },
        {
            "barcode": "171137306",
            "dpc": "03010130001",
            "name": "សៀម ឡាយ"
        },
        {
            "barcode": "171137307",
            "dpc": "03010130101",
            "name": "ទុយ ទូច"
        },
        {
            "barcode": "171137308",
            "dpc": "03010130201",
            "name": "ផ្លឹង សំអឿន"
        },
        {
            "barcode": "171137309",
            "dpc": "03010130301",
            "name": "អ៊ុក  វណ្ណថា"
        },
        {
            "barcode": "171137310",
            "dpc": "03010130401",
            "name": "ចាន់ សុផល"
        },
        {
            "barcode": "171137311",
            "dpc": "03010130501",
            "name": "គា សង្វា"
        },
        {
            "barcode": "171137312",
            "dpc": "03010130601",
            "name": "ពក ហ៊ាន"
        },
        {
            "barcode": "171137313",
            "dpc": "03010130701",
            "name": "ហេង ណារិន"
        },
        {
            "barcode": "171137314",
            "dpc": "03010130801",
            "name": "ជ្រឹង ចាន់បូ"
        },
        {
            "barcode": "171137315",
            "dpc": "03010130901",
            "name": "អ៊ុយ សុផាត"
        },
        {
            "barcode": "171137316",
            "dpc": "03010131001",
            "name": "សន ស៊ន"
        },
        {
            "barcode": "171137317",
            "dpc": "03010131101",
            "name": "លី គឹមសៀន ២"
        },
        {
            "barcode": "171137318",
            "dpc": "03010131201",
            "name": "អៀប សេង"
        },
        {
            "barcode": "171137319",
            "dpc": "03010131301",
            "name": "អ៊ាប សុខឿន"
        },
        {
            "barcode": "171137320",
            "dpc": "03010131401",
            "name": "គឹម ស៊ុន"
        },
        {
            "barcode": "171137321",
            "dpc": "03010131501",
            "name": "ហៀក  ខ្លា"
        },
        {
            "barcode": "171137322",
            "dpc": "03010131601",
            "name": "ឡាំ ធីសុរិន"
        },
        {
            "barcode": "171137323",
            "dpc": "03010131701",
            "name": "យក់ អឿ"
        },
        {
            "barcode": "171137324",
            "dpc": "03010131801",
            "name": "វុន តូយ"
        },
        {
            "barcode": "171137325",
            "dpc": "03010131901",
            "name": "អ៊ុន សុខា"
        },
        {
            "barcode": "171137326",
            "dpc": "03010132001",
            "name": "ដួង ទូច"
        },
        {
            "barcode": "171137327",
            "dpc": "03010132101",
            "name": "ទី តូ"
        },
        {
            "barcode": "171137328",
            "dpc": "03010132201",
            "name": "ចិន យ៉ុង"
        },
        {
            "barcode": "171137329",
            "dpc": "03010132301",
            "name": "សល់ មិថុនា"
        },
        {
            "barcode": "171137330",
            "dpc": "03010132501",
            "name": "សេង យឿម"
        },
        {
            "barcode": "171137331",
            "dpc": "03010132601",
            "name": "សេង ឈុនឃី"
        },
        {
            "barcode": "171137332",
            "dpc": "03010132801",
            "name": "ម៉ៅ សុខ"
        },
        {
            "barcode": "171137333",
            "dpc": "03010132901",
            "name": "ហោ ប៉េងសៀង"
        },
        {
            "barcode": "171137334",
            "dpc": "03010133001",
            "name": "លឹម អូន"
        },
        {
            "barcode": "171137335",
            "dpc": "03010133101",
            "name": "ម៉ាត់ នៅ"
        },
        {
            "barcode": "171137336",
            "dpc": "03010133201",
            "name": "សុខ ស៊ីវង្ស"
        },
        {
            "barcode": "171137337",
            "dpc": "03010133301",
            "name": "អាង  ភាព"
        },
        {
            "barcode": "171137338",
            "dpc": "03010133401",
            "name": "ម៉ាន យ៉ុម"
        },
        {
            "barcode": "171137339",
            "dpc": "03010133501",
            "name": "ជា គឹមឡុង"
        },
        {
            "barcode": "171137340",
            "dpc": "03010133601",
            "name": "ជា សាប់"
        },
        {
            "barcode": "171137341",
            "dpc": "03010133701",
            "name": "អ៊ិត សុភាព"
        },
        {
            "barcode": "171137342",
            "dpc": "03010133801",
            "name": "គុន មុន្នី"
        },
        {
            "barcode": "171137343",
            "dpc": "03010133901",
            "name": "ហេង ថូ"
        },
        {
            "barcode": "171137344",
            "dpc": "03010134001",
            "name": "សំ សុខ"
        },
        {
            "barcode": "171137345",
            "dpc": "03010134101",
            "name": "គាន់ បូគង់"
        },
        {
            "barcode": "171137346",
            "dpc": "03010134301",
            "name": "គួយ តូ"
        },
        {
            "barcode": "171137347",
            "dpc": "03010134401",
            "name": "អែម សុផល"
        },
        {
            "barcode": "171137348",
            "dpc": "03010134501",
            "name": "ឈឹម សំអាត"
        },
        {
            "barcode": "171137349",
            "dpc": "03010134601",
            "name": "ហុក វន"
        },
        {
            "barcode": "171137350",
            "dpc": "03010134701",
            "name": "ខ្វែក ផាត់"
        },
        {
            "barcode": "171137351",
            "dpc": "03010134801",
            "name": "ម៉ាត់ លី"
        },
        {
            "barcode": "171137352",
            "dpc": "03010134901",
            "name": "ឆេង គឹមណៃ"
        },
        {
            "barcode": "171137353",
            "dpc": "03010135001",
            "name": "កែង ស៊ីថា"
        },
        {
            "barcode": "171137354",
            "dpc": "03010135201",
            "name": "ធៀម ប៊ុនសែ"
        },
        {
            "barcode": "171137355",
            "dpc": "03010100101",
            "name": "វិន នល់"
        },
        {
            "barcode": "171137356",
            "dpc": "03010100201",
            "name": "ចៅ យ៉ាន់"
        },
        {
            "barcode": "171137357",
            "dpc": "03010100301",
            "name": "ចៅ ភិរម្យ"
        },
        {
            "barcode": "171137358",
            "dpc": "03010100401",
            "name": "សួង សុផល"
        },
        {
            "barcode": "171137359",
            "dpc": "03010100501",
            "name": "អឿ គឹមឈន"
        },
        {
            "barcode": "171137360",
            "dpc": "03010100601",
            "name": "អ៊ាប លឹមហុង"
        },
        {
            "barcode": "171137361",
            "dpc": "03010100701",
            "name": "ប៊ូ វ៉ាឡៃ"
        },
        {
            "barcode": "171137362",
            "dpc": "03010100801",
            "name": "យ៉ាន សាលី"
        },
        {
            "barcode": "171137363",
            "dpc": "03010100901",
            "name": "តុម ចាន់ផល្លា"
        },
        {
            "barcode": "171137364",
            "dpc": "03010101001",
            "name": "ជេត សាត"
        },
        {
            "barcode": "171137365",
            "dpc": "03010101101",
            "name": "នូវ ចាន់ដាវី"
        },
        {
            "barcode": "171137366",
            "dpc": "03010101201",
            "name": "គុយ គឹមផាន"
        },
        {
            "barcode": "171137367",
            "dpc": "03010101301",
            "name": "ស៊ីន ថ្លាង"
        },
        {
            "barcode": "171137368",
            "dpc": "03010101401",
            "name": "ស៊ីន ប៊ុណ្ណា"
        },
        {
            "barcode": "171137369",
            "dpc": "03010101501",
            "name": "យ៉ន បូរ៉ា"
        },
        {
            "barcode": "171137370",
            "dpc": "03010101601",
            "name": "ចៅ ចាន់"
        },
        {
            "barcode": "171137371",
            "dpc": "03010101701",
            "name": "ង៉ែត ប្រម"
        },
        {
            "barcode": "171137372",
            "dpc": "03010101801",
            "name": "ចាន់ មួយគា"
        },
        {
            "barcode": "171137373",
            "dpc": "03010101901",
            "name": "លឿង ស៊ីម"
        },
        {
            "barcode": "171137374",
            "dpc": "03010102001",
            "name": "ឆាត់ ឆាយឆដា"
        },
        {
            "barcode": "171137375",
            "dpc": "03010102101",
            "name": "សួ ប៊ុណ្ណារ៉ុង"
        },
        {
            "barcode": "171137376",
            "dpc": "03010102201",
            "name": "លី គឹមឃន ១"
        },
        {
            "barcode": "171137377",
            "dpc": "03010102301",
            "name": "ទឹម សុធិន"
        },
        {
            "barcode": "171137378",
            "dpc": "03010102401",
            "name": "លី គឹមឃន ២"
        },
        {
            "barcode": "171137379",
            "dpc": "03010102501",
            "name": "ប៊ុន រ៉ា"
        },
        {
            "barcode": "171137380",
            "dpc": "03010102601",
            "name": "ហួន សាយ"
        },
        {
            "barcode": "171137381",
            "dpc": "03010102801",
            "name": "សុន ជៀក"
        },
        {
            "barcode": "171137382",
            "dpc": "03010102901",
            "name": "សុខ ឃាង"
        },
        {
            "barcode": "171137383",
            "dpc": "03010103501",
            "name": "ហេង ចាន់ធា"
        },
        {
            "barcode": "171137384",
            "dpc": "03010103001",
            "name": "ឃុន ឡុង"
        },
        {
            "barcode": "171137385",
            "dpc": "03010103201",
            "name": "អួង សន"
        },
        {
            "barcode": "171137386",
            "dpc": "03010103301",
            "name": "ស៊ីន សំអាត"
        },
        {
            "barcode": "171137387",
            "dpc": "03010103401",
            "name": "សៀក ឌី"
        },
        {
            "barcode": "171137388",
            "dpc": "03010103701",
            "name": "ឈា កៀង"
        },
        {
            "barcode": "171137389",
            "dpc": "03010103801",
            "name": "អៀង វត្តី"
        },
        {
            "barcode": "171137390",
            "dpc": "03010103901",
            "name": "គុណ ណារី"
        },
        {
            "barcode": "171137391",
            "dpc": "03010104901",
            "name": "សាលាឃុំរតនៈ"
        },
        {
            "barcode": "171137392",
            "dpc": "03010104001",
            "name": "សោ លីណា"
        },
        {
            "barcode": "171137393",
            "dpc": "03010104101",
            "name": "វង៉ ថាជឹង"
        },
        {
            "barcode": "171137394",
            "dpc": "03010104401",
            "name": "ប៊ុង ឡុង"
        },
        {
            "barcode": "171137395",
            "dpc": "03010104501",
            "name": "វណ្ណ សៅ"
        },
        {
            "barcode": "171137396",
            "dpc": "03010104801",
            "name": "ឈឿង វ៉ាន់"
        },
        {
            "barcode": "171137397",
            "dpc": "03010104601",
            "name": "ខាត់ សារ៉ន"
        },
        {
            "barcode": "171137398",
            "dpc": "03010104701",
            "name": "ហែម គឹមហូរ"
        },
        {
            "barcode": "171137399",
            "dpc": "03010105001",
            "name": "សំ សារិន"
        },
        {
            "barcode": "171137400",
            "dpc": "03010105101",
            "name": "លី សេង"
        },
        {
            "barcode": "171137401",
            "dpc": "03010105201",
            "name": "សល់ ហ៊ីង"
        },
        {
            "barcode": "171137402",
            "dpc": "03010105401",
            "name": "ចក់ សារឿម"
        },
        {
            "barcode": "171137403",
            "dpc": "03010105501",
            "name": "កែវ ចំរើន"
        },
        {
            "barcode": "171137404",
            "dpc": "03010105601",
            "name": "វណ្ណ វុទ្ធី"
        },
        {
            "barcode": "171137405",
            "dpc": "03010105701",
            "name": "ហ៊ុយ ផាន់ណា"
        },
        {
            "barcode": "171137406",
            "dpc": "03010105801",
            "name": "លឹម ប៊ុនធឿន"
        },
        {
            "barcode": "171137407",
            "dpc": "03010105901",
            "name": "លី សេងស្រួយ"
        },
        {
            "barcode": "171137408",
            "dpc": "03010106001",
            "name": "លី គក់"
        },
        {
            "barcode": "171137409",
            "dpc": "03010106101",
            "name": "ឈៀង តូ ១"
        },
        {
            "barcode": "171137410",
            "dpc": "03010106201",
            "name": "ឈៀង តូ ២"
        },
        {
            "barcode": "171137411",
            "dpc": "03010106301",
            "name": "លន់ សំប៊ី"
        },
        {
            "barcode": "171137412",
            "dpc": "03010106401",
            "name": "អ៊ុក ផារី"
        },
        {
            "barcode": "171137413",
            "dpc": "03010106501",
            "name": "ឌុក សាវុធ"
        },
        {
            "barcode": "171137414",
            "dpc": "03010106601",
            "name": "សុក សំអ៊ុល"
        },
        {
            "barcode": "171137415",
            "dpc": "03010106701",
            "name": "ឌុក ស៊ីនួន"
        },
        {
            "barcode": "171137416",
            "dpc": "03010106801",
            "name": "ង៉ែត សារ៉ន"
        },
        {
            "barcode": "171137417",
            "dpc": "03010112301",
            "name": "ជឹង យូហួត"
        },
        {
            "barcode": "171137418",
            "dpc": "03010107201",
            "name": "ឡុង ម៉ាដា ៤"
        },
        {
            "barcode": "171137419",
            "dpc": "03010107101",
            "name": "ឡុង ម៉ាដា ៣"
        },
        {
            "barcode": "171137420",
            "dpc": "03010106901",
            "name": "ឡុង ម៉ាដា ១"
        },
        {
            "barcode": "171137421",
            "dpc": "03010111901",
            "name": "ឆាយ ហេង"
        },
        {
            "barcode": "171137422",
            "dpc": "03010114601",
            "name": "គឹម អាន ១"
        },
        {
            "barcode": "171137423",
            "dpc": "03010114701",
            "name": "ទេព វ៉ិត"
        },
        {
            "barcode": "171137424",
            "dpc": "03010114501",
            "name": "ម៉េង ហ៊ុយ"
        },
        {
            "barcode": "171137425",
            "dpc": "03010114401",
            "name": "ដើក តិចលី"
        },
        {
            "barcode": "171137426",
            "dpc": "03010114301",
            "name": "ប៊ូ បូរ៉ា"
        },
        {
            "barcode": "171137427",
            "dpc": "03010113901",
            "name": "ឡៅ ជីងហ៊ួរ"
        },
        {
            "barcode": "171137428",
            "dpc": "03010113301",
            "name": "ខៀវ ថោង"
        },
        {
            "barcode": "171137429",
            "dpc": "03010113101",
            "name": "តូ ដារ៉ា ២"
        },
        {
            "barcode": "171137430",
            "dpc": "03010113001",
            "name": "ធៀន រស់"
        },
        {
            "barcode": "171137431",
            "dpc": "03010112801",
            "name": "ប៊ូយ ហ៊ីម"
        },
        {
            "barcode": "171137432",
            "dpc": "03010112701",
            "name": "គុជ ជ"
        },
        {
            "barcode": "171137433",
            "dpc": "03010112601",
            "name": "អ៊ុក ផលលឿន"
        },
        {
            "barcode": "171137434",
            "dpc": "03010112501",
            "name": "លី ម៉េង"
        },
        {
            "barcode": "171137435",
            "dpc": "03010112401",
            "name": "ហេង ម៉ៅ"
        },
        {
            "barcode": "171137436",
            "dpc": "03010112201",
            "name": "សុខ ឃីម"
        },
        {
            "barcode": "171137437",
            "dpc": "03010113401",
            "name": "សេង   លាភ"
        },
        {
            "barcode": "171137438",
            "dpc": "03010113501",
            "name": "រៀម  ផល្លី"
        },
        {
            "barcode": "171137439",
            "dpc": "03010113701",
            "name": "គឹម  សុផៃ"
        },
        {
            "barcode": "171137440",
            "dpc": "03010113801",
            "name": "ជួន  អៀន ១"
        },
        {
            "barcode": "171137441",
            "dpc": "03010114001",
            "name": "ប្លុង   សុផាន់ឌី"
        },
        {
            "barcode": "171137442",
            "dpc": "03010114101",
            "name": "ឈុន  សុផល"
        },
        {
            "barcode": "171137443",
            "dpc": "03010110901",
            "name": "ម៉េង ប៊ុនឡៃ"
        },
        {
            "barcode": "171137444",
            "dpc": "03010111001",
            "name": "ហ៊ុយ ចេន"
        },
        {
            "barcode": "171137445",
            "dpc": "03010111101",
            "name": "ម៉ៅ សារ៉ាត ១"
        },
        {
            "barcode": "171137446",
            "dpc": "03010111401",
            "name": "ផា ភាព"
        },
        {
            "barcode": "171137447",
            "dpc": "03010111301",
            "name": "ឡឹម ស៊ីម"
        },
        {
            "barcode": "171137448",
            "dpc": "03010111201",
            "name": "អន ប៊ុនឌឿន"
        },
        {
            "barcode": "171137449",
            "dpc": "03010111501",
            "name": "ពេជ្រ សុគន្ធ"
        },
        {
            "barcode": "171137450",
            "dpc": "03010111701",
            "name": "ថាប់ ចិន"
        },
        {
            "barcode": "171137451",
            "dpc": "03010111601",
            "name": "ម៉ៅ សារ៉ាត ២"
        },
        {
            "barcode": "171137452",
            "dpc": "03010112001",
            "name": "ជ្រឹង រី"
        },
        {
            "barcode": "171137453",
            "dpc": "03010111801",
            "name": "អ៊ូ សាវ៉ុង"
        },
        {
            "barcode": "171137454",
            "dpc": "03010139701",
            "name": "អឿន  សាវុន"
        },
        {
            "barcode": "171137455",
            "dpc": "03010116201",
            "name": "អេង  ធា"
        },
        {
            "barcode": "171137456",
            "dpc": "03010116601",
            "name": "ហៀង  សុធី"
        },
        {
            "barcode": "171137457",
            "dpc": "03010116701",
            "name": "គឹម  វេង"
        },
        {
            "barcode": "171137458",
            "dpc": "03010116801",
            "name": "ហៃ  លី"
        },
        {
            "barcode": "171137459",
            "dpc": "03010116901",
            "name": "ហ៊ុយ  យាន"
        },
        {
            "barcode": "171137460",
            "dpc": "03010117001",
            "name": "ឃុយ  ងី"
        },
        {
            "barcode": "171137461",
            "dpc": "03010117101",
            "name": "លី  គឹមស៊ា"
        },
        {
            "barcode": "171137462",
            "dpc": "03010117201",
            "name": "អ៊ឹម  តាន់យ៉ា"
        },
        {
            "barcode": "171137463",
            "dpc": "03010117301",
            "name": "ប៉ាល់ គឹមស៊ាង"
        },
        {
            "barcode": "171137464",
            "dpc": "03010117401",
            "name": "ជ្រា    ស្រីមុំ"
        },
        {
            "barcode": "171137465",
            "dpc": "03010117501",
            "name": "នូវ  ឈាងហ៊ត"
        },
        {
            "barcode": "171137466",
            "dpc": "03010117601",
            "name": "លឹម  ហេង"
        },
        {
            "barcode": "171137467",
            "dpc": "03010117701",
            "name": "សោម  យូអូន"
        },
        {
            "barcode": "171137468",
            "dpc": "03010117801",
            "name": "វង្ស   យូ"
        },
        {
            "barcode": "171137469",
            "dpc": "03010117901",
            "name": "នូ  ផល្លី"
        },
        {
            "barcode": "171137470",
            "dpc": "03010118001",
            "name": "ឌុក  វន្ថា"
        },
        {
            "barcode": "171137471",
            "dpc": "03010118901",
            "name": "ឆាយ  ហេង"
        },
        {
            "barcode": "171137472",
            "dpc": "03010119701",
            "name": "មូល  សុង"
        },
        {
            "barcode": "171137473",
            "dpc": "03010122701",
            "name": "គឹម   ប៉ូ"
        },
        {
            "barcode": "171137474",
            "dpc": "03010126401",
            "name": "ឈឹម  គឹមសៀង"
        },
        {
            "barcode": "171137475",
            "dpc": "03010127301",
            "name": "ស៊ិន  ឆោម"
        },
        {
            "barcode": "171137476",
            "dpc": "03010129001",
            "name": "គង់  ឃៀន"
        },
        {
            "barcode": "171137477",
            "dpc": "03010137001",
            "name": "ហៀង   សុធី"
        },
        {
            "barcode": "171137478",
            "dpc": "03010140401",
            "name": "សុខ  សារឿន"
        },
        {
            "barcode": "171137479",
            "dpc": "03010140501",
            "name": "ឈឹន  ឆម"
        },
        {
            "barcode": "171137480",
            "dpc": "03010140601",
            "name": "ឈឹន  សុគន្ធា"
        },
        {
            "barcode": "171137481",
            "dpc": "03010148001",
            "name": "ជឹម ប៊ុនធឿន"
        }
    ]
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
