let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171139674",
            "dpc": "03010239001",
            "name": "ថង សារ៉េត"
        },
        {
            "barcode": "171139675",
            "dpc": "03010213001",
            "name": "សុខ គុណរិទ្ធ"
        },
        {
            "barcode": "171139676",
            "dpc": "03010212701",
            "name": "អោម ផល្លា"
        },
        {
            "barcode": "171139677",
            "dpc": "03010212801",
            "name": "ទិត លីនដា ១"
        },
        {
            "barcode": "171139678",
            "dpc": "03010212901",
            "name": "ទិត សុខា ២"
        },
        {
            "barcode": "171139679",
            "dpc": "03010210501",
            "name": "វ៉ាន វង្ស"
        },
        {
            "barcode": "171139680",
            "dpc": "03010210601",
            "name": "ម៉ុង ចាន់សារ័ត្ន"
        },
        {
            "barcode": "171139681",
            "dpc": "03010210701",
            "name": "លាង ធារី"
        },
        {
            "barcode": "171139682",
            "dpc": "03010210801",
            "name": "ជា សរ"
        },
        {
            "barcode": "171139683",
            "dpc": "03010210901",
            "name": "សៅ ទេពសត្ថា"
        },
        {
            "barcode": "171139684",
            "dpc": "03010211001",
            "name": "អឿ ផាន"
        },
        {
            "barcode": "171139685",
            "dpc": "03010211501",
            "name": "ប៊ុត ធូ"
        },
        {
            "barcode": "171139686",
            "dpc": "03010211101",
            "name": "យស់ សំបឿន"
        },
        {
            "barcode": "171139687",
            "dpc": "03010211201",
            "name": "ឡាយ ផាន្នី"
        },
        {
            "barcode": "171139688",
            "dpc": "03010211301",
            "name": "ឃូន សុខខេង"
        },
        {
            "barcode": "171139689",
            "dpc": "03010211401",
            "name": "បេង បូរ៉ា"
        },
        {
            "barcode": "171139690",
            "dpc": "03010211601",
            "name": "ពេជ្រ ណូរ៉ែម"
        },
        {
            "barcode": "171139691",
            "dpc": "03010211701",
            "name": "នាង ចន្ធី"
        },
        {
            "barcode": "171139692",
            "dpc": "03010211901",
            "name": "ប៊ុន គង់"
        },
        {
            "barcode": "171139693",
            "dpc": "03010212001",
            "name": "គួច ប៊ុនលី"
        },
        {
            "barcode": "171139694",
            "dpc": "03010212101",
            "name": "ស្រេង គឹមស្រេង"
        },
        {
            "barcode": "171139695",
            "dpc": "03010212301",
            "name": "ម៉ៅ មួន"
        },
        {
            "barcode": "171139696",
            "dpc": "03010212401",
            "name": "ស៊ឹម លឹម"
        },
        {
            "barcode": "171139697",
            "dpc": "03010212501",
            "name": "យៀវ យ៉ុត"
        },
        {
            "barcode": "171139698",
            "dpc": "03010212601",
            "name": "យិន ឡាំ"
        },
        {
            "barcode": "171139699",
            "dpc": "03010211801",
            "name": "កៅ សារ៉េត"
        },
        {
            "barcode": "171139700",
            "dpc": "03010212201",
            "name": "ឆេង ពៅ"
        },
        {
            "barcode": "171139701",
            "dpc": "03010209301",
            "name": "វង្ស វៀត"
        },
        {
            "barcode": "171139702",
            "dpc": "03010209401",
            "name": "ហួត សុហេង"
        },
        {
            "barcode": "171139703",
            "dpc": "03010209501",
            "name": "នេត សុវណ្ណ"
        },
        {
            "barcode": "171139704",
            "dpc": "03010209601",
            "name": "ឃុន ឧត្តម"
        },
        {
            "barcode": "171139705",
            "dpc": "03010209701",
            "name": "ត្រឹង ឆោម"
        },
        {
            "barcode": "171139706",
            "dpc": "03010209801",
            "name": "ត្រឹង ឆាយ"
        },
        {
            "barcode": "171139707",
            "dpc": "03010209901",
            "name": "វ៉ាន់ ឡុញ"
        },
        {
            "barcode": "171139708",
            "dpc": "03010210001",
            "name": "អាត់ រ៉ាឌី"
        },
        {
            "barcode": "171139709",
            "dpc": "03010210101",
            "name": "សឺត គីរីវណ្ណឌី"
        },
        {
            "barcode": "171139710",
            "dpc": "03010210201",
            "name": "អ៊ិត ហៃ"
        },
        {
            "barcode": "171139711",
            "dpc": "03010210401",
            "name": "កើត យុថា"
        },
        {
            "barcode": "171139712",
            "dpc": "03010208801",
            "name": "អ៊ាន លី"
        },
        {
            "barcode": "171139713",
            "dpc": "03010208501",
            "name": "ទូច វណ្ណា"
        },
        {
            "barcode": "171139714",
            "dpc": "03010208901",
            "name": "សោម ជឿង"
        },
        {
            "barcode": "171139715",
            "dpc": "03010209101",
            "name": "ឆុង ហ៊ី"
        },
        {
            "barcode": "171139716",
            "dpc": "03010209201",
            "name": "ប៉ូ ខេងរ៉ន"
        },
        {
            "barcode": "171139717",
            "dpc": "03010204701",
            "name": "ហ៊ី ពិសិទ្ធ"
        },
        {
            "barcode": "171139718",
            "dpc": "03010204801",
            "name": "គី វៀត"
        },
        {
            "barcode": "171139719",
            "dpc": "03010204901",
            "name": "ញ៉ែម ផៃ"
        },
        {
            "barcode": "171139720",
            "dpc": "03010205001",
            "name": "ស្រេង ហេង"
        },
        {
            "barcode": "171139721",
            "dpc": "03010205201",
            "name": "អ៊ាន រឿន"
        },
        {
            "barcode": "171139722",
            "dpc": "03010205301",
            "name": "គង់ សុខឃាង"
        },
        {
            "barcode": "171139723",
            "dpc": "03010205101",
            "name": "តូវ ហូវ"
        },
        {
            "barcode": "171139724",
            "dpc": "03010205401",
            "name": "ព្រំ សៀង"
        },
        {
            "barcode": "171139725",
            "dpc": "03010205501",
            "name": "សៀង សុផល"
        },
        {
            "barcode": "171139726",
            "dpc": "03010205601",
            "name": "សាម គា"
        },
        {
            "barcode": "171139727",
            "dpc": "03010208101",
            "name": "នួន សាន"
        },
        {
            "barcode": "171139728",
            "dpc": "03010208301",
            "name": "ម៉ៅ ម៉ន"
        },
        {
            "barcode": "171139729",
            "dpc": "03010208401",
            "name": "ហៀង ហាញ់"
        },
        {
            "barcode": "171139730",
            "dpc": "03010208601",
            "name": "ណុប សាម៉ន"
        },
        {
            "barcode": "171139731",
            "dpc": "03010207101",
            "name": "តូច អេង"
        },
        {
            "barcode": "171139732",
            "dpc": "03010207201",
            "name": "ស្រស់ សារ៉ុម"
        },
        {
            "barcode": "171139733",
            "dpc": "03010207301",
            "name": "ចាន់ ធឿន"
        },
        {
            "barcode": "171139734",
            "dpc": "03010207401",
            "name": "អឿន សារុន"
        },
        {
            "barcode": "171139735",
            "dpc": "03010207501",
            "name": "ចៅ ឈីវី"
        },
        {
            "barcode": "171139736",
            "dpc": "03010207601",
            "name": "ឃួន ឈាន"
        },
        {
            "barcode": "171139737",
            "dpc": "03010207701",
            "name": "លី សុផល"
        },
        {
            "barcode": "171139738",
            "dpc": "03010207801",
            "name": "ខាត់ បូរិន"
        },
        {
            "barcode": "171139739",
            "dpc": "03010207901",
            "name": "ឆាត់ ឆាត"
        },
        {
            "barcode": "171139740",
            "dpc": "03010208001",
            "name": "ប៉ា ប៊ុនហាង"
        },
        {
            "barcode": "171139741",
            "dpc": "03010205801",
            "name": "តាំង ឈាងហួរ"
        },
        {
            "barcode": "171139742",
            "dpc": "03010205701",
            "name": "ភន ជិន"
        },
        {
            "barcode": "171139743",
            "dpc": "03010206001",
            "name": "នួន ស្នា"
        },
        {
            "barcode": "171139744",
            "dpc": "03010205901",
            "name": "នាក ជា"
        },
        {
            "barcode": "171139745",
            "dpc": "03010206101",
            "name": "ឡុង សេរីវុឌ្ឍៈ"
        },
        {
            "barcode": "171139746",
            "dpc": "03010206201",
            "name": "ជាម ដារ៉ា"
        },
        {
            "barcode": "171139747",
            "dpc": "03010206301",
            "name": "ម្លប់ស្បូវម៉ាលី"
        },
        {
            "barcode": "171139748",
            "dpc": "03010206401",
            "name": "ម្លប់ ឆាត់"
        },
        {
            "barcode": "171139749",
            "dpc": "03010206501",
            "name": "ឆាយ ទូច"
        },
        {
            "barcode": "171139750",
            "dpc": "03010206601",
            "name": "សេង ហឺ"
        },
        {
            "barcode": "171139751",
            "dpc": "03010206701",
            "name": "ជយ ហាង"
        },
        {
            "barcode": "171139752",
            "dpc": "03010206801",
            "name": "ថ្លាង ថារេត"
        },
        {
            "barcode": "171139753",
            "dpc": "03010236201",
            "name": "ទី លីនដូ"
        },
        {
            "barcode": "171139754",
            "dpc": "03010236101",
            "name": "ម៉ៅ ង៉ាវ"
        },
        {
            "barcode": "171139755",
            "dpc": "03010235901",
            "name": "គង់ សារឿន"
        },
        {
            "barcode": "171139756",
            "dpc": "03010236001",
            "name": "ហោ ភិរុណ"
        },
        {
            "barcode": "171139757",
            "dpc": "03010231501",
            "name": "សូម កុសល"
        },
        {
            "barcode": "171139758",
            "dpc": "03010221001",
            "name": "ប៊ុត ធូ"
        },
        {
            "barcode": "171139759",
            "dpc": "03010220801",
            "name": "ឡុង វ៉ាង"
        },
        {
            "barcode": "171139760",
            "dpc": "03010220701",
            "name": "ស៊ុន ស៊ុយ"
        },
        {
            "barcode": "171139761",
            "dpc": "03010220601",
            "name": "លន ប៊ុនឈន"
        },
        {
            "barcode": "171139762",
            "dpc": "03010220501",
            "name": "ធូ ប៊ុនធឿន"
        },
        {
            "barcode": "171139763",
            "dpc": "03010220401",
            "name": "អេង ណារ៉ុង"
        },
        {
            "barcode": "171139764",
            "dpc": "03010220301",
            "name": "ខុង ខន"
        },
        {
            "barcode": "171139765",
            "dpc": "03010220201",
            "name": "ស៊ុន រ៉ន"
        },
        {
            "barcode": "171139766",
            "dpc": "03010220101",
            "name": "កែវ វាសនា"
        },
        {
            "barcode": "171139767",
            "dpc": "03010220001",
            "name": "ភេង អង"
        },
        {
            "barcode": "171139768",
            "dpc": "03010219901",
            "name": "សំរិត នូ"
        },
        {
            "barcode": "171139769",
            "dpc": "03010219801",
            "name": "ស៊ឹម អឿន"
        },
        {
            "barcode": "171139770",
            "dpc": "03010219701",
            "name": "ហេង កៅ"
        },
        {
            "barcode": "171139771",
            "dpc": "03010219601",
            "name": "សាន ហោ"
        },
        {
            "barcode": "171139772",
            "dpc": "03010219501",
            "name": "ស៊ិន ហេង"
        },
        {
            "barcode": "171139773",
            "dpc": "03010219401",
            "name": "ស គឹមប៉ូ"
        },
        {
            "barcode": "171139774",
            "dpc": "03010219301",
            "name": "ឈឿង គឹមសុង"
        },
        {
            "barcode": "171139775",
            "dpc": "03010219201",
            "name": "វ៉ាត ពង់"
        },
        {
            "barcode": "171139776",
            "dpc": "03010219101",
            "name": "ទេស មាន"
        },
        {
            "barcode": "171139777",
            "dpc": "03010219001",
            "name": "ទេស ស៊ី"
        },
        {
            "barcode": "171139778",
            "dpc": "03010218901",
            "name": "លឹម ស"
        },
        {
            "barcode": "171139779",
            "dpc": "03010218801",
            "name": "ចិន អមរា"
        },
        {
            "barcode": "171139780",
            "dpc": "03010218701",
            "name": "សាន់ ផាន់ណា"
        },
        {
            "barcode": "171139781",
            "dpc": "03010218601",
            "name": "សាំង លាភ"
        },
        {
            "barcode": "171139782",
            "dpc": "03010218501",
            "name": "គិត ឆដា"
        },
        {
            "barcode": "171139783",
            "dpc": "03010218401",
            "name": "ជូ តុប"
        },
        {
            "barcode": "171139784",
            "dpc": "03010218301",
            "name": "លឹម សារ៉ែម"
        },
        {
            "barcode": "171139785",
            "dpc": "03010218201",
            "name": "យ៉ម ចំរើន ៦"
        },
        {
            "barcode": "171139786",
            "dpc": "03010218101",
            "name": "ឈូក  វណ្ណស៊ី"
        },
        {
            "barcode": "171139787",
            "dpc": "03010218001",
            "name": "ចៅ ហ៊ាង"
        },
        {
            "barcode": "171139788",
            "dpc": "03010217901",
            "name": "ឡៃ ហ៊ាង"
        },
        {
            "barcode": "171139789",
            "dpc": "03010217801",
            "name": "អ៊ុង សុភាព"
        },
        {
            "barcode": "171139790",
            "dpc": "03010217701",
            "name": "ចាន់ អាយ"
        },
        {
            "barcode": "171139791",
            "dpc": "03010217501",
            "name": "វ៉ន ឌៀប"
        },
        {
            "barcode": "171139792",
            "dpc": "03010217301",
            "name": "វង្ស យិន"
        },
        {
            "barcode": "171139793",
            "dpc": "03010217201",
            "name": "ចិន យ៉ុម"
        },
        {
            "barcode": "171139794",
            "dpc": "03010217101",
            "name": "លឹម លីហឿប"
        },
        {
            "barcode": "171139795",
            "dpc": "03010217001",
            "name": "សុខ ស៊ីវង្ស"
        },
        {
            "barcode": "171139796",
            "dpc": "03010216901",
            "name": "ជាង ឡេង"
        },
        {
            "barcode": "171139797",
            "dpc": "03010216801",
            "name": "សុខ សុវណ្ណ"
        },
        {
            "barcode": "171139798",
            "dpc": "03010216601",
            "name": "ហ៊ិន សំរេច"
        },
        {
            "barcode": "171139799",
            "dpc": "03010216501",
            "name": "អ៊ូច សុផល"
        },
        {
            "barcode": "171139800",
            "dpc": "03010216401",
            "name": "សេស សុខុម"
        },
        {
            "barcode": "171139801",
            "dpc": "03010216301",
            "name": "តាំង  អ៊ីវណាំ"
        },
        {
            "barcode": "171139802",
            "dpc": "03010216201",
            "name": "គឹម ជាតិ"
        },
        {
            "barcode": "171139803",
            "dpc": "03010216001",
            "name": "នាង ឯល"
        },
        {
            "barcode": "171139804",
            "dpc": "03010215901",
            "name": "សេង ស៊ន"
        },
        {
            "barcode": "171139805",
            "dpc": "03010215801",
            "name": "សុខ ធឿន"
        },
        {
            "barcode": "171139806",
            "dpc": "03010215701",
            "name": "គឹម សារ៉ន"
        },
        {
            "barcode": "171139807",
            "dpc": "03010215601",
            "name": "វង្ស ឡេង"
        },
        {
            "barcode": "171139808",
            "dpc": "03010215501",
            "name": "អៀង សុភៀង"
        },
        {
            "barcode": "171139809",
            "dpc": "03010215401",
            "name": "ឡេង មួយ"
        },
        {
            "barcode": "171139810",
            "dpc": "03010215301",
            "name": "អ៊ិន សេង"
        },
        {
            "barcode": "171139811",
            "dpc": "03010215201",
            "name": "នៅ ស៊ីយឿប"
        },
        {
            "barcode": "171139812",
            "dpc": "03010215001",
            "name": "ហួត  លី"
        },
        {
            "barcode": "171139813",
            "dpc": "03010214901",
            "name": "គឹម ចាន់ធូ"
        },
        {
            "barcode": "171139814",
            "dpc": "03010214801",
            "name": "ជៀម  ផារុំ"
        },
        {
            "barcode": "171139815",
            "dpc": "03010214701",
            "name": "គង់ ស៊ីណាត"
        },
        {
            "barcode": "171139816",
            "dpc": "03010214601",
            "name": "ទុយ ចិន្តា"
        },
        {
            "barcode": "171139817",
            "dpc": "03010214501",
            "name": "ផ្កាយ ភីណែ"
        },
        {
            "barcode": "171139818",
            "dpc": "03010214401",
            "name": "ហម ឆាយ"
        },
        {
            "barcode": "171139819",
            "dpc": "03010214301",
            "name": "ពុញ ឆៃ"
        },
        {
            "barcode": "171139820",
            "dpc": "03010214201",
            "name": "សឹង វិសាល"
        },
        {
            "barcode": "171139821",
            "dpc": "03010214101",
            "name": "ឆាយ អូន"
        },
        {
            "barcode": "171139822",
            "dpc": "03010213901",
            "name": "លឿង យីវ"
        },
        {
            "barcode": "171139823",
            "dpc": "03010213801",
            "name": "តន់ តូច"
        },
        {
            "barcode": "171139824",
            "dpc": "03010213701",
            "name": "អ៊ាង វុទ្ធី"
        },
        {
            "barcode": "171139825",
            "dpc": "03010213501",
            "name": "ដែង សុវណ្ណ"
        },
        {
            "barcode": "171139826",
            "dpc": "03010213401",
            "name": "អ៊ិន តាប់"
        },
        {
            "barcode": "171139827",
            "dpc": "03010213301",
            "name": "សេង យីវ"
        },
        {
            "barcode": "171139828",
            "dpc": "03010213201",
            "name": "លឹម អ៊ីនស្រ៊ុន"
        },
        {
            "barcode": "171139829",
            "dpc": "03010213101",
            "name": "ក ហេង"
        },
        {
            "barcode": "171139830",
            "dpc": "03010222501",
            "name": "តាំង ឡូយ"
        },
        {
            "barcode": "171139831",
            "dpc": "03010222201",
            "name": "អ៊ាប ជីម៉ាន់"
        },
        {
            "barcode": "171139832",
            "dpc": "03010222101",
            "name": "កៅ ស៊ាន"
        },
        {
            "barcode": "171139833",
            "dpc": "03010221701",
            "name": "ខា ខូយ"
        },
        {
            "barcode": "171139834",
            "dpc": "03010221801",
            "name": "ស៊ុត សឿង"
        },
        {
            "barcode": "171139835",
            "dpc": "03010221601",
            "name": "ប៊ុន ហៀង"
        },
        {
            "barcode": "171139836",
            "dpc": "03010221501",
            "name": "ប៊ុន លាង"
        },
        {
            "barcode": "171139837",
            "dpc": "03010221401",
            "name": "ឈុន លី"
        },
        {
            "barcode": "171139838",
            "dpc": "03010221201",
            "name": "ទូច  ញិប"
        },
        {
            "barcode": "171139839",
            "dpc": "03010221101",
            "name": "សុខ ហេង"
        },
        {
            "barcode": "171139840",
            "dpc": "03010222601",
            "name": "ខឹម ស៊ីផាត"
        },
        {
            "barcode": "171139841",
            "dpc": "03010222701",
            "name": "ស៊ុយ សាវុធ"
        },
        {
            "barcode": "171139842",
            "dpc": "03010222901",
            "name": "ឃួយ  ស៊ីម៉ុង"
        },
        {
            "barcode": "171139843",
            "dpc": "03010223101",
            "name": "ពី ឈន"
        },
        {
            "barcode": "171139844",
            "dpc": "03010223501",
            "name": "ព្រាប ផន"
        },
        {
            "barcode": "171139845",
            "dpc": "03010223301",
            "name": "សុង រ៉ាវាល់ពិនឌី"
        },
        {
            "barcode": "171139846",
            "dpc": "03010223201",
            "name": "រ៉ុង សាឌីន"
        },
        {
            "barcode": "171139847",
            "dpc": "03010223601",
            "name": "វ៉ាន សុខុម"
        },
        {
            "barcode": "171139848",
            "dpc": "03010223001",
            "name": "យាយ ថន"
        },
        {
            "barcode": "171139849",
            "dpc": "03010223401",
            "name": "អ៊ួន សុក"
        },
        {
            "barcode": "171139850",
            "dpc": "03010223701",
            "name": "ប៉ែន រដ្ឋា"
        },
        {
            "barcode": "171139851",
            "dpc": "03010223801",
            "name": "ពេជ្រ តុង"
        },
        {
            "barcode": "171139852",
            "dpc": "03010223901",
            "name": "ប៉ិច ដារ៉ារិទ្ធ"
        },
        {
            "barcode": "171139853",
            "dpc": "03010224001",
            "name": "ញ៉ែម យ៉ានី"
        },
        {
            "barcode": "171139854",
            "dpc": "03010224101",
            "name": "កាំង ឈីវឃៀម"
        },
        {
            "barcode": "171139855",
            "dpc": "03010224201",
            "name": "កុយ ហ៊ាង"
        },
        {
            "barcode": "171139856",
            "dpc": "03010224301",
            "name": "ជា បូ"
        },
        {
            "barcode": "171139857",
            "dpc": "03010224401",
            "name": "ហ៊ាង ប៊ុនហុក"
        },
        {
            "barcode": "171139858",
            "dpc": "03010224601",
            "name": "គង់ ឡៃហាន់"
        },
        {
            "barcode": "171139859",
            "dpc": "03010224701",
            "name": "ទិស្នាក់ការ"
        },
        {
            "barcode": "171139860",
            "dpc": "03010224801",
            "name": "ហេង មន្នីចិន្តា"
        },
        {
            "barcode": "171139861",
            "dpc": "03010224901",
            "name": "យ៉ម ចំរើន ៣"
        },
        {
            "barcode": "171139862",
            "dpc": "03010225001",
            "name": "យ៉ម ចំរើន ៥"
        },
        {
            "barcode": "171139863",
            "dpc": "03010225101",
            "name": "សឿន សុភី"
        },
        {
            "barcode": "171139864",
            "dpc": "03010225201",
            "name": "អ៊ឹង សារី"
        },
        {
            "barcode": "171139865",
            "dpc": "03010225301",
            "name": "ប៉ែន សាវុធ"
        },
        {
            "barcode": "171139866",
            "dpc": "03010225401",
            "name": "រស់ យ៉េង"
        },
        {
            "barcode": "171139867",
            "dpc": "03010225501",
            "name": "សេក ម៉ាលីស"
        },
        {
            "barcode": "171139868",
            "dpc": "03010225601",
            "name": "លី រ៉ូវីដា"
        },
        {
            "barcode": "171139869",
            "dpc": "03010225701",
            "name": "វ៉ៃ ប៉ូ"
        },
        {
            "barcode": "171139870",
            "dpc": "03010225801",
            "name": "ប៉ូ វិវឌ្ឍនៈ"
        },
        {
            "barcode": "171139871",
            "dpc": "03010225901",
            "name": "ភិន សាមឿន ១"
        },
        {
            "barcode": "171139872",
            "dpc": "03010226001",
            "name": "ភិន សាមឿន ២"
        },
        {
            "barcode": "171139873",
            "dpc": "03010226101",
            "name": "ភិន សាមឿន 3"
        },
        {
            "barcode": "171139874",
            "dpc": "03010226201",
            "name": "ភិន សាមឿន ៤"
        },
        {
            "barcode": "171139875",
            "dpc": "03010226401",
            "name": "ទ្រឿង ល័ក្ខ"
        },
        {
            "barcode": "171139876",
            "dpc": "03010226501",
            "name": "សួស ស៊ីណាន"
        },
        {
            "barcode": "171139877",
            "dpc": "03010226801",
            "name": "មាស សារុន"
        },
        {
            "barcode": "171139878",
            "dpc": "03010226701",
            "name": "គង់ ម៉ៅ"
        },
        {
            "barcode": "171139879",
            "dpc": "03010227001",
            "name": "សូ កូវីតា​ (មុខ)"
        },
        {
            "barcode": "171139880",
            "dpc": "03010227101",
            "name": "នង សាមឿន"
        },
        {
            "barcode": "171139881",
            "dpc": "03010227201",
            "name": "ណ លីណា"
        },
        {
            "barcode": "171139882",
            "dpc": "03010224501",
            "name": "អួន គុណ"
        },
        {
            "barcode": "171139883",
            "dpc": "03010227301",
            "name": "សេង ដាន់ណា"
        },
        {
            "barcode": "171139884",
            "dpc": "03010227401",
            "name": "មាស ទុំ"
        },
        {
            "barcode": "171139885",
            "dpc": "03010227701",
            "name": "លឹម ហ៊ួសាន"
        },
        {
            "barcode": "171139886",
            "dpc": "03010227501",
            "name": "ជួន ស្រីមុំ"
        },
        {
            "barcode": "171139887",
            "dpc": "03010227601",
            "name": "ជួប សាវឿន"
        },
        {
            "barcode": "171139888",
            "dpc": "03010227801",
            "name": "ញ៉ែម ចាន់នី"
        },
        {
            "barcode": "171139889",
            "dpc": "03010227901",
            "name": "ឈាង សែ"
        },
        {
            "barcode": "171139890",
            "dpc": "03010228001",
            "name": "គី ប៊ុនណាល់"
        },
        {
            "barcode": "171139891",
            "dpc": "03010228101",
            "name": "ជុង សុចិត្រា"
        },
        {
            "barcode": "171139892",
            "dpc": "03010228201",
            "name": "អេង ង៉ោ"
        },
        {
            "barcode": "171139893",
            "dpc": "03010228301",
            "name": "អៀង សេរី"
        },
        {
            "barcode": "171139894",
            "dpc": "03010229701",
            "name": "អ៊ុក សាមឿន"
        },
        {
            "barcode": "171139895",
            "dpc": "03010229801",
            "name": "សាន់ លីហ៊ាង"
        },
        {
            "barcode": "171139896",
            "dpc": "03010229901",
            "name": "ឈឹម ទឹម"
        },
        {
            "barcode": "171139897",
            "dpc": "03010228501",
            "name": "ស៊ុន ក្រូច"
        },
        {
            "barcode": "171139898",
            "dpc": "03010228801",
            "name": "វែន សុភ័ក្រ្ត"
        },
        {
            "barcode": "171139899",
            "dpc": "03010228601",
            "name": "ខឹម សុភា"
        },
        {
            "barcode": "171139900",
            "dpc": "03010228701",
            "name": "មាស វិចិត្រ"
        },
        {
            "barcode": "171139901",
            "dpc": "03010228401",
            "name": "ណឹម ប៉េកាឡេ"
        },
        {
            "barcode": "171139902",
            "dpc": "03010228901",
            "name": "អ៊ឹង វឌ្ឍនៈ"
        },
        {
            "barcode": "171139903",
            "dpc": "03010229001",
            "name": "សុក វិត"
        },
        {
            "barcode": "171139904",
            "dpc": "03010229101",
            "name": "ងួន រតនៈ"
        },
        {
            "barcode": "171139905",
            "dpc": "03010229201",
            "name": "គង់ បាន ២"
        },
        {
            "barcode": "171139906",
            "dpc": "03010229301",
            "name": "ប៉ោ ទ្រីឌឿន ២"
        },
        {
            "barcode": "171139907",
            "dpc": "03010229401",
            "name": "ប៉ោ ទ្រីឌឿន ១"
        },
        {
            "barcode": "171139908",
            "dpc": "03010229601",
            "name": "រ៉ាយ ប៊ុនធឿន"
        },
        {
            "barcode": "171139909",
            "dpc": "03010231401",
            "name": "ឯម វរិទ្ធ"
        },
        {
            "barcode": "171139910",
            "dpc": "03010231301",
            "name": "ជី នី"
        },
        {
            "barcode": "171139911",
            "dpc": "03010231001",
            "name": "ឡាំង វង្ស"
        },
        {
            "barcode": "171139912",
            "dpc": "03010230201",
            "name": "វង្ស វ៉ាន"
        },
        {
            "barcode": "171139913",
            "dpc": "03010230001",
            "name": "យូ ឈឿម"
        },
        {
            "barcode": "171139914",
            "dpc": "03010230101",
            "name": "ហ៊ុល ហេង"
        },
        {
            "barcode": "171139915",
            "dpc": "03010230401",
            "name": "ភួង ភិរ័ត្ន"
        },
        {
            "barcode": "171139916",
            "dpc": "03010230301",
            "name": "ជា ដាលីន"
        },
        {
            "barcode": "171139917",
            "dpc": "03010230501",
            "name": "ឡេង ហ៊ន"
        },
        {
            "barcode": "171139918",
            "dpc": "03010230601",
            "name": "ហម អនុជ"
        },
        {
            "barcode": "171139919",
            "dpc": "03010230701",
            "name": "ទាត់ ធឿន"
        },
        {
            "barcode": "171139920",
            "dpc": "03010230901",
            "name": "សុខ វីរៈ"
        },
        {
            "barcode": "171139921",
            "dpc": "03010231201",
            "name": "ខៀវ សុជាតិ"
        },
        {
            "barcode": "171139922",
            "dpc": "03010232401",
            "name": "អ៊ុយ វណ្ណនី"
        },
        {
            "barcode": "171139923",
            "dpc": "03010232301",
            "name": "តេង ហុកហេង"
        },
        {
            "barcode": "171139924",
            "dpc": "03010232201",
            "name": "ជ័យ សែន"
        },
        {
            "barcode": "171139925",
            "dpc": "03010232101",
            "name": "ទេព វិត"
        },
        {
            "barcode": "171139926",
            "dpc": "03010232001",
            "name": "សោ វុទ្ធី"
        },
        {
            "barcode": "171139927",
            "dpc": "03010231901",
            "name": "សួង សុគន្ធ"
        },
        {
            "barcode": "171139928",
            "dpc": "03010231801",
            "name": "សួង ចាន់ទី"
        },
        {
            "barcode": "171139929",
            "dpc": "03010231701",
            "name": "សួង សុធា"
        },
        {
            "barcode": "171139930",
            "dpc": "03010231601",
            "name": "ពេជ្រ ព្រហ្មមុនី"
        },
        {
            "barcode": "171139931",
            "dpc": "03010235801",
            "name": "នឹម សួ"
        },
        {
            "barcode": "171139932",
            "dpc": "03010235701",
            "name": "មួង សារ៉េន ១"
        },
        {
            "barcode": "171139933",
            "dpc": "03010235601",
            "name": "ឡុង ផលគុណ"
        },
        {
            "barcode": "171139934",
            "dpc": "03010235501",
            "name": "ខាន់ ម៉ាណេ"
        },
        {
            "barcode": "171139935",
            "dpc": "03010235401",
            "name": "ព្រះវិហារ"
        },
        {
            "barcode": "171139936",
            "dpc": "03010235101",
            "name": "ហ៊ាង រ៉ាវុត"
        },
        {
            "barcode": "171139937",
            "dpc": "03010235001",
            "name": "អ៊ឹង ឆាយ"
        },
        {
            "barcode": "171139938",
            "dpc": "03010234801",
            "name": "ចេង សុខណា"
        },
        {
            "barcode": "171139939",
            "dpc": "03010234701",
            "name": "ឡាំ គឹមហេង"
        },
        {
            "barcode": "171139940",
            "dpc": "03010234601",
            "name": "ឡាញ សាអូន"
        },
        {
            "barcode": "171139941",
            "dpc": "03010234501",
            "name": "ទស្ស ហុង"
        },
        {
            "barcode": "171139942",
            "dpc": "03010234301",
            "name": "ទិត្យ ហ៊ាន"
        },
        {
            "barcode": "171139943",
            "dpc": "03010234201",
            "name": "ប៉ែន សារិទ្ធ"
        },
        {
            "barcode": "171139944",
            "dpc": "03010234101",
            "name": "ឃួន ស៊ីម៉ង"
        },
        {
            "barcode": "171139945",
            "dpc": "03010234001",
            "name": "គី ឌីណា"
        },
        {
            "barcode": "171139946",
            "dpc": "03010233901",
            "name": "អៀ សាវុធ"
        },
        {
            "barcode": "171139947",
            "dpc": "03010233801",
            "name": "ឈាង ហាក់"
        },
        {
            "barcode": "171139948",
            "dpc": "03010233701",
            "name": "ឡុង ម៉ាដា"
        },
        {
            "barcode": "171139949",
            "dpc": "03010233501",
            "name": "ជា ស៊ីមៀន"
        },
        {
            "barcode": "171139950",
            "dpc": "03010233401",
            "name": "ជី"
        },
        {
            "barcode": "171139951",
            "dpc": "03010233301",
            "name": "តាំង អ៊ិចហុង"
        },
        {
            "barcode": "171139952",
            "dpc": "03010233101",
            "name": "ថេត ថេន"
        },
        {
            "barcode": "171139953",
            "dpc": "03010233001",
            "name": "ហុក ដាវិន"
        },
        {
            "barcode": "171139954",
            "dpc": "03010232901",
            "name": "សាយ សុវណ្ណរ៉េត"
        },
        {
            "barcode": "171139955",
            "dpc": "03010232801",
            "name": "សុ វណ្ណារី"
        },
        {
            "barcode": "171139956",
            "dpc": "03010232701",
            "name": "ពិន សុជាតា"
        },
        {
            "barcode": "171139957",
            "dpc": "03010232601",
            "name": "លក ស៊ូ"
        },
        {
            "barcode": "171139958",
            "dpc": "03010232501",
            "name": "សេង សាវុធ"
        },
        {
            "barcode": "171139959",
            "dpc": "03010240001",
            "name": "ឈឿន វេង"
        },
        {
            "barcode": "171139960",
            "dpc": "03010239801",
            "name": "ឃួន ឈឿត ២"
        },
        {
            "barcode": "171139961",
            "dpc": "03010239901",
            "name": "ឃួន ឈឿត ៣"
        },
        {
            "barcode": "171139962",
            "dpc": "03010239701",
            "name": "ឃួន ឈឿត ១"
        },
        {
            "barcode": "171139963",
            "dpc": "03010239601",
            "name": "រស់ សុធី"
        },
        {
            "barcode": "171139964",
            "dpc": "03010239501",
            "name": "សៀ បេន"
        },
        {
            "barcode": "171139965",
            "dpc": "03010239401",
            "name": "សូ ភីយា"
        },
        {
            "barcode": "171139966",
            "dpc": "03010239301",
            "name": "ចាយ តុងកឹង"
        },
        {
            "barcode": "171139967",
            "dpc": "03010239101",
            "name": "ផុន សាវឿន"
        },
        {
            "barcode": "171139968",
            "dpc": "03010240301",
            "name": "ហ៊ុល ធី"
        },
        {
            "barcode": "171139969",
            "dpc": "03010240201",
            "name": "ម៉េង វ៉ានដានីន"
        },
        {
            "barcode": "171139970",
            "dpc": "03010239201",
            "name": "លឹម ហូរ"
        },
        {
            "barcode": "171139971",
            "dpc": "03010237701",
            "name": "ព្រហ្ម មរណៈ"
        },
        {
            "barcode": "171139972",
            "dpc": "03010237201",
            "name": "អ៊ឹង ពោធិរដ្ឋ"
        },
        {
            "barcode": "171139973",
            "dpc": "03010237101",
            "name": "ឡុច ឈឿត"
        },
        {
            "barcode": "171139974",
            "dpc": "03010237001",
            "name": "ភោគ សុផុន ២"
        },
        {
            "barcode": "171139975",
            "dpc": "03010236801",
            "name": "ស៊ុត សៅរ៉ាន"
        },
        {
            "barcode": "171139976",
            "dpc": "03010236701",
            "name": "ស្វិត ជេដ្ឋា"
        },
        {
            "barcode": "171139977",
            "dpc": "03010238001",
            "name": "សោ បូរិទ្ធ"
        },
        {
            "barcode": "171139978",
            "dpc": "03010237901",
            "name": "មួង រ៉េន"
        },
        {
            "barcode": "171139979",
            "dpc": "03010240101",
            "name": "ព្រហ្ម មរណៈ"
        },
        {
            "barcode": "171139980",
            "dpc": "03010237801",
            "name": "អ៊ុក វី"
        },
        {
            "barcode": "171139981",
            "dpc": "03010237601",
            "name": "អូន វិបុល"
        },
        {
            "barcode": "171139982",
            "dpc": "03010237501",
            "name": "ឯក សំអូន ៣"
        },
        {
            "barcode": "171139983",
            "dpc": "03010237401",
            "name": "ឯក សំអូន ១"
        },
        {
            "barcode": "171139984",
            "dpc": "03010237301",
            "name": "ប៊ុន  ប៉ា"
        },
        {
            "barcode": "171139985",
            "dpc": "03010236401",
            "name": "ម៉ម ហ៊ីម"
        },
        {
            "barcode": "171139986",
            "dpc": "03010236501",
            "name": "វ៉ា គឹមអូន"
        },
        {
            "barcode": "171139987",
            "dpc": "03010236601",
            "name": "ជា ហុង"
        },
        {
            "barcode": "171139988",
            "dpc": "03010246901",
            "name": "យិន នូ"
        },
        {
            "barcode": "171139989",
            "dpc": "03010246601",
            "name": "ស សារិន"
        },
        {
            "barcode": "171139990",
            "dpc": "03010238901",
            "name": "ហួយ ប៊ុនឡេង"
        },
        {
            "barcode": "171139991",
            "dpc": "03010238801",
            "name": "ឯក សុផាន"
        },
        {
            "barcode": "171139992",
            "dpc": "03010240801",
            "name": "ពៅ ពីដារិទ្ធ"
        },
        {
            "barcode": "171139993",
            "dpc": "03010240601",
            "name": "ម៉ី វណ្ណទូច"
        },
        {
            "barcode": "171139994",
            "dpc": "03010240501",
            "name": "ជា ឆន"
        },
        {
            "barcode": "171139995",
            "dpc": "03010240401",
            "name": "អ៊ិន ស៊ីដារ៉េ"
        },
        {
            "barcode": "171139996",
            "dpc": "03010238701",
            "name": "កែវ សាឡាត់"
        },
        {
            "barcode": "171139997",
            "dpc": "03010238301",
            "name": "ចាន់ សារឿម"
        },
        {
            "barcode": "171139998",
            "dpc": "03010238401",
            "name": "នាង ផល្លា"
        },
        {
            "barcode": "171139999",
            "dpc": "03010238201",
            "name": "ហ៊ាង រ័ត្ន"
        },
        {
            "barcode": "171140000",
            "dpc": "03010238101",
            "name": "ចាន ធូ"
        },
        {
            "barcode": "171140001",
            "dpc": "03010246801",
            "name": "តុល ចាន់សុខ"
        },
        {
            "barcode": "171140002",
            "dpc": "03010246701",
            "name": "ប៉ិល សៃ"
        },
        {
            "barcode": "171140003",
            "dpc": "03010241901",
            "name": "សួន សុខន"
        },
        {
            "barcode": "171140004",
            "dpc": "03010242101",
            "name": "ចាន់ ថុលឡា"
        },
        {
            "barcode": "171140005",
            "dpc": "03010241601",
            "name": "ឯម សុភាព"
        },
        {
            "barcode": "171140006",
            "dpc": "03010241401",
            "name": "សោម សុវណ្ណ"
        },
        {
            "barcode": "171140007",
            "dpc": "03010241201",
            "name": "ឆេង ស្រីនាថ"
        },
        {
            "barcode": "171140008",
            "dpc": "03010241101",
            "name": "សំ សុវណ្ណ"
        },
        {
            "barcode": "171140009",
            "dpc": "03010240901",
            "name": "ផាន់ សុវណ្ណ"
        },
        {
            "barcode": "171140010",
            "dpc": "03010241001",
            "name": "ចាន់ គឹមហុង"
        },
        {
            "barcode": "171140011",
            "dpc": "03010243801",
            "name": "ស៊ុប ធី (វត្តសង្កែ)"
        },
        {
            "barcode": "171140012",
            "dpc": "03010241301",
            "name": "វត្តសង្កែ"
        },
        {
            "barcode": "171140013",
            "dpc": "03010246501",
            "name": "អ៊ិន ប្រាជ្ញ"
        },
        {
            "barcode": "171140014",
            "dpc": "03010241801",
            "name": "សោម មាន"
        },
        {
            "barcode": "171140015",
            "dpc": "03010241701",
            "name": "ចំរើ រដ្ឋ"
        },
        {
            "barcode": "171140016",
            "dpc": "03010245701",
            "name": "ឌុច ហឿម"
        },
        {
            "barcode": "171140017",
            "dpc": "03010245601",
            "name": "ប៊ូ ប៉ុច"
        },
        {
            "barcode": "171140018",
            "dpc": "03010245401",
            "name": "នុល ឈឿង"
        },
        {
            "barcode": "171140019",
            "dpc": "03010245301",
            "name": "ទេព ទូ"
        },
        {
            "barcode": "171140020",
            "dpc": "03010245201",
            "name": "ដូង  រតនះ"
        },
        {
            "barcode": "171140021",
            "dpc": "03010245101",
            "name": "ប៉េ ហួម"
        },
        {
            "barcode": "171140022",
            "dpc": "03010245001",
            "name": "ប៉ិច ប៉ុក"
        },
        {
            "barcode": "171140023",
            "dpc": "03010244901",
            "name": "ប៉ិច ហាប់"
        },
        {
            "barcode": "171140024",
            "dpc": "03010244801",
            "name": "លួង ឆយ"
        },
        {
            "barcode": "171140025",
            "dpc": "03010244701",
            "name": "ងៀង សុំភ័ណ"
        },
        {
            "barcode": "171140026",
            "dpc": "03010244601",
            "name": "ភន រដ្ឋា"
        },
        {
            "barcode": "171140027",
            "dpc": "03010244501",
            "name": "ស៊ុត សឿង"
        },
        {
            "barcode": "171140028",
            "dpc": "03010244401",
            "name": "អៀប រិននឿត"
        },
        {
            "barcode": "171140029",
            "dpc": "03010244201",
            "name": "អៀក ឈៀត"
        },
        {
            "barcode": "171140030",
            "dpc": "03010244101",
            "name": "អៀក ភៀង"
        },
        {
            "barcode": "171140031",
            "dpc": "03010244001",
            "name": "លួត ភួង"
        },
        {
            "barcode": "171140032",
            "dpc": "03010243901",
            "name": "ជុក គឹមហាប់"
        },
        {
            "barcode": "171140033",
            "dpc": "03010246401",
            "name": "សៀ ប៊ុនយឺ"
        },
        {
            "barcode": "171140034",
            "dpc": "03010246301",
            "name": "សៀ គឹមណៃ"
        },
        {
            "barcode": "171140035",
            "dpc": "03010246201",
            "name": "ផាន់ សុគឿន"
        },
        {
            "barcode": "171140036",
            "dpc": "03010246101",
            "name": "ប៉ាន់  ហូ"
        },
        {
            "barcode": "171140037",
            "dpc": "03010246001",
            "name": "ឡុង ផលគុន"
        },
        {
            "barcode": "171140038",
            "dpc": "03010245801",
            "name": "ប៊ុន ប្រសិទ្ធ"
        },
        {
            "barcode": "171140039",
            "dpc": "03010245901",
            "name": "ម៉ាក់ សុខា"
        },
        {
            "barcode": "171140040",
            "dpc": "03010242701",
            "name": "អ៊ុក មិត្ត"
        },
        {
            "barcode": "171140041",
            "dpc": "03010242601",
            "name": "ម៉ម សុម៉ាវត្តី"
        },
        {
            "barcode": "171140042",
            "dpc": "03010242501",
            "name": "ហោ គឹមសឿង"
        },
        {
            "barcode": "171140043",
            "dpc": "03010242401",
            "name": "ហ៊ុយ យិនង៉"
        },
        {
            "barcode": "171140044",
            "dpc": "03010242301",
            "name": "ប៉ុក ណាវី"
        },
        {
            "barcode": "171140045",
            "dpc": "03010243701",
            "name": "តាន់ ម៉េង"
        },
        {
            "barcode": "171140046",
            "dpc": "03010243601",
            "name": "ម៉េង សុឡាតា"
        },
        {
            "barcode": "171140047",
            "dpc": "03010243501",
            "name": "ម៉េង សុគិត"
        },
        {
            "barcode": "171140048",
            "dpc": "03010243401",
            "name": "សំ ឆន"
        },
        {
            "barcode": "171140049",
            "dpc": "03010243301",
            "name": "នាង ឡានី"
        },
        {
            "barcode": "171140050",
            "dpc": "03010243201",
            "name": "ឌុក សាង"
        },
        {
            "barcode": "171140051",
            "dpc": "03010243001",
            "name": "មន្ទីរពេទ្យសុខសាន"
        },
        {
            "barcode": "171140052",
            "dpc": "03010242801",
            "name": "សង ថន"
        },
        {
            "barcode": "171140053",
            "dpc": "03010202601",
            "name": "ថន ប៊ុនថាន់"
        },
        {
            "barcode": "171140054",
            "dpc": "03010202701",
            "name": "គឹម សាន្ត"
        },
        {
            "barcode": "171140055",
            "dpc": "03010202801",
            "name": "រៀន សំណាង"
        },
        {
            "barcode": "171140056",
            "dpc": "03010203101",
            "name": "ម៉ែន សុខុម"
        },
        {
            "barcode": "171140057",
            "dpc": "03010203301",
            "name": "ហេង សុភាព"
        },
        {
            "barcode": "171140058",
            "dpc": "03010203401",
            "name": "វ៉ន ណារ៉ូ"
        },
        {
            "barcode": "171140059",
            "dpc": "03010200401",
            "name": "ប៉ូវ សំភី"
        },
        {
            "barcode": "171140060",
            "dpc": "03010200801",
            "name": "ម៉ី សារី"
        },
        {
            "barcode": "171140061",
            "dpc": "03010200901",
            "name": "យិន ពៅ"
        },
        {
            "barcode": "171140062",
            "dpc": "03010201001",
            "name": "សារ័ត្ន មុន្នី"
        },
        {
            "barcode": "171140063",
            "dpc": "03010201101",
            "name": "កេត្រ ស៊ីយ៉ារ៉ា"
        },
        {
            "barcode": "171140064",
            "dpc": "03010201201",
            "name": "យឹម យឿន"
        },
        {
            "barcode": "171140065",
            "dpc": "03010201301",
            "name": "យ៉ាត ស្រីសុខុម"
        },
        {
            "barcode": "171140066",
            "dpc": "03010201401",
            "name": "កុយ នុយ"
        },
        {
            "barcode": "171140067",
            "dpc": "03010201501",
            "name": "សេង សុភី"
        },
        {
            "barcode": "171140068",
            "dpc": "03010201701",
            "name": "ប៊ិន យួម"
        },
        {
            "barcode": "171140069",
            "dpc": "03010201801",
            "name": "ហឿង ហាយ"
        },
        {
            "barcode": "171140070",
            "dpc": "03010201901",
            "name": "អួង ណារ៉េត"
        },
        {
            "barcode": "171140071",
            "dpc": "03010202001",
            "name": "យ៉ន បូរ៉ា"
        },
        {
            "barcode": "171140072",
            "dpc": "03010202101",
            "name": "ហូរ ធី"
        },
        {
            "barcode": "171140073",
            "dpc": "03010200701",
            "name": "កែវ ដេត"
        },
        {
            "barcode": "171140074",
            "dpc": "03010200601",
            "name": "កេត្រ ចន្ត្រា"
        },
        {
            "barcode": "171140075",
            "dpc": "03010202401",
            "name": "សៅ ណាវី"
        },
        {
            "barcode": "171140076",
            "dpc": "03010202301",
            "name": "ហេង ស៊ុនហូរ"
        },
        {
            "barcode": "171140077",
            "dpc": "03010202201",
            "name": "ពុម ប៊ុនង៉ា"
        },
        {
            "barcode": "171140078",
            "dpc": "03010201601",
            "name": "លឿម សុខហេង"
        },
        {
            "barcode": "171140079",
            "dpc": "03010200101",
            "name": "ឡាច សាមឿន"
        },
        {
            "barcode": "171140080",
            "dpc": "03010200201",
            "name": "នូវ ខន្តី"
        },
        {
            "barcode": "171140081",
            "dpc": "03010200301",
            "name": "ចាន់ តុន"
        },
        {
            "barcode": "171140082",
            "dpc": "03010247501",
            "name": "គុយ ឈុំណាត"
        },
        {
            "barcode": "171140083",
            "dpc": "03010247901",
            "name": "ជុន ណៃឈឿត"
        },
        {
            "barcode": "171140084",
            "dpc": "03010247301",
            "name": "សួន ចាន់សឿន"
        },
        {
            "barcode": "171140085",
            "dpc": "03010203701",
            "name": "សុផល"
        },
        {
            "barcode": "171140086",
            "dpc": "03010203601",
            "name": "ផូ សុងហេង"
        },
        {
            "barcode": "171140087",
            "dpc": "03010203501",
            "name": "សូ ឈឿងលី"
        },
        {
            "barcode": "171140088",
            "dpc": "03010203801",
            "name": "ជយ ហឿម"
        },
        {
            "barcode": "171140089",
            "dpc": "03010203901",
            "name": "ថន សារិទ្ធ"
        },
        {
            "barcode": "171140090",
            "dpc": "03010204001",
            "name": "សុក ពុធ"
        },
        {
            "barcode": "171140091",
            "dpc": "03010204201",
            "name": "សន ប៊ុនធឿន"
        },
        {
            "barcode": "171140092",
            "dpc": "03010204401",
            "name": "សេង ប៊ុនសួ"
        },
        {
            "barcode": "171140093",
            "dpc": "03010204601",
            "name": "កែវ សៀប៉ូ"
        },
        {
            "barcode": "171140094",
            "dpc": "03010204501",
            "name": "ជួង ខ្វា"
        },
        {
            "barcode": "171140095",
            "dpc": "03010204301",
            "name": "ហ៊ាន  ហឹម"
        },
        {
            "barcode": "171140096",
            "dpc": "03010207001",
            "name": "រ៉ាយ  សារ៉ុម"
        },
        {
            "barcode": "171140097",
            "dpc": "03010220901",
            "name": "ជាង  ម៉េត"
        },
        {
            "barcode": "171140098",
            "dpc": "03010226301",
            "name": "ឌួង វិបុល"
        },
        {
            "barcode": "171140099",
            "dpc": "03010229501",
            "name": "ឈុន  ស្រេង"
        },
        {
            "barcode": "171140100",
            "dpc": "03010233601",
            "name": "ថង សៀង"
        },
        {
            "barcode": "171140101",
            "dpc": "03010234401",
            "name": "យឹម  សុខា"
        },
        {
            "barcode": "171140102",
            "dpc": "03010235201",
            "name": "ផូ  ធូរេន"
        },
        {
            "barcode": "171140103",
            "dpc": "03010236301",
            "name": "ខៀវ  សំហេន"
        },
        {
            "barcode": "171140104",
            "dpc": "03010236901",
            "name": "តាំង  ប៊ុនហ៊ីម"
        },
        {
            "barcode": "171140105",
            "dpc": "03010238501",
            "name": "សុខ  ចាន់"
        },
        {
            "barcode": "171140106",
            "dpc": "03010238601",
            "name": "ជុំ  សុខុម"
        },
        {
            "barcode": "171140107",
            "dpc": "03010241501",
            "name": "សុខ  ឃាង"
        },
        {
            "barcode": "171140108",
            "dpc": "03010242001",
            "name": "សុខ  ធឿន"
        },
        {
            "barcode": "171140109",
            "dpc": "03010244301",
            "name": "តាន់  សារឿន"
        },
        {
            "barcode": "171140110",
            "dpc": "03010247101",
            "name": "អោក  ប៊ុនធឿន"
        },
        {
            "barcode": "171140111",
            "dpc": "03010247201",
            "name": "ញ៉ែម  សុខា"
        },
        {
            "barcode": "171140112",
            "dpc": "03010247401",
            "name": "ស៊ាង  ចាន់ធាម"
        },
        {
            "barcode": "171140113",
            "dpc": "03010247601",
            "name": "គឹម  ផាត់"
        },
        {
            "barcode": "171140114",
            "dpc": "03010247701",
            "name": "សៅ  ហ៊ាល"
        },
        {
            "barcode": "171140115",
            "dpc": "03010247801",
            "name": "សៅ  មន្ថា"
        },
        {
            "barcode": "171140116",
            "dpc": "03010248001",
            "name": "ម៉ី ជឿន"
        }
    ]

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
