let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171140117",
            "dpc": "03010302201",
            "name": "ងឿន រិទ្ធ"
        },
        {
            "barcode": "171140118",
            "dpc": "03010302301",
            "name": "ហេង សុផល"
        },
        {
            "barcode": "171140119",
            "dpc": "03010302401",
            "name": "គាំ គង់"
        },
        {
            "barcode": "171140120",
            "dpc": "03010302501",
            "name": "ធាវ  អ៊ិត"
        },
        {
            "barcode": "171140121",
            "dpc": "03010302701",
            "name": "វណ្ណា ដា"
        },
        {
            "barcode": "171140122",
            "dpc": "03010302801",
            "name": "ភន សុខា"
        },
        {
            "barcode": "171140123",
            "dpc": "03010302901",
            "name": "សួស សុខភាព"
        },
        {
            "barcode": "171140124",
            "dpc": "03010303001",
            "name": "សុខ ជា"
        },
        {
            "barcode": "171140125",
            "dpc": "03010303101",
            "name": "ស៊ាន ហ៊ុល"
        },
        {
            "barcode": "171140126",
            "dpc": "03010303201",
            "name": "គា យ៉ាន"
        },
        {
            "barcode": "171140127",
            "dpc": "03010303301",
            "name": "រស់ សារ៉េត"
        },
        {
            "barcode": "171140128",
            "dpc": "03010303401",
            "name": "ចាន់ សុខឡេង"
        },
        {
            "barcode": "171140129",
            "dpc": "03010303501",
            "name": "យឹម សាវ៉ាត"
        },
        {
            "barcode": "171140130",
            "dpc": "03010303601",
            "name": "មុត សារឿន"
        },
        {
            "barcode": "171140131",
            "dpc": "03010303701",
            "name": "សេង អាន"
        },
        {
            "barcode": "171140132",
            "dpc": "03010303901",
            "name": "សេក អៀង"
        },
        {
            "barcode": "171140133",
            "dpc": "03010303801",
            "name": "អ៊ិត ស៊ីធា"
        },
        {
            "barcode": "171140134",
            "dpc": "03010304001",
            "name": "អែម គឹមស៊ុន"
        },
        {
            "barcode": "171140135",
            "dpc": "03010304101",
            "name": "ទាវ អ៊ុយសឹង"
        },
        {
            "barcode": "171140136",
            "dpc": "03010304201",
            "name": "អែម ប៊ុនណាត"
        },
        {
            "barcode": "171140137",
            "dpc": "03010304301",
            "name": "ង៉ែត វុទ្ធី"
        },
        {
            "barcode": "171140138",
            "dpc": "03010304401",
            "name": "ឡាច ម៉ាន់"
        },
        {
            "barcode": "171140139",
            "dpc": "03010304601",
            "name": "ចាន់ សំបូរ"
        },
        {
            "barcode": "171140140",
            "dpc": "03010304701",
            "name": "ទាន់ សម័យ"
        },
        {
            "barcode": "171140141",
            "dpc": "03010304801",
            "name": "គឹម បូរី"
        },
        {
            "barcode": "171140142",
            "dpc": "03010305001",
            "name": "ទិត ជិន"
        },
        {
            "barcode": "171140143",
            "dpc": "03010304901",
            "name": "គង់ ហ៊ាន"
        },
        {
            "barcode": "171140144",
            "dpc": "03010333401",
            "name": "អ៊ីវ អមរា"
        },
        {
            "barcode": "171140145",
            "dpc": "03010333501",
            "name": "ឃី ធារ៉ា"
        },
        {
            "barcode": "171140146",
            "dpc": "03010333601",
            "name": "គង់ ហ៊ាន"
        },
        {
            "barcode": "171140147",
            "dpc": "03010333701",
            "name": "អាត ទីត ១"
        },
        {
            "barcode": "171140148",
            "dpc": "03010333801",
            "name": "អាត ទីត ២"
        },
        {
            "barcode": "171140149",
            "dpc": "03010333901",
            "name": "ថង ជី"
        },
        {
            "barcode": "171140150",
            "dpc": "03010334001",
            "name": "អៀប សាវឿត"
        },
        {
            "barcode": "171140151",
            "dpc": "03010334201",
            "name": "អ៊ឹប លឿត ១"
        },
        {
            "barcode": "171140152",
            "dpc": "03010334301",
            "name": "ហ៊ឹង ចំរើន"
        },
        {
            "barcode": "171140153",
            "dpc": "03010334401",
            "name": "ជា​ សុធា"
        },
        {
            "barcode": "171140154",
            "dpc": "03010334501",
            "name": "ស៊ិន ឈៀន"
        },
        {
            "barcode": "171140155",
            "dpc": "03010334601",
            "name": "ចែក ប៊ុនឈៀង"
        },
        {
            "barcode": "171140156",
            "dpc": "03010334701",
            "name": "ស៊ិន សាលី"
        },
        {
            "barcode": "171140157",
            "dpc": "03010334801",
            "name": "រ័ត្ន វ៉ាន់ថា"
        },
        {
            "barcode": "171140158",
            "dpc": "03010334901",
            "name": "សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171140159",
            "dpc": "03010335001",
            "name": "លាស់ សុទ្ធ២"
        },
        {
            "barcode": "171140160",
            "dpc": "03010335101",
            "name": "លាស់ សុទ្ធ ២"
        },
        {
            "barcode": "171140161",
            "dpc": "03010335201",
            "name": "ម៉េង ហ៊ាង"
        },
        {
            "barcode": "171140162",
            "dpc": "03010335301",
            "name": "ឈុន លី"
        },
        {
            "barcode": "171140163",
            "dpc": "03010335401",
            "name": "វ៉ាត វ៉ារីម"
        },
        {
            "barcode": "171140164",
            "dpc": "03010335501",
            "name": "ពួក   លីហាក់"
        },
        {
            "barcode": "171140165",
            "dpc": "03010335601",
            "name": "សឹង ខូច"
        },
        {
            "barcode": "171140166",
            "dpc": "03010335701",
            "name": "ហេង ផាន់"
        },
        {
            "barcode": "171140167",
            "dpc": "03010335801",
            "name": "សឹង ង៉ុយ"
        },
        {
            "barcode": "171140168",
            "dpc": "03010335901",
            "name": "តាំង ម៉េង"
        },
        {
            "barcode": "171140169",
            "dpc": "03010336001",
            "name": "ប៉ូ សុខអេង"
        },
        {
            "barcode": "171140170",
            "dpc": "03010336101",
            "name": "ឈុន ណៃ"
        },
        {
            "barcode": "171140171",
            "dpc": "03010336201",
            "name": "ប៉ូ ស៊ុនទាក"
        },
        {
            "barcode": "171140172",
            "dpc": "03010336301",
            "name": "ទ្រី ម៉េងឡាយ"
        },
        {
            "barcode": "171140173",
            "dpc": "03010336401",
            "name": "សេង សុភា"
        },
        {
            "barcode": "171140174",
            "dpc": "03010336501",
            "name": "សេម ម៉ារីន"
        },
        {
            "barcode": "171140175",
            "dpc": "03010336601",
            "name": "ស៊ុយ ងិន"
        },
        {
            "barcode": "171140176",
            "dpc": "03010336701",
            "name": "យឹក ចន្ធី"
        },
        {
            "barcode": "171140177",
            "dpc": "03010336801",
            "name": "អោម ពិសិទ្ធ"
        },
        {
            "barcode": "171140178",
            "dpc": "03010336901",
            "name": "ឈៀង ហាក"
        },
        {
            "barcode": "171140179",
            "dpc": "03010337001",
            "name": "អ៊ឹម លឿត"
        },
        {
            "barcode": "171140180",
            "dpc": "03010337101",
            "name": "គុជ ជ"
        },
        {
            "barcode": "171140181",
            "dpc": "03010337301",
            "name": "ប៊ុន វណ្ណា"
        },
        {
            "barcode": "171140182",
            "dpc": "03010337501",
            "name": "ខី ហ៊ត"
        },
        {
            "barcode": "171140183",
            "dpc": "03010337601",
            "name": "លន់ សៀន"
        },
        {
            "barcode": "171140184",
            "dpc": "03010337701",
            "name": "ទ្រី ម៉េង"
        },
        {
            "barcode": "171140185",
            "dpc": "03010337901",
            "name": "ឃុន ដាលាង"
        },
        {
            "barcode": "171140186",
            "dpc": "03010338001",
            "name": "តាន់ សុផល"
        },
        {
            "barcode": "171140187",
            "dpc": "03010338101",
            "name": "ទិត សំពាក្យ"
        },
        {
            "barcode": "171140188",
            "dpc": "03010338201",
            "name": "សយ ហ៊ាង"
        },
        {
            "barcode": "171140189",
            "dpc": "03010338301",
            "name": "ទិត កៀត"
        },
        {
            "barcode": "171140190",
            "dpc": "03010304501",
            "name": "ង៉ែត ឈី"
        },
        {
            "barcode": "171140191",
            "dpc": "03010306001",
            "name": "គី មឿន"
        },
        {
            "barcode": "171140192",
            "dpc": "03010306101",
            "name": "អនសុខម៉ាលភាព ១"
        },
        {
            "barcode": "171140193",
            "dpc": "03010305601",
            "name": "លឹម ស៊ីណាត"
        },
        {
            "barcode": "171140194",
            "dpc": "03010305801",
            "name": "សុខ ចាន់ថា"
        },
        {
            "barcode": "171140195",
            "dpc": "03010305701",
            "name": "ងិន អូន"
        },
        {
            "barcode": "171140196",
            "dpc": "03010305901",
            "name": "ទី ហ៊ាង"
        },
        {
            "barcode": "171140197",
            "dpc": "03010306201",
            "name": "ចាន់ ទូច"
        },
        {
            "barcode": "171140198",
            "dpc": "03010306301",
            "name": "វ៉ាន់ គ្រី"
        },
        {
            "barcode": "171140199",
            "dpc": "03010306401",
            "name": "ទេស ឃឿន"
        },
        {
            "barcode": "171140200",
            "dpc": "03010306701",
            "name": "ឡៃ ស៊ីម"
        },
        {
            "barcode": "171140201",
            "dpc": "03010306501",
            "name": "ឌុន វុទ្ធី"
        },
        {
            "barcode": "171140202",
            "dpc": "03010306601",
            "name": "ហង សារៀប"
        },
        {
            "barcode": "171140203",
            "dpc": "03010306901",
            "name": "បង ណាក់"
        },
        {
            "barcode": "171140204",
            "dpc": "03010306801",
            "name": "វ៉ាន់ សុឆិន"
        },
        {
            "barcode": "171140205",
            "dpc": "03010307001",
            "name": "ភួង គឹមស៊ុន"
        },
        {
            "barcode": "171140206",
            "dpc": "03010307101",
            "name": "ស៊ូ ប៊ុនសុំ"
        },
        {
            "barcode": "171140207",
            "dpc": "03010307201",
            "name": "ចាប សំណាង ២"
        },
        {
            "barcode": "171140208",
            "dpc": "03010307301",
            "name": "នៀត"
        },
        {
            "barcode": "171140209",
            "dpc": "03010307401",
            "name": "អ៊ុំ យ៉ា"
        },
        {
            "barcode": "171140210",
            "dpc": "03010307501",
            "name": "ទ្រៀង វិន"
        },
        {
            "barcode": "171140211",
            "dpc": "03010307601",
            "name": "ទ្រឿង វុទ្ធា"
        },
        {
            "barcode": "171140212",
            "dpc": "03010307701",
            "name": "ចាប សំណាង ១"
        },
        {
            "barcode": "171140213",
            "dpc": "03010307801",
            "name": "រូត  ប៉ូលីន"
        },
        {
            "barcode": "171140214",
            "dpc": "03010307901",
            "name": "គឹម សារ៉ាន់"
        },
        {
            "barcode": "171140215",
            "dpc": "03010308001",
            "name": "ព្រុំ សាវន"
        },
        {
            "barcode": "171140216",
            "dpc": "03010308101",
            "name": "និវ  ណន"
        },
        {
            "barcode": "171140217",
            "dpc": "03010308201",
            "name": "យឿម យ៉េង"
        },
        {
            "barcode": "171140218",
            "dpc": "03010308301",
            "name": "ថោង ប្រានី"
        },
        {
            "barcode": "171140219",
            "dpc": "03010308401",
            "name": "ផន សាលីន"
        },
        {
            "barcode": "171140220",
            "dpc": "03010305201",
            "name": "ម៉េង សុឡាតា"
        },
        {
            "barcode": "171140221",
            "dpc": "03010305301",
            "name": "អន ផល្លា"
        },
        {
            "barcode": "171140222",
            "dpc": "03010305501",
            "name": "ម៉ម ស្រីរដ្ឋ"
        },
        {
            "barcode": "171140223",
            "dpc": "03010305401",
            "name": "អោក ចានធឿន ១"
        },
        {
            "barcode": "171140224",
            "dpc": "03010309501",
            "name": "ទូច មន្នី"
        },
        {
            "barcode": "171140225",
            "dpc": "03010309601",
            "name": "ហ៊ី ហ៊ីង"
        },
        {
            "barcode": "171140226",
            "dpc": "03010309701",
            "name": "ជា ចន្យា"
        },
        {
            "barcode": "171140227",
            "dpc": "03010309801",
            "name": "ជា សេត"
        },
        {
            "barcode": "171140228",
            "dpc": "03010309901",
            "name": "ស៊ូ សឿន"
        },
        {
            "barcode": "171140229",
            "dpc": "03010310001",
            "name": "យិន ហ៊ាង"
        },
        {
            "barcode": "171140230",
            "dpc": "03010310101",
            "name": "មុំ សេង"
        },
        {
            "barcode": "171140231",
            "dpc": "03010310201",
            "name": "ស៊ុយ  មុំ"
        },
        {
            "barcode": "171140232",
            "dpc": "03010310401",
            "name": "ហេង រ៉ាឌី"
        },
        {
            "barcode": "171140233",
            "dpc": "03010310501",
            "name": "យ៉ា ខឿប"
        },
        {
            "barcode": "171140234",
            "dpc": "03010310601",
            "name": "ហុង សាខឿន"
        },
        {
            "barcode": "171140235",
            "dpc": "03010310701",
            "name": "គិត ម៉េងហាក់"
        },
        {
            "barcode": "171140236",
            "dpc": "03010310801",
            "name": "ហេង សុផាត"
        },
        {
            "barcode": "171140237",
            "dpc": "03010310901",
            "name": "ហេង សុភាព"
        },
        {
            "barcode": "171140238",
            "dpc": "03010311001",
            "name": "ង៉ាត វ៉ានថា"
        },
        {
            "barcode": "171140239",
            "dpc": "03010309401",
            "name": "រស់ កិត្យា"
        },
        {
            "barcode": "171140240",
            "dpc": "03010311101",
            "name": "ព្រះវិហារគ្រីះបរិសុទ្ធ"
        },
        {
            "barcode": "171140241",
            "dpc": "03010311201",
            "name": "អ៊ិត ឃឿត"
        },
        {
            "barcode": "171140242",
            "dpc": "03010311301",
            "name": "ដើង ស៊ីថា"
        },
        {
            "barcode": "171140243",
            "dpc": "03010311401",
            "name": "ហួត ចានថង"
        },
        {
            "barcode": "171140244",
            "dpc": "03010311501",
            "name": "ហួត ចាន់ស៊ី"
        },
        {
            "barcode": "171140245",
            "dpc": "03010311601",
            "name": "ជឺ  បុទុំ"
        },
        {
            "barcode": "171140246",
            "dpc": "03010311701",
            "name": "កែវ សំអឿន"
        },
        {
            "barcode": "171140247",
            "dpc": "03010311801",
            "name": "ទូច សឿន"
        },
        {
            "barcode": "171140248",
            "dpc": "03010311901",
            "name": "ចុង ស៊ីន"
        },
        {
            "barcode": "171140249",
            "dpc": "03010312001",
            "name": "អាត វណ្ណា ១"
        },
        {
            "barcode": "171140250",
            "dpc": "03010312101",
            "name": "សេង គួន"
        },
        {
            "barcode": "171140251",
            "dpc": "03010312301",
            "name": "យោក ស៊ីផុន"
        },
        {
            "barcode": "171140252",
            "dpc": "03010312401",
            "name": "អាត់ វណ្ណា ២"
        },
        {
            "barcode": "171140253",
            "dpc": "03010312501",
            "name": "វណ្ណា  រ៉េ ១"
        },
        {
            "barcode": "171140254",
            "dpc": "03010312601",
            "name": "ថន ច្ឆា"
        },
        {
            "barcode": "171140255",
            "dpc": "03010312701",
            "name": "ឆាត់ ឆាយឆដា១"
        },
        {
            "barcode": "171140256",
            "dpc": "03010312801",
            "name": "វ៉ន យួង"
        },
        {
            "barcode": "171140257",
            "dpc": "03010312901",
            "name": "ជ័យ សុផាត"
        },
        {
            "barcode": "171140258",
            "dpc": "03010313001",
            "name": "អ៊ុន សាវ៉ុន"
        },
        {
            "barcode": "171140259",
            "dpc": "03010313101",
            "name": "សុខ ចំរើន"
        },
        {
            "barcode": "171140260",
            "dpc": "03010313201",
            "name": "រី សុធារ៉ា"
        },
        {
            "barcode": "171140261",
            "dpc": "03010313301",
            "name": "តិច សេង"
        },
        {
            "barcode": "171140262",
            "dpc": "03010313401",
            "name": "តិច ស៊ាង"
        },
        {
            "barcode": "171140263",
            "dpc": "03010313501",
            "name": "អោម នៅ"
        },
        {
            "barcode": "171140264",
            "dpc": "03010313601",
            "name": "ខុង កវី"
        },
        {
            "barcode": "171140265",
            "dpc": "03010313701",
            "name": "ហៀង ឃាង"
        },
        {
            "barcode": "171140266",
            "dpc": "03010313801",
            "name": "ចាន សុខលីន"
        },
        {
            "barcode": "171140267",
            "dpc": "03010313901",
            "name": "តា ហេង"
        },
        {
            "barcode": "171140268",
            "dpc": "03010314001",
            "name": "គួច  ម៉ារី ១"
        },
        {
            "barcode": "171140269",
            "dpc": "03010314101",
            "name": "គួច  ម៉ារី ២"
        },
        {
            "barcode": "171140270",
            "dpc": "03010314201",
            "name": "ហេង សន"
        },
        {
            "barcode": "171140271",
            "dpc": "03010314301",
            "name": "ឡាញ់ ម៉ុងទី"
        },
        {
            "barcode": "171140272",
            "dpc": "03010331301",
            "name": "អ៊ុយ សុខុម"
        },
        {
            "barcode": "171140273",
            "dpc": "03010331401",
            "name": "ហ៊ាង អូន"
        },
        {
            "barcode": "171140274",
            "dpc": "03010331501",
            "name": "នុត សារុន"
        },
        {
            "barcode": "171140275",
            "dpc": "03010331601",
            "name": "នុត សារិទ្ធ"
        },
        {
            "barcode": "171140276",
            "dpc": "03010331701",
            "name": "មាស សុភិន ១"
        },
        {
            "barcode": "171140277",
            "dpc": "03010331801",
            "name": "មាស សុភិន ២"
        },
        {
            "barcode": "171140278",
            "dpc": "03010331901",
            "name": "ហូរ ប៊ុនហេង"
        },
        {
            "barcode": "171140279",
            "dpc": "03010332001",
            "name": "ហុង ចាន់នី"
        },
        {
            "barcode": "171140280",
            "dpc": "03010332101",
            "name": "ងិន សុជា"
        },
        {
            "barcode": "171140281",
            "dpc": "03010332201",
            "name": "តាំង ហុង"
        },
        {
            "barcode": "171140282",
            "dpc": "03010332301",
            "name": "ប៉ាវ សុភាព"
        },
        {
            "barcode": "171140283",
            "dpc": "03010332401",
            "name": "លី អេង"
        },
        {
            "barcode": "171140284",
            "dpc": "03010332501",
            "name": "ជា ចាន់ថា"
        },
        {
            "barcode": "171140285",
            "dpc": "03010332601",
            "name": "ឈុំ ហៀង"
        },
        {
            "barcode": "171140286",
            "dpc": "03010332701",
            "name": "សាំង ឈិនហូរ"
        },
        {
            "barcode": "171140287",
            "dpc": "03010332801",
            "name": "កែវ ពិសិទ្ធ"
        },
        {
            "barcode": "171140288",
            "dpc": "03010332901",
            "name": "ចាន់ ឃុយ"
        },
        {
            "barcode": "171140289",
            "dpc": "03010333001",
            "name": "សុខ អាន"
        },
        {
            "barcode": "171140290",
            "dpc": "03010333101",
            "name": "ជ័យ សារឿន"
        },
        {
            "barcode": "171140291",
            "dpc": "03010333201",
            "name": "ភី សុភា"
        },
        {
            "barcode": "171140292",
            "dpc": "03010333301",
            "name": "សុខ វណ្ណី"
        },
        {
            "barcode": "171140293",
            "dpc": "03010328501",
            "name": "អ៊ិន សារឿន"
        },
        {
            "barcode": "171140294",
            "dpc": "03010328901",
            "name": "រស ផល"
        },
        {
            "barcode": "171140295",
            "dpc": "03010329001",
            "name": "សៅ ញ៉ាំង"
        },
        {
            "barcode": "171140296",
            "dpc": "03010308501",
            "name": "ពេជ្រ បូរ"
        },
        {
            "barcode": "171140297",
            "dpc": "03010309201",
            "name": "រ៉ុង ឈឿន"
        },
        {
            "barcode": "171140298",
            "dpc": "03010308601",
            "name": "ព្រំ ឆៃយ៉ាន"
        },
        {
            "barcode": "171140299",
            "dpc": "03010308701",
            "name": "សេង ថាឌី ១"
        },
        {
            "barcode": "171140300",
            "dpc": "03010308801",
            "name": "សេង ថាឌី ២"
        },
        {
            "barcode": "171140301",
            "dpc": "03010308901",
            "name": "សរ យស់ថាវរៈ"
        },
        {
            "barcode": "171140302",
            "dpc": "03010309101",
            "name": "អែវ និមល"
        },
        {
            "barcode": "171140303",
            "dpc": "03010326901",
            "name": "យិន សារឿន ១"
        },
        {
            "barcode": "171140304",
            "dpc": "03010327001",
            "name": "យិន សារឿន ២"
        },
        {
            "barcode": "171140305",
            "dpc": "03010327101",
            "name": "យិន សារឿន ៣"
        },
        {
            "barcode": "171140306",
            "dpc": "03010327301",
            "name": "ឈាង ឌុក"
        },
        {
            "barcode": "171140307",
            "dpc": "03010327501",
            "name": "ថ្លាង ប៊ុនណាត"
        },
        {
            "barcode": "171140308",
            "dpc": "03010327801",
            "name": "អ៊ុំ រ៉ា"
        },
        {
            "barcode": "171140309",
            "dpc": "03010328301",
            "name": "អ៊ុន រឿន"
        },
        {
            "barcode": "171140310",
            "dpc": "03010329701",
            "name": "ហ៊ុល យ៉ាង"
        },
        {
            "barcode": "171140311",
            "dpc": "03010329601",
            "name": "ទាវ វុទ្ធី"
        },
        {
            "barcode": "171140312",
            "dpc": "03010329501",
            "name": "ឃឹម សារ៉ាត់"
        },
        {
            "barcode": "171140313",
            "dpc": "03010329301",
            "name": "អ៊ុយ លីវ ៣"
        },
        {
            "barcode": "171140314",
            "dpc": "03010329201",
            "name": "អ៊ុយ លីវ ២"
        },
        {
            "barcode": "171140315",
            "dpc": "03010328801",
            "name": "ខាំ សារ៉ុម"
        },
        {
            "barcode": "171140316",
            "dpc": "03010328401",
            "name": "យ៉ាន សុភី"
        },
        {
            "barcode": "171140317",
            "dpc": "03010328201",
            "name": "កែវ ហឿន"
        },
        {
            "barcode": "171140318",
            "dpc": "03010328101",
            "name": "កែវ  រ៉ាដា"
        },
        {
            "barcode": "171140319",
            "dpc": "03010328001",
            "name": "ឯម សុភី"
        },
        {
            "barcode": "171140320",
            "dpc": "03010327901",
            "name": "ប៊ុន ពៅ"
        },
        {
            "barcode": "171140321",
            "dpc": "03010327601",
            "name": "កាន់ ណាឌី"
        },
        {
            "barcode": "171140322",
            "dpc": "03010327401",
            "name": "តាង សារ៉េត"
        },
        {
            "barcode": "171140323",
            "dpc": "03010327201",
            "name": "ថោង ផល្លា"
        },
        {
            "barcode": "171140324",
            "dpc": "03010319201",
            "name": "សាលារៀនព្រែកព្រះស្តេច"
        },
        {
            "barcode": "171140325",
            "dpc": "03010319301",
            "name": "កែវ ផូ"
        },
        {
            "barcode": "171140326",
            "dpc": "03010319701",
            "name": "សុង ស៊ឹង"
        },
        {
            "barcode": "171140327",
            "dpc": "03010320201",
            "name": "ភុំ រីណូ"
        },
        {
            "barcode": "171140328",
            "dpc": "03010320301",
            "name": "សៀង ស៊ាត"
        },
        {
            "barcode": "171140329",
            "dpc": "03010320401",
            "name": "លី សេង"
        },
        {
            "barcode": "171140330",
            "dpc": "03010320601",
            "name": "រឿន ឈិន"
        },
        {
            "barcode": "171140331",
            "dpc": "03010320701",
            "name": "ហុង សុជា"
        },
        {
            "barcode": "171140332",
            "dpc": "03010320801",
            "name": "ហាក់ ទៀង"
        },
        {
            "barcode": "171140333",
            "dpc": "03010321001",
            "name": "គឹម ប៊ុនថា"
        },
        {
            "barcode": "171140334",
            "dpc": "03010321101",
            "name": "ថោង សារ៉ន"
        },
        {
            "barcode": "171140335",
            "dpc": "03010329801",
            "name": "ថង ចេង"
        },
        {
            "barcode": "171140336",
            "dpc": "03010330801",
            "name": "ជា​ សុខុប"
        },
        {
            "barcode": "171140337",
            "dpc": "03010330701",
            "name": "ហ៊ាង ណៃជឹង"
        },
        {
            "barcode": "171140338",
            "dpc": "03010330601",
            "name": "សាត សារ៉ន"
        },
        {
            "barcode": "171140339",
            "dpc": "03010330401",
            "name": "អឿន ឈន"
        },
        {
            "barcode": "171140340",
            "dpc": "03010330501",
            "name": "នូ សំបូរ"
        },
        {
            "barcode": "171140341",
            "dpc": "03010330301",
            "name": "ហ៊ាង តឹកលី"
        },
        {
            "barcode": "171140342",
            "dpc": "03010330201",
            "name": "យន់ ឡៃ"
        },
        {
            "barcode": "171140343",
            "dpc": "03010330101",
            "name": "ឪ សារឿន"
        },
        {
            "barcode": "171140344",
            "dpc": "03010330001",
            "name": "ជិន សំប៊ុន"
        },
        {
            "barcode": "171140345",
            "dpc": "03010329901",
            "name": "ថង សៀង"
        },
        {
            "barcode": "171140346",
            "dpc": "03010330901",
            "name": "ព្រិល ហ៊ាង"
        },
        {
            "barcode": "171140347",
            "dpc": "03010331001",
            "name": "ឈឿ ឈួន"
        },
        {
            "barcode": "171140348",
            "dpc": "03010331201",
            "name": "ធីតា លក្ខិណា"
        },
        {
            "barcode": "171140349",
            "dpc": "03010309301",
            "name": "អ៊ឹង ថាវី"
        },
        {
            "barcode": "171140350",
            "dpc": "03010314401",
            "name": "ស៊ីន វុឌ្ឍី"
        },
        {
            "barcode": "171140351",
            "dpc": "03010314501",
            "name": "គង់ សក់"
        },
        {
            "barcode": "171140352",
            "dpc": "03010314601",
            "name": "សុខ ញិប"
        },
        {
            "barcode": "171140353",
            "dpc": "03010314701",
            "name": "ឃួន ផន"
        },
        {
            "barcode": "171140354",
            "dpc": "03010314801",
            "name": "កែវ ម៉ូរ៉ាគន្ធ"
        },
        {
            "barcode": "171140355",
            "dpc": "03010314901",
            "name": "សំ សែម"
        },
        {
            "barcode": "171140356",
            "dpc": "03010315001",
            "name": "មុំ រ៉ៃ"
        },
        {
            "barcode": "171140357",
            "dpc": "03010315201",
            "name": "អ៊ុំ ម៉ាលី"
        },
        {
            "barcode": "171140358",
            "dpc": "03010315101",
            "name": "កៅ ថា"
        },
        {
            "barcode": "171140359",
            "dpc": "03010315301",
            "name": "ម៉ិល ហេង"
        },
        {
            "barcode": "171140360",
            "dpc": "03010315401",
            "name": "មាស ស្រាង"
        },
        {
            "barcode": "171140361",
            "dpc": "03010315501",
            "name": "ហង្ស ស៊ីណា"
        },
        {
            "barcode": "171140362",
            "dpc": "03010315601",
            "name": "សុទ្ធ ឈឿម"
        },
        {
            "barcode": "171140363",
            "dpc": "03010318401",
            "name": "សុក សោភា"
        },
        {
            "barcode": "171140364",
            "dpc": "03010318501",
            "name": "ម៉ាច គឹមឆាយ"
        },
        {
            "barcode": "171140365",
            "dpc": "03010318601",
            "name": "មៀន គឹមហ៊ាង"
        },
        {
            "barcode": "171140366",
            "dpc": "03010318801",
            "name": "ទេព សោភ័ណ្ឌ"
        },
        {
            "barcode": "171140367",
            "dpc": "03010318901",
            "name": "ម៉ន រ៉ែត"
        },
        {
            "barcode": "171140368",
            "dpc": "03010319001",
            "name": "ផាត់ សេង"
        },
        {
            "barcode": "171140369",
            "dpc": "03010319101",
            "name": "ឡេង ជីវ"
        },
        {
            "barcode": "171140370",
            "dpc": "03010319901",
            "name": "ភិវ ចំរើន"
        },
        {
            "barcode": "171140371",
            "dpc": "03010317601",
            "name": "ឥត ចំណាន"
        },
        {
            "barcode": "171140372",
            "dpc": "03010317701",
            "name": "កៀវ គឹមលន"
        },
        {
            "barcode": "171140373",
            "dpc": "03010317801",
            "name": "ចៅ គឹមអូន ១"
        },
        {
            "barcode": "171140374",
            "dpc": "03010317901",
            "name": "ចៅ គឹមអូន ២"
        },
        {
            "barcode": "171140375",
            "dpc": "03010318101",
            "name": "រស់ សារួន"
        },
        {
            "barcode": "171140376",
            "dpc": "03010318201",
            "name": "ឡាយ ទិតដារ៉ា"
        },
        {
            "barcode": "171140377",
            "dpc": "03010318301",
            "name": "ភឿក រ័ត្ន"
        },
        {
            "barcode": "171140378",
            "dpc": "03010315701",
            "name": "យក់ វ៉ានឆវី"
        },
        {
            "barcode": "171140379",
            "dpc": "03010315801",
            "name": "កែវ ដារ៉ា"
        },
        {
            "barcode": "171140380",
            "dpc": "03010315901",
            "name": "លឹម សាម៉េត"
        },
        {
            "barcode": "171140381",
            "dpc": "03010316001",
            "name": "ពិន ហុង"
        },
        {
            "barcode": "171140382",
            "dpc": "03010316101",
            "name": "ស៊ាង យ៉ាងហ្គោ"
        },
        {
            "barcode": "171140383",
            "dpc": "03010316601",
            "name": "លួង ឡេង"
        },
        {
            "barcode": "171140384",
            "dpc": "03010316701",
            "name": "ប៉ាន ប៊ុនរឿន"
        },
        {
            "barcode": "171140385",
            "dpc": "03010316501",
            "name": "ម៉ី ប៊ុនហួរ១"
        },
        {
            "barcode": "171140386",
            "dpc": "03010316201",
            "name": "ម៉ី ប៊ុនហូរ"
        },
        {
            "barcode": "171140387",
            "dpc": "03010316901",
            "name": "ឡឹក សុខុន"
        },
        {
            "barcode": "171140388",
            "dpc": "03010316801",
            "name": "ទូច លន"
        },
        {
            "barcode": "171140389",
            "dpc": "03010316301",
            "name": "នូវ សុភាព ១"
        },
        {
            "barcode": "171140390",
            "dpc": "03010317101",
            "name": "អ៊ុក សឿន"
        },
        {
            "barcode": "171140391",
            "dpc": "03010317201",
            "name": "គុណ សាលឿត"
        },
        {
            "barcode": "171140392",
            "dpc": "03010317301",
            "name": "កែវ ភ័ក្រ្ត"
        },
        {
            "barcode": "171140393",
            "dpc": "03010317401",
            "name": "សៅ សុជាតិ ១"
        },
        {
            "barcode": "171140394",
            "dpc": "03010318001",
            "name": "ចៅ  គឹមអូន ៣"
        },
        {
            "barcode": "171140395",
            "dpc": "03010338501",
            "name": "លី យូសូស"
        },
        {
            "barcode": "171140396",
            "dpc": "03010300401",
            "name": "ជឹម ឈិញ"
        },
        {
            "barcode": "171140397",
            "dpc": "03010338601",
            "name": "ហួយ ហុង"
        },
        {
            "barcode": "171140398",
            "dpc": "03010338701",
            "name": "ស្រី ល័ក្ខ"
        },
        {
            "barcode": "171140399",
            "dpc": "03010338801",
            "name": "ប្រាង ភឿត"
        },
        {
            "barcode": "171140400",
            "dpc": "03010338901",
            "name": "សេង ហូរ"
        },
        {
            "barcode": "171140401",
            "dpc": "03010339001",
            "name": "យ៉ាត ចរិយា"
        },
        {
            "barcode": "171140402",
            "dpc": "03010339101",
            "name": "អ៊ុល រឿន"
        },
        {
            "barcode": "171140403",
            "dpc": "03010339201",
            "name": "អ៊ាប វិសាល"
        },
        {
            "barcode": "171140404",
            "dpc": "03010339301",
            "name": "សយ សាវិច"
        },
        {
            "barcode": "171140405",
            "dpc": "03010339401",
            "name": "ជឿម ឃុន"
        },
        {
            "barcode": "171140406",
            "dpc": "03010339501",
            "name": "ទុំ ប៊ុនធៀន"
        },
        {
            "barcode": "171140407",
            "dpc": "03010321401",
            "name": "ឆឹង ដួង"
        },
        {
            "barcode": "171140408",
            "dpc": "03010321301",
            "name": "ជា គឹមឈាង"
        },
        {
            "barcode": "171140409",
            "dpc": "03010321201",
            "name": "ហុង គុយ"
        },
        {
            "barcode": "171140410",
            "dpc": "03010320901",
            "name": "ទូច ហួត"
        },
        {
            "barcode": "171140411",
            "dpc": "03010320501",
            "name": "សាយ សុភាព"
        },
        {
            "barcode": "171140412",
            "dpc": "03010320101",
            "name": "មឹង សួន"
        },
        {
            "barcode": "171140413",
            "dpc": "03010320001",
            "name": "ស ធុច"
        },
        {
            "barcode": "171140414",
            "dpc": "03010319801",
            "name": "ម៉ី ផាន់ណារិទ្ធ"
        },
        {
            "barcode": "171140415",
            "dpc": "03010319401",
            "name": "ស្រី ឆូ"
        },
        {
            "barcode": "171140416",
            "dpc": "03010319601",
            "name": "តោ សាហឿយ"
        },
        {
            "barcode": "171140417",
            "dpc": "03010319501",
            "name": "តោ ហ៊ុន"
        },
        {
            "barcode": "171140418",
            "dpc": "03010326701",
            "name": "លាស គួយ"
        },
        {
            "barcode": "171140419",
            "dpc": "03010326601",
            "name": "ភិន វណ្ណា"
        },
        {
            "barcode": "171140420",
            "dpc": "03010338401",
            "name": "គង់ ឈួន"
        },
        {
            "barcode": "171140421",
            "dpc": "03010326501",
            "name": "ងួន កិត្យា"
        },
        {
            "barcode": "171140422",
            "dpc": "03010326401",
            "name": "ឆឹង ឈួម"
        },
        {
            "barcode": "171140423",
            "dpc": "03010326301",
            "name": "ឆយ ម៉ូវធាង"
        },
        {
            "barcode": "171140424",
            "dpc": "03010326201",
            "name": "វ៉ាន់ ឃាង"
        },
        {
            "barcode": "171140425",
            "dpc": "03010326101",
            "name": "ប៉ក ចាន់"
        },
        {
            "barcode": "171140426",
            "dpc": "03010326001",
            "name": "ប៉ូយ ហ៊ីម"
        },
        {
            "barcode": "171140427",
            "dpc": "03010325901",
            "name": "អេង ង៉ោ"
        },
        {
            "barcode": "171140428",
            "dpc": "03010325801",
            "name": "សុខ អឿន"
        },
        {
            "barcode": "171140429",
            "dpc": "03010325701",
            "name": "ឆឹង ឆាង"
        },
        {
            "barcode": "171140430",
            "dpc": "03010325601",
            "name": "សន ផាន់នី"
        },
        {
            "barcode": "171140431",
            "dpc": "03010325401",
            "name": "ប៉ែន សំបូរ"
        },
        {
            "barcode": "171140432",
            "dpc": "03010325301",
            "name": "មុំ វ៉ាត"
        },
        {
            "barcode": "171140433",
            "dpc": "03010325501",
            "name": "ឡុង សុផាន"
        },
        {
            "barcode": "171140434",
            "dpc": "03010325201",
            "name": "ឡេង សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171140435",
            "dpc": "03010325101",
            "name": "សៀង សាវឿន"
        },
        {
            "barcode": "171140436",
            "dpc": "03010325001",
            "name": "ស ចាន់ថា"
        },
        {
            "barcode": "171140437",
            "dpc": "03010324901",
            "name": "ព្រែក ថា"
        },
        {
            "barcode": "171140438",
            "dpc": "03010324801",
            "name": "ហោ ផល្លី"
        },
        {
            "barcode": "171140439",
            "dpc": "03010324701",
            "name": "គុយ ចាន់ធូ"
        },
        {
            "barcode": "171140440",
            "dpc": "03010324601",
            "name": "ហាក គឹមលាង"
        },
        {
            "barcode": "171140441",
            "dpc": "03010324201",
            "name": "អួង បូរ៉ាផា"
        },
        {
            "barcode": "171140442",
            "dpc": "03010324401",
            "name": "មាស ផុន"
        },
        {
            "barcode": "171140443",
            "dpc": "03010324501",
            "name": "ហុក លាភ"
        },
        {
            "barcode": "171140444",
            "dpc": "03010324301",
            "name": "គី ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171140445",
            "dpc": "03010324101",
            "name": "ឈិន សុផានី"
        },
        {
            "barcode": "171140446",
            "dpc": "03010323901",
            "name": "អេង សាលឿន"
        },
        {
            "barcode": "171140447",
            "dpc": "03010323801",
            "name": "ឆោម គឹមយួង"
        },
        {
            "barcode": "171140448",
            "dpc": "03010323701",
            "name": "ទឹម សេរី"
        },
        {
            "barcode": "171140449",
            "dpc": "03010323601",
            "name": "ឃួន ស៊ាប"
        },
        {
            "barcode": "171140450",
            "dpc": "03010323501",
            "name": "អឿម ប៊ុណ្ណា"
        },
        {
            "barcode": "171140451",
            "dpc": "03010323401",
            "name": "លាន នី"
        },
        {
            "barcode": "171140452",
            "dpc": "03010323301",
            "name": "សយ សារ៉ន"
        },
        {
            "barcode": "171140453",
            "dpc": "03010323201",
            "name": "ខុង ធួក"
        },
        {
            "barcode": "171140454",
            "dpc": "03010323101",
            "name": "អ៊ុក សំផុន"
        },
        {
            "barcode": "171140455",
            "dpc": "03010323001",
            "name": "សយ រៀង"
        },
        {
            "barcode": "171140456",
            "dpc": "03010322801",
            "name": "សូ ផេងគុណ"
        },
        {
            "barcode": "171140457",
            "dpc": "03010322701",
            "name": "ហួត  គីរីរិត"
        },
        {
            "barcode": "171140458",
            "dpc": "03010322601",
            "name": "ភឿប​ ផាយោ"
        },
        {
            "barcode": "171140459",
            "dpc": "03010322501",
            "name": "សោ គឹមឡាយ"
        },
        {
            "barcode": "171140460",
            "dpc": "03010322401",
            "name": "រ៉ែត គុណធារី"
        },
        {
            "barcode": "171140461",
            "dpc": "03010322301",
            "name": "សុខ វិបុល"
        },
        {
            "barcode": "171140462",
            "dpc": "03010322201",
            "name": "ខាត់ ឡុង"
        },
        {
            "barcode": "171140463",
            "dpc": "03010322901",
            "name": "ឈុត សុគន្ធា"
        },
        {
            "barcode": "171140464",
            "dpc": "03010322101",
            "name": "ថៃ ហេង"
        },
        {
            "barcode": "171140465",
            "dpc": "03010322001",
            "name": "យស ឈួន"
        },
        {
            "barcode": "171140466",
            "dpc": "03010321901",
            "name": "បេង សុធី"
        },
        {
            "barcode": "171140467",
            "dpc": "03010321801",
            "name": "ហុង វណ្ណារិទ្ធ"
        },
        {
            "barcode": "171140468",
            "dpc": "03010321601",
            "name": "តាន់ សិទ្ធ"
        },
        {
            "barcode": "171140469",
            "dpc": "03010321701",
            "name": "យ៉ាត ថូ"
        },
        {
            "barcode": "171140470",
            "dpc": "03010321501",
            "name": "សំ វ៉ានថុល"
        },
        {
            "barcode": "171140471",
            "dpc": "03010342101",
            "name": "កែវ ម៉ាន់ធឿន"
        },
        {
            "barcode": "171140472",
            "dpc": "03010342201",
            "name": "សាង សាវុន"
        },
        {
            "barcode": "171140473",
            "dpc": "03010342401",
            "name": "ភឹម ហេង"
        },
        {
            "barcode": "171140474",
            "dpc": "03010342501",
            "name": "តាំង ម៉េង"
        },
        {
            "barcode": "171140475",
            "dpc": "03010342601",
            "name": "ងួន រតនៈ ២"
        },
        {
            "barcode": "171140476",
            "dpc": "03010342701",
            "name": "ឆយ ម៉ូវធៀង"
        },
        {
            "barcode": "171140477",
            "dpc": "03010342901",
            "name": "ឈឿត សំខាន់"
        },
        {
            "barcode": "171140478",
            "dpc": "03010342801",
            "name": "ហេង ហៀង"
        },
        {
            "barcode": "171140479",
            "dpc": "03010343001",
            "name": "ងិន ណារី"
        },
        {
            "barcode": "171140480",
            "dpc": "03010343101",
            "name": "សឹង កាក់"
        },
        {
            "barcode": "171140481",
            "dpc": "03010343301",
            "name": "ប៉េង រ៉ាដេត"
        },
        {
            "barcode": "171140482",
            "dpc": "03010343401",
            "name": "ឃុន កី"
        },
        {
            "barcode": "171140483",
            "dpc": "03010343501",
            "name": "ចាន់ គឹមឡេង"
        },
        {
            "barcode": "171140484",
            "dpc": "03010343601",
            "name": "គី គឹមឡេង"
        },
        {
            "barcode": "171140485",
            "dpc": "03010343701",
            "name": "សយ ឈួន"
        },
        {
            "barcode": "171140486",
            "dpc": "03010343801",
            "name": "សឿន ឃឿប"
        },
        {
            "barcode": "171140487",
            "dpc": "03010343901",
            "name": "ក្រូច គីរី"
        },
        {
            "barcode": "171140488",
            "dpc": "03010344001",
            "name": "សាត សុខុំ"
        },
        {
            "barcode": "171140489",
            "dpc": "03010344101",
            "name": "ធូ ធិន"
        },
        {
            "barcode": "171140490",
            "dpc": "03010344901",
            "name": "ឆឺយ ស៊ីន"
        },
        {
            "barcode": "171140491",
            "dpc": "03010344701",
            "name": "សុខ លាងហួយ"
        },
        {
            "barcode": "171140492",
            "dpc": "03010344501",
            "name": "រ័ត្ន វ៉ាន់"
        },
        {
            "barcode": "171140493",
            "dpc": "03010344301",
            "name": "អ៊ុន ឆៃហ៊ាង"
        },
        {
            "barcode": "171140494",
            "dpc": "03010344201",
            "name": "ទី ផាត"
        },
        {
            "barcode": "171140495",
            "dpc": "03010345201",
            "name": "ស៊ុយ សុវណ្ណមន្នី"
        },
        {
            "barcode": "171140496",
            "dpc": "03010345101",
            "name": "ហ៊ិន ស៊ីប៉ិច"
        },
        {
            "barcode": "171140497",
            "dpc": "03010345001",
            "name": "សាលាឃុំព្រែកព្រះស្តេច"
        },
        {
            "barcode": "171140498",
            "dpc": "03010337801",
            "name": "សៀង  លីម"
        },
        {
            "barcode": "171140499",
            "dpc": "03010344801",
            "name": "គង់ បណ្តូល"
        },
        {
            "barcode": "171140500",
            "dpc": "03010345501",
            "name": "ហេង ពៅ"
        },
        {
            "barcode": "171140501",
            "dpc": "03010345301",
            "name": "វិទ្យាស្ថានអភិវឌ្ឍន៍"
        },
        {
            "barcode": "171140502",
            "dpc": "03010345401",
            "name": "ងួន គង់"
        },
        {
            "barcode": "171140503",
            "dpc": "03010345601",
            "name": "សឿន ស៊ីថា"
        },
        {
            "barcode": "171140504",
            "dpc": "03010345701",
            "name": "អ៊ុក សាវុន"
        },
        {
            "barcode": "171140505",
            "dpc": "03010345801",
            "name": "ទឹម ដារ៉េត"
        },
        {
            "barcode": "171140506",
            "dpc": "03010345901",
            "name": "ឡាច លីម"
        },
        {
            "barcode": "171140507",
            "dpc": "03010346001",
            "name": "ចាន់ ទូច"
        },
        {
            "barcode": "171140508",
            "dpc": "03010346101",
            "name": "ម៉ា ម៉ុន្ថា"
        },
        {
            "barcode": "171140509",
            "dpc": "03010346201",
            "name": "ចាន់ រ៉ា"
        },
        {
            "barcode": "171140510",
            "dpc": "03010346301",
            "name": "អោម ភាព"
        },
        {
            "barcode": "171140511",
            "dpc": "03010346401",
            "name": "ងួន ប៊ុនណា"
        },
        {
            "barcode": "171140512",
            "dpc": "03010346501",
            "name": "ជឹម  ជឿន"
        },
        {
            "barcode": "171140513",
            "dpc": "03010346801",
            "name": "ឡុង ហុកម៉េង"
        },
        {
            "barcode": "171140514",
            "dpc": "03010346601",
            "name": "សន សុផាន់នី"
        },
        {
            "barcode": "171140515",
            "dpc": "03010346901",
            "name": "លន់ ហ៊ិន"
        },
        {
            "barcode": "171140516",
            "dpc": "03010347001",
            "name": "ខាត់ ជុន"
        },
        {
            "barcode": "171140517",
            "dpc": "03010347101",
            "name": "យន់ រ៉ាវី"
        },
        {
            "barcode": "171140518",
            "dpc": "03010347401",
            "name": "ប៉ាវ ចាន់ដារ៉ា"
        },
        {
            "barcode": "171140519",
            "dpc": "03010339601",
            "name": "គឹម ភិគុណ"
        },
        {
            "barcode": "171140520",
            "dpc": "03010339701",
            "name": "នន់ នៅ"
        },
        {
            "barcode": "171140521",
            "dpc": "03010339801",
            "name": "ហេង សុផាត"
        },
        {
            "barcode": "171140522",
            "dpc": "03010340001",
            "name": "ឃឹម សាវុធ"
        },
        {
            "barcode": "171140523",
            "dpc": "03010339901",
            "name": "ទិត និត"
        },
        {
            "barcode": "171140524",
            "dpc": "03010340101",
            "name": "យ៉ាន ធី"
        },
        {
            "barcode": "171140525",
            "dpc": "03010340201",
            "name": "ជា ណាវី"
        },
        {
            "barcode": "171140526",
            "dpc": "03010340301",
            "name": "ឈួន សំណាង"
        },
        {
            "barcode": "171140527",
            "dpc": "03010340501",
            "name": "ស៊ីម ហុង"
        },
        {
            "barcode": "171140528",
            "dpc": "03010340701",
            "name": "ឡាយ សារ៉ុង"
        },
        {
            "barcode": "171140529",
            "dpc": "03010340601",
            "name": "ចាយ សំណាង"
        },
        {
            "barcode": "171140530",
            "dpc": "03010340801",
            "name": "ភេង សាធី"
        },
        {
            "barcode": "171140531",
            "dpc": "03010340901",
            "name": "ចាន់ វណ្ណៈ"
        },
        {
            "barcode": "171140532",
            "dpc": "03010341001",
            "name": "ប៉ែន តាន់"
        },
        {
            "barcode": "171140533",
            "dpc": "03010341101",
            "name": "ម៉ាន់ សូនី"
        },
        {
            "barcode": "171140534",
            "dpc": "03010341201",
            "name": "គឹម ចាន់"
        },
        {
            "barcode": "171140535",
            "dpc": "03010341301",
            "name": "អ៊ុល កញ្ញា"
        },
        {
            "barcode": "171140536",
            "dpc": "03010341501",
            "name": "ញ៉ូ សាអ៊ីម"
        },
        {
            "barcode": "171140537",
            "dpc": "03010341601",
            "name": "ញ៉ូ សុផារី"
        },
        {
            "barcode": "171140538",
            "dpc": "03010341701",
            "name": "កែវ ឡុង"
        },
        {
            "barcode": "171140539",
            "dpc": "03010341801",
            "name": "ម៉ាត់ យើ"
        },
        {
            "barcode": "171140540",
            "dpc": "03010341901",
            "name": "ម៉ាត់ លះ"
        },
        {
            "barcode": "171140541",
            "dpc": "03010342001",
            "name": "ម៉ាត់ យ៉ាន"
        },
        {
            "barcode": "171140542",
            "dpc": "03010346701",
            "name": "រី ចាន់ដូ"
        },
        {
            "barcode": "171140543",
            "dpc": "03010347201",
            "name": "ហ៊ីម សុភាព"
        },
        {
            "barcode": "171140544",
            "dpc": "03010347301",
            "name": "ចាប សារី"
        },
        {
            "barcode": "171140545",
            "dpc": "03010347501",
            "name": "ឃ្លាំង សូគីម៉ិច"
        },
        {
            "barcode": "171140546",
            "dpc": "03010347601",
            "name": "នង ប៉ុនធឿន"
        },
        {
            "barcode": "171140547",
            "dpc": "03010347701",
            "name": "ហេង ចាន់ថាវី"
        },
        {
            "barcode": "171140548",
            "dpc": "03010347801",
            "name": "សំ គឹមហ៊ុន"
        },
        {
            "barcode": "171140549",
            "dpc": "03010347901",
            "name": "ឃឿ យូលី"
        },
        {
            "barcode": "171140550",
            "dpc": "03010302601",
            "name": "ឡាយ  ជាង"
        },
        {
            "barcode": "171140551",
            "dpc": "03010305101",
            "name": "តាន់ បូរ៉ាវណ្ណ"
        },
        {
            "barcode": "171140552",
            "dpc": "03010310301",
            "name": "ហុង  សុវណ្ណ"
        },
        {
            "barcode": "171140553",
            "dpc": "03010312201",
            "name": "ស វ៉ាន់ណារ៉េត"
        },
        {
            "barcode": "171140554",
            "dpc": "03010300101",
            "name": "គង់  យិន"
        },
        {
            "barcode": "171140555",
            "dpc": "03010300201",
            "name": "គង់  ហាច"
        },
        {
            "barcode": "171140556",
            "dpc": "03010300301",
            "name": "លួង  ខន"
        },
        {
            "barcode": "171140557",
            "dpc": "03010300601",
            "name": "ប៉ិច  គឹមលី"
        },
        {
            "barcode": "171140558",
            "dpc": "03010300701",
            "name": "សៅ  រិន្ទ"
        },
        {
            "barcode": "171140559",
            "dpc": "03010300901",
            "name": "លី  សំណាង"
        },
        {
            "barcode": "171140560",
            "dpc": "03010301001",
            "name": "ស៊ីម  សាវុន"
        },
        {
            "barcode": "171140561",
            "dpc": "03010301101",
            "name": "ជា ខេមរិន"
        },
        {
            "barcode": "171140562",
            "dpc": "03010301201",
            "name": "ពក  សម្បត្តិ"
        },
        {
            "barcode": "171140563",
            "dpc": "03010301301",
            "name": "សៅ  ប៊ុនសុង"
        },
        {
            "barcode": "171140564",
            "dpc": "03010301401",
            "name": "ងឹម ខេមរិទ្ធ"
        },
        {
            "barcode": "171140565",
            "dpc": "03010301501",
            "name": "ស៊ូ  គឹមហេង"
        },
        {
            "barcode": "171140566",
            "dpc": "03010301601",
            "name": "លឹម គឹមលាង"
        },
        {
            "barcode": "171140567",
            "dpc": "03010301701",
            "name": "ស៊ីន ពៅចិន្តា"
        },
        {
            "barcode": "171140568",
            "dpc": "03010301801",
            "name": "យិន លិននិន"
        },
        {
            "barcode": "171140569",
            "dpc": "03010301901",
            "name": "ឆាំ សោនីរដ្ឋ"
        },
        {
            "barcode": "171140570",
            "dpc": "03010302101",
            "name": "រុំ  រ៉េត"
        },
        {
            "barcode": "171140571",
            "dpc": "03010348001",
            "name": "ភួង សារុំ"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
