let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171142746",
            "dpc": "03010408401",
            "name": "អ៊ូ រ៉ាវុធ"
        },
        {
            "barcode": "171142747",
            "dpc": "03010400101",
            "name": "ហ៊ាង ញ៉េប"
        },
        {
            "barcode": "171142748",
            "dpc": "03010400201",
            "name": "ជា តិច"
        },
        {
            "barcode": "171142749",
            "dpc": "03010400301",
            "name": "លឹម គង់"
        },
        {
            "barcode": "171142750",
            "dpc": "03010400401",
            "name": "អ៊ីវ ឃួយ"
        },
        {
            "barcode": "171142751",
            "dpc": "03010400501",
            "name": "ហង ហួម"
        },
        {
            "barcode": "171142752",
            "dpc": "03010430101",
            "name": "លី សេង"
        },
        {
            "barcode": "171142753",
            "dpc": "03010400601",
            "name": "យូ សុភាព"
        },
        {
            "barcode": "171142754",
            "dpc": "03010400701",
            "name": "នុត ហឿម"
        },
        {
            "barcode": "171142755",
            "dpc": "03010400801",
            "name": "សោម សារឿន"
        },
        {
            "barcode": "171142756",
            "dpc": "03010401001",
            "name": "សេង ហេង"
        },
        {
            "barcode": "171142757",
            "dpc": "03010401101",
            "name": "វ៉ាន់ លាភ"
        },
        {
            "barcode": "171142758",
            "dpc": "03010403201",
            "name": "ស៊ុន សន"
        },
        {
            "barcode": "171142759",
            "dpc": "03010403401",
            "name": "ហ៊ុន ចេង"
        },
        {
            "barcode": "171142760",
            "dpc": "03010403501",
            "name": "ប៉ះ រីម"
        },
        {
            "barcode": "171142761",
            "dpc": "03010403701",
            "name": "ជួម ជឿម"
        },
        {
            "barcode": "171142762",
            "dpc": "03010403801",
            "name": "ស៊ុន ទូច"
        },
        {
            "barcode": "171142763",
            "dpc": "03010403601",
            "name": "នង វួចហេង"
        },
        {
            "barcode": "171142764",
            "dpc": "03010403901",
            "name": "ចាន សារ៉េន"
        },
        {
            "barcode": "171142765",
            "dpc": "03010404001",
            "name": "សុខ គឹមហ៊ាង"
        },
        {
            "barcode": "171142766",
            "dpc": "03010404101",
            "name": "អៀង សារិទ្ធ"
        },
        {
            "barcode": "171142767",
            "dpc": "03010404301",
            "name": "ជិញ ស៊ីវប៉ី"
        },
        {
            "barcode": "171142768",
            "dpc": "03010404401",
            "name": "កែវ ស៊ីថា"
        },
        {
            "barcode": "171142769",
            "dpc": "03010419801",
            "name": "ទន់ ម៉ក់"
        },
        {
            "barcode": "171142770",
            "dpc": "03010419901",
            "name": "សាន វណ្ណា"
        },
        {
            "barcode": "171142771",
            "dpc": "03010420001",
            "name": "យាយ គី"
        },
        {
            "barcode": "171142772",
            "dpc": "03010420101",
            "name": "គង់ រិន"
        },
        {
            "barcode": "171142773",
            "dpc": "03010420201",
            "name": "អ៊ុំ ណារ៉ាន់"
        },
        {
            "barcode": "171142774",
            "dpc": "03010420301",
            "name": "ទៀង យន"
        },
        {
            "barcode": "171142775",
            "dpc": "03010420401",
            "name": "រឿន រ៉េត"
        },
        {
            "barcode": "171142776",
            "dpc": "03010420501",
            "name": "អែប ប៊ុនថា"
        },
        {
            "barcode": "171142777",
            "dpc": "03010420601",
            "name": "គឹម ហ៊ាង"
        },
        {
            "barcode": "171142778",
            "dpc": "03010420701",
            "name": "សុខ សារឿន"
        },
        {
            "barcode": "171142779",
            "dpc": "03010420901",
            "name": "អ៊ុំ កេន"
        },
        {
            "barcode": "171142780",
            "dpc": "03010421001",
            "name": "ហៅ សៀង"
        },
        {
            "barcode": "171142781",
            "dpc": "03010421101",
            "name": "នេត មុំ"
        },
        {
            "barcode": "171142782",
            "dpc": "03010421201",
            "name": "រឿន កើ"
        },
        {
            "barcode": "171142783",
            "dpc": "03010421301",
            "name": "សៅ គឹមរ៉ាន់"
        },
        {
            "barcode": "171142784",
            "dpc": "03010421401",
            "name": "ហង់ វាសនា"
        },
        {
            "barcode": "171142785",
            "dpc": "03010421501",
            "name": "អៀម ផល្លី"
        },
        {
            "barcode": "171142786",
            "dpc": "03010421601",
            "name": "សោម ស៊ីថា"
        },
        {
            "barcode": "171142787",
            "dpc": "03010421701",
            "name": "ណុង ចាន់ថន"
        },
        {
            "barcode": "171142788",
            "dpc": "03010421801",
            "name": "ឆេង សារិន"
        },
        {
            "barcode": "171142789",
            "dpc": "03010421901",
            "name": "ញាណ ផន"
        },
        {
            "barcode": "171142790",
            "dpc": "03010422001",
            "name": "ឃុន  សេង"
        },
        {
            "barcode": "171142791",
            "dpc": "03010422101",
            "name": "ស៊ីម ចាន់ថន"
        },
        {
            "barcode": "171142792",
            "dpc": "03010422201",
            "name": "សុខ សារ៉ូ"
        },
        {
            "barcode": "171142793",
            "dpc": "03010422301",
            "name": "ទូច មុនីរ័ត្ន"
        },
        {
            "barcode": "171142794",
            "dpc": "03010422701",
            "name": "នៅ ហាច"
        },
        {
            "barcode": "171142795",
            "dpc": "03010422801",
            "name": "ហាន់ វណ្ណ"
        },
        {
            "barcode": "171142796",
            "dpc": "03010423101",
            "name": "ស៊ី រឿន"
        },
        {
            "barcode": "171142797",
            "dpc": "03010423201",
            "name": "ឡៅ សុខហ៊ុន"
        },
        {
            "barcode": "171142798",
            "dpc": "03010423401",
            "name": "ទន់ ទូច"
        },
        {
            "barcode": "171142799",
            "dpc": "03010423501",
            "name": "ចាន់ ពលិន"
        },
        {
            "barcode": "171142800",
            "dpc": "03010423601",
            "name": "ទុំ សុវណ្ណនី"
        },
        {
            "barcode": "171142801",
            "dpc": "03010423801",
            "name": "សាំង វីរៈ"
        },
        {
            "barcode": "171142802",
            "dpc": "03010423901",
            "name": "យូ ពិសី"
        },
        {
            "barcode": "171142803",
            "dpc": "03010424001",
            "name": "សាង ម៉ៅ"
        },
        {
            "barcode": "171142804",
            "dpc": "03010424101",
            "name": "ភឹង ភឿន"
        },
        {
            "barcode": "171142805",
            "dpc": "03010424201",
            "name": "និន គឹមសាន្ត"
        },
        {
            "barcode": "171142806",
            "dpc": "03010424301",
            "name": "ព្រំ ភុំ"
        },
        {
            "barcode": "171142807",
            "dpc": "03010424401",
            "name": "ចាន់ ធូ"
        },
        {
            "barcode": "171142808",
            "dpc": "03010424501",
            "name": "សុខ ថុង"
        },
        {
            "barcode": "171142809",
            "dpc": "03010424601",
            "name": "សេង ឌី"
        },
        {
            "barcode": "171142810",
            "dpc": "03010424701",
            "name": "ជិន គង់"
        },
        {
            "barcode": "171142811",
            "dpc": "03010424801",
            "name": "សាយ មុំ"
        },
        {
            "barcode": "171142812",
            "dpc": "03010425001",
            "name": "រស សុគន្ធ"
        },
        {
            "barcode": "171142813",
            "dpc": "03010425101",
            "name": "ប៊ុន ហេង"
        },
        {
            "barcode": "171142814",
            "dpc": "03010425201",
            "name": "សុខ ថេន"
        },
        {
            "barcode": "171142815",
            "dpc": "03010425301",
            "name": "តាំង គឹមឆេង"
        },
        {
            "barcode": "171142816",
            "dpc": "03010425401",
            "name": "កង ហៃ"
        },
        {
            "barcode": "171142817",
            "dpc": "03010425601",
            "name": "មិន ហុក"
        },
        {
            "barcode": "171142818",
            "dpc": "03010425701",
            "name": "ជិន ជា"
        },
        {
            "barcode": "171142819",
            "dpc": "03010425801",
            "name": "សួ គឹមសួ"
        },
        {
            "barcode": "171142820",
            "dpc": "03010425901",
            "name": "កាំង សួយងី"
        },
        {
            "barcode": "171142821",
            "dpc": "03010426001",
            "name": "សន ភាព"
        },
        {
            "barcode": "171142822",
            "dpc": "03010426101",
            "name": "យូ ពិសី ២"
        },
        {
            "barcode": "171142823",
            "dpc": "03010426501",
            "name": "ភី សី"
        },
        {
            "barcode": "171142824",
            "dpc": "03010426601",
            "name": "ម៉េង ឡូញ"
        },
        {
            "barcode": "171142825",
            "dpc": "03010426701",
            "name": "ជា សុខហេង"
        },
        {
            "barcode": "171142826",
            "dpc": "03010426801",
            "name": "មាស កាយ"
        },
        {
            "barcode": "171142827",
            "dpc": "03010426901",
            "name": "ស៊ីវ សាន់"
        },
        {
            "barcode": "171142828",
            "dpc": "03010427001",
            "name": "យឹម គឹមលី"
        },
        {
            "barcode": "171142829",
            "dpc": "03010427301",
            "name": "ឃួន គន្ធា"
        },
        {
            "barcode": "171142830",
            "dpc": "03010427101",
            "name": "បៀន ជី"
        },
        {
            "barcode": "171142831",
            "dpc": "03010427201",
            "name": "វែន គីប"
        },
        {
            "barcode": "171142832",
            "dpc": "03010427401",
            "name": "លីម  ណង"
        },
        {
            "barcode": "171142833",
            "dpc": "03010427701",
            "name": "រី សារ័ត្ន"
        },
        {
            "barcode": "171142834",
            "dpc": "03010428601",
            "name": "ខេង ឃាង"
        },
        {
            "barcode": "171142835",
            "dpc": "03010428201",
            "name": "លុន លីទី"
        },
        {
            "barcode": "171142836",
            "dpc": "03010428301",
            "name": "សោម ចាន់ថុល"
        },
        {
            "barcode": "171142837",
            "dpc": "03010428401",
            "name": "កូវ ជឺងប៊ុង"
        },
        {
            "barcode": "171142838",
            "dpc": "03010428501",
            "name": "ឯក លាង"
        },
        {
            "barcode": "171142839",
            "dpc": "03010428101",
            "name": "លឹម វណ្ណារ៉ា"
        },
        {
            "barcode": "171142840",
            "dpc": "03010428001",
            "name": "សោម សុវណ្ណ"
        },
        {
            "barcode": "171142841",
            "dpc": "03010428701",
            "name": "ជា ប៊ុនលាង"
        },
        {
            "barcode": "171142842",
            "dpc": "03010428801",
            "name": "សុក គឹមសួ"
        },
        {
            "barcode": "171142843",
            "dpc": "03010427801",
            "name": "អ៊ុល ស៊ុត"
        },
        {
            "barcode": "171142844",
            "dpc": "03010428901",
            "name": "រស់ សូគាំ"
        },
        {
            "barcode": "171142845",
            "dpc": "03010429001",
            "name": "ចែ ធី"
        },
        {
            "barcode": "171142846",
            "dpc": "03010429101",
            "name": "មាស រីយ៉ា"
        },
        {
            "barcode": "171142847",
            "dpc": "03010429201",
            "name": "ជា ពៅ"
        },
        {
            "barcode": "171142848",
            "dpc": "03010429301",
            "name": "នួន គឹមឡេង"
        },
        {
            "barcode": "171142849",
            "dpc": "03010429401",
            "name": "ហ៊ីម ប៊ុនថន"
        },
        {
            "barcode": "171142850",
            "dpc": "03010429501",
            "name": "លន់ វ៉ង់"
        },
        {
            "barcode": "171142851",
            "dpc": "03010429601",
            "name": "ឆាន់ ចំរើន"
        },
        {
            "barcode": "171142852",
            "dpc": "03010429701",
            "name": "ឃុត វណ្ណៈ"
        },
        {
            "barcode": "171142853",
            "dpc": "03010429801",
            "name": "ដូរ សារី"
        },
        {
            "barcode": "171142854",
            "dpc": "03010429901",
            "name": "គឹម សំណាង"
        },
        {
            "barcode": "171142855",
            "dpc": "03010430001",
            "name": "គង ឡុក"
        },
        {
            "barcode": "171142856",
            "dpc": "03010430201",
            "name": "មាស ធី"
        },
        {
            "barcode": "171142857",
            "dpc": "03010430301",
            "name": "លី លិន"
        },
        {
            "barcode": "171142858",
            "dpc": "03010430401",
            "name": "ប៉ាង វណ្ណនី"
        },
        {
            "barcode": "171142859",
            "dpc": "03010430501",
            "name": "ចៅ យ៉ាន"
        },
        {
            "barcode": "171142860",
            "dpc": "03010430601",
            "name": "ចន្ធូ"
        },
        {
            "barcode": "171142861",
            "dpc": "03010430701",
            "name": "ទឹត្យ សាវុន"
        },
        {
            "barcode": "171142862",
            "dpc": "03010430801",
            "name": "លី ម៉េង"
        },
        {
            "barcode": "171142863",
            "dpc": "03010430901",
            "name": "ហឺ ដាវី"
        },
        {
            "barcode": "171142864",
            "dpc": "03010431001",
            "name": "ស៊ាន យ៉ុង"
        },
        {
            "barcode": "171142865",
            "dpc": "03010431101",
            "name": "ឈុន ឈីន"
        },
        {
            "barcode": "171142866",
            "dpc": "03010431201",
            "name": "កែវ សុភាព"
        },
        {
            "barcode": "171142867",
            "dpc": "03010422901",
            "name": "ច្រែង សុចន"
        },
        {
            "barcode": "171142868",
            "dpc": "03010423001",
            "name": "ជឹម ចន"
        },
        {
            "barcode": "171142869",
            "dpc": "03010418401",
            "name": "សាំង ចំរើន"
        },
        {
            "barcode": "171142870",
            "dpc": "03010418301",
            "name": "តាំង ប៊ូហេង"
        },
        {
            "barcode": "171142871",
            "dpc": "03010418201",
            "name": "សុ ដានី"
        },
        {
            "barcode": "171142872",
            "dpc": "03010418001",
            "name": "ទិត សារឿន"
        },
        {
            "barcode": "171142873",
            "dpc": "03010417901",
            "name": "មាស ស៊ីណា"
        },
        {
            "barcode": "171142874",
            "dpc": "03010417801",
            "name": "គា អាន"
        },
        {
            "barcode": "171142875",
            "dpc": "03010417701",
            "name": "ហុក សៀង"
        },
        {
            "barcode": "171142876",
            "dpc": "03010417601",
            "name": "សុខ ជា"
        },
        {
            "barcode": "171142877",
            "dpc": "03010405801",
            "name": "ហុង ផានឿន"
        },
        {
            "barcode": "171142878",
            "dpc": "03010405701",
            "name": "គង់ ប៊ូ"
        },
        {
            "barcode": "171142879",
            "dpc": "03010405601",
            "name": "គង់ ហឿន"
        },
        {
            "barcode": "171142880",
            "dpc": "03010405501",
            "name": "ឃុត សំអ៊ុល"
        },
        {
            "barcode": "171142881",
            "dpc": "03010405401",
            "name": "តឹង ហ៊ុយយ៉ាង"
        },
        {
            "barcode": "171142882",
            "dpc": "03010405301",
            "name": "ស៊ី ពិសិទ្ធ"
        },
        {
            "barcode": "171142883",
            "dpc": "03010405001",
            "name": "ដួង ត្រា"
        },
        {
            "barcode": "171142884",
            "dpc": "03010404901",
            "name": "ឡៅ លុន"
        },
        {
            "barcode": "171142885",
            "dpc": "03010404701",
            "name": "ហាង ឃាង"
        },
        {
            "barcode": "171142886",
            "dpc": "03010404601",
            "name": "ហ៊ីង ជុំ"
        },
        {
            "barcode": "171142887",
            "dpc": "03010404501",
            "name": "ចូត ហាយ"
        },
        {
            "barcode": "171142888",
            "dpc": "03010419601",
            "name": "ឆាយ យ៉ុន"
        },
        {
            "barcode": "171142889",
            "dpc": "03010419501",
            "name": "ឡុង ឆុន"
        },
        {
            "barcode": "171142890",
            "dpc": "03010419401",
            "name": "យឹម សុផាន់"
        },
        {
            "barcode": "171142891",
            "dpc": "03010419301",
            "name": "តាំង ធីទៀក"
        },
        {
            "barcode": "171142892",
            "dpc": "03010419201",
            "name": "គួច លាភ"
        },
        {
            "barcode": "171142893",
            "dpc": "03010419101",
            "name": "ខាន់ វណ្ណៈ"
        },
        {
            "barcode": "171142894",
            "dpc": "03010419001",
            "name": "គឹម ដារ៉ា"
        },
        {
            "barcode": "171142895",
            "dpc": "03010418801",
            "name": "សោម ម៉េង"
        },
        {
            "barcode": "171142896",
            "dpc": "03010418701",
            "name": "ពេជ្រ សុវណ្ណ"
        },
        {
            "barcode": "171142897",
            "dpc": "03010418601",
            "name": "ប៊ូ នងសាវិន"
        },
        {
            "barcode": "171142898",
            "dpc": "03010418501",
            "name": "យ៉ម ចំរើន ៦"
        },
        {
            "barcode": "171142899",
            "dpc": "03010416901",
            "name": "តាំង តិចហួរ"
        },
        {
            "barcode": "171142900",
            "dpc": "03010416801",
            "name": "មួយ ហៀក"
        },
        {
            "barcode": "171142901",
            "dpc": "03010416701",
            "name": "គឹម ហួយ"
        },
        {
            "barcode": "171142902",
            "dpc": "03010416601",
            "name": "ស៊ីវ គីមឡេង"
        },
        {
            "barcode": "171142903",
            "dpc": "03010416501",
            "name": "សាង ប្រសើរ"
        },
        {
            "barcode": "171142904",
            "dpc": "03010416401",
            "name": "ពេញ បាំង"
        },
        {
            "barcode": "171142905",
            "dpc": "03010416301",
            "name": "ងួន ត្រាយ"
        },
        {
            "barcode": "171142906",
            "dpc": "03010416201",
            "name": "ទ្រី ហួរ"
        },
        {
            "barcode": "171142907",
            "dpc": "03010416101",
            "name": "គីវ គឹមផា"
        },
        {
            "barcode": "171142908",
            "dpc": "03010416001",
            "name": "ប៊ូច វឌ្ឍនា"
        },
        {
            "barcode": "171142909",
            "dpc": "03010415901",
            "name": "ជា ម៉េង"
        },
        {
            "barcode": "171142910",
            "dpc": "03010415801",
            "name": "ទ្រព្យ ជន"
        },
        {
            "barcode": "171142911",
            "dpc": "03010415701",
            "name": "ថៃ ណាវឿន"
        },
        {
            "barcode": "171142912",
            "dpc": "03010415601",
            "name": "ថៃ ប្រុសលាភ"
        },
        {
            "barcode": "171142913",
            "dpc": "03010415501",
            "name": "ជីវ សោភ័ណ្ឌ"
        },
        {
            "barcode": "171142914",
            "dpc": "03010415401",
            "name": "ប៊ុន ឃាម"
        },
        {
            "barcode": "171142915",
            "dpc": "03010415301",
            "name": "អួង ចេង"
        },
        {
            "barcode": "171142916",
            "dpc": "03010415201",
            "name": "អ៊ឹង អេងម៉េង"
        },
        {
            "barcode": "171142917",
            "dpc": "03010415101",
            "name": "ប៊ូច សុងហេង"
        },
        {
            "barcode": "171142918",
            "dpc": "03010415001",
            "name": "ហ្វាន់ ទី២"
        },
        {
            "barcode": "171142919",
            "dpc": "03010414901",
            "name": "យី ប៊ុនខន"
        },
        {
            "barcode": "171142920",
            "dpc": "03010414801",
            "name": "នក់ ហ្វួយ"
        },
        {
            "barcode": "171142921",
            "dpc": "03010414701",
            "name": "លាវ សុខទាវ"
        },
        {
            "barcode": "171142922",
            "dpc": "03010414501",
            "name": "ជា ចន្នី"
        },
        {
            "barcode": "171142923",
            "dpc": "03010414401",
            "name": "លាង ហួត"
        },
        {
            "barcode": "171142924",
            "dpc": "03010414301",
            "name": "ហេង ភិរម្យ"
        },
        {
            "barcode": "171142925",
            "dpc": "03010414201",
            "name": "សុខ សុចិត្ត"
        },
        {
            "barcode": "171142926",
            "dpc": "03010414101",
            "name": "វិន គឹមហួយ"
        },
        {
            "barcode": "171142927",
            "dpc": "03010408101",
            "name": "ម៉ែន តិចហេង"
        },
        {
            "barcode": "171142928",
            "dpc": "03010408001",
            "name": "ស៊ូ ហេង"
        },
        {
            "barcode": "171142929",
            "dpc": "03010407901",
            "name": "តែ ណារ៉ុង"
        },
        {
            "barcode": "171142930",
            "dpc": "03010407801",
            "name": "ហាក ឆៃលាង"
        },
        {
            "barcode": "171142931",
            "dpc": "03010407701",
            "name": "ឈឿប ឆៃ"
        },
        {
            "barcode": "171142932",
            "dpc": "03010407601",
            "name": "ចែ ម៉ៅ ១"
        },
        {
            "barcode": "171142933",
            "dpc": "03010407401",
            "name": "សុង ប៊ូយ"
        },
        {
            "barcode": "171142934",
            "dpc": "03010407301",
            "name": "ជា សំណាង ២"
        },
        {
            "barcode": "171142935",
            "dpc": "03010407201",
            "name": "ជា សំណាង ១"
        },
        {
            "barcode": "171142936",
            "dpc": "03010407101",
            "name": "ពុធ យ៉ាត"
        },
        {
            "barcode": "171142937",
            "dpc": "03010407001",
            "name": "ឃឹម សុផល"
        },
        {
            "barcode": "171142938",
            "dpc": "03010406901",
            "name": "តូ ផ"
        },
        {
            "barcode": "171142939",
            "dpc": "03010406801",
            "name": "អ៊ិន សុផាត"
        },
        {
            "barcode": "171142940",
            "dpc": "03010406701",
            "name": "ជា ជ"
        },
        {
            "barcode": "171142941",
            "dpc": "03010406601",
            "name": "ភោគ ផល្លា"
        },
        {
            "barcode": "171142942",
            "dpc": "03010406501",
            "name": "ងួន ប៉ូយ"
        },
        {
            "barcode": "171142943",
            "dpc": "03010406401",
            "name": "សៀក យឿន"
        },
        {
            "barcode": "171142944",
            "dpc": "03010406301",
            "name": "លឹម វេង"
        },
        {
            "barcode": "171142945",
            "dpc": "03010406201",
            "name": "លី ហ៊ួន"
        },
        {
            "barcode": "171142946",
            "dpc": "03010406101",
            "name": "ហុង ប៊ុនឡេង"
        },
        {
            "barcode": "171142947",
            "dpc": "03010406001",
            "name": "ចេង អឿន"
        },
        {
            "barcode": "171142948",
            "dpc": "03010405901",
            "name": "ឆាន់ វ៉ាន់លឿត"
        },
        {
            "barcode": "171142949",
            "dpc": "03010417501",
            "name": "ម៉ី សីហៈ"
        },
        {
            "barcode": "171142950",
            "dpc": "03010417401",
            "name": "ខៀវ ជំនិត"
        },
        {
            "barcode": "171142951",
            "dpc": "03010404801",
            "name": "អ៊ាង ប៊ុនហូរ"
        },
        {
            "barcode": "171142952",
            "dpc": "03010417201",
            "name": "អ៊ុន សវណ្ណារ៉ា"
        },
        {
            "barcode": "171142953",
            "dpc": "03010417101",
            "name": "សៀ សម្បត្តិ"
        },
        {
            "barcode": "171142954",
            "dpc": "03010417001",
            "name": "លឹម ងិន"
        },
        {
            "barcode": "171142955",
            "dpc": "03010403101",
            "name": "ទីវ ណារ័ត្ន"
        },
        {
            "barcode": "171142956",
            "dpc": "03010403001",
            "name": "ភឹម អូន"
        },
        {
            "barcode": "171142957",
            "dpc": "03010402901",
            "name": "គាត ផេង"
        },
        {
            "barcode": "171142958",
            "dpc": "03010402801",
            "name": "គឹម វន្ថា"
        },
        {
            "barcode": "171142959",
            "dpc": "03010402701",
            "name": "តាំង ហេង"
        },
        {
            "barcode": "171142960",
            "dpc": "03010402601",
            "name": "តាំង ឆេង"
        },
        {
            "barcode": "171142961",
            "dpc": "03010402501",
            "name": "សៀប ប៊ុនរ៉ុង"
        },
        {
            "barcode": "171142962",
            "dpc": "03010402401",
            "name": "ម៉ៅ ដារ៉ាវិឆ័យ"
        },
        {
            "barcode": "171142963",
            "dpc": "03010402301",
            "name": "ញ៉ែម ស៊ីថា"
        },
        {
            "barcode": "171142964",
            "dpc": "03010402201",
            "name": "ម៉ាន់ គា"
        },
        {
            "barcode": "171142965",
            "dpc": "03010402101",
            "name": "សេង នឿត"
        },
        {
            "barcode": "171142966",
            "dpc": "03010402001",
            "name": "សូ កូរីតា"
        },
        {
            "barcode": "171142967",
            "dpc": "03010401901",
            "name": "តាយ ស៊ុយហុង"
        },
        {
            "barcode": "171142968",
            "dpc": "03010401801",
            "name": "អឿន ជឿប"
        },
        {
            "barcode": "171142969",
            "dpc": "03010401701",
            "name": "បាន វណ្ណា"
        },
        {
            "barcode": "171142970",
            "dpc": "03010401601",
            "name": "ទូច រ៉ា"
        },
        {
            "barcode": "171142971",
            "dpc": "03010401501",
            "name": "ហង ស៊ីយឿន"
        },
        {
            "barcode": "171142972",
            "dpc": "03010401401",
            "name": "យិន ម៉ានិត"
        },
        {
            "barcode": "171142973",
            "dpc": "03010401301",
            "name": "ពុយ ហួង"
        },
        {
            "barcode": "171142974",
            "dpc": "03010401201",
            "name": "ហុង សុផាត"
        },
        {
            "barcode": "171142975",
            "dpc": "03010414001",
            "name": "ពឹង ហ៊ុយលាង"
        },
        {
            "barcode": "171142976",
            "dpc": "03010413901",
            "name": "ចាន់ សុង"
        },
        {
            "barcode": "171142977",
            "dpc": "03010423301",
            "name": "លឹម ចិន្តា"
        },
        {
            "barcode": "171142978",
            "dpc": "03010413801",
            "name": "លឹម ជៀត"
        },
        {
            "barcode": "171142979",
            "dpc": "03010413701",
            "name": "ប៊ួន ចន្ធី"
        },
        {
            "barcode": "171142980",
            "dpc": "03010413601",
            "name": "ប៊ុន លាង"
        },
        {
            "barcode": "171142981",
            "dpc": "03010413401",
            "name": "ជៀវ សៀម"
        },
        {
            "barcode": "171142982",
            "dpc": "03010409201",
            "name": "តាន់ សុខ"
        },
        {
            "barcode": "171142983",
            "dpc": "03010413301",
            "name": "ប្រាក់ ឆៃត្រី"
        },
        {
            "barcode": "171142984",
            "dpc": "03010413201",
            "name": "ហ្វាន់ ទី1"
        },
        {
            "barcode": "171142985",
            "dpc": "03010413001",
            "name": "ជា ភិចជីង"
        },
        {
            "barcode": "171142986",
            "dpc": "03010412901",
            "name": "ជា ដារិទ្ធ"
        },
        {
            "barcode": "171142987",
            "dpc": "03010412801",
            "name": "ហុក ហួរ"
        },
        {
            "barcode": "171142988",
            "dpc": "03010412701",
            "name": "លឹម ដា"
        },
        {
            "barcode": "171142989",
            "dpc": "03010412601",
            "name": "ឆេង ហាក់"
        },
        {
            "barcode": "171142990",
            "dpc": "03010412501",
            "name": "សេង សំអុល"
        },
        {
            "barcode": "171142991",
            "dpc": "03010412401",
            "name": "ឡៃ សេង"
        },
        {
            "barcode": "171142992",
            "dpc": "03010412301",
            "name": "តឹង ហ៊ុយលាង"
        },
        {
            "barcode": "171142993",
            "dpc": "03010412201",
            "name": "សុខ ហួត"
        },
        {
            "barcode": "171142994",
            "dpc": "03010412101",
            "name": "ផេង សុខហេង"
        },
        {
            "barcode": "171142995",
            "dpc": "03010412001",
            "name": "ធឿន ធួក"
        },
        {
            "barcode": "171142996",
            "dpc": "03010411901",
            "name": "ចាន់ វណ្ណា"
        },
        {
            "barcode": "171142997",
            "dpc": "03010411801",
            "name": "សុខ គាន"
        },
        {
            "barcode": "171142998",
            "dpc": "03010411701",
            "name": "គឹម មួយគា"
        },
        {
            "barcode": "171142999",
            "dpc": "03010411601",
            "name": "គឹម ងីម"
        },
        {
            "barcode": "171143000",
            "dpc": "03010411501",
            "name": "ធុល អន"
        },
        {
            "barcode": "171143001",
            "dpc": "03010411401",
            "name": "វ៉ុន សាវឿត"
        },
        {
            "barcode": "171143002",
            "dpc": "03010425501",
            "name": "លឹម ស៊ុន"
        },
        {
            "barcode": "171143003",
            "dpc": "03010411301",
            "name": "តឹត អេងម៉ៅ"
        },
        {
            "barcode": "171143004",
            "dpc": "03010411201",
            "name": "រស ឆែម"
        },
        {
            "barcode": "171143005",
            "dpc": "03010411101",
            "name": "ហ៊ាង អែម"
        },
        {
            "barcode": "171143006",
            "dpc": "03010410801",
            "name": "តាំង ហួយ"
        },
        {
            "barcode": "171143007",
            "dpc": "03010411001",
            "name": "ប៊ុន ហ៊ាង"
        },
        {
            "barcode": "171143008",
            "dpc": "03010410701",
            "name": "វណ្ណា"
        },
        {
            "barcode": "171143009",
            "dpc": "03010410901",
            "name": "ហៀប ប៉េងស្រ៊ុន"
        },
        {
            "barcode": "171143010",
            "dpc": "03010410601",
            "name": "ចាន់ សុខ"
        },
        {
            "barcode": "171143011",
            "dpc": "03010410501",
            "name": "ហ៊ូរ លឹមហាក់"
        },
        {
            "barcode": "171143012",
            "dpc": "03010410301",
            "name": "នូ ប៊ុន"
        },
        {
            "barcode": "171143013",
            "dpc": "03010410201",
            "name": "សេង សុខឡា"
        },
        {
            "barcode": "171143014",
            "dpc": "03010410101",
            "name": "យី ប៊ុនឃាង"
        },
        {
            "barcode": "171143015",
            "dpc": "03010410001",
            "name": "ខ្លូត សម្បត្តិ"
        },
        {
            "barcode": "171143016",
            "dpc": "03010409901",
            "name": "ស៊ុយ សុភាព"
        },
        {
            "barcode": "171143017",
            "dpc": "03010409701",
            "name": "ពៅ សូផុត"
        },
        {
            "barcode": "171143018",
            "dpc": "03010409601",
            "name": "នក់ ចាន់ហ្វាន់"
        },
        {
            "barcode": "171143019",
            "dpc": "03010409501",
            "name": "នក់ គង់"
        },
        {
            "barcode": "171143020",
            "dpc": "03010409401",
            "name": "អៀង ហ្គិច"
        },
        {
            "barcode": "171143021",
            "dpc": "03010409301",
            "name": "នៅ សុខហឿន"
        },
        {
            "barcode": "171143022",
            "dpc": "03010409101",
            "name": "លឹម ចិន្តា"
        },
        {
            "barcode": "171143023",
            "dpc": "03010408901",
            "name": "ជីម ស្រេង"
        },
        {
            "barcode": "171143024",
            "dpc": "03010408801",
            "name": "សៀវ គឹមឡេង"
        },
        {
            "barcode": "171143025",
            "dpc": "03010408701",
            "name": "ចិកិ ឪ"
        },
        {
            "barcode": "171143026",
            "dpc": "03010408501",
            "name": "អេង ធី"
        },
        {
            "barcode": "171143027",
            "dpc": "03010408301",
            "name": "ហៀង សៅយ៉ុន"
        },
        {
            "barcode": "171143028",
            "dpc": "03010408201",
            "name": "សោម គឹមរ៉ិច"
        },
        {
            "barcode": "171143029",
            "dpc": "03010440301",
            "name": "ទ្រី ជួរ ១"
        },
        {
            "barcode": "171143030",
            "dpc": "03010431301",
            "name": "ប៉ាង ស៊ីណាត"
        },
        {
            "barcode": "171143031",
            "dpc": "03010431401",
            "name": "រ័ត្ន សុវណ្ណ"
        },
        {
            "barcode": "171143032",
            "dpc": "03010431501",
            "name": "ប៉ូ ប៉េងយី"
        },
        {
            "barcode": "171143033",
            "dpc": "03010431601",
            "name": "ញឹម  ជេដ្ឋា"
        },
        {
            "barcode": "171143034",
            "dpc": "03010431701",
            "name": "ជុំ សុវណ្ណ"
        },
        {
            "barcode": "171143035",
            "dpc": "03010431801",
            "name": "សុខ សំអឿន"
        },
        {
            "barcode": "171143036",
            "dpc": "03010431901",
            "name": "ឌុល សោភ័ណ្ឌ"
        },
        {
            "barcode": "171143037",
            "dpc": "03010432001",
            "name": "ហៃ ចន"
        },
        {
            "barcode": "171143038",
            "dpc": "03010432101",
            "name": "អ៊ូ ស្រីវាធ"
        },
        {
            "barcode": "171143039",
            "dpc": "03010432201",
            "name": "លឹម អូន"
        },
        {
            "barcode": "171143040",
            "dpc": "03010432301",
            "name": "ឈួ ហៀង"
        },
        {
            "barcode": "171143041",
            "dpc": "03010432501",
            "name": "វ៉ាន់ ប៉ូ"
        },
        {
            "barcode": "171143042",
            "dpc": "03010432601",
            "name": "កែវ គន្ធា"
        },
        {
            "barcode": "171143043",
            "dpc": "03010432701",
            "name": "សារី ឃុន"
        },
        {
            "barcode": "171143044",
            "dpc": "03010432801",
            "name": "អ៊ូ ចិន្តា"
        },
        {
            "barcode": "171143045",
            "dpc": "03010432901",
            "name": "ចាន់ នាង"
        },
        {
            "barcode": "171143046",
            "dpc": "03010433001",
            "name": "យស់ អ៊ន"
        },
        {
            "barcode": "171143047",
            "dpc": "03010437001",
            "name": "ឃួន ឈឿត"
        },
        {
            "barcode": "171143048",
            "dpc": "03010433101",
            "name": "នៅ រ៉ា"
        },
        {
            "barcode": "171143049",
            "dpc": "03010436801",
            "name": "ប៊យ ហួយ"
        },
        {
            "barcode": "171143050",
            "dpc": "03010433201",
            "name": "គ្រីន ញ៉ុង"
        },
        {
            "barcode": "171143051",
            "dpc": "03010433301",
            "name": "ឃួន  ប៊ុនធី"
        },
        {
            "barcode": "171143052",
            "dpc": "03010433401",
            "name": "គឹម  សៀក"
        },
        {
            "barcode": "171143053",
            "dpc": "03010433501",
            "name": "ទ្រី ហាក់"
        },
        {
            "barcode": "171143054",
            "dpc": "03010433601",
            "name": "តូច ឈួនសៅរិទ្ធ"
        },
        {
            "barcode": "171143055",
            "dpc": "03010433701",
            "name": "ឈួក វី"
        },
        {
            "barcode": "171143056",
            "dpc": "03010433801",
            "name": "ឡាច ឡោ"
        },
        {
            "barcode": "171143057",
            "dpc": "03010433901",
            "name": "មុំ មឿត"
        },
        {
            "barcode": "171143058",
            "dpc": "03010434001",
            "name": "ព្រំ សំណាង"
        },
        {
            "barcode": "171143059",
            "dpc": "03010435701",
            "name": "ប៊ុត គឹមស៊ាន"
        },
        {
            "barcode": "171143060",
            "dpc": "03010434101",
            "name": "ឆេង ហ៊ន"
        },
        {
            "barcode": "171143061",
            "dpc": "03010434201",
            "name": "ស៊ុត ឆំ"
        },
        {
            "barcode": "171143062",
            "dpc": "03010434401",
            "name": "ស្រស់ សារ៉ុម ២"
        },
        {
            "barcode": "171143063",
            "dpc": "03010434501",
            "name": "លី សេង"
        },
        {
            "barcode": "171143064",
            "dpc": "03010434601",
            "name": "ហែម សាវង្ស"
        },
        {
            "barcode": "171143065",
            "dpc": "03010434701",
            "name": "ឡាំ ស្រីងឹម"
        },
        {
            "barcode": "171143066",
            "dpc": "03010434801",
            "name": "មុំ សារ៉ន"
        },
        {
            "barcode": "171143067",
            "dpc": "03010434901",
            "name": "ទូច សម្បត្តិ"
        },
        {
            "barcode": "171143068",
            "dpc": "03010435001",
            "name": "អ៊ូ ម៉ាលី"
        },
        {
            "barcode": "171143069",
            "dpc": "03010435101",
            "name": "វែន ជុន"
        },
        {
            "barcode": "171143070",
            "dpc": "03010435201",
            "name": "អ៊ឹម សឿន"
        },
        {
            "barcode": "171143071",
            "dpc": "03010435301",
            "name": "ម៉ម ញ៉ា"
        },
        {
            "barcode": "171143072",
            "dpc": "03010435401",
            "name": "ប៉ុញ សុវណ្ណរិទ្ធ ១"
        },
        {
            "barcode": "171143073",
            "dpc": "03010435501",
            "name": "ម៉ិញ ហៀប"
        },
        {
            "barcode": "171143074",
            "dpc": "03010435601",
            "name": "ស៊ិន ដា"
        },
        {
            "barcode": "171143075",
            "dpc": "03010435801",
            "name": "យ៉ាង ជួ"
        },
        {
            "barcode": "171143076",
            "dpc": "03010435901",
            "name": "ជីវ គឹមសាន្ត"
        },
        {
            "barcode": "171143077",
            "dpc": "03010436001",
            "name": "ព្រំ ភឿន"
        },
        {
            "barcode": "171143078",
            "dpc": "03010436101",
            "name": "តែ ឡៃហេង"
        },
        {
            "barcode": "171143079",
            "dpc": "03010436201",
            "name": "ជុត ស៊ាងណៃ"
        },
        {
            "barcode": "171143080",
            "dpc": "03010436301",
            "name": "លូត ហ៊ាង"
        },
        {
            "barcode": "171143081",
            "dpc": "03010436401",
            "name": "ចាង យឹងមុយ"
        },
        {
            "barcode": "171143082",
            "dpc": "03010436501",
            "name": "ឡាយ សារ៉ា"
        },
        {
            "barcode": "171143083",
            "dpc": "03010436601",
            "name": "សុខ ហេង១"
        },
        {
            "barcode": "171143084",
            "dpc": "03010436701",
            "name": "ឌិន សាត"
        },
        {
            "barcode": "171143085",
            "dpc": "03010436901",
            "name": "អ៊ិន សុធី"
        },
        {
            "barcode": "171143086",
            "dpc": "03010437101",
            "name": "លឹម ត្រូល"
        },
        {
            "barcode": "171143087",
            "dpc": "03010437201",
            "name": "ឡាំង ញឹក"
        },
        {
            "barcode": "171143088",
            "dpc": "03010437301",
            "name": "សុខ គិន"
        },
        {
            "barcode": "171143089",
            "dpc": "03010437401",
            "name": "ឈៀង រ៉ុង"
        },
        {
            "barcode": "171143090",
            "dpc": "03010437501",
            "name": "ឆៃ វិនឈឿន"
        },
        {
            "barcode": "171143091",
            "dpc": "03010437601",
            "name": "សេង ម៉ារូ"
        },
        {
            "barcode": "171143092",
            "dpc": "03010437701",
            "name": "វ៉ាន់ ថា"
        },
        {
            "barcode": "171143093",
            "dpc": "03010437801",
            "name": "វ៉ាន សុខាក់"
        },
        {
            "barcode": "171143094",
            "dpc": "03010437901",
            "name": "ធឿន ណារ៉េត"
        },
        {
            "barcode": "171143095",
            "dpc": "03010438001",
            "name": "សុខ ហ៊ាង"
        },
        {
            "barcode": "171143096",
            "dpc": "03010438101",
            "name": "ហ៊ុល សេង"
        },
        {
            "barcode": "171143097",
            "dpc": "03010438201",
            "name": "វ័រ ជី"
        },
        {
            "barcode": "171143098",
            "dpc": "03010438301",
            "name": "ទីវ  ហុកហួត"
        },
        {
            "barcode": "171143099",
            "dpc": "03010438401",
            "name": "អ៊ុំ វុទ្ធី"
        },
        {
            "barcode": "171143100",
            "dpc": "03010438501",
            "name": "ម៉ុង អេង"
        },
        {
            "barcode": "171143101",
            "dpc": "03010438601",
            "name": "វង្ស វ៉ា"
        },
        {
            "barcode": "171143102",
            "dpc": "03010438701",
            "name": "ត័ង"
        },
        {
            "barcode": "171143103",
            "dpc": "03010438801",
            "name": "បាន សុភ័ក្រ"
        },
        {
            "barcode": "171143104",
            "dpc": "03010438901",
            "name": "សេង គឹមហូរ"
        },
        {
            "barcode": "171143105",
            "dpc": "03010439001",
            "name": "ជា ផល្លីន"
        },
        {
            "barcode": "171143106",
            "dpc": "03010439101",
            "name": "ធី ឃាង"
        },
        {
            "barcode": "171143107",
            "dpc": "03010439201",
            "name": "កង ហៃ"
        },
        {
            "barcode": "171143108",
            "dpc": "03010439301",
            "name": "ឃុន អេង"
        },
        {
            "barcode": "171143109",
            "dpc": "03010439401",
            "name": "ម៉ឹង ជុយ ១"
        },
        {
            "barcode": "171143110",
            "dpc": "03010439501",
            "name": "ជីវ ខេងណេង"
        },
        {
            "barcode": "171143111",
            "dpc": "03010439601",
            "name": "អេង សុង"
        },
        {
            "barcode": "171143112",
            "dpc": "03010439701",
            "name": "សេង សុខលាង"
        },
        {
            "barcode": "171143113",
            "dpc": "03010439801",
            "name": "ម៉ឹង ជុយ ២"
        },
        {
            "barcode": "171143114",
            "dpc": "03010440001",
            "name": "ស្ងួន រក្សា"
        },
        {
            "barcode": "171143115",
            "dpc": "03010440201",
            "name": "គង់ សុធី"
        },
        {
            "barcode": "171143116",
            "dpc": "03010440401",
            "name": "ស៊ា សម្បត្តិ"
        },
        {
            "barcode": "171143117",
            "dpc": "03010440501",
            "name": "វុទ្ធ ថា"
        },
        {
            "barcode": "171143118",
            "dpc": "03010440601",
            "name": "គា ឈុន"
        },
        {
            "barcode": "171143119",
            "dpc": "03010440701",
            "name": "សេង សុខឡេង"
        },
        {
            "barcode": "171143120",
            "dpc": "03010440801",
            "name": "គឹម ដា"
        },
        {
            "barcode": "171143121",
            "dpc": "03010441001",
            "name": "យ៉ាំ ឡាន់"
        },
        {
            "barcode": "171143122",
            "dpc": "03010441301",
            "name": "ឯក សុវណ្ណ"
        },
        {
            "barcode": "171143123",
            "dpc": "03010441401",
            "name": "វ៉ង វ៉ា២"
        },
        {
            "barcode": "171143124",
            "dpc": "03010441501",
            "name": "ហ្វាត សិញ"
        },
        {
            "barcode": "171143125",
            "dpc": "03010441701",
            "name": "ចៅ ថន"
        },
        {
            "barcode": "171143126",
            "dpc": "03010441801",
            "name": "ឡាក់ បូរ៉េត"
        },
        {
            "barcode": "171143127",
            "dpc": "03010441901",
            "name": "ហុង វ៉ាន់ដេត"
        },
        {
            "barcode": "171143128",
            "dpc": "03010442001",
            "name": "សួស កុក"
        },
        {
            "barcode": "171143129",
            "dpc": "03010442101",
            "name": "សេង ស្រេង"
        },
        {
            "barcode": "171143130",
            "dpc": "03010442201",
            "name": "ហេង ណារិទ្ធ"
        },
        {
            "barcode": "171143131",
            "dpc": "03010442301",
            "name": "លឹម ហេង"
        },
        {
            "barcode": "171143132",
            "dpc": "03010442401",
            "name": "ហាំង គង់"
        },
        {
            "barcode": "171143133",
            "dpc": "03010442501",
            "name": "ពៅ"
        },
        {
            "barcode": "171143134",
            "dpc": "03010442701",
            "name": "ឈុំ ឈឿយ"
        },
        {
            "barcode": "171143135",
            "dpc": "03010442801",
            "name": "ប៉េង ប៊ុនលីម"
        },
        {
            "barcode": "171143136",
            "dpc": "03010442901",
            "name": "កិ សៀក"
        },
        {
            "barcode": "171143137",
            "dpc": "03010443001",
            "name": "ហែម សុធា"
        },
        {
            "barcode": "171143138",
            "dpc": "03010443101",
            "name": "ស៊ូ ហាង"
        },
        {
            "barcode": "171143139",
            "dpc": "03010443201",
            "name": "យឹម សុផល"
        },
        {
            "barcode": "171143140",
            "dpc": "03010443301",
            "name": "យឹម រស់"
        },
        {
            "barcode": "171143141",
            "dpc": "03010443401",
            "name": "លី ហេង"
        },
        {
            "barcode": "171143142",
            "dpc": "03010443501",
            "name": "កក អ៊ីលែន"
        },
        {
            "barcode": "171143143",
            "dpc": "03010443601",
            "name": "ហ៊ុន សុង"
        },
        {
            "barcode": "171143144",
            "dpc": "03010443701",
            "name": "ផ្លែក ប៊ុនស៊ន"
        },
        {
            "barcode": "171143145",
            "dpc": "03010443801",
            "name": "អេង សាមឿន"
        },
        {
            "barcode": "171143146",
            "dpc": "03010443901",
            "name": "ប៊ុន អូន"
        },
        {
            "barcode": "171143147",
            "dpc": "03010444001",
            "name": "ចៅ ឆាយ"
        },
        {
            "barcode": "171143148",
            "dpc": "03010444101",
            "name": "ឆេង បាន"
        },
        {
            "barcode": "171143149",
            "dpc": "03010444201",
            "name": "ហេង សុង"
        },
        {
            "barcode": "171143150",
            "dpc": "03010444301",
            "name": "សុង ហេង ២"
        },
        {
            "barcode": "171143151",
            "dpc": "03010444401",
            "name": "ចៅ ហុង"
        },
        {
            "barcode": "171143152",
            "dpc": "03010444501",
            "name": "នុត ឆៃយ៉ា"
        },
        {
            "barcode": "171143153",
            "dpc": "03010444601",
            "name": "ចាន់ លី"
        },
        {
            "barcode": "171143154",
            "dpc": "03010444701",
            "name": "យិន រឿន"
        },
        {
            "barcode": "171143155",
            "dpc": "03010444801",
            "name": "ប៉ិច ដារ៉ា"
        },
        {
            "barcode": "171143156",
            "dpc": "03010444901",
            "name": "យ៉េក លី"
        },
        {
            "barcode": "171143157",
            "dpc": "03010445001",
            "name": "សំ ប៊ុនណាត"
        },
        {
            "barcode": "171143158",
            "dpc": "03010445101",
            "name": "ថង ស៊ីណា"
        },
        {
            "barcode": "171143159",
            "dpc": "03010445201",
            "name": "ប៊ូ សំផុន"
        },
        {
            "barcode": "171143160",
            "dpc": "03010445301",
            "name": "ប៊ុត សុធី"
        },
        {
            "barcode": "171143161",
            "dpc": "03010445401",
            "name": "ធឿន សេង"
        },
        {
            "barcode": "171143162",
            "dpc": "03010445601",
            "name": "ប៉ាល់ ជឿម"
        },
        {
            "barcode": "171143163",
            "dpc": "03010445701",
            "name": "ចៅ គឹមឈួន"
        },
        {
            "barcode": "171143164",
            "dpc": "03010445801",
            "name": "សុខ សាន្ត"
        },
        {
            "barcode": "171143165",
            "dpc": "03010445901",
            "name": "កែវ លីដា"
        },
        {
            "barcode": "171143166",
            "dpc": "03010446101",
            "name": "លី គឹមឡេង"
        },
        {
            "barcode": "171143167",
            "dpc": "03010446201",
            "name": "ជា ស្រ៊ុន"
        },
        {
            "barcode": "171143168",
            "dpc": "03010446301",
            "name": "អ៊ុំ ស្រួយ"
        },
        {
            "barcode": "171143169",
            "dpc": "03010446501",
            "name": "មិន ប៊ុនណារ៉ុង"
        },
        {
            "barcode": "171143170",
            "dpc": "03010446601",
            "name": "ឡាយ សំបូរ"
        },
        {
            "barcode": "171143171",
            "dpc": "03010446701",
            "name": "តែ គឹមស្រូយ"
        },
        {
            "barcode": "171143172",
            "dpc": "03010446901",
            "name": "លី សុផល"
        },
        {
            "barcode": "171143173",
            "dpc": "03010447001",
            "name": "សូ  វណ្ណា"
        },
        {
            "barcode": "171143174",
            "dpc": "03010447101",
            "name": "គ្រុយ ឈុនអ៊ឹង"
        },
        {
            "barcode": "171143175",
            "dpc": "03010447301",
            "name": "ឈួន ទូច"
        },
        {
            "barcode": "171143176",
            "dpc": "03010447401",
            "name": "លឹម ប៉ោស្រេង"
        },
        {
            "barcode": "171143177",
            "dpc": "03010447501",
            "name": "ង៉ាន លាភ"
        },
        {
            "barcode": "171143178",
            "dpc": "03010447601",
            "name": "វ៉ូង សឹង"
        },
        {
            "barcode": "171143179",
            "dpc": "03010447701",
            "name": "ងួន លឹមឃាន់"
        },
        {
            "barcode": "171143180",
            "dpc": "03010447901",
            "name": "តាន់ វឌ្ឍនី"
        },
        {
            "barcode": "171143181",
            "dpc": "03010423701",
            "name": "ឈិត  សារ៉យ"
        },
        {
            "barcode": "171143182",
            "dpc": "03010447801",
            "name": "ប្រស់   សឿប"
        },
        {
            "barcode": "171143183",
            "dpc": "03010448001",
            "name": "ម៉ាន វេង"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
