let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171143184",
            "dpc": "03010505001",
            "name": "ជីវ សុខា"
        },
        {
            "barcode": "171143185",
            "dpc": "03010504901",
            "name": "មាន ឡាយ"
        },
        {
            "barcode": "171143186",
            "dpc": "03010504801",
            "name": "សេង ហ៊ាង"
        },
        {
            "barcode": "171143187",
            "dpc": "03010504701",
            "name": "ម៉ូវ អាន"
        },
        {
            "barcode": "171143188",
            "dpc": "03010504601",
            "name": "សឹង ហ៊ង"
        },
        {
            "barcode": "171143189",
            "dpc": "03010504501",
            "name": "យ៉ែម ម៉េង"
        },
        {
            "barcode": "171143190",
            "dpc": "03010504401",
            "name": "ចាប ជួង"
        },
        {
            "barcode": "171143191",
            "dpc": "03010504301",
            "name": "សេង ប៊ូ ២"
        },
        {
            "barcode": "171143192",
            "dpc": "03010504201",
            "name": "ប៊ុន លី"
        },
        {
            "barcode": "171143193",
            "dpc": "03010504001",
            "name": "សេង ប៊ូ ១"
        },
        {
            "barcode": "171143194",
            "dpc": "03010503901",
            "name": "តាំង ទ្រី"
        },
        {
            "barcode": "171143195",
            "dpc": "03010503801",
            "name": "ប៊ុន ថា"
        },
        {
            "barcode": "171143196",
            "dpc": "03010503701",
            "name": "ជា ប៊ូ"
        },
        {
            "barcode": "171143197",
            "dpc": "03010503601",
            "name": "ញៀវ វ៉ាន់ណារ៉ា"
        },
        {
            "barcode": "171143198",
            "dpc": "03010503501",
            "name": "កៅ យ៉ៅ"
        },
        {
            "barcode": "171143199",
            "dpc": "03010503401",
            "name": "ជា បានហេង"
        },
        {
            "barcode": "171143200",
            "dpc": "03010503301",
            "name": "ផុន នាង ១"
        },
        {
            "barcode": "171143201",
            "dpc": "03010503201",
            "name": "សុខ ចំណាប់"
        },
        {
            "barcode": "171143202",
            "dpc": "03010503101",
            "name": "លី ហួន"
        },
        {
            "barcode": "171143203",
            "dpc": "03010503001",
            "name": "នាង ធី"
        },
        {
            "barcode": "171143204",
            "dpc": "03010502901",
            "name": "ហេង អ៊ូរ"
        },
        {
            "barcode": "171143205",
            "dpc": "03010502801",
            "name": "ហេង ចាន់ធា"
        },
        {
            "barcode": "171143206",
            "dpc": "03010502601",
            "name": "ខឹម សាម៉ុន"
        },
        {
            "barcode": "171143207",
            "dpc": "03010502501",
            "name": "ឡេង សុផល"
        },
        {
            "barcode": "171143208",
            "dpc": "03010502301",
            "name": "ឡាយ សាន"
        },
        {
            "barcode": "171143209",
            "dpc": "03010502201",
            "name": "ចៃ គង់"
        },
        {
            "barcode": "171143210",
            "dpc": "03010502101",
            "name": "ឃុន ព្រីង"
        },
        {
            "barcode": "171143211",
            "dpc": "03010502001",
            "name": "យី ប៊ុនខន ២"
        },
        {
            "barcode": "171143212",
            "dpc": "03010502401",
            "name": "ជឹង ហុកហ៊ី"
        },
        {
            "barcode": "171143213",
            "dpc": "03010501901",
            "name": "ថៃ រ៉ន"
        },
        {
            "barcode": "171143214",
            "dpc": "03010501801",
            "name": "គី ខេង"
        },
        {
            "barcode": "171143215",
            "dpc": "03010501701",
            "name": "ឈួន ឆាយ"
        },
        {
            "barcode": "171143216",
            "dpc": "03010501501",
            "name": "លី ម៉ៅ"
        },
        {
            "barcode": "171143217",
            "dpc": "03010501401",
            "name": "ឡុង សុខន"
        },
        {
            "barcode": "171143218",
            "dpc": "03010501201",
            "name": "អ៊ឹង ហ៊ីម"
        },
        {
            "barcode": "171143219",
            "dpc": "03010501101",
            "name": "អ៊ឹង សុភា"
        },
        {
            "barcode": "171143220",
            "dpc": "03010501001",
            "name": "ឡេង សំអាត"
        },
        {
            "barcode": "171143221",
            "dpc": "03010500901",
            "name": "ចុង ស៊ីម"
        },
        {
            "barcode": "171143222",
            "dpc": "03010500801",
            "name": "ធូ ពៅ ២"
        },
        {
            "barcode": "171143223",
            "dpc": "03010500701",
            "name": "ធូ ពៅ ១"
        },
        {
            "barcode": "171143224",
            "dpc": "03010500601",
            "name": "សេង ហៃ"
        },
        {
            "barcode": "171143225",
            "dpc": "03010500501",
            "name": "យិន ញ៉ាង"
        },
        {
            "barcode": "171143226",
            "dpc": "03010500401",
            "name": "យ៉ង ស៊ុន"
        },
        {
            "barcode": "171143227",
            "dpc": "03010500301",
            "name": "ផាត សុផាត ២"
        },
        {
            "barcode": "171143228",
            "dpc": "03010500101",
            "name": "ឆេង ឡុង"
        },
        {
            "barcode": "171143229",
            "dpc": "03010508301",
            "name": "រ៉ម វីរៈ"
        },
        {
            "barcode": "171143230",
            "dpc": "03010508401",
            "name": "រ៉ម ញឹម"
        },
        {
            "barcode": "171143231",
            "dpc": "03010508501",
            "name": "ខ ស៊ីវ"
        },
        {
            "barcode": "171143232",
            "dpc": "03010508601",
            "name": "លឹម ឡេង"
        },
        {
            "barcode": "171143233",
            "dpc": "03010508701",
            "name": "ខ សុខុម"
        },
        {
            "barcode": "171143234",
            "dpc": "03010508801",
            "name": "ហុក សុវិចិត្រ"
        },
        {
            "barcode": "171143235",
            "dpc": "03010526801",
            "name": "តា ថាំ"
        },
        {
            "barcode": "171143236",
            "dpc": "03010526901",
            "name": "កញ្ញា សំបូរ"
        },
        {
            "barcode": "171143237",
            "dpc": "03010527501",
            "name": "ឆុង សុភាព"
        },
        {
            "barcode": "171143238",
            "dpc": "03010527001",
            "name": "ឈុំ ឌី"
        },
        {
            "barcode": "171143239",
            "dpc": "03010527101",
            "name": "ចែ ម៉ៅ ២"
        },
        {
            "barcode": "171143240",
            "dpc": "03010527201",
            "name": "ឆុន សុភាព"
        },
        {
            "barcode": "171143241",
            "dpc": "03010528801",
            "name": "ចែ ម៉ៅ ៣"
        },
        {
            "barcode": "171143242",
            "dpc": "03010527301",
            "name": "ឈួន ឆុន"
        },
        {
            "barcode": "171143243",
            "dpc": "03010527401",
            "name": "គុយ វី ៣"
        },
        {
            "barcode": "171143244",
            "dpc": "03010527901",
            "name": "គង់ វត្ថា"
        },
        {
            "barcode": "171143245",
            "dpc": "03010528001",
            "name": "ចៅ ហុង"
        },
        {
            "barcode": "171143246",
            "dpc": "03010528101",
            "name": "លឹម តុង"
        },
        {
            "barcode": "171143247",
            "dpc": "03010528301",
            "name": "កែវ សាវ៉ែ"
        },
        {
            "barcode": "171143248",
            "dpc": "03010528401",
            "name": "សេង លាង"
        },
        {
            "barcode": "171143249",
            "dpc": "03010528501",
            "name": "គឹម ស៊ា"
        },
        {
            "barcode": "171143250",
            "dpc": "03010528601",
            "name": "ណាម វិចិត្រ"
        },
        {
            "barcode": "171143251",
            "dpc": "03010528701",
            "name": "សេង លាំង"
        },
        {
            "barcode": "171143252",
            "dpc": "03010528901",
            "name": "កែវ រតនា"
        },
        {
            "barcode": "171143253",
            "dpc": "03010529001",
            "name": "គួច លាប"
        },
        {
            "barcode": "171143254",
            "dpc": "03010529101",
            "name": "មុំ លាងស្រូយ"
        },
        {
            "barcode": "171143255",
            "dpc": "03010529201",
            "name": "អ៊ុល វេ"
        },
        {
            "barcode": "171143256",
            "dpc": "03010529301",
            "name": "ងូវ  វេងហុក"
        },
        {
            "barcode": "171143257",
            "dpc": "03010523201",
            "name": "គង់ វត្ត"
        },
        {
            "barcode": "171143258",
            "dpc": "03010523301",
            "name": "គឹម ម៉េង"
        },
        {
            "barcode": "171143259",
            "dpc": "03010523401",
            "name": "លឹម សុភាព"
        },
        {
            "barcode": "171143260",
            "dpc": "03010523501",
            "name": "ពុធ ទ្រី"
        },
        {
            "barcode": "171143261",
            "dpc": "03010523601",
            "name": "លឹម ឆាយ ១"
        },
        {
            "barcode": "171143262",
            "dpc": "03010523701",
            "name": "ងួន ហៃ"
        },
        {
            "barcode": "171143263",
            "dpc": "03010523801",
            "name": "ឈុន ឈួន"
        },
        {
            "barcode": "171143264",
            "dpc": "03010523901",
            "name": "លឹម ឆាយ ២"
        },
        {
            "barcode": "171143265",
            "dpc": "03010524001",
            "name": "គឹម សានគាន"
        },
        {
            "barcode": "171143266",
            "dpc": "03010524101",
            "name": "ឈុំ ឆើត"
        },
        {
            "barcode": "171143267",
            "dpc": "03010524201",
            "name": "បេ គឹមវែង"
        },
        {
            "barcode": "171143268",
            "dpc": "03010524301",
            "name": "អ៊ឹង ងួន"
        },
        {
            "barcode": "171143269",
            "dpc": "03010524401",
            "name": "អ៊ឹង សៀកឡេង"
        },
        {
            "barcode": "171143270",
            "dpc": "03010524501",
            "name": "វ៉ាន់ ឌី"
        },
        {
            "barcode": "171143271",
            "dpc": "03010524601",
            "name": "មុត វ៉ាន់នី"
        },
        {
            "barcode": "171143272",
            "dpc": "03010524701",
            "name": "គឹម សាន"
        },
        {
            "barcode": "171143273",
            "dpc": "03010524801",
            "name": "ជន ជុន"
        },
        {
            "barcode": "171143274",
            "dpc": "03010524901",
            "name": "គ្រុយ ឈុន"
        },
        {
            "barcode": "171143275",
            "dpc": "03010525001",
            "name": "សុខ សាន្ត"
        },
        {
            "barcode": "171143276",
            "dpc": "03010525101",
            "name": "គង់ មុំ"
        },
        {
            "barcode": "171143277",
            "dpc": "03010525201",
            "name": "មៀវ ទាវ"
        },
        {
            "barcode": "171143278",
            "dpc": "03010525301",
            "name": "ហេង សុខម៉េង"
        },
        {
            "barcode": "171143279",
            "dpc": "03010525401",
            "name": "សេង គីម"
        },
        {
            "barcode": "171143280",
            "dpc": "03010525501",
            "name": "សម្បត្តិ ផល្លី"
        },
        {
            "barcode": "171143281",
            "dpc": "03010525701",
            "name": "ហោ ទ្រី"
        },
        {
            "barcode": "171143282",
            "dpc": "03010525801",
            "name": "លឹម មួយហ៊ាង"
        },
        {
            "barcode": "171143283",
            "dpc": "03010525901",
            "name": "ហេង គឹមទី"
        },
        {
            "barcode": "171143284",
            "dpc": "03010526001",
            "name": "លី សាលី"
        },
        {
            "barcode": "171143285",
            "dpc": "03010526101",
            "name": "ស៊្រុន ហុក"
        },
        {
            "barcode": "171143286",
            "dpc": "03010526201",
            "name": "ចាន់ ប៊ុនឡេង"
        },
        {
            "barcode": "171143287",
            "dpc": "03010526301",
            "name": "សម្បត្តិ សោភា"
        },
        {
            "barcode": "171143288",
            "dpc": "03010526401",
            "name": "ដួង មាច"
        },
        {
            "barcode": "171143289",
            "dpc": "03010526501",
            "name": "យឿន តូច ២"
        },
        {
            "barcode": "171143290",
            "dpc": "03010526601",
            "name": "ផៃ ប៊ុនធឿន"
        },
        {
            "barcode": "171143291",
            "dpc": "03010526701",
            "name": "ជឹង វែងអ៊ាវ"
        },
        {
            "barcode": "171143292",
            "dpc": "03010519401",
            "name": "សន ប៊ុនណា"
        },
        {
            "barcode": "171143293",
            "dpc": "03010522001",
            "name": "ឈួន អួក"
        },
        {
            "barcode": "171143294",
            "dpc": "03010522601",
            "name": "សេង ប៊ូ ៤"
        },
        {
            "barcode": "171143295",
            "dpc": "03010522701",
            "name": "ប៊ុន ពៅ"
        },
        {
            "barcode": "171143296",
            "dpc": "03010522801",
            "name": "លី អៀក"
        },
        {
            "barcode": "171143297",
            "dpc": "03010522901",
            "name": "លី ប៊ុនធឿន"
        },
        {
            "barcode": "171143298",
            "dpc": "03010523101",
            "name": "ហេង គុណ"
        },
        {
            "barcode": "171143299",
            "dpc": "03010522501",
            "name": "ភឿក ប៉ូ"
        },
        {
            "barcode": "171143300",
            "dpc": "03010522401",
            "name": "ខៃ សំបូ"
        },
        {
            "barcode": "171143301",
            "dpc": "03010522301",
            "name": "លី វ័ន្ត"
        },
        {
            "barcode": "171143302",
            "dpc": "03010522201",
            "name": "ប៊ុត ហួត"
        },
        {
            "barcode": "171143303",
            "dpc": "03010522101",
            "name": "សៀម ភក្តី ១"
        },
        {
            "barcode": "171143304",
            "dpc": "03010521801",
            "name": "សុខ ណាត"
        },
        {
            "barcode": "171143305",
            "dpc": "03010521701",
            "name": "ហួត អឿង"
        },
        {
            "barcode": "171143306",
            "dpc": "03010521601",
            "name": "ធូរ៉េ វត្តី ១"
        },
        {
            "barcode": "171143307",
            "dpc": "03010521501",
            "name": "ខា វណ្ណ"
        },
        {
            "barcode": "171143308",
            "dpc": "03010521401",
            "name": "គួយ ឆេងលី"
        },
        {
            "barcode": "171143309",
            "dpc": "03010521301",
            "name": "សម្បត្តិ ញ៉ ២"
        },
        {
            "barcode": "171143310",
            "dpc": "03010521101",
            "name": "លឹម វេង"
        },
        {
            "barcode": "171143311",
            "dpc": "03010520801",
            "name": "លីវ ហៀក"
        },
        {
            "barcode": "171143312",
            "dpc": "03010520601",
            "name": "យស វិន"
        },
        {
            "barcode": "171143313",
            "dpc": "03010520501",
            "name": "អែមបាន"
        },
        {
            "barcode": "171143314",
            "dpc": "03010520401",
            "name": "លឹម ហ្តូរ"
        },
        {
            "barcode": "171143315",
            "dpc": "03010520301",
            "name": "ជា ហ៊ុយ"
        },
        {
            "barcode": "171143316",
            "dpc": "03010520201",
            "name": "ឡៅ ម៉េង"
        },
        {
            "barcode": "171143317",
            "dpc": "03010520101",
            "name": "គិត ញ៉ុល"
        },
        {
            "barcode": "171143318",
            "dpc": "03010520001",
            "name": "សុខ ថេង"
        },
        {
            "barcode": "171143319",
            "dpc": "03010519901",
            "name": "ឯម សេក"
        },
        {
            "barcode": "171143320",
            "dpc": "03010519801",
            "name": "សៀក សន"
        },
        {
            "barcode": "171143321",
            "dpc": "03010519701",
            "name": "អ៊ឹម ឡេង"
        },
        {
            "barcode": "171143322",
            "dpc": "03010519601",
            "name": "ឡេង ណាង"
        },
        {
            "barcode": "171143323",
            "dpc": "03010519501",
            "name": "ង៉ូវ មួយអ៊ី"
        },
        {
            "barcode": "171143324",
            "dpc": "03010519301",
            "name": "មិន លីហួរ ២"
        },
        {
            "barcode": "171143325",
            "dpc": "03010519201",
            "name": "ជា សុរដ្ឋ"
        },
        {
            "barcode": "171143326",
            "dpc": "03010519101",
            "name": "ម៉ាក វ៉ាន្នី"
        },
        {
            "barcode": "171143327",
            "dpc": "03010518901",
            "name": "ឈុន ឆាង"
        },
        {
            "barcode": "171143328",
            "dpc": "03010518801",
            "name": "ជីវ គឹមស៊ាន"
        },
        {
            "barcode": "171143329",
            "dpc": "03010518501",
            "name": "ដែក សេង"
        },
        {
            "barcode": "171143330",
            "dpc": "03010518401",
            "name": "លឹម ឆេង"
        },
        {
            "barcode": "171143331",
            "dpc": "03010518301",
            "name": "ឃុត លីសុង"
        },
        {
            "barcode": "171143332",
            "dpc": "03010518201",
            "name": "សឿន សុផល"
        },
        {
            "barcode": "171143333",
            "dpc": "03010518101",
            "name": "ហា ធៀង"
        },
        {
            "barcode": "171143334",
            "dpc": "03010518001",
            "name": "យូ សន"
        },
        {
            "barcode": "171143335",
            "dpc": "03010517901",
            "name": "តាន់ វណ្ឌី"
        },
        {
            "barcode": "171143336",
            "dpc": "03010517701",
            "name": "ជា សារិទ្ធ"
        },
        {
            "barcode": "171143337",
            "dpc": "03010517801",
            "name": "ស៊្រុន   ហុក"
        },
        {
            "barcode": "171143338",
            "dpc": "03010517601",
            "name": "ប៉ា ឡុងហៃ ១"
        },
        {
            "barcode": "171143339",
            "dpc": "03010517501",
            "name": "ហ៊ឹម ហ៊"
        },
        {
            "barcode": "171143340",
            "dpc": "03010517401",
            "name": "អ៊ឹម សារិន"
        },
        {
            "barcode": "171143341",
            "dpc": "03010517301",
            "name": "ផន គឹមយី"
        },
        {
            "barcode": "171143342",
            "dpc": "03010517201",
            "name": "គឹម សាន"
        },
        {
            "barcode": "171143343",
            "dpc": "03010517101",
            "name": "ឃុន នាង"
        },
        {
            "barcode": "171143344",
            "dpc": "03010517001",
            "name": "ទួត ផាន់"
        },
        {
            "barcode": "171143345",
            "dpc": "03010516701",
            "name": "ឈៀរ ងី"
        },
        {
            "barcode": "171143346",
            "dpc": "03010516601",
            "name": "កាំង ឡាយ"
        },
        {
            "barcode": "171143347",
            "dpc": "03010516501",
            "name": "គ្រុយ ឈុនអ៊ឹង ២"
        },
        {
            "barcode": "171143348",
            "dpc": "03010516401",
            "name": "ថា ផល្លី"
        },
        {
            "barcode": "171143349",
            "dpc": "03010516301",
            "name": "ម៉ាក់ ហ៊ាង"
        },
        {
            "barcode": "171143350",
            "dpc": "03010515801",
            "name": "តាំង គឹមឆេង ២"
        },
        {
            "barcode": "171143351",
            "dpc": "03010508901",
            "name": "ផួង គឿង"
        },
        {
            "barcode": "171143352",
            "dpc": "03010509001",
            "name": "ស៊ិន ប៊ុនសឿន"
        },
        {
            "barcode": "171143353",
            "dpc": "03010509101",
            "name": "លឹម ម៉េង"
        },
        {
            "barcode": "171143354",
            "dpc": "03010509201",
            "name": "យាំង ប៊ុននី"
        },
        {
            "barcode": "171143355",
            "dpc": "03010509301",
            "name": "សួន នាង"
        },
        {
            "barcode": "171143356",
            "dpc": "03010509401",
            "name": "សុខ គៀង"
        },
        {
            "barcode": "171143357",
            "dpc": "03010509501",
            "name": "អ៊ួម រ៉ម"
        },
        {
            "barcode": "171143358",
            "dpc": "03010509601",
            "name": "សឹម សុង"
        },
        {
            "barcode": "171143359",
            "dpc": "03010509801",
            "name": "រឿង សារ៉ាត់"
        },
        {
            "barcode": "171143360",
            "dpc": "03010510001",
            "name": "អ៊ុំ រិទ្ធី"
        },
        {
            "barcode": "171143361",
            "dpc": "03010510101",
            "name": "ជឺ ណៃហ៊ាង"
        },
        {
            "barcode": "171143362",
            "dpc": "03010510201",
            "name": "លឹម ប៉ិច"
        },
        {
            "barcode": "171143363",
            "dpc": "03010510301",
            "name": "សុខ បីស៊ូ"
        },
        {
            "barcode": "171143364",
            "dpc": "03010510401",
            "name": "ហាក់ ណារិន"
        },
        {
            "barcode": "171143365",
            "dpc": "03010510501",
            "name": "គឹ ចាន់ធី"
        },
        {
            "barcode": "171143366",
            "dpc": "03010510601",
            "name": "លឹម ខេង"
        },
        {
            "barcode": "171143367",
            "dpc": "03010510701",
            "name": "សោម សារឿន"
        },
        {
            "barcode": "171143368",
            "dpc": "03010510801",
            "name": "ដាង សារឿន"
        },
        {
            "barcode": "171143369",
            "dpc": "03010510901",
            "name": "សែស សារឹម"
        },
        {
            "barcode": "171143370",
            "dpc": "03010511001",
            "name": "រស់ ដារ៉ា"
        },
        {
            "barcode": "171143371",
            "dpc": "03010511101",
            "name": "ហែម ដារ៉ា"
        },
        {
            "barcode": "171143372",
            "dpc": "03010511201",
            "name": "ណុល នឿន"
        },
        {
            "barcode": "171143373",
            "dpc": "03010511301",
            "name": "តាំង ថៃ"
        },
        {
            "barcode": "171143374",
            "dpc": "03010511401",
            "name": "ព្រំ គឿន"
        },
        {
            "barcode": "171143375",
            "dpc": "03010511501",
            "name": "អូន ណារ៉ុង"
        },
        {
            "barcode": "171143376",
            "dpc": "03010511701",
            "name": "លឹម ឆាយ"
        },
        {
            "barcode": "171143377",
            "dpc": "03010512001",
            "name": "មាស សុភាព"
        },
        {
            "barcode": "171143378",
            "dpc": "03010512101",
            "name": "ពៅ សំបូរ"
        },
        {
            "barcode": "171143379",
            "dpc": "03010512301",
            "name": "លេង លាប"
        },
        {
            "barcode": "171143380",
            "dpc": "03010512401",
            "name": "អឿន ឆេង"
        },
        {
            "barcode": "171143381",
            "dpc": "03010512501",
            "name": "ផូ សុខហេង"
        },
        {
            "barcode": "171143382",
            "dpc": "03010512601",
            "name": "ទន់ សុភាព"
        },
        {
            "barcode": "171143383",
            "dpc": "03010512701",
            "name": "ស៊ឹម វិមុត្តិ"
        },
        {
            "barcode": "171143384",
            "dpc": "03010512801",
            "name": "តាន់ ទេវី"
        },
        {
            "barcode": "171143385",
            "dpc": "03010512901",
            "name": "ឆែម សេង"
        },
        {
            "barcode": "171143386",
            "dpc": "03010513001",
            "name": "កាន់ រិទ្ធី"
        },
        {
            "barcode": "171143387",
            "dpc": "03010513101",
            "name": "សួស ហួត"
        },
        {
            "barcode": "171143388",
            "dpc": "03010515001",
            "name": "ចាន់ សាវ័ន្ត"
        },
        {
            "barcode": "171143389",
            "dpc": "03010515201",
            "name": "រៀម សារ៉េត"
        },
        {
            "barcode": "171143390",
            "dpc": "03010515301",
            "name": "គ្រូ ជា"
        },
        {
            "barcode": "171143391",
            "dpc": "03010515401",
            "name": "គី វិរិន្ទ"
        },
        {
            "barcode": "171143392",
            "dpc": "03010515501",
            "name": "ព្រំ វ៉ែយ៉ា ១"
        },
        {
            "barcode": "171143393",
            "dpc": "03010515601",
            "name": "ធា ឈីវកាង"
        },
        {
            "barcode": "171143394",
            "dpc": "03010515701",
            "name": "ព្រំ វ៉ែយ៉ា ២"
        },
        {
            "barcode": "171143395",
            "dpc": "03010505101",
            "name": "អៀង សុខា"
        },
        {
            "barcode": "171143396",
            "dpc": "03010505201",
            "name": "ទូច ប៉ុយ"
        },
        {
            "barcode": "171143397",
            "dpc": "03010505301",
            "name": "ម៉ិញ ម៉ារ៉ា"
        },
        {
            "barcode": "171143398",
            "dpc": "03010505401",
            "name": "ប៊ូ   ដាណា"
        },
        {
            "barcode": "171143399",
            "dpc": "03010505601",
            "name": "លី គ្រុយ"
        },
        {
            "barcode": "171143400",
            "dpc": "03010505701",
            "name": "ទឹម រី"
        },
        {
            "barcode": "171143401",
            "dpc": "03010505801",
            "name": "ឈួន អួក"
        },
        {
            "barcode": "171143402",
            "dpc": "03010505901",
            "name": "ស៊ុំ ប៉ន"
        },
        {
            "barcode": "171143403",
            "dpc": "03010506001",
            "name": "នួន ភឿន"
        },
        {
            "barcode": "171143404",
            "dpc": "03010506101",
            "name": "ភាជ សុធី"
        },
        {
            "barcode": "171143405",
            "dpc": "03010506201",
            "name": "ប៊ូ   ជីម"
        },
        {
            "barcode": "171143406",
            "dpc": "03010506301",
            "name": "វេង តាំងលី"
        },
        {
            "barcode": "171143407",
            "dpc": "03010506401",
            "name": "សេង ប៊ូ ៣"
        },
        {
            "barcode": "171143408",
            "dpc": "03010506501",
            "name": "នូ សាវង្ស"
        },
        {
            "barcode": "171143409",
            "dpc": "03010506601",
            "name": "ជា ប៊ូ"
        },
        {
            "barcode": "171143410",
            "dpc": "03010506701",
            "name": "មាស វ៉ាន់ធី"
        },
        {
            "barcode": "171143411",
            "dpc": "03010506801",
            "name": "ជា ធារី"
        },
        {
            "barcode": "171143412",
            "dpc": "03010506901",
            "name": "ផុន នាង ១"
        },
        {
            "barcode": "171143413",
            "dpc": "03010507001",
            "name": "ផុន សុផល"
        },
        {
            "barcode": "171143414",
            "dpc": "03010507101",
            "name": "ប៊ុន វណ្ណារ៉ា"
        },
        {
            "barcode": "171143415",
            "dpc": "03010507201",
            "name": "ប្លុង សាន"
        },
        {
            "barcode": "171143416",
            "dpc": "03010507301",
            "name": "ឆែត សៀង"
        },
        {
            "barcode": "171143417",
            "dpc": "03010507401",
            "name": "អ៊ី ភិរុណ"
        },
        {
            "barcode": "171143418",
            "dpc": "03010507501",
            "name": "សុខ ភារ៉ា"
        },
        {
            "barcode": "171143419",
            "dpc": "03010507601",
            "name": "សុខ ស្រេង"
        },
        {
            "barcode": "171143420",
            "dpc": "03010507801",
            "name": "ហ៊ុល លៀវឃឹម"
        },
        {
            "barcode": "171143421",
            "dpc": "03010507701",
            "name": "ម៉ន ណាវី"
        },
        {
            "barcode": "171143422",
            "dpc": "03010507901",
            "name": "ស៊ិន សម្បត្តិ"
        },
        {
            "barcode": "171143423",
            "dpc": "03010508001",
            "name": "ពេជ្រ កុសល"
        },
        {
            "barcode": "171143424",
            "dpc": "03010508101",
            "name": "អឿង សំ"
        },
        {
            "barcode": "171143425",
            "dpc": "03010508201",
            "name": "មាស ទឿម"
        },
        {
            "barcode": "171143426",
            "dpc": "03010513201",
            "name": "សេក គារ"
        },
        {
            "barcode": "171143427",
            "dpc": "03010513301",
            "name": "ស្រស់ សារុន"
        },
        {
            "barcode": "171143428",
            "dpc": "03010511901",
            "name": "នឿន វុទ្ធី"
        },
        {
            "barcode": "171143429",
            "dpc": "03010513401",
            "name": "ជា សុខឃីម"
        },
        {
            "barcode": "171143430",
            "dpc": "03010513501",
            "name": "ផុន ទូច"
        },
        {
            "barcode": "171143431",
            "dpc": "03010513601",
            "name": "គង់ ផុន"
        },
        {
            "barcode": "171143432",
            "dpc": "03010513701",
            "name": "ជឺ គ្រី"
        },
        {
            "barcode": "171143433",
            "dpc": "03010513801",
            "name": "ឡាច សុធី"
        },
        {
            "barcode": "171143434",
            "dpc": "03010513901",
            "name": "ចេង គី"
        },
        {
            "barcode": "171143435",
            "dpc": "03010514001",
            "name": "ប៊ុន ភាច"
        },
        {
            "barcode": "171143436",
            "dpc": "03010514101",
            "name": "ឯម ស៊ីថា"
        },
        {
            "barcode": "171143437",
            "dpc": "03010514201",
            "name": "ស្រេង ប៊ុនថា"
        },
        {
            "barcode": "171143438",
            "dpc": "03010514301",
            "name": "ភឹម ប៊ុនលឿត"
        },
        {
            "barcode": "171143439",
            "dpc": "03010514401",
            "name": "យឹម ង៉ែត"
        },
        {
            "barcode": "171143440",
            "dpc": "03010514501",
            "name": "ស៊ាង ឈឿត"
        },
        {
            "barcode": "171143441",
            "dpc": "03010514601",
            "name": "មាន វីរៈ"
        },
        {
            "barcode": "171143442",
            "dpc": "03010514701",
            "name": "អ៊ុគ គឹមលន់"
        },
        {
            "barcode": "171143443",
            "dpc": "03010514801",
            "name": "ស័ក្ក លី"
        },
        {
            "barcode": "171143444",
            "dpc": "03010514901",
            "name": "ជិន សានិត"
        },
        {
            "barcode": "171143445",
            "dpc": "03010531001",
            "name": "តាន់ បូណា"
        },
        {
            "barcode": "171143446",
            "dpc": "03010531101",
            "name": "សៀក គឹមសាន"
        },
        {
            "barcode": "171143447",
            "dpc": "03010530901",
            "name": "ឆាង សន"
        },
        {
            "barcode": "171143448",
            "dpc": "03010530801",
            "name": "អេង ស៊ីផា"
        },
        {
            "barcode": "171143449",
            "dpc": "03010530701",
            "name": "ទន់ ទៀង"
        },
        {
            "barcode": "171143450",
            "dpc": "03010530601",
            "name": "ទន់ ឈួត"
        },
        {
            "barcode": "171143451",
            "dpc": "03010530501",
            "name": "ប៉ែន សោភ័ណ្ឌ"
        },
        {
            "barcode": "171143452",
            "dpc": "03010530401",
            "name": "ឆោង វីវីយ៉ា"
        },
        {
            "barcode": "171143453",
            "dpc": "03010530301",
            "name": "ណាល់ ស៊ីនួន"
        },
        {
            "barcode": "171143454",
            "dpc": "03010530201",
            "name": "វ៉ាយ គឹមហៀក"
        },
        {
            "barcode": "171143455",
            "dpc": "03010530101",
            "name": "វ៉ាយ គឹមហឿង"
        },
        {
            "barcode": "171143456",
            "dpc": "03010530001",
            "name": "ពិន ប៊ុនថន"
        },
        {
            "barcode": "171143457",
            "dpc": "03010529801",
            "name": "ផាត់ គង់"
        },
        {
            "barcode": "171143458",
            "dpc": "03010529701",
            "name": "ប៉ាត ពយ"
        },
        {
            "barcode": "171143459",
            "dpc": "03010529601",
            "name": "ប្រាក់ សម្បត្តិ"
        },
        {
            "barcode": "171143460",
            "dpc": "03010529501",
            "name": "ខ្លូត សម្បត្តិ"
        },
        {
            "barcode": "171143461",
            "dpc": "03010529401",
            "name": "ប៉ុញ ឧត្តម"
        },
        {
            "barcode": "171143462",
            "dpc": "03010518601",
            "name": "យីវ  គឹមស៊ាន"
        },
        {
            "barcode": "171143463",
            "dpc": "03010518701",
            "name": "ចេក  ណាំ"
        },
        {
            "barcode": "171143464",
            "dpc": "03010539201",
            "name": "តាំង ទៀង"
        },
        {
            "barcode": "171143465",
            "dpc": "03010547501",
            "name": "ភា ស៊ុយ"
        },
        {
            "barcode": "171143466",
            "dpc": "03010547601",
            "name": "កោ គឹមសួង"
        },
        {
            "barcode": "171143467",
            "dpc": "03010547701",
            "name": "ហេង ងី"
        },
        {
            "barcode": "171143468",
            "dpc": "03010547801",
            "name": "គង ម៉ាលី"
        },
        {
            "barcode": "171143469",
            "dpc": "03010547901",
            "name": "រឿង សារ៉ុង"
        },
        {
            "barcode": "171143470",
            "dpc": "03010547401",
            "name": "ភួយ លាងអេង"
        },
        {
            "barcode": "171143471",
            "dpc": "03010547301",
            "name": "ណុប ពោល"
        },
        {
            "barcode": "171143472",
            "dpc": "03010546401",
            "name": "ឈឹម រី"
        },
        {
            "barcode": "171143473",
            "dpc": "03010547201",
            "name": "សេង ហួត"
        },
        {
            "barcode": "171143474",
            "dpc": "03010547101",
            "name": "ឡុង ម៉ៅ"
        },
        {
            "barcode": "171143475",
            "dpc": "03010547001",
            "name": "យិន ហឺ"
        },
        {
            "barcode": "171143476",
            "dpc": "03010546901",
            "name": "វៃ សាវន"
        },
        {
            "barcode": "171143477",
            "dpc": "03010546801",
            "name": "អ៊ឹម   អយ"
        },
        {
            "barcode": "171143478",
            "dpc": "03010546701",
            "name": "ហ៊ិន ហ៊ុន"
        },
        {
            "barcode": "171143479",
            "dpc": "03010546601",
            "name": "វ៉ាន វាន"
        },
        {
            "barcode": "171143480",
            "dpc": "03010546501",
            "name": "គឹម យូ"
        },
        {
            "barcode": "171143481",
            "dpc": "03010546201",
            "name": "លឿង ហ៊រ"
        },
        {
            "barcode": "171143482",
            "dpc": "03010546101",
            "name": "ពូ ពេជ្រ"
        },
        {
            "barcode": "171143483",
            "dpc": "03010546001",
            "name": "ព្រឿង លាង"
        },
        {
            "barcode": "171143484",
            "dpc": "03010545901",
            "name": "ស៊ុន ប៊ុនរើត"
        },
        {
            "barcode": "171143485",
            "dpc": "03010545801",
            "name": "ប៊ុន ណារី"
        },
        {
            "barcode": "171143486",
            "dpc": "03010545701",
            "name": "គ្រី ស៊ាង"
        },
        {
            "barcode": "171143487",
            "dpc": "03010545601",
            "name": "ម៉ៅ សុភាព"
        },
        {
            "barcode": "171143488",
            "dpc": "03010536501",
            "name": "ទុំ ឡៃហួយ"
        },
        {
            "barcode": "171143489",
            "dpc": "03010536601",
            "name": "ឡុំ សោម"
        },
        {
            "barcode": "171143490",
            "dpc": "03010536701",
            "name": "សួស តឿ"
        },
        {
            "barcode": "171143491",
            "dpc": "03010536801",
            "name": "អង្គការជំនួយផ្នែកច្បាប់"
        },
        {
            "barcode": "171143492",
            "dpc": "03010536901",
            "name": "ងួន ជីវ័ន្ត"
        },
        {
            "barcode": "171143493",
            "dpc": "03010537001",
            "name": "ងួន ពិសិទ្ធ"
        },
        {
            "barcode": "171143494",
            "dpc": "03010536401",
            "name": "ប្រុក គឿន ៤"
        },
        {
            "barcode": "171143495",
            "dpc": "03010537101",
            "name": "ប៊ូ សុផល"
        },
        {
            "barcode": "171143496",
            "dpc": "03010537201",
            "name": "ហ៊ី ឆៃហ៊ាង"
        },
        {
            "barcode": "171143497",
            "dpc": "03010538201",
            "name": "ប៊ុត សុខា ១"
        },
        {
            "barcode": "171143498",
            "dpc": "03010538301",
            "name": "ផាត ចន្ធី"
        },
        {
            "barcode": "171143499",
            "dpc": "03010538101",
            "name": "ជា សុខុម"
        },
        {
            "barcode": "171143500",
            "dpc": "03010538001",
            "name": "សំ ហឿម"
        },
        {
            "barcode": "171143501",
            "dpc": "03010544101",
            "name": "អ៊ាង គឹមហ៊ាក"
        },
        {
            "barcode": "171143502",
            "dpc": "03010538401",
            "name": "រឿន ម៉ាន ១"
        },
        {
            "barcode": "171143503",
            "dpc": "03010538501",
            "name": "ទន់ សំណាង"
        },
        {
            "barcode": "171143504",
            "dpc": "03010538601",
            "name": "កែវ ណារី"
        },
        {
            "barcode": "171143505",
            "dpc": "03010538701",
            "name": "ស្រី ម៉ៅ"
        },
        {
            "barcode": "171143506",
            "dpc": "03010538801",
            "name": "ទូច សារុំ"
        },
        {
            "barcode": "171143507",
            "dpc": "03010544001",
            "name": "ទឹត ចាន់ហន"
        },
        {
            "barcode": "171143508",
            "dpc": "03010539001",
            "name": "មុត សាឃឿន"
        },
        {
            "barcode": "171143509",
            "dpc": "03010542801",
            "name": "អេង តុល"
        },
        {
            "barcode": "171143510",
            "dpc": "03010540001",
            "name": "អឿន វណ្ណៈ"
        },
        {
            "barcode": "171143511",
            "dpc": "03010539901",
            "name": "ផាត សុខា"
        },
        {
            "barcode": "171143512",
            "dpc": "03010539801",
            "name": "ហេង ប៊ុនធី"
        },
        {
            "barcode": "171143513",
            "dpc": "03010540601",
            "name": "អេង កែវ"
        },
        {
            "barcode": "171143514",
            "dpc": "03010539601",
            "name": "ឆាំ វុឌ្ឍី"
        },
        {
            "barcode": "171143515",
            "dpc": "03010539101",
            "name": "តិ ម៉ុង"
        },
        {
            "barcode": "171143516",
            "dpc": "03010540101",
            "name": "ភិន សុវណ្ណ"
        },
        {
            "barcode": "171143517",
            "dpc": "03010540201",
            "name": "ឃុត គួម"
        },
        {
            "barcode": "171143518",
            "dpc": "03010540301",
            "name": "វិន    សុផល"
        },
        {
            "barcode": "171143519",
            "dpc": "03010540401",
            "name": "សូ សាវង្ស"
        },
        {
            "barcode": "171143520",
            "dpc": "03010540501",
            "name": "ឡឹក សារ៉ាត"
        },
        {
            "barcode": "171143521",
            "dpc": "03010540701",
            "name": "តាំង ម៉ៃ"
        },
        {
            "barcode": "171143522",
            "dpc": "03010540801",
            "name": "ព្រឿន លាន"
        },
        {
            "barcode": "171143523",
            "dpc": "03010540901",
            "name": "គិន អង្គផល្លា"
        },
        {
            "barcode": "171143524",
            "dpc": "03010541101",
            "name": "គឹម ម៉ុន"
        },
        {
            "barcode": "171143525",
            "dpc": "03010541201",
            "name": "ប្រាក់ តឿប"
        },
        {
            "barcode": "171143526",
            "dpc": "03010541301",
            "name": "លី ណូ ១"
        },
        {
            "barcode": "171143527",
            "dpc": "03010541501",
            "name": "សួន  ចាន់នឿន"
        },
        {
            "barcode": "171143528",
            "dpc": "03010541701",
            "name": "ធម្ម សុផល"
        },
        {
            "barcode": "171143529",
            "dpc": "03010541801",
            "name": "ស៊ុយ ជំនឿ ១"
        },
        {
            "barcode": "171143530",
            "dpc": "03010541901",
            "name": "ទ្រី វណ្ណស"
        },
        {
            "barcode": "171143531",
            "dpc": "03010542001",
            "name": "និត សុភាព"
        },
        {
            "barcode": "171143532",
            "dpc": "03010542101",
            "name": "ធិន ធូ"
        },
        {
            "barcode": "171143533",
            "dpc": "03010537301",
            "name": "សែម ឈី"
        },
        {
            "barcode": "171143534",
            "dpc": "03010537401",
            "name": "សាន សាខន"
        },
        {
            "barcode": "171143535",
            "dpc": "03010537701",
            "name": "ម៉ាង សុង"
        },
        {
            "barcode": "171143536",
            "dpc": "03010537601",
            "name": "គឹម សុខុម"
        },
        {
            "barcode": "171143537",
            "dpc": "03010537501",
            "name": "ទួន សុផល"
        },
        {
            "barcode": "171143538",
            "dpc": "03010537801",
            "name": "សាន ជ័យរិទ្ធ"
        },
        {
            "barcode": "171143539",
            "dpc": "03010537901",
            "name": "ប៊ុន សារុន"
        },
        {
            "barcode": "171143540",
            "dpc": "03010541001",
            "name": "រ៉ាយ លាងស"
        },
        {
            "barcode": "171143541",
            "dpc": "03010541401",
            "name": "ឡេង ច័ន្ទដារ៉ា"
        },
        {
            "barcode": "171143542",
            "dpc": "03010541601",
            "name": "យិន ឆុងវិន"
        },
        {
            "barcode": "171143543",
            "dpc": "03010542201",
            "name": "ព្រី ថា"
        },
        {
            "barcode": "171143544",
            "dpc": "03010542301",
            "name": "សុខ ផល្លី"
        },
        {
            "barcode": "171143545",
            "dpc": "03010542601",
            "name": "ស៊ុយ ជំនឿ ២"
        },
        {
            "barcode": "171143546",
            "dpc": "03010545501",
            "name": "សែម គង់"
        },
        {
            "barcode": "171143547",
            "dpc": "03010545401",
            "name": "លឹម គឹមហៀវ"
        },
        {
            "barcode": "171143548",
            "dpc": "03010545301",
            "name": "លឹម សេងលី"
        },
        {
            "barcode": "171143549",
            "dpc": "03010545201",
            "name": "លឹម គឹហង្ស"
        },
        {
            "barcode": "171143550",
            "dpc": "03010544901",
            "name": "ទេស សម្បត្តិ"
        },
        {
            "barcode": "171143551",
            "dpc": "03010545101",
            "name": "យី ស៊ុយ"
        },
        {
            "barcode": "171143552",
            "dpc": "03010545001",
            "name": "គឹម ឡេង"
        },
        {
            "barcode": "171143553",
            "dpc": "03010544801",
            "name": "អ៊ុំ ឡេង"
        },
        {
            "barcode": "171143554",
            "dpc": "03010544601",
            "name": "អៀង ផាន"
        },
        {
            "barcode": "171143555",
            "dpc": "03010544401",
            "name": "តាំង សារី១"
        },
        {
            "barcode": "171143556",
            "dpc": "03010543301",
            "name": "មជ្ឈមណ្ឌលក្តីនិមិត្តធីម៉ូថេ"
        },
        {
            "barcode": "171143557",
            "dpc": "03010543201",
            "name": "ប៊ុក សុខា ២"
        },
        {
            "barcode": "171143558",
            "dpc": "03010543001",
            "name": "ឃុត មុត"
        },
        {
            "barcode": "171143559",
            "dpc": "03010543101",
            "name": "ហាក គឹមហេង"
        },
        {
            "barcode": "171143560",
            "dpc": "03010542901",
            "name": "ហួត ជា"
        },
        {
            "barcode": "171143561",
            "dpc": "03010543401",
            "name": "ខាត់ នី"
        },
        {
            "barcode": "171143562",
            "dpc": "03010543501",
            "name": "ជួន នី"
        },
        {
            "barcode": "171143563",
            "dpc": "03010543701",
            "name": "ឡុង សំណាង"
        },
        {
            "barcode": "171143564",
            "dpc": "03010543901",
            "name": "រិន យាន"
        },
        {
            "barcode": "171143565",
            "dpc": "03010531201",
            "name": "ឈុន សារិទ្ធ"
        },
        {
            "barcode": "171143566",
            "dpc": "03010531301",
            "name": "គឹម វុទ្ធី"
        },
        {
            "barcode": "171143567",
            "dpc": "03010531401",
            "name": "នួន ប៊ុនធឿន"
        },
        {
            "barcode": "171143568",
            "dpc": "03010531701",
            "name": "ព្រំ សាខន"
        },
        {
            "barcode": "171143569",
            "dpc": "03010531601",
            "name": "វី នេត"
        },
        {
            "barcode": "171143570",
            "dpc": "03010531501",
            "name": "មាស រ៉ានី"
        },
        {
            "barcode": "171143571",
            "dpc": "03010531801",
            "name": "តាំង ម៉េងគង់ ១"
        },
        {
            "barcode": "171143572",
            "dpc": "03010531901",
            "name": "តាំង ម៉េងគង់ ២"
        },
        {
            "barcode": "171143573",
            "dpc": "03010532001",
            "name": "អ៊ុំ គឹមឡេង"
        },
        {
            "barcode": "171143574",
            "dpc": "03010532101",
            "name": "គង់ សំរិត"
        },
        {
            "barcode": "171143575",
            "dpc": "03010532201",
            "name": "ព្រំ ចានថន"
        },
        {
            "barcode": "171143576",
            "dpc": "03010532801",
            "name": "តូត គីម"
        },
        {
            "barcode": "171143577",
            "dpc": "03010532701",
            "name": "មូល ប៊ុនធឿន"
        },
        {
            "barcode": "171143578",
            "dpc": "03010532601",
            "name": "ហ៊ុន យូ"
        },
        {
            "barcode": "171143579",
            "dpc": "03010532501",
            "name": "ញឹម សុខុម"
        },
        {
            "barcode": "171143580",
            "dpc": "03010532401",
            "name": "នៅ សុខចំរើន"
        },
        {
            "barcode": "171143581",
            "dpc": "03010532301",
            "name": "រ៉ា រ៉ានី"
        },
        {
            "barcode": "171143582",
            "dpc": "03010532901",
            "name": "សុខហេង"
        },
        {
            "barcode": "171143583",
            "dpc": "03010533001",
            "name": "តូ សុផាត"
        },
        {
            "barcode": "171143584",
            "dpc": "03010533201",
            "name": "សោម សុផុន"
        },
        {
            "barcode": "171143585",
            "dpc": "03010533301",
            "name": "អ៊ុង  សាម"
        },
        {
            "barcode": "171143586",
            "dpc": "03010533401",
            "name": "ទ្រី សុខឃីម"
        },
        {
            "barcode": "171143587",
            "dpc": "03010533501",
            "name": "ក្រុមហ៊ុនរិទ្ធីមន្នី"
        },
        {
            "barcode": "171143588",
            "dpc": "03010533601",
            "name": "សុខ ចាន់មន្នី"
        },
        {
            "barcode": "171143589",
            "dpc": "03010533701",
            "name": "សុខ សំអាត"
        },
        {
            "barcode": "171143590",
            "dpc": "03010533801",
            "name": "ងួន ចន្ធូ"
        },
        {
            "barcode": "171143591",
            "dpc": "03010533901",
            "name": "យឹក ចាន់"
        },
        {
            "barcode": "171143592",
            "dpc": "03010534001",
            "name": "ឈឹម នួន"
        },
        {
            "barcode": "171143593",
            "dpc": "03010534101",
            "name": "ប៊ុន សេងហាក"
        },
        {
            "barcode": "171143594",
            "dpc": "03010534201",
            "name": "គឹម ស្រ៊ុន"
        },
        {
            "barcode": "171143595",
            "dpc": "03010534301",
            "name": "រឿន ឡោ"
        },
        {
            "barcode": "171143596",
            "dpc": "03010534401",
            "name": "ទួត សុខុម"
        },
        {
            "barcode": "171143597",
            "dpc": "03010534501",
            "name": "តិច វែង"
        },
        {
            "barcode": "171143598",
            "dpc": "03010534601",
            "name": "លី ផេង"
        },
        {
            "barcode": "171143599",
            "dpc": "03010534701",
            "name": "គឹម ញ៉ាង"
        },
        {
            "barcode": "171143600",
            "dpc": "03010534801",
            "name": "វ៉ាង យ៉ុង"
        },
        {
            "barcode": "171143601",
            "dpc": "03010534901",
            "name": "វិន អ៊ាន"
        },
        {
            "barcode": "171143602",
            "dpc": "03010535001",
            "name": "គង់ សុផល"
        },
        {
            "barcode": "171143603",
            "dpc": "03010535101",
            "name": "នាត តាក"
        },
        {
            "barcode": "171143604",
            "dpc": "03010535201",
            "name": "សួង មឿន"
        },
        {
            "barcode": "171143605",
            "dpc": "03010535301",
            "name": "ណាង ប៊ុនរឿន"
        },
        {
            "barcode": "171143606",
            "dpc": "03010535401",
            "name": "នឹប ណេរ៉ា"
        },
        {
            "barcode": "171143607",
            "dpc": "03010535501",
            "name": "ឈួន ហ្គីតា"
        },
        {
            "barcode": "171143608",
            "dpc": "03010535601",
            "name": "ហេង ឃាង"
        },
        {
            "barcode": "171143609",
            "dpc": "03010535701",
            "name": "ជា សឿន"
        },
        {
            "barcode": "171143610",
            "dpc": "03010535801",
            "name": "ឈុំ ឈៀង"
        },
        {
            "barcode": "171143611",
            "dpc": "03010535901",
            "name": "ទួត រិន"
        },
        {
            "barcode": "171143612",
            "dpc": "03010536101",
            "name": "ស៊ូ វិចិត្រ"
        },
        {
            "barcode": "171143613",
            "dpc": "03010536201",
            "name": "ទិវ ផាវី"
        },
        {
            "barcode": "171143614",
            "dpc": "03010538901",
            "name": "ទាវ  សារ៉ូ"
        },
        {
            "barcode": "171143615",
            "dpc": "03010539301",
            "name": "ពេជ្រ  រើន"
        },
        {
            "barcode": "171143616",
            "dpc": "03010539701",
            "name": "ហួន  សុខា"
        },
        {
            "barcode": "171143617",
            "dpc": "03010533101",
            "name": "ប្រាក់  ណន"
        },
        {
            "barcode": "171143618",
            "dpc": "03010536001",
            "name": "ផា  សុផល"
        },
        {
            "barcode": "171143619",
            "dpc": "03010539401",
            "name": "ហាក់  ឡាយ"
        },
        {
            "barcode": "171143620",
            "dpc": "03010539501",
            "name": "ពេជ្រ  ឌី"
        },
        {
            "barcode": "171143621",
            "dpc": "03010542401",
            "name": "ហម  សាវ៉ុន"
        },
        {
            "barcode": "171143622",
            "dpc": "03010542501",
            "name": "ឆៃ  វណ្ណះ"
        },
        {
            "barcode": "171143623",
            "dpc": "03010542701",
            "name": "តឹក  សំអឿន"
        },
        {
            "barcode": "171143624",
            "dpc": "03010543601",
            "name": "គឿន  អឿប"
        },
        {
            "barcode": "171143625",
            "dpc": "03010544201",
            "name": "សាលារៀនសូបាណា"
        },
        {
            "barcode": "171143626",
            "dpc": "03010548001",
            "name": "ស៊ាង សាលី"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
