let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171146623",
            "dpc": "03010606701",
            "name": "ទន់  វ៉ាយ"
        },
        {
            "barcode": "171146624",
            "dpc": "03010626901",
            "name": "ហុក គីម"
        },
        {
            "barcode": "171146625",
            "dpc": "03010627101",
            "name": "ភី ផាន"
        },
        {
            "barcode": "171146626",
            "dpc": "03010627201",
            "name": "ជេស ទិត"
        },
        {
            "barcode": "171146627",
            "dpc": "03010627401",
            "name": "លឹម ងិធ"
        },
        {
            "barcode": "171146628",
            "dpc": "03010627501",
            "name": "ថាន់ ចន្តា"
        },
        {
            "barcode": "171146629",
            "dpc": "03010618301",
            "name": "លី  សៀប"
        },
        {
            "barcode": "171146630",
            "dpc": "03010618201",
            "name": "ពេជ្រ  ព្រហ្មមុន្នី"
        },
        {
            "barcode": "171146631",
            "dpc": "03010627301",
            "name": "ប៊ុន ចំរើន"
        },
        {
            "barcode": "171146632",
            "dpc": "03010618001",
            "name": "អ៊ឹម វត្តី"
        },
        {
            "barcode": "171146633",
            "dpc": "03010618101",
            "name": "ភួង   សុភាព"
        },
        {
            "barcode": "171146634",
            "dpc": "03010618401",
            "name": "ម៉ុន សាមឿន"
        },
        {
            "barcode": "171146635",
            "dpc": "03010618501",
            "name": "ម៉ក ទឹម"
        },
        {
            "barcode": "171146636",
            "dpc": "03010618601",
            "name": "ប៊ុច ស៊ត"
        },
        {
            "barcode": "171146637",
            "dpc": "03010618701",
            "name": "សៀក សារ៉េត"
        },
        {
            "barcode": "171146638",
            "dpc": "03010618801",
            "name": "ម៉ៃ សុវណ្ណ"
        },
        {
            "barcode": "171146639",
            "dpc": "03010618901",
            "name": "ទូច ប៊ុនធឿន"
        },
        {
            "barcode": "171146640",
            "dpc": "03010617601",
            "name": "ថុង  សុខជាតិ"
        },
        {
            "barcode": "171146641",
            "dpc": "03010617801",
            "name": "តែ  គឹមហួយ"
        },
        {
            "barcode": "171146642",
            "dpc": "03010617301",
            "name": "សៅ ដាំ"
        },
        {
            "barcode": "171146643",
            "dpc": "03010617401",
            "name": "សេង ថាវ"
        },
        {
            "barcode": "171146644",
            "dpc": "03010617001",
            "name": "ចាន់ វាសនា"
        },
        {
            "barcode": "171146645",
            "dpc": "03010616701",
            "name": "មិត្ត ចិន្តា"
        },
        {
            "barcode": "171146646",
            "dpc": "03010616801",
            "name": "គង់ ទឺ"
        },
        {
            "barcode": "171146647",
            "dpc": "03010619401",
            "name": "នឹម កែវ"
        },
        {
            "barcode": "171146648",
            "dpc": "03010619001",
            "name": "ភិន ប៊ុនរឿន"
        },
        {
            "barcode": "171146649",
            "dpc": "03010619101",
            "name": "អ៊ុំ សារី"
        },
        {
            "barcode": "171146650",
            "dpc": "03010619601",
            "name": "គណបក្សប្រជាជន"
        },
        {
            "barcode": "171146651",
            "dpc": "03010619701",
            "name": "ឈឹម សូលីដែន"
        },
        {
            "barcode": "171146652",
            "dpc": "03010619801",
            "name": "គឹម សៅលឿត"
        },
        {
            "barcode": "171146653",
            "dpc": "03010619901",
            "name": "ប៉ាង នួន"
        },
        {
            "barcode": "171146654",
            "dpc": "03010620101",
            "name": "ហេង កាកសុង"
        },
        {
            "barcode": "171146655",
            "dpc": "03010620601",
            "name": "រិន  សារ៉ន"
        },
        {
            "barcode": "171146656",
            "dpc": "03010620701",
            "name": "អ៊ឹង សី"
        },
        {
            "barcode": "171146657",
            "dpc": "03010617201",
            "name": "យិន  ចន្ធី"
        },
        {
            "barcode": "171146658",
            "dpc": "03010617101",
            "name": "អម រ៉េត"
        },
        {
            "barcode": "171146659",
            "dpc": "03010616601",
            "name": "ទីន ម៉ារី"
        },
        {
            "barcode": "171146660",
            "dpc": "03010620501",
            "name": "ឌុង ឌីម"
        },
        {
            "barcode": "171146661",
            "dpc": "03010620401",
            "name": "រស់ លី"
        },
        {
            "barcode": "171146662",
            "dpc": "03010620301",
            "name": "គង់ រ៉ាវី"
        },
        {
            "barcode": "171146663",
            "dpc": "03010620201",
            "name": "ឃ្លោក ដែន"
        },
        {
            "barcode": "171146664",
            "dpc": "03010621101",
            "name": "ប៊ុត សំអឿ"
        },
        {
            "barcode": "171146665",
            "dpc": "03010626501",
            "name": "ណុប ដារ៉ា"
        },
        {
            "barcode": "171146666",
            "dpc": "03010626601",
            "name": "ហួន  សង្ហា"
        },
        {
            "barcode": "171146667",
            "dpc": "03010626701",
            "name": "តេង សំអាត"
        },
        {
            "barcode": "171146668",
            "dpc": "03010626801",
            "name": "សាយ សារ័ត្ន"
        },
        {
            "barcode": "171146669",
            "dpc": "03010626001",
            "name": "ប៉ិច  ណម"
        },
        {
            "barcode": "171146670",
            "dpc": "03010626101",
            "name": "ស៊ឺន ស៊ីលីណា"
        },
        {
            "barcode": "171146671",
            "dpc": "03010626201",
            "name": "យឹម សេតដារ៉ា"
        },
        {
            "barcode": "171146672",
            "dpc": "03010626301",
            "name": "សោម សង្វាស័ក"
        },
        {
            "barcode": "171146673",
            "dpc": "03010624301",
            "name": "លី លន់"
        },
        {
            "barcode": "171146674",
            "dpc": "03010624501",
            "name": "នាក ណន"
        },
        {
            "barcode": "171146675",
            "dpc": "03010624401",
            "name": "គង់ ចិន្តា"
        },
        {
            "barcode": "171146676",
            "dpc": "03010619301",
            "name": "អៀ សុផាត"
        },
        {
            "barcode": "171146677",
            "dpc": "03010625901",
            "name": "សួន ឧត្តម"
        },
        {
            "barcode": "171146678",
            "dpc": "03010625601",
            "name": "ចៅ សៅ"
        },
        {
            "barcode": "171146679",
            "dpc": "03010625701",
            "name": "ចៅ ម៉ៅ"
        },
        {
            "barcode": "171146680",
            "dpc": "03010619201",
            "name": "ងន សំអុស"
        },
        {
            "barcode": "171146681",
            "dpc": "03010624601",
            "name": "នាក ណាន់"
        },
        {
            "barcode": "171146682",
            "dpc": "03010624801",
            "name": "ប៊ន សារឹម"
        },
        {
            "barcode": "171146683",
            "dpc": "03010624701",
            "name": "យស់ សម្បត្តិ"
        },
        {
            "barcode": "171146684",
            "dpc": "03010624901",
            "name": "សេត ប្រិយ"
        },
        {
            "barcode": "171146685",
            "dpc": "03010625001",
            "name": "សែន សុភ័ណ្ឌ"
        },
        {
            "barcode": "171146686",
            "dpc": "03010625101",
            "name": "សន ប៊ុនណា"
        },
        {
            "barcode": "171146687",
            "dpc": "03010625201",
            "name": "គិវ  គឹមហឿង"
        },
        {
            "barcode": "171146688",
            "dpc": "03010625301",
            "name": "ប៉ែន ហ៊ន"
        },
        {
            "barcode": "171146689",
            "dpc": "03010625501",
            "name": "ជិវ  គឹមសាន"
        },
        {
            "barcode": "171146690",
            "dpc": "03010615601",
            "name": "ចាន់ បុប្ផា"
        },
        {
            "barcode": "171146691",
            "dpc": "03010621001",
            "name": "សួន វុត្ថា"
        },
        {
            "barcode": "171146692",
            "dpc": "03010615501",
            "name": "ថាំង  សៀម"
        },
        {
            "barcode": "171146693",
            "dpc": "03010615401",
            "name": "ហុង  ស៊ីថា"
        },
        {
            "barcode": "171146694",
            "dpc": "03010632201",
            "name": "យូ ហយ"
        },
        {
            "barcode": "171146695",
            "dpc": "03010632101",
            "name": "តាំង ឈិនហ៊ួរ"
        },
        {
            "barcode": "171146696",
            "dpc": "03010628201",
            "name": "ទូត រ៉ុមម្ចាស់"
        },
        {
            "barcode": "171146697",
            "dpc": "03010628101",
            "name": "រ៉ុង គឹមស៊ាន"
        },
        {
            "barcode": "171146698",
            "dpc": "03010627801",
            "name": "ទីន ដារី"
        },
        {
            "barcode": "171146699",
            "dpc": "03010627901",
            "name": "លឹម វ៉ានណែត"
        },
        {
            "barcode": "171146700",
            "dpc": "03010627701",
            "name": "ង៉ោ ស៊ុនហេង"
        },
        {
            "barcode": "171146701",
            "dpc": "03010615901",
            "name": "ទន់ រឿ"
        },
        {
            "barcode": "171146702",
            "dpc": "03010616301",
            "name": "អៀម ផាន់ណា"
        },
        {
            "barcode": "171146703",
            "dpc": "03010616201",
            "name": "ភិន ប្រម"
        },
        {
            "barcode": "171146704",
            "dpc": "03010615701",
            "name": "សយ បូនិត"
        },
        {
            "barcode": "171146705",
            "dpc": "03010615801",
            "name": "កែវ ផានី"
        },
        {
            "barcode": "171146706",
            "dpc": "03010628401",
            "name": "សឿង សឿម"
        },
        {
            "barcode": "171146707",
            "dpc": "03010628901",
            "name": "សយ លីហេង"
        },
        {
            "barcode": "171146708",
            "dpc": "03010629101",
            "name": "បូ ហាក"
        },
        {
            "barcode": "171146709",
            "dpc": "03010629001",
            "name": "ហេង លឹមសេង"
        },
        {
            "barcode": "171146710",
            "dpc": "03010628701",
            "name": "អ៊ុន ដានី ១"
        },
        {
            "barcode": "171146711",
            "dpc": "03010628801",
            "name": "អ៊ុន សុធារី"
        },
        {
            "barcode": "171146712",
            "dpc": "03010628601",
            "name": "លឹម ស៊ាន"
        },
        {
            "barcode": "171146713",
            "dpc": "03010614401",
            "name": "វ៉ា ស៊ីថារ៉ុត"
        },
        {
            "barcode": "171146714",
            "dpc": "03010616501",
            "name": "ឈួន    សាវិន"
        },
        {
            "barcode": "171146715",
            "dpc": "03010629801",
            "name": "រូម  រុន"
        },
        {
            "barcode": "171146716",
            "dpc": "03010629701",
            "name": "ឡេង  ឃីម"
        },
        {
            "barcode": "171146717",
            "dpc": "03010629601",
            "name": "ស  គឹមប៉ាក"
        },
        {
            "barcode": "171146718",
            "dpc": "03010629401",
            "name": "កែវ  វិចិត្រ"
        },
        {
            "barcode": "171146719",
            "dpc": "03010629501",
            "name": "វ៉ាន  ស្រីពៅ"
        },
        {
            "barcode": "171146720",
            "dpc": "03010629201",
            "name": "លឹម ហុង"
        },
        {
            "barcode": "171146721",
            "dpc": "03010630201",
            "name": "សុខ ឈឿន"
        },
        {
            "barcode": "171146722",
            "dpc": "03010630101",
            "name": "ឡុង ផលគុណ"
        },
        {
            "barcode": "171146723",
            "dpc": "03010630001",
            "name": "វណ្ណ សុផល"
        },
        {
            "barcode": "171146724",
            "dpc": "03010631001",
            "name": "ផុន ចន្ត្រា"
        },
        {
            "barcode": "171146725",
            "dpc": "03010631101",
            "name": "សូ ភីយ៉ា"
        },
        {
            "barcode": "171146726",
            "dpc": "03010632001",
            "name": "ចាប លី"
        },
        {
            "barcode": "171146727",
            "dpc": "03010630801",
            "name": "សាង គឹមសាយ"
        },
        {
            "barcode": "171146728",
            "dpc": "03010630601",
            "name": "ពេជ្រ វណ្ណា ៣"
        },
        {
            "barcode": "171146729",
            "dpc": "03010630701",
            "name": "ពេជ្រ វណ្ណា ២"
        },
        {
            "barcode": "171146730",
            "dpc": "03010630501",
            "name": "តាំង គង់"
        },
        {
            "barcode": "171146731",
            "dpc": "03010630301",
            "name": "ឌី សុខលឹម"
        },
        {
            "barcode": "171146732",
            "dpc": "03010631401",
            "name": "យ៉ាន់ សម័យ"
        },
        {
            "barcode": "171146733",
            "dpc": "03010632501",
            "name": "ម៉ៅទឹម សុវណ្ណារិទ្ធ"
        },
        {
            "barcode": "171146734",
            "dpc": "03010632301",
            "name": "សួន បុប្ផា"
        },
        {
            "barcode": "171146735",
            "dpc": "03010631801",
            "name": "ជឿន ចិន្តា"
        },
        {
            "barcode": "171146736",
            "dpc": "03010632401",
            "name": "ចាន់ ញ៉ន"
        },
        {
            "barcode": "171146737",
            "dpc": "03010622901",
            "name": "ទៀប រី"
        },
        {
            "barcode": "171146738",
            "dpc": "03010623001",
            "name": "ការិ.ព្រហ្មទណ្ឌកំរិតស្រាល"
        },
        {
            "barcode": "171146739",
            "dpc": "03010623201",
            "name": "សឿន ម៉ាច"
        },
        {
            "barcode": "171146740",
            "dpc": "03010623301",
            "name": "អៀវ យ៉ា"
        },
        {
            "barcode": "171146741",
            "dpc": "03010623101",
            "name": "ម៉ែន សុភិន"
        },
        {
            "barcode": "171146742",
            "dpc": "03010622601",
            "name": "ស៊ីម ឡៃ"
        },
        {
            "barcode": "171146743",
            "dpc": "03010622301",
            "name": "ខឹម ស៊ីណាន"
        },
        {
            "barcode": "171146744",
            "dpc": "03010622401",
            "name": "នៅ នឿន"
        },
        {
            "barcode": "171146745",
            "dpc": "03010621701",
            "name": "ពុំ ចាន់"
        },
        {
            "barcode": "171146746",
            "dpc": "03010621501",
            "name": "តូយ ភន"
        },
        {
            "barcode": "171146747",
            "dpc": "03010621401",
            "name": "កើង សុខខេង"
        },
        {
            "barcode": "171146748",
            "dpc": "03010615201",
            "name": "ឈួម ពុធ"
        },
        {
            "barcode": "171146749",
            "dpc": "03010621801",
            "name": "ឈួម ឆយ"
        },
        {
            "barcode": "171146750",
            "dpc": "03010621901",
            "name": "ជា ដានី"
        },
        {
            "barcode": "171146751",
            "dpc": "03010615101",
            "name": "យ៉ែម យុន"
        },
        {
            "barcode": "171146752",
            "dpc": "03010633901",
            "name": "វ៉ែន លឿន"
        },
        {
            "barcode": "171146753",
            "dpc": "03010633801",
            "name": "គឹម កុយ"
        },
        {
            "barcode": "171146754",
            "dpc": "03010633701",
            "name": "ឈឹម វជិរ៉ា"
        },
        {
            "barcode": "171146755",
            "dpc": "03010633501",
            "name": "គី ឡែ"
        },
        {
            "barcode": "171146756",
            "dpc": "03010633601",
            "name": "ឆយ ជា"
        },
        {
            "barcode": "171146757",
            "dpc": "03010633401",
            "name": "ផឹក រឿន"
        },
        {
            "barcode": "171146758",
            "dpc": "03010633201",
            "name": "វង់ វី"
        },
        {
            "barcode": "171146759",
            "dpc": "03010633301",
            "name": "ប៉ោ ចន្ធី"
        },
        {
            "barcode": "171146760",
            "dpc": "03010632601",
            "name": "មៀច ផល្លី"
        },
        {
            "barcode": "171146761",
            "dpc": "03010632701",
            "name": "លួង ចាន់"
        },
        {
            "barcode": "171146762",
            "dpc": "03010623601",
            "name": "ជួន រិទ្ធី"
        },
        {
            "barcode": "171146763",
            "dpc": "03010623501",
            "name": "កុច ផន"
        },
        {
            "barcode": "171146764",
            "dpc": "03010623401",
            "name": "សៅ ថាច"
        },
        {
            "barcode": "171146765",
            "dpc": "03010623701",
            "name": "វ៉ាន់ ដារ៉ា"
        },
        {
            "barcode": "171146766",
            "dpc": "03010623801",
            "name": "សាលាហូប"
        },
        {
            "barcode": "171146767",
            "dpc": "03010623901",
            "name": "ខាន់ សុភាព"
        },
        {
            "barcode": "171146768",
            "dpc": "03010624001",
            "name": "សន សាន"
        },
        {
            "barcode": "171146769",
            "dpc": "03010624101",
            "name": "យឿន សំអ៊ុល"
        },
        {
            "barcode": "171146770",
            "dpc": "03010624201",
            "name": "សុខ លាងហ៊ាប"
        },
        {
            "barcode": "171146771",
            "dpc": "03010632901",
            "name": "លន់ រិទ្ធ"
        },
        {
            "barcode": "171146772",
            "dpc": "03010632801",
            "name": "ទី សុខុន"
        },
        {
            "barcode": "171146773",
            "dpc": "03010633101",
            "name": "ញ៉ែម  សុធា"
        },
        {
            "barcode": "171146774",
            "dpc": "03010633001",
            "name": "ពេញ ចាន់ដារ៉ា"
        },
        {
            "barcode": "171146775",
            "dpc": "03010614301",
            "name": "ហាច គឹមសុក"
        },
        {
            "barcode": "171146776",
            "dpc": "03010614501",
            "name": "ម៉ៅ វិញ"
        },
        {
            "barcode": "171146777",
            "dpc": "03010614601",
            "name": "ឆួ គឹមហ៊ី"
        },
        {
            "barcode": "171146778",
            "dpc": "03010614701",
            "name": "គុយ គឹមហេង"
        },
        {
            "barcode": "171146779",
            "dpc": "03010614801",
            "name": "សាំង សោផា"
        },
        {
            "barcode": "171146780",
            "dpc": "03010614901",
            "name": "សុខ ឆែម"
        },
        {
            "barcode": "171146781",
            "dpc": "03010616001",
            "name": "ស៊ូ  វ៉ាន់"
        },
        {
            "barcode": "171146782",
            "dpc": "03010616101",
            "name": "អ៊ុំ   សារិទ្ធ"
        },
        {
            "barcode": "171146783",
            "dpc": "03010616401",
            "name": "អួន  ឈឿប"
        },
        {
            "barcode": "171146784",
            "dpc": "03010616901",
            "name": "វី  លីហួង"
        },
        {
            "barcode": "171146785",
            "dpc": "03010617501",
            "name": "ម៉ែន  សុវណ្ណ"
        },
        {
            "barcode": "171146786",
            "dpc": "03010617901",
            "name": "អ៊ិត  សម្ផស្ស"
        },
        {
            "barcode": "171146787",
            "dpc": "03010620001",
            "name": "សោម  សារឿង"
        },
        {
            "barcode": "171146788",
            "dpc": "03010620801",
            "name": "ហ៊ីម  ចាន់ធី"
        },
        {
            "barcode": "171146789",
            "dpc": "03010620901",
            "name": "ផន  វី"
        },
        {
            "barcode": "171146790",
            "dpc": "03010621201",
            "name": "ប៉ោ  ចិន្តា"
        },
        {
            "barcode": "171146791",
            "dpc": "03010621601",
            "name": "ម៉ែន   ប៊ុនរឿន"
        },
        {
            "barcode": "171146792",
            "dpc": "03010622101",
            "name": "ធូ  ស៊ីពូន"
        },
        {
            "barcode": "171146793",
            "dpc": "03010622201",
            "name": "កេត   អ័កតីដេ"
        },
        {
            "barcode": "171146794",
            "dpc": "03010622801",
            "name": "ប៉ិន  យួម"
        },
        {
            "barcode": "171146795",
            "dpc": "03010628501",
            "name": "ឌុង  វិបុល"
        },
        {
            "barcode": "171146796",
            "dpc": "03010629301",
            "name": "ឃី   តិញ"
        },
        {
            "barcode": "171146797",
            "dpc": "03010630401",
            "name": "លឹម  ឃាង"
        },
        {
            "barcode": "171146798",
            "dpc": "03010630901",
            "name": "ឆាយ  គឹមហួ"
        },
        {
            "barcode": "171146799",
            "dpc": "03010631301",
            "name": "ទុយ  សូនី"
        },
        {
            "barcode": "171146800",
            "dpc": "03010631601",
            "name": "ផា  លឿម ផ.  ក.  ភ."
        },
        {
            "barcode": "171146801",
            "dpc": "03010634401",
            "name": "អ៊ី  ហួង"
        },
        {
            "barcode": "171146802",
            "dpc": "03010634101",
            "name": "ស៊ីន សុភ័ក្រ្ត"
        },
        {
            "barcode": "171146803",
            "dpc": "03010634201",
            "name": "ថង សាវដ្តី"
        },
        {
            "barcode": "171146804",
            "dpc": "03010634301",
            "name": "ភោក រិទ្ធា"
        },
        {
            "barcode": "171146805",
            "dpc": "03010636001",
            "name": "ឆឹង សេរីវឌ្ឍន៍"
        },
        {
            "barcode": "171146806",
            "dpc": "03010636201",
            "name": "ម៉ៅ សុវណ្ណរ៉ា"
        },
        {
            "barcode": "171146807",
            "dpc": "03010634701",
            "name": "ចាន ឃាង"
        },
        {
            "barcode": "171146808",
            "dpc": "03010634801",
            "name": "ភឹម ផុន"
        },
        {
            "barcode": "171146809",
            "dpc": "03010634601",
            "name": "ហឿង សារ៉ាត់"
        },
        {
            "barcode": "171146810",
            "dpc": "03010635901",
            "name": "យ៉ាំ ចាន់ចិត្រា"
        },
        {
            "barcode": "171146811",
            "dpc": "03010634901",
            "name": "វ៉ន ឃាង"
        },
        {
            "barcode": "171146812",
            "dpc": "03010635101",
            "name": "នុត ណាយ៉ុម"
        },
        {
            "barcode": "171146813",
            "dpc": "03010635301",
            "name": "ភា បញ្ញា"
        },
        {
            "barcode": "171146814",
            "dpc": "03010634501",
            "name": "ម៉េង សុខម៉ាន់"
        },
        {
            "barcode": "171146815",
            "dpc": "03010635701",
            "name": "អ៊ុយ គឹមឆៃ"
        },
        {
            "barcode": "171146816",
            "dpc": "03010635501",
            "name": "កែវ លីហ៊ុន"
        },
        {
            "barcode": "171146817",
            "dpc": "03010635201",
            "name": "តាក មករា"
        },
        {
            "barcode": "171146818",
            "dpc": "03010635001",
            "name": "អឿន អេង"
        },
        {
            "barcode": "171146819",
            "dpc": "03010635801",
            "name": "ប្រាក ឌីណា"
        },
        {
            "barcode": "171146820",
            "dpc": "03010635601",
            "name": "ហាក់ ចំរើន"
        },
        {
            "barcode": "171146821",
            "dpc": "03010643101",
            "name": "ផា រ៉ាវុធ"
        },
        {
            "barcode": "171146822",
            "dpc": "03010643201",
            "name": "ម៉ម ពៅ"
        },
        {
            "barcode": "171146823",
            "dpc": "03010643301",
            "name": "ជួប   ហាប់"
        },
        {
            "barcode": "171146824",
            "dpc": "03010639101",
            "name": "ហែម វន្ថា"
        },
        {
            "barcode": "171146825",
            "dpc": "03010640001",
            "name": "ថត រីណា"
        },
        {
            "barcode": "171146826",
            "dpc": "03010636301",
            "name": "រឹម សារឿន"
        },
        {
            "barcode": "171146827",
            "dpc": "03010636401",
            "name": "កង់  ចន្ថា"
        },
        {
            "barcode": "171146828",
            "dpc": "03010636501",
            "name": "សឺង ម៉ារិទ្ធ"
        },
        {
            "barcode": "171146829",
            "dpc": "03010636701",
            "name": "ហុង  ភីដា"
        },
        {
            "barcode": "171146830",
            "dpc": "03010636601",
            "name": "ទី គឹមហេង"
        },
        {
            "barcode": "171146831",
            "dpc": "03010636901",
            "name": "សយ សាភឿង"
        },
        {
            "barcode": "171146832",
            "dpc": "03010637201",
            "name": "ម៉ាន មារី"
        },
        {
            "barcode": "171146833",
            "dpc": "03010637101",
            "name": "សុខ ហាក"
        },
        {
            "barcode": "171146834",
            "dpc": "03010637001",
            "name": "ណុះ ម៉ាន់"
        },
        {
            "barcode": "171146835",
            "dpc": "03010637301",
            "name": "លី យូសុស"
        },
        {
            "barcode": "171146836",
            "dpc": "03010638401",
            "name": "ស៊ុន វន"
        },
        {
            "barcode": "171146837",
            "dpc": "03010638201",
            "name": "ឆឹង  ថន"
        },
        {
            "barcode": "171146838",
            "dpc": "03010638101",
            "name": "យុត សុភ័ណ្ឌ"
        },
        {
            "barcode": "171146839",
            "dpc": "03010637901",
            "name": "ឃួន ណាវី"
        },
        {
            "barcode": "171146840",
            "dpc": "03010638001",
            "name": "សៀង សុធឿន"
        },
        {
            "barcode": "171146841",
            "dpc": "03010638701",
            "name": "ម៉ាត់ ស្មាន់"
        },
        {
            "barcode": "171146842",
            "dpc": "03010637801",
            "name": "កែវ គឹមអេង"
        },
        {
            "barcode": "171146843",
            "dpc": "03010637701",
            "name": "តាំង ប៉េងហុង"
        },
        {
            "barcode": "171146844",
            "dpc": "03010637601",
            "name": "អ៊ូ ផល្លី"
        },
        {
            "barcode": "171146845",
            "dpc": "03010637501",
            "name": "ស៊ុម រៀម"
        },
        {
            "barcode": "171146846",
            "dpc": "03010639301",
            "name": "លឹម សុភា"
        },
        {
            "barcode": "171146847",
            "dpc": "03010639401",
            "name": "តាំង គឹមហេង"
        },
        {
            "barcode": "171146848",
            "dpc": "03010639501",
            "name": "យ៉ាំ ហាន់"
        },
        {
            "barcode": "171146849",
            "dpc": "03010638601",
            "name": "ផុន មករា"
        },
        {
            "barcode": "171146850",
            "dpc": "03010639601",
            "name": "អ៊ឹង ហួកឺ"
        },
        {
            "barcode": "171146851",
            "dpc": "03010639801",
            "name": "ចក ជូន ២"
        },
        {
            "barcode": "171146852",
            "dpc": "03010639701",
            "name": "ចក ណារ៉ង់ឌី"
        },
        {
            "barcode": "171146853",
            "dpc": "03010639901",
            "name": "ឥន សៅរិទ្ធ"
        },
        {
            "barcode": "171146854",
            "dpc": "03010640101",
            "name": "គឹម ផល្លា"
        },
        {
            "barcode": "171146855",
            "dpc": "03010640401",
            "name": "ខឹម ស្រីម៉ៅ"
        },
        {
            "barcode": "171146856",
            "dpc": "03010640301",
            "name": "ខឹម សុផល"
        },
        {
            "barcode": "171146857",
            "dpc": "03010640501",
            "name": "ខេង សុខុម"
        },
        {
            "barcode": "171146858",
            "dpc": "03010640201",
            "name": "ឆែម វិចិត្រ"
        },
        {
            "barcode": "171146859",
            "dpc": "03010644701",
            "name": "ឈុំ ហេង"
        },
        {
            "barcode": "171146860",
            "dpc": "03010644601",
            "name": "ណែល ផុន"
        },
        {
            "barcode": "171146861",
            "dpc": "03010644501",
            "name": "ប៊ុន រ័ត្ន"
        },
        {
            "barcode": "171146862",
            "dpc": "03010644401",
            "name": "ងួន បាន"
        },
        {
            "barcode": "171146863",
            "dpc": "03010644301",
            "name": "យ៉ុង ឆៃយុត"
        },
        {
            "barcode": "171146864",
            "dpc": "03010644201",
            "name": "យិន ស៊ូ"
        },
        {
            "barcode": "171146865",
            "dpc": "03010644101",
            "name": "សៀម ភក្តី"
        },
        {
            "barcode": "171146866",
            "dpc": "03010643901",
            "name": "ផា  សិលា"
        },
        {
            "barcode": "171146867",
            "dpc": "03010643701",
            "name": "ប៉េង ប៉ូរ៉ា"
        },
        {
            "barcode": "171146868",
            "dpc": "03010643801",
            "name": "អៀ ខេមរា"
        },
        {
            "barcode": "171146869",
            "dpc": "03010643501",
            "name": "សាង សាវុធ"
        },
        {
            "barcode": "171146870",
            "dpc": "03010643601",
            "name": "ឃឿង តាន់ ២"
        },
        {
            "barcode": "171146871",
            "dpc": "03010643401",
            "name": "ប៉ូ ពៅ"
        },
        {
            "barcode": "171146872",
            "dpc": "03010645001",
            "name": "សាញ់ សែម"
        },
        {
            "barcode": "171146873",
            "dpc": "03010644801",
            "name": "ម៉ា សារ៉ុម"
        },
        {
            "barcode": "171146874",
            "dpc": "03010645601",
            "name": "បូលី ងាន់"
        },
        {
            "barcode": "171146875",
            "dpc": "03010645501",
            "name": "សៅ សុខុម"
        },
        {
            "barcode": "171146876",
            "dpc": "03010645401",
            "name": "ម៉ែន សៀនូ"
        },
        {
            "barcode": "171146877",
            "dpc": "03010645301",
            "name": "ជេត វណ្ណី"
        },
        {
            "barcode": "171146878",
            "dpc": "03010645201",
            "name": "ម៉ៅ ឈឿន"
        },
        {
            "barcode": "171146879",
            "dpc": "03010646101",
            "name": "ប៉ុញ ឧត្តម"
        },
        {
            "barcode": "171146880",
            "dpc": "03010646001",
            "name": "ស ហេង"
        },
        {
            "barcode": "171146881",
            "dpc": "03010645801",
            "name": "ជឺ ហ៊ង"
        },
        {
            "barcode": "171146882",
            "dpc": "03010645701",
            "name": "មឿង វុត្ថា"
        },
        {
            "barcode": "171146883",
            "dpc": "03010646601",
            "name": "ខាត់ សារិន"
        },
        {
            "barcode": "171146884",
            "dpc": "03010646501",
            "name": "ពេជ្រ ចំរើន"
        },
        {
            "barcode": "171146885",
            "dpc": "03010646401",
            "name": "ឈឹម គឹមលាង"
        },
        {
            "barcode": "171146886",
            "dpc": "03010646301",
            "name": "ម៉ុត សារួន"
        },
        {
            "barcode": "171146887",
            "dpc": "03010646201",
            "name": "ជា ថាវ៉ាន់"
        },
        {
            "barcode": "171146888",
            "dpc": "03010608001",
            "name": "យិន ឆលីវណ្ណ"
        },
        {
            "barcode": "171146889",
            "dpc": "03010603201",
            "name": "សៀន សេន"
        },
        {
            "barcode": "171146890",
            "dpc": "03010603301",
            "name": "សាន់ សុផាន់ណា"
        },
        {
            "barcode": "171146891",
            "dpc": "03010603101",
            "name": "ហេង អៀន"
        },
        {
            "barcode": "171146892",
            "dpc": "03010611601",
            "name": "ជ័យ ម៉ៅ"
        },
        {
            "barcode": "171146893",
            "dpc": "03010611801",
            "name": "ផ្លុង  ឆៃ"
        },
        {
            "barcode": "171146894",
            "dpc": "03010611501",
            "name": "ភួង ផល្លា"
        },
        {
            "barcode": "171146895",
            "dpc": "03010611401",
            "name": "ផន  សឿន"
        },
        {
            "barcode": "171146896",
            "dpc": "03010611301",
            "name": "យក ហាក់"
        },
        {
            "barcode": "171146897",
            "dpc": "03010611101",
            "name": "សេង ឆៃ"
        },
        {
            "barcode": "171146898",
            "dpc": "03010611001",
            "name": "អ៊ុក សារិន"
        },
        {
            "barcode": "171146899",
            "dpc": "03010610901",
            "name": "រិន ហោ"
        },
        {
            "barcode": "171146900",
            "dpc": "03010610801",
            "name": "ភួង សម្បត្តិ"
        },
        {
            "barcode": "171146901",
            "dpc": "03010610301",
            "name": "ជិវ  គឹមសាន"
        },
        {
            "barcode": "171146902",
            "dpc": "03010610501",
            "name": "ឃួន ឃឿប"
        },
        {
            "barcode": "171146903",
            "dpc": "03010609801",
            "name": "ជុំ សំអឿន"
        },
        {
            "barcode": "171146904",
            "dpc": "03010608301",
            "name": "ជឹង ភ័ក្រត្រា"
        },
        {
            "barcode": "171146905",
            "dpc": "03010608201",
            "name": "លឹម ស៊ីថន"
        },
        {
            "barcode": "171146906",
            "dpc": "03010608101",
            "name": "ប៊ុន យាន"
        },
        {
            "barcode": "171146907",
            "dpc": "03010607901",
            "name": "ផាច់ ផូរ"
        },
        {
            "barcode": "171146908",
            "dpc": "03010607801",
            "name": "ជា ប៊ុនលៀង"
        },
        {
            "barcode": "171146909",
            "dpc": "03010607501",
            "name": "ប្រាក់ ឃុន"
        },
        {
            "barcode": "171146910",
            "dpc": "03010607701",
            "name": "នូរ ភន"
        },
        {
            "barcode": "171146911",
            "dpc": "03010607601",
            "name": "អូ ប៊ុននៀរ"
        },
        {
            "barcode": "171146912",
            "dpc": "03010607301",
            "name": "ហាស់ ភីណា"
        },
        {
            "barcode": "171146913",
            "dpc": "03010605101",
            "name": "ជិន យ៉ុម"
        },
        {
            "barcode": "171146914",
            "dpc": "03010609001",
            "name": "ហៃ សីហា"
        },
        {
            "barcode": "171146915",
            "dpc": "03010609101",
            "name": "សួន ហ៊ាន"
        },
        {
            "barcode": "171146916",
            "dpc": "03010609401",
            "name": "ឈៀង សំអាត"
        },
        {
            "barcode": "171146917",
            "dpc": "03010609501",
            "name": "អូច  សុផល"
        },
        {
            "barcode": "171146918",
            "dpc": "03010612001",
            "name": "ឈៀង  ស្រេង"
        },
        {
            "barcode": "171146919",
            "dpc": "03010611901",
            "name": "ដៀប  វណ្ណនី"
        },
        {
            "barcode": "171146920",
            "dpc": "03010613101",
            "name": "ជា សម្បត្តិ"
        },
        {
            "barcode": "171146921",
            "dpc": "03010613001",
            "name": "គង់ ឈួយ"
        },
        {
            "barcode": "171146922",
            "dpc": "03010612901",
            "name": "ឈឿន សេរីវុឌ្ឍ"
        },
        {
            "barcode": "171146923",
            "dpc": "03010612801",
            "name": "ឃឹម ង៉ុយ"
        },
        {
            "barcode": "171146924",
            "dpc": "03010612701",
            "name": "ប៉ូយ  លាភ"
        },
        {
            "barcode": "171146925",
            "dpc": "03010612601",
            "name": "ងិន  សារឿន"
        },
        {
            "barcode": "171146926",
            "dpc": "03010612501",
            "name": "សៀង  សារ៉ាត់"
        },
        {
            "barcode": "171146927",
            "dpc": "03010612301",
            "name": "ប្រាក់ ហេង"
        },
        {
            "barcode": "171146928",
            "dpc": "03010612101",
            "name": "គឹម  ង៉ោ"
        },
        {
            "barcode": "171146929",
            "dpc": "03010612201",
            "name": "ប្រាក់  ដាវី"
        },
        {
            "barcode": "171146930",
            "dpc": "03010609601",
            "name": "ស៊ីន ស៊ីន"
        },
        {
            "barcode": "171146931",
            "dpc": "03010608901",
            "name": "ហួត គឹមលី"
        },
        {
            "barcode": "171146932",
            "dpc": "03010609201",
            "name": "សេក វណ្ណឌី"
        },
        {
            "barcode": "171146933",
            "dpc": "03010609301",
            "name": "អេង ង៉ោ"
        },
        {
            "barcode": "171146934",
            "dpc": "03010605201",
            "name": "យស់ សុខន"
        },
        {
            "barcode": "171146935",
            "dpc": "03010605301",
            "name": "ទូច ស៊ីផាន់"
        },
        {
            "barcode": "171146936",
            "dpc": "03010605401",
            "name": "ជិន យ៉េន"
        },
        {
            "barcode": "171146937",
            "dpc": "03010605701",
            "name": "ប៉ាវ  ប៊ុនរឿង"
        },
        {
            "barcode": "171146938",
            "dpc": "03010605801",
            "name": "ម៉ីត  ស៊ីម"
        },
        {
            "barcode": "171146939",
            "dpc": "03010605901",
            "name": "កា  ស៊ាន"
        },
        {
            "barcode": "171146940",
            "dpc": "03010613501",
            "name": "តាំ លី"
        },
        {
            "barcode": "171146941",
            "dpc": "03010613401",
            "name": "សាយ យី"
        },
        {
            "barcode": "171146942",
            "dpc": "03010613201",
            "name": "ហៀង គឹមចេង"
        },
        {
            "barcode": "171146943",
            "dpc": "03010614201",
            "name": "សយ ធឿន"
        },
        {
            "barcode": "171146944",
            "dpc": "03010614101",
            "name": "ជួប លឿ"
        },
        {
            "barcode": "171146945",
            "dpc": "03010613901",
            "name": "អ៊ុក លន់"
        },
        {
            "barcode": "171146946",
            "dpc": "03010613801",
            "name": "សុខ សំអឿន"
        },
        {
            "barcode": "171146947",
            "dpc": "03010613701",
            "name": "វ៉ន សុវណ្ណ"
        },
        {
            "barcode": "171146948",
            "dpc": "03010614001",
            "name": "សាំង ប៊ុនថេន"
        },
        {
            "barcode": "171146949",
            "dpc": "03010613601",
            "name": "ដូង សំលេង"
        },
        {
            "barcode": "171146950",
            "dpc": "03010606001",
            "name": "សេង  ណៃ"
        },
        {
            "barcode": "171146951",
            "dpc": "03010602901",
            "name": "ឯម ទីណា"
        },
        {
            "barcode": "171146952",
            "dpc": "03010602801",
            "name": "នូ វណ្ណៈ"
        },
        {
            "barcode": "171146953",
            "dpc": "03010602701",
            "name": "គៀវ  បុប្ជា"
        },
        {
            "barcode": "171146954",
            "dpc": "03010602601",
            "name": "ទូច សាវី"
        },
        {
            "barcode": "171146955",
            "dpc": "03010602501",
            "name": "ម៉ម សុខាល័យ"
        },
        {
            "barcode": "171146956",
            "dpc": "03010602401",
            "name": "អរ រ៉ាន់"
        },
        {
            "barcode": "171146957",
            "dpc": "03010602201",
            "name": "គុយ សារៀន"
        },
        {
            "barcode": "171146958",
            "dpc": "03010602301",
            "name": "គុយ សារ៉េត"
        },
        {
            "barcode": "171146959",
            "dpc": "03010602101",
            "name": "ចាន់ យ៉ា"
        },
        {
            "barcode": "171146960",
            "dpc": "03010602001",
            "name": "ហ៊ុន ហៀន"
        },
        {
            "barcode": "171146961",
            "dpc": "03010601901",
            "name": "សៀក សាមឌី"
        },
        {
            "barcode": "171146962",
            "dpc": "03010601801",
            "name": "ជុំ មួន"
        },
        {
            "barcode": "171146963",
            "dpc": "03010601701",
            "name": "វ៉ា ផារិន"
        },
        {
            "barcode": "171146964",
            "dpc": "03010601501",
            "name": "ជួប សាប៉ុន"
        },
        {
            "barcode": "171146965",
            "dpc": "03010600601",
            "name": "ថុក កៀត"
        },
        {
            "barcode": "171146966",
            "dpc": "03010600201",
            "name": "សឺន  ដានី"
        },
        {
            "barcode": "171146967",
            "dpc": "03010600501",
            "name": "ផាន់ លក្ខិណា"
        },
        {
            "barcode": "171146968",
            "dpc": "03010600101",
            "name": "ឈួយ វង"
        },
        {
            "barcode": "171146969",
            "dpc": "03010601101",
            "name": "ហេង ឌីណា"
        },
        {
            "barcode": "171146970",
            "dpc": "03010600301",
            "name": "វៀង ជា"
        },
        {
            "barcode": "171146971",
            "dpc": "03010600801",
            "name": "ខឹម តាន់"
        },
        {
            "barcode": "171146972",
            "dpc": "03010601401",
            "name": "ប៉ោ លក្ខិណា"
        },
        {
            "barcode": "171146973",
            "dpc": "03010600901",
            "name": "ហួង ម៉ានី"
        },
        {
            "barcode": "171146974",
            "dpc": "03010601301",
            "name": "ប៉ោ នី"
        },
        {
            "barcode": "171146975",
            "dpc": "03010601001",
            "name": "ឃួន យាន"
        },
        {
            "barcode": "171146976",
            "dpc": "03010601201",
            "name": "ថាប់ ជួយ"
        },
        {
            "barcode": "171146977",
            "dpc": "03010603001",
            "name": "ប៉ូ  យឿន"
        },
        {
            "barcode": "171146978",
            "dpc": "03010600401",
            "name": "ស៊ុន យ៉ន"
        },
        {
            "barcode": "171146979",
            "dpc": "03010601601",
            "name": "កឺ  ស៊ុន"
        },
        {
            "barcode": "171146980",
            "dpc": "03010603401",
            "name": "សី សាខន"
        },
        {
            "barcode": "171146981",
            "dpc": "03010603501",
            "name": "ឆេង ហាប់"
        },
        {
            "barcode": "171146982",
            "dpc": "03010603601",
            "name": "ម៉ក មឿន"
        },
        {
            "barcode": "171146983",
            "dpc": "03010603701",
            "name": "ដន បាន"
        },
        {
            "barcode": "171146984",
            "dpc": "03010603801",
            "name": "សំ ពៅ"
        },
        {
            "barcode": "171146985",
            "dpc": "03010603901",
            "name": "តូច សូភី"
        },
        {
            "barcode": "171146986",
            "dpc": "03010604001",
            "name": "វ៉ាន់ ដាលីន"
        },
        {
            "barcode": "171146987",
            "dpc": "03010604101",
            "name": "សើ សាម៉េត"
        },
        {
            "barcode": "171146988",
            "dpc": "03010604201",
            "name": "ហា ជា"
        },
        {
            "barcode": "171146989",
            "dpc": "03010604301",
            "name": "ជុំ សុឃីម"
        },
        {
            "barcode": "171146990",
            "dpc": "03010604501",
            "name": "រ៉ូត រើន"
        },
        {
            "barcode": "171146991",
            "dpc": "03010604901",
            "name": "នាង សុខា"
        },
        {
            "barcode": "171146992",
            "dpc": "03010605001",
            "name": "ពុធ ឆេង"
        },
        {
            "barcode": "171146993",
            "dpc": "03010610201",
            "name": "រិន  មុន្នីវណ្ណ"
        },
        {
            "barcode": "171146994",
            "dpc": "03010610401",
            "name": "ជិវ  គឹមសាន"
        },
        {
            "barcode": "171146995",
            "dpc": "03010610101",
            "name": "ឈុំ ហេង"
        },
        {
            "barcode": "171146996",
            "dpc": "03010610001",
            "name": "ញ៉ាន គឹមនឿន"
        },
        {
            "barcode": "171146997",
            "dpc": "03010609901",
            "name": "ភាជ សំពណ៌"
        },
        {
            "barcode": "171146998",
            "dpc": "03010610601",
            "name": "ម៉ា សារុំ"
        },
        {
            "barcode": "171146999",
            "dpc": "03010608701",
            "name": "ឆោម ស៊ីម"
        },
        {
            "barcode": "171147000",
            "dpc": "03010608801",
            "name": "ផល រ៉ុម"
        },
        {
            "barcode": "171147001",
            "dpc": "03010608601",
            "name": "ទេព ម៉េងសួ"
        },
        {
            "barcode": "171147002",
            "dpc": "03010608401",
            "name": "ម៉ន សាវុន"
        },
        {
            "barcode": "171147003",
            "dpc": "03010608501",
            "name": "ផុន ដារ៉ារដ្ឋ"
        },
        {
            "barcode": "171147004",
            "dpc": "03010607401",
            "name": "ឈឿន សោ"
        },
        {
            "barcode": "171147005",
            "dpc": "03010607201",
            "name": "វ៉ាយ  យ៉ឹង"
        },
        {
            "barcode": "171147006",
            "dpc": "03010641901",
            "name": "កង់  ចានី"
        },
        {
            "barcode": "171147007",
            "dpc": "03010641801",
            "name": "សុខ  រីវីយ៉ា"
        },
        {
            "barcode": "171147008",
            "dpc": "03010642001",
            "name": "ស្រី  ចំរើន"
        },
        {
            "barcode": "171147009",
            "dpc": "03010642701",
            "name": "កាក់ សុម៉ាលី"
        },
        {
            "barcode": "171147010",
            "dpc": "03010641701",
            "name": "ទិត  ដា"
        },
        {
            "barcode": "171147011",
            "dpc": "03010641601",
            "name": "ផេង   សាលី"
        },
        {
            "barcode": "171147012",
            "dpc": "03010641501",
            "name": "អ៊ុន  ពៅស័កញ្ញា"
        },
        {
            "barcode": "171147013",
            "dpc": "03010642201",
            "name": "នាង  សារ៉ាត់"
        },
        {
            "barcode": "171147014",
            "dpc": "03010642101",
            "name": "អ៊ាន  ហាក់លី"
        },
        {
            "barcode": "171147015",
            "dpc": "03010640601",
            "name": "ធីម ហូរ"
        },
        {
            "barcode": "171147016",
            "dpc": "03010640701",
            "name": "វុធ សុផល"
        },
        {
            "barcode": "171147017",
            "dpc": "03010641001",
            "name": "ងួន ពៅចិន្តា"
        },
        {
            "barcode": "171147018",
            "dpc": "03010642401",
            "name": "សុខ យ៉ា"
        },
        {
            "barcode": "171147019",
            "dpc": "03010642601",
            "name": "ឌុក  ដារ៉ារិទ្ធ"
        },
        {
            "barcode": "171147020",
            "dpc": "03010643001",
            "name": "អៀង យ៉ានិត"
        },
        {
            "barcode": "171147021",
            "dpc": "03010642901",
            "name": "កាន ចោម"
        },
        {
            "barcode": "171147022",
            "dpc": "03010642301",
            "name": "ពេជ្រ ចន្ថា"
        },
        {
            "barcode": "171147023",
            "dpc": "03010641201",
            "name": "ឌា សឿម"
        },
        {
            "barcode": "171147024",
            "dpc": "03010641301",
            "name": "ព្រឿង សារុន"
        },
        {
            "barcode": "171147025",
            "dpc": "03010641101",
            "name": "កែវ សារ៉ន"
        },
        {
            "barcode": "171147026",
            "dpc": "03010638501",
            "name": "គឹម ហ៊ុន"
        },
        {
            "barcode": "171147027",
            "dpc": "03010638801",
            "name": "ព្រះវិហារជីវិតថ្មី"
        },
        {
            "barcode": "171147028",
            "dpc": "03010638901",
            "name": "ជេត  ណាត"
        },
        {
            "barcode": "171147029",
            "dpc": "03010639001",
            "name": "តាំង ឡៃ"
        },
        {
            "barcode": "171147030",
            "dpc": "03010637401",
            "name": "ឈួន  ចាន់ដាវី"
        },
        {
            "barcode": "171147031",
            "dpc": "03010638301",
            "name": "យាប់  មេត្តា"
        },
        {
            "barcode": "171147032",
            "dpc": "03010641401",
            "name": "ហែម  ចន្ធី"
        },
        {
            "barcode": "171147033",
            "dpc": "03010642501",
            "name": "ធៀម  នន"
        },
        {
            "barcode": "171147034",
            "dpc": "03010605501",
            "name": "អ៊ុន  សំអាត"
        },
        {
            "barcode": "171147035",
            "dpc": "03010611701",
            "name": "រីក  សុវណ្ណ"
        },
        {
            "barcode": "171147036",
            "dpc": "03010619501",
            "name": "ឡាំ  យាំង"
        },
        {
            "barcode": "171147037",
            "dpc": "03010622701",
            "name": "ណូ"
        },
        {
            "barcode": "171147038",
            "dpc": "03010628301",
            "name": "ប៊ុត  ទឺ"
        },
        {
            "barcode": "171147039",
            "dpc": "03010631201",
            "name": "វត្ត  បច្ឆា"
        },
        {
            "barcode": "171147040",
            "dpc": "03010631501",
            "name": "តុង  សុគុណ"
        },
        {
            "barcode": "171147041",
            "dpc": "03010631701",
            "name": "យូ  គឹមសេង"
        },
        {
            "barcode": "171147042",
            "dpc": "03010631901",
            "name": "គង់  សុលី"
        },
        {
            "barcode": "171147043",
            "dpc": "03010634001",
            "name": "កង  សុវណ្ណ"
        },
        {
            "barcode": "171147044",
            "dpc": "03010635401",
            "name": "ប្រាក់  តេះ"
        },
        {
            "barcode": "171147045",
            "dpc": "03010640801",
            "name": "ដាង  សុភា"
        },
        {
            "barcode": "171147046",
            "dpc": "03010640901",
            "name": "ម៉ី  សុផាន់ណារ៉ុង"
        },
        {
            "barcode": "171147047",
            "dpc": "03010647301",
            "name": "កេត ចាន់អូន"
        },
        {
            "barcode": "171147048",
            "dpc": "03010647401",
            "name": "ម៉ាង សុទ្ធ ២"
        },
        {
            "barcode": "171147049",
            "dpc": "03010647601",
            "name": "ប្រុក គឿន ២"
        },
        {
            "barcode": "171147050",
            "dpc": "03010647901",
            "name": "សូម សារ៉ាន់"
        },
        {
            "barcode": "171147051",
            "dpc": "03010647701",
            "name": "សាំង  ស៊ីណា"
        },
        {
            "barcode": "171147052",
            "dpc": "03010606501",
            "name": "សាត គឹមសាន្ត"
        },
        {
            "barcode": "171147053",
            "dpc": "03010606601",
            "name": "ទូច ស៊ីផាន់"
        },
        {
            "barcode": "171147054",
            "dpc": "03010606801",
            "name": "កែវ សេង"
        },
        {
            "barcode": "171147055",
            "dpc": "03010606901",
            "name": "លឹម សុភាព"
        },
        {
            "barcode": "171147056",
            "dpc": "03010607001",
            "name": "ធៀន ឡំ"
        },
        {
            "barcode": "171147057",
            "dpc": "03010646701",
            "name": "ពុល  សាង"
        },
        {
            "barcode": "171147058",
            "dpc": "03010646801",
            "name": "មួង ស៊ីផាន់"
        },
        {
            "barcode": "171147059",
            "dpc": "03010646901",
            "name": "ប៉ុក ប៊ុនធឿន"
        },
        {
            "barcode": "171147060",
            "dpc": "03010647001",
            "name": "អន សំអាត"
        },
        {
            "barcode": "171147061",
            "dpc": "03010647101",
            "name": "អ៊ូ សឿត"
        },
        {
            "barcode": "171147062",
            "dpc": "03010647201",
            "name": "សឿន ស៊ាត"
        },
        {
            "barcode": "171147063",
            "dpc": "03010606101",
            "name": "គឹម ម៉ារា"
        },
        {
            "barcode": "171147064",
            "dpc": "03010606201",
            "name": "ម៉ាច  មុយ"
        },
        {
            "barcode": "171147065",
            "dpc": "03010606301",
            "name": "ដាង  ឈុនលី"
        },
        {
            "barcode": "171147066",
            "dpc": "03010606401",
            "name": "អ៊ឹង ទឹត"
        },
        {
            "barcode": "171147067",
            "dpc": "03010604401",
            "name": "ដាន់  វុទ្ធី"
        },
        {
            "barcode": "171147068",
            "dpc": "03010604601",
            "name": "ថាញ់  យឿន"
        },
        {
            "barcode": "171147069",
            "dpc": "03010604701",
            "name": "ឡាំ   វ៉ាន់"
        },
        {
            "barcode": "171147070",
            "dpc": "03010607101",
            "name": "មណ្ឌលកុមារកំព្រា"
        },
        {
            "barcode": "171147071",
            "dpc": "03010648001",
            "name": "ផុន ស៊ីផាន"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
