let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171144344",
            "dpc": "03021048001",
            "name": "ហេង លីណា"
        },
        {
            "barcode": "171144345",
            "dpc": "03021044801",
            "name": "ជុំ  រោយ"
        },
        {
            "barcode": "171144346",
            "dpc": "03021044701",
            "name": "ចៅ  សម្បត្តិ"
        },
        {
            "barcode": "171144347",
            "dpc": "03021044601",
            "name": "ហ៊ិន  វ៉ាន់"
        },
        {
            "barcode": "171144348",
            "dpc": "03021044301",
            "name": "ជឿម  សេង"
        },
        {
            "barcode": "171144349",
            "dpc": "03021043901",
            "name": "ប៊ុន  ស្រីម៉ៅ"
        },
        {
            "barcode": "171144350",
            "dpc": "03021035301",
            "name": "ងិន   សួម"
        },
        {
            "barcode": "171144351",
            "dpc": "03021035001",
            "name": "ផល   មី"
        },
        {
            "barcode": "171144352",
            "dpc": "03021017101",
            "name": "មួយ សុង"
        },
        {
            "barcode": "171144353",
            "dpc": "03021017001",
            "name": "ឡោ ហៀង"
        },
        {
            "barcode": "171144354",
            "dpc": "03021016901",
            "name": "ផេង ភើយ"
        },
        {
            "barcode": "171144355",
            "dpc": "03021016801",
            "name": "ជ័យ ភី"
        },
        {
            "barcode": "171144356",
            "dpc": "03021016701",
            "name": "យឹម ភ័ណ្ឌ"
        },
        {
            "barcode": "171144357",
            "dpc": "03021016601",
            "name": "យឹម ឡៃ"
        },
        {
            "barcode": "171144358",
            "dpc": "03021016401",
            "name": "ទូច គឹមហេង"
        },
        {
            "barcode": "171144359",
            "dpc": "03021016301",
            "name": "មាស វ៉ាន់ណន"
        },
        {
            "barcode": "171144360",
            "dpc": "03021016201",
            "name": "គឹម លី"
        },
        {
            "barcode": "171144361",
            "dpc": "03021016101",
            "name": "គង់ ពៅ"
        },
        {
            "barcode": "171144362",
            "dpc": "03021016001",
            "name": "សេង ណាវី"
        },
        {
            "barcode": "171144363",
            "dpc": "03021015901",
            "name": "តាន់ អេង"
        },
        {
            "barcode": "171144364",
            "dpc": "03021015801",
            "name": "ឡេង វាសនា"
        },
        {
            "barcode": "171144365",
            "dpc": "03021015701",
            "name": "ខាត់ សារ៉េត"
        },
        {
            "barcode": "171144366",
            "dpc": "03021015601",
            "name": "សេង ហុង"
        },
        {
            "barcode": "171144367",
            "dpc": "03021015501",
            "name": "នូវ  កៀវ"
        },
        {
            "barcode": "171144368",
            "dpc": "03021015401",
            "name": "សាន់ សាម៉ន"
        },
        {
            "barcode": "171144369",
            "dpc": "03021015301",
            "name": "ម៉ែន សូរ"
        },
        {
            "barcode": "171144370",
            "dpc": "03021015201",
            "name": "ឡាយ កុសល់"
        },
        {
            "barcode": "171144371",
            "dpc": "03021015101",
            "name": "គុជ លី"
        },
        {
            "barcode": "171144372",
            "dpc": "03021015001",
            "name": "គង់ សាន"
        },
        {
            "barcode": "171144373",
            "dpc": "03021014901",
            "name": "សាវ រ៉ន"
        },
        {
            "barcode": "171144374",
            "dpc": "03021014801",
            "name": "ស្រី សាម៉េត"
        },
        {
            "barcode": "171144375",
            "dpc": "03021014701",
            "name": "ហាំង យូរ"
        },
        {
            "barcode": "171144376",
            "dpc": "03021014601",
            "name": "ឡុង ចន្ថា"
        },
        {
            "barcode": "171144377",
            "dpc": "03021014501",
            "name": "រឿប សាមឿត"
        },
        {
            "barcode": "171144378",
            "dpc": "03021014401",
            "name": "ស៊ឹម សុវណ្ណ"
        },
        {
            "barcode": "171144379",
            "dpc": "03021014301",
            "name": "ស្រី ហ៊ុច"
        },
        {
            "barcode": "171144380",
            "dpc": "03021014201",
            "name": "ហួត  ហ៊ន"
        },
        {
            "barcode": "171144381",
            "dpc": "03021014101",
            "name": "ឃួន វ៉ិច"
        },
        {
            "barcode": "171144382",
            "dpc": "03021014001",
            "name": "ម៉ក់ សុថេប"
        },
        {
            "barcode": "171144383",
            "dpc": "03021013901",
            "name": "ជឹម គឹមសៀង"
        },
        {
            "barcode": "171144384",
            "dpc": "03021013801",
            "name": "យ៉ង ធី"
        },
        {
            "barcode": "171144385",
            "dpc": "03021013701",
            "name": "ពេជ្រ ឡា"
        },
        {
            "barcode": "171144386",
            "dpc": "03021013601",
            "name": "ឆាយ ស៊ីណា"
        },
        {
            "barcode": "171144387",
            "dpc": "03021013501",
            "name": "អ៊ឹង ង៉ក់ហូរ"
        },
        {
            "barcode": "171144388",
            "dpc": "03021013401",
            "name": "អ៊ុក មុនី"
        },
        {
            "barcode": "171144389",
            "dpc": "03021013301",
            "name": "វឿង សែម"
        },
        {
            "barcode": "171144390",
            "dpc": "03021013201",
            "name": "ទុយ ផា"
        },
        {
            "barcode": "171144391",
            "dpc": "03021013101",
            "name": "សៅ សុខន"
        },
        {
            "barcode": "171144392",
            "dpc": "03021013001",
            "name": "ថុង គឹមហេង"
        },
        {
            "barcode": "171144393",
            "dpc": "03021012901",
            "name": "ភា ភាព"
        },
        {
            "barcode": "171144394",
            "dpc": "03021012801",
            "name": "ស៊ុន សិត"
        },
        {
            "barcode": "171144395",
            "dpc": "03021012701",
            "name": "សិទ្ធិ សារ៉ាយ"
        },
        {
            "barcode": "171144396",
            "dpc": "03021012601",
            "name": "ឡុង សាន"
        },
        {
            "barcode": "171144397",
            "dpc": "03021012501",
            "name": "យក់ វណ្ណឆវី ២"
        },
        {
            "barcode": "171144398",
            "dpc": "03021012401",
            "name": "គឹម សេង"
        },
        {
            "barcode": "171144399",
            "dpc": "03021012301",
            "name": "តាំង ស៊ូងួន"
        },
        {
            "barcode": "171144400",
            "dpc": "03021012201",
            "name": "ឡាយ គីម"
        },
        {
            "barcode": "171144401",
            "dpc": "03021012101",
            "name": "អ៊ឹង ម៉េងទី"
        },
        {
            "barcode": "171144402",
            "dpc": "03021011901",
            "name": "លី ឡុង"
        },
        {
            "barcode": "171144403",
            "dpc": "03021011801",
            "name": "ទិត្យ តែម"
        },
        {
            "barcode": "171144404",
            "dpc": "03021011701",
            "name": "ហែម លី"
        },
        {
            "barcode": "171144405",
            "dpc": "03021011601",
            "name": "តាំង ប៉ាក់ស្រេង"
        },
        {
            "barcode": "171144406",
            "dpc": "03021011501",
            "name": "គង់ ឆេង"
        },
        {
            "barcode": "171144407",
            "dpc": "03021011401",
            "name": "យក់ វណ្ណឆវី"
        },
        {
            "barcode": "171144408",
            "dpc": "03021011301",
            "name": "សៀង ប៊ុនធី"
        },
        {
            "barcode": "171144409",
            "dpc": "03021011201",
            "name": "អ៊ឹង រ៉ែកប៉ា"
        },
        {
            "barcode": "171144410",
            "dpc": "03021011101",
            "name": "គឹម ពេញ"
        },
        {
            "barcode": "171144411",
            "dpc": "03021011001",
            "name": "ប៉ោ ឯម"
        },
        {
            "barcode": "171144412",
            "dpc": "03021010901",
            "name": "ទួន ទ្រី"
        },
        {
            "barcode": "171144413",
            "dpc": "03021010801",
            "name": "ឡោ ឌៀន"
        },
        {
            "barcode": "171144414",
            "dpc": "03021010701",
            "name": "ឡោ ឌី"
        },
        {
            "barcode": "171144415",
            "dpc": "03021010601",
            "name": "ឆេង គឹមឆាយ"
        },
        {
            "barcode": "171144416",
            "dpc": "03021010501",
            "name": "អ៊ិន ណារ៉ុង"
        },
        {
            "barcode": "171144417",
            "dpc": "03021010401",
            "name": "ហោ ហួយ"
        },
        {
            "barcode": "171144418",
            "dpc": "03021010301",
            "name": "ឆ វិកុល"
        },
        {
            "barcode": "171144419",
            "dpc": "03021010201",
            "name": "សូរ ច័ន្ទសុគន្ធ"
        },
        {
            "barcode": "171144420",
            "dpc": "03021010101",
            "name": "មូល សុភី"
        },
        {
            "barcode": "171144421",
            "dpc": "03021010001",
            "name": "ប៊ិន ប៉ូច"
        },
        {
            "barcode": "171144422",
            "dpc": "03021009901",
            "name": "ឡុង ឡាយ"
        },
        {
            "barcode": "171144423",
            "dpc": "03021009801",
            "name": "ឈុន សៀក"
        },
        {
            "barcode": "171144424",
            "dpc": "03021009501",
            "name": "សៅ ភីណា"
        },
        {
            "barcode": "171144425",
            "dpc": "03021009401",
            "name": "ហង្ស គាន"
        },
        {
            "barcode": "171144426",
            "dpc": "03021009301",
            "name": "វ៉ាន់ គីរី"
        },
        {
            "barcode": "171144427",
            "dpc": "03021009201",
            "name": "អ៊ុក ផល្លា"
        },
        {
            "barcode": "171144428",
            "dpc": "03021009101",
            "name": "សយ វណ្ណី"
        },
        {
            "barcode": "171144429",
            "dpc": "03021009001",
            "name": "កែវ សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171144430",
            "dpc": "03021008901",
            "name": "កែវ ផៃរោត"
        },
        {
            "barcode": "171144431",
            "dpc": "03021008801",
            "name": "ជិង វ៉ាន់ស៊ី"
        },
        {
            "barcode": "171144432",
            "dpc": "03021008701",
            "name": "ខ្លូត សាង៉ែត"
        },
        {
            "barcode": "171144433",
            "dpc": "03021008501",
            "name": "អុំ វុន"
        },
        {
            "barcode": "171144434",
            "dpc": "03021008401",
            "name": "វៀច ហ៊ុន"
        },
        {
            "barcode": "171144435",
            "dpc": "03021008301",
            "name": "សុខ ទី"
        },
        {
            "barcode": "171144436",
            "dpc": "03021008201",
            "name": "ផូ ផុន"
        },
        {
            "barcode": "171144437",
            "dpc": "03021008001",
            "name": "គា ឆេង"
        },
        {
            "barcode": "171144438",
            "dpc": "03021007901",
            "name": "តាំង ទីគា"
        },
        {
            "barcode": "171144439",
            "dpc": "03021007801",
            "name": "ជាតិ ហុង"
        },
        {
            "barcode": "171144440",
            "dpc": "03021007701",
            "name": "រិន  ឡេង"
        },
        {
            "barcode": "171144441",
            "dpc": "03021007601",
            "name": "យ៉ុន ម៉ៅ"
        },
        {
            "barcode": "171144442",
            "dpc": "03021007501",
            "name": "តោ គង់"
        },
        {
            "barcode": "171144443",
            "dpc": "03021007401",
            "name": "និន សានិត"
        },
        {
            "barcode": "171144444",
            "dpc": "03021007301",
            "name": "លី ហុង"
        },
        {
            "barcode": "171144445",
            "dpc": "03021007201",
            "name": "សេង ពីវ"
        },
        {
            "barcode": "171144446",
            "dpc": "03021007101",
            "name": "សេង ទៀង"
        },
        {
            "barcode": "171144447",
            "dpc": "03021007001",
            "name": "ឆែ អ៊ាប"
        },
        {
            "barcode": "171144448",
            "dpc": "03021006901",
            "name": "អ៊ិត សុផល"
        },
        {
            "barcode": "171144449",
            "dpc": "03021006801",
            "name": "ហោ អ៊ូ"
        },
        {
            "barcode": "171144450",
            "dpc": "03021006701",
            "name": "ងួន លី"
        },
        {
            "barcode": "171144451",
            "dpc": "03021006601",
            "name": "តុង សារុន"
        },
        {
            "barcode": "171144452",
            "dpc": "03021006501",
            "name": "គឹម ចាន់លី"
        },
        {
            "barcode": "171144453",
            "dpc": "03021006401",
            "name": "ប្រាក់ សារ៉ូ"
        },
        {
            "barcode": "171144454",
            "dpc": "03021006301",
            "name": "លឹម សៀង"
        },
        {
            "barcode": "171144455",
            "dpc": "03021006201",
            "name": "អ៊ូច ចំណាន"
        },
        {
            "barcode": "171144456",
            "dpc": "03021006101",
            "name": "សុង ហេង"
        },
        {
            "barcode": "171144457",
            "dpc": "03021006001",
            "name": "ហេង ហៀង"
        },
        {
            "barcode": "171144458",
            "dpc": "03021005901",
            "name": "សៀក អូន"
        },
        {
            "barcode": "171144459",
            "dpc": "03021000401",
            "name": "យិន  ស៊ុនណារី"
        },
        {
            "barcode": "171144460",
            "dpc": "03021000501",
            "name": "បុត ផល្លី"
        },
        {
            "barcode": "171144461",
            "dpc": "03021000701",
            "name": "ប៉ិច ចាន់ធឿន"
        },
        {
            "barcode": "171144462",
            "dpc": "03021000801",
            "name": "សុខ សុជាតិ"
        },
        {
            "barcode": "171144463",
            "dpc": "03021000901",
            "name": "ឡុង ប៉េងសៀត"
        },
        {
            "barcode": "171144464",
            "dpc": "03021001001",
            "name": "សាយ ញឹប"
        },
        {
            "barcode": "171144465",
            "dpc": "03021001101",
            "name": "សេង ស៊្រុន"
        },
        {
            "barcode": "171144466",
            "dpc": "03021001201",
            "name": "ស្រេង សៀន"
        },
        {
            "barcode": "171144467",
            "dpc": "03021001601",
            "name": "ឈូ គា"
        },
        {
            "barcode": "171144468",
            "dpc": "03021001901",
            "name": "អាង អេងសួរ"
        },
        {
            "barcode": "171144469",
            "dpc": "03021002001",
            "name": "ម៉ក់ មិត្ត"
        },
        {
            "barcode": "171144470",
            "dpc": "03021002401",
            "name": "ហ្វង់ ឌ័រ"
        },
        {
            "barcode": "171144471",
            "dpc": "03021002601",
            "name": "ធា លីម"
        },
        {
            "barcode": "171144472",
            "dpc": "03021002201",
            "name": "សាយ ពេក"
        },
        {
            "barcode": "171144473",
            "dpc": "03021002101",
            "name": "អេង ធិន"
        },
        {
            "barcode": "171144474",
            "dpc": "03021001801",
            "name": "ឃួន គង់"
        },
        {
            "barcode": "171144475",
            "dpc": "03021001701",
            "name": "យូ រ៉ាណេ"
        },
        {
            "barcode": "171144476",
            "dpc": "03021001301",
            "name": "ស្រេង ងួន"
        },
        {
            "barcode": "171144477",
            "dpc": "03021005801",
            "name": "ស៊ីវ តិច"
        },
        {
            "barcode": "171144478",
            "dpc": "03021005701",
            "name": "ឡោ ម៉េងគង"
        },
        {
            "barcode": "171144479",
            "dpc": "03021005601",
            "name": "អ៊ិត សាវុធ"
        },
        {
            "barcode": "171144480",
            "dpc": "03021005501",
            "name": "យូ រ៉ានី"
        },
        {
            "barcode": "171144481",
            "dpc": "03021005401",
            "name": "ឆាយ សាមេត"
        },
        {
            "barcode": "171144482",
            "dpc": "03021005301",
            "name": "តា តោ"
        },
        {
            "barcode": "171144483",
            "dpc": "03021005201",
            "name": "សេក សារុន"
        },
        {
            "barcode": "171144484",
            "dpc": "03021005101",
            "name": "យិន កុឡាប"
        },
        {
            "barcode": "171144485",
            "dpc": "03021005001",
            "name": "ឡុង ជីវ"
        },
        {
            "barcode": "171144486",
            "dpc": "03021004901",
            "name": "ឡុង ហ៊ាង"
        },
        {
            "barcode": "171144487",
            "dpc": "03021004801",
            "name": "សោម ឡេង"
        },
        {
            "barcode": "171144488",
            "dpc": "03021004701",
            "name": "ពុយ សុជាតា"
        },
        {
            "barcode": "171144489",
            "dpc": "03021004501",
            "name": "គា ឡាយ"
        },
        {
            "barcode": "171144490",
            "dpc": "03021004401",
            "name": "សួន សុលី"
        },
        {
            "barcode": "171144491",
            "dpc": "03021004301",
            "name": "សុខ ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171144492",
            "dpc": "03021004201",
            "name": "ជាតិ ប៉ែត"
        },
        {
            "barcode": "171144493",
            "dpc": "03021004101",
            "name": "គឹម ណារី"
        },
        {
            "barcode": "171144494",
            "dpc": "03021004001",
            "name": "ទន់ សុផល"
        },
        {
            "barcode": "171144495",
            "dpc": "03021003901",
            "name": "ម៉ាន់ សុម៉ាលី"
        },
        {
            "barcode": "171144496",
            "dpc": "03021003801",
            "name": "រ៉េត ប៊ុនម៉ៅ"
        },
        {
            "barcode": "171144497",
            "dpc": "03021003701",
            "name": "គង់ ខេង"
        },
        {
            "barcode": "171144498",
            "dpc": "03021003601",
            "name": "យូ ហុង"
        },
        {
            "barcode": "171144499",
            "dpc": "03021003501",
            "name": "វែង ឡាយ"
        },
        {
            "barcode": "171144500",
            "dpc": "03021003401",
            "name": "ហេង ចេង"
        },
        {
            "barcode": "171144501",
            "dpc": "03021003301",
            "name": "ឈូ គា"
        },
        {
            "barcode": "171144502",
            "dpc": "03021003201",
            "name": "យូ ម៉េង"
        },
        {
            "barcode": "171144503",
            "dpc": "03021003101",
            "name": "សី តាំងអោ"
        },
        {
            "barcode": "171144504",
            "dpc": "03021003001",
            "name": "យស់ លីណា"
        },
        {
            "barcode": "171144505",
            "dpc": "03021002801",
            "name": "កាំង ឡេង"
        },
        {
            "barcode": "171144506",
            "dpc": "03021002501",
            "name": "តាំង ប៊ុនហោរ"
        },
        {
            "barcode": "171144507",
            "dpc": "03021002701",
            "name": "ប៊ុន ងិន"
        },
        {
            "barcode": "171144508",
            "dpc": "03021000301",
            "name": "ឌួង វុទ្ធី"
        },
        {
            "barcode": "171144509",
            "dpc": "03021000201",
            "name": "ហេង ឆៃវែង"
        },
        {
            "barcode": "171144510",
            "dpc": "03021000101",
            "name": "តាំង ពេជ្រ"
        },
        {
            "barcode": "171144511",
            "dpc": "03021038101",
            "name": "លឹម គឹមសុង"
        },
        {
            "barcode": "171144512",
            "dpc": "03021038001",
            "name": "ខៀវ សំអុល"
        },
        {
            "barcode": "171144513",
            "dpc": "03021037901",
            "name": "ហេង ប៊ុនលឿត"
        },
        {
            "barcode": "171144514",
            "dpc": "03021037801",
            "name": "ហូ ឡាវ"
        },
        {
            "barcode": "171144515",
            "dpc": "03021037701",
            "name": "ឈាន ប៊ុនហ៊ីម"
        },
        {
            "barcode": "171144516",
            "dpc": "03021037601",
            "name": "ឈាន ប៊ុនហាប់"
        },
        {
            "barcode": "171144517",
            "dpc": "03021037501",
            "name": "លឹម ប៉ិច ២"
        },
        {
            "barcode": "171144518",
            "dpc": "03021037401",
            "name": "ឈួន ឆៃលី"
        },
        {
            "barcode": "171144519",
            "dpc": "03021037301",
            "name": "គឿង ហុង ២"
        },
        {
            "barcode": "171144520",
            "dpc": "03021037201",
            "name": "គឿង ហុង ១"
        },
        {
            "barcode": "171144521",
            "dpc": "03021037101",
            "name": "គឹម ខេង"
        },
        {
            "barcode": "171144522",
            "dpc": "03021036301",
            "name": "សោម អូន"
        },
        {
            "barcode": "171144523",
            "dpc": "03021036401",
            "name": "សោម សុវត្តិ"
        },
        {
            "barcode": "171144524",
            "dpc": "03021036501",
            "name": "មាស សារ៉េត"
        },
        {
            "barcode": "171144525",
            "dpc": "03021036601",
            "name": "ខែម ភីរម្យ"
        },
        {
            "barcode": "171144526",
            "dpc": "03021036701",
            "name": "ស៊  គឹមហាក់"
        },
        {
            "barcode": "171144527",
            "dpc": "03021036801",
            "name": "សោម សិទ្ធគុណ"
        },
        {
            "barcode": "171144528",
            "dpc": "03021036901",
            "name": "សោម សុធា"
        },
        {
            "barcode": "171144529",
            "dpc": "03021037001",
            "name": "ឃិន សូរិយា"
        },
        {
            "barcode": "171144530",
            "dpc": "03021036101",
            "name": "លាង ហ៊ាង"
        },
        {
            "barcode": "171144531",
            "dpc": "03021035901",
            "name": "អេង ខេង"
        },
        {
            "barcode": "171144532",
            "dpc": "03021035601",
            "name": "សុង គា"
        },
        {
            "barcode": "171144533",
            "dpc": "03021035501",
            "name": "គឹម ហេង"
        },
        {
            "barcode": "171144534",
            "dpc": "03021035401",
            "name": "ផេង អេង"
        },
        {
            "barcode": "171144535",
            "dpc": "03021035801",
            "name": "ដៀប ចិន្តា"
        },
        {
            "barcode": "171144536",
            "dpc": "03021035701",
            "name": "ដៀប កែវមុន្នី"
        },
        {
            "barcode": "171144537",
            "dpc": "03021035201",
            "name": "អ៊ិត ឆម"
        },
        {
            "barcode": "171144538",
            "dpc": "03021035101",
            "name": "លឿង ធីលី"
        },
        {
            "barcode": "171144539",
            "dpc": "03021034701",
            "name": "ទូច សារ៉ន"
        },
        {
            "barcode": "171144540",
            "dpc": "03021034601",
            "name": "ទេស សុផាត"
        },
        {
            "barcode": "171144541",
            "dpc": "03021034501",
            "name": "ព្រួញ វល័ក្ខ"
        },
        {
            "barcode": "171144542",
            "dpc": "03021034401",
            "name": "កើង ស៊ីណែត"
        },
        {
            "barcode": "171144543",
            "dpc": "03021034301",
            "name": "កែម វង្ស"
        },
        {
            "barcode": "171144544",
            "dpc": "03021034201",
            "name": "ពន សារឿន"
        },
        {
            "barcode": "171144545",
            "dpc": "03021034101",
            "name": "ឆាយ ស៊ីណា"
        },
        {
            "barcode": "171144546",
            "dpc": "03021034001",
            "name": "ចាន់ ស្រីមុំ"
        },
        {
            "barcode": "171144547",
            "dpc": "03021033901",
            "name": "សែម សុំ"
        },
        {
            "barcode": "171144548",
            "dpc": "03021033801",
            "name": "ឡោ ស៊ីណយ"
        },
        {
            "barcode": "171144549",
            "dpc": "03021033701",
            "name": "ហែម ផល្លី"
        },
        {
            "barcode": "171144550",
            "dpc": "03021033601",
            "name": "សេង សៀន"
        },
        {
            "barcode": "171144551",
            "dpc": "03021033501",
            "name": "ចាន់ សារី"
        },
        {
            "barcode": "171144552",
            "dpc": "03021033401",
            "name": "ឆាយ សុភាព"
        },
        {
            "barcode": "171144553",
            "dpc": "03021033101",
            "name": "យាន  បូរិន"
        },
        {
            "barcode": "171144554",
            "dpc": "03021033001",
            "name": "គុជ ជ័រ ១"
        },
        {
            "barcode": "171144555",
            "dpc": "03021032901",
            "name": "ភឹង ផាសិទ្ធ"
        },
        {
            "barcode": "171144556",
            "dpc": "03021032801",
            "name": "គង់ សាន់"
        },
        {
            "barcode": "171144557",
            "dpc": "03021032701",
            "name": "វ៉ាន់ ចាន់នី"
        },
        {
            "barcode": "171144558",
            "dpc": "03021032601",
            "name": "អ៊ុង សារុំ"
        },
        {
            "barcode": "171144559",
            "dpc": "03021031901",
            "name": "ទុយ ចិន្តា"
        },
        {
            "barcode": "171144560",
            "dpc": "03021032501",
            "name": "អ៊ុង ជឿន"
        },
        {
            "barcode": "171144561",
            "dpc": "03021032401",
            "name": "ព្រំ វិបុល"
        },
        {
            "barcode": "171144562",
            "dpc": "03021032301",
            "name": "ស៊ីម សាម៉ន"
        },
        {
            "barcode": "171144563",
            "dpc": "03021032101",
            "name": "ហុត សុភាព"
        },
        {
            "barcode": "171144564",
            "dpc": "03021032001",
            "name": "ម៉ៅ សាវ៉ាត"
        },
        {
            "barcode": "171144565",
            "dpc": "03021031801",
            "name": "ដួង សារឿន"
        },
        {
            "barcode": "171144566",
            "dpc": "03021031601",
            "name": "កើង ភឿង"
        },
        {
            "barcode": "171144567",
            "dpc": "03021031401",
            "name": "ហួត វ៉ាន់ថន"
        },
        {
            "barcode": "171144568",
            "dpc": "03021031301",
            "name": "ចាន់ គឹមឡេង"
        },
        {
            "barcode": "171144569",
            "dpc": "03021031201",
            "name": "ជុំ សារ៉ា"
        },
        {
            "barcode": "171144570",
            "dpc": "03021031101",
            "name": "យ៉ាំ វុទ្ធានី"
        },
        {
            "barcode": "171144571",
            "dpc": "03021030901",
            "name": "ម៉ក់ ឆៃរិទ្ធ"
        },
        {
            "barcode": "171144572",
            "dpc": "03021030801",
            "name": "ចាន់ មៀន"
        },
        {
            "barcode": "171144573",
            "dpc": "03021030701",
            "name": "ហាំង ឡេង"
        },
        {
            "barcode": "171144574",
            "dpc": "03021030601",
            "name": "ព្រំ ភួង"
        },
        {
            "barcode": "171144575",
            "dpc": "03021030501",
            "name": "សឿន ស៊ីថា"
        },
        {
            "barcode": "171144576",
            "dpc": "03021030401",
            "name": "ផាន់ អ៊ឹសេរី"
        },
        {
            "barcode": "171144577",
            "dpc": "03021030301",
            "name": "មិន ណី"
        },
        {
            "barcode": "171144578",
            "dpc": "03021030201",
            "name": "ម៉ាត់ ឯល"
        },
        {
            "barcode": "171144579",
            "dpc": "03021030101",
            "name": "លឹម លី"
        },
        {
            "barcode": "171144580",
            "dpc": "03021030001",
            "name": "សុខ ញ៉"
        },
        {
            "barcode": "171144581",
            "dpc": "03021029901",
            "name": "ខោ វិរៈ"
        },
        {
            "barcode": "171144582",
            "dpc": "03021029801",
            "name": "ពិន សាន"
        },
        {
            "barcode": "171144583",
            "dpc": "03021029701",
            "name": "ពឹង ថៃហេង"
        },
        {
            "barcode": "171144584",
            "dpc": "03021029501",
            "name": "អៀង សុកខន"
        },
        {
            "barcode": "171144585",
            "dpc": "03021029601",
            "name": "អឿង  ជឿន"
        },
        {
            "barcode": "171144586",
            "dpc": "03021044401",
            "name": "យុន   រ៉ាអ៊ូល"
        },
        {
            "barcode": "171144587",
            "dpc": "03021034901",
            "name": "អឿន ប៊ុនថុល"
        },
        {
            "barcode": "171144588",
            "dpc": "03021034801",
            "name": "អ៊ឹម ផាត់"
        },
        {
            "barcode": "171144589",
            "dpc": "03021023501",
            "name": "គង់ សុភ័ណ្ឌ"
        },
        {
            "barcode": "171144590",
            "dpc": "03021019101",
            "name": "កៃ  សុខុម"
        },
        {
            "barcode": "171144591",
            "dpc": "03021029401",
            "name": "លី សានផូ"
        },
        {
            "barcode": "171144592",
            "dpc": "03021029301",
            "name": "សំ ឡេង"
        },
        {
            "barcode": "171144593",
            "dpc": "03021029201",
            "name": "សួន ឃឿន"
        },
        {
            "barcode": "171144594",
            "dpc": "03021029101",
            "name": "សាន លួន"
        },
        {
            "barcode": "171144595",
            "dpc": "03021029001",
            "name": "លីវ ហ៊ួរ"
        },
        {
            "barcode": "171144596",
            "dpc": "03021028901",
            "name": "ជា ផូ"
        },
        {
            "barcode": "171144597",
            "dpc": "03021028801",
            "name": "អ៊ុយ ឈាន"
        },
        {
            "barcode": "171144598",
            "dpc": "03021028701",
            "name": "អាប់ ម៉ាប់"
        },
        {
            "barcode": "171144599",
            "dpc": "03021028601",
            "name": "គេវ ទៀង"
        },
        {
            "barcode": "171144600",
            "dpc": "03021028501",
            "name": "មេត សាមីត"
        },
        {
            "barcode": "171144601",
            "dpc": "03021028401",
            "name": "សៀង គាង"
        },
        {
            "barcode": "171144602",
            "dpc": "03021028301",
            "name": "អ៊ី ធិន"
        },
        {
            "barcode": "171144603",
            "dpc": "03021028201",
            "name": "ហៀម គ្រៃ"
        },
        {
            "barcode": "171144604",
            "dpc": "03021028101",
            "name": "វ៉ាន់ រីម"
        },
        {
            "barcode": "171144605",
            "dpc": "03021028001",
            "name": "ហូ រចនា"
        },
        {
            "barcode": "171144606",
            "dpc": "03021027801",
            "name": "សុខ ហេង"
        },
        {
            "barcode": "171144607",
            "dpc": "03021027701",
            "name": "គឹម ឃោ"
        },
        {
            "barcode": "171144608",
            "dpc": "03021027401",
            "name": "មៀវ គឹមហ៊ួរ"
        },
        {
            "barcode": "171144609",
            "dpc": "03021027301",
            "name": "មៀវ សុងនី"
        },
        {
            "barcode": "171144610",
            "dpc": "03021027201",
            "name": "កុង ស៊ីវ"
        },
        {
            "barcode": "171144611",
            "dpc": "03021027001",
            "name": "ចាន់ ថាវី"
        },
        {
            "barcode": "171144612",
            "dpc": "03021027101",
            "name": "ឃួន ហួយលាង"
        },
        {
            "barcode": "171144613",
            "dpc": "03021026101",
            "name": "មៀច ឈាន"
        },
        {
            "barcode": "171144614",
            "dpc": "03021026201",
            "name": "ប៊ុត សារ៉េត"
        },
        {
            "barcode": "171144615",
            "dpc": "03021026901",
            "name": "ឡាយ រិទ្ធវង្ស"
        },
        {
            "barcode": "171144616",
            "dpc": "03021026801",
            "name": "អៀម សុធា"
        },
        {
            "barcode": "171144617",
            "dpc": "03021026701",
            "name": "ម៉ៅ ឡង់"
        },
        {
            "barcode": "171144618",
            "dpc": "03021026601",
            "name": "ឡឹម វ៉ាន់នី"
        },
        {
            "barcode": "171144619",
            "dpc": "03021026501",
            "name": "ម៉ាត់ សុខគ្រី"
        },
        {
            "barcode": "171144620",
            "dpc": "03021026401",
            "name": "តៅ លី"
        },
        {
            "barcode": "171144621",
            "dpc": "03021026301",
            "name": "វិន ស៊ាប"
        },
        {
            "barcode": "171144622",
            "dpc": "03021026001",
            "name": "សុខ សីរីវឌ្ឍនា"
        },
        {
            "barcode": "171144623",
            "dpc": "03021025901",
            "name": "អៀង សិលា"
        },
        {
            "barcode": "171144624",
            "dpc": "03021025801",
            "name": "ឡាវ ថៃ"
        },
        {
            "barcode": "171144625",
            "dpc": "03021046601",
            "name": "វ័រ សោភ័ណ្ឌ"
        },
        {
            "barcode": "171144626",
            "dpc": "03021045301",
            "name": "ញ៉ា វុទ្ធី"
        },
        {
            "barcode": "171144627",
            "dpc": "03021045401",
            "name": "សុខ ឈឿន"
        },
        {
            "barcode": "171144628",
            "dpc": "03021045501",
            "name": "កិម  ខាន"
        },
        {
            "barcode": "171144629",
            "dpc": "03021045601",
            "name": "សួស ប៉ិច"
        },
        {
            "barcode": "171144630",
            "dpc": "03021045701",
            "name": "ភោគ ថន"
        },
        {
            "barcode": "171144631",
            "dpc": "03021045801",
            "name": "គឺម   ចន្ថា"
        },
        {
            "barcode": "171144632",
            "dpc": "03021045901",
            "name": "ថោង គឹមលាន"
        },
        {
            "barcode": "171144633",
            "dpc": "03021046001",
            "name": "ប៊ុន ណាន"
        },
        {
            "barcode": "171144634",
            "dpc": "03021046101",
            "name": "កៅ សេក"
        },
        {
            "barcode": "171144635",
            "dpc": "03021046201",
            "name": "មាស សាឯម"
        },
        {
            "barcode": "171144636",
            "dpc": "03021046301",
            "name": "ភី ស៊ីនួន"
        },
        {
            "barcode": "171144637",
            "dpc": "03021046401",
            "name": "សុខ ហៀង"
        },
        {
            "barcode": "171144638",
            "dpc": "03021046501",
            "name": "វង្ស រ៉ាវី"
        },
        {
            "barcode": "171144639",
            "dpc": "03021046701",
            "name": "អាន រ៉េត"
        },
        {
            "barcode": "171144640",
            "dpc": "03021046801",
            "name": "អ៊ិន ឆុន"
        },
        {
            "barcode": "171144641",
            "dpc": "03021044101",
            "name": "ប៊ិន សាវ៉ាត់"
        },
        {
            "barcode": "171144642",
            "dpc": "03021044201",
            "name": "អៅ តុង"
        },
        {
            "barcode": "171144643",
            "dpc": "03021044501",
            "name": "គឹម លាង"
        },
        {
            "barcode": "171144644",
            "dpc": "03021044901",
            "name": "អ៊ុក ប៊ុនរ៉ាស៊ី"
        },
        {
            "barcode": "171144645",
            "dpc": "03021045101",
            "name": "ប៉ិច ឌឿន"
        },
        {
            "barcode": "171144646",
            "dpc": "03021045201",
            "name": "អ៊ឹម ឈុន"
        },
        {
            "barcode": "171144647",
            "dpc": "03021046901",
            "name": "ម៉ាន់ ឃៀង ១"
        },
        {
            "barcode": "171144648",
            "dpc": "03021047001",
            "name": "សេក សុន"
        },
        {
            "barcode": "171144649",
            "dpc": "03021047101",
            "name": "សេក សុនរ៉ាវី"
        },
        {
            "barcode": "171144650",
            "dpc": "03021047201",
            "name": "ម៉ាន់ ឃៀង ២"
        },
        {
            "barcode": "171144651",
            "dpc": "03021047401",
            "name": "ឡោ វ៉ា"
        },
        {
            "barcode": "171144652",
            "dpc": "03021047301",
            "name": "ឡាច ម៉ាន់"
        },
        {
            "barcode": "171144653",
            "dpc": "03021047501",
            "name": "ឈួន ឆែម"
        },
        {
            "barcode": "171144654",
            "dpc": "03021047601",
            "name": "ហេង រដ្ឋា"
        },
        {
            "barcode": "171144655",
            "dpc": "03021047901",
            "name": "អ៊ុក ចាន់ម៉ាលី ២"
        },
        {
            "barcode": "171144656",
            "dpc": "03021044001",
            "name": "តំ  សុផល"
        },
        {
            "barcode": "171144657",
            "dpc": "03021043801",
            "name": "ជុំ សុខុន"
        },
        {
            "barcode": "171144658",
            "dpc": "03021043701",
            "name": "រី សារ៉េត"
        },
        {
            "barcode": "171144659",
            "dpc": "03021043601",
            "name": "ថោ សាន"
        },
        {
            "barcode": "171144660",
            "dpc": "03021043501",
            "name": "ឆន ប៊ុនឈឿន"
        },
        {
            "barcode": "171144661",
            "dpc": "03021043301",
            "name": "ហ៊ុន សាន"
        },
        {
            "barcode": "171144662",
            "dpc": "03021043201",
            "name": "ឈាង ង៉ែត"
        },
        {
            "barcode": "171144663",
            "dpc": "03021043101",
            "name": "ម៉ែន ហម"
        },
        {
            "barcode": "171144664",
            "dpc": "03021043001",
            "name": "ខេង សុខុន"
        },
        {
            "barcode": "171144665",
            "dpc": "03021042901",
            "name": "កិម  ឈឿន"
        },
        {
            "barcode": "171144666",
            "dpc": "03021042801",
            "name": "ផាន់ ចាន់សេរី"
        },
        {
            "barcode": "171144667",
            "dpc": "03021042701",
            "name": "កឹម  ធា"
        },
        {
            "barcode": "171144668",
            "dpc": "03021042601",
            "name": "បាន នី"
        },
        {
            "barcode": "171144669",
            "dpc": "03021042501",
            "name": "វ៉ាន់ ស៊ឹមវ៉ា"
        },
        {
            "barcode": "171144670",
            "dpc": "03021042401",
            "name": "ផាន់ វីរៈពង្ស"
        },
        {
            "barcode": "171144671",
            "dpc": "03021042301",
            "name": "ណាប់ ឈន"
        },
        {
            "barcode": "171144672",
            "dpc": "03021042201",
            "name": "សាត សាលី"
        },
        {
            "barcode": "171144673",
            "dpc": "03021042101",
            "name": "កុយ គីម"
        },
        {
            "barcode": "171144674",
            "dpc": "03021042001",
            "name": "ហុង សុខន"
        },
        {
            "barcode": "171144675",
            "dpc": "03021041901",
            "name": "ហ៊ុន សាន"
        },
        {
            "barcode": "171144676",
            "dpc": "03021041801",
            "name": "កុយ សាម៉ន"
        },
        {
            "barcode": "171144677",
            "dpc": "03021041701",
            "name": "លេ តាល់"
        },
        {
            "barcode": "171144678",
            "dpc": "03021041601",
            "name": "ស្រី ឈឿន"
        },
        {
            "barcode": "171144679",
            "dpc": "03021041501",
            "name": "ជិន បូរ៉ា"
        },
        {
            "barcode": "171144680",
            "dpc": "03021041401",
            "name": "សោម វណ្ណី"
        },
        {
            "barcode": "171144681",
            "dpc": "03021041301",
            "name": "កុយ ធីតា"
        },
        {
            "barcode": "171144682",
            "dpc": "03021041201",
            "name": "ញ៉ែម សុខចាន់"
        },
        {
            "barcode": "171144683",
            "dpc": "03021041101",
            "name": "ទេស សារុន"
        },
        {
            "barcode": "171144684",
            "dpc": "03021041001",
            "name": "ឆន ហុង"
        },
        {
            "barcode": "171144685",
            "dpc": "03021040901",
            "name": "ទឹង អាង"
        },
        {
            "barcode": "171144686",
            "dpc": "03021040801",
            "name": "នៅ ដារីទ្ធ"
        },
        {
            "barcode": "171144687",
            "dpc": "03021040701",
            "name": "អៀង យិត"
        },
        {
            "barcode": "171144688",
            "dpc": "03021040601",
            "name": "អ៊ុក ហន"
        },
        {
            "barcode": "171144689",
            "dpc": "03021040501",
            "name": "ទឹង សំបូរ"
        },
        {
            "barcode": "171144690",
            "dpc": "03021040401",
            "name": "ភេក ជារៈ"
        },
        {
            "barcode": "171144691",
            "dpc": "03021040201",
            "name": "អៀង សុភី"
        },
        {
            "barcode": "171144692",
            "dpc": "03021040101",
            "name": "លី ហុង"
        },
        {
            "barcode": "171144693",
            "dpc": "03021040001",
            "name": "សៅ សាម៉ុន"
        },
        {
            "barcode": "171144694",
            "dpc": "03021039901",
            "name": "ឌុក សូដា"
        },
        {
            "barcode": "171144695",
            "dpc": "03021039801",
            "name": "ញឹក  សុខាន"
        },
        {
            "barcode": "171144696",
            "dpc": "03021039601",
            "name": "ប៉ាង សាវ៉ាត"
        },
        {
            "barcode": "171144697",
            "dpc": "03021039501",
            "name": "ទេព សារ៉ាត់"
        },
        {
            "barcode": "171144698",
            "dpc": "03021039401",
            "name": "ឆេង សំអាត"
        },
        {
            "barcode": "171144699",
            "dpc": "03021039301",
            "name": "ដួង គន្ធា"
        },
        {
            "barcode": "171144700",
            "dpc": "03021039201",
            "name": "រួន សឿន"
        },
        {
            "barcode": "171144701",
            "dpc": "03021039101",
            "name": "សំ គឹមជុយ"
        },
        {
            "barcode": "171144702",
            "dpc": "03021039001",
            "name": "ឃឹម លាង"
        },
        {
            "barcode": "171144703",
            "dpc": "03021038901",
            "name": "ឃឹម ហុក"
        },
        {
            "barcode": "171144704",
            "dpc": "03021038701",
            "name": "ញឹម  គន្ធា"
        },
        {
            "barcode": "171144705",
            "dpc": "03021038601",
            "name": "ឡុង បូរី"
        },
        {
            "barcode": "171144706",
            "dpc": "03021038501",
            "name": "ចាន់ សារុំ"
        },
        {
            "barcode": "171144707",
            "dpc": "03021038401",
            "name": "ធូ ភី"
        },
        {
            "barcode": "171144708",
            "dpc": "03021038301",
            "name": "លី សុផានី"
        },
        {
            "barcode": "171144709",
            "dpc": "03021038201",
            "name": "តាត កុសល់"
        },
        {
            "barcode": "171144710",
            "dpc": "03021025701",
            "name": "ពេជ្ររិន"
        },
        {
            "barcode": "171144711",
            "dpc": "03021025601",
            "name": "ប៉ុក វាសនា"
        },
        {
            "barcode": "171144712",
            "dpc": "03021025501",
            "name": "យ៉ិន សូវៀត"
        },
        {
            "barcode": "171144713",
            "dpc": "03021025401",
            "name": "អ៊ុច សាវី"
        },
        {
            "barcode": "171144714",
            "dpc": "03021025301",
            "name": "ប៉ិល ហុង"
        },
        {
            "barcode": "171144715",
            "dpc": "03021025201",
            "name": "សៅ យ៉ុត"
        },
        {
            "barcode": "171144716",
            "dpc": "03021025101",
            "name": "ជា សេង"
        },
        {
            "barcode": "171144717",
            "dpc": "03021025001",
            "name": "គា សឿន"
        },
        {
            "barcode": "171144718",
            "dpc": "03021024901",
            "name": "យស់ សារ៉ាត់"
        },
        {
            "barcode": "171144719",
            "dpc": "03021024801",
            "name": "យឿន ចិនជូ"
        },
        {
            "barcode": "171144720",
            "dpc": "03021024701",
            "name": "កែវ សមុទ្រ"
        },
        {
            "barcode": "171144721",
            "dpc": "03021024601",
            "name": "វង្ស សុផា"
        },
        {
            "barcode": "171144722",
            "dpc": "03021024501",
            "name": "សេង លាងហេង"
        },
        {
            "barcode": "171144723",
            "dpc": "03021024401",
            "name": "ឡាយ យ៉េប"
        },
        {
            "barcode": "171144724",
            "dpc": "03021024301",
            "name": "សេង ឌី"
        },
        {
            "barcode": "171144725",
            "dpc": "03021024201",
            "name": "គង់ ថា"
        },
        {
            "barcode": "171144726",
            "dpc": "03021024101",
            "name": "ប៉ិល សារុន"
        },
        {
            "barcode": "171144727",
            "dpc": "03021024001",
            "name": "សំរិត ហូល"
        },
        {
            "barcode": "171144728",
            "dpc": "03021023901",
            "name": "ស្វឺយ ប៊ុនរឿន"
        },
        {
            "barcode": "171144729",
            "dpc": "03021023801",
            "name": "ចំរើន សេរីវឌ្ឍន៍"
        },
        {
            "barcode": "171144730",
            "dpc": "03021023701",
            "name": "ផាន់ សាម៉ន"
        },
        {
            "barcode": "171144731",
            "dpc": "03021023601",
            "name": "អាត់ ចំរើន"
        },
        {
            "barcode": "171144732",
            "dpc": "03021023401",
            "name": "ហាន ហ៊ួន"
        },
        {
            "barcode": "171144733",
            "dpc": "03021023301",
            "name": "បូ ស្រ៊ុយ"
        },
        {
            "barcode": "171144734",
            "dpc": "03021023201",
            "name": "ស៊ាង ដំ"
        },
        {
            "barcode": "171144735",
            "dpc": "03021023101",
            "name": "សាន ឡឹក"
        },
        {
            "barcode": "171144736",
            "dpc": "03021023001",
            "name": "សោ ប៊ុនម៉ី"
        },
        {
            "barcode": "171144737",
            "dpc": "03021022901",
            "name": "ស្មាន់ កាស់"
        },
        {
            "barcode": "171144738",
            "dpc": "03021022801",
            "name": "ស្មាន់ ហ្វាស់"
        },
        {
            "barcode": "171144739",
            "dpc": "03021022701",
            "name": "ជា ចាន់សាវុធ"
        },
        {
            "barcode": "171144740",
            "dpc": "03021022601",
            "name": "ឡុង សារី"
        },
        {
            "barcode": "171144741",
            "dpc": "03021020101",
            "name": "ស៊ិន សុខ"
        },
        {
            "barcode": "171144742",
            "dpc": "03021020001",
            "name": "ឡាំ ប៊ុនកែវ"
        },
        {
            "barcode": "171144743",
            "dpc": "03021019801",
            "name": "សួស សាវ៉ាត"
        },
        {
            "barcode": "171144744",
            "dpc": "03021019701",
            "name": "លី សុវណ្ណ"
        },
        {
            "barcode": "171144745",
            "dpc": "03021019601",
            "name": "មាស សាឡន"
        },
        {
            "barcode": "171144746",
            "dpc": "03021019501",
            "name": "សំរិត កាទ័រ"
        },
        {
            "barcode": "171144747",
            "dpc": "03021019401",
            "name": "អ៊ុន លីម"
        },
        {
            "barcode": "171144748",
            "dpc": "03021019201",
            "name": "លី ឆេង"
        },
        {
            "barcode": "171144749",
            "dpc": "03021019001",
            "name": "ម៉ាត់ យ៉ាន"
        },
        {
            "barcode": "171144750",
            "dpc": "03021018901",
            "name": "សេង សម្បត្តិ"
        },
        {
            "barcode": "171144751",
            "dpc": "03021018801",
            "name": "ចាន់ ចំណាន"
        },
        {
            "barcode": "171144752",
            "dpc": "03021018701",
            "name": "ម៉ាន ហាសាណាល់"
        },
        {
            "barcode": "171144753",
            "dpc": "03021018601",
            "name": "ឯក ស៊ីនួន"
        },
        {
            "barcode": "171144754",
            "dpc": "03021018501",
            "name": "ឡិប អះម៉ាត់"
        },
        {
            "barcode": "171144755",
            "dpc": "03021018401",
            "name": "ម៉េត នូរីយៈ"
        },
        {
            "barcode": "171144756",
            "dpc": "03021018301",
            "name": "ណាន លីន"
        },
        {
            "barcode": "171144757",
            "dpc": "03021018201",
            "name": "សាម ម៉ាត់ស"
        },
        {
            "barcode": "171144758",
            "dpc": "03021018101",
            "name": "ស៊ុន សុវន្តា"
        },
        {
            "barcode": "171144759",
            "dpc": "03021018001",
            "name": "ភី ភុំ"
        },
        {
            "barcode": "171144760",
            "dpc": "03021017901",
            "name": "សេង អ៊ុន"
        },
        {
            "barcode": "171144761",
            "dpc": "03021017801",
            "name": "ឯល សុម៉ាលីន"
        },
        {
            "barcode": "171144762",
            "dpc": "03021017701",
            "name": "នុត វទ្ធី"
        },
        {
            "barcode": "171144763",
            "dpc": "03021017601",
            "name": "សាន នី"
        },
        {
            "barcode": "171144764",
            "dpc": "03021017501",
            "name": "វ៉ាន់ សល់"
        },
        {
            "barcode": "171144765",
            "dpc": "03021017401",
            "name": "ហង្ស ញ្ច៉ុក"
        },
        {
            "barcode": "171144766",
            "dpc": "03021017301",
            "name": "គី រី"
        },
        {
            "barcode": "171144767",
            "dpc": "03021017201",
            "name": "ជួន ណារ៉េត"
        },
        {
            "barcode": "171144768",
            "dpc": "03021022401",
            "name": "កុយ សារឿ"
        },
        {
            "barcode": "171144769",
            "dpc": "03021022301",
            "name": "ទ័រ វ៉ាន"
        },
        {
            "barcode": "171144770",
            "dpc": "03021022201",
            "name": "ផាន់ សច្ចា"
        },
        {
            "barcode": "171144771",
            "dpc": "03021022101",
            "name": "ពេទ្យ និច"
        },
        {
            "barcode": "171144772",
            "dpc": "03021022001",
            "name": "ស៊ិន សំប៊ួន ២"
        },
        {
            "barcode": "171144773",
            "dpc": "03021021901",
            "name": "សុខ នាង"
        },
        {
            "barcode": "171144774",
            "dpc": "03021021801",
            "name": "ឈុំ ឆាត"
        },
        {
            "barcode": "171144775",
            "dpc": "03021021701",
            "name": "អ៊ឹម ចិន្ត្រា"
        },
        {
            "barcode": "171144776",
            "dpc": "03021021601",
            "name": "តៅ ទូច"
        },
        {
            "barcode": "171144777",
            "dpc": "03021021501",
            "name": "ស៊ិន សំបូ ១"
        },
        {
            "barcode": "171144778",
            "dpc": "03021021401",
            "name": "រួត ប៊ូន"
        },
        {
            "barcode": "171144779",
            "dpc": "03021021301",
            "name": "រី សារ៉ាន"
        },
        {
            "barcode": "171144780",
            "dpc": "03021021201",
            "name": "សួស យឹង"
        },
        {
            "barcode": "171144781",
            "dpc": "03021021101",
            "name": "វឿត ដារ៉ា"
        },
        {
            "barcode": "171144782",
            "dpc": "03021021001",
            "name": "យូ ណារ៉ា"
        },
        {
            "barcode": "171144783",
            "dpc": "03021020901",
            "name": "មាស សិទ្ធិដារ៉ារិទ្ធ"
        },
        {
            "barcode": "171144784",
            "dpc": "03021020801",
            "name": "ស៊ិន សំ"
        },
        {
            "barcode": "171144785",
            "dpc": "03021020601",
            "name": "ម៉ិល យួង"
        },
        {
            "barcode": "171144786",
            "dpc": "03021020701",
            "name": "សុខ ចន្ធី"
        },
        {
            "barcode": "171144787",
            "dpc": "03021020201",
            "name": "យាយ ឡាប"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
