let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=

    [
        {
            "barcode": "171148522",
            "dpc": "03021109601",
            "name": "អ៊ុក ហ៊ន(ត្នោតជុំ)"
        },
        {
            "barcode": "171148523",
            "dpc": "03021143701",
            "name": "យ៉ិប គង់"
        },
        {
            "barcode": "171148524",
            "dpc": "03021137301",
            "name": "ម៉ាត់ ម៉ាន"
        },
        {
            "barcode": "171148525",
            "dpc": "03021109701",
            "name": "ឯល សាឡេះ"
        },
        {
            "barcode": "171148526",
            "dpc": "03021143301",
            "name": "ឃឹម សុជាតិ"
        },
        {
            "barcode": "171148527",
            "dpc": "03021109101",
            "name": "ឃឹម សុជាតិ"
        },
        {
            "barcode": "171148528",
            "dpc": "03021114601",
            "name": "លី ប៊ុនលេខ"
        },
        {
            "barcode": "171148529",
            "dpc": "03021125101",
            "name": "វាំង បូរ៉ា"
        },
        {
            "barcode": "171148530",
            "dpc": "03021125201",
            "name": "វឿត ចាន់ធឿន"
        },
        {
            "barcode": "171148531",
            "dpc": "03021130101",
            "name": "ភឿង សុភ័ក្ត"
        },
        {
            "barcode": "171148532",
            "dpc": "03021143501",
            "name": "ហៃ ហេង"
        },
        {
            "barcode": "171148533",
            "dpc": "03021143601",
            "name": "សួន សារ៉ើន"
        },
        {
            "barcode": "171148534",
            "dpc": "03021109201",
            "name": "សូ រិហ្វីន"
        },
        {
            "barcode": "171148535",
            "dpc": "03021109301",
            "name": "សួន សុធា"
        },
        {
            "barcode": "171148536",
            "dpc": "03021119701",
            "name": "ទឹង ហាំងផូ"
        },
        {
            "barcode": "171148537",
            "dpc": "03021137501",
            "name": "ព្រំ លៀប"
        },
        {
            "barcode": "171148538",
            "dpc": "03021120001",
            "name": "ធាម ម៉េងហ្គុយ"
        },
        {
            "barcode": "171148539",
            "dpc": "03021137901",
            "name": "សួស កុសល់"
        },
        {
            "barcode": "171148540",
            "dpc": "03021138001",
            "name": "ជិន ជួប"
        },
        {
            "barcode": "171148541",
            "dpc": "03021107801",
            "name": "ឌុក ផល្លី"
        },
        {
            "barcode": "171148542",
            "dpc": "03021138101",
            "name": "ជួន ណារី"
        },
        {
            "barcode": "171148543",
            "dpc": "03021138401",
            "name": "សា ម៉ាត់ស"
        },
        {
            "barcode": "171148544",
            "dpc": "03021109401",
            "name": "ចៅ ធឿន"
        },
        {
            "barcode": "171148545",
            "dpc": "03021109501",
            "name": "ចៅ ថាន់"
        },
        {
            "barcode": "171148546",
            "dpc": "03021128001",
            "name": "គង់ សុភាព"
        },
        {
            "barcode": "171148547",
            "dpc": "03021112501",
            "name": "តន់ ប៊ុនរឿង"
        },
        {
            "barcode": "171148548",
            "dpc": "03021118201",
            "name": "មៀវ គីមហ៊ាន"
        },
        {
            "barcode": "171148549",
            "dpc": "03021137701",
            "name": "កែវ ធំប៉ា"
        },
        {
            "barcode": "171148550",
            "dpc": "03021120101",
            "name": "អ៊ុង សុជា"
        },
        {
            "barcode": "171148551",
            "dpc": "03021128101",
            "name": "វ៉ែន សុខូត"
        },
        {
            "barcode": "171148552",
            "dpc": "03021137601",
            "name": "ឆម វណ្ណា"
        },
        {
            "barcode": "171148553",
            "dpc": "03021124701",
            "name": "សែ ទ្រី"
        },
        {
            "barcode": "171148554",
            "dpc": "03021124801",
            "name": "អ៊ឹម សីហា"
        },
        {
            "barcode": "171148555",
            "dpc": "03021124901",
            "name": "សុខ សុផល ១"
        },
        {
            "barcode": "171148556",
            "dpc": "03021125001",
            "name": "សុខ វណ្ណា"
        },
        {
            "barcode": "171148557",
            "dpc": "03021138301",
            "name": "តន់ ប៊ុនរឿន ១"
        },
        {
            "barcode": "171148558",
            "dpc": "03021138201",
            "name": "ហេង គង់"
        },
        {
            "barcode": "171148559",
            "dpc": "03021124401",
            "name": "សៅ ស៊ីដែត ២"
        },
        {
            "barcode": "171148560",
            "dpc": "03021124501",
            "name": "សៅ ស៊ីដែត ១"
        },
        {
            "barcode": "171148561",
            "dpc": "03021145101",
            "name": "ថោង គឹមលី"
        },
        {
            "barcode": "171148562",
            "dpc": "03021137801",
            "name": "មុំ គីរី"
        },
        {
            "barcode": "171148563",
            "dpc": "03021130801",
            "name": "ម៉ៃ ម៉ាន់"
        },
        {
            "barcode": "171148564",
            "dpc": "03021127501",
            "name": "តេង ព្រៀន"
        },
        {
            "barcode": "171148565",
            "dpc": "03021112001",
            "name": "ជា វឿន"
        },
        {
            "barcode": "171148566",
            "dpc": "03021122601",
            "name": "ឌុក ឆវ័ន្ត"
        },
        {
            "barcode": "171148567",
            "dpc": "03021139001",
            "name": "ទេព ឆវី"
        },
        {
            "barcode": "171148568",
            "dpc": "03021119601",
            "name": "យ៉ាំ ខី"
        },
        {
            "barcode": "171148569",
            "dpc": "03021105601",
            "name": "កែវ ពិជិត"
        },
        {
            "barcode": "171148570",
            "dpc": "03021138601",
            "name": "ហាន រ៉ាន់"
        },
        {
            "barcode": "171148571",
            "dpc": "03021131701",
            "name": "សេង ហ៊ាង"
        },
        {
            "barcode": "171148572",
            "dpc": "03021105701",
            "name": "សេង ឆៀត"
        },
        {
            "barcode": "171148573",
            "dpc": "03021105901",
            "name": "យឹម សារ៉ាក់"
        },
        {
            "barcode": "171148574",
            "dpc": "03021115901",
            "name": "យៀម ប្រង់"
        },
        {
            "barcode": "171148575",
            "dpc": "03021107601",
            "name": "ព្រឿង តុន"
        },
        {
            "barcode": "171148576",
            "dpc": "03021107701",
            "name": "មាស មាលគី"
        },
        {
            "barcode": "171148577",
            "dpc": "03021146101",
            "name": "មឿន សានី"
        },
        {
            "barcode": "171148578",
            "dpc": "03021136201",
            "name": "ឈុំ  វុធ"
        },
        {
            "barcode": "171148579",
            "dpc": "03021139301",
            "name": "ជា ដាវី"
        },
        {
            "barcode": "171148580",
            "dpc": "03021106101",
            "name": "ផ្លុង  គឹមថៃ"
        },
        {
            "barcode": "171148581",
            "dpc": "03021122501",
            "name": "ម៉ៅ ព្រីយ៉ា"
        },
        {
            "barcode": "171148582",
            "dpc": "03021139501",
            "name": "ឆម ឈឿប"
        },
        {
            "barcode": "171148583",
            "dpc": "03021107301",
            "name": "ងិន វ៉ារី"
        },
        {
            "barcode": "171148584",
            "dpc": "03021107401",
            "name": "ថាច់ សៅរ៍"
        },
        {
            "barcode": "171148585",
            "dpc": "03021106301",
            "name": "យីវ វណ្ណៈ"
        },
        {
            "barcode": "171148586",
            "dpc": "03021127701",
            "name": "អៀង យ៉ាន់ណា"
        },
        {
            "barcode": "171148587",
            "dpc": "03021127801",
            "name": "ពេញ ចិន្តា"
        },
        {
            "barcode": "171148588",
            "dpc": "03021139201",
            "name": "ដាំ  សាមី"
        },
        {
            "barcode": "171148589",
            "dpc": "03021145501",
            "name": "កែ សាម៉េត"
        },
        {
            "barcode": "171148590",
            "dpc": "03021125801",
            "name": "ម៉ា វុទ្ធី"
        },
        {
            "barcode": "171148591",
            "dpc": "03021111901",
            "name": "អេង ប៊ុនធឿន"
        },
        {
            "barcode": "171148592",
            "dpc": "03021126301",
            "name": "រ៉េត ដារិត"
        },
        {
            "barcode": "171148593",
            "dpc": "03021145901",
            "name": "សូ ទី"
        },
        {
            "barcode": "171148594",
            "dpc": "03021102401",
            "name": "វ៉ាយ សារ"
        },
        {
            "barcode": "171148595",
            "dpc": "03021102301",
            "name": "ទិត្យ  សាមឿន"
        },
        {
            "barcode": "171148596",
            "dpc": "03021125601",
            "name": "ហ៊ិន ហ៊ាង"
        },
        {
            "barcode": "171148597",
            "dpc": "03021134201",
            "name": "ផាត រ៉ា"
        },
        {
            "barcode": "171148598",
            "dpc": "03021108501",
            "name": "ផា  គឹមសុន្ទរ៍"
        },
        {
            "barcode": "171148599",
            "dpc": "03021135401",
            "name": "ឆេង ឆាង"
        },
        {
            "barcode": "171148600",
            "dpc": "03021108601",
            "name": "ឈួម សុខៈ"
        },
        {
            "barcode": "171148601",
            "dpc": "03021111801",
            "name": "ឆិម សុវណ្ណី"
        },
        {
            "barcode": "171148602",
            "dpc": "03021134101",
            "name": "ជុង ឆាយ"
        },
        {
            "barcode": "171148603",
            "dpc": "03021102501",
            "name": "ញឹប បូរ៉ា"
        },
        {
            "barcode": "171148604",
            "dpc": "03021110401",
            "name": "គីម  សារ៉ន"
        },
        {
            "barcode": "171148605",
            "dpc": "03021111701",
            "name": "ឡម សុជាតិ"
        },
        {
            "barcode": "171148606",
            "dpc": "03021115501",
            "name": "ឡម លី"
        },
        {
            "barcode": "171148607",
            "dpc": "03021134401",
            "name": "ឈា សំណាង"
        },
        {
            "barcode": "171148608",
            "dpc": "03021114101",
            "name": "ស៊ូ សុគន្ធ"
        },
        {
            "barcode": "171148609",
            "dpc": "03021105301",
            "name": "ហ៊ុន សាលី ២"
        },
        {
            "barcode": "171148610",
            "dpc": "03021105101",
            "name": "ប៊ី ទី"
        },
        {
            "barcode": "171148611",
            "dpc": "03021134701",
            "name": "ព្រឿង វិរៈ"
        },
        {
            "barcode": "171148612",
            "dpc": "03021134801",
            "name": "ប្រេប សារឿន"
        },
        {
            "barcode": "171148613",
            "dpc": "03021130201",
            "name": "អេង ភីរុណ"
        },
        {
            "barcode": "171148614",
            "dpc": "03021144701",
            "name": "ចៅ ស៊ីនួន"
        },
        {
            "barcode": "171148615",
            "dpc": "03021120201",
            "name": "ស៊្រុន  សុទិដ្ឋ"
        },
        {
            "barcode": "171148616",
            "dpc": "03021134001",
            "name": "កែវ កុសល់"
        },
        {
            "barcode": "171148617",
            "dpc": "03021125901",
            "name": "សម សារិន"
        },
        {
            "barcode": "171148618",
            "dpc": "03021144601",
            "name": "ឡាយ គឹមស៊ុន"
        },
        {
            "barcode": "171148619",
            "dpc": "03021134601",
            "name": "ប៉ែន ភន"
        },
        {
            "barcode": "171148620",
            "dpc": "03021129701",
            "name": "អ៊ឹង ងួនហាក់"
        },
        {
            "barcode": "171148621",
            "dpc": "03021134501",
            "name": "មិន សាមិ"
        },
        {
            "barcode": "171148622",
            "dpc": "03021122301",
            "name": "មិន ឡូញ"
        },
        {
            "barcode": "171148623",
            "dpc": "03021135101",
            "name": "អ៊ុយ សុធារី"
        },
        {
            "barcode": "171148624",
            "dpc": "03021130701",
            "name": "ម៉ៃ សាមៀត"
        },
        {
            "barcode": "171148625",
            "dpc": "03021107201",
            "name": "ឆម ឆវី"
        },
        {
            "barcode": "171148626",
            "dpc": "03021106501",
            "name": "ម៉ា សាមៀត"
        },
        {
            "barcode": "171148627",
            "dpc": "03021135201",
            "name": "ប៊ុន ចំរើន"
        },
        {
            "barcode": "171148628",
            "dpc": "03021135301",
            "name": "គឹម ឌី"
        },
        {
            "barcode": "171148629",
            "dpc": "03021125501",
            "name": "កាយ វណ្ណធី"
        },
        {
            "barcode": "171148630",
            "dpc": "03021106001",
            "name": "ប៊ុន រិទ្ធ"
        },
        {
            "barcode": "171148631",
            "dpc": "03021135801",
            "name": "ឌុក ប៉ោះ"
        },
        {
            "barcode": "171148632",
            "dpc": "03021100101",
            "name": "ពិន សុភា"
        },
        {
            "barcode": "171148633",
            "dpc": "03021119501",
            "name": "វុធ ថា"
        },
        {
            "barcode": "171148634",
            "dpc": "03021136001",
            "name": "ប៉ុក សារុំ"
        },
        {
            "barcode": "171148635",
            "dpc": "03021131201",
            "name": "ប៉ាន់ វិន"
        },
        {
            "barcode": "171148636",
            "dpc": "03021122001",
            "name": "ញ៉ែម គឹមសួរ"
        },
        {
            "barcode": "171148637",
            "dpc": "03021129401",
            "name": "ឡៅ ជូឆេង"
        },
        {
            "barcode": "171148638",
            "dpc": "03021133301",
            "name": "ឡោ គឹមហេង"
        },
        {
            "barcode": "171148639",
            "dpc": "03021146001",
            "name": "តាំង ទ្រី"
        },
        {
            "barcode": "171148640",
            "dpc": "03021102901",
            "name": "ចាន់ ម៉ាន់"
        },
        {
            "barcode": "171148641",
            "dpc": "03021108801",
            "name": "ស្រេង ម៉ៅ"
        },
        {
            "barcode": "171148642",
            "dpc": "03021133201",
            "name": "ប៊ី  កញ្ញា"
        },
        {
            "barcode": "171148643",
            "dpc": "03021135701",
            "name": "ភុក មួយ"
        },
        {
            "barcode": "171148644",
            "dpc": "03021104901",
            "name": "អ៊ឹម នាង"
        },
        {
            "barcode": "171148645",
            "dpc": "03021133001",
            "name": "សយ លាវ"
        },
        {
            "barcode": "171148646",
            "dpc": "03021133101",
            "name": "ទី ជាប"
        },
        {
            "barcode": "171148647",
            "dpc": "03021103101",
            "name": "គឹម ប៊ុនធឿន ១"
        },
        {
            "barcode": "171148648",
            "dpc": "03021133601",
            "name": "ចាន់ វ៉េ"
        },
        {
            "barcode": "171148649",
            "dpc": "03021119401",
            "name": "ឆឺយ សារ៉េត"
        },
        {
            "barcode": "171148650",
            "dpc": "03021145301",
            "name": "ឡាយ សាំងថង"
        },
        {
            "barcode": "171148651",
            "dpc": "03021133401",
            "name": "លឹម ម៉េង"
        },
        {
            "barcode": "171148652",
            "dpc": "03021133501",
            "name": "ខ្មៅ សំកុល"
        },
        {
            "barcode": "171148653",
            "dpc": "03021130501",
            "name": "សុទ្ធ ថា"
        },
        {
            "barcode": "171148654",
            "dpc": "03021129501",
            "name": "យិន យក់"
        },
        {
            "barcode": "171148655",
            "dpc": "03021142901",
            "name": "ស៊ាន គឹមស្រូ"
        },
        {
            "barcode": "171148656",
            "dpc": "03021131301",
            "name": "ឆែម សុគន្ធ"
        },
        {
            "barcode": "171148657",
            "dpc": "03021129901",
            "name": "ជួន វើយ"
        },
        {
            "barcode": "171148658",
            "dpc": "03021143101",
            "name": "ឌី ទូច"
        },
        {
            "barcode": "171148659",
            "dpc": "03021146801",
            "name": "មុំ កែវ"
        },
        {
            "barcode": "171148660",
            "dpc": "03021138701",
            "name": "សាន សារិន"
        },
        {
            "barcode": "171148661",
            "dpc": "03021114501",
            "name": "សោម សម្បត្តិ"
        },
        {
            "barcode": "171148662",
            "dpc": "03021143001",
            "name": "សុខ សាវី"
        },
        {
            "barcode": "171148663",
            "dpc": "03021112401",
            "name": "សាលារៀនវត្តរំដួល"
        },
        {
            "barcode": "171148664",
            "dpc": "03021128501",
            "name": "ហេវ គឹមអេង"
        },
        {
            "barcode": "171148665",
            "dpc": "03021126001",
            "name": "សុង ហ៊ាង"
        },
        {
            "barcode": "171148666",
            "dpc": "03021145001",
            "name": "ម៉ូត ស្រីអិន"
        },
        {
            "barcode": "171148667",
            "dpc": "03021119801",
            "name": "ចាន់ សុផៃ"
        },
        {
            "barcode": "171148668",
            "dpc": "03021127901",
            "name": "ចាន់ ថា"
        },
        {
            "barcode": "171148669",
            "dpc": "03021120801",
            "name": "ឈា ចន្ធូ"
        },
        {
            "barcode": "171148670",
            "dpc": "03021139601",
            "name": "ទូច ខុនណា"
        },
        {
            "barcode": "171148671",
            "dpc": "03021145601",
            "name": "ឈា ចន្នី"
        },
        {
            "barcode": "171148672",
            "dpc": "03021115801",
            "name": "ម៉ឹង រ៉ាឌី"
        },
        {
            "barcode": "171148673",
            "dpc": "03021130901",
            "name": "យ៉ែម សំអូន"
        },
        {
            "barcode": "171148674",
            "dpc": "03021106901",
            "name": "អៀង សាខន"
        },
        {
            "barcode": "171148675",
            "dpc": "03021110701",
            "name": "ពៅ មៀន"
        },
        {
            "barcode": "171148676",
            "dpc": "03021145801",
            "name": "តាន់ ឈុនហុង"
        },
        {
            "barcode": "171148677",
            "dpc": "03021140701",
            "name": "ម៉ៅ ហែម"
        },
        {
            "barcode": "171148678",
            "dpc": "03021146701",
            "name": "គង់ សុវណ្ណ"
        },
        {
            "barcode": "171148679",
            "dpc": "03021107501",
            "name": "ង៉ែត សារ៉េត"
        },
        {
            "barcode": "171148680",
            "dpc": "03021131901",
            "name": "ដួង រជ្ជនី"
        },
        {
            "barcode": "171148681",
            "dpc": "03021140001",
            "name": "នូ សេង"
        },
        {
            "barcode": "171148682",
            "dpc": "03021140901",
            "name": "ម៉ា រ៉ី"
        },
        {
            "barcode": "171148683",
            "dpc": "03021126101",
            "name": "ជៀប ឆេងហ៊ួរ"
        },
        {
            "barcode": "171148684",
            "dpc": "03021140101",
            "name": "ស៊្រុន  ប៊ុនថន"
        },
        {
            "barcode": "171148685",
            "dpc": "03021140401",
            "name": "ទី រស្មី"
        },
        {
            "barcode": "171148686",
            "dpc": "03021144801",
            "name": "សោម មួន"
        },
        {
            "barcode": "171148687",
            "dpc": "03021140301",
            "name": "ចាន់ មុំ"
        },
        {
            "barcode": "171148688",
            "dpc": "03021144901",
            "name": "ផាង ថានី"
        },
        {
            "barcode": "171148689",
            "dpc": "03021140201",
            "name": "អ៊ីវ ប៉ូឡូ"
        },
        {
            "barcode": "171148690",
            "dpc": "03021140501",
            "name": "ផង់ សាវឿន"
        },
        {
            "barcode": "171148691",
            "dpc": "03021139901",
            "name": "យ៉ម រួន"
        },
        {
            "barcode": "171148692",
            "dpc": "03021116001",
            "name": "ឃាង វីរៈ"
        },
        {
            "barcode": "171148693",
            "dpc": "03021123101",
            "name": "អឿង ម៉ារីនីត"
        },
        {
            "barcode": "171148694",
            "dpc": "03021109901",
            "name": "ម៉ៅ ១"
        },
        {
            "barcode": "171148695",
            "dpc": "03021126201",
            "name": "ខាន អៈម៉ាត់ ស្តង់១២"
        },
        {
            "barcode": "171148696",
            "dpc": "03021110001",
            "name": "សេន សម្បត្តិ"
        },
        {
            "barcode": "171148697",
            "dpc": "03021116101",
            "name": "ណាំ ផារ៉ាត់"
        },
        {
            "barcode": "171148698",
            "dpc": "03021116201",
            "name": "តូបលេខ ៤"
        },
        {
            "barcode": "171148699",
            "dpc": "03021112301",
            "name": "វៀច សួរ"
        },
        {
            "barcode": "171148700",
            "dpc": "03021141801",
            "name": "តាំង ម៉ី"
        },
        {
            "barcode": "171148701",
            "dpc": "03021118101",
            "name": "សឹប ទីម៉ាស់"
        },
        {
            "barcode": "171148702",
            "dpc": "03021142401",
            "name": "ស្តង់លេខ ៥៩"
        },
        {
            "barcode": "171148703",
            "dpc": "03021142301",
            "name": "ស្តង់លេខ ៥៧"
        },
        {
            "barcode": "171148704",
            "dpc": "03021116401",
            "name": "អាំងគឹមហេងស្តង់ ៥៦"
        },
        {
            "barcode": "171148705",
            "dpc": "03021116301",
            "name": "ណា លី"
        },
        {
            "barcode": "171148706",
            "dpc": "03021110601",
            "name": "អឿង គន្ធា"
        },
        {
            "barcode": "171148707",
            "dpc": "03021110501",
            "name": "ទូច ម៉ៅ ៣"
        },
        {
            "barcode": "171148708",
            "dpc": "03021147901",
            "name": "ខ្លូត សារៀន"
        },
        {
            "barcode": "171148709",
            "dpc": "03021147801",
            "name": "ជីវ គក់ចក់"
        },
        {
            "barcode": "171148710",
            "dpc": "03021140601",
            "name": "ហេង សមដារ៉ា"
        },
        {
            "barcode": "171148711",
            "dpc": "03021126401",
            "name": "តូបលេខ ២៤"
        },
        {
            "barcode": "171148712",
            "dpc": "03021110301",
            "name": "ម៉ៅ ២ ស្តង់លេខ ២៥"
        },
        {
            "barcode": "171148713",
            "dpc": "03021116601",
            "name": "តូបលេខ ២៦"
        },
        {
            "barcode": "171148714",
            "dpc": "03021123301",
            "name": "តូបលេខ  ២៧"
        },
        {
            "barcode": "171148715",
            "dpc": "03021142101",
            "name": "ស្តង់លេខ ២៨"
        },
        {
            "barcode": "171148716",
            "dpc": "03021142001",
            "name": "ស្តង់លេខ ៣០"
        },
        {
            "barcode": "171148717",
            "dpc": "03021114701",
            "name": "អ៊ាន ធីដាឡែន"
        },
        {
            "barcode": "171148718",
            "dpc": "03021142501",
            "name": "ស្តង់លេខ ៣១"
        },
        {
            "barcode": "171148719",
            "dpc": "03021123201",
            "name": "យិន ពិសិទ្ធស្តង់លេខ ៣២"
        },
        {
            "barcode": "171148720",
            "dpc": "03021141001",
            "name": "មាស ពិសិទ្ធ"
        },
        {
            "barcode": "171148721",
            "dpc": "03021112701",
            "name": "ប៉ុក ប៊ុនធឿន"
        },
        {
            "barcode": "171148722",
            "dpc": "03021102101",
            "name": "សេង សុខា"
        },
        {
            "barcode": "171148723",
            "dpc": "03021141601",
            "name": "ឈឿម រ៉ា"
        },
        {
            "barcode": "171148724",
            "dpc": "03021141501",
            "name": "អ៊ឹង ប៉ុនថេន"
        },
        {
            "barcode": "171148725",
            "dpc": "03021141401",
            "name": "សុខ សុផល"
        },
        {
            "barcode": "171148726",
            "dpc": "03021141301",
            "name": "ណៃ សុខន"
        },
        {
            "barcode": "171148727",
            "dpc": "03021141201",
            "name": "ផែន សុផាន់ណា"
        },
        {
            "barcode": "171148728",
            "dpc": "03021141101",
            "name": "ហុង លីណា"
        },
        {
            "barcode": "171148729",
            "dpc": "03021106801",
            "name": "សាលារៀនវត្តលៀប"
        },
        {
            "barcode": "171148730",
            "dpc": "03021146601",
            "name": "ឡុង សារុំ"
        },
        {
            "barcode": "171148731",
            "dpc": "03021114901",
            "name": "គឹម យីន"
        },
        {
            "barcode": "171148732",
            "dpc": "03021141901",
            "name": "ទី សុខុន"
        },
        {
            "barcode": "171148733",
            "dpc": "03021114301",
            "name": "ទួន ស្រីមុំ"
        },
        {
            "barcode": "171148734",
            "dpc": "03021122101",
            "name": "មាស សាម៉ន"
        },
        {
            "barcode": "171148735",
            "dpc": "03021127101",
            "name": "ផៃ សាម៉ា"
        },
        {
            "barcode": "171148736",
            "dpc": "03021127601",
            "name": "អ៊ុច គីមឡាយ"
        },
        {
            "barcode": "171148737",
            "dpc": "03021127401",
            "name": "ផ្លាង  ឆន"
        },
        {
            "barcode": "171148738",
            "dpc": "03021114401",
            "name": "ចាន់ ដាវី"
        },
        {
            "barcode": "171148739",
            "dpc": "03021112201",
            "name": "ជា ង៉ា"
        },
        {
            "barcode": "171148740",
            "dpc": "03021112101",
            "name": "សុខ សេង"
        },
        {
            "barcode": "171148741",
            "dpc": "03021127301",
            "name": "ឆើត សេង ថៃ"
        },
        {
            "barcode": "171148742",
            "dpc": "03021127201",
            "name": "សេង វុទ្ធី"
        },
        {
            "barcode": "171148743",
            "dpc": "03021127001",
            "name": "តុន វី"
        },
        {
            "barcode": "171148744",
            "dpc": "03021102001",
            "name": "សា ម៉ុន"
        },
        {
            "barcode": "171148745",
            "dpc": "03021101901",
            "name": "ព្រំ ទី"
        },
        {
            "barcode": "171148746",
            "dpc": "03021122801",
            "name": "ឈួន វាសនា"
        },
        {
            "barcode": "171148747",
            "dpc": "03021123601",
            "name": "ហាំម ប៊ុនរឿន"
        },
        {
            "barcode": "171148748",
            "dpc": "03021129601",
            "name": "អន ប៊ុនសៀន"
        },
        {
            "barcode": "171148749",
            "dpc": "03021145401",
            "name": "ឡុង ឃាង"
        },
        {
            "barcode": "171148750",
            "dpc": "03021118501",
            "name": "ឡាយ ភូយ"
        },
        {
            "barcode": "171148751",
            "dpc": "03021131801",
            "name": "ឈ គឹមឡេង"
        },
        {
            "barcode": "171148752",
            "dpc": "03021122701",
            "name": "ប៊ូ ឡេង"
        },
        {
            "barcode": "171148753",
            "dpc": "03021142701",
            "name": "ហឺ វង្ស"
        },
        {
            "barcode": "171148754",
            "dpc": "03021129201",
            "name": "សូ វន"
        },
        {
            "barcode": "171148755",
            "dpc": "03021130001",
            "name": "ជា ជិនណារី"
        },
        {
            "barcode": "171148756",
            "dpc": "03021128301",
            "name": "លាភ សុជាតិ"
        },
        {
            "barcode": "171148757",
            "dpc": "03021120701",
            "name": "ឡាយ សេងគាន"
        },
        {
            "barcode": "171148758",
            "dpc": "03021142801",
            "name": "ធី ហួយ"
        },
        {
            "barcode": "171148759",
            "dpc": "03021125401",
            "name": "ម៉ក់ ចាន់ចន"
        },
        {
            "barcode": "171148760",
            "dpc": "03021102701",
            "name": "ហ៊ឹម នូវ"
        },
        {
            "barcode": "171148761",
            "dpc": "03021111201",
            "name": "ឡោ សាឡៅ"
        },
        {
            "barcode": "171148762",
            "dpc": "03021104401",
            "name": "វ៉ាយ  សារ ២"
        },
        {
            "barcode": "171148763",
            "dpc": "03021108901",
            "name": "ជន សឿប"
        },
        {
            "barcode": "171148764",
            "dpc": "03021123001",
            "name": "ទួន  វណ្ណា"
        },
        {
            "barcode": "171148765",
            "dpc": "03021131001",
            "name": "ឡុង រចនា"
        },
        {
            "barcode": "171148766",
            "dpc": "03021136401",
            "name": "ដាំ សារឿត"
        },
        {
            "barcode": "171148767",
            "dpc": "03021113501",
            "name": "ពេញ រ៉ាន់"
        },
        {
            "barcode": "171148768",
            "dpc": "03021113601",
            "name": "វិន ថុល"
        },
        {
            "barcode": "171148769",
            "dpc": "03021113701",
            "name": "ជុន គឹមអាន"
        },
        {
            "barcode": "171148770",
            "dpc": "03021114001",
            "name": "ពៅ ភី"
        },
        {
            "barcode": "171148771",
            "dpc": "03021146501",
            "name": "ជុន ហាន"
        },
        {
            "barcode": "171148772",
            "dpc": "03021103001",
            "name": "សេក លាត"
        },
        {
            "barcode": "171148773",
            "dpc": "03021135501",
            "name": "ធៀម សុង"
        },
        {
            "barcode": "171148774",
            "dpc": "03021117101",
            "name": "ឈន លុច"
        },
        {
            "barcode": "171148775",
            "dpc": "03021125701",
            "name": "ជា ហាប់"
        },
        {
            "barcode": "171148776",
            "dpc": "03021119301",
            "name": "ស៊ិន ប៊ុនថា"
        },
        {
            "barcode": "171148777",
            "dpc": "03021102601",
            "name": "ស៊ុន ណាវី"
        },
        {
            "barcode": "171148778",
            "dpc": "03021133701",
            "name": "ប៉ាវ សាំងហេង"
        },
        {
            "barcode": "171148779",
            "dpc": "03021104801",
            "name": "អ៊ួន សេងហួត"
        },
        {
            "barcode": "171148780",
            "dpc": "03021108401",
            "name": "ហេង សារ៉ាត់"
        },
        {
            "barcode": "171148781",
            "dpc": "03021120401",
            "name": "ចេង ឈន"
        },
        {
            "barcode": "171148782",
            "dpc": "03021135001",
            "name": "សុទ្ធ រីន"
        },
        {
            "barcode": "171148783",
            "dpc": "03021107001",
            "name": "សេង ហ៊ឺយ"
        },
        {
            "barcode": "171148784",
            "dpc": "03021113901",
            "name": "ជុក ចាន់"
        },
        {
            "barcode": "171148785",
            "dpc": "03021136101",
            "name": "ម៉ុយ ដារ៉ាវុធ"
        },
        {
            "barcode": "171148786",
            "dpc": "03021120501",
            "name": "សំ សុខា"
        },
        {
            "barcode": "171148787",
            "dpc": "03021133901",
            "name": "ហេវ បាន ស៊ាន"
        },
        {
            "barcode": "171148788",
            "dpc": "03021113801",
            "name": "យៀម សាគឿន"
        },
        {
            "barcode": "171148789",
            "dpc": "03021144501",
            "name": "ពៅ សោភ័ណ្ឌ"
        },
        {
            "barcode": "171148790",
            "dpc": "03021113401",
            "name": "ញាណ សំណាង"
        },
        {
            "barcode": "171148791",
            "dpc": "03021113301",
            "name": "ប៊ុន ហឿត"
        },
        {
            "barcode": "171148792",
            "dpc": "03021129301",
            "name": "ហេង វិបុល"
        },
        {
            "barcode": "171148793",
            "dpc": "03021133801",
            "name": "លឹម សារុន"
        },
        {
            "barcode": "171148794",
            "dpc": "03021135901",
            "name": "យី ហាន"
        },
        {
            "barcode": "171148795",
            "dpc": "03021117701",
            "name": "សឺ   ឃុយ"
        },
        {
            "barcode": "171148796",
            "dpc": "03021117601",
            "name": "សូ ណាវណ្ណី"
        },
        {
            "barcode": "171148797",
            "dpc": "03021117801",
            "name": "វ៉ាង ចាន់រិទ្ធ"
        },
        {
            "barcode": "171148798",
            "dpc": "03021117501",
            "name": "ជិត សៀក"
        },
        {
            "barcode": "171148799",
            "dpc": "03021117401",
            "name": "រិន ខាតណា"
        },
        {
            "barcode": "171148800",
            "dpc": "03021144201",
            "name": "ជិន ហាប់"
        },
        {
            "barcode": "171148801",
            "dpc": "03021144301",
            "name": "ខៀវ សំណាង​ ១"
        },
        {
            "barcode": "171148802",
            "dpc": "03021144401",
            "name": "ខៀវ សំណាង ២"
        },
        {
            "barcode": "171148803",
            "dpc": "03021134901",
            "name": "អ៊ឹម ម៉ារ៉ាឌី"
        },
        {
            "barcode": "171148804",
            "dpc": "03021103501",
            "name": "ឯម  រ៉េន"
        },
        {
            "barcode": "171148805",
            "dpc": "03021104701",
            "name": "អ៊ុន   ដានី"
        },
        {
            "barcode": "171148806",
            "dpc": "03021105801",
            "name": "ឃូ  ឈាត"
        },
        {
            "barcode": "171148807",
            "dpc": "03021107901",
            "name": "ស៊ីម  គន្ធា"
        },
        {
            "barcode": "171148808",
            "dpc": "03021108701",
            "name": "ឈិត  អេង"
        },
        {
            "barcode": "171148809",
            "dpc": "03021110801",
            "name": "ស៊ិន  សៅ"
        },
        {
            "barcode": "171148810",
            "dpc": "03021112601",
            "name": "សំ  ហេង"
        },
        {
            "barcode": "171148811",
            "dpc": "03021112901",
            "name": "នី (តូប ១៧ )"
        },
        {
            "barcode": "171148812",
            "dpc": "03021114201",
            "name": "ឃុន  វុទ្ធី"
        },
        {
            "barcode": "171148813",
            "dpc": "03021115701",
            "name": "ចាន់  សុខហ៊ាង"
        },
        {
            "barcode": "171148814",
            "dpc": "03021116701",
            "name": "ហេង  សុធា"
        },
        {
            "barcode": "171148815",
            "dpc": "03021117001",
            "name": "ឡាយ  ហួត"
        },
        {
            "barcode": "171148816",
            "dpc": "03021118601",
            "name": "តឹក  វាសនា"
        },
        {
            "barcode": "171148817",
            "dpc": "03021118701",
            "name": "សោម  សុផាត"
        },
        {
            "barcode": "171148818",
            "dpc": "03021119901",
            "name": "រៀម  រដ្ឋា"
        },
        {
            "barcode": "171148819",
            "dpc": "03021121001",
            "name": "អ៊ឺង  គឹមលី"
        },
        {
            "barcode": "171148820",
            "dpc": "03021121101",
            "name": "តាំង  សុផល"
        },
        {
            "barcode": "171148821",
            "dpc": "03021123501",
            "name": "ស៊ាង  សាន"
        },
        {
            "barcode": "171148822",
            "dpc": "03021124301",
            "name": "ឈុំ   វុធ"
        },
        {
            "barcode": "171148823",
            "dpc": "03021126501",
            "name": "ភូ  ពុយ"
        },
        {
            "barcode": "171148824",
            "dpc": "03021128401",
            "name": "ព្រំ  សុខា"
        },
        {
            "barcode": "171148825",
            "dpc": "03021129101",
            "name": "ណាំ  សុខហេង"
        },
        {
            "barcode": "171148826",
            "dpc": "03021130301",
            "name": "អោក  ឈាត"
        },
        {
            "barcode": "171148827",
            "dpc": "03021131601",
            "name": "ម៉ា  សាត"
        },
        {
            "barcode": "171148828",
            "dpc": "03021132001",
            "name": "ពឹង ចាំងហ៊ុយ"
        },
        {
            "barcode": "171148829",
            "dpc": "03021134301",
            "name": "ឈុន  ឆាន់"
        },
        {
            "barcode": "171148830",
            "dpc": "03021136301",
            "name": "វ៉ន  ថា"
        },
        {
            "barcode": "171148831",
            "dpc": "03021137101",
            "name": "លួង  ឆែម"
        },
        {
            "barcode": "171148832",
            "dpc": "03021137201",
            "name": "គង់  ចំរើន"
        },
        {
            "barcode": "171148833",
            "dpc": "03021137401",
            "name": "ធួក  សារិន"
        },
        {
            "barcode": "171148834",
            "dpc": "03021138801",
            "name": "ឯម  សុរាជ្យ"
        },
        {
            "barcode": "171148835",
            "dpc": "03021138901",
            "name": "ឌី  ភិន"
        },
        {
            "barcode": "171148836",
            "dpc": "03021139401",
            "name": "គឹម  សុផល"
        },
        {
            "barcode": "171148837",
            "dpc": "03021139701",
            "name": "នូ  សារ៉េត"
        },
        {
            "barcode": "171148838",
            "dpc": "03021139801",
            "name": "ហាន  សុជិត"
        },
        {
            "barcode": "171148839",
            "dpc": "03021140801",
            "name": "ឃុន  ហ៊ួរ"
        },
        {
            "barcode": "171148840",
            "dpc": "03021142201",
            "name": "ស្តង់លេខ ៥៤"
        },
        {
            "barcode": "171148841",
            "dpc": "03021143201",
            "name": "ស៊ាន​ តិម៉ា"
        },
        {
            "barcode": "171148842",
            "dpc": "03021143401",
            "name": "សួស  សាវ៉ាត"
        },
        {
            "barcode": "171148843",
            "dpc": "03021143801",
            "name": "ទិត្យ  ប៊ុនតូ"
        },
        {
            "barcode": "171148844",
            "dpc": "03021143901",
            "name": "ឡោះ  ទួតស៊ីណា"
        },
        {
            "barcode": "171148845",
            "dpc": "03021144001",
            "name": "ឯល  អៃនី"
        },
        {
            "barcode": "171148846",
            "dpc": "03021145201",
            "name": "យក់  ប៊ុនណា"
        },
        {
            "barcode": "171148847",
            "dpc": "03021146401",
            "name": "យ៉ិ  សុផាន់"
        },
        {
            "barcode": "171148848",
            "dpc": "03021147701",
            "name": "គង់  សារ៉ុម"
        },
        {
            "barcode": "171148849",
            "dpc": "03021121201",
            "name": "សំ  ចន្ថា"
        },
        {
            "barcode": "171148850",
            "dpc": "03021119001",
            "name": "សុខ  ចាន់ថុយ"
        },
        {
            "barcode": "171148851",
            "dpc": "03021147601",
            "name": "ហ៊ិន វុទ្ធី"
        },
        {
            "barcode": "171148852",
            "dpc": "03021147001",
            "name": "ស៊ិម សំណាង"
        },
        {
            "barcode": "171148853",
            "dpc": "03021132101",
            "name": "អ៊ុំ វណ្ណា"
        },
        {
            "barcode": "171148854",
            "dpc": "03021124101",
            "name": "នូ បូរ៉ា"
        },
        {
            "barcode": "171148855",
            "dpc": "03021121501",
            "name": "ម៉ៅ អ៊ុច"
        },
        {
            "barcode": "171148856",
            "dpc": "03021121401",
            "name": "ឃឹម ទៀង"
        },
        {
            "barcode": "171148857",
            "dpc": "03021119201",
            "name": "ស៊ាង  នាម"
        },
        {
            "barcode": "171148858",
            "dpc": "03021119101",
            "name": "តូន  ភាព"
        },
        {
            "barcode": "171148859",
            "dpc": "03021111001",
            "name": "យ៉ែម យ៉ន"
        },
        {
            "barcode": "171148860",
            "dpc": "03021108201",
            "name": "មៀច សាមិត្ត"
        },
        {
            "barcode": "171148861",
            "dpc": "03021105401",
            "name": "ម៉ក់ បូណា"
        },
        {
            "barcode": "171148862",
            "dpc": "03021103401",
            "name": "ប៊ិន ផាន"
        },
        {
            "barcode": "171148863",
            "dpc": "03021120601",
            "name": "យោក សារឿន"
        },
        {
            "barcode": "171148864",
            "dpc": "03021103601",
            "name": "ប្រាក់ ឡាយ"
        },
        {
            "barcode": "171148865",
            "dpc": "03021132501",
            "name": "ស្រី ច័ន្ទលី"
        },
        {
            "barcode": "171148866",
            "dpc": "03021132401",
            "name": "រុន រតនា"
        },
        {
            "barcode": "171148867",
            "dpc": "03021132301",
            "name": "អ៊ុក ជា"
        },
        {
            "barcode": "171148868",
            "dpc": "03021132201",
            "name": "ពន្លវិជ្ជាកុមារកំព្រា"
        },
        {
            "barcode": "171148869",
            "dpc": "03021130401",
            "name": "ហុង ហឿន"
        },
        {
            "barcode": "171148870",
            "dpc": "03021126801",
            "name": "ម៉ន នី"
        },
        {
            "barcode": "171148871",
            "dpc": "03021126701",
            "name": "សុគន្ធ សុធា"
        },
        {
            "barcode": "171148872",
            "dpc": "03021103701",
            "name": "ភឿង   ឡាង"
        },
        {
            "barcode": "171148873",
            "dpc": "03021147501",
            "name": "ចាន់ លាងសុន"
        },
        {
            "barcode": "171148874",
            "dpc": "03021123801",
            "name": "យ៉ែម យ៉ន"
        },
        {
            "barcode": "171148875",
            "dpc": "03021121601",
            "name": "ហ៊ាង រ៉ាវី"
        },
        {
            "barcode": "171148876",
            "dpc": "03021111101",
            "name": "មាស គាំ (៦)"
        },
        {
            "barcode": "171148877",
            "dpc": "03021104101",
            "name": "ទាវ កៅ (២)"
        },
        {
            "barcode": "171148878",
            "dpc": "03021104001",
            "name": "ទាវ កៅ(១)"
        },
        {
            "barcode": "171148879",
            "dpc": "03021104301",
            "name": "ផាត រតនា"
        },
        {
            "barcode": "171148880",
            "dpc": "03021147301",
            "name": "សង់ ស៊ុនលាង"
        },
        {
            "barcode": "171148881",
            "dpc": "03021146301",
            "name": "កែវ សារឿន"
        },
        {
            "barcode": "171148882",
            "dpc": "03021145701",
            "name": "តាំង ហេង"
        },
        {
            "barcode": "171148883",
            "dpc": "03021126901",
            "name": "មិត្ត វុទ្ធា"
        },
        {
            "barcode": "171148884",
            "dpc": "03021124201",
            "name": "ជា អុំ"
        },
        {
            "barcode": "171148885",
            "dpc": "03021103901",
            "name": "ឈឿន ម៉ៅ"
        },
        {
            "barcode": "171148886",
            "dpc": "03021103801",
            "name": "មិត្ត សាវី"
        },
        {
            "barcode": "171148887",
            "dpc": "03021120301",
            "name": "គា  សេងហ៊ន"
        },
        {
            "barcode": "171148888",
            "dpc": "03021115001",
            "name": "ឈួម  ប៊ុនសឿត"
        },
        {
            "barcode": "171148889",
            "dpc": "03021113001",
            "name": "ឆឺយ  សារ៉ាត់"
        },
        {
            "barcode": "171148890",
            "dpc": "03021106401",
            "name": "ភាជ  ចាន់សុឆរីដា"
        },
        {
            "barcode": "171148891",
            "dpc": "03021115401",
            "name": "អុង ណារ៉ន"
        },
        {
            "barcode": "171148892",
            "dpc": "03021147401",
            "name": "ចាន់ ហ៊ាង"
        },
        {
            "barcode": "171148893",
            "dpc": "03021132901",
            "name": "គិត  ឆេងលី"
        },
        {
            "barcode": "171148894",
            "dpc": "03021132701",
            "name": "ឯម កែវ"
        },
        {
            "barcode": "171148895",
            "dpc": "03021132601",
            "name": "រ៉ាត់ ស៊ីថា"
        },
        {
            "barcode": "171148896",
            "dpc": "03021123401",
            "name": "ឡៃ ហូវ"
        },
        {
            "barcode": "171148897",
            "dpc": "03021121801",
            "name": "សេង វិសិទ្ធិ"
        },
        {
            "barcode": "171148898",
            "dpc": "03021115101",
            "name": "សុខ ធី"
        },
        {
            "barcode": "171148899",
            "dpc": "03021108101",
            "name": "ឡុង ណៃស៊ីម"
        },
        {
            "barcode": "171148900",
            "dpc": "03021108001",
            "name": "ឡុង ប៊ុនហេង"
        },
        {
            "barcode": "171148901",
            "dpc": "03021103201",
            "name": "គឹម​ ប៊ុនធឿន ២"
        },
        {
            "barcode": "171148902",
            "dpc": "03021147201",
            "name": "ង៉ែត  សាលីន"
        },
        {
            "barcode": "171148903",
            "dpc": "03021132801",
            "name": "ឈុំ  ស៊ីនាង"
        },
        {
            "barcode": "171148904",
            "dpc": "03021128701",
            "name": "ហែម សារឿន"
        },
        {
            "barcode": "171148905",
            "dpc": "03021122901",
            "name": "ទូច  គង់"
        },
        {
            "barcode": "171148906",
            "dpc": "03021121901",
            "name": "ជឿន ស្រីពៅ"
        },
        {
            "barcode": "171148907",
            "dpc": "03021118401",
            "name": "ឃុន  ហូយ"
        },
        {
            "barcode": "171148908",
            "dpc": "03021118301",
            "name": "ង៉ែត កន"
        },
        {
            "barcode": "171148909",
            "dpc": "03021115301",
            "name": "លី ហ៊"
        },
        {
            "barcode": "171148910",
            "dpc": "03021115201",
            "name": "ឈឿន សុភាព"
        },
        {
            "barcode": "171148911",
            "dpc": "03021113201",
            "name": "សុខ  មេត្តា"
        },
        {
            "barcode": "171148912",
            "dpc": "03021111401",
            "name": "សុខ  ហៀក"
        },
        {
            "barcode": "171148913",
            "dpc": "03021111301",
            "name": "ហៀង ធារ៉ា"
        },
        {
            "barcode": "171148914",
            "dpc": "03021103301",
            "name": "ម៉ៅ ធីតា"
        },
        {
            "barcode": "171148915",
            "dpc": "03021102801",
            "name": "អ៊ី គី"
        },
        {
            "barcode": "171148916",
            "dpc": "03021111601",
            "name": "បួន សុធី"
        },
        {
            "barcode": "171148917",
            "dpc": "03021105501",
            "name": "ឯម  ផល"
        },
        {
            "barcode": "171148918",
            "dpc": "03021118801",
            "name": "លី  ស៊ីណាត"
        },
        {
            "barcode": "171148919",
            "dpc": "03021118901",
            "name": "អ៊ាប   ស៊ីផុន"
        },
        {
            "barcode": "171148920",
            "dpc": "03021121301",
            "name": "សេង  ហៃ"
        },
        {
            "barcode": "171148921",
            "dpc": "03021123901",
            "name": "ថន  ដារ៉ា"
        },
        {
            "barcode": "171148922",
            "dpc": "03021124001",
            "name": "ទូច  សុខា"
        },
        {
            "barcode": "171148923",
            "dpc": "03021129001",
            "name": "អ៊ុំ   យឿន"
        },
        {
            "barcode": "171148924",
            "dpc": "03021129801",
            "name": "តឹង  ហុង"
        },
        {
            "barcode": "171148925",
            "dpc": "03021128601",
            "name": "ប៊ុយ នាង"
        },
        {
            "barcode": "171148926",
            "dpc": "03021136601",
            "name": "ឈុន ណាវី"
        },
        {
            "barcode": "171148927",
            "dpc": "03021118001",
            "name": "គុយ សុខ"
        },
        {
            "barcode": "171148928",
            "dpc": "03021128901",
            "name": "ឱ វ៉ាន់ស័ក្ក"
        },
        {
            "barcode": "171148929",
            "dpc": "03021122401",
            "name": "ពៅ សុង"
        },
        {
            "barcode": "171148930",
            "dpc": "03021128201",
            "name": "ឆាយ ម៉ាទីណាល់"
        },
        {
            "barcode": "171148931",
            "dpc": "03021105001",
            "name": "ឃុន ម៉េងហ៊ាង"
        },
        {
            "barcode": "171148932",
            "dpc": "03021104601",
            "name": "គៀង ស៊ន"
        },
        {
            "barcode": "171148933",
            "dpc": "03021117901",
            "name": "សេង សុទិន"
        },
        {
            "barcode": "171148934",
            "dpc": "03021122201",
            "name": "សេង សុភិន"
        },
        {
            "barcode": "171148935",
            "dpc": "03021137001",
            "name": "ឡុង សុខា"
        },
        {
            "barcode": "171148936",
            "dpc": "03021136901",
            "name": "សុខ សាមឿន"
        },
        {
            "barcode": "171148937",
            "dpc": "03021106701",
            "name": "សេក សាគុណ"
        },
        {
            "barcode": "171148938",
            "dpc": "03021104501",
            "name": "លឹម ឈុនស្រេង"
        },
        {
            "barcode": "171148939",
            "dpc": "03021131501",
            "name": "ជីង  ហ៊ួ"
        },
        {
            "barcode": "171148940",
            "dpc": "03021107101",
            "name": "ខេង ច័ន្ទណា"
        },
        {
            "barcode": "171148941",
            "dpc": "03021131101",
            "name": "ពិន ទី"
        },
        {
            "barcode": "171148942",
            "dpc": "03021100701",
            "name": "ជូ នាង"
        },
        {
            "barcode": "171148943",
            "dpc": "03021136701",
            "name": "ស៊ឹម យុទ្ធាសារ"
        },
        {
            "barcode": "171148944",
            "dpc": "03021101001",
            "name": "អួង ម៉ានី"
        },
        {
            "barcode": "171148945",
            "dpc": "03021101201",
            "name": "សៅ ថាច"
        },
        {
            "barcode": "171148946",
            "dpc": "03021101301",
            "name": "ផ្លុង បញ្ញារដ្ឋា"
        },
        {
            "barcode": "171148947",
            "dpc": "03021101401",
            "name": "វ៉ា សារុន"
        },
        {
            "barcode": "171148948",
            "dpc": "03021101501",
            "name": "ក្រៃ ថារ៉ា"
        },
        {
            "barcode": "171148949",
            "dpc": "03021101601",
            "name": "ប៊ូ គីម"
        },
        {
            "barcode": "171148950",
            "dpc": "03021101701",
            "name": "លាង ធាវី"
        },
        {
            "barcode": "171148951",
            "dpc": "03021136801",
            "name": "ជុំ កូយ"
        },
        {
            "barcode": "171148952",
            "dpc": "03021100901",
            "name": "មណ្ឌលសុខភាពស្វាយប៉ោ"
        },
        {
            "barcode": "171148953",
            "dpc": "03021100801",
            "name": "ណុប ហាវ"
        },
        {
            "barcode": "171148954",
            "dpc": "03021100201",
            "name": "គឹម សារុន"
        },
        {
            "barcode": "171148955",
            "dpc": "03021100301",
            "name": "រី ដែត"
        },
        {
            "barcode": "171148956",
            "dpc": "03021100401",
            "name": "នូ យ៉ាន"
        },
        {
            "barcode": "171148957",
            "dpc": "03021100601",
            "name": "ប៉ិច ទី"
        },
        {
            "barcode": "171148958",
            "dpc": "03021100501",
            "name": "អ៊ុង គឹមស៊ុន"
        },
        {
            "barcode": "171148959",
            "dpc": "03021148001",
            "name": "នេត នន់"
        },
        {
            "barcode": "171148960",
            "dpc": "03021100201",
            "name": "គឹម សារុន"
        },
        {
            "barcode": "171148961",
            "dpc": "03021129501",
            "name": "យិន យក់"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
