let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171138361",
            "dpc": "03031305801",
            "name": "សាន សុផល"
        },
        {
            "barcode": "171138362",
            "dpc": "03031305901",
            "name": "សុខ រ៉ុង"
        },
        {
            "barcode": "171138363",
            "dpc": "03031306001",
            "name": "ឡាំ ធៀន ១"
        },
        {
            "barcode": "171138364",
            "dpc": "03031306101",
            "name": "ឡាំ ធៀន ២"
        },
        {
            "barcode": "171138365",
            "dpc": "03031306201",
            "name": "អៀង សុគន្ធ"
        },
        {
            "barcode": "171138366",
            "dpc": "03031306301",
            "name": "ហៃ សុភ័ក្រ"
        },
        {
            "barcode": "171138367",
            "dpc": "03031306401",
            "name": "ម៉េង អ៊ីវ"
        },
        {
            "barcode": "171138368",
            "dpc": "03031306501",
            "name": "កុលាប កណិកា"
        },
        {
            "barcode": "171138369",
            "dpc": "03031306601",
            "name": "ហួត ទុយ"
        },
        {
            "barcode": "171138370",
            "dpc": "03031306701",
            "name": "គង់ ឌី"
        },
        {
            "barcode": "171138371",
            "dpc": "03031306801",
            "name": "សោម សារិទ្ធ"
        },
        {
            "barcode": "171138372",
            "dpc": "03031306901",
            "name": "ដាញ់ ធឹង"
        },
        {
            "barcode": "171138373",
            "dpc": "03031307001",
            "name": "សោម សុន"
        },
        {
            "barcode": "171138374",
            "dpc": "03031307101",
            "name": "អ៊ុក ម៉ៅ"
        },
        {
            "barcode": "171138375",
            "dpc": "03031307201",
            "name": "សិច ផល្លី"
        },
        {
            "barcode": "171138376",
            "dpc": "03031307301",
            "name": "គឹម រ៉ា"
        },
        {
            "barcode": "171138377",
            "dpc": "03031307401",
            "name": "ឈុន ហេង"
        },
        {
            "barcode": "171138378",
            "dpc": "03031307501",
            "name": "ហ៊ិន ចំរើន"
        },
        {
            "barcode": "171138379",
            "dpc": "03031307601",
            "name": "ងិន យីម"
        },
        {
            "barcode": "171138380",
            "dpc": "03031307701",
            "name": "យក់ អឿ"
        },
        {
            "barcode": "171138381",
            "dpc": "03031307801",
            "name": "អ៊ុច សុន"
        },
        {
            "barcode": "171138382",
            "dpc": "03031307901",
            "name": "ហ៊ាង ម៉េង"
        },
        {
            "barcode": "171138383",
            "dpc": "03031308001",
            "name": "សាន សុផល"
        },
        {
            "barcode": "171138384",
            "dpc": "03031308101",
            "name": "ចៅ កី"
        },
        {
            "barcode": "171138385",
            "dpc": "03031308201",
            "name": "សោ ភីនី"
        },
        {
            "barcode": "171138386",
            "dpc": "03031308301",
            "name": "ម៉េង វណ្ណារី"
        },
        {
            "barcode": "171138387",
            "dpc": "03031308401",
            "name": "ហេង ប៊ន"
        },
        {
            "barcode": "171138388",
            "dpc": "03031308501",
            "name": "តាំង ជុងខេង"
        },
        {
            "barcode": "171138389",
            "dpc": "03031308601",
            "name": "នង ស៊ុំ"
        },
        {
            "barcode": "171138390",
            "dpc": "03031308701",
            "name": "ធួន សាយ"
        },
        {
            "barcode": "171138391",
            "dpc": "03031308801",
            "name": "ណាំ ផេង"
        },
        {
            "barcode": "171138392",
            "dpc": "03031308901",
            "name": "លេង សាវុធ"
        },
        {
            "barcode": "171138393",
            "dpc": "03031309001",
            "name": "ឆាយ សារ៉េត"
        },
        {
            "barcode": "171138394",
            "dpc": "03031309101",
            "name": "ហុង ជ្រិន"
        },
        {
            "barcode": "171138395",
            "dpc": "03031309201",
            "name": "តែ ម៉ូវិធូន"
        },
        {
            "barcode": "171138396",
            "dpc": "03031309301",
            "name": "អៀង ហ៊ាង"
        },
        {
            "barcode": "171138397",
            "dpc": "03031309401",
            "name": "គឹម សឹង"
        },
        {
            "barcode": "171138398",
            "dpc": "03031309501",
            "name": "ជា សុផល"
        },
        {
            "barcode": "171138399",
            "dpc": "03031309601",
            "name": "ឈួន ហុង"
        },
        {
            "barcode": "171138400",
            "dpc": "03031309701",
            "name": "ជីវ ជា"
        },
        {
            "barcode": "171138401",
            "dpc": "03031309801",
            "name": "ហេង ជុង"
        },
        {
            "barcode": "171138402",
            "dpc": "03031309901",
            "name": "ឡៅ ឆាយទ្រី ១"
        },
        {
            "barcode": "171138403",
            "dpc": "03031310001",
            "name": "ឡៅ ឆាយទ្រី ២"
        },
        {
            "barcode": "171138404",
            "dpc": "03031310101",
            "name": "ចាន់ ទី"
        },
        {
            "barcode": "171138405",
            "dpc": "03031310201",
            "name": "ជី សារ៉េត"
        },
        {
            "barcode": "171138406",
            "dpc": "03031310301",
            "name": "វឹង ឡុង"
        },
        {
            "barcode": "171138407",
            "dpc": "03031310401",
            "name": "ម៉ុន មីកា"
        },
        {
            "barcode": "171138408",
            "dpc": "03031310501",
            "name": "ហួន ហ៊ន"
        },
        {
            "barcode": "171138409",
            "dpc": "03031310601",
            "name": "អ៊ឹង ងួន"
        },
        {
            "barcode": "171138410",
            "dpc": "03031310701",
            "name": "រី រឿន"
        },
        {
            "barcode": "171138411",
            "dpc": "03031310801",
            "name": "គង់ វុត្ថា"
        },
        {
            "barcode": "171138412",
            "dpc": "03031310901",
            "name": "ស៊ិក សុរ័ត្នន៍"
        },
        {
            "barcode": "171138413",
            "dpc": "03031311001",
            "name": "ជាប លាង"
        },
        {
            "barcode": "171138414",
            "dpc": "03031311101",
            "name": "យូ គឹមជូ"
        },
        {
            "barcode": "171138415",
            "dpc": "03031311301",
            "name": "យ៉ម ចំរើន"
        },
        {
            "barcode": "171138416",
            "dpc": "03031311401",
            "name": "ម៉ម ម៉ាច"
        },
        {
            "barcode": "171138417",
            "dpc": "03031311501",
            "name": "គឹម ឡេង"
        },
        {
            "barcode": "171138418",
            "dpc": "03031311601",
            "name": "ជា ពិសិដ្ឋ"
        },
        {
            "barcode": "171138419",
            "dpc": "03031311701",
            "name": "ម៉ង់ ស្វាយគីរី"
        },
        {
            "barcode": "171138420",
            "dpc": "03031311801",
            "name": "គី គឹមហឿង ១"
        },
        {
            "barcode": "171138421",
            "dpc": "03031311901",
            "name": "គី គឹមហឿង ២"
        },
        {
            "barcode": "171138422",
            "dpc": "03031300101",
            "name": "ភូ ស៊ន់"
        },
        {
            "barcode": "171138423",
            "dpc": "03031300201",
            "name": "ឡុង សុខា"
        },
        {
            "barcode": "171138424",
            "dpc": "03031300301",
            "name": "ស៊ឹម វណ្ណៈ"
        },
        {
            "barcode": "171138425",
            "dpc": "03031300501",
            "name": "ពៅ ជ្រុន"
        },
        {
            "barcode": "171138426",
            "dpc": "03031300601",
            "name": "ជា ផេង"
        },
        {
            "barcode": "171138427",
            "dpc": "03031300701",
            "name": "លី ឡាង"
        },
        {
            "barcode": "171138428",
            "dpc": "03031300801",
            "name": "នូ សុខុន"
        },
        {
            "barcode": "171138429",
            "dpc": "03031301201",
            "name": "នក់ ហ្វួយ"
        },
        {
            "barcode": "171138430",
            "dpc": "03031300901",
            "name": "នង ប៊ុនធឿន"
        },
        {
            "barcode": "171138431",
            "dpc": "03031301001",
            "name": "អ៊ូច សុផៃ"
        },
        {
            "barcode": "171138432",
            "dpc": "03031301101",
            "name": "សូ ប៉ូឃន"
        },
        {
            "barcode": "171138433",
            "dpc": "03031301401",
            "name": "កែវ កាមីន"
        },
        {
            "barcode": "171138434",
            "dpc": "03031301501",
            "name": "គី ងួន"
        },
        {
            "barcode": "171138435",
            "dpc": "03031301601",
            "name": "តែ ម៉េងសួរ"
        },
        {
            "barcode": "171138436",
            "dpc": "03031301701",
            "name": "ភូ ប៉ូយ"
        },
        {
            "barcode": "171138437",
            "dpc": "03031301801",
            "name": "តាន់ កុសល"
        },
        {
            "barcode": "171138438",
            "dpc": "03031301901",
            "name": "ហេង យ៉ាត"
        },
        {
            "barcode": "171138439",
            "dpc": "03031302001",
            "name": "តាំង លីងួន"
        },
        {
            "barcode": "171138440",
            "dpc": "03031302101",
            "name": "កែវ នីម"
        },
        {
            "barcode": "171138441",
            "dpc": "03031302201",
            "name": "ពេជ្រ អៀម"
        },
        {
            "barcode": "171138442",
            "dpc": "03031302301",
            "name": "យូ សាង"
        },
        {
            "barcode": "171138443",
            "dpc": "03031302401",
            "name": "លាវ សុខម៉េង"
        },
        {
            "barcode": "171138444",
            "dpc": "03031302501",
            "name": "ចៅ កាំឈិញ"
        },
        {
            "barcode": "171138445",
            "dpc": "03031302601",
            "name": "នី ចំរើន"
        },
        {
            "barcode": "171138446",
            "dpc": "03031302701",
            "name": "ហ៊ុន វិបុល"
        },
        {
            "barcode": "171138447",
            "dpc": "03031302801",
            "name": "ខៀវ ចៃ"
        },
        {
            "barcode": "171138448",
            "dpc": "03031302901",
            "name": "លី ម៉េង"
        },
        {
            "barcode": "171138449",
            "dpc": "03031303001",
            "name": "អោម ផេង"
        },
        {
            "barcode": "171138450",
            "dpc": "03031303101",
            "name": "លក់ គ្រី"
        },
        {
            "barcode": "171138451",
            "dpc": "03031303201",
            "name": "តាំង ឈុន"
        },
        {
            "barcode": "171138452",
            "dpc": "03031303301",
            "name": "ម៉ក់ ហុង"
        },
        {
            "barcode": "171138453",
            "dpc": "03031303501",
            "name": "ព្រំ ឡាក់"
        },
        {
            "barcode": "171138454",
            "dpc": "03031303701",
            "name": "អ៊ឹង  ឡា"
        },
        {
            "barcode": "171138455",
            "dpc": "03031303801",
            "name": "ឡុច តង"
        },
        {
            "barcode": "171138456",
            "dpc": "03031303901",
            "name": "គឹម វ៉ាន់"
        },
        {
            "barcode": "171138457",
            "dpc": "03031304001",
            "name": "ខ្ចៅ ទូច"
        },
        {
            "barcode": "171138458",
            "dpc": "03031304101",
            "name": "ជឹម ជឿន"
        },
        {
            "barcode": "171138459",
            "dpc": "03031304201",
            "name": "យ៉ាន់ សារឿន"
        },
        {
            "barcode": "171138460",
            "dpc": "03031304301",
            "name": "អ៊ឹម យិន"
        },
        {
            "barcode": "171138461",
            "dpc": "03031304401",
            "name": "ដួង លី"
        },
        {
            "barcode": "171138462",
            "dpc": "03031304501",
            "name": "ទីម យេត"
        },
        {
            "barcode": "171138463",
            "dpc": "03031304601",
            "name": "ឈឹម សួរ"
        },
        {
            "barcode": "171138464",
            "dpc": "03031304701",
            "name": "សេង សុន"
        },
        {
            "barcode": "171138465",
            "dpc": "03031304801",
            "name": "សាន់ ហាក់"
        },
        {
            "barcode": "171138466",
            "dpc": "03031304901",
            "name": "គង់ កុសល"
        },
        {
            "barcode": "171138467",
            "dpc": "03031305001",
            "name": "ពុន សែ"
        },
        {
            "barcode": "171138468",
            "dpc": "03031305101",
            "name": "តាន់ បុប្ផារ័ត្ន"
        },
        {
            "barcode": "171138469",
            "dpc": "03031305201",
            "name": "សាន ផល្លីន"
        },
        {
            "barcode": "171138470",
            "dpc": "03031305301",
            "name": "គឹម អេង"
        },
        {
            "barcode": "171138471",
            "dpc": "03031305501",
            "name": "ឡុង ខេន"
        },
        {
            "barcode": "171138472",
            "dpc": "03031305601",
            "name": "សក់ ចន្ទ្រាវុធ"
        },
        {
            "barcode": "171138473",
            "dpc": "03031305701",
            "name": "តូច  សារិន"
        },
        {
            "barcode": "171138474",
            "dpc": "03031326201",
            "name": "ទេព  បេងសួរ"
        },
        {
            "barcode": "171138475",
            "dpc": "03031326001",
            "name": "ម៉េង  លាង"
        },
        {
            "barcode": "171138476",
            "dpc": "03031325901",
            "name": "អ៊ុយ  គង់"
        },
        {
            "barcode": "171138477",
            "dpc": "03031325701",
            "name": "យស់  បាន"
        },
        {
            "barcode": "171138478",
            "dpc": "03031325601",
            "name": "អ៊ុយ  ជុំ"
        },
        {
            "barcode": "171138479",
            "dpc": "03031325501",
            "name": "អ៊ឹម  កោវិត"
        },
        {
            "barcode": "171138480",
            "dpc": "03031325401",
            "name": "អួង  ខេង"
        },
        {
            "barcode": "171138481",
            "dpc": "03031325301",
            "name": "ហុក  ឈួន"
        },
        {
            "barcode": "171138482",
            "dpc": "03031325201",
            "name": "កែវ  ប៉ក់"
        },
        {
            "barcode": "171138483",
            "dpc": "03031325101",
            "name": "អេង  ង៉ោ"
        },
        {
            "barcode": "171138484",
            "dpc": "03031325001",
            "name": "នូ  ហានី"
        },
        {
            "barcode": "171138485",
            "dpc": "03031324901",
            "name": "ឆាយ  ទូច"
        },
        {
            "barcode": "171138486",
            "dpc": "03031324801",
            "name": "ឆា  ស៊ីសុវត្ថា"
        },
        {
            "barcode": "171138487",
            "dpc": "03031324701",
            "name": "ស៊ុន   ប៊ុនឡេង"
        },
        {
            "barcode": "171138488",
            "dpc": "03031324601",
            "name": "ឡោ  សារឹម"
        },
        {
            "barcode": "171138489",
            "dpc": "03031330901",
            "name": "សោ  គឹមកូយ"
        },
        {
            "barcode": "171138490",
            "dpc": "03031330801",
            "name": "ហ៊ុល  សុមុន្នី"
        },
        {
            "barcode": "171138491",
            "dpc": "03031330701",
            "name": "មាស  ប៊ុនថេន"
        },
        {
            "barcode": "171138492",
            "dpc": "03031330601",
            "name": "ហា  សេង"
        },
        {
            "barcode": "171138493",
            "dpc": "03031330501",
            "name": "បួន  ណារ៉ូ"
        },
        {
            "barcode": "171138494",
            "dpc": "03031330401",
            "name": "លី  គឹមលាង"
        },
        {
            "barcode": "171138495",
            "dpc": "03031330301",
            "name": "ធម្ម  សុផា"
        },
        {
            "barcode": "171138496",
            "dpc": "03031330201",
            "name": "ឡុង  គឹមតេង"
        },
        {
            "barcode": "171138497",
            "dpc": "03031330101",
            "name": "ម៉ឺន  យ៉ាន"
        },
        {
            "barcode": "171138498",
            "dpc": "03031330001",
            "name": "ថោង  ប៊ុនធឿន"
        },
        {
            "barcode": "171138499",
            "dpc": "03031329901",
            "name": "ឌិត  យ៉ាន់"
        },
        {
            "barcode": "171138500",
            "dpc": "03031329801",
            "name": "អ៊ុង  នុត"
        },
        {
            "barcode": "171138501",
            "dpc": "03031329701",
            "name": "អ៊ឹម  នាង"
        },
        {
            "barcode": "171138502",
            "dpc": "03031329601",
            "name": "មាស  លី"
        },
        {
            "barcode": "171138503",
            "dpc": "03031329501",
            "name": "ទេព  ណាត្យ"
        },
        {
            "barcode": "171138504",
            "dpc": "03031329401",
            "name": "លឹម  គឹមភាព"
        },
        {
            "barcode": "171138505",
            "dpc": "03031329301",
            "name": "យូ  សាម៉េត ១"
        },
        {
            "barcode": "171138506",
            "dpc": "03031329201",
            "name": "យូ  សាម៉េត ២"
        },
        {
            "barcode": "171138507",
            "dpc": "03031323901",
            "name": "ជា  ហេង"
        },
        {
            "barcode": "171138508",
            "dpc": "03031329001",
            "name": "តេង  ច័ន្ទថុល"
        },
        {
            "barcode": "171138509",
            "dpc": "03031326501",
            "name": "ព្រឹម  សាលី"
        },
        {
            "barcode": "171138510",
            "dpc": "03031346601",
            "name": "ពិន  ប៊ុនហ៊ត"
        },
        {
            "barcode": "171138511",
            "dpc": "03031346701",
            "name": "ឈាង  គី"
        },
        {
            "barcode": "171138512",
            "dpc": "03031346801",
            "name": "អួង   សន"
        },
        {
            "barcode": "171138513",
            "dpc": "03031346901",
            "name": "កែវ  មនោ"
        },
        {
            "barcode": "171138514",
            "dpc": "03031347101",
            "name": "កៅ  សុខន"
        },
        {
            "barcode": "171138515",
            "dpc": "03031347201",
            "name": "វិហារអ្នកតាចិន"
        },
        {
            "barcode": "171138516",
            "dpc": "03031347301",
            "name": "ម៉ៃ  ហ៊ាង"
        },
        {
            "barcode": "171138517",
            "dpc": "03031347501",
            "name": "សុខ  គៀត"
        },
        {
            "barcode": "171138518",
            "dpc": "03031347601",
            "name": "ហ៊ីម  ស៊ីស"
        },
        {
            "barcode": "171138519",
            "dpc": "03031347701",
            "name": "ធឹក  សាធឿន"
        },
        {
            "barcode": "171138520",
            "dpc": "03031347801",
            "name": "ជូ  គឹមរិន"
        },
        {
            "barcode": "171138521",
            "dpc": "03031347901",
            "name": "ឈុន  ស្រេង"
        },
        {
            "barcode": "171138522",
            "dpc": "03031344101",
            "name": "ឈឿម  សុវណ្ណ"
        },
        {
            "barcode": "171138523",
            "dpc": "03031344201",
            "name": "សឹង  សារឿន"
        },
        {
            "barcode": "171138524",
            "dpc": "03031344301",
            "name": "អុំ   លឿម"
        },
        {
            "barcode": "171138525",
            "dpc": "03031344501",
            "name": "ហឹង  សៀន"
        },
        {
            "barcode": "171138526",
            "dpc": "03031344601",
            "name": "យឺន  ម៉ិ"
        },
        {
            "barcode": "171138527",
            "dpc": "03031344701",
            "name": "ម៉ៃ  ហ៊ាង"
        },
        {
            "barcode": "171138528",
            "dpc": "03031344801",
            "name": "តោ  ហួត"
        },
        {
            "barcode": "171138529",
            "dpc": "03031344901",
            "name": "អេង  ចាន់ម៉ាន់"
        },
        {
            "barcode": "171138530",
            "dpc": "03031345001",
            "name": "តោ  ភិសិដ្ឋ"
        },
        {
            "barcode": "171138531",
            "dpc": "03031345101",
            "name": "យូ  គង់"
        },
        {
            "barcode": "171138532",
            "dpc": "03031345301",
            "name": "អ៊ិត  តាន់"
        },
        {
            "barcode": "171138533",
            "dpc": "03031345401",
            "name": "សុខ  ជា"
        },
        {
            "barcode": "171138534",
            "dpc": "03031345501",
            "name": "ហ៊ឹម  សារ៉េត"
        },
        {
            "barcode": "171138535",
            "dpc": "03031345801",
            "name": "នូ  នេតត្រា"
        },
        {
            "barcode": "171138536",
            "dpc": "03031345901",
            "name": "យី  សារ៉ូ"
        },
        {
            "barcode": "171138537",
            "dpc": "03031346001",
            "name": "ជូង  ពីង"
        },
        {
            "barcode": "171138538",
            "dpc": "03031346101",
            "name": "ចាន់  បឿម"
        },
        {
            "barcode": "171138539",
            "dpc": "03031346201",
            "name": "ម៉េង  លាង"
        },
        {
            "barcode": "171138540",
            "dpc": "03031346301",
            "name": "សុខ  អេង"
        },
        {
            "barcode": "171138541",
            "dpc": "03031346401",
            "name": "ពន់  ឃីម"
        },
        {
            "barcode": "171138542",
            "dpc": "03031346501",
            "name": "កែវ  វីរៈ"
        },
        {
            "barcode": "171138543",
            "dpc": "03031326701",
            "name": "សុច  សារុំ"
        },
        {
            "barcode": "171138544",
            "dpc": "03031326801",
            "name": "អួង  ខេង"
        },
        {
            "barcode": "171138545",
            "dpc": "03031326901",
            "name": "សោម  សាឃឿង"
        },
        {
            "barcode": "171138546",
            "dpc": "03031327001",
            "name": "លេង  ហួរ"
        },
        {
            "barcode": "171138547",
            "dpc": "03031327101",
            "name": "មាស  សុវណ្ណ"
        },
        {
            "barcode": "171138548",
            "dpc": "03031327201",
            "name": "សុខ ធី"
        },
        {
            "barcode": "171138549",
            "dpc": "03031327301",
            "name": "សុខ  ធា"
        },
        {
            "barcode": "171138550",
            "dpc": "03031327401",
            "name": "សឹង  ជឺ"
        },
        {
            "barcode": "171138551",
            "dpc": "03031327501",
            "name": "ហេង  លាង"
        },
        {
            "barcode": "171138552",
            "dpc": "03031327601",
            "name": "ព្រឹម   សាលី"
        },
        {
            "barcode": "171138553",
            "dpc": "03031327701",
            "name": "ម៉េង  វុទ្ធា"
        },
        {
            "barcode": "171138554",
            "dpc": "03031328001",
            "name": "ជុក  គឹមហាប់"
        },
        {
            "barcode": "171138555",
            "dpc": "03031328101",
            "name": "ឈឺន  លឿប"
        },
        {
            "barcode": "171138556",
            "dpc": "03031328301",
            "name": "សេង  ផូ"
        },
        {
            "barcode": "171138557",
            "dpc": "03031328401",
            "name": "អួល  រ័ត្ន"
        },
        {
            "barcode": "171138558",
            "dpc": "03031328501",
            "name": "សាត  សុធាន"
        },
        {
            "barcode": "171138559",
            "dpc": "03031328601",
            "name": "ចាន់  ថា"
        },
        {
            "barcode": "171138560",
            "dpc": "03031328701",
            "name": "ស៊ឹម  វ៉ាត់"
        },
        {
            "barcode": "171138561",
            "dpc": "03031328801",
            "name": "ដួង  កក់"
        },
        {
            "barcode": "171138562",
            "dpc": "03031328901",
            "name": "វណ្ណ  សុមាលី"
        },
        {
            "barcode": "171138563",
            "dpc": "03031312601",
            "name": "តេង  ប៊ុនរ័ត្ន"
        },
        {
            "barcode": "171138564",
            "dpc": "03031312701",
            "name": "ណៃ  ស៊្រុន"
        },
        {
            "barcode": "171138565",
            "dpc": "03031312801",
            "name": "ហេង  សុខា"
        },
        {
            "barcode": "171138566",
            "dpc": "03031312901",
            "name": "ហេង  លីម"
        },
        {
            "barcode": "171138567",
            "dpc": "03031313001",
            "name": "អឿន  សំអាត"
        },
        {
            "barcode": "171138568",
            "dpc": "03031313101",
            "name": "សៅ  ទី"
        },
        {
            "barcode": "171138569",
            "dpc": "03031313201",
            "name": "ស្វាយ សុឃីម"
        },
        {
            "barcode": "171138570",
            "dpc": "03031313301",
            "name": "តាន់  តេង"
        },
        {
            "barcode": "171138571",
            "dpc": "03031313401",
            "name": "ជូ  គង់"
        },
        {
            "barcode": "171138572",
            "dpc": "03031313501",
            "name": "ឈួន  សារ៉ាត់"
        },
        {
            "barcode": "171138573",
            "dpc": "03031313601",
            "name": "អ៊ី  ចាន់នឿន"
        },
        {
            "barcode": "171138574",
            "dpc": "03031313701",
            "name": "អ៊ុយ  គង់"
        },
        {
            "barcode": "171138575",
            "dpc": "03031313801",
            "name": "សេង  ហ៊ួរ ២"
        },
        {
            "barcode": "171138576",
            "dpc": "03031313901",
            "name": "កែវ  សុខជា"
        },
        {
            "barcode": "171138577",
            "dpc": "03031314001",
            "name": "ប៊ី សួ"
        },
        {
            "barcode": "171138578",
            "dpc": "03031314201",
            "name": "សេង  ហួរ"
        },
        {
            "barcode": "171138579",
            "dpc": "03031314301",
            "name": "គឹម  សារឿន"
        },
        {
            "barcode": "171138580",
            "dpc": "03031314401",
            "name": "អឿ  សៀង"
        },
        {
            "barcode": "171138581",
            "dpc": "03031314501",
            "name": "គា  ហេង"
        },
        {
            "barcode": "171138582",
            "dpc": "03031314601",
            "name": "ប៉ោ  ស៊ីណា"
        },
        {
            "barcode": "171138583",
            "dpc": "03031314701",
            "name": "ង៉ែត  គី"
        },
        {
            "barcode": "171138584",
            "dpc": "03031314901",
            "name": "លឹម  ដារ៉ា"
        },
        {
            "barcode": "171138585",
            "dpc": "03031315001",
            "name": "មុំ   ហ៊ាង"
        },
        {
            "barcode": "171138586",
            "dpc": "03031315101",
            "name": "ទី  សាន"
        },
        {
            "barcode": "171138587",
            "dpc": "03031315201",
            "name": "ប៉ុញ  ឧត្តម"
        },
        {
            "barcode": "171138588",
            "dpc": "03031315301",
            "name": "ភួយ  លាងចេង"
        },
        {
            "barcode": "171138589",
            "dpc": "03031315401",
            "name": "គុជ  ជរ"
        },
        {
            "barcode": "171138590",
            "dpc": "03031315501",
            "name": "ឈឹម  សុវណ្ណ"
        },
        {
            "barcode": "171138591",
            "dpc": "03031315601",
            "name": "ភឿក  រ៉ានី"
        },
        {
            "barcode": "171138592",
            "dpc": "03031315701",
            "name": "ឈួន  សុផល"
        },
        {
            "barcode": "171138593",
            "dpc": "03031315801",
            "name": "សុខ  ពុធ"
        },
        {
            "barcode": "171138594",
            "dpc": "03031315901",
            "name": "អៀង  ស៊ីណា"
        },
        {
            "barcode": "171138595",
            "dpc": "03031316001",
            "name": "អៀង  សុភាព"
        },
        {
            "barcode": "171138596",
            "dpc": "03031316101",
            "name": "ឆាយ  រ៉ង"
        },
        {
            "barcode": "171138597",
            "dpc": "03031316201",
            "name": "ណាម  កេតរ៉ា"
        },
        {
            "barcode": "171138598",
            "dpc": "03031316301",
            "name": "ថុត  ប៊ុនឈិន"
        },
        {
            "barcode": "171138599",
            "dpc": "03031316401",
            "name": "លឹម  ចាន់ថន"
        },
        {
            "barcode": "171138600",
            "dpc": "03031316501",
            "name": "ហឿង  ឈុន"
        },
        {
            "barcode": "171138601",
            "dpc": "03031316601",
            "name": "ភួង  ចំរើន"
        },
        {
            "barcode": "171138602",
            "dpc": "03031316701",
            "name": "ងួន  ឆាយ"
        },
        {
            "barcode": "171138603",
            "dpc": "03031316801",
            "name": "កៅ  ហួរ"
        },
        {
            "barcode": "171138604",
            "dpc": "03031316901",
            "name": "អ៊ុយ  លីវ"
        },
        {
            "barcode": "171138605",
            "dpc": "03031317001",
            "name": "ជូ  ចំរើន"
        },
        {
            "barcode": "171138606",
            "dpc": "03031317101",
            "name": "ប៊ូ  កិត្យា"
        },
        {
            "barcode": "171138607",
            "dpc": "03031317201",
            "name": "យូ  ទីនី"
        },
        {
            "barcode": "171138608",
            "dpc": "03031317301",
            "name": "ញឹម  ម៉ែន"
        },
        {
            "barcode": "171138609",
            "dpc": "03031317401",
            "name": "ឆូយ  សុគន្ធ"
        },
        {
            "barcode": "171138610",
            "dpc": "03031317501",
            "name": "ង៉ា  ឃីម"
        },
        {
            "barcode": "171138611",
            "dpc": "03031317601",
            "name": "អួង  ម៉ានី ១"
        },
        {
            "barcode": "171138612",
            "dpc": "03031317701",
            "name": "សេង  រតនៈ"
        },
        {
            "barcode": "171138613",
            "dpc": "03031317801",
            "name": "សែម សុខា"
        },
        {
            "barcode": "171138614",
            "dpc": "03031317901",
            "name": "ម៉ៅ  រ័ត្នមុនី"
        },
        {
            "barcode": "171138615",
            "dpc": "03031318001",
            "name": "លាស់   ថេត"
        },
        {
            "barcode": "171138616",
            "dpc": "03031318101",
            "name": "ចាន់  ដាវឹង"
        },
        {
            "barcode": "171138617",
            "dpc": "03031318201",
            "name": "ផាត់  សុខលាង ១"
        },
        {
            "barcode": "171138618",
            "dpc": "03031318301",
            "name": "ផាត់  សុខលាង​​ ២"
        },
        {
            "barcode": "171138619",
            "dpc": "03031318401",
            "name": "ហ៊ាង  នូ"
        },
        {
            "barcode": "171138620",
            "dpc": "03031318501",
            "name": "ហឿង  ណៃឈុន"
        },
        {
            "barcode": "171138621",
            "dpc": "03031318601",
            "name": "អឿ  គឹមហឿង"
        },
        {
            "barcode": "171138622",
            "dpc": "03031318701",
            "name": "យឹម  សំបូ"
        },
        {
            "barcode": "171138623",
            "dpc": "03031318901",
            "name": "រស់  សុផាត"
        },
        {
            "barcode": "171138624",
            "dpc": "03031319001",
            "name": "ហេង  លីម"
        },
        {
            "barcode": "171138625",
            "dpc": "03031312401",
            "name": "ឌួង  គឹមស៊ន"
        },
        {
            "barcode": "171138626",
            "dpc": "03031322801",
            "name": "អ៊ឹម  ឈួម"
        },
        {
            "barcode": "171138627",
            "dpc": "03031322701",
            "name": "ស  ស៊ីវន"
        },
        {
            "barcode": "171138628",
            "dpc": "03031322601",
            "name": "បួន  គឹមហាវ"
        },
        {
            "barcode": "171138629",
            "dpc": "03031322501",
            "name": "ជួន  ប៊ុនធុល"
        },
        {
            "barcode": "171138630",
            "dpc": "03031322401",
            "name": "គង់  សារិន"
        },
        {
            "barcode": "171138631",
            "dpc": "03031322301",
            "name": "លី  ជា"
        },
        {
            "barcode": "171138632",
            "dpc": "03031322201",
            "name": "សូ   សារុន"
        },
        {
            "barcode": "171138633",
            "dpc": "03031322101",
            "name": "បែន  ផន"
        },
        {
            "barcode": "171138634",
            "dpc": "03031322001",
            "name": "ឃឹម  សាមិត"
        },
        {
            "barcode": "171138635",
            "dpc": "03031321901",
            "name": "តន់  ប៊ុនរឿន"
        },
        {
            "barcode": "171138636",
            "dpc": "03031321801",
            "name": "នួន  តុន"
        },
        {
            "barcode": "171138637",
            "dpc": "03031321701",
            "name": "តាន់  អ៊ីវន"
        },
        {
            "barcode": "171138638",
            "dpc": "03031321601",
            "name": "លឹម  ឡាយ"
        },
        {
            "barcode": "171138639",
            "dpc": "03031321501",
            "name": "អ៊ូច  សុផៃ"
        },
        {
            "barcode": "171138640",
            "dpc": "03031321401",
            "name": "កៅ  អេង"
        },
        {
            "barcode": "171138641",
            "dpc": "03031321301",
            "name": "ហាក់  សោភ័ណ"
        },
        {
            "barcode": "171138642",
            "dpc": "03031321101",
            "name": "លឹម  គឹមស៊ា"
        },
        {
            "barcode": "171138643",
            "dpc": "03031321001",
            "name": "វឿត  សុវណ្ណ"
        },
        {
            "barcode": "171138644",
            "dpc": "03031320901",
            "name": "អោម  សាវេត"
        },
        {
            "barcode": "171138645",
            "dpc": "03031320801",
            "name": "ប៉ាវ  ឈុនលីម"
        },
        {
            "barcode": "171138646",
            "dpc": "03031320601",
            "name": "ឡុង  គឹមឆេង"
        },
        {
            "barcode": "171138647",
            "dpc": "03031320401",
            "name": "លី  សោភ័ណ"
        },
        {
            "barcode": "171138648",
            "dpc": "03031320301",
            "name": "សៅ  ដារ៉ានិមិត្ត"
        },
        {
            "barcode": "171138649",
            "dpc": "03031320201",
            "name": "ឡៅ  ជាងគី"
        },
        {
            "barcode": "171138650",
            "dpc": "03031320101",
            "name": "សក់  មី"
        },
        {
            "barcode": "171138651",
            "dpc": "03031320001",
            "name": "ពិន  កុសល"
        },
        {
            "barcode": "171138652",
            "dpc": "03031319901",
            "name": "ដុះ  វណ្ណរស្មី"
        },
        {
            "barcode": "171138653",
            "dpc": "03031319801",
            "name": "នូ  សុខុម"
        },
        {
            "barcode": "171138654",
            "dpc": "03031324401",
            "name": "យ៉ាន  បូផៃ"
        },
        {
            "barcode": "171138655",
            "dpc": "03031324201",
            "name": "មាស  សាន"
        },
        {
            "barcode": "171138656",
            "dpc": "03031324101",
            "name": "ប៊ុត  គឹមស៊ាន"
        },
        {
            "barcode": "171138657",
            "dpc": "03031324001",
            "name": "ឡុង  សេង"
        },
        {
            "barcode": "171138658",
            "dpc": "03031323801",
            "name": "ចាន់  សេរីឆុង"
        },
        {
            "barcode": "171138659",
            "dpc": "03031323701",
            "name": "ហែម   គឹមហូ"
        },
        {
            "barcode": "171138660",
            "dpc": "03031323601",
            "name": "ជេ  រៀន"
        },
        {
            "barcode": "171138661",
            "dpc": "03031323501",
            "name": "ប៉េង  សុខឃីម"
        },
        {
            "barcode": "171138662",
            "dpc": "03031323401",
            "name": "ផូង  ឌិញ"
        },
        {
            "barcode": "171138663",
            "dpc": "03031323201",
            "name": "អ៊ឹង  ឡា"
        },
        {
            "barcode": "171138664",
            "dpc": "03031323101",
            "name": "ទេន   ភឹម"
        },
        {
            "barcode": "171138665",
            "dpc": "03031323001",
            "name": "ស  ណារ៉យ"
        },
        {
            "barcode": "171138666",
            "dpc": "03031322901",
            "name": "ស្រី  អឿន"
        },
        {
            "barcode": "171138667",
            "dpc": "03031331601",
            "name": "ទៀង  ចិន្តា"
        },
        {
            "barcode": "171138668",
            "dpc": "03031331701",
            "name": "សួស  ឆេង"
        },
        {
            "barcode": "171138669",
            "dpc": "03031331801",
            "name": "ទេព  គឹមហេង"
        },
        {
            "barcode": "171138670",
            "dpc": "03031331901",
            "name": "ទុយ  វុត្ថា"
        },
        {
            "barcode": "171138671",
            "dpc": "03031332001",
            "name": "សុខ  ស៊ីវ"
        },
        {
            "barcode": "171138672",
            "dpc": "03031332101",
            "name": "មាស  ប៊ុនធឿន"
        },
        {
            "barcode": "171138673",
            "dpc": "03031332201",
            "name": "សេក  សំបូរ"
        },
        {
            "barcode": "171138674",
            "dpc": "03031332301",
            "name": "ប៉ាន់  សៀក"
        },
        {
            "barcode": "171138675",
            "dpc": "03031332401",
            "name": "យូ  ណារ៉ុង"
        },
        {
            "barcode": "171138676",
            "dpc": "03031332501",
            "name": "អ៊ុក  ចាយ"
        },
        {
            "barcode": "171138677",
            "dpc": "03031332601",
            "name": "ពុត  ជួប"
        },
        {
            "barcode": "171138678",
            "dpc": "03031332701",
            "name": "ទូច  គឹមធុច"
        },
        {
            "barcode": "171138679",
            "dpc": "03031332801",
            "name": "នី  សុភាព"
        },
        {
            "barcode": "171138680",
            "dpc": "03031332901",
            "name": "អៀង  ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171138681",
            "dpc": "03031333001",
            "name": "អ៊ិត ផល្លា"
        },
        {
            "barcode": "171138682",
            "dpc": "03031333101",
            "name": "ប៉ា    ហាក់"
        },
        {
            "barcode": "171138683",
            "dpc": "03031333201",
            "name": "នុយ  ចំរ៉ុង"
        },
        {
            "barcode": "171138684",
            "dpc": "03031333401",
            "name": "ចៅ  គឹមយ៉ាត"
        },
        {
            "barcode": "171138685",
            "dpc": "03031333501",
            "name": "សោ  គឹមហៀក"
        },
        {
            "barcode": "171138686",
            "dpc": "03031333601",
            "name": "ប្លុង  សាវឿន"
        },
        {
            "barcode": "171138687",
            "dpc": "03031333701",
            "name": "ជីវ  យ៉ា"
        },
        {
            "barcode": "171138688",
            "dpc": "03031333801",
            "name": "ភោគ  កិច្ច"
        },
        {
            "barcode": "171138689",
            "dpc": "03031333901",
            "name": "រុណ  រាសី"
        },
        {
            "barcode": "171138690",
            "dpc": "03031334001",
            "name": "ម៉ង់  សំអាល់"
        },
        {
            "barcode": "171138691",
            "dpc": "03031334101",
            "name": "រឿង  ណារ៉ុង"
        },
        {
            "barcode": "171138692",
            "dpc": "03031334201",
            "name": "សោ ថងឌី"
        },
        {
            "barcode": "171138693",
            "dpc": "03031334301",
            "name": "សុខ  សេង"
        },
        {
            "barcode": "171138694",
            "dpc": "03031334401",
            "name": "ស៊ិន  នឿប"
        },
        {
            "barcode": "171138695",
            "dpc": "03031334501",
            "name": "តាំង  លីហ៊ុន"
        },
        {
            "barcode": "171138696",
            "dpc": "03031334601",
            "name": "យ៉ែម  សាវឿត"
        },
        {
            "barcode": "171138697",
            "dpc": "03031331101",
            "name": "ម៉ា  គឹមជន"
        },
        {
            "barcode": "171138698",
            "dpc": "03031331001",
            "name": "យ៉ែម  សាវឿត"
        },
        {
            "barcode": "171138699",
            "dpc": "03031331501",
            "name": "ក្លិន  ឌី"
        },
        {
            "barcode": "171138700",
            "dpc": "03031331401",
            "name": "ថុង  មួយហុង"
        },
        {
            "barcode": "171138701",
            "dpc": "03031331301",
            "name": "សុខ  គឹមហាន"
        },
        {
            "barcode": "171138702",
            "dpc": "03031331201",
            "name": "ឡូ  ប៊ុនប៉ា"
        },
        {
            "barcode": "171138703",
            "dpc": "03031343801",
            "name": "ទុង  ភីរម្យ"
        },
        {
            "barcode": "171138704",
            "dpc": "03031343901",
            "name": "ឌុក  ឆាយ"
        },
        {
            "barcode": "171138705",
            "dpc": "03031344001",
            "name": "នង  គឹមស៊្រុន"
        },
        {
            "barcode": "171138706",
            "dpc": "03031343701",
            "name": "ទេព  សុវណ្ណ"
        },
        {
            "barcode": "171138707",
            "dpc": "03031343601",
            "name": "ប៊ូ   វុនណាវុឌ្ឍ"
        },
        {
            "barcode": "171138708",
            "dpc": "03031343501",
            "name": "ឌួង  ភក្តី"
        },
        {
            "barcode": "171138709",
            "dpc": "03031343401",
            "name": "ញាន   ផន"
        },
        {
            "barcode": "171138710",
            "dpc": "03031343301",
            "name": "យ៉ាន់  បូផៃ"
        },
        {
            "barcode": "171138711",
            "dpc": "03031343101",
            "name": "ម៉ម  ថងឌី"
        },
        {
            "barcode": "171138712",
            "dpc": "03031342801",
            "name": "សុន  សុគន្ធវ៉ារី"
        },
        {
            "barcode": "171138713",
            "dpc": "03031342701",
            "name": "ទេព  គឹមហេង"
        },
        {
            "barcode": "171138714",
            "dpc": "03031342601",
            "name": "ឌុច   ចំរ៉ាត់"
        },
        {
            "barcode": "171138715",
            "dpc": "03031342501",
            "name": "ឈឹម  ឆន"
        },
        {
            "barcode": "171138716",
            "dpc": "03031342401",
            "name": "ឈុន  ឡាយ"
        },
        {
            "barcode": "171138717",
            "dpc": "03031342301",
            "name": "សេង  ម៉េង"
        },
        {
            "barcode": "171138718",
            "dpc": "03031342201",
            "name": "ទុយ   នៅ"
        },
        {
            "barcode": "171138719",
            "dpc": "03031342101",
            "name": "មាស   ម៉ៅ"
        },
        {
            "barcode": "171138720",
            "dpc": "03031339301",
            "name": "លុម សួន"
        },
        {
            "barcode": "171138721",
            "dpc": "03031339201",
            "name": "ឡឹក ហាយ"
        },
        {
            "barcode": "171138722",
            "dpc": "03031340001",
            "name": "នង មាសរិទ្ធ"
        },
        {
            "barcode": "171138723",
            "dpc": "03031341301",
            "name": "ប៉ុក សាហ៊ុំ"
        },
        {
            "barcode": "171138724",
            "dpc": "03031341201",
            "name": "សេង ចន្ថា"
        },
        {
            "barcode": "171138725",
            "dpc": "03031341101",
            "name": "សៅ សារុន"
        },
        {
            "barcode": "171138726",
            "dpc": "03031341001",
            "name": "អ៊ិន សុខា"
        },
        {
            "barcode": "171138727",
            "dpc": "03031340901",
            "name": "ហែម សែម"
        },
        {
            "barcode": "171138728",
            "dpc": "03031340801",
            "name": "រ័ត្ន សូរិយា"
        },
        {
            "barcode": "171138729",
            "dpc": "03031340701",
            "name": "ឡៅ ប៉ានហាង"
        },
        {
            "barcode": "171138730",
            "dpc": "03031340601",
            "name": "ង៉ា ជួង"
        },
        {
            "barcode": "171138731",
            "dpc": "03031340501",
            "name": "ភឿក គឹមលី"
        },
        {
            "barcode": "171138732",
            "dpc": "03031340401",
            "name": "យាំ យ៉ាន់"
        },
        {
            "barcode": "171138733",
            "dpc": "03031340301",
            "name": "ភឹម ផល្លា"
        },
        {
            "barcode": "171138734",
            "dpc": "03031340201",
            "name": "អាន សេរីវុធ"
        },
        {
            "barcode": "171138735",
            "dpc": "03031340101",
            "name": "ប៉ុក ច័ន្ទបូរី"
        },
        {
            "barcode": "171138736",
            "dpc": "03031339901",
            "name": "សួស សាវុន"
        },
        {
            "barcode": "171138737",
            "dpc": "03031339801",
            "name": "ឡុយ  ធិច"
        },
        {
            "barcode": "171138738",
            "dpc": "03031339401",
            "name": "ពៅ សារឿន"
        },
        {
            "barcode": "171138739",
            "dpc": "03031339501",
            "name": "វ៉ឹក រ៉ាន់"
        },
        {
            "barcode": "171138740",
            "dpc": "03031339601",
            "name": "តាន់ តូរ៉េ"
        },
        {
            "barcode": "171138741",
            "dpc": "03031339101",
            "name": "ញ៉ែម សានិត"
        },
        {
            "barcode": "171138742",
            "dpc": "03031338901",
            "name": "ហុក ហ៊ាត"
        },
        {
            "barcode": "171138743",
            "dpc": "03031339001",
            "name": "សូ ផេងគុណ"
        },
        {
            "barcode": "171138744",
            "dpc": "03031338801",
            "name": "ជា ហុង"
        },
        {
            "barcode": "171138745",
            "dpc": "03031338701",
            "name": "ផាន់ យី"
        },
        {
            "barcode": "171138746",
            "dpc": "03031338601",
            "name": "សាន សុផល"
        },
        {
            "barcode": "171138747",
            "dpc": "03031338501",
            "name": "យិន នូ"
        },
        {
            "barcode": "171138748",
            "dpc": "03031338401",
            "name": "ចៅ​ ចាន់"
        },
        {
            "barcode": "171138749",
            "dpc": "03031338201",
            "name": "ឃួន កុមារី"
        },
        {
            "barcode": "171138750",
            "dpc": "03031338001",
            "name": "វង្ស វីរៈ"
        },
        {
            "barcode": "171138751",
            "dpc": "03031337901",
            "name": "សុត សារុំ"
        },
        {
            "barcode": "171138752",
            "dpc": "03031337801",
            "name": "ពួន ភិរម្យ"
        },
        {
            "barcode": "171138753",
            "dpc": "03031337701",
            "name": "ឌី យ៉ុន ២"
        },
        {
            "barcode": "171138754",
            "dpc": "03031337601",
            "name": "សុខ ឈឿន"
        },
        {
            "barcode": "171138755",
            "dpc": "03031337501",
            "name": "ធូ សុគុន"
        },
        {
            "barcode": "171138756",
            "dpc": "03031337401",
            "name": "ហួយ សុង ហេង"
        },
        {
            "barcode": "171138757",
            "dpc": "03031337201",
            "name": "មៀច សំបូរ"
        },
        {
            "barcode": "171138758",
            "dpc": "03031337101",
            "name": "អ៊ុក សំអាន"
        },
        {
            "barcode": "171138759",
            "dpc": "03031336901",
            "name": "ជេត សំណាង"
        },
        {
            "barcode": "171138760",
            "dpc": "03031336801",
            "name": "ទូច រិទ្ធី"
        },
        {
            "barcode": "171138761",
            "dpc": "03031336701",
            "name": "កែវ សំអាត"
        },
        {
            "barcode": "171138762",
            "dpc": "03031336601",
            "name": "ញ៉ែម វណ្ណា"
        },
        {
            "barcode": "171138763",
            "dpc": "03031336401",
            "name": "កាន់ ណារិន"
        },
        {
            "barcode": "171138764",
            "dpc": "03031336301",
            "name": "កែវ សំអាង"
        },
        {
            "barcode": "171138765",
            "dpc": "03031336201",
            "name": "លី ជា"
        },
        {
            "barcode": "171138766",
            "dpc": "03031336101",
            "name": "គង់ ឆោម"
        },
        {
            "barcode": "171138767",
            "dpc": "03031336001",
            "name": "ភុំ ឆេន"
        },
        {
            "barcode": "171138768",
            "dpc": "03031335901",
            "name": "ប្រាក់ សុខែម"
        },
        {
            "barcode": "171138769",
            "dpc": "03031335801",
            "name": "ជុំ ចៅស៊ីវ៉ាន់"
        },
        {
            "barcode": "171138770",
            "dpc": "03031335701",
            "name": "ហុក សារ៉េត"
        },
        {
            "barcode": "171138771",
            "dpc": "03031335601",
            "name": "ព្រឹម សាលី"
        },
        {
            "barcode": "171138772",
            "dpc": "03031335501",
            "name": "ចុង ស៊ីន"
        },
        {
            "barcode": "171138773",
            "dpc": "03031335301",
            "name": "ស៊ិន សិត"
        },
        {
            "barcode": "171138774",
            "dpc": "03031335201",
            "name": "ជា ប៉"
        },
        {
            "barcode": "171138775",
            "dpc": "03031335101",
            "name": "ចែម សែត"
        },
        {
            "barcode": "171138776",
            "dpc": "03031335001",
            "name": "ហង់ផាន់ស៊ី"
        },
        {
            "barcode": "171138777",
            "dpc": "03031334901",
            "name": "ឈុន លីម"
        },
        {
            "barcode": "171138778",
            "dpc": "03031334801",
            "name": "គង់ ណាំ(លក់បាយ)"
        },
        {
            "barcode": "171138779",
            "dpc": "03031334701",
            "name": "លឹម ឡាយ(លក់បាយ)"
        },
        {
            "barcode": "171138780",
            "dpc": "03031301301",
            "name": "ឃឹម សាឡេះ"
        },
        {
            "barcode": "171138781",
            "dpc": "03031312001",
            "name": "រស់  ហឿន"
        },
        {
            "barcode": "171138782",
            "dpc": "03031312201",
            "name": "ញឹម  ញ៉ាន"
        },
        {
            "barcode": "171138783",
            "dpc": "03031319101",
            "name": "ម៉ោង  សំបូ"
        },
        {
            "barcode": "171138784",
            "dpc": "03031319201",
            "name": "បែន សំបូរ"
        },
        {
            "barcode": "171138785",
            "dpc": "03031319301",
            "name": "កៅ  គង់"
        },
        {
            "barcode": "171138786",
            "dpc": "03031319401",
            "name": "ត្រឹង  ច័ន្ទបូរី"
        },
        {
            "barcode": "171138787",
            "dpc": "03031319501",
            "name": "សឿន  ប៊ុនឡេង"
        },
        {
            "barcode": "171138788",
            "dpc": "03031319601",
            "name": "សុខ  សាលីន"
        },
        {
            "barcode": "171138789",
            "dpc": "03031329101",
            "name": "ឈៀង  ថុល"
        },
        {
            "barcode": "171138790",
            "dpc": "03031337301",
            "name": "តោ  ពិសិដ្ឋ"
        },
        {
            "barcode": "171138791",
            "dpc": "03031339701",
            "name": "អាង  ឈួង (បេឡាសំចៃ )"
        },
        {
            "barcode": "171138792",
            "dpc": "03031341401",
            "name": "សោម  សាឃីម"
        },
        {
            "barcode": "171138793",
            "dpc": "03031341601",
            "name": "ម៉ាន  យ៉ាន"
        },
        {
            "barcode": "171138794",
            "dpc": "03031341701",
            "name": "ម៉ៅ   ស៊ីថា"
        },
        {
            "barcode": "171138795",
            "dpc": "03031341801",
            "name": "លឹម  អូវ"
        },
        {
            "barcode": "171138796",
            "dpc": "03031341901",
            "name": "ម៉ៅ  មឿង"
        },
        {
            "barcode": "171138797",
            "dpc": "03031342001",
            "name": "ជេដ្ឋា   សោភ័ណ្ណរ៉ា"
        },
        {
            "barcode": "171138798",
            "dpc": "03031344401",
            "name": "គុជ  សុខគី"
        },
        {
            "barcode": "171138799",
            "dpc": "03031348001",
            "name": "គ្រុយ វាសនា"
        }
    ];


barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
