let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171139222",
            "dpc": "03031400101",
            "name": "អៀ ស្រ៊ុន ១"
        },
        {
            "barcode": "171139223",
            "dpc": "03031400201",
            "name": "អៀ ស្រ៊ុន ២"
        },
        {
            "barcode": "171139224",
            "dpc": "03031400301",
            "name": "ជា ប៊ុនរ័ត្ន"
        },
        {
            "barcode": "171139225",
            "dpc": "03031400401",
            "name": "ពិន ទី"
        },
        {
            "barcode": "171139226",
            "dpc": "03031400501",
            "name": "អូ អិមស៊ី ១"
        },
        {
            "barcode": "171139227",
            "dpc": "03031400601",
            "name": "អូ អិមស៊ី ២"
        },
        {
            "barcode": "171139228",
            "dpc": "03031400701",
            "name": "ម៉ៅ សុខលី ១"
        },
        {
            "barcode": "171139229",
            "dpc": "03031400801",
            "name": "វៀង  សុម៉ាន់ ១"
        },
        {
            "barcode": "171139230",
            "dpc": "03031400901",
            "name": "វៀង  សុម៉ាន់២"
        },
        {
            "barcode": "171139231",
            "dpc": "03031401001",
            "name": "រ៉េន រស់"
        },
        {
            "barcode": "171139232",
            "dpc": "03031401301",
            "name": "គឹម វ៉ាន់"
        },
        {
            "barcode": "171139233",
            "dpc": "03031401201",
            "name": "ម៉ៅ សុខលី ២"
        },
        {
            "barcode": "171139234",
            "dpc": "03031401101",
            "name": "សៀង ណាវី ១"
        },
        {
            "barcode": "171139235",
            "dpc": "03031401401",
            "name": "ឃុន ម៉េង"
        },
        {
            "barcode": "171139236",
            "dpc": "03031401601",
            "name": "តាំង ប៊ុនអៀង"
        },
        {
            "barcode": "171139237",
            "dpc": "03031401701",
            "name": "ឡុង ខួយ"
        },
        {
            "barcode": "171139238",
            "dpc": "03031401801",
            "name": "តេង  ឈៀង"
        },
        {
            "barcode": "171139239",
            "dpc": "03031401901",
            "name": "អ៊ឹង វែង"
        },
        {
            "barcode": "171139240",
            "dpc": "03031402001",
            "name": "វ៉ា សុកអែល"
        },
        {
            "barcode": "171139241",
            "dpc": "03031402101",
            "name": "សំ ប៊ុនហ៊ិន"
        },
        {
            "barcode": "171139242",
            "dpc": "03031402201",
            "name": "គឹម ហាំង ២"
        },
        {
            "barcode": "171139243",
            "dpc": "03031402301",
            "name": "សឿម វណ្ណា"
        },
        {
            "barcode": "171139244",
            "dpc": "03031402401",
            "name": "យូ ចាន់ទី"
        },
        {
            "barcode": "171139245",
            "dpc": "03031402501",
            "name": "លី ហុង"
        },
        {
            "barcode": "171139246",
            "dpc": "03031402701",
            "name": "តាំង ឈុន"
        },
        {
            "barcode": "171139247",
            "dpc": "03031402801",
            "name": "ធី អ៊ីម"
        },
        {
            "barcode": "171139248",
            "dpc": "03031402901",
            "name": "គឹម  ជីវ"
        },
        {
            "barcode": "171139249",
            "dpc": "03031403001",
            "name": "តាំង ផេងហ៊ី"
        },
        {
            "barcode": "171139250",
            "dpc": "03031403101",
            "name": "ស៊ុន សុផា ១"
        },
        {
            "barcode": "171139251",
            "dpc": "03031403201",
            "name": "រ៉ុង ប៉ុក"
        },
        {
            "barcode": "171139252",
            "dpc": "03031409001",
            "name": "សំ  ចាន់រិទ្ធ"
        },
        {
            "barcode": "171139253",
            "dpc": "03031403301",
            "name": "ឡុង ប៊ុនថេង"
        },
        {
            "barcode": "171139254",
            "dpc": "03031403401",
            "name": "ចាន់ ម៉ាន់"
        },
        {
            "barcode": "171139255",
            "dpc": "03031403501",
            "name": "ស៊ា ឈាងហេង"
        },
        {
            "barcode": "171139256",
            "dpc": "03031403601",
            "name": "វៀង ហេន"
        },
        {
            "barcode": "171139257",
            "dpc": "03031406401",
            "name": "ឃុន  ហាក់ស្រេង"
        },
        {
            "barcode": "171139258",
            "dpc": "03031406501",
            "name": "គង់  ទី"
        },
        {
            "barcode": "171139259",
            "dpc": "03031406601",
            "name": "ឃុន  ហាក់ស្រេង"
        },
        {
            "barcode": "171139260",
            "dpc": "03031406701",
            "name": "ទូច  សុខនី"
        },
        {
            "barcode": "171139261",
            "dpc": "03031406801",
            "name": "ម៉ៅ  តេង"
        },
        {
            "barcode": "171139262",
            "dpc": "03031406901",
            "name": "ម៉ាញ ផាត"
        },
        {
            "barcode": "171139263",
            "dpc": "03031407001",
            "name": "ទឺ   ម៉ារ៉ាឌី"
        },
        {
            "barcode": "171139264",
            "dpc": "03031411501",
            "name": "ជុំ  រិន"
        },
        {
            "barcode": "171139265",
            "dpc": "03031422901",
            "name": "ប៉ូ  ប៊ុនថន"
        },
        {
            "barcode": "171139266",
            "dpc": "03031405501",
            "name": "គឹម ហាំង"
        },
        {
            "barcode": "171139267",
            "dpc": "03031405601",
            "name": "អេង លី"
        },
        {
            "barcode": "171139268",
            "dpc": "03031405701",
            "name": "កែវ វណ្ណា"
        },
        {
            "barcode": "171139269",
            "dpc": "03031405801",
            "name": "ថៃ សេង"
        },
        {
            "barcode": "171139270",
            "dpc": "03031405901",
            "name": "ប៊ុន វែង"
        },
        {
            "barcode": "171139271",
            "dpc": "03031406001",
            "name": "លី ឃាង"
        },
        {
            "barcode": "171139272",
            "dpc": "03031406101",
            "name": "នាង ម៉េងលាង"
        },
        {
            "barcode": "171139273",
            "dpc": "03031406201",
            "name": "ងិន  ចេង"
        },
        {
            "barcode": "171139274",
            "dpc": "03031404801",
            "name": "ហុក រ៉ាវុធ"
        },
        {
            "barcode": "171139275",
            "dpc": "03031404901",
            "name": "ហម ស៊ិនទៀង"
        },
        {
            "barcode": "171139276",
            "dpc": "03031405001",
            "name": "លេង ឈឺន"
        },
        {
            "barcode": "171139277",
            "dpc": "03031405101",
            "name": "សៀង ជៀងផេង"
        },
        {
            "barcode": "171139278",
            "dpc": "03031405201",
            "name": "អ៊ឹម ថុង"
        },
        {
            "barcode": "171139279",
            "dpc": "03031405301",
            "name": "ហៀ មី"
        },
        {
            "barcode": "171139280",
            "dpc": "03031411401",
            "name": "ឌុក  សាវើន"
        },
        {
            "barcode": "171139281",
            "dpc": "03031411301",
            "name": "ម៉ាន់  ជួយ"
        },
        {
            "barcode": "171139282",
            "dpc": "03031411201",
            "name": "គាំ  ប៊ីន"
        },
        {
            "barcode": "171139283",
            "dpc": "03031404101",
            "name": "តាំង ឈុន ១"
        },
        {
            "barcode": "171139284",
            "dpc": "03031404201",
            "name": "តាំង ឈុន ២"
        },
        {
            "barcode": "171139285",
            "dpc": "03031404301",
            "name": "តាំង ឈុន ៣"
        },
        {
            "barcode": "171139286",
            "dpc": "03031404401",
            "name": "តាំង ឈុន ៤"
        },
        {
            "barcode": "171139287",
            "dpc": "03031404501",
            "name": "តាំង ឈុន ៥"
        },
        {
            "barcode": "171139288",
            "dpc": "03031404601",
            "name": "តាំង ឈុន ៦"
        },
        {
            "barcode": "171139289",
            "dpc": "03031404701",
            "name": "តាំង ឈុន ៧"
        },
        {
            "barcode": "171139290",
            "dpc": "03031410301",
            "name": "យិន  សួរ"
        },
        {
            "barcode": "171139291",
            "dpc": "03031410201",
            "name": "ហ៊  ចាន់ថា"
        },
        {
            "barcode": "171139292",
            "dpc": "03031410101",
            "name": "ហុក  កុសល"
        },
        {
            "barcode": "171139293",
            "dpc": "03031410001",
            "name": "តាំង កាំង ៣"
        },
        {
            "barcode": "171139294",
            "dpc": "03031409901",
            "name": "តាំង កាំង ១"
        },
        {
            "barcode": "171139295",
            "dpc": "03031409801",
            "name": "តាំង  កាំង ១"
        },
        {
            "barcode": "171139296",
            "dpc": "03031410901",
            "name": "ហៃ  ណារ៉េត"
        },
        {
            "barcode": "171139297",
            "dpc": "03031410801",
            "name": "សរ  ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171139298",
            "dpc": "03031410701",
            "name": "អ៊ុច   សុថា"
        },
        {
            "barcode": "171139299",
            "dpc": "03031410601",
            "name": "ធុច  រ៉ា"
        },
        {
            "barcode": "171139300",
            "dpc": "03031410501",
            "name": "ស្បោង   ចាន់ថុល"
        },
        {
            "barcode": "171139301",
            "dpc": "03031410401",
            "name": "លី   ប៊ុនហេង"
        },
        {
            "barcode": "171139302",
            "dpc": "03031411101",
            "name": "អ៊ី  ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171139303",
            "dpc": "03031408601",
            "name": "តាំង  បាក់ស្រេង"
        },
        {
            "barcode": "171139304",
            "dpc": "03031408501",
            "name": "លាង  ហាវ"
        },
        {
            "barcode": "171139305",
            "dpc": "03031408401",
            "name": "រ៉ុន  រ៉នី"
        },
        {
            "barcode": "171139306",
            "dpc": "03031408201",
            "name": "ចៅ  កំហ្វាន់"
        },
        {
            "barcode": "171139307",
            "dpc": "03031408301",
            "name": "តាំង  កាំង"
        },
        {
            "barcode": "171139308",
            "dpc": "03031408101",
            "name": "ស  កាន"
        },
        {
            "barcode": "171139309",
            "dpc": "03031408001",
            "name": "លឹម  តុង"
        },
        {
            "barcode": "171139310",
            "dpc": "03031409701",
            "name": "ស៊ូ  អារ៉ាហ្វាត"
        },
        {
            "barcode": "171139311",
            "dpc": "03031409601",
            "name": "ឯល  ការីម"
        },
        {
            "barcode": "171139312",
            "dpc": "03031409401",
            "name": "ស៊ុន  សុផា"
        },
        {
            "barcode": "171139313",
            "dpc": "03031409301",
            "name": "ថៃ  និមល"
        },
        {
            "barcode": "171139314",
            "dpc": "03031409201",
            "name": "សំ  ហា"
        },
        {
            "barcode": "171139315",
            "dpc": "03031409101",
            "name": "នៅ  រ៉ាដេត"
        },
        {
            "barcode": "171139316",
            "dpc": "03031408801",
            "name": "សេង  ស្រីពេជ្រ"
        },
        {
            "barcode": "171139317",
            "dpc": "03031403701",
            "name": "ពឹង គឹមផេង"
        },
        {
            "barcode": "171139318",
            "dpc": "03031403801",
            "name": "អេង ឋារ័ត្ន"
        },
        {
            "barcode": "171139319",
            "dpc": "03031403901",
            "name": "ស៊ូ វ៉ាន់ធី"
        },
        {
            "barcode": "171139320",
            "dpc": "03031404001",
            "name": "យិន ចិត្រា"
        },
        {
            "barcode": "171139321",
            "dpc": "03031407901",
            "name": "តាំង  គៀងបុង"
        },
        {
            "barcode": "171139322",
            "dpc": "03031407801",
            "name": "ណា  រ៉េត"
        },
        {
            "barcode": "171139323",
            "dpc": "03031407701",
            "name": "ហេង ឈុនផេង ១"
        },
        {
            "barcode": "171139324",
            "dpc": "03031407601",
            "name": "ហេង  ឈុនផេង ១"
        },
        {
            "barcode": "171139325",
            "dpc": "03031407501",
            "name": "ជា  ស៊ឺ"
        },
        {
            "barcode": "171139326",
            "dpc": "03031407401",
            "name": "ហ៊ឺ  សេង"
        },
        {
            "barcode": "171139327",
            "dpc": "03031407301",
            "name": "យស់  ពៅ"
        },
        {
            "barcode": "171139328",
            "dpc": "03031408901",
            "name": "លឺន  សារ៉ា"
        },
        {
            "barcode": "171139329",
            "dpc": "03031411801",
            "name": "ស៊ីវ  ហក់"
        },
        {
            "barcode": "171139330",
            "dpc": "03031411701",
            "name": "ថោង  ឡាយស្រេង"
        },
        {
            "barcode": "171139331",
            "dpc": "03031411601",
            "name": "ហ៊ុយ  ស៊ីម ២"
        },
        {
            "barcode": "171139332",
            "dpc": "03031411901",
            "name": "សៀង   គៀង ២"
        },
        {
            "barcode": "171139333",
            "dpc": "03031412001",
            "name": "ឈីវ   គី ២"
        },
        {
            "barcode": "171139334",
            "dpc": "03031412101",
            "name": "ប៊ុន  រ៉ាស៊ី"
        },
        {
            "barcode": "171139335",
            "dpc": "03031412201",
            "name": "អ៊ុយ  ស៊ីម"
        },
        {
            "barcode": "171139336",
            "dpc": "03031412301",
            "name": "ធីវ  ណារិន"
        },
        {
            "barcode": "171139337",
            "dpc": "03031412501",
            "name": "អន  ភិរម្យ"
        },
        {
            "barcode": "171139338",
            "dpc": "03031412601",
            "name": "យ៉ាំ  ឃួង"
        },
        {
            "barcode": "171139339",
            "dpc": "03031412701",
            "name": "ឌុក  ឆាយ"
        },
        {
            "barcode": "171139340",
            "dpc": "03031412801",
            "name": "ស៊ិក  សុរ័ត្នន៍"
        },
        {
            "barcode": "171139341",
            "dpc": "03031412901",
            "name": "ពិន  សាវឿន"
        },
        {
            "barcode": "171139342",
            "dpc": "03031413001",
            "name": "ចាំង  គីមឹអ៊ាង"
        },
        {
            "barcode": "171139343",
            "dpc": "03031413201",
            "name": "យិន  វុនហាន ១"
        },
        {
            "barcode": "171139344",
            "dpc": "03031413301",
            "name": "ស៊្រុន"
        },
        {
            "barcode": "171139345",
            "dpc": "03031413401",
            "name": "ហៃ  សុភ័ក្រ"
        },
        {
            "barcode": "171139346",
            "dpc": "03031413501",
            "name": "គឹម  ហេង"
        },
        {
            "barcode": "171139347",
            "dpc": "03031413601",
            "name": "ឌុក  ឆវេត"
        },
        {
            "barcode": "171139348",
            "dpc": "03031413701",
            "name": "ប្រាក់  សារីម"
        },
        {
            "barcode": "171139349",
            "dpc": "03031413801",
            "name": "សេក  សុគន្ធ"
        },
        {
            "barcode": "171139350",
            "dpc": "03031413901",
            "name": "នីវ  ណារិន"
        },
        {
            "barcode": "171139351",
            "dpc": "03031414001",
            "name": "ផែ  ណាំជីវ"
        },
        {
            "barcode": "171139352",
            "dpc": "03031414101",
            "name": "យាំ  តាំងចាប់"
        },
        {
            "barcode": "171139353",
            "dpc": "03031414201",
            "name": "យិន  វុនហាន ២"
        },
        {
            "barcode": "171139354",
            "dpc": "03031414301",
            "name": "ហេង  រ៉ា"
        },
        {
            "barcode": "171139355",
            "dpc": "03031414401",
            "name": "ឆាន់  ភុយ"
        },
        {
            "barcode": "171139356",
            "dpc": "03031414501",
            "name": "ម៉ៅ  សុខលី ៣"
        },
        {
            "barcode": "171139357",
            "dpc": "03031414601",
            "name": "ស៊ីន  ឃុន ១"
        },
        {
            "barcode": "171139358",
            "dpc": "03031414701",
            "name": "ស៊ីន ឃុន ១"
        },
        {
            "barcode": "171139359",
            "dpc": "03031414801",
            "name": "សូ  ឌឿន"
        },
        {
            "barcode": "171139360",
            "dpc": "03031414901",
            "name": "តាំង  បាក់ស្រេង"
        },
        {
            "barcode": "171139361",
            "dpc": "03031415001",
            "name": "តាំង បាក់ស្រេង ១"
        },
        {
            "barcode": "171139362",
            "dpc": "03031415101",
            "name": "គុយ  ម៉េង ២"
        },
        {
            "barcode": "171139363",
            "dpc": "03031415201",
            "name": "តាំង  កាំង ១"
        },
        {
            "barcode": "171139364",
            "dpc": "03031415301",
            "name": "តាំង កាំង ២"
        },
        {
            "barcode": "171139365",
            "dpc": "03031415401",
            "name": "តាំង កាំង លក់បារី"
        },
        {
            "barcode": "171139366",
            "dpc": "03031415501",
            "name": "អ៊ុក  សារ៉េត"
        },
        {
            "barcode": "171139367",
            "dpc": "03031415601",
            "name": "ឈីវ  កិរិយា"
        },
        {
            "barcode": "171139368",
            "dpc": "03031415701",
            "name": "លឹម  ហួរ ១"
        },
        {
            "barcode": "171139369",
            "dpc": "03031415801",
            "name": "លឹម ហួរ ១"
        },
        {
            "barcode": "171139370",
            "dpc": "03031415901",
            "name": "ជឺ  ឈៀង"
        },
        {
            "barcode": "171139371",
            "dpc": "03031416001",
            "name": "សៅ  រិន"
        },
        {
            "barcode": "171139372",
            "dpc": "03031416101",
            "name": "អ៊ឹម  សុថូល"
        },
        {
            "barcode": "171139373",
            "dpc": "03031416201",
            "name": "ហេង (លក់មាស )"
        },
        {
            "barcode": "171139374",
            "dpc": "03031416301",
            "name": "លី  វ៉ាន់នី"
        },
        {
            "barcode": "171139375",
            "dpc": "03031416401",
            "name": "លូ  ហៀង"
        },
        {
            "barcode": "171139376",
            "dpc": "03031416501",
            "name": "ហាំង  ឆែ"
        },
        {
            "barcode": "171139377",
            "dpc": "03031416601",
            "name": "ថុង  ម៉េង ២"
        },
        {
            "barcode": "171139378",
            "dpc": "03031416801",
            "name": "តាំង  ប៊ូ"
        },
        {
            "barcode": "171139379",
            "dpc": "03031416701",
            "name": "លាង  ហាក់"
        },
        {
            "barcode": "171139380",
            "dpc": "03031416901",
            "name": "លី   មាន (លក់អង្ករ)"
        },
        {
            "barcode": "171139381",
            "dpc": "03031417001",
            "name": "លឹម  ឃុន"
        },
        {
            "barcode": "171139382",
            "dpc": "03031417101",
            "name": "លី  មាន ( លី  ស្រី)"
        },
        {
            "barcode": "171139383",
            "dpc": "03031417201",
            "name": "លី លុយ"
        },
        {
            "barcode": "171139384",
            "dpc": "03031417301",
            "name": "ថុង  ម៉ី"
        },
        {
            "barcode": "171139385",
            "dpc": "03031417401",
            "name": "សុខ  គង់"
        },
        {
            "barcode": "171139386",
            "dpc": "03031417501",
            "name": "អ៊ុក  ឃុន"
        },
        {
            "barcode": "171139387",
            "dpc": "03031417601",
            "name": "ពឹង  ឆាយគៀង"
        },
        {
            "barcode": "171139388",
            "dpc": "03031417701",
            "name": "ឈៀង  សុវណ្ណា"
        },
        {
            "barcode": "171139389",
            "dpc": "03031417801",
            "name": "អ៊ឹង  នីតា"
        },
        {
            "barcode": "171139390",
            "dpc": "03031417901",
            "name": "ពេជ្រ  ថុល"
        },
        {
            "barcode": "171139391",
            "dpc": "03031418001",
            "name": "ឃឹម  ឡេង"
        },
        {
            "barcode": "171139392",
            "dpc": "03031418201",
            "name": "ឌិន  ប៊ុណ្ណា"
        },
        {
            "barcode": "171139393",
            "dpc": "03031418301",
            "name": "តាំង  ឈុន ២"
        },
        {
            "barcode": "171139394",
            "dpc": "03031418401",
            "name": "តាំង  ឈុន ៧"
        },
        {
            "barcode": "171139395",
            "dpc": "03031418501",
            "name": "គង់  សុភា"
        },
        {
            "barcode": "171139396",
            "dpc": "03031418601",
            "name": "យាយ  កែវ"
        },
        {
            "barcode": "171139397",
            "dpc": "03031418701",
            "name": "ប៊ុន  សួរ"
        },
        {
            "barcode": "171139398",
            "dpc": "03031418801",
            "name": "ពូ  ពេជ្រ"
        },
        {
            "barcode": "171139399",
            "dpc": "03031422801",
            "name": "ទួន  ភាព"
        },
        {
            "barcode": "171139400",
            "dpc": "03031418901",
            "name": "អ៊ឹង  ប៊ីហាប់"
        },
        {
            "barcode": "171139401",
            "dpc": "03031419001",
            "name": "ឃូ  ប៉ាវ"
        },
        {
            "barcode": "171139402",
            "dpc": "03031419101",
            "name": "ណយ  សាន់"
        },
        {
            "barcode": "171139403",
            "dpc": "03031419201",
            "name": "សា  វ៉ាន់"
        },
        {
            "barcode": "171139404",
            "dpc": "03031419301",
            "name": "សុក  ឡាយ"
        },
        {
            "barcode": "171139405",
            "dpc": "03031419401",
            "name": "គឹម  ទី"
        },
        {
            "barcode": "171139406",
            "dpc": "03031419501",
            "name": "លៀង  គឹមឡី"
        },
        {
            "barcode": "171139407",
            "dpc": "03031419601",
            "name": "កាំង សៀក"
        },
        {
            "barcode": "171139408",
            "dpc": "03031419701",
            "name": "ពឹង  លីវ"
        },
        {
            "barcode": "171139409",
            "dpc": "03031419801",
            "name": "ស៊ាន  សាវឿន"
        },
        {
            "barcode": "171139410",
            "dpc": "03031419901",
            "name": "គុជ  កល្យា"
        },
        {
            "barcode": "171139411",
            "dpc": "03031420001",
            "name": "លឹម  ជា"
        },
        {
            "barcode": "171139412",
            "dpc": "03031420101",
            "name": "កាំង  លី"
        },
        {
            "barcode": "171139413",
            "dpc": "03031420201",
            "name": "ឈួន  ប៉ា"
        },
        {
            "barcode": "171139414",
            "dpc": "03031420301",
            "name": "ហម សំបូរ"
        },
        {
            "barcode": "171139415",
            "dpc": "03031420401",
            "name": "ជុត  វ៉ារ៉ុង"
        },
        {
            "barcode": "171139416",
            "dpc": "03031420501",
            "name": "លឹម  ឃុន"
        },
        {
            "barcode": "171139417",
            "dpc": "03031420601",
            "name": "សុខ  ពិសិដ្ឋ"
        },
        {
            "barcode": "171139418",
            "dpc": "03031420701",
            "name": "ព្រំ  ណូ"
        },
        {
            "barcode": "171139419",
            "dpc": "03031420801",
            "name": "តោ  សាលីន"
        },
        {
            "barcode": "171139420",
            "dpc": "03031420901",
            "name": "តាំង ឈុន ៥"
        },
        {
            "barcode": "171139421",
            "dpc": "03031421001",
            "name": "តាង  ឈុន (លក់មាស)"
        },
        {
            "barcode": "171139422",
            "dpc": "03031421101",
            "name": "ភោគ  សុភី"
        },
        {
            "barcode": "171139423",
            "dpc": "03031421301",
            "name": "ចាន់  ហេង"
        },
        {
            "barcode": "171139424",
            "dpc": "03031421401",
            "name": "តាំង ឈុន១"
        },
        {
            "barcode": "171139425",
            "dpc": "03031421501",
            "name": "សេង  ហៃ"
        },
        {
            "barcode": "171139426",
            "dpc": "03031421601",
            "name": "សេង  រ៉ាស៊ីន"
        },
        {
            "barcode": "171139427",
            "dpc": "03031421701",
            "name": "ទ្រី  ថា"
        },
        {
            "barcode": "171139428",
            "dpc": "03031421801",
            "name": "យឹម  វ៉ិត ១"
        },
        {
            "barcode": "171139429",
            "dpc": "03031421901",
            "name": "យឹម  វ៉ិត ២"
        },
        {
            "barcode": "171139430",
            "dpc": "03031422001",
            "name": "ជូរ  គង់"
        },
        {
            "barcode": "171139431",
            "dpc": "03031422201",
            "name": "លី  មាន"
        },
        {
            "barcode": "171139432",
            "dpc": "03031422101",
            "name": "លី វែង"
        },
        {
            "barcode": "171139433",
            "dpc": "03031422401",
            "name": "តាំង  ស៊ឹមហុង"
        },
        {
            "barcode": "171139434",
            "dpc": "03031422501",
            "name": "ឈី  គី ១"
        },
        {
            "barcode": "171139435",
            "dpc": "03031422601",
            "name": "កែវ  ចំរើន"
        },
        {
            "barcode": "171139436",
            "dpc": "03031422701",
            "name": "ឈ  គង់ទី"
        },
        {
            "barcode": "171139437",
            "dpc": "03031426801",
            "name": "ង៉ែត គី"
        },
        {
            "barcode": "171139438",
            "dpc": "03031426901",
            "name": "ខូវ ស៊ាងហុង"
        },
        {
            "barcode": "171139439",
            "dpc": "03031427001",
            "name": "អ៊ុក ចឹក"
        },
        {
            "barcode": "171139440",
            "dpc": "03031427101",
            "name": "ខេង ធីតា"
        },
        {
            "barcode": "171139441",
            "dpc": "03031427201",
            "name": "ឃុត ចន្ថា"
        },
        {
            "barcode": "171139442",
            "dpc": "03031427401",
            "name": "សម ស៊ុននី"
        },
        {
            "barcode": "171139443",
            "dpc": "03031427501",
            "name": "ទ្រឿង រដ្ឋរិទ្ធី"
        },
        {
            "barcode": "171139444",
            "dpc": "03031427601",
            "name": "អ៊ុក វង្ស ១"
        },
        {
            "barcode": "171139445",
            "dpc": "03031427701",
            "name": "អ៊ុក វង្ស ២"
        },
        {
            "barcode": "171139446",
            "dpc": "03031427801",
            "name": "អ៊ុក វង្ស ៣"
        },
        {
            "barcode": "171139447",
            "dpc": "03031427901",
            "name": "អ៊ុក វង្ស ៤"
        },
        {
            "barcode": "171139448",
            "dpc": "03031428001",
            "name": "ថាំង សុវណ្ណ"
        },
        {
            "barcode": "171139449",
            "dpc": "03031428101",
            "name": "ហេង ទុយ"
        },
        {
            "barcode": "171139450",
            "dpc": "03031428201",
            "name": "សួង ហេង"
        },
        {
            "barcode": "171139451",
            "dpc": "03031428401",
            "name": "ជាង មុយ"
        },
        {
            "barcode": "171139452",
            "dpc": "03031428501",
            "name": "ស៊ឹម សារ៉ាត់ ១"
        },
        {
            "barcode": "171139453",
            "dpc": "03031428601",
            "name": "នក់ ហ្វួយ"
        },
        {
            "barcode": "171139454",
            "dpc": "03031428701",
            "name": "ង៉ែត វិភូ ១"
        },
        {
            "barcode": "171139455",
            "dpc": "03031428801",
            "name": "ស៊ឹម សារ៉ាត់ ២"
        },
        {
            "barcode": "171139456",
            "dpc": "03031428901",
            "name": "អ៊ុន ផល្លា"
        },
        {
            "barcode": "171139457",
            "dpc": "03031432701",
            "name": "ឯក ស៊ីនាង"
        },
        {
            "barcode": "171139458",
            "dpc": "03031429001",
            "name": "ទុយ សុខុន ១"
        },
        {
            "barcode": "171139459",
            "dpc": "03031429101",
            "name": "ទុយ សុខុន ២"
        },
        {
            "barcode": "171139460",
            "dpc": "03031429201",
            "name": "ជា ចាន់ខន ១"
        },
        {
            "barcode": "171139461",
            "dpc": "03031429301",
            "name": "អ៊ុក ព្រំ"
        },
        {
            "barcode": "171139462",
            "dpc": "03031429401",
            "name": "ជា ចាន់ខន ២"
        },
        {
            "barcode": "171139463",
            "dpc": "03031429501",
            "name": "យ៉ង់ ផាន"
        },
        {
            "barcode": "171139464",
            "dpc": "03031429601",
            "name": "ទេព សារ៉ាត់"
        },
        {
            "barcode": "171139465",
            "dpc": "03031429701",
            "name": "ទួន ស៊ុនលី"
        },
        {
            "barcode": "171139466",
            "dpc": "03031426001",
            "name": "ទូ ថាំង ១"
        },
        {
            "barcode": "171139467",
            "dpc": "03031426101",
            "name": "ទូ ថាំង ២"
        },
        {
            "barcode": "171139468",
            "dpc": "03031426201",
            "name": "ភួយ សណារ័ត្ន"
        },
        {
            "barcode": "171139469",
            "dpc": "03031426301",
            "name": "ជុំ ចាន់ដារិទ្ធ"
        },
        {
            "barcode": "171139470",
            "dpc": "03031426401",
            "name": "សូ សុគុណ"
        },
        {
            "barcode": "171139471",
            "dpc": "03031426501",
            "name": "អេង សាមួយ"
        },
        {
            "barcode": "171139472",
            "dpc": "03031426601",
            "name": "គឹម សាភិន"
        },
        {
            "barcode": "171139473",
            "dpc": "03031426701",
            "name": "ម៉ៅ ឆវឿង"
        },
        {
            "barcode": "171139474",
            "dpc": "03031425901",
            "name": "ជា ម៉ៅ"
        },
        {
            "barcode": "171139475",
            "dpc": "03031425801",
            "name": "ប៉ែន ឆាលី"
        },
        {
            "barcode": "171139476",
            "dpc": "03031425701",
            "name": "សុខ សារ៉េត"
        },
        {
            "barcode": "171139477",
            "dpc": "03031425601",
            "name": "នីវ ណារិន"
        },
        {
            "barcode": "171139478",
            "dpc": "03031425501",
            "name": "ជា ឆវិល័យ"
        },
        {
            "barcode": "171139479",
            "dpc": "03031425401",
            "name": "ឡឹម សារិន"
        },
        {
            "barcode": "171139480",
            "dpc": "03031433401",
            "name": "ឌួង សាក់"
        },
        {
            "barcode": "171139481",
            "dpc": "03031433301",
            "name": "សួន សុខុម"
        },
        {
            "barcode": "171139482",
            "dpc": "03031433201",
            "name": "ហេង កង"
        },
        {
            "barcode": "171139483",
            "dpc": "03031433101",
            "name": "ប៊ុន គង់"
        },
        {
            "barcode": "171139484",
            "dpc": "03031433001",
            "name": "លី ជា"
        },
        {
            "barcode": "171139485",
            "dpc": "03031432901",
            "name": "សាយ សុខខេង"
        },
        {
            "barcode": "171139486",
            "dpc": "03031432801",
            "name": "ឡឹក ហាយ"
        },
        {
            "barcode": "171139487",
            "dpc": "03031432501",
            "name": "ឃុន មុំ"
        },
        {
            "barcode": "171139488",
            "dpc": "03031432401",
            "name": "ឃុន ឃីម"
        },
        {
            "barcode": "171139489",
            "dpc": "03031432201",
            "name": "កោ គឹមហៃ"
        },
        {
            "barcode": "171139490",
            "dpc": "03031432101",
            "name": "ឈរ ជាណាំង"
        },
        {
            "barcode": "171139491",
            "dpc": "03031432001",
            "name": "សេក សុគន្ធ"
        },
        {
            "barcode": "171139492",
            "dpc": "03031431901",
            "name": "ផាន់ សុភាព"
        },
        {
            "barcode": "171139493",
            "dpc": "03031430101",
            "name": "ឆុង ឈឿត"
        },
        {
            "barcode": "171139494",
            "dpc": "03031430001",
            "name": "ណុប ងិន"
        },
        {
            "barcode": "171139495",
            "dpc": "03031429901",
            "name": "សោ សុទ្ធធឿន"
        },
        {
            "barcode": "171139496",
            "dpc": "03031429801",
            "name": "ការិ.សុខាភិបាលស្រុក"
        },
        {
            "barcode": "171139497",
            "dpc": "03031430201",
            "name": "ង៉ូវ លីផេង"
        },
        {
            "barcode": "171139498",
            "dpc": "03031430301",
            "name": "ចេ ចៀក"
        },
        {
            "barcode": "171139499",
            "dpc": "03031430401",
            "name": "នង ឃាង"
        },
        {
            "barcode": "171139500",
            "dpc": "03031430501",
            "name": "ស៊ុំ   ផន"
        },
        {
            "barcode": "171139501",
            "dpc": "03031430601",
            "name": "ឈួ សុធា"
        },
        {
            "barcode": "171139502",
            "dpc": "03031430701",
            "name": "លន់ ស៊ីន"
        },
        {
            "barcode": "171139503",
            "dpc": "03031430801",
            "name": "គឹម ហួតហេង"
        },
        {
            "barcode": "171139504",
            "dpc": "03031430901",
            "name": "ឈុយ លី"
        },
        {
            "barcode": "171139505",
            "dpc": "03031431001",
            "name": "ខែក សៀង"
        },
        {
            "barcode": "171139506",
            "dpc": "03031431501",
            "name": "ធៀន ណុង"
        },
        {
            "barcode": "171139507",
            "dpc": "03031431701",
            "name": "ជាង លាប"
        },
        {
            "barcode": "171139508",
            "dpc": "03031431301",
            "name": "តាន់ អ៊ីម"
        },
        {
            "barcode": "171139509",
            "dpc": "03031431101",
            "name": "អេង ឌាំង"
        },
        {
            "barcode": "171139510",
            "dpc": "03031431801",
            "name": "លី ឆង៉ូវ"
        },
        {
            "barcode": "171139511",
            "dpc": "03031407101",
            "name": "ជា ពៅ"
        },
        {
            "barcode": "171139512",
            "dpc": "03031440001",
            "name": "ជូ​ ផេង"
        },
        {
            "barcode": "171139513",
            "dpc": "03031439901",
            "name": "សុខ  ម៉េង"
        },
        {
            "barcode": "171139514",
            "dpc": "03031439701",
            "name": "គង់  ស៊ីណា"
        },
        {
            "barcode": "171139515",
            "dpc": "03031439601",
            "name": "ធាម  ជឹង"
        },
        {
            "barcode": "171139516",
            "dpc": "03031439501",
            "name": "សេង  សុរ័ត្ន"
        },
        {
            "barcode": "171139517",
            "dpc": "03031439401",
            "name": "គ្រិន  ញ៉ុង"
        },
        {
            "barcode": "171139518",
            "dpc": "03031439201",
            "name": "ងូវ  សៀង"
        },
        {
            "barcode": "171139519",
            "dpc": "03031439001",
            "name": "លេង  ហុង"
        },
        {
            "barcode": "171139520",
            "dpc": "03031438801",
            "name": "ជុំ  សុណ្ណារិទ្ធ ២"
        },
        {
            "barcode": "171139521",
            "dpc": "03031425301",
            "name": "ខូវ លាងម៉េង"
        },
        {
            "barcode": "171139522",
            "dpc": "03031425201",
            "name": "គឹម រិន"
        },
        {
            "barcode": "171139523",
            "dpc": "03031425101",
            "name": "សៀវ ច័ន្ទមនោរម្យ"
        },
        {
            "barcode": "171139524",
            "dpc": "03031425001",
            "name": "ឡុង ស្រ៊ុន"
        },
        {
            "barcode": "171139525",
            "dpc": "03031424901",
            "name": "សៀវ បូផេង"
        },
        {
            "barcode": "171139526",
            "dpc": "03031424801",
            "name": "គិន យុន"
        },
        {
            "barcode": "171139527",
            "dpc": "03031424701",
            "name": "ចាន់ សុន"
        },
        {
            "barcode": "171139528",
            "dpc": "03031424601",
            "name": "ស៊ិន សោភា"
        },
        {
            "barcode": "171139529",
            "dpc": "03031424501",
            "name": "លឹម គឹមអ៊ី"
        },
        {
            "barcode": "171139530",
            "dpc": "03031424401",
            "name": "ម៉ី  សំណាង"
        },
        {
            "barcode": "171139531",
            "dpc": "03031424301",
            "name": "ជា សុគន្ទ ១"
        },
        {
            "barcode": "171139532",
            "dpc": "03031424201",
            "name": "យឿន យៀន"
        },
        {
            "barcode": "171139533",
            "dpc": "03031424101",
            "name": "ជិម ឡាវស្រ៊ុន"
        },
        {
            "barcode": "171139534",
            "dpc": "03031423901",
            "name": "តាំង ហេង"
        },
        {
            "barcode": "171139535",
            "dpc": "03031423801",
            "name": "ម៉ម សេសាន"
        },
        {
            "barcode": "171139536",
            "dpc": "03031423701",
            "name": "វឿង ប៊ុតរេត"
        },
        {
            "barcode": "171139537",
            "dpc": "03031423601",
            "name": "ទារ សារ៉ាត់"
        },
        {
            "barcode": "171139538",
            "dpc": "03031423501",
            "name": "ហួត សំណាង"
        },
        {
            "barcode": "171139539",
            "dpc": "03031423401",
            "name": "ជួញ សឆៃ"
        },
        {
            "barcode": "171139540",
            "dpc": "03031423301",
            "name": "ឯល សយ"
        },
        {
            "barcode": "171139541",
            "dpc": "03031423201",
            "name": "ព្រំ វណ្ណា"
        },
        {
            "barcode": "171139542",
            "dpc": "03031423101",
            "name": "ស៊ីវ សារឿន"
        },
        {
            "barcode": "171139543",
            "dpc": "03031423001",
            "name": "គុយ ម៉េង"
        },
        {
            "barcode": "171139544",
            "dpc": "03031438001",
            "name": "ផល មី"
        },
        {
            "barcode": "171139545",
            "dpc": "03031437901",
            "name": "តាត នី"
        },
        {
            "barcode": "171139546",
            "dpc": "03031437801",
            "name": "អិ សូញ"
        },
        {
            "barcode": "171139547",
            "dpc": "03031437701",
            "name": "ព្រំ សេរី"
        },
        {
            "barcode": "171139548",
            "dpc": "03031437601",
            "name": "លឹម ប៉េងឃីម"
        },
        {
            "barcode": "171139549",
            "dpc": "03031437501",
            "name": "ហាក់ ឡេង"
        },
        {
            "barcode": "171139550",
            "dpc": "03031437401",
            "name": "អៀ គឹមហ៊ុន១"
        },
        {
            "barcode": "171139551",
            "dpc": "03031437301",
            "name": "ឈួរ គី"
        },
        {
            "barcode": "171139552",
            "dpc": "03031437201",
            "name": "អ៊ឹម ផូ"
        },
        {
            "barcode": "171139553",
            "dpc": "03031437101",
            "name": "និន ណុន"
        },
        {
            "barcode": "171139554",
            "dpc": "03031437001",
            "name": "អ៊ឹង គង់"
        },
        {
            "barcode": "171139555",
            "dpc": "03031436901",
            "name": "រុន រ៉ានី"
        },
        {
            "barcode": "171139556",
            "dpc": "03031436801",
            "name": "ជាង គឿ"
        },
        {
            "barcode": "171139557",
            "dpc": "03031436601",
            "name": "ងួន តូ"
        },
        {
            "barcode": "171139558",
            "dpc": "03031436501",
            "name": "ទាវ កៅ"
        },
        {
            "barcode": "171139559",
            "dpc": "03031436401",
            "name": "ង៉ោ ឆេង"
        },
        {
            "barcode": "171139560",
            "dpc": "03031436301",
            "name": "គូ ស៊ីថា"
        },
        {
            "barcode": "171139561",
            "dpc": "03031436201",
            "name": "តុង សេង"
        },
        {
            "barcode": "171139562",
            "dpc": "03031436101",
            "name": "សុខ ឡេង"
        },
        {
            "barcode": "171139563",
            "dpc": "03031436001",
            "name": "សរ ប៊ុនរិទ្ធិ"
        },
        {
            "barcode": "171139564",
            "dpc": "03031434401",
            "name": "ជា ចំរើន"
        },
        {
            "barcode": "171139565",
            "dpc": "03031434501",
            "name": "វ៉ែន សំបូរ"
        },
        {
            "barcode": "171139566",
            "dpc": "03031434601",
            "name": "គិត យិង"
        },
        {
            "barcode": "171139567",
            "dpc": "03031434701",
            "name": "ជា សុគន្ធ ២"
        },
        {
            "barcode": "171139568",
            "dpc": "03031434801",
            "name": "ប៊ី បុប្ផា"
        },
        {
            "barcode": "171139569",
            "dpc": "03031434901",
            "name": "គង់ ណាំ"
        },
        {
            "barcode": "171139570",
            "dpc": "03031435001",
            "name": "ប៉ែន ណារិទ្ធ"
        },
        {
            "barcode": "171139571",
            "dpc": "03031435101",
            "name": "ចេង ប៊ុនឡុង"
        },
        {
            "barcode": "171139572",
            "dpc": "03031435201",
            "name": "ហៀង ឆោមណា"
        },
        {
            "barcode": "171139573",
            "dpc": "03031435301",
            "name": "លឹម សុខ"
        },
        {
            "barcode": "171139574",
            "dpc": "03031435501",
            "name": "សំ វ៉ាន់នី"
        },
        {
            "barcode": "171139575",
            "dpc": "03031435601",
            "name": "ទាវ កៅ"
        },
        {
            "barcode": "171139576",
            "dpc": "03031435701",
            "name": "អ៊ឺង អៀងហេង"
        },
        {
            "barcode": "171139577",
            "dpc": "03031435801",
            "name": "ចាន់ ហុង"
        },
        {
            "barcode": "171139578",
            "dpc": "03031435901",
            "name": "ទិត្យ បូប"
        },
        {
            "barcode": "171139579",
            "dpc": "03031434101",
            "name": "ហ៊ុំ សុខា ២"
        },
        {
            "barcode": "171139580",
            "dpc": "03031434001",
            "name": "ខូវ ផល្លី"
        },
        {
            "barcode": "171139581",
            "dpc": "03031433801",
            "name": "ឡាយ វ៉ាន់"
        },
        {
            "barcode": "171139582",
            "dpc": "03031433701",
            "name": "នេត ថន"
        },
        {
            "barcode": "171139583",
            "dpc": "03031440101",
            "name": "អ៊ុក ព្រំ"
        },
        {
            "barcode": "171139584",
            "dpc": "03031440201",
            "name": "វត្តពិភិទ្ធារាម (ខាងលិច)"
        },
        {
            "barcode": "171139585",
            "dpc": "03031440301",
            "name": "វត្តពិភិទ្ធារាម (ខាងកើត)"
        },
        {
            "barcode": "171139586",
            "dpc": "03031446301",
            "name": "ប៉ុក សុទ្ធា"
        },
        {
            "barcode": "171139587",
            "dpc": "03031432601",
            "name": "គង់ ប៊ុនលី"
        },
        {
            "barcode": "171139588",
            "dpc": "03031441401",
            "name": "លក់ គ្រី"
        },
        {
            "barcode": "171139589",
            "dpc": "03031441501",
            "name": "តឹក សាលី"
        },
        {
            "barcode": "171139590",
            "dpc": "03031441601",
            "name": "តាំង អូវណាំ"
        },
        {
            "barcode": "171139591",
            "dpc": "03031441701",
            "name": "ប៉ែន ហាប់"
        },
        {
            "barcode": "171139592",
            "dpc": "03031441801",
            "name": "ឈ្នាង សុង"
        },
        {
            "barcode": "171139593",
            "dpc": "03031441901",
            "name": "ព្រំ មាំងគីម"
        },
        {
            "barcode": "171139594",
            "dpc": "03031442001",
            "name": "ប៉ែន កិ"
        },
        {
            "barcode": "171139595",
            "dpc": "03031442101",
            "name": "រស់ ធឿន"
        },
        {
            "barcode": "171139596",
            "dpc": "03031442201",
            "name": "ជិត ជុំ"
        },
        {
            "barcode": "171139597",
            "dpc": "03031442301",
            "name": "បេង លន់"
        },
        {
            "barcode": "171139598",
            "dpc": "03031442401",
            "name": "ហ៊ុន វិបុល"
        },
        {
            "barcode": "171139599",
            "dpc": "03031442501",
            "name": "ឆាយ យួម"
        },
        {
            "barcode": "171139600",
            "dpc": "03031442601",
            "name": "ម៉ៅ ហុក"
        },
        {
            "barcode": "171139601",
            "dpc": "03031442701",
            "name": "តុក សុងសួរ"
        },
        {
            "barcode": "171139602",
            "dpc": "03031442801",
            "name": "បណ្តូល សំណាង"
        },
        {
            "barcode": "171139603",
            "dpc": "03031442901",
            "name": "ឈិនស៊ី"
        },
        {
            "barcode": "171139604",
            "dpc": "03031443001",
            "name": "ឯល សារ៉ាត់"
        },
        {
            "barcode": "171139605",
            "dpc": "03031443101",
            "name": "ញឹក ប៊ុនឈុប"
        },
        {
            "barcode": "171139606",
            "dpc": "03031443201",
            "name": "អ៊ន សុផានី"
        },
        {
            "barcode": "171139607",
            "dpc": "03031443401",
            "name": "យ៉ាំ យី"
        },
        {
            "barcode": "171139608",
            "dpc": "03031443501",
            "name": "អៀ ឈុន"
        },
        {
            "barcode": "171139609",
            "dpc": "03031443601",
            "name": "ណាំ ទុំ"
        },
        {
            "barcode": "171139610",
            "dpc": "03031443701",
            "name": "អ៊ុល វិបុល"
        },
        {
            "barcode": "171139611",
            "dpc": "03031443801",
            "name": "ងួូន ចរិយា១"
        },
        {
            "barcode": "171139612",
            "dpc": "03031443901",
            "name": "ងួន ចរិយា"
        },
        {
            "barcode": "171139613",
            "dpc": "03031444001",
            "name": "ចាប សុភី"
        },
        {
            "barcode": "171139614",
            "dpc": "03031444101",
            "name": "ម៉ន សាម៉ៃ"
        },
        {
            "barcode": "171139615",
            "dpc": "03031444201",
            "name": "អ៊ុំ រ៉ូន"
        },
        {
            "barcode": "171139616",
            "dpc": "03031444301",
            "name": "សែ សារ៉ាន់"
        },
        {
            "barcode": "171139617",
            "dpc": "03031444401",
            "name": "ប៉ឹង រ៉ុន"
        },
        {
            "barcode": "171139618",
            "dpc": "03031444601",
            "name": "តាត ស៊ាង"
        },
        {
            "barcode": "171139619",
            "dpc": "03031444701",
            "name": "ម៉ក់ ណុល"
        },
        {
            "barcode": "171139620",
            "dpc": "03031444801",
            "name": "ទ្រី ទុយ"
        },
        {
            "barcode": "171139621",
            "dpc": "03031444901",
            "name": "អៀង សាមេត"
        },
        {
            "barcode": "171139622",
            "dpc": "03031445001",
            "name": "ស៊ុយ អេង"
        },
        {
            "barcode": "171139623",
            "dpc": "03031445101",
            "name": "ជួន ប៊ុន"
        },
        {
            "barcode": "171139624",
            "dpc": "03031445201",
            "name": "អ៊ុយ លន់"
        },
        {
            "barcode": "171139625",
            "dpc": "03031445301",
            "name": "ឈួន ហួត"
        },
        {
            "barcode": "171139626",
            "dpc": "03031445401",
            "name": "ពេជ្រ លឹមអ៊ី"
        },
        {
            "barcode": "171139627",
            "dpc": "03031445501",
            "name": "សេង ស៊ីម"
        },
        {
            "barcode": "171139628",
            "dpc": "03031445601",
            "name": "គីង ចាន់ឡាយ"
        },
        {
            "barcode": "171139629",
            "dpc": "03031445701",
            "name": "ឃីម គឹមលាង"
        },
        {
            "barcode": "171139630",
            "dpc": "03031445801",
            "name": "កឺ សិនឡុង"
        },
        {
            "barcode": "171139631",
            "dpc": "03031445901",
            "name": "ឈឹម ឆុំ"
        },
        {
            "barcode": "171139632",
            "dpc": "03031446001",
            "name": "ហេង ឈាន"
        },
        {
            "barcode": "171139633",
            "dpc": "03031446101",
            "name": "ស្រៀង ទ្រី"
        },
        {
            "barcode": "171139634",
            "dpc": "03031446401",
            "name": "ចៅ ម៉ាន់"
        },
        {
            "barcode": "171139635",
            "dpc": "03031446501",
            "name": "ចៅ កង"
        },
        {
            "barcode": "171139636",
            "dpc": "03031446901",
            "name": "នូ សារ"
        },
        {
            "barcode": "171139637",
            "dpc": "03031447001",
            "name": "ចែត្រ ថៃ"
        },
        {
            "barcode": "171139638",
            "dpc": "03031447101",
            "name": "ឆេង ឡុង"
        },
        {
            "barcode": "171139639",
            "dpc": "03031447201",
            "name": "ពាំង វែង"
        },
        {
            "barcode": "171139640",
            "dpc": "03031447301",
            "name": "ស៊ឹម ណា"
        },
        {
            "barcode": "171139641",
            "dpc": "03031447401",
            "name": "ជា ឆូយ"
        },
        {
            "barcode": "171139642",
            "dpc": "03031447501",
            "name": "លុយ ម៉េងណាំង"
        },
        {
            "barcode": "171139643",
            "dpc": "03031440401",
            "name": "សៀង លីម"
        },
        {
            "barcode": "171139644",
            "dpc": "03031440601",
            "name": "សេង យក់រ៉ា"
        },
        {
            "barcode": "171139645",
            "dpc": "03031440701",
            "name": "ឈួន ហួត"
        },
        {
            "barcode": "171139646",
            "dpc": "03031440801",
            "name": "សេង ម៉ាង"
        },
        {
            "barcode": "171139647",
            "dpc": "03031440901",
            "name": "ណៃ វណ្ណៈ"
        },
        {
            "barcode": "171139648",
            "dpc": "03031441001",
            "name": "ជា ហួរ"
        },
        {
            "barcode": "171139649",
            "dpc": "03031441201",
            "name": "ជី ខេង"
        },
        {
            "barcode": "171139650",
            "dpc": "03031441301",
            "name": "កឹម  កាង"
        },
        {
            "barcode": "171139651",
            "dpc": "03031447601",
            "name": "ឡេង ស៊ូឡាង"
        },
        {
            "barcode": "171139652",
            "dpc": "03031447701",
            "name": "នន់ សុគន្ធ"
        },
        {
            "barcode": "171139653",
            "dpc": "03031447801",
            "name": "ចាន់ សូយ៉េត"
        },
        {
            "barcode": "171139654",
            "dpc": "03031447901",
            "name": "គឹម ស៊ុនរិទ្ធី"
        },
        {
            "barcode": "171139655",
            "dpc": "03031402601",
            "name": "ចាន់  ហួត"
        },
        {
            "barcode": "171139656",
            "dpc": "03031407201",
            "name": "យឹម  ចិត្រា"
        },
        {
            "barcode": "171139657",
            "dpc": "03031408701",
            "name": "ហេង  សុខមុនី"
        },
        {
            "barcode": "171139658",
            "dpc": "03031409501",
            "name": "ហាស់  ស៊ីផាន់"
        },
        {
            "barcode": "171139659",
            "dpc": "03031431201",
            "name": "អ៊ឹង  អេង"
        },
        {
            "barcode": "171139660",
            "dpc": "03031431401",
            "name": "អ៊ឹង  អេង"
        },
        {
            "barcode": "171139661",
            "dpc": "03031432301",
            "name": "ដូ  គង់"
        },
        {
            "barcode": "171139662",
            "dpc": "03031433501",
            "name": "ឡុង  នី"
        },
        {
            "barcode": "171139663",
            "dpc": "03031436701",
            "name": "ជា  សុគន្ធ ៣"
        },
        {
            "barcode": "171139664",
            "dpc": "03031438201",
            "name": "យិន  ប៊ុនឡុង"
        },
        {
            "barcode": "171139665",
            "dpc": "03031438301",
            "name": "ម៉ក់  ស៊ន"
        },
        {
            "barcode": "171139666",
            "dpc": "03031438401",
            "name": "ព្រំ  ចំរើន"
        },
        {
            "barcode": "171139667",
            "dpc": "03031438501",
            "name": "សុខ  លន់"
        },
        {
            "barcode": "171139668",
            "dpc": "03031438601",
            "name": "អ៊ឹង  វ៉ា"
        },
        {
            "barcode": "171139669",
            "dpc": "03031438901",
            "name": "លី  ស៊ុនហ"
        },
        {
            "barcode": "171139670",
            "dpc": "03031443301",
            "name": "សុខ  ចាន់"
        },
        {
            "barcode": "171139671",
            "dpc": "03031422301",
            "name": "លី  យូ"
        },
        {
            "barcode": "171139672",
            "dpc": "03031439801",
            "name": "សេង  ប្រាង"
        },
        {
            "barcode": "171139673",
            "dpc": "03031448001",
            "name": "គង់ លៀប"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
