let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171141446",
            "dpc": "03031507801",
            "name": "នូ  វេត"
        },
        {
            "barcode": "171141447",
            "dpc": "03031507701",
            "name": "សុខ  ឃាង"
        },
        {
            "barcode": "171141448",
            "dpc": "03031507601",
            "name": "អី  លី"
        },
        {
            "barcode": "171141449",
            "dpc": "03031507501",
            "name": "ហេង  គឹមនី"
        },
        {
            "barcode": "171141450",
            "dpc": "03031507401",
            "name": "ឱក គឹមចាន់"
        },
        {
            "barcode": "171141451",
            "dpc": "03031507301",
            "name": "ជិន  មឿន"
        },
        {
            "barcode": "171141452",
            "dpc": "03031507101",
            "name": "អូរ ម៉េងអ៊ារ"
        },
        {
            "barcode": "171141453",
            "dpc": "03031507001",
            "name": "ជួន  ម៉ាច"
        },
        {
            "barcode": "171141454",
            "dpc": "03031506901",
            "name": "ពៅ  ជៀវ"
        },
        {
            "barcode": "171141455",
            "dpc": "03031506801",
            "name": "ប៉ែន  ធី"
        },
        {
            "barcode": "171141456",
            "dpc": "03031506701",
            "name": "កឺ  ប៊ុនឡុង"
        },
        {
            "barcode": "171141457",
            "dpc": "03031506601",
            "name": "ផល  លីនាង"
        },
        {
            "barcode": "171141458",
            "dpc": "03031506501",
            "name": "សុខ  ណាវី"
        },
        {
            "barcode": "171141459",
            "dpc": "03031506401",
            "name": "ម៉ៅ  ទូច"
        },
        {
            "barcode": "171141460",
            "dpc": "03031506301",
            "name": "ជុន  ភក្តី"
        },
        {
            "barcode": "171141461",
            "dpc": "03031506201",
            "name": "សេង  ឡុង"
        },
        {
            "barcode": "171141462",
            "dpc": "03031506101",
            "name": "ជឹម  សុម៉ាលី"
        },
        {
            "barcode": "171141463",
            "dpc": "03031506001",
            "name": "អ៊ូ  វណ្ណា"
        },
        {
            "barcode": "171141464",
            "dpc": "03031505901",
            "name": "សេង ចាន់ដាវុធ"
        },
        {
            "barcode": "171141465",
            "dpc": "03031505801",
            "name": "សេង  ហ៊ាង"
        },
        {
            "barcode": "171141466",
            "dpc": "03031505701",
            "name": "ភុក  ជា"
        },
        {
            "barcode": "171141467",
            "dpc": "03031505601",
            "name": "ឡាំ  ហ៊ុល"
        },
        {
            "barcode": "171141468",
            "dpc": "03031505501",
            "name": "យ៉ង់  មាឌី"
        },
        {
            "barcode": "171141469",
            "dpc": "03031505401",
            "name": "ប៊ុន អេង"
        },
        {
            "barcode": "171141470",
            "dpc": "03031505301",
            "name": "ម៉េង  ពៅ"
        },
        {
            "barcode": "171141471",
            "dpc": "03031505201",
            "name": "ពឹង  ប៉ុក"
        },
        {
            "barcode": "171141472",
            "dpc": "03031505101",
            "name": "គឹម  ហ៊ាង"
        },
        {
            "barcode": "171141473",
            "dpc": "03031505001",
            "name": "អ៊ិន  ឡា ២"
        },
        {
            "barcode": "171141474",
            "dpc": "03031504901",
            "name": "ប៉ោ លីម"
        },
        {
            "barcode": "171141475",
            "dpc": "03031504801",
            "name": "ប៉ា  ដារា"
        },
        {
            "barcode": "171141476",
            "dpc": "03031504701",
            "name": "អ៊ូ  វណ្ណី"
        },
        {
            "barcode": "171141477",
            "dpc": "03031504601",
            "name": "យ៉ាង  អ៊ីអិញ"
        },
        {
            "barcode": "171141478",
            "dpc": "03031504501",
            "name": "ទឹម  ដន"
        },
        {
            "barcode": "171141479",
            "dpc": "03031504401",
            "name": "អៃ  ហ្គ្រិច"
        },
        {
            "barcode": "171141480",
            "dpc": "03031504201",
            "name": "ថោង  កញ្ញា"
        },
        {
            "barcode": "171141481",
            "dpc": "03031504101",
            "name": "ចាន់  ណាវី"
        },
        {
            "barcode": "171141482",
            "dpc": "03031504001",
            "name": "ឆេង  ស៊ីវ"
        },
        {
            "barcode": "171141483",
            "dpc": "03031503901",
            "name": "សុខ  សារិន"
        },
        {
            "barcode": "171141484",
            "dpc": "03031545401",
            "name": "ប៉ាន់ ង៉ែត"
        },
        {
            "barcode": "171141485",
            "dpc": "03031545301",
            "name": "ហឿន  ធួក"
        },
        {
            "barcode": "171141486",
            "dpc": "03031545201",
            "name": "ទ្រីញ ភាវ"
        },
        {
            "barcode": "171141487",
            "dpc": "03031545101",
            "name": "ម៉ុយ សេង"
        },
        {
            "barcode": "171141488",
            "dpc": "03031544901",
            "name": "ឃី ប៉ោឆាយ"
        },
        {
            "barcode": "171141489",
            "dpc": "03031544801",
            "name": "ធូ ញ៉េប"
        },
        {
            "barcode": "171141490",
            "dpc": "03031544701",
            "name": "សុខ វែង"
        },
        {
            "barcode": "171141491",
            "dpc": "03031544601",
            "name": "សាយ រក្សា"
        },
        {
            "barcode": "171141492",
            "dpc": "03031544501",
            "name": "សុភី វណ្ណី"
        },
        {
            "barcode": "171141493",
            "dpc": "03031544401",
            "name": "ប៉ោ សុភាព"
        },
        {
            "barcode": "171141494",
            "dpc": "03031544301",
            "name": "ឃុន ហេង"
        },
        {
            "barcode": "171141495",
            "dpc": "03031544201",
            "name": "ឃន ភារម្យ"
        },
        {
            "barcode": "171141496",
            "dpc": "03031544101",
            "name": "អ៊ុំ សារ៉ានាថ"
        },
        {
            "barcode": "171141497",
            "dpc": "03031544001",
            "name": "តាំង ប៊ុនណា"
        },
        {
            "barcode": "171141498",
            "dpc": "03031543901",
            "name": "ចាយ គា"
        },
        {
            "barcode": "171141499",
            "dpc": "03031543801",
            "name": "ឆាន់ ប៊ន"
        },
        {
            "barcode": "171141500",
            "dpc": "03031543701",
            "name": "ថាត់  យ៉ាងតាំ"
        },
        {
            "barcode": "171141501",
            "dpc": "03031543601",
            "name": "គឹម គាង"
        },
        {
            "barcode": "171141502",
            "dpc": "03031543501",
            "name": "ណៃ ផេង"
        },
        {
            "barcode": "171141503",
            "dpc": "03031543401",
            "name": "វង្ស កាំហ"
        },
        {
            "barcode": "171141504",
            "dpc": "03031543301",
            "name": "ម៉ូវ ប៊ូ"
        },
        {
            "barcode": "171141505",
            "dpc": "03031543201",
            "name": "ពិន ប៊ូ"
        },
        {
            "barcode": "171141506",
            "dpc": "03031543101",
            "name": "ប៉ោ ចន្ថា"
        },
        {
            "barcode": "171141507",
            "dpc": "03031543001",
            "name": "ជា សុផល"
        },
        {
            "barcode": "171141508",
            "dpc": "03031542901",
            "name": "ឌី ប៊ុនហ៊ាន"
        },
        {
            "barcode": "171141509",
            "dpc": "03031542801",
            "name": "សោរ ហួន"
        },
        {
            "barcode": "171141510",
            "dpc": "03031542701",
            "name": "អ៊ូច ចាន់រី"
        },
        {
            "barcode": "171141511",
            "dpc": "03031542601",
            "name": "ខឹម ហឿន"
        },
        {
            "barcode": "171141512",
            "dpc": "03031542501",
            "name": "ខឹម ទូច"
        },
        {
            "barcode": "171141513",
            "dpc": "03031542401",
            "name": "ឆន ឈឿង"
        },
        {
            "barcode": "171141514",
            "dpc": "03031542301",
            "name": "ភឹម គន"
        },
        {
            "barcode": "171141515",
            "dpc": "03031542201",
            "name": "ថេង ស្រូយ"
        },
        {
            "barcode": "171141516",
            "dpc": "03031542101",
            "name": "អ៊ឹង ឃាង"
        },
        {
            "barcode": "171141517",
            "dpc": "03031542001",
            "name": "សាន់ ហៃ"
        },
        {
            "barcode": "171141518",
            "dpc": "03031541901",
            "name": "ហ៊ុន បួយ"
        },
        {
            "barcode": "171141519",
            "dpc": "03031541801",
            "name": "ទាវ សៀម៉ី"
        },
        {
            "barcode": "171141520",
            "dpc": "03031541701",
            "name": "អ៊ុយ រី"
        },
        {
            "barcode": "171141521",
            "dpc": "03031541601",
            "name": "គី រី"
        },
        {
            "barcode": "171141522",
            "dpc": "03031541301",
            "name": "ហូយ ឡាំង"
        },
        {
            "barcode": "171141523",
            "dpc": "03031541201",
            "name": "ម៉ៅ ឆាយ"
        },
        {
            "barcode": "171141524",
            "dpc": "03031541101",
            "name": "លី ប៉ូទៀង"
        },
        {
            "barcode": "171141525",
            "dpc": "03031540901",
            "name": "សេង ហ៊ាង"
        },
        {
            "barcode": "171141526",
            "dpc": "03031540701",
            "name": "តាន់ លួង"
        },
        {
            "barcode": "171141527",
            "dpc": "03031540601",
            "name": "យុក សឿង"
        },
        {
            "barcode": "171141528",
            "dpc": "03031540401",
            "name": "តាន់ សាន់"
        },
        {
            "barcode": "171141529",
            "dpc": "03031540201",
            "name": "ទេស សុខុនវិនី"
        },
        {
            "barcode": "171141530",
            "dpc": "03031540101",
            "name": "កែវ សំអាត"
        },
        {
            "barcode": "171141531",
            "dpc": "03031540001",
            "name": "សួន ពោយ"
        },
        {
            "barcode": "171141532",
            "dpc": "03031547901",
            "name": "កាយ ចាន់ថន"
        },
        {
            "barcode": "171141533",
            "dpc": "03031547801",
            "name": "អ៊ឹម សូថាយ"
        },
        {
            "barcode": "171141534",
            "dpc": "03031547701",
            "name": "ញ៉េប គឹមឈឿង"
        },
        {
            "barcode": "171141535",
            "dpc": "03031547601",
            "name": "កង សេត"
        },
        {
            "barcode": "171141536",
            "dpc": "03031547501",
            "name": "ឈ ជិត"
        },
        {
            "barcode": "171141537",
            "dpc": "03031547401",
            "name": "ជឹម សេង"
        },
        {
            "barcode": "171141538",
            "dpc": "03031547301",
            "name": "តាំង នី"
        },
        {
            "barcode": "171141539",
            "dpc": "03031547201",
            "name": "តាំង ទទី"
        },
        {
            "barcode": "171141540",
            "dpc": "03031547101",
            "name": "ម៉ាន់ ប៊ុន"
        },
        {
            "barcode": "171141541",
            "dpc": "03031547001",
            "name": "លី ស៊ុនហ"
        },
        {
            "barcode": "171141542",
            "dpc": "03031546901",
            "name": "យ៉ាង ស៊ីវសេង ១"
        },
        {
            "barcode": "171141543",
            "dpc": "03031546801",
            "name": "ជា សម្ភស្ស"
        },
        {
            "barcode": "171141544",
            "dpc": "03031546701",
            "name": "សា ម៉ូរ៉ាក់"
        },
        {
            "barcode": "171141545",
            "dpc": "03031546601",
            "name": "អ៊ូច សាត់"
        },
        {
            "barcode": "171141546",
            "dpc": "03031546501",
            "name": "ង៉ែត គិម"
        },
        {
            "barcode": "171141547",
            "dpc": "03031546401",
            "name": "ផាន់ សុវណ្ណរិទ្ធ"
        },
        {
            "barcode": "171141548",
            "dpc": "03031546301",
            "name": "ខឹម ហឿន"
        },
        {
            "barcode": "171141549",
            "dpc": "03031546201",
            "name": "យី គឹមអាង"
        },
        {
            "barcode": "171141550",
            "dpc": "03031546101",
            "name": "ឈាវ ងិត"
        },
        {
            "barcode": "171141551",
            "dpc": "03031546001",
            "name": "នុត ថុន"
        },
        {
            "barcode": "171141552",
            "dpc": "03031545901",
            "name": "ហ៊ុយ តុង"
        },
        {
            "barcode": "171141553",
            "dpc": "03031545801",
            "name": "វណ្ណ សុផេន"
        },
        {
            "barcode": "171141554",
            "dpc": "03031545701",
            "name": "ទូច វ៉ាន់"
        },
        {
            "barcode": "171141555",
            "dpc": "03031545601",
            "name": "សុខ គុជ"
        },
        {
            "barcode": "171141556",
            "dpc": "03031545501",
            "name": "លី ហាក់"
        },
        {
            "barcode": "171141557",
            "dpc": "03031507901",
            "name": "ង៉ូវ គា"
        },
        {
            "barcode": "171141558",
            "dpc": "03031508001",
            "name": "សិទ្ធ ងួនហាក់"
        },
        {
            "barcode": "171141559",
            "dpc": "03031508101",
            "name": "ខៀវ ងួនឡេង"
        },
        {
            "barcode": "171141560",
            "dpc": "03031508201",
            "name": "អ៊ឹង អេង"
        },
        {
            "barcode": "171141561",
            "dpc": "03031508301",
            "name": "ស ឌឿ"
        },
        {
            "barcode": "171141562",
            "dpc": "03031508401",
            "name": "ម៉ាច ប៊ុនហ៊ាញ"
        },
        {
            "barcode": "171141563",
            "dpc": "03031508501",
            "name": "ម៉េង លាភ"
        },
        {
            "barcode": "171141564",
            "dpc": "03031508601",
            "name": "នាង ង៉ា"
        },
        {
            "barcode": "171141565",
            "dpc": "03031508701",
            "name": "ចាន់ សារេត"
        },
        {
            "barcode": "171141566",
            "dpc": "03031508801",
            "name": "ងឹម ពៅ"
        },
        {
            "barcode": "171141567",
            "dpc": "03031508901",
            "name": "ឡាវ ស៊ីវលី"
        },
        {
            "barcode": "171141568",
            "dpc": "03031509201",
            "name": "សោម ឌួង"
        },
        {
            "barcode": "171141569",
            "dpc": "03031509001",
            "name": "សុខ ហាយ"
        },
        {
            "barcode": "171141570",
            "dpc": "03031509301",
            "name": "សំរិត វិចិត្រ"
        },
        {
            "barcode": "171141571",
            "dpc": "03031517101",
            "name": "ម៉ៅ  នាង"
        },
        {
            "barcode": "171141572",
            "dpc": "03031509401",
            "name": "ចាន់ មុំ"
        },
        {
            "barcode": "171141573",
            "dpc": "03031509501",
            "name": "ធិ សុខុម"
        },
        {
            "barcode": "171141574",
            "dpc": "03031509601",
            "name": "សេង សម្បត្តិ"
        },
        {
            "barcode": "171141575",
            "dpc": "03031509701",
            "name": "ថាច់ ចាន់ថន"
        },
        {
            "barcode": "171141576",
            "dpc": "03031509901",
            "name": "ចាន់ ហ៊ាន"
        },
        {
            "barcode": "171141577",
            "dpc": "03031510001",
            "name": "យឹម ហូរ"
        },
        {
            "barcode": "171141578",
            "dpc": "03031510101",
            "name": "ជា សុខណា"
        },
        {
            "barcode": "171141579",
            "dpc": "03031510201",
            "name": "យឹម សារុំ"
        },
        {
            "barcode": "171141580",
            "dpc": "03031510301",
            "name": "លឹម ហាក់"
        },
        {
            "barcode": "171141581",
            "dpc": "03031510401",
            "name": "អាង ទី"
        },
        {
            "barcode": "171141582",
            "dpc": "03031510501",
            "name": "កៅ ណារិទ្ធ"
        },
        {
            "barcode": "171141583",
            "dpc": "03031510701",
            "name": "តាំង ហៀង"
        },
        {
            "barcode": "171141584",
            "dpc": "03031510801",
            "name": "ចាន់ លាង"
        },
        {
            "barcode": "171141585",
            "dpc": "03031510901",
            "name": "ឆេង ហ៊ាង"
        },
        {
            "barcode": "171141586",
            "dpc": "03031511001",
            "name": "ពេជ្រ តិចស៊្រុន"
        },
        {
            "barcode": "171141587",
            "dpc": "03031511101",
            "name": "ទេព ប៊ុនតុង"
        },
        {
            "barcode": "171141588",
            "dpc": "03031511301",
            "name": "លឹម ហ៊ត"
        },
        {
            "barcode": "171141589",
            "dpc": "03031511401",
            "name": "គុយ ទ្រី"
        },
        {
            "barcode": "171141590",
            "dpc": "03031511501",
            "name": "ប៉ុល សារី"
        },
        {
            "barcode": "171141591",
            "dpc": "03031511601",
            "name": "ស៊ីវ  គង់"
        },
        {
            "barcode": "171141592",
            "dpc": "03031511201",
            "name": "ចេង ហួន"
        },
        {
            "barcode": "171141593",
            "dpc": "03031511701",
            "name": "គង់ នី"
        },
        {
            "barcode": "171141594",
            "dpc": "03031511901",
            "name": "ថៃ បាក់លីវ"
        },
        {
            "barcode": "171141595",
            "dpc": "03031512001",
            "name": "សួន សាយ"
        },
        {
            "barcode": "171141596",
            "dpc": "03031512101",
            "name": "មិន សុខខេង"
        },
        {
            "barcode": "171141597",
            "dpc": "03031512301",
            "name": "សាន់  ឃាង"
        },
        {
            "barcode": "171141598",
            "dpc": "03031512401",
            "name": "សុខ ហូ"
        },
        {
            "barcode": "171141599",
            "dpc": "03031512501",
            "name": "គី សៀកហួរ"
        },
        {
            "barcode": "171141600",
            "dpc": "03031512601",
            "name": "ចាន់ ហ៊ាញ"
        },
        {
            "barcode": "171141601",
            "dpc": "03031512701",
            "name": "ញ៉ែម ហឿន"
        },
        {
            "barcode": "171141602",
            "dpc": "03031512801",
            "name": "ប៊ុន សេង"
        },
        {
            "barcode": "171141603",
            "dpc": "03031512901",
            "name": "ពត សុត"
        },
        {
            "barcode": "171141604",
            "dpc": "03031513001",
            "name": "ឆាន់ ហាក់"
        },
        {
            "barcode": "171141605",
            "dpc": "03031513101",
            "name": "ឆាន់ ឈឿង"
        },
        {
            "barcode": "171141606",
            "dpc": "03031513201",
            "name": "សុខ លី"
        },
        {
            "barcode": "171141607",
            "dpc": "03031513301",
            "name": "គង់ សុខម៉េង"
        },
        {
            "barcode": "171141608",
            "dpc": "03031513401",
            "name": "តាំង រុនឌី"
        },
        {
            "barcode": "171141609",
            "dpc": "03031513501",
            "name": "អៀរ ហៀង"
        },
        {
            "barcode": "171141610",
            "dpc": "03031513601",
            "name": "ទេព រិទ្ធី"
        },
        {
            "barcode": "171141611",
            "dpc": "03031513701",
            "name": "ហោ ឃាង"
        },
        {
            "barcode": "171141612",
            "dpc": "03031513801",
            "name": "វ៉ាន់ ថូង"
        },
        {
            "barcode": "171141613",
            "dpc": "03031513901",
            "name": "ស៊ឹម វ៉ាត់"
        },
        {
            "barcode": "171141614",
            "dpc": "03031514001",
            "name": "វ៉ាត ធា"
        },
        {
            "barcode": "171141615",
            "dpc": "03031514101",
            "name": "លី ពិសិដ្ឋ"
        },
        {
            "barcode": "171141616",
            "dpc": "03031514201",
            "name": "អ៊ុត មួយ"
        },
        {
            "barcode": "171141617",
            "dpc": "03031514301",
            "name": "សោម រ៉ានី"
        },
        {
            "barcode": "171141618",
            "dpc": "03031514401",
            "name": "យ៉ាន់ សំអូន"
        },
        {
            "barcode": "171141619",
            "dpc": "03031514501",
            "name": "តាន់ គឹមសុន"
        },
        {
            "barcode": "171141620",
            "dpc": "03031514601",
            "name": "ម៉ៅ ខេន"
        },
        {
            "barcode": "171141621",
            "dpc": "03031514801",
            "name": "សុខ ឃឿន"
        },
        {
            "barcode": "171141622",
            "dpc": "03031514701",
            "name": "ឃាន សំណាង"
        },
        {
            "barcode": "171141623",
            "dpc": "03031514901",
            "name": "អ៊ុន ឈឿន"
        },
        {
            "barcode": "171141624",
            "dpc": "03031515001",
            "name": "សេ ស៊ីឡាដា"
        },
        {
            "barcode": "171141625",
            "dpc": "03031515201",
            "name": "ឃី សុផា ២"
        },
        {
            "barcode": "171141626",
            "dpc": "03031515301",
            "name": "ទិត្យ រ៉ា"
        },
        {
            "barcode": "171141627",
            "dpc": "03031515401",
            "name": "អ៊ឹង ឡឹមហ៊ី"
        },
        {
            "barcode": "171141628",
            "dpc": "03031515501",
            "name": "គា សាម៉ន"
        },
        {
            "barcode": "171141629",
            "dpc": "03031515601",
            "name": "សុវណ្ណ សាវ៉ាន់រ៉ាន់"
        },
        {
            "barcode": "171141630",
            "dpc": "03031515701",
            "name": "ទ្រី សាមិត្ត"
        },
        {
            "barcode": "171141631",
            "dpc": "03031516001",
            "name": "ម៉េង ចាន់ថន"
        },
        {
            "barcode": "171141632",
            "dpc": "03031515901",
            "name": "ដែង សាវឿត"
        },
        {
            "barcode": "171141633",
            "dpc": "03031515801",
            "name": "ឡុង សារ៉េត"
        },
        {
            "barcode": "171141634",
            "dpc": "03031516101",
            "name": "អ៊ិត គឹមស្រ៊ុន"
        },
        {
            "barcode": "171141635",
            "dpc": "03031516201",
            "name": "យស សុខមាន"
        },
        {
            "barcode": "171141636",
            "dpc": "03031516301",
            "name": "ស្វាយ  ភីរម្យ"
        },
        {
            "barcode": "171141637",
            "dpc": "03031516401",
            "name": "វ៉ែន ទូច"
        },
        {
            "barcode": "171141638",
            "dpc": "03031516501",
            "name": "វ៉ឹង វុទ្ធី"
        },
        {
            "barcode": "171141639",
            "dpc": "03031516601",
            "name": "ណាល់ ជិនណា"
        },
        {
            "barcode": "171141640",
            "dpc": "03031516701",
            "name": "ពុធ គ្រឿន"
        },
        {
            "barcode": "171141641",
            "dpc": "03031516801",
            "name": "ហៀង លីវ"
        },
        {
            "barcode": "171141642",
            "dpc": "03031516901",
            "name": "សោម ផានី"
        },
        {
            "barcode": "171141643",
            "dpc": "03031517001",
            "name": "តេង សុខា"
        },
        {
            "barcode": "171141644",
            "dpc": "03031517201",
            "name": "អ៊ាម ស៊"
        },
        {
            "barcode": "171141645",
            "dpc": "03031517301",
            "name": "តែង ស៊ីវអេង"
        },
        {
            "barcode": "171141646",
            "dpc": "03031517401",
            "name": "ឈន ហ៊ុន"
        },
        {
            "barcode": "171141647",
            "dpc": "03031517501",
            "name": "នង ឃីម"
        },
        {
            "barcode": "171141648",
            "dpc": "03031517601",
            "name": "លិញ ម៉ាលីស"
        },
        {
            "barcode": "171141649",
            "dpc": "03031517701",
            "name": "លិញ ទៀន"
        },
        {
            "barcode": "171141650",
            "dpc": "03031517801",
            "name": "ស៊ុយ លី"
        },
        {
            "barcode": "171141651",
            "dpc": "03031517901",
            "name": "ប៉ាន ធានី"
        },
        {
            "barcode": "171141652",
            "dpc": "03031518001",
            "name": "ថន ប៊ុនធឿន"
        },
        {
            "barcode": "171141653",
            "dpc": "03031518101",
            "name": "គឹម អេង"
        },
        {
            "barcode": "171141654",
            "dpc": "03031518201",
            "name": "ឆេង សខហៀង"
        },
        {
            "barcode": "171141655",
            "dpc": "03031518301",
            "name": "ថែម លី"
        },
        {
            "barcode": "171141656",
            "dpc": "03031518401",
            "name": "ចាប ប៊ុតគឹមលីស"
        },
        {
            "barcode": "171141657",
            "dpc": "03031518501",
            "name": "ម៉ៅ ប៊ុនធៀន"
        },
        {
            "barcode": "171141658",
            "dpc": "03031518601",
            "name": "លី ម៉េង"
        },
        {
            "barcode": "171141659",
            "dpc": "03031539901",
            "name": "ឡៃ ហ៊ាង"
        },
        {
            "barcode": "171141660",
            "dpc": "03031539701",
            "name": "ឡៅ ជី"
        },
        {
            "barcode": "171141661",
            "dpc": "03031539601",
            "name": "តា លាង"
        },
        {
            "barcode": "171141662",
            "dpc": "03031539501",
            "name": "ញឹក សុធី"
        },
        {
            "barcode": "171141663",
            "dpc": "03031539401",
            "name": "ហូ ប៉ុក"
        },
        {
            "barcode": "171141664",
            "dpc": "03031539301",
            "name": "ង៉ោ ជឹងឈុន"
        },
        {
            "barcode": "171141665",
            "dpc": "03031539201",
            "name": "ម៉េង វណ្ណៈ"
        },
        {
            "barcode": "171141666",
            "dpc": "03031539001",
            "name": "អ៊ឹង ឡៃហុក"
        },
        {
            "barcode": "171141667",
            "dpc": "03031538901",
            "name": "ប៉ោ ស៊ីមឡី"
        },
        {
            "barcode": "171141668",
            "dpc": "03031538801",
            "name": "ប្រាក់ គឹមឡាយ"
        },
        {
            "barcode": "171141669",
            "dpc": "03031538601",
            "name": "ថោង សុខា"
        },
        {
            "barcode": "171141670",
            "dpc": "03031538501",
            "name": "ប្រាក់ ស៊ីម"
        },
        {
            "barcode": "171141671",
            "dpc": "03031538401",
            "name": "ជា ចាន់"
        },
        {
            "barcode": "171141672",
            "dpc": "03031538301",
            "name": "ឈុន ហាក់"
        },
        {
            "barcode": "171141673",
            "dpc": "03031538201",
            "name": "សាន កុសល"
        },
        {
            "barcode": "171141674",
            "dpc": "03031538101",
            "name": "វ៉ាន់  វុត្ថា"
        },
        {
            "barcode": "171141675",
            "dpc": "03031538001",
            "name": "តាំង  យ៉ាវ"
        },
        {
            "barcode": "171141676",
            "dpc": "03031537901",
            "name": "ឌី កេង"
        },
        {
            "barcode": "171141677",
            "dpc": "03031537801",
            "name": "សួង សារួន"
        },
        {
            "barcode": "171141678",
            "dpc": "03031537701",
            "name": "ជា អ៊ុល"
        },
        {
            "barcode": "171141679",
            "dpc": "03031536401",
            "name": "មិន ហៃ"
        },
        {
            "barcode": "171141680",
            "dpc": "03031536301",
            "name": "សោ ម៉េងហ៊ាង"
        },
        {
            "barcode": "171141681",
            "dpc": "03031536201",
            "name": "សុខ លី"
        },
        {
            "barcode": "171141682",
            "dpc": "03031536101",
            "name": "ស៊ុន ជឿន"
        },
        {
            "barcode": "171141683",
            "dpc": "03031536001",
            "name": "ស៊ូ ចក់"
        },
        {
            "barcode": "171141684",
            "dpc": "03031535901",
            "name": "ខ្លូត ហ៊ុយហេង"
        },
        {
            "barcode": "171141685",
            "dpc": "03031535801",
            "name": "គួច ហៃ"
        },
        {
            "barcode": "171141686",
            "dpc": "03031535701",
            "name": "ហេង ប៊ុនផាន"
        },
        {
            "barcode": "171141687",
            "dpc": "03031535601",
            "name": "តាំង គី"
        },
        {
            "barcode": "171141688",
            "dpc": "03031535501",
            "name": "គឹម ឡា"
        },
        {
            "barcode": "171141689",
            "dpc": "03031535401",
            "name": "អ៊ុច អាំង"
        },
        {
            "barcode": "171141690",
            "dpc": "03031535301",
            "name": "ម៉ម ពន្លក ១"
        },
        {
            "barcode": "171141691",
            "dpc": "03031535201",
            "name": "គាំ ពៅ"
        },
        {
            "barcode": "171141692",
            "dpc": "03031535101",
            "name": "ចែវ គឹមវ៉ា"
        },
        {
            "barcode": "171141693",
            "dpc": "03031534901",
            "name": "ចាន់ មុំ"
        },
        {
            "barcode": "171141694",
            "dpc": "03031534801",
            "name": "ប្រាង្គ តាយ"
        },
        {
            "barcode": "171141695",
            "dpc": "03031534701",
            "name": "ទន់ សារុន"
        },
        {
            "barcode": "171141696",
            "dpc": "03031534601",
            "name": "កង នី"
        },
        {
            "barcode": "171141697",
            "dpc": "03031534501",
            "name": "អ៊ុក វណ្ណា"
        },
        {
            "barcode": "171141698",
            "dpc": "03031534401",
            "name": "ប៉ិច គឹមស៊"
        },
        {
            "barcode": "171141699",
            "dpc": "03031534301",
            "name": "ជុក ឡុង"
        },
        {
            "barcode": "171141700",
            "dpc": "03031534201",
            "name": "ហាក់ លីម"
        },
        {
            "barcode": "171141701",
            "dpc": "03031534101",
            "name": "អ៊ុន ហ្សាលី"
        },
        {
            "barcode": "171141702",
            "dpc": "03031534001",
            "name": "លី ហូយ"
        },
        {
            "barcode": "171141703",
            "dpc": "03031533901",
            "name": "ឃី ណារិន"
        },
        {
            "barcode": "171141704",
            "dpc": "03031533801",
            "name": "គុយ ហួត"
        },
        {
            "barcode": "171141705",
            "dpc": "03031533701",
            "name": "ខូវ ហ៊ុយប៉ិ"
        },
        {
            "barcode": "171141706",
            "dpc": "03031533601",
            "name": "ថាច់ បូរិន"
        },
        {
            "barcode": "171141707",
            "dpc": "03031533501",
            "name": "អ៊ឹង ឡៃហ៊ត"
        },
        {
            "barcode": "171141708",
            "dpc": "03031533401",
            "name": "អ៊ុន ចំរើន"
        },
        {
            "barcode": "171141709",
            "dpc": "03031533301",
            "name": "ញិល ស៊ន"
        },
        {
            "barcode": "171141710",
            "dpc": "03031533201",
            "name": "លន់ អេង"
        },
        {
            "barcode": "171141711",
            "dpc": "03031533101",
            "name": "ធូ ហៃ"
        },
        {
            "barcode": "171141712",
            "dpc": "03031533001",
            "name": "តុង លីហួរ"
        },
        {
            "barcode": "171141713",
            "dpc": "03031532901",
            "name": "ជុំ រតនា"
        },
        {
            "barcode": "171141714",
            "dpc": "03031532801",
            "name": "គង់ សំណាង"
        },
        {
            "barcode": "171141715",
            "dpc": "03031532701",
            "name": "វ៉ែន ទិត្យ"
        },
        {
            "barcode": "171141716",
            "dpc": "03031537101",
            "name": "សឿន លី"
        },
        {
            "barcode": "171141717",
            "dpc": "03031537001",
            "name": "លឹម ហួន"
        },
        {
            "barcode": "171141718",
            "dpc": "03031536901",
            "name": "ភឿន ណូក"
        },
        {
            "barcode": "171141719",
            "dpc": "03031536801",
            "name": "អ៊ុក វណ្ណា"
        },
        {
            "barcode": "171141720",
            "dpc": "03031536501",
            "name": "លី សុង"
        },
        {
            "barcode": "171141721",
            "dpc": "03031536601",
            "name": "កែវ ប៊ុនឆន"
        },
        {
            "barcode": "171141722",
            "dpc": "03031536701",
            "name": "លី សាំងអូន"
        },
        {
            "barcode": "171141723",
            "dpc": "03031537601",
            "name": "លី សម្បត្តិ"
        },
        {
            "barcode": "171141724",
            "dpc": "03031537501",
            "name": "ជង់ ធឿង"
        },
        {
            "barcode": "171141725",
            "dpc": "03031532201",
            "name": "ស៊ុយ ពៅ"
        },
        {
            "barcode": "171141726",
            "dpc": "03031537401",
            "name": "ឃិន សាន"
        },
        {
            "barcode": "171141727",
            "dpc": "03031537301",
            "name": "ឃិន ជូ"
        },
        {
            "barcode": "171141728",
            "dpc": "03031537201",
            "name": "ប៊ុន ឈីញ"
        },
        {
            "barcode": "171141729",
            "dpc": "03031532601",
            "name": "អិត ផល្លី"
        },
        {
            "barcode": "171141730",
            "dpc": "03031532501",
            "name": "យី សាបាន"
        },
        {
            "barcode": "171141731",
            "dpc": "03031532401",
            "name": "ឆាន់ ភុយ"
        },
        {
            "barcode": "171141732",
            "dpc": "03031532301",
            "name": "សេង អ៊ន"
        },
        {
            "barcode": "171141733",
            "dpc": "03031532101",
            "name": "សៀម ទៀង"
        },
        {
            "barcode": "171141734",
            "dpc": "03031532001",
            "name": "ជុំ គឹមអុ"
        },
        {
            "barcode": "171141735",
            "dpc": "03031531701",
            "name": "សម សុវណ្ណ"
        },
        {
            "barcode": "171141736",
            "dpc": "03031531501",
            "name": "ឡាយ ស៊"
        },
        {
            "barcode": "171141737",
            "dpc": "03031531401",
            "name": "អោក អៀង"
        },
        {
            "barcode": "171141738",
            "dpc": "03031531301",
            "name": "អ៊ួច យ៉ន"
        },
        {
            "barcode": "171141739",
            "dpc": "03031527201",
            "name": "ម៉េង លាង"
        },
        {
            "barcode": "171141740",
            "dpc": "03031527301",
            "name": "សេង វណ្ណី"
        },
        {
            "barcode": "171141741",
            "dpc": "03031527401",
            "name": "លី ម៉េងហ៊ី"
        },
        {
            "barcode": "171141742",
            "dpc": "03031527501",
            "name": "កែវ លី"
        },
        {
            "barcode": "171141743",
            "dpc": "03031527701",
            "name": "ឆេ សាន"
        },
        {
            "barcode": "171141744",
            "dpc": "03031527801",
            "name": "អេង លី ១"
        },
        {
            "barcode": "171141745",
            "dpc": "03031527901",
            "name": "ជន យ៉ម"
        },
        {
            "barcode": "171141746",
            "dpc": "03031528001",
            "name": "តែ ហន"
        },
        {
            "barcode": "171141747",
            "dpc": "03031528101",
            "name": "ពៅ វ៉ាន់ថា"
        },
        {
            "barcode": "171141748",
            "dpc": "03031528201",
            "name": "លឹម គឹមសាន"
        },
        {
            "barcode": "171141749",
            "dpc": "03031528301",
            "name": "អេង លី ២"
        },
        {
            "barcode": "171141750",
            "dpc": "03031528401",
            "name": "ពិន សង្គមឧត្តម"
        },
        {
            "barcode": "171141751",
            "dpc": "03031528501",
            "name": "ស៊ីវ ឃួងប៉ោ"
        },
        {
            "barcode": "171141752",
            "dpc": "03031528601",
            "name": "ចៅ មួយ"
        },
        {
            "barcode": "171141753",
            "dpc": "03031528701",
            "name": "ព្រុំ រដ្ឋា"
        },
        {
            "barcode": "171141754",
            "dpc": "03031528801",
            "name": "ដាញ់ អេងប៊ុនវ៉ាន់"
        },
        {
            "barcode": "171141755",
            "dpc": "03031528901",
            "name": "សេង លៀប"
        },
        {
            "barcode": "171141756",
            "dpc": "03031529001",
            "name": "ទេព ថាវី"
        },
        {
            "barcode": "171141757",
            "dpc": "03031529101",
            "name": "តែ ឡាង"
        },
        {
            "barcode": "171141758",
            "dpc": "03031529201",
            "name": "អែល ស្រ៊ុន"
        },
        {
            "barcode": "171141759",
            "dpc": "03031529301",
            "name": "យូ  សំអុល"
        },
        {
            "barcode": "171141760",
            "dpc": "03031529601",
            "name": "តែម  វុន"
        },
        {
            "barcode": "171141761",
            "dpc": "03031529701",
            "name": "សាន ស៊ីម៉ៃ"
        },
        {
            "barcode": "171141762",
            "dpc": "03031529901",
            "name": "ចាប ទៀង"
        },
        {
            "barcode": "171141763",
            "dpc": "03031530001",
            "name": "ទាវ តុប"
        },
        {
            "barcode": "171141764",
            "dpc": "03031530101",
            "name": "លី ហួយ"
        },
        {
            "barcode": "171141765",
            "dpc": "03031530201",
            "name": "យឿម ថេង"
        },
        {
            "barcode": "171141766",
            "dpc": "03031530301",
            "name": "តាំង លីម"
        },
        {
            "barcode": "171141767",
            "dpc": "03031530501",
            "name": "ផន គឹមកែវ"
        },
        {
            "barcode": "171141768",
            "dpc": "03031530601",
            "name": "សេង ថា"
        },
        {
            "barcode": "171141769",
            "dpc": "03031530801",
            "name": "ហុង  ជីហៃ"
        },
        {
            "barcode": "171141770",
            "dpc": "03031530701",
            "name": "គង់ យឿត"
        },
        {
            "barcode": "171141771",
            "dpc": "03031530901",
            "name": "ជុំ ពិទាក់"
        },
        {
            "barcode": "171141772",
            "dpc": "03031531001",
            "name": "ខាត់ ប៊ុនទៀង"
        },
        {
            "barcode": "171141773",
            "dpc": "03031531201",
            "name": "ភោគ  រិទ្ធា"
        },
        {
            "barcode": "171141774",
            "dpc": "03031531101",
            "name": "សាលាបឋមសិក្សា ទួលតាឯក"
        },
        {
            "barcode": "171141775",
            "dpc": "03031525401",
            "name": "សឹម ហៃ"
        },
        {
            "barcode": "171141776",
            "dpc": "03031525501",
            "name": "លី ឃឿង"
        },
        {
            "barcode": "171141777",
            "dpc": "03031525601",
            "name": "ម៉េង ឆវី"
        },
        {
            "barcode": "171141778",
            "dpc": "03031518701",
            "name": "អ៊ុំ កុលរ៉េណែល"
        },
        {
            "barcode": "171141779",
            "dpc": "03031518801",
            "name": "អូច សម្បត្តិ"
        },
        {
            "barcode": "171141780",
            "dpc": "03031518901",
            "name": "ភូ ជុំតា"
        },
        {
            "barcode": "171141781",
            "dpc": "03031519001",
            "name": "ប៊ុន ណាក់"
        },
        {
            "barcode": "171141782",
            "dpc": "03031519101",
            "name": "ជុំ សៅហីណែត"
        },
        {
            "barcode": "171141783",
            "dpc": "03031519201",
            "name": "អោក ប៊ុនធឿន"
        },
        {
            "barcode": "171141784",
            "dpc": "03031519301",
            "name": "ទឹម បំរ៉ុង"
        },
        {
            "barcode": "171141785",
            "dpc": "03031519401",
            "name": "ឈឹម ប៊ុនឆន"
        },
        {
            "barcode": "171141786",
            "dpc": "03031519501",
            "name": "ធុង សាខន"
        },
        {
            "barcode": "171141787",
            "dpc": "03031519601",
            "name": "ឥន រ៉ាលីន"
        },
        {
            "barcode": "171141788",
            "dpc": "03031519701",
            "name": "កែវ សំអាន"
        },
        {
            "barcode": "171141789",
            "dpc": "03031519801",
            "name": "ដួង ភឿប"
        },
        {
            "barcode": "171141790",
            "dpc": "03031519901",
            "name": "កេត ចន្ទូ"
        },
        {
            "barcode": "171141791",
            "dpc": "03031520001",
            "name": "ស៊ុន ដារ៉ា"
        },
        {
            "barcode": "171141792",
            "dpc": "03031520101",
            "name": "កែម ចាន់ថុល"
        },
        {
            "barcode": "171141793",
            "dpc": "03031520201",
            "name": "នង ភីនាម"
        },
        {
            "barcode": "171141794",
            "dpc": "03031520601",
            "name": "ម៉ក់ ចំរើន"
        },
        {
            "barcode": "171141795",
            "dpc": "03031520701",
            "name": "សាន់ ឆប"
        },
        {
            "barcode": "171141796",
            "dpc": "03031520801",
            "name": "ឡុច លឿត"
        },
        {
            "barcode": "171141797",
            "dpc": "03031521001",
            "name": "ជា សាវឿន"
        },
        {
            "barcode": "171141798",
            "dpc": "03031521101",
            "name": "ហេង ស៊ីហា"
        },
        {
            "barcode": "171141799",
            "dpc": "03031521201",
            "name": "សែន សុភាព"
        },
        {
            "barcode": "171141800",
            "dpc": "03031526301",
            "name": "អ៊ុន សាខន"
        },
        {
            "barcode": "171141801",
            "dpc": "03031526401",
            "name": "មាស ឡុង"
        },
        {
            "barcode": "171141802",
            "dpc": "03031527101",
            "name": "ទុំ សុធាន"
        },
        {
            "barcode": "171141803",
            "dpc": "03031527001",
            "name": "នាង ស៊ីណា"
        },
        {
            "barcode": "171141804",
            "dpc": "03031526901",
            "name": "ញ៉ែម រ៉ែន"
        },
        {
            "barcode": "171141805",
            "dpc": "03031526701",
            "name": "វន ហ៊ីម"
        },
        {
            "barcode": "171141806",
            "dpc": "03031526801",
            "name": "យ៉ាត យឿន"
        },
        {
            "barcode": "171141807",
            "dpc": "03031526501",
            "name": "នុត ស្រីស្រស់"
        },
        {
            "barcode": "171141808",
            "dpc": "03031526601",
            "name": "ជន គឹមគ្រី"
        },
        {
            "barcode": "171141809",
            "dpc": "03031525901",
            "name": "ប៊ិន ថាវ"
        },
        {
            "barcode": "171141810",
            "dpc": "03031522101",
            "name": "សុខ ណារិទ្ធ"
        },
        {
            "barcode": "171141811",
            "dpc": "03031522001",
            "name": "គិត សុខូ"
        },
        {
            "barcode": "171141812",
            "dpc": "03031522201",
            "name": "កែវ សុភាព"
        },
        {
            "barcode": "171141813",
            "dpc": "03031522301",
            "name": "ចាន់ ហោល"
        },
        {
            "barcode": "171141814",
            "dpc": "03031522401",
            "name": "សៀវ តៀវ"
        },
        {
            "barcode": "171141815",
            "dpc": "03031522601",
            "name": "យូ ដេត"
        },
        {
            "barcode": "171141816",
            "dpc": "03031522801",
            "name": "កែវ ពិសិដ្ឋ"
        },
        {
            "barcode": "171141817",
            "dpc": "03031522701",
            "name": "លឹម ស៊ីណាត"
        },
        {
            "barcode": "171141818",
            "dpc": "03031522901",
            "name": "ដេត សាឃុន"
        },
        {
            "barcode": "171141819",
            "dpc": "03031523101",
            "name": "ឈឹម នូ"
        },
        {
            "barcode": "171141820",
            "dpc": "03031523201",
            "name": "ម៉ែន រដ្ឋា"
        },
        {
            "barcode": "171141821",
            "dpc": "03031523301",
            "name": "ញ៉ែម ប៊ុនសេង"
        },
        {
            "barcode": "171141822",
            "dpc": "03031523401",
            "name": "ថំ ហួរ"
        },
        {
            "barcode": "171141823",
            "dpc": "03031523501",
            "name": "គុជ ផាន់"
        },
        {
            "barcode": "171141824",
            "dpc": "03031523601",
            "name": "តែ ស៊ីណា"
        },
        {
            "barcode": "171141825",
            "dpc": "03031523801",
            "name": "តាំង ហួង"
        },
        {
            "barcode": "171141826",
            "dpc": "03031523901",
            "name": "ញិប សាវឿន"
        },
        {
            "barcode": "171141827",
            "dpc": "03031524001",
            "name": "ហេង វើន"
        },
        {
            "barcode": "171141828",
            "dpc": "03031524101",
            "name": "គង់ ចេង"
        },
        {
            "barcode": "171141829",
            "dpc": "03031524201",
            "name": "ចាន់ ហ៊ង"
        },
        {
            "barcode": "171141830",
            "dpc": "03031524301",
            "name": "ទេស ចន្ថា"
        },
        {
            "barcode": "171141831",
            "dpc": "03031524401",
            "name": "ប៉ែន តារា"
        },
        {
            "barcode": "171141832",
            "dpc": "03031524501",
            "name": "តេង ប៉ាន់"
        },
        {
            "barcode": "171141833",
            "dpc": "03031524601",
            "name": "ចិន មុំ"
        },
        {
            "barcode": "171141834",
            "dpc": "03031524701",
            "name": "លេខ វន"
        },
        {
            "barcode": "171141835",
            "dpc": "03031524801",
            "name": "មាស រិទ្ធ"
        },
        {
            "barcode": "171141836",
            "dpc": "03031524901",
            "name": "ម៉ាក ទន"
        },
        {
            "barcode": "171141837",
            "dpc": "03031525001",
            "name": "ថេ ដារ៉ា"
        },
        {
            "barcode": "171141838",
            "dpc": "03031525101",
            "name": "ចាន់ វណ្ណាលឿម"
        },
        {
            "barcode": "171141839",
            "dpc": "03031525201",
            "name": "ឡៃ គឹមឡេង"
        },
        {
            "barcode": "171141840",
            "dpc": "03031523001",
            "name": "អ៊ឹម សំអន"
        },
        {
            "barcode": "171141841",
            "dpc": "03031509101",
            "name": "ឡាប  អេង"
        },
        {
            "barcode": "171141842",
            "dpc": "03031521301",
            "name": "លី  ហ៊ាន"
        },
        {
            "barcode": "171141843",
            "dpc": "03031521401",
            "name": "ប៉ុក  ឈិត"
        },
        {
            "barcode": "171141844",
            "dpc": "03031521601",
            "name": "ម៉ី  វុន"
        },
        {
            "barcode": "171141845",
            "dpc": "03031521701",
            "name": "កំរិត  អូន"
        },
        {
            "barcode": "171141846",
            "dpc": "03031521801",
            "name": "ទេស  ហ៊ាញ"
        },
        {
            "barcode": "171141847",
            "dpc": "03031521901",
            "name": "ងួន  សុទ្ធី"
        },
        {
            "barcode": "171141848",
            "dpc": "03031525301",
            "name": "ប្រាក់  គឹមឡាយ"
        },
        {
            "barcode": "171141849",
            "dpc": "03031525801",
            "name": "រស  សុខុម"
        },
        {
            "barcode": "171141850",
            "dpc": "03031526001",
            "name": "ឌុច  យ៉េន"
        },
        {
            "barcode": "171141851",
            "dpc": "03031526101",
            "name": "គឹម  រ៉ន"
        },
        {
            "barcode": "171141852",
            "dpc": "03031526201",
            "name": "សូត្រ  សុខសាន"
        },
        {
            "barcode": "171141853",
            "dpc": "03031529401",
            "name": "អ៊ឹម  វណ្ណី"
        },
        {
            "barcode": "171141854",
            "dpc": "03031529501",
            "name": "រ៉ម  សុវណ្ណ"
        },
        {
            "barcode": "171141855",
            "dpc": "03031531601",
            "name": "តាន់  សុខរ័ត្ន"
        },
        {
            "barcode": "171141856",
            "dpc": "03031540301",
            "name": "ទួន  ភឿន"
        },
        {
            "barcode": "171141857",
            "dpc": "03031540501",
            "name": "ជូរ  គង់"
        },
        {
            "barcode": "171141858",
            "dpc": "03031541001",
            "name": "ធៀម  ទ្រី"
        },
        {
            "barcode": "171141859",
            "dpc": "03031545001",
            "name": "នៅ  សែ"
        },
        {
            "barcode": "171141860",
            "dpc": "03031500101",
            "name": "ហេង គឹមនី"
        },
        {
            "barcode": "171141861",
            "dpc": "03031500201",
            "name": "សុខ ចាន់"
        },
        {
            "barcode": "171141862",
            "dpc": "03031500301",
            "name": "ស៊ឹម ម៉ារ៉ា"
        },
        {
            "barcode": "171141863",
            "dpc": "03031500401",
            "name": "សុង ហ៊ុងស៊ុយ"
        },
        {
            "barcode": "171141864",
            "dpc": "03031500501",
            "name": "ឡាយ កៅ"
        },
        {
            "barcode": "171141865",
            "dpc": "03031500601",
            "name": "ណាំ ហៃ"
        },
        {
            "barcode": "171141866",
            "dpc": "03031500701",
            "name": "លឹម ឈុនងៀង"
        },
        {
            "barcode": "171141867",
            "dpc": "03031500801",
            "name": "តែង តេង"
        },
        {
            "barcode": "171141868",
            "dpc": "03031500901",
            "name": "តាំង គុយម៉េង"
        },
        {
            "barcode": "171141869",
            "dpc": "03031501001",
            "name": "ម៉ម ណារេត"
        },
        {
            "barcode": "171141870",
            "dpc": "03031501501",
            "name": "ហួយ ចន្ធី"
        },
        {
            "barcode": "171141871",
            "dpc": "03031501401",
            "name": "តាំង កាំង ៣"
        },
        {
            "barcode": "171141872",
            "dpc": "03031501301",
            "name": "តាំង កាំង ២"
        },
        {
            "barcode": "171141873",
            "dpc": "03031501101",
            "name": "ប៉ាន់ យូសែ"
        },
        {
            "barcode": "171141874",
            "dpc": "03031501601",
            "name": "តាំង ម៉េងអាន"
        },
        {
            "barcode": "171141875",
            "dpc": "03031501701",
            "name": "ព្រាប សុខជា"
        },
        {
            "barcode": "171141876",
            "dpc": "03031501801",
            "name": "ឈុន  ចិន្តា"
        },
        {
            "barcode": "171141877",
            "dpc": "03031501901",
            "name": "ជូ  ហ្វឹង"
        },
        {
            "barcode": "171141878",
            "dpc": "03031502101",
            "name": "ហួត  អួង"
        },
        {
            "barcode": "171141879",
            "dpc": "03031502201",
            "name": "ណាំ  ទីវ"
        },
        {
            "barcode": "171141880",
            "dpc": "03031502301",
            "name": "សេង ចាន់ដាវុធ"
        },
        {
            "barcode": "171141881",
            "dpc": "03031502401",
            "name": "អ៊ិន  ឡា ១"
        },
        {
            "barcode": "171141882",
            "dpc": "03031502001",
            "name": "កុក  ឆេង ១"
        },
        {
            "barcode": "171141883",
            "dpc": "03031502501",
            "name": "យី  តុង"
        },
        {
            "barcode": "171141884",
            "dpc": "03031502601",
            "name": "ហេង ហុកលី"
        },
        {
            "barcode": "171141885",
            "dpc": "03031502701",
            "name": "អ៊ឹម  ឡុង"
        },
        {
            "barcode": "171141886",
            "dpc": "03031502801",
            "name": "ពេជ្រ  គឿន"
        },
        {
            "barcode": "171141887",
            "dpc": "03031502901",
            "name": "ទួន  សុខម៉េង"
        },
        {
            "barcode": "171141888",
            "dpc": "03031503101",
            "name": "កេង  សុខហេង"
        },
        {
            "barcode": "171141889",
            "dpc": "03031503201",
            "name": "ចែ  ទ្រី"
        },
        {
            "barcode": "171141890",
            "dpc": "03031503301",
            "name": "ខា  ជូ"
        },
        {
            "barcode": "171141891",
            "dpc": "03031503401",
            "name": "អៀង  ប៊ុនហៀង"
        },
        {
            "barcode": "171141892",
            "dpc": "03031503501",
            "name": "ប៉ា  ប៉េងលី"
        },
        {
            "barcode": "171141893",
            "dpc": "03031503601",
            "name": "អ៊ឹង  អេង"
        },
        {
            "barcode": "171141894",
            "dpc": "03031503701",
            "name": "សុខ  ណាល់"
        },
        {
            "barcode": "171141895",
            "dpc": "03031503801",
            "name": "ប៉េង  សុផល"
        },
        {
            "barcode": "171141896",
            "dpc": "03031504301",
            "name": "សុខ  ទ្រី"
        },
        {
            "barcode": "171141897",
            "dpc": "03031548001",
            "name": "ឆាយ គីមសាន"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
