let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=

    [
        {
            "barcode": "171143627",
            "dpc": "03031633201",
            "name": "គឹម សារ៉ាន់"
        },
        {
            "barcode": "171143628",
            "dpc": "03031633101",
            "name": "ម៉ៅ សុធា"
        },
        {
            "barcode": "171143629",
            "dpc": "03031632801",
            "name": "សុខ ជា"
        },
        {
            "barcode": "171143630",
            "dpc": "03031632701",
            "name": "ជួប លីម"
        },
        {
            "barcode": "171143631",
            "dpc": "03031632601",
            "name": "គឹម សោភា"
        },
        {
            "barcode": "171143632",
            "dpc": "03031631501",
            "name": "ហុង ឆេង"
        },
        {
            "barcode": "171143633",
            "dpc": "03031631401",
            "name": "ជា សុផល"
        },
        {
            "barcode": "171143634",
            "dpc": "03031631301",
            "name": "គឹម ម៉ៅ"
        },
        {
            "barcode": "171143635",
            "dpc": "03031631201",
            "name": "សុខ សារិន"
        },
        {
            "barcode": "171143636",
            "dpc": "03031631101",
            "name": "ស៊ឹម បូរាណ"
        },
        {
            "barcode": "171143637",
            "dpc": "03031631001",
            "name": "ហ៊ី សុគន្ធ"
        },
        {
            "barcode": "171143638",
            "dpc": "03031628501",
            "name": "ឆេត យន់"
        },
        {
            "barcode": "171143639",
            "dpc": "03031628301",
            "name": "សេង សាន"
        },
        {
            "barcode": "171143640",
            "dpc": "03031628201",
            "name": "កែវ សាវី"
        },
        {
            "barcode": "171143641",
            "dpc": "03031628101",
            "name": "នូ វេត"
        },
        {
            "barcode": "171143642",
            "dpc": "03031627901",
            "name": "ជា ភ័ណ្ឌ"
        },
        {
            "barcode": "171143643",
            "dpc": "03031627801",
            "name": "គាត ម៉ាប់"
        },
        {
            "barcode": "171143644",
            "dpc": "03031627601",
            "name": "អោក ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171143645",
            "dpc": "03031627501",
            "name": "កេង ហ៊ាង"
        },
        {
            "barcode": "171143646",
            "dpc": "03031627401",
            "name": "ប៉ាវ ម៉ៅ"
        },
        {
            "barcode": "171143647",
            "dpc": "03031627301",
            "name": "យិន កាំហូយ"
        },
        {
            "barcode": "171143648",
            "dpc": "03031627201",
            "name": "យិញ ហាក់មួយ"
        },
        {
            "barcode": "171143649",
            "dpc": "03031627101",
            "name": "សេង ដាយ"
        },
        {
            "barcode": "171143650",
            "dpc": "03031627001",
            "name": "ជាង ឃីម"
        },
        {
            "barcode": "171143651",
            "dpc": "03031626901",
            "name": "នៅ ស៊្រុន"
        },
        {
            "barcode": "171143652",
            "dpc": "03031626801",
            "name": "ជា ប្រេម"
        },
        {
            "barcode": "171143653",
            "dpc": "03031626701",
            "name": "កេ ហឿក"
        },
        {
            "barcode": "171143654",
            "dpc": "03031626601",
            "name": "ទី មេសា"
        },
        {
            "barcode": "171143655",
            "dpc": "03031626501",
            "name": "ឈ ទី"
        },
        {
            "barcode": "171143656",
            "dpc": "03031634201",
            "name": "ពៅ សុខា"
        },
        {
            "barcode": "171143657",
            "dpc": "03031634101",
            "name": "ជា ភី"
        },
        {
            "barcode": "171143658",
            "dpc": "03031634001",
            "name": "លាង គ្រី"
        },
        {
            "barcode": "171143659",
            "dpc": "03031633901",
            "name": "អ៊ូច ពាន"
        },
        {
            "barcode": "171143660",
            "dpc": "03031633801",
            "name": "លឹម ខេងសែ"
        },
        {
            "barcode": "171143661",
            "dpc": "03031633701",
            "name": "ជា ប្រេម"
        },
        {
            "barcode": "171143662",
            "dpc": "03031633601",
            "name": "ឈុន ឡេង"
        },
        {
            "barcode": "171143663",
            "dpc": "03031633501",
            "name": "លីន វណ្ណា"
        },
        {
            "barcode": "171143664",
            "dpc": "03031632501",
            "name": "ហេម ហាវ"
        },
        {
            "barcode": "171143665",
            "dpc": "03031632401",
            "name": "សំ សារ៉ន"
        },
        {
            "barcode": "171143666",
            "dpc": "03031632301",
            "name": "សេង ម៉ាប់"
        },
        {
            "barcode": "171143667",
            "dpc": "03031632201",
            "name": "អៀង ស៊ុំ"
        },
        {
            "barcode": "171143668",
            "dpc": "03031632101",
            "name": "គង់ ម៉ា"
        },
        {
            "barcode": "171143669",
            "dpc": "03031632001",
            "name": "ហង្ស វណ្ណដា"
        },
        {
            "barcode": "171143670",
            "dpc": "03031631901",
            "name": "សន ធាង"
        },
        {
            "barcode": "171143671",
            "dpc": "03031631801",
            "name": "វី សាវន"
        },
        {
            "barcode": "171143672",
            "dpc": "03031631701",
            "name": "ហ៊ែល ឆៃលាង"
        },
        {
            "barcode": "171143673",
            "dpc": "03031631601",
            "name": "រិទ្ធ គ្រឹស្នា"
        },
        {
            "barcode": "171143674",
            "dpc": "03031630801",
            "name": "អ៊ូ ជា"
        },
        {
            "barcode": "171143675",
            "dpc": "03031630701",
            "name": "ហេង រិទ្ធី"
        },
        {
            "barcode": "171143676",
            "dpc": "03031630601",
            "name": "ឆាយ ប៊ុនឈាន"
        },
        {
            "barcode": "171143677",
            "dpc": "03031630501",
            "name": "ហេង កៀន"
        },
        {
            "barcode": "171143678",
            "dpc": "03031630401",
            "name": "ញ៉ែម សាមគ្គី"
        },
        {
            "barcode": "171143679",
            "dpc": "03031630301",
            "name": "ញ៉ែម សឿន"
        },
        {
            "barcode": "171143680",
            "dpc": "03031630201",
            "name": "ឃឿន សុខាំ"
        },
        {
            "barcode": "171143681",
            "dpc": "03031630101",
            "name": "សុខ រុនពិសិទ្ធ"
        },
        {
            "barcode": "171143682",
            "dpc": "03031630001",
            "name": "ស  គា"
        },
        {
            "barcode": "171143683",
            "dpc": "03031629901",
            "name": "ហង្ស សាវ៉ាត់"
        },
        {
            "barcode": "171143684",
            "dpc": "03031629801",
            "name": "ធឿន ហៃ"
        },
        {
            "barcode": "171143685",
            "dpc": "03031629601",
            "name": "ឡុង ហួត"
        },
        {
            "barcode": "171143686",
            "dpc": "03031629401",
            "name": "យឹម កួយ"
        },
        {
            "barcode": "171143687",
            "dpc": "03031629101",
            "name": "ប៊ូ ដែ"
        },
        {
            "barcode": "171143688",
            "dpc": "03031629001",
            "name": "សេង ដាយ"
        },
        {
            "barcode": "171143689",
            "dpc": "03031628801",
            "name": "ភី ផាន"
        },
        {
            "barcode": "171143690",
            "dpc": "03031628701",
            "name": "សេង ហុង"
        },
        {
            "barcode": "171143691",
            "dpc": "03031628601",
            "name": "ស៊ុន ស៊"
        },
        {
            "barcode": "171143692",
            "dpc": "03031626401",
            "name": "ជិន សូឡី"
        },
        {
            "barcode": "171143693",
            "dpc": "03031626301",
            "name": "អ៊ឹង កៀត"
        },
        {
            "barcode": "171143694",
            "dpc": "03031626201",
            "name": "ងួន សុខហេង"
        },
        {
            "barcode": "171143695",
            "dpc": "03031626101",
            "name": "ប៊ី ទី"
        },
        {
            "barcode": "171143696",
            "dpc": "03031626001",
            "name": "កៅ  គឹមហៃ"
        },
        {
            "barcode": "171143697",
            "dpc": "03031625901",
            "name": "ប៊ី សួរ"
        },
        {
            "barcode": "171143698",
            "dpc": "03031625801",
            "name": "ហេង ផេង"
        },
        {
            "barcode": "171143699",
            "dpc": "03031625701",
            "name": "សេង ទ្រូ"
        },
        {
            "barcode": "171143700",
            "dpc": "03031625601",
            "name": "សេង អៀង"
        },
        {
            "barcode": "171143701",
            "dpc": "03031625501",
            "name": "គង់ ទី"
        },
        {
            "barcode": "171143702",
            "dpc": "03031625401",
            "name": "សែ ហួត"
        },
        {
            "barcode": "171143703",
            "dpc": "03031625301",
            "name": "នូវ  រ៉ាដេត"
        },
        {
            "barcode": "171143704",
            "dpc": "03031625201",
            "name": "ឌុល សម្បត្តិ"
        },
        {
            "barcode": "171143705",
            "dpc": "03031625101",
            "name": "ទួន សុខជា"
        },
        {
            "barcode": "171143706",
            "dpc": "03031625001",
            "name": "លាង ហាវ"
        },
        {
            "barcode": "171143707",
            "dpc": "03031624801",
            "name": "ហ៊ ចាន់ធី"
        },
        {
            "barcode": "171143708",
            "dpc": "03031624701",
            "name": "ឃុត ឃន"
        },
        {
            "barcode": "171143709",
            "dpc": "03031624601",
            "name": "ពេជ្រ សារី"
        },
        {
            "barcode": "171143710",
            "dpc": "03031624501",
            "name": "ជា ខេង"
        },
        {
            "barcode": "171143711",
            "dpc": "03031624401",
            "name": "អ៊ា សាង"
        },
        {
            "barcode": "171143712",
            "dpc": "03031624301",
            "name": "គួច សេងទី"
        },
        {
            "barcode": "171143713",
            "dpc": "03031624201",
            "name": "ពឹង គឹមស៊ា"
        },
        {
            "barcode": "171143714",
            "dpc": "03031624101",
            "name": "ពឹង ឈួន"
        },
        {
            "barcode": "171143715",
            "dpc": "03031624001",
            "name": "ឈឿត សាន់"
        },
        {
            "barcode": "171143716",
            "dpc": "03031623901",
            "name": "ម៉ឺន វិបុល"
        },
        {
            "barcode": "171143717",
            "dpc": "03031623801",
            "name": "ស៊ា លឹមទ្រី"
        },
        {
            "barcode": "171143718",
            "dpc": "03031623701",
            "name": "ឆៃ អ៊នជី"
        },
        {
            "barcode": "171143719",
            "dpc": "03031623601",
            "name": "យូ សុខផេង"
        },
        {
            "barcode": "171143720",
            "dpc": "03031623501",
            "name": "សេង ហ៊ីម"
        },
        {
            "barcode": "171143721",
            "dpc": "03031623401",
            "name": "ជ័យ សែន"
        },
        {
            "barcode": "171143722",
            "dpc": "03031623301",
            "name": "អ៊ឹង ថន"
        },
        {
            "barcode": "171143723",
            "dpc": "03031623201",
            "name": "ទាវ ភឿន"
        },
        {
            "barcode": "171143724",
            "dpc": "03031623101",
            "name": "បាន ងួន"
        },
        {
            "barcode": "171143725",
            "dpc": "03031623001",
            "name": "សំ ប៊ន"
        },
        {
            "barcode": "171143726",
            "dpc": "03031622901",
            "name": "ភោគ សុខន"
        },
        {
            "barcode": "171143727",
            "dpc": "03031622701",
            "name": "ពត  សុគន្ធី"
        },
        {
            "barcode": "171143728",
            "dpc": "03031622601",
            "name": "លុច យឿន"
        },
        {
            "barcode": "171143729",
            "dpc": "03031622501",
            "name": "ទុំ ថន"
        },
        {
            "barcode": "171143730",
            "dpc": "03031622401",
            "name": "ពៅ ង៉ុច"
        },
        {
            "barcode": "171143731",
            "dpc": "03031622301",
            "name": "កូវ អូន"
        },
        {
            "barcode": "171143732",
            "dpc": "03031622201",
            "name": "ហួន ទី"
        },
        {
            "barcode": "171143733",
            "dpc": "03031622101",
            "name": "យី ហួរ"
        },
        {
            "barcode": "171143734",
            "dpc": "03031622001",
            "name": "សុខ សុថាវី"
        },
        {
            "barcode": "171143735",
            "dpc": "03031621901",
            "name": "អ៊ុំ សុខា"
        },
        {
            "barcode": "171143736",
            "dpc": "03031621801",
            "name": "ភោគ ប៊ុននី"
        },
        {
            "barcode": "171143737",
            "dpc": "03031621701",
            "name": "គិញ ធឿន"
        },
        {
            "barcode": "171143738",
            "dpc": "03031621601",
            "name": "ចែ  សួន"
        },
        {
            "barcode": "171143739",
            "dpc": "03031621501",
            "name": "សំ រិទ្ធី"
        },
        {
            "barcode": "171143740",
            "dpc": "03031621401",
            "name": "អ៊ង  បូ"
        },
        {
            "barcode": "171143741",
            "dpc": "03031621301",
            "name": "អ៊ុម សារឿន"
        },
        {
            "barcode": "171143742",
            "dpc": "03031621201",
            "name": "ហូ ទិត្យ"
        },
        {
            "barcode": "171143743",
            "dpc": "03031621101",
            "name": "ឌី ឈុន"
        },
        {
            "barcode": "171143744",
            "dpc": "03031621001",
            "name": "អ៊ឹង សេង"
        },
        {
            "barcode": "171143745",
            "dpc": "03031620901",
            "name": "ថូ ថៅ"
        },
        {
            "barcode": "171143746",
            "dpc": "03031620801",
            "name": "ហម ហ៊ន"
        },
        {
            "barcode": "171143747",
            "dpc": "03031620701",
            "name": "សុខ ជូ"
        },
        {
            "barcode": "171143748",
            "dpc": "03031620601",
            "name": "លី នីម"
        },
        {
            "barcode": "171143749",
            "dpc": "03031620501",
            "name": "សេង ម៉ៅ"
        },
        {
            "barcode": "171143750",
            "dpc": "03031620401",
            "name": "អ៊ឹង ម៉េងហ៊ាង"
        },
        {
            "barcode": "171143751",
            "dpc": "03031620301",
            "name": "តាំង ប៉ាក់គុណ"
        },
        {
            "barcode": "171143752",
            "dpc": "03031620201",
            "name": "សុខ វិត"
        },
        {
            "barcode": "171143753",
            "dpc": "03031620101",
            "name": "ជា ឆាយបូ"
        },
        {
            "barcode": "171143754",
            "dpc": "03031619901",
            "name": "ស្វាយ សេង"
        },
        {
            "barcode": "171143755",
            "dpc": "03031619801",
            "name": "ជា កុច"
        },
        {
            "barcode": "171143756",
            "dpc": "03031619701",
            "name": "ហូរ ម៉ាប់"
        },
        {
            "barcode": "171143757",
            "dpc": "03031619601",
            "name": "រឿន សារី"
        },
        {
            "barcode": "171143758",
            "dpc": "03031619501",
            "name": "នូ ម៉េង"
        },
        {
            "barcode": "171143759",
            "dpc": "03031619401",
            "name": "ឈិត អែម"
        },
        {
            "barcode": "171143760",
            "dpc": "03031619301",
            "name": "ឯម ប៊ុនណា"
        },
        {
            "barcode": "171143761",
            "dpc": "03031619201",
            "name": "ឈុំ នៃ"
        },
        {
            "barcode": "171143762",
            "dpc": "03031619101",
            "name": "យឹក គង់"
        },
        {
            "barcode": "171143763",
            "dpc": "03031619001",
            "name": "សៀង ហៃ"
        },
        {
            "barcode": "171143764",
            "dpc": "03031618901",
            "name": "ចៅ ថូវ"
        },
        {
            "barcode": "171143765",
            "dpc": "03031618801",
            "name": "ថៃ ហុង"
        },
        {
            "barcode": "171143766",
            "dpc": "03031618701",
            "name": "អ៊ាប់ ជឺម៉ាន់"
        },
        {
            "barcode": "171143767",
            "dpc": "03031618601",
            "name": "សុខ ប៊ុនហុង"
        },
        {
            "barcode": "171143768",
            "dpc": "03031618501",
            "name": "ហ៊ឹម ឡុង"
        },
        {
            "barcode": "171143769",
            "dpc": "03031618301",
            "name": "នៅ​ ចាន់"
        },
        {
            "barcode": "171143770",
            "dpc": "03031618201",
            "name": "អ៊ុង ខន"
        },
        {
            "barcode": "171143771",
            "dpc": "03031618101",
            "name": "យ៉ាន់ សារ៉ាន់"
        },
        {
            "barcode": "171143772",
            "dpc": "03031618001",
            "name": "ជិន ពៅ"
        },
        {
            "barcode": "171143773",
            "dpc": "03031617901",
            "name": "ផ្លុង សុភាព"
        },
        {
            "barcode": "171143774",
            "dpc": "03031617701",
            "name": "អ៊ូ ដារា"
        },
        {
            "barcode": "171143775",
            "dpc": "03031617601",
            "name": "ទី គឹមសួរ"
        },
        {
            "barcode": "171143776",
            "dpc": "03031617501",
            "name": "កុង ជី"
        },
        {
            "barcode": "171143777",
            "dpc": "03031617401",
            "name": "សាលាឃុំ អូរចារ"
        },
        {
            "barcode": "171143778",
            "dpc": "03031617301",
            "name": "សេង យក់លី"
        },
        {
            "barcode": "171143779",
            "dpc": "03031607201",
            "name": "កែវ ថន"
        },
        {
            "barcode": "171143780",
            "dpc": "03031607001",
            "name": "វង់ ប៊ុនថា"
        },
        {
            "barcode": "171143781",
            "dpc": "03031606701",
            "name": "អ៊ុច តុន"
        },
        {
            "barcode": "171143782",
            "dpc": "03031606601",
            "name": "ចុន សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171143783",
            "dpc": "03031606501",
            "name": "ខឹម កុសល"
        },
        {
            "barcode": "171143784",
            "dpc": "03031606401",
            "name": "អេង រួន"
        },
        {
            "barcode": "171143785",
            "dpc": "03031606301",
            "name": "ឃឹម វណ្ណៈ"
        },
        {
            "barcode": "171143786",
            "dpc": "03031606201",
            "name": "មិត្ត ធឿង"
        },
        {
            "barcode": "171143787",
            "dpc": "03031606101",
            "name": "ទូច ជន"
        },
        {
            "barcode": "171143788",
            "dpc": "03031606001",
            "name": "ឌិត ញិប"
        },
        {
            "barcode": "171143789",
            "dpc": "03031605901",
            "name": "ធួក ឡំ"
        },
        {
            "barcode": "171143790",
            "dpc": "03031605801",
            "name": "ឈឹម សែត"
        },
        {
            "barcode": "171143791",
            "dpc": "03031605701",
            "name": "ភាជ ធឿម"
        },
        {
            "barcode": "171143792",
            "dpc": "03031605601",
            "name": "ម៉ៅ សារុន"
        },
        {
            "barcode": "171143793",
            "dpc": "03031605501",
            "name": "ព្រាប និមល"
        },
        {
            "barcode": "171143794",
            "dpc": "03031605401",
            "name": "គឹម ណារ៉ុង"
        },
        {
            "barcode": "171143795",
            "dpc": "03031605301",
            "name": "ចំរើន វង្ស"
        },
        {
            "barcode": "171143796",
            "dpc": "03031605201",
            "name": "គឹម សែន"
        },
        {
            "barcode": "171143797",
            "dpc": "03031605101",
            "name": "ស៊ុន ធី"
        },
        {
            "barcode": "171143798",
            "dpc": "03031605001",
            "name": "សុំ សុខា"
        },
        {
            "barcode": "171143799",
            "dpc": "03031604901",
            "name": "រឿន រឿត"
        },
        {
            "barcode": "171143800",
            "dpc": "03031604701",
            "name": "សោម កឹម"
        },
        {
            "barcode": "171143801",
            "dpc": "03031604601",
            "name": "គុណ ប្រិម"
        },
        {
            "barcode": "171143802",
            "dpc": "03031604501",
            "name": "កង សឿន"
        },
        {
            "barcode": "171143803",
            "dpc": "03031604401",
            "name": "ប៉ោ ឡុង"
        },
        {
            "barcode": "171143804",
            "dpc": "03031604201",
            "name": "ធឿន សាវឿន"
        },
        {
            "barcode": "171143805",
            "dpc": "03031604101",
            "name": "មុត សុភី"
        },
        {
            "barcode": "171143806",
            "dpc": "03031604001",
            "name": "វែង ស្រេង"
        },
        {
            "barcode": "171143807",
            "dpc": "03031603901",
            "name": "ហួរ សួរ"
        },
        {
            "barcode": "171143808",
            "dpc": "03031603801",
            "name": "ហយ ហ៊ុន"
        },
        {
            "barcode": "171143809",
            "dpc": "03031603701",
            "name": "មាស​សាវេន"
        },
        {
            "barcode": "171143810",
            "dpc": "03031603601",
            "name": "សឿង វ៉ាន់នី"
        },
        {
            "barcode": "171143811",
            "dpc": "03031601701",
            "name": "រស់ វាសនា"
        },
        {
            "barcode": "171143812",
            "dpc": "03031601601",
            "name": "វឿន ស៊ីវឿត"
        },
        {
            "barcode": "171143813",
            "dpc": "03031601501",
            "name": "ជា ពន្លាក់"
        },
        {
            "barcode": "171143814",
            "dpc": "03031601401",
            "name": "ស៊ុន ប៊ុនឡេង"
        },
        {
            "barcode": "171143815",
            "dpc": "03031601301",
            "name": "ជឹម សារ៉ាត់"
        },
        {
            "barcode": "171143816",
            "dpc": "03031601201",
            "name": "សោម ណារ័ត្ន"
        },
        {
            "barcode": "171143817",
            "dpc": "03031601001",
            "name": "ថៃ សុធារ៉ា"
        },
        {
            "barcode": "171143818",
            "dpc": "03031600901",
            "name": "ចាន់ ថុល"
        },
        {
            "barcode": "171143819",
            "dpc": "03031600801",
            "name": "ឡាយ ប៊ុននេត"
        },
        {
            "barcode": "171143820",
            "dpc": "03031600701",
            "name": "ជួប អេង"
        },
        {
            "barcode": "171143821",
            "dpc": "03031600601",
            "name": "ចាន់ ណារិន"
        },
        {
            "barcode": "171143822",
            "dpc": "03031600501",
            "name": "ហាវ វ៉ាន់"
        },
        {
            "barcode": "171143823",
            "dpc": "03031600401",
            "name": "ស្តើង យ៉េន"
        },
        {
            "barcode": "171143824",
            "dpc": "03031600301",
            "name": "ចេត វិត ១"
        },
        {
            "barcode": "171143825",
            "dpc": "03031600201",
            "name": "សូ  ចាន់ហេង"
        },
        {
            "barcode": "171143826",
            "dpc": "03031600101",
            "name": "ផន លន់"
        },
        {
            "barcode": "171143827",
            "dpc": "03031607301",
            "name": "តា ទិញជ្រូក"
        },
        {
            "barcode": "171143828",
            "dpc": "03031603501",
            "name": "អ៊ឹង ចាន់សុន"
        },
        {
            "barcode": "171143829",
            "dpc": "03031603401",
            "name": "សេង សុម៉ាលី"
        },
        {
            "barcode": "171143830",
            "dpc": "03031603301",
            "name": "ចេត វិត"
        },
        {
            "barcode": "171143831",
            "dpc": "03031603201",
            "name": "ជឹម ផេង"
        },
        {
            "barcode": "171143832",
            "dpc": "03031603101",
            "name": "អន យ៉ុត"
        },
        {
            "barcode": "171143833",
            "dpc": "03031603001",
            "name": "ឈឹម សុគន្ធា"
        },
        {
            "barcode": "171143834",
            "dpc": "03031602901",
            "name": "លីស សុផាន់ណារ៉ា"
        },
        {
            "barcode": "171143835",
            "dpc": "03031602801",
            "name": "ជូន កក្កដា"
        },
        {
            "barcode": "171143836",
            "dpc": "03031602701",
            "name": "មឿង រិន"
        },
        {
            "barcode": "171143837",
            "dpc": "03031602601",
            "name": "យាំ យ៉ាន់"
        },
        {
            "barcode": "171143838",
            "dpc": "03031602401",
            "name": "អ៊ិន ឡា"
        },
        {
            "barcode": "171143839",
            "dpc": "03031602301",
            "name": "សារិ វិសុទ្ធ"
        },
        {
            "barcode": "171143840",
            "dpc": "03031602201",
            "name": "ចាន់ ពៅ"
        },
        {
            "barcode": "171143841",
            "dpc": "03031602101",
            "name": "ហ៊ុយ សុភ័ក្រ្ត"
        },
        {
            "barcode": "171143842",
            "dpc": "03031602001",
            "name": "ចាន់ ជា"
        },
        {
            "barcode": "171143843",
            "dpc": "03031601901",
            "name": "តាំង ធូយិន"
        },
        {
            "barcode": "171143844",
            "dpc": "03031601801",
            "name": "អៃ ត្រៃលក្ខណ៍"
        },
        {
            "barcode": "171143845",
            "dpc": "03031601101",
            "name": "អេង ស្រីអៀង"
        },
        {
            "barcode": "171143846",
            "dpc": "03031615901",
            "name": "សុខ ហ៊ាង"
        },
        {
            "barcode": "171143847",
            "dpc": "03031615801",
            "name": "យាយ អង"
        },
        {
            "barcode": "171143848",
            "dpc": "03031615601",
            "name": "ឆេង ទី"
        },
        {
            "barcode": "171143849",
            "dpc": "03031615501",
            "name": "គ្រួច អ៊ិត"
        },
        {
            "barcode": "171143850",
            "dpc": "03031615401",
            "name": "ហង្ស ចន្តី"
        },
        {
            "barcode": "171143851",
            "dpc": "03031615301",
            "name": "ចែ ណារី"
        },
        {
            "barcode": "171143852",
            "dpc": "03031615201",
            "name": "ឌុល សំផាន"
        },
        {
            "barcode": "171143853",
            "dpc": "03031615101",
            "name": "ថង គឹមកែវ"
        },
        {
            "barcode": "171143854",
            "dpc": "03031614601",
            "name": "ហង់ វណ្ណា"
        },
        {
            "barcode": "171143855",
            "dpc": "03031614901",
            "name": "ឈិន គឹមស៊ាន"
        },
        {
            "barcode": "171143856",
            "dpc": "03031614801",
            "name": "ហែម ថ្លៃថ្លា"
        },
        {
            "barcode": "171143857",
            "dpc": "03031614701",
            "name": "ឈួន សាវន្ត"
        },
        {
            "barcode": "171143858",
            "dpc": "03031614501",
            "name": "ហាក់ វ៉ាន់នី"
        },
        {
            "barcode": "171143859",
            "dpc": "03031614401",
            "name": "ម៉ុក ស៊ីន"
        },
        {
            "barcode": "171143860",
            "dpc": "03031613001",
            "name": "តាន់ វុទ្ធី"
        },
        {
            "barcode": "171143861",
            "dpc": "03031613101",
            "name": "ជា សាមាន"
        },
        {
            "barcode": "171143862",
            "dpc": "03031613201",
            "name": "តាន់ លី"
        },
        {
            "barcode": "171143863",
            "dpc": "03031613301",
            "name": "ទិន ប៊ុនធិន"
        },
        {
            "barcode": "171143864",
            "dpc": "03031613401",
            "name": "ស នឿន"
        },
        {
            "barcode": "171143865",
            "dpc": "03031613501",
            "name": "កប ប្រសើរ"
        },
        {
            "barcode": "171143866",
            "dpc": "03031614101",
            "name": "ប៉ាវ ស៊ីវឡេង"
        },
        {
            "barcode": "171143867",
            "dpc": "03031616101",
            "name": "ផុន សារ៉ាន់"
        },
        {
            "barcode": "171143868",
            "dpc": "03031616901",
            "name": "ស៊ន ស៊ាន"
        },
        {
            "barcode": "171143869",
            "dpc": "03031617101",
            "name": "មាន សុវណ្ណា"
        },
        {
            "barcode": "171143870",
            "dpc": "03031617001",
            "name": "យូ ចាន់ថន"
        },
        {
            "barcode": "171143871",
            "dpc": "03031616801",
            "name": "ថន ចាន់ថា"
        },
        {
            "barcode": "171143872",
            "dpc": "03031616001",
            "name": "សុខ សំអុល"
        },
        {
            "barcode": "171143873",
            "dpc": "03031616301",
            "name": "ប៉ែន សុខហ៊ាង"
        },
        {
            "barcode": "171143874",
            "dpc": "03031616401",
            "name": "ម៉ី ហឿន"
        },
        {
            "barcode": "171143875",
            "dpc": "03031616501",
            "name": "គង់ រៀន"
        },
        {
            "barcode": "171143876",
            "dpc": "03031616601",
            "name": "ញាណ ប៉ុក"
        },
        {
            "barcode": "171143877",
            "dpc": "03031616701",
            "name": "សុខ ប៊ុនសុង"
        },
        {
            "barcode": "171143878",
            "dpc": "03031615701",
            "name": "តេង យ៉ាន"
        },
        {
            "barcode": "171143879",
            "dpc": "03031612701",
            "name": "ឡុង ឌាល"
        },
        {
            "barcode": "171143880",
            "dpc": "03031612601",
            "name": "ចែត រស្មី"
        },
        {
            "barcode": "171143881",
            "dpc": "03031612501",
            "name": "ពេជ្រ ដារ៉ារិទ្ធ"
        },
        {
            "barcode": "171143882",
            "dpc": "03031612401",
            "name": "អោក គុណ"
        },
        {
            "barcode": "171143883",
            "dpc": "03031612301",
            "name": "ស៊ិន ស៊ីវន"
        },
        {
            "barcode": "171143884",
            "dpc": "03031612101",
            "name": "ហម សាម៉េត"
        },
        {
            "barcode": "171143885",
            "dpc": "03031612201",
            "name": "សាំង អ៊ា"
        },
        {
            "barcode": "171143886",
            "dpc": "03031608601",
            "name": "សាលារៀនអូរតាគាំ១"
        },
        {
            "barcode": "171143887",
            "dpc": "03031608501",
            "name": "តូម ផល្លា"
        },
        {
            "barcode": "171143888",
            "dpc": "03031608401",
            "name": "ព្រាប ពុធសានឿន"
        },
        {
            "barcode": "171143889",
            "dpc": "03031608201",
            "name": "សេក រី"
        },
        {
            "barcode": "171143890",
            "dpc": "03031608301",
            "name": "អ៊ុច សុនាង"
        },
        {
            "barcode": "171143891",
            "dpc": "03031608001",
            "name": "យុត ស្វិនី"
        },
        {
            "barcode": "171143892",
            "dpc": "03031607801",
            "name": "អ៊ុច សុន"
        },
        {
            "barcode": "171143893",
            "dpc": "03031607901",
            "name": "បាន ស្រីតូច"
        },
        {
            "barcode": "171143894",
            "dpc": "03031607701",
            "name": "សេង ធី"
        },
        {
            "barcode": "171143895",
            "dpc": "03031607601",
            "name": "ឆាយ ចាន់ណារ័ត្ន"
        },
        {
            "barcode": "171143896",
            "dpc": "03031607501",
            "name": "យាយ នូង"
        },
        {
            "barcode": "171143897",
            "dpc": "03031607401",
            "name": "ប៉ែន ចាន់ថន"
        },
        {
            "barcode": "171143898",
            "dpc": "03031611401",
            "name": "ហាវ កញ្ញា"
        },
        {
            "barcode": "171143899",
            "dpc": "03031611501",
            "name": "អឿន សុភាព"
        },
        {
            "barcode": "171143900",
            "dpc": "03031611601",
            "name": "វណ្ណ សុជាតិ"
        },
        {
            "barcode": "171143901",
            "dpc": "03031611301",
            "name": "ខ្លូត សាឯម"
        },
        {
            "barcode": "171143902",
            "dpc": "03031611701",
            "name": "ហួន ជួត"
        },
        {
            "barcode": "171143903",
            "dpc": "03031612001",
            "name": "ប្រាក់ ស៊ីថា"
        },
        {
            "barcode": "171143904",
            "dpc": "03031611901",
            "name": "ដាំ  ឈិន"
        },
        {
            "barcode": "171143905",
            "dpc": "03031611801",
            "name": "រឿន រ៉ាក់"
        },
        {
            "barcode": "171143906",
            "dpc": "03031612901",
            "name": "រិន វាសនា"
        },
        {
            "barcode": "171143907",
            "dpc": "03031613901",
            "name": "សៅ សារេត"
        },
        {
            "barcode": "171143908",
            "dpc": "03031614001",
            "name": "ហេង សុភាព"
        },
        {
            "barcode": "171143909",
            "dpc": "03031613801",
            "name": "មាស ឆុំ"
        },
        {
            "barcode": "171143910",
            "dpc": "03031613701",
            "name": "លន់ ប៊ុនលុយ"
        },
        {
            "barcode": "171143911",
            "dpc": "03031613601",
            "name": "ថុល វណ្ណារ៉ូ"
        },
        {
            "barcode": "171143912",
            "dpc": "03031614201",
            "name": "ឡុង  ឈួយ"
        },
        {
            "barcode": "171143913",
            "dpc": "03031614301",
            "name": "ឡុង ឈឿន"
        },
        {
            "barcode": "171143914",
            "dpc": "03031611201",
            "name": "មៀច សុធា"
        },
        {
            "barcode": "171143915",
            "dpc": "03031611101",
            "name": "ភឿក សារ៉ាត់"
        },
        {
            "barcode": "171143916",
            "dpc": "03031611001",
            "name": "ឈឹម ឆិល"
        },
        {
            "barcode": "171143917",
            "dpc": "03031610901",
            "name": "ម៉ែន សុខន"
        },
        {
            "barcode": "171143918",
            "dpc": "03031610401",
            "name": "សូ សុទ្ធ"
        },
        {
            "barcode": "171143919",
            "dpc": "03031610301",
            "name": "ណែម សុវណ្ណ"
        },
        {
            "barcode": "171143920",
            "dpc": "03031610201",
            "name": "ស្រី ផល្លី"
        },
        {
            "barcode": "171143921",
            "dpc": "03031610101",
            "name": "រស់ ផល្លា"
        },
        {
            "barcode": "171143922",
            "dpc": "03031609701",
            "name": "សី សាវឿន"
        },
        {
            "barcode": "171143923",
            "dpc": "03031609801",
            "name": "ឡុញ សំណាង"
        },
        {
            "barcode": "171143924",
            "dpc": "03031609901",
            "name": "សួស នឹង"
        },
        {
            "barcode": "171143925",
            "dpc": "03031610001",
            "name": "ពៅ វ៉ាន់ពុន"
        },
        {
            "barcode": "171143926",
            "dpc": "03031609501",
            "name": "ចូត ជឿម"
        },
        {
            "barcode": "171143927",
            "dpc": "03031609401",
            "name": "ម៉េង ចាន់ថន"
        },
        {
            "barcode": "171143928",
            "dpc": "03031609101",
            "name": "អេប សំអាត"
        },
        {
            "barcode": "171143929",
            "dpc": "03031609001",
            "name": "រស់ សុភ័ណ្ឌ"
        },
        {
            "barcode": "171143930",
            "dpc": "03031608901",
            "name": "ហង្ស ផល្លា"
        },
        {
            "barcode": "171143931",
            "dpc": "03031608801",
            "name": "សេង សួរ"
        },
        {
            "barcode": "171143932",
            "dpc": "03031608701",
            "name": "តេង វុត្ថា"
        },
        {
            "barcode": "171143933",
            "dpc": "03031609201",
            "name": "គឹម យ៉ុង"
        },
        {
            "barcode": "171143934",
            "dpc": "03031610701",
            "name": "ឈឹម កូយ"
        },
        {
            "barcode": "171143935",
            "dpc": "03031610601",
            "name": "ឈឹម ប្រេស"
        },
        {
            "barcode": "171143936",
            "dpc": "03031606901",
            "name": "ជា សុផល"
        },
        {
            "barcode": "171143937",
            "dpc": "03031609301",
            "name": "គង់  សាវឿន"
        },
        {
            "barcode": "171143938",
            "dpc": "03031609601",
            "name": "ហ៊ឹង  សំបូរ"
        },
        {
            "barcode": "171143939",
            "dpc": "03031610801",
            "name": "សាត  យ៉ុម"
        },
        {
            "barcode": "171143940",
            "dpc": "03031612801",
            "name": "ជ័យ  ប៊ុនថន"
        },
        {
            "barcode": "171143941",
            "dpc": "03031615001",
            "name": "គី  ម៉េងទុយ"
        },
        {
            "barcode": "171143942",
            "dpc": "03031617201",
            "name": "សុខ  អេង"
        },
        {
            "barcode": "171143943",
            "dpc": "03031622801",
            "name": "អ៊ាន  សុផល"
        },
        {
            "barcode": "171143944",
            "dpc": "03031628901",
            "name": "ហាក់  ប៊ុនជា"
        },
        {
            "barcode": "171143945",
            "dpc": "03031630901",
            "name": "ប៉ោ  ថន"
        },
        {
            "barcode": "171143946",
            "dpc": "03031633001",
            "name": "គឹម  សាន"
        },
        {
            "barcode": "171143947",
            "dpc": "03031635401",
            "name": "ហៃ  ហ្គិច"
        },
        {
            "barcode": "171143948",
            "dpc": "03031635601",
            "name": "សេង  គង់"
        },
        {
            "barcode": "171143949",
            "dpc": "03031635701",
            "name": "សឿន  ថាំង"
        },
        {
            "barcode": "171143950",
            "dpc": "03031635801",
            "name": "ញិល  វណ្ណះ"
        },
        {
            "barcode": "171143951",
            "dpc": "03031635901",
            "name": "ជា  សេង"
        },
        {
            "barcode": "171143952",
            "dpc": "03031634701",
            "name": "កែវ  សានិត"
        },
        {
            "barcode": "171143953",
            "dpc": "03031634901",
            "name": "យាំ  ឃួង"
        },
        {
            "barcode": "171143954",
            "dpc": "03031634801",
            "name": "ញ៉ែម  សុវណ្ណ"
        },
        {
            "barcode": "171143955",
            "dpc": "03031635001",
            "name": "ជូរ  ចាន់រិទ្ធ"
        },
        {
            "barcode": "171143956",
            "dpc": "03031635101",
            "name": "ហាក់  ឡាយ"
        },
        {
            "barcode": "171143957",
            "dpc": "03031635301",
            "name": "អាង  សៀក ២"
        },
        {
            "barcode": "171143958",
            "dpc": "03031646101",
            "name": "អ៊ុំ ខុន"
        },
        {
            "barcode": "171143959",
            "dpc": "03031646201",
            "name": "ប៉ោ លី"
        },
        {
            "barcode": "171143960",
            "dpc": "03031646301",
            "name": "ស៊ុយ ចិន្តា"
        },
        {
            "barcode": "171143961",
            "dpc": "03031646001",
            "name": "ប៊ុន នៅ"
        },
        {
            "barcode": "171143962",
            "dpc": "03031645701",
            "name": "ពៅ ដារា"
        },
        {
            "barcode": "171143963",
            "dpc": "03031646501",
            "name": "ខេង ទី"
        },
        {
            "barcode": "171143964",
            "dpc": "03031646601",
            "name": "មូល ផល្លា"
        },
        {
            "barcode": "171143965",
            "dpc": "03031646701",
            "name": "ជា បុប្ផា"
        },
        {
            "barcode": "171143966",
            "dpc": "03031646801",
            "name": "ម៉ែន ណម"
        },
        {
            "barcode": "171143967",
            "dpc": "03031647801",
            "name": "តូ វណ្ណា"
        },
        {
            "barcode": "171143968",
            "dpc": "03031647401",
            "name": "លី ម៉េង(ថ្មី)"
        },
        {
            "barcode": "171143969",
            "dpc": "03031640201",
            "name": "វ៉ែន  ទីន"
        },
        {
            "barcode": "171143970",
            "dpc": "03031640301",
            "name": "មឿន   ម៉ន"
        },
        {
            "barcode": "171143971",
            "dpc": "03031640401",
            "name": "ណៃ  ព្រីឆា"
        },
        {
            "barcode": "171143972",
            "dpc": "03031640801",
            "name": "យិន  មន្នី"
        },
        {
            "barcode": "171143973",
            "dpc": "03031640901",
            "name": "នួន  សារេត"
        },
        {
            "barcode": "171143974",
            "dpc": "03031641001",
            "name": "ឈឿប  តៅ"
        },
        {
            "barcode": "171143975",
            "dpc": "03031641101",
            "name": "ឈឿត  មករា"
        },
        {
            "barcode": "171143976",
            "dpc": "03031641201",
            "name": "គង់  សៀន"
        },
        {
            "barcode": "171143977",
            "dpc": "03031641301",
            "name": "កេង  សុវណ្ណ"
        },
        {
            "barcode": "171143978",
            "dpc": "03031641401",
            "name": "ពុធ  ម៉េង"
        },
        {
            "barcode": "171143979",
            "dpc": "03031640701",
            "name": "សូត្រ  ណាំង"
        },
        {
            "barcode": "171143980",
            "dpc": "03031641501",
            "name": "អ៊ុក  អូន"
        },
        {
            "barcode": "171143981",
            "dpc": "03031641601",
            "name": "បាន   សុខវី"
        },
        {
            "barcode": "171143982",
            "dpc": "03031641701",
            "name": "ឆៃ  លី"
        },
        {
            "barcode": "171143983",
            "dpc": "03031641801",
            "name": "ម៉ម  រតនា"
        },
        {
            "barcode": "171143984",
            "dpc": "03031641901",
            "name": "ទាវ  វុទ្ធី (ក្រោយ)"
        },
        {
            "barcode": "171143985",
            "dpc": "03031642001",
            "name": "ណុប  អេង"
        },
        {
            "barcode": "171143986",
            "dpc": "03031642101",
            "name": "ហេង  ណៃ"
        },
        {
            "barcode": "171143987",
            "dpc": "03031642201",
            "name": "ទាវ វុទ្ធី (មុខ)"
        },
        {
            "barcode": "171143988",
            "dpc": "03031642301",
            "name": "តោ  កុយហួង"
        },
        {
            "barcode": "171143989",
            "dpc": "03031642401",
            "name": "ជួប  សុភី"
        },
        {
            "barcode": "171143990",
            "dpc": "03031642501",
            "name": "រឿន  ឡោ"
        },
        {
            "barcode": "171143991",
            "dpc": "03031642601",
            "name": "យិន  វុនហាន"
        },
        {
            "barcode": "171143992",
            "dpc": "03031642701",
            "name": "ហេង  ជួង"
        },
        {
            "barcode": "171143993",
            "dpc": "03031642801",
            "name": "សៅ  រតនា"
        },
        {
            "barcode": "171143994",
            "dpc": "03031642901",
            "name": "ខូវ  សៀងហុង"
        },
        {
            "barcode": "171143995",
            "dpc": "03031643001",
            "name": "ជីវ  ម៉េង"
        },
        {
            "barcode": "171143996",
            "dpc": "03031643101",
            "name": "ឡុង  ប៊ុនលី"
        },
        {
            "barcode": "171143997",
            "dpc": "03031643201",
            "name": "គង់  សាមិត្ត"
        },
        {
            "barcode": "171143998",
            "dpc": "03031643301",
            "name": "ហេង  គាង"
        },
        {
            "barcode": "171143999",
            "dpc": "03031643401",
            "name": "ផ្លុង  មករា"
        },
        {
            "barcode": "171144000",
            "dpc": "03031643501",
            "name": "សោម  សុខា"
        },
        {
            "barcode": "171144001",
            "dpc": "03031643601",
            "name": "លោក  តា"
        },
        {
            "barcode": "171144002",
            "dpc": "03031643701",
            "name": "ខូវ  ស្រេង"
        },
        {
            "barcode": "171144003",
            "dpc": "03031643801",
            "name": "ខូវ  ផល្លី"
        },
        {
            "barcode": "171144004",
            "dpc": "03031643901",
            "name": "សៀវ  ឡាយហូយ"
        },
        {
            "barcode": "171144005",
            "dpc": "03031644001",
            "name": "យិន  ពីសី"
        },
        {
            "barcode": "171144006",
            "dpc": "03031644101",
            "name": "នៅ  សាមិត្ត"
        },
        {
            "barcode": "171144007",
            "dpc": "03031644201",
            "name": "ផេង  សារុន"
        },
        {
            "barcode": "171144008",
            "dpc": "03031644401",
            "name": "លឹម  វង្ស"
        },
        {
            "barcode": "171144009",
            "dpc": "03031644501",
            "name": "នួន  ឆាន"
        },
        {
            "barcode": "171144010",
            "dpc": "03031644601",
            "name": "ចាន់  ធា"
        },
        {
            "barcode": "171144011",
            "dpc": "03031644701",
            "name": "ង៉ូវ  សៀង"
        },
        {
            "barcode": "171144012",
            "dpc": "03031644901",
            "name": "មាស  សារី"
        },
        {
            "barcode": "171144013",
            "dpc": "03031645001",
            "name": "ង៉ែត ណែម"
        },
        {
            "barcode": "171144014",
            "dpc": "03031645101",
            "name": "ស៊ីម  ម៉េងស្រេង"
        },
        {
            "barcode": "171144015",
            "dpc": "03031645301",
            "name": "ជុំ   នី"
        },
        {
            "barcode": "171144016",
            "dpc": "03031645501",
            "name": "តៀង  ថាញ់"
        },
        {
            "barcode": "171144017",
            "dpc": "03031645401",
            "name": "ជា ជុំ"
        },
        {
            "barcode": "171144018",
            "dpc": "03031645801",
            "name": "ឃួន  រ៉ាវុធ"
        },
        {
            "barcode": "171144019",
            "dpc": "03031636501",
            "name": "ឈួម ប៉ាន"
        },
        {
            "barcode": "171144020",
            "dpc": "03031636601",
            "name": "ទ្រី ម៉ុង ១"
        },
        {
            "barcode": "171144021",
            "dpc": "03031636701",
            "name": "ទ្រី ម៉ុង ២"
        },
        {
            "barcode": "171144022",
            "dpc": "03031636901",
            "name": "ស៊ឹម យុទ្ធាសារ"
        },
        {
            "barcode": "171144023",
            "dpc": "03031637001",
            "name": "លី ហាក់ហាន់"
        },
        {
            "barcode": "171144024",
            "dpc": "03031637101",
            "name": "គឹម សារិទ្ធ"
        },
        {
            "barcode": "171144025",
            "dpc": "03031637301",
            "name": "តាន់ វុតថា"
        },
        {
            "barcode": "171144026",
            "dpc": "03031637401",
            "name": "សេង ម៉ាង ៣"
        },
        {
            "barcode": "171144027",
            "dpc": "03031637501",
            "name": "សឹន សំរេច"
        },
        {
            "barcode": "171144028",
            "dpc": "03031637601",
            "name": "សួស ផូរ"
        },
        {
            "barcode": "171144029",
            "dpc": "03031637701",
            "name": "ប្រាក់ សុកិទ"
        },
        {
            "barcode": "171144030",
            "dpc": "03031637801",
            "name": "អេ សារ៉ុម"
        },
        {
            "barcode": "171144031",
            "dpc": "03031638101",
            "name": "សោម សុន"
        },
        {
            "barcode": "171144032",
            "dpc": "03031638201",
            "name": "ហ៊ីង បូរ"
        },
        {
            "barcode": "171144033",
            "dpc": "03031638301",
            "name": "អៀ មួយគា"
        },
        {
            "barcode": "171144034",
            "dpc": "03031638401",
            "name": "យឹម វឌ្ឍនា"
        },
        {
            "barcode": "171144035",
            "dpc": "03031638501",
            "name": "ហុង លីហួរ"
        },
        {
            "barcode": "171144036",
            "dpc": "03031638601",
            "name": "លឹម សៀង"
        },
        {
            "barcode": "171144037",
            "dpc": "03031638701",
            "name": "អ៊ុក វណ្ណា"
        },
        {
            "barcode": "171144038",
            "dpc": "03031638801",
            "name": "តេវ វន្ថា"
        },
        {
            "barcode": "171144039",
            "dpc": "03031638901",
            "name": "លី វេងថៃ"
        },
        {
            "barcode": "171144040",
            "dpc": "03031639001",
            "name": "កុក ហួរ"
        },
        {
            "barcode": "171144041",
            "dpc": "03031639101",
            "name": "ឈុន ហ៊ត"
        },
        {
            "barcode": "171144042",
            "dpc": "03031639201",
            "name": "លី មាន"
        },
        {
            "barcode": "171144043",
            "dpc": "03031639301",
            "name": "ស៊ុត សុផល"
        },
        {
            "barcode": "171144044",
            "dpc": "03031639701",
            "name": "ឆាន់ ហុង"
        },
        {
            "barcode": "171144045",
            "dpc": "03031639801",
            "name": "អ៊ុក វុទ្ធី"
        },
        {
            "barcode": "171144046",
            "dpc": "03031639601",
            "name": "ស៊ុំ សំនៀង"
        },
        {
            "barcode": "171144047",
            "dpc": "03031639501",
            "name": "សេក ម៉ូលី"
        },
        {
            "barcode": "171144048",
            "dpc": "03031639401",
            "name": "យិន ភិច"
        },
        {
            "barcode": "171144049",
            "dpc": "03031647901",
            "name": "អ៊ុយ ង៉ក់"
        },
        {
            "barcode": "171144050",
            "dpc": "03031646901",
            "name": "នាង សល"
        },
        {
            "barcode": "171144051",
            "dpc": "03031638001",
            "name": "ញ៉ែម គង់"
        },
        {
            "barcode": "171144052",
            "dpc": "03031636401",
            "name": "ឡាយ កៅ"
        },
        {
            "barcode": "171144053",
            "dpc": "03031636301",
            "name": "ប៉ច សុវណ្ណ"
        },
        {
            "barcode": "171144054",
            "dpc": "03031636201",
            "name": "អ៊ឹង ឡៃហុក"
        },
        {
            "barcode": "171144055",
            "dpc": "03031636101",
            "name": "តាំង សុខអេង"
        },
        {
            "barcode": "171144056",
            "dpc": "03031636001",
            "name": "តាំង សុខជូ"
        },
        {
            "barcode": "171144057",
            "dpc": "03031634301",
            "name": "ងួន  ហ៊ួរ"
        },
        {
            "barcode": "171144058",
            "dpc": "03031634401",
            "name": "សាញ់  ញឹម"
        },
        {
            "barcode": "171144059",
            "dpc": "03031634501",
            "name": "ងួន  ហួត"
        },
        {
            "barcode": "171144060",
            "dpc": "03031635501",
            "name": "ម៉ូវ  ហោ"
        },
        {
            "barcode": "171144061",
            "dpc": "03031639901",
            "name": "ជូ  សែ"
        },
        {
            "barcode": "171144062",
            "dpc": "03031640001",
            "name": "មេន  ពិសិទ្ធ"
        },
        {
            "barcode": "171144063",
            "dpc": "03031640101",
            "name": "សេង  ម៉េង"
        },
        {
            "barcode": "171144064",
            "dpc": "03031640501",
            "name": "រឿន  ផល្លី"
        },
        {
            "barcode": "171144065",
            "dpc": "03031644801",
            "name": "ហឿន  ទិត្យ"
        },
        {
            "barcode": "171144066",
            "dpc": "03031648001",
            "name": "ញ៉ែម ហ៊ាន"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
