let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=

[
  {
    "barcode": "171146105",
    "dpc": "03031747001",
    "name": "អ៊ឹង ឡៃហុក"
  },
  {
    "barcode": "171146106",
    "dpc": "03031746701",
    "name": "ស៊ិន វ៉ាត"
  },
  {
    "barcode": "171146107",
    "dpc": "03031745801",
    "name": "សំ គីម"
  },
  {
    "barcode": "171146108",
    "dpc": "03031747501",
    "name": "ហេង ណែត"
  },
  {
    "barcode": "171146109",
    "dpc": "03031746101",
    "name": "ពុត ពៅ"
  },
  {
    "barcode": "171146110",
    "dpc": "03031746001",
    "name": "ប៉ែន សុគន្ធី"
  },
  {
    "barcode": "171146111",
    "dpc": "03031729801",
    "name": "ទែន ជំនិត"
  },
  {
    "barcode": "171146112",
    "dpc": "03031729701",
    "name": "គង់ ឆាយ (ខាងក្រៅ)"
  },
  {
    "barcode": "171146113",
    "dpc": "03031729601",
    "name": "គង់ ឆាយ (ខាងក្នុង)"
  },
  {
    "barcode": "171146114",
    "dpc": "03031729501",
    "name": "ប៊ុន ចាន់នី"
  },
  {
    "barcode": "171146115",
    "dpc": "03031729401",
    "name": "ស៊ិង យឿង"
  },
  {
    "barcode": "171146116",
    "dpc": "03031729301",
    "name": "សេក ឃីម"
  },
  {
    "barcode": "171146117",
    "dpc": "03031729201",
    "name": "គឹម ស៊្រុន"
  },
  {
    "barcode": "171146118",
    "dpc": "03031729101",
    "name": "មាស កាន"
  },
  {
    "barcode": "171146119",
    "dpc": "03031729001",
    "name": "ហេង ស៊ីថន"
  },
  {
    "barcode": "171146120",
    "dpc": "03031730001",
    "name": "បឹង ឡោម"
  },
  {
    "barcode": "171146121",
    "dpc": "03031728901",
    "name": "អ៊ឹម សូត្រ"
  },
  {
    "barcode": "171146122",
    "dpc": "03031730301",
    "name": "ញ៉ញ់ ជល"
  },
  {
    "barcode": "171146123",
    "dpc": "03031728801",
    "name": "នង ឃីម"
  },
  {
    "barcode": "171146124",
    "dpc": "03031728701",
    "name": "លិញ ម្លិៈ"
  },
  {
    "barcode": "171146125",
    "dpc": "03031728601",
    "name": "សុខ សុម៉ាលី"
  },
  {
    "barcode": "171146126",
    "dpc": "03031731701",
    "name": "អ៊ុំ សុខម៉េត"
  },
  {
    "barcode": "171146127",
    "dpc": "03031731801",
    "name": "ញ៉ែម យឿប"
  },
  {
    "barcode": "171146128",
    "dpc": "03031731901",
    "name": "វរ សានិត"
  },
  {
    "barcode": "171146129",
    "dpc": "03031730401",
    "name": "ម៉ៅ សុភាព"
  },
  {
    "barcode": "171146130",
    "dpc": "03031730601",
    "name": "ហេង ជីឃាង"
  },
  {
    "barcode": "171146131",
    "dpc": "03031730501",
    "name": "អ៊ុក ស៊ីផាន់"
  },
  {
    "barcode": "171146132",
    "dpc": "03031730701",
    "name": "សូ សុង"
  },
  {
    "barcode": "171146133",
    "dpc": "03031730801",
    "name": "គុយ វង"
  },
  {
    "barcode": "171146134",
    "dpc": "03031730901",
    "name": "ចក់ ចរិយា"
  },
  {
    "barcode": "171146135",
    "dpc": "03031731001",
    "name": "អ៊ីវ សម្បត្តិ"
  },
  {
    "barcode": "171146136",
    "dpc": "03031731101",
    "name": "សែន ចាន់ដារ៉ា"
  },
  {
    "barcode": "171146137",
    "dpc": "03031731201",
    "name": "ស៊ិន ស៊ីថន"
  },
  {
    "barcode": "171146138",
    "dpc": "03031731301",
    "name": "ញ៉ែម សុផើន"
  },
  {
    "barcode": "171146139",
    "dpc": "03031731401",
    "name": "ទាវ អោម"
  },
  {
    "barcode": "171146140",
    "dpc": "03031731501",
    "name": "សុខ ជុំ"
  },
  {
    "barcode": "171146141",
    "dpc": "03031731601",
    "name": "គា សេង"
  },
  {
    "barcode": "171146142",
    "dpc": "03031729901",
    "name": "ញ៉ែម ឡី"
  },
  {
    "barcode": "171146143",
    "dpc": "03031728501",
    "name": "អ៊ិត តាន់"
  },
  {
    "barcode": "171146144",
    "dpc": "03031728401",
    "name": "ពេជ្រ ឯម"
  },
  {
    "barcode": "171146145",
    "dpc": "03031735701",
    "name": "រឿន មករា"
  },
  {
    "barcode": "171146146",
    "dpc": "03031730201",
    "name": "យន់ ថា"
  },
  {
    "barcode": "171146147",
    "dpc": "03031728301",
    "name": "កែវ វុត្ថា"
  },
  {
    "barcode": "171146148",
    "dpc": "03031728201",
    "name": "ជា ត្រឹក"
  },
  {
    "barcode": "171146149",
    "dpc": "03031728101",
    "name": "ញឹក ថន"
  },
  {
    "barcode": "171146150",
    "dpc": "03031727901",
    "name": "ជា ណៃ"
  },
  {
    "barcode": "171146151",
    "dpc": "03031727801",
    "name": "យ៉ត ប៊ុនវឿត"
  },
  {
    "barcode": "171146152",
    "dpc": "03031727701",
    "name": "ស៊ា សុគន្ធ"
  },
  {
    "barcode": "171146153",
    "dpc": "03031727601",
    "name": "ខៀវ វិន"
  },
  {
    "barcode": "171146154",
    "dpc": "03031727501",
    "name": "រុំ សឿត"
  },
  {
    "barcode": "171146155",
    "dpc": "03031727401",
    "name": "ហ៊ុន សាវុឌ្ឍ"
  },
  {
    "barcode": "171146156",
    "dpc": "03031727301",
    "name": "ជា ទ្រី"
  },
  {
    "barcode": "171146157",
    "dpc": "03031727201",
    "name": "លី ហួត"
  },
  {
    "barcode": "171146158",
    "dpc": "03031727101",
    "name": "ស៊ូ ស៊ានយន"
  },
  {
    "barcode": "171146159",
    "dpc": "03031727001",
    "name": "លីវ ស៊ុនលាង"
  },
  {
    "barcode": "171146160",
    "dpc": "03031726901",
    "name": "អ៊ុំ រ៉ុន"
  },
  {
    "barcode": "171146161",
    "dpc": "03031726801",
    "name": "យឹម ភក្តី"
  },
  {
    "barcode": "171146162",
    "dpc": "03031726701",
    "name": "ម៉ៅ ម៉ាលី"
  },
  {
    "barcode": "171146163",
    "dpc": "03031726601",
    "name": "គឹម រតនៈ"
  },
  {
    "barcode": "171146164",
    "dpc": "03031726501",
    "name": "សែម សំ"
  },
  {
    "barcode": "171146165",
    "dpc": "03031726401",
    "name": "ឃួន ស៊ីថា"
  },
  {
    "barcode": "171146166",
    "dpc": "03031726301",
    "name": "ប៉ែន ទូច"
  },
  {
    "barcode": "171146167",
    "dpc": "03031726201",
    "name": "លី សុខហ៊ុយ"
  },
  {
    "barcode": "171146168",
    "dpc": "03031726101",
    "name": "ប៉ោ ស៊ីណា"
  },
  {
    "barcode": "171146169",
    "dpc": "03031726001",
    "name": "វង្ស ហួត"
  },
  {
    "barcode": "171146170",
    "dpc": "03031725801",
    "name": "ឌុក ធារី"
  },
  {
    "barcode": "171146171",
    "dpc": "03031725701",
    "name": "យីន គឹមតឹង"
  },
  {
    "barcode": "171146172",
    "dpc": "03031725601",
    "name": "យូ វណ្ណៈ"
  },
  {
    "barcode": "171146173",
    "dpc": "03031725501",
    "name": "សឹង នី"
  },
  {
    "barcode": "171146174",
    "dpc": "03031725401",
    "name": "សុវណ្ណ វឿន"
  },
  {
    "barcode": "171146175",
    "dpc": "03031725301",
    "name": "ចាន់ កុសល់"
  },
  {
    "barcode": "171146176",
    "dpc": "03031725201",
    "name": "គឹម ឡុង"
  },
  {
    "barcode": "171146177",
    "dpc": "03031725101",
    "name": "គឹម លាង"
  },
  {
    "barcode": "171146178",
    "dpc": "03031725001",
    "name": "ថាច់ សាមិត"
  },
  {
    "barcode": "171146179",
    "dpc": "03031724901",
    "name": "ធឹម សុគន្ធ"
  },
  {
    "barcode": "171146180",
    "dpc": "03031724701",
    "name": "ផេង ភន"
  },
  {
    "barcode": "171146181",
    "dpc": "03031724601",
    "name": "ថាច់ ម៉ឹង"
  },
  {
    "barcode": "171146182",
    "dpc": "03031724501",
    "name": "ឆេង សម្បត្តិ"
  },
  {
    "barcode": "171146183",
    "dpc": "03031724401",
    "name": "ហុន ឃុនឆឺត"
  },
  {
    "barcode": "171146184",
    "dpc": "03031724301",
    "name": "ប៊ុត អៀម"
  },
  {
    "barcode": "171146185",
    "dpc": "03031724201",
    "name": "លីវ គឹមឆេង"
  },
  {
    "barcode": "171146186",
    "dpc": "03031724101",
    "name": "អ៊ិត ទៀង"
  },
  {
    "barcode": "171146187",
    "dpc": "03031724001",
    "name": "ហម សៀកឡាយ"
  },
  {
    "barcode": "171146188",
    "dpc": "03031723901",
    "name": "ប៉ូ សម្បត្តិ"
  },
  {
    "barcode": "171146189",
    "dpc": "03031745701",
    "name": "ចៅ សាន់ទី"
  },
  {
    "barcode": "171146190",
    "dpc": "03031746301",
    "name": "ឡូញ ឈៀង"
  },
  {
    "barcode": "171146191",
    "dpc": "03031746501",
    "name": "ឡុង ឌាល"
  },
  {
    "barcode": "171146192",
    "dpc": "03031746401",
    "name": "វ៉ា ភ្សេម"
  },
  {
    "barcode": "171146193",
    "dpc": "03031747701",
    "name": "សាំង យូហេង"
  },
  {
    "barcode": "171146194",
    "dpc": "03031747801",
    "name": "ឯក សារុំ"
  },
  {
    "barcode": "171146195",
    "dpc": "03031747601",
    "name": "ភេន  សុភា"
  },
  {
    "barcode": "171146196",
    "dpc": "03031746801",
    "name": "ហេង សំអាត"
  },
  {
    "barcode": "171146197",
    "dpc": "03031746901",
    "name": "អនុវិទ្យាល័យ ទួលតាឯក"
  },
  {
    "barcode": "171146198",
    "dpc": "03031747401",
    "name": "សាន ពលៈ"
  },
  {
    "barcode": "171146199",
    "dpc": "03031747101",
    "name": "គាម ងនលី"
  },
  {
    "barcode": "171146200",
    "dpc": "03031747301",
    "name": "ម៉ម រ័ត្នមុនី"
  },
  {
    "barcode": "171146201",
    "dpc": "03031747201",
    "name": "ដាញ់ សារី"
  },
  {
    "barcode": "171146202",
    "dpc": "03031745601",
    "name": "ប៊ុន ធឿម"
  },
  {
    "barcode": "171146203",
    "dpc": "03031745901",
    "name": "ហាក់ ស៊្រុន"
  },
  {
    "barcode": "171146204",
    "dpc": "03031747901",
    "name": "ជូ ហឹង"
  },
  {
    "barcode": "171146205",
    "dpc": "03031746201",
    "name": "យឿន  ស្រីសាប"
  },
  {
    "barcode": "171146206",
    "dpc": "03031715401",
    "name": "ស្រី អូន"
  },
  {
    "barcode": "171146207",
    "dpc": "03031742201",
    "name": "ទេព  ប៊ុនលី"
  },
  {
    "barcode": "171146208",
    "dpc": "03031742401",
    "name": "សាង  ភីន"
  },
  {
    "barcode": "171146209",
    "dpc": "03031741201",
    "name": "លឹម  គង់"
  },
  {
    "barcode": "171146210",
    "dpc": "03031742901",
    "name": "កែវ  ធី"
  },
  {
    "barcode": "171146211",
    "dpc": "03031742701",
    "name": "ធួន  រ៉ាវុធ"
  },
  {
    "barcode": "171146212",
    "dpc": "03031742601",
    "name": "ឈួយ  វណ្ណៈ"
  },
  {
    "barcode": "171146213",
    "dpc": "03031745101",
    "name": "ហាក់ ឡាយ ២"
  },
  {
    "barcode": "171146214",
    "dpc": "03031742301",
    "name": "យន់ សុគន្ធ"
  },
  {
    "barcode": "171146215",
    "dpc": "03031740601",
    "name": "ទួត   សំអាង"
  },
  {
    "barcode": "171146216",
    "dpc": "03031741701",
    "name": "គុយ  ម៉េង"
  },
  {
    "barcode": "171146217",
    "dpc": "03031741601",
    "name": "ឈុំ ឈុត"
  },
  {
    "barcode": "171146218",
    "dpc": "03031739801",
    "name": "ខាន់ ម៉ាណេ"
  },
  {
    "barcode": "171146219",
    "dpc": "03031735801",
    "name": "វ៉ាន់ ស៊ឹមវ៉ា"
  },
  {
    "barcode": "171146220",
    "dpc": "03031735901",
    "name": "អ៊ឹម បណ្ឌិត"
  },
  {
    "barcode": "171146221",
    "dpc": "03031736001",
    "name": "ហួត អៀងតុង"
  },
  {
    "barcode": "171146222",
    "dpc": "03031736101",
    "name": "តាន់ គឹមឡុង"
  },
  {
    "barcode": "171146223",
    "dpc": "03031736201",
    "name": "ហ៊ឹម យ៉ាន"
  },
  {
    "barcode": "171146224",
    "dpc": "03031736301",
    "name": "ជា នី"
  },
  {
    "barcode": "171146225",
    "dpc": "03031736401",
    "name": "ហ៊ឹម មហាម៉ាត់"
  },
  {
    "barcode": "171146226",
    "dpc": "03031736501",
    "name": "ចឹក  ម៉ៅ"
  },
  {
    "barcode": "171146227",
    "dpc": "03031736601",
    "name": "គង់ ចាន់ណា"
  },
  {
    "barcode": "171146228",
    "dpc": "03031736701",
    "name": "លឹម ហេង"
  },
  {
    "barcode": "171146229",
    "dpc": "03031736801",
    "name": "អឿន សំអាត"
  },
  {
    "barcode": "171146230",
    "dpc": "03031737001",
    "name": "ហេង លីម"
  },
  {
    "barcode": "171146231",
    "dpc": "03031737101",
    "name": "វង្ស វុទ្ធី"
  },
  {
    "barcode": "171146232",
    "dpc": "03031737201",
    "name": "ចេង ប៊ុនណាត"
  },
  {
    "barcode": "171146233",
    "dpc": "03031737501",
    "name": "ចាន់ សុភាព"
  },
  {
    "barcode": "171146234",
    "dpc": "03031737401",
    "name": "សុខ ប៊ុនដារ៉ា ២"
  },
  {
    "barcode": "171146235",
    "dpc": "03031737301",
    "name": "ហាន ធីតា"
  },
  {
    "barcode": "171146236",
    "dpc": "03031737601",
    "name": "ជា ដាវុធ"
  },
  {
    "barcode": "171146237",
    "dpc": "03031737701",
    "name": "ហេង រិទ្ធី"
  },
  {
    "barcode": "171146238",
    "dpc": "03031738601",
    "name": "ហុក រ៉ាវុធ"
  },
  {
    "barcode": "171146239",
    "dpc": "03031738501",
    "name": "ហេង រិទ្ធី"
  },
  {
    "barcode": "171146240",
    "dpc": "03031738701",
    "name": "ព្រំ សុផល"
  },
  {
    "barcode": "171146241",
    "dpc": "03031738901",
    "name": "ឈៀង ឈុន"
  },
  {
    "barcode": "171146242",
    "dpc": "03031740201",
    "name": "សាយ ស៊ីណា"
  },
  {
    "barcode": "171146243",
    "dpc": "03031739001",
    "name": "ជា ហ្សីម"
  },
  {
    "barcode": "171146244",
    "dpc": "03031740401",
    "name": "កូវ ហុងឃៀង"
  },
  {
    "barcode": "171146245",
    "dpc": "03031739101",
    "name": "លឹម ឃុនឃាង"
  },
  {
    "barcode": "171146246",
    "dpc": "03031739601",
    "name": "យាំកាយីសាយមិន"
  },
  {
    "barcode": "171146247",
    "dpc": "03031739701",
    "name": "លឹម គុយហេង"
  },
  {
    "barcode": "171146248",
    "dpc": "03031739501",
    "name": "ផេង សុខុម"
  },
  {
    "barcode": "171146249",
    "dpc": "03031739201",
    "name": "ស៊ិន សុគន្ធា"
  },
  {
    "barcode": "171146250",
    "dpc": "03031740301",
    "name": "សុខ ភាព"
  },
  {
    "barcode": "171146251",
    "dpc": "03031739901",
    "name": "ហ៊ត តាំងវែង"
  },
  {
    "barcode": "171146252",
    "dpc": "03031740101",
    "name": "ឡាច សុភាព"
  },
  {
    "barcode": "171146253",
    "dpc": "03031739301",
    "name": "សយ បូរ៉ា"
  },
  {
    "barcode": "171146254",
    "dpc": "03031739401",
    "name": "ប៉េង ស៊ីប៉ូ"
  },
  {
    "barcode": "171146255",
    "dpc": "03031737801",
    "name": "ជូ ចាន់សុភ័ក្រ្ត ១"
  },
  {
    "barcode": "171146256",
    "dpc": "03031737901",
    "name": "ជូ ចាន់សុភ័ក្រ្ត ២"
  },
  {
    "barcode": "171146257",
    "dpc": "03031738001",
    "name": "ជា តាំង"
  },
  {
    "barcode": "171146258",
    "dpc": "03031738101",
    "name": "គិន ឆាន"
  },
  {
    "barcode": "171146259",
    "dpc": "03031738201",
    "name": "អឿន គុណភិរម្យ"
  },
  {
    "barcode": "171146260",
    "dpc": "03031738301",
    "name": "ស៊ឹម ហ្វូល"
  },
  {
    "barcode": "171146261",
    "dpc": "03031738401",
    "name": "ស៊ាន ផា"
  },
  {
    "barcode": "171146262",
    "dpc": "03031740001",
    "name": "តាន់ មុំ"
  },
  {
    "barcode": "171146263",
    "dpc": "03031744901",
    "name": "ចាយ ពណ្ណរី"
  },
  {
    "barcode": "171146264",
    "dpc": "03031744401",
    "name": "ធៀម  ប៊ុនធឿន"
  },
  {
    "barcode": "171146265",
    "dpc": "03031744501",
    "name": "រតនៈ ចាន់សេរី"
  },
  {
    "barcode": "171146266",
    "dpc": "03031745301",
    "name": "យន់ ប៊ុនរី"
  },
  {
    "barcode": "171146267",
    "dpc": "03031735501",
    "name": "ឈាង វីរៈ"
  },
  {
    "barcode": "171146268",
    "dpc": "03031735601",
    "name": "ខួច ស៊ុនហេង"
  },
  {
    "barcode": "171146269",
    "dpc": "03031745401",
    "name": "យូ ឆាយ"
  },
  {
    "barcode": "171146270",
    "dpc": "03031705301",
    "name": "សុខ តាំង"
  },
  {
    "barcode": "171146271",
    "dpc": "03031743401",
    "name": "ចៅ សុវណ្ណ"
  },
  {
    "barcode": "171146272",
    "dpc": "03031704901",
    "name": "មៀច ផេង ១"
  },
  {
    "barcode": "171146273",
    "dpc": "03031704701",
    "name": "សួន សុគន្ធ"
  },
  {
    "barcode": "171146274",
    "dpc": "03031704501",
    "name": "ហេង កង"
  },
  {
    "barcode": "171146275",
    "dpc": "03031704401",
    "name": "ប៉ឹង ឈុននី"
  },
  {
    "barcode": "171146276",
    "dpc": "03031704301",
    "name": "ប៉ឹង ខី"
  },
  {
    "barcode": "171146277",
    "dpc": "03031704201",
    "name": "ស៊ា សុផល២"
  },
  {
    "barcode": "171146278",
    "dpc": "03031704101",
    "name": "មុំ ក្រាត"
  },
  {
    "barcode": "171146279",
    "dpc": "03031704001",
    "name": "តាន់ សុជិត ២"
  },
  {
    "barcode": "171146280",
    "dpc": "03031703901",
    "name": "សៀង ណាវី"
  },
  {
    "barcode": "171146281",
    "dpc": "03031703801",
    "name": "ទាវ ជូឡុង"
  },
  {
    "barcode": "171146282",
    "dpc": "03031703701",
    "name": "ស៊ា សុផល ១"
  },
  {
    "barcode": "171146283",
    "dpc": "03031703601",
    "name": "ដួង រតនា"
  },
  {
    "barcode": "171146284",
    "dpc": "03031703501",
    "name": "ហួត តាំង"
  },
  {
    "barcode": "171146285",
    "dpc": "03031745501",
    "name": "ព្រំ សុផាន"
  },
  {
    "barcode": "171146286",
    "dpc": "03031703401",
    "name": "ម៉ៅ ឃីន"
  },
  {
    "barcode": "171146287",
    "dpc": "03031703201",
    "name": "ចេង  សុលីន"
  },
  {
    "barcode": "171146288",
    "dpc": "03031703101",
    "name": "តាន់ សុជិត ១"
  },
  {
    "barcode": "171146289",
    "dpc": "03031702801",
    "name": "ស៊ុន ប៊ុនស៊"
  },
  {
    "barcode": "171146290",
    "dpc": "03031703001",
    "name": "លី ហាក់"
  },
  {
    "barcode": "171146291",
    "dpc": "03031702901",
    "name": "កែ ទី"
  },
  {
    "barcode": "171146292",
    "dpc": "03031707601",
    "name": "មុំ ភា"
  },
  {
    "barcode": "171146293",
    "dpc": "03031707701",
    "name": "អែម ដារី"
  },
  {
    "barcode": "171146294",
    "dpc": "03031707801",
    "name": "កែវ ចាន់ណាវុធ"
  },
  {
    "barcode": "171146295",
    "dpc": "03031744201",
    "name": "នួន នារី"
  },
  {
    "barcode": "171146296",
    "dpc": "03031707901",
    "name": "ងេច ង៉ា"
  },
  {
    "barcode": "171146297",
    "dpc": "03031708001",
    "name": "ជុំ ណារេត"
  },
  {
    "barcode": "171146298",
    "dpc": "03031708101",
    "name": "សាំង ចិត្រា"
  },
  {
    "barcode": "171146299",
    "dpc": "03031708201",
    "name": "ឡុង សឿនអេន"
  },
  {
    "barcode": "171146300",
    "dpc": "03031708301",
    "name": "ជិន សាន់"
  },
  {
    "barcode": "171146301",
    "dpc": "03031708401",
    "name": "ឈឿប តៅ"
  },
  {
    "barcode": "171146302",
    "dpc": "03031708501",
    "name": "ជា សាន់"
  },
  {
    "barcode": "171146303",
    "dpc": "03031708601",
    "name": "ឯម សារិន"
  },
  {
    "barcode": "171146304",
    "dpc": "03031708701",
    "name": "យិន ម៉ាន់"
  },
  {
    "barcode": "171146305",
    "dpc": "03031709001",
    "name": "សុខ តាំង"
  },
  {
    "barcode": "171146306",
    "dpc": "03031700101",
    "name": "ផ្លុង វុឌ្ឍី"
  },
  {
    "barcode": "171146307",
    "dpc": "03031700201",
    "name": "គី សុខហួរ"
  },
  {
    "barcode": "171146308",
    "dpc": "03031700301",
    "name": "ប៊ូ គឹមឈាន"
  },
  {
    "barcode": "171146309",
    "dpc": "03031700401",
    "name": "ជា វ៉ាន់លួង"
  },
  {
    "barcode": "171146310",
    "dpc": "03031700501",
    "name": "ចឹក គង់"
  },
  {
    "barcode": "171146311",
    "dpc": "03031700601",
    "name": "រាជ វណ្ណារិទ្ធ"
  },
  {
    "barcode": "171146312",
    "dpc": "03031700701",
    "name": "ប៉ាន់ ប៊ុនរឿន"
  },
  {
    "barcode": "171146313",
    "dpc": "03031700801",
    "name": "ប៊ុន សុវណ្ណា"
  },
  {
    "barcode": "171146314",
    "dpc": "03031700901",
    "name": "សិត លុច"
  },
  {
    "barcode": "171146315",
    "dpc": "03031701001",
    "name": "សុគន្ធា រី"
  },
  {
    "barcode": "171146316",
    "dpc": "03031701101",
    "name": "លឹម​ ថាវ ១"
  },
  {
    "barcode": "171146317",
    "dpc": "03031701201",
    "name": "ឡុង សុភាព"
  },
  {
    "barcode": "171146318",
    "dpc": "03031701301",
    "name": "លឹម ថាវ ២"
  },
  {
    "barcode": "171146319",
    "dpc": "03031701401",
    "name": "ពៅ សុវណ្ណារី"
  },
  {
    "barcode": "171146320",
    "dpc": "03031701501",
    "name": "ម៉ាក់ ហ៊ាង"
  },
  {
    "barcode": "171146321",
    "dpc": "03031701601",
    "name": "សាន ខ"
  },
  {
    "barcode": "171146322",
    "dpc": "03031701701",
    "name": "ជា មន្ថា"
  },
  {
    "barcode": "171146323",
    "dpc": "03031701801",
    "name": "ឯម កន្យា"
  },
  {
    "barcode": "171146324",
    "dpc": "03031701901",
    "name": "សូផា រិន"
  },
  {
    "barcode": "171146325",
    "dpc": "03031702001",
    "name": "យាំ ខី"
  },
  {
    "barcode": "171146326",
    "dpc": "03031702101",
    "name": "ងួន ប៊ុនអឿន"
  },
  {
    "barcode": "171146327",
    "dpc": "03031702201",
    "name": "ឡេង ហេង"
  },
  {
    "barcode": "171146328",
    "dpc": "03031702301",
    "name": "ស៊ា យេង"
  },
  {
    "barcode": "171146329",
    "dpc": "03031702401",
    "name": "អែម ញើញ"
  },
  {
    "barcode": "171146330",
    "dpc": "03031702501",
    "name": "ដាញ់ ធឹង"
  },
  {
    "barcode": "171146331",
    "dpc": "03031702601",
    "name": "តាំង ទ្រី"
  },
  {
    "barcode": "171146332",
    "dpc": "03031741501",
    "name": "ចាន់ សូវង្ស"
  },
  {
    "barcode": "171146333",
    "dpc": "03031741401",
    "name": "ឈុន ឈន"
  },
  {
    "barcode": "171146334",
    "dpc": "03031742001",
    "name": "ឡៅ ទី"
  },
  {
    "barcode": "171146335",
    "dpc": "03031732801",
    "name": "សាន ថាវន"
  },
  {
    "barcode": "171146336",
    "dpc": "03031732701",
    "name": "ម៉ែន សម្បត្តិ"
  },
  {
    "barcode": "171146337",
    "dpc": "03031732601",
    "name": "ស៊ឹម ង៉ោ"
  },
  {
    "barcode": "171146338",
    "dpc": "03031732501",
    "name": "គង់ គឿន"
  },
  {
    "barcode": "171146339",
    "dpc": "03031732401",
    "name": "នៅ ស៊ីថន"
  },
  {
    "barcode": "171146340",
    "dpc": "03031732301",
    "name": "ស៊ា ប៊ុនឃុន"
  },
  {
    "barcode": "171146341",
    "dpc": "03031732201",
    "name": "សុង សួ"
  },
  {
    "barcode": "171146342",
    "dpc": "03031732101",
    "name": "សូរ ឈិន"
  },
  {
    "barcode": "171146343",
    "dpc": "03031741301",
    "name": "ជិន តាប់"
  },
  {
    "barcode": "171146344",
    "dpc": "03031733401",
    "name": "លី តុហួរ"
  },
  {
    "barcode": "171146345",
    "dpc": "03031733501",
    "name": "ហ៊ុយ តោ"
  },
  {
    "barcode": "171146346",
    "dpc": "03031733601",
    "name": "មុយ ចាត"
  },
  {
    "barcode": "171146347",
    "dpc": "03031733701",
    "name": "ឡេង ប៊ុនឆន"
  },
  {
    "barcode": "171146348",
    "dpc": "03031733801",
    "name": "សុខ សេង"
  },
  {
    "barcode": "171146349",
    "dpc": "03031733901",
    "name": "ឆង សាវឌី"
  },
  {
    "barcode": "171146350",
    "dpc": "03031734101",
    "name": "អ៊ុក គង់"
  },
  {
    "barcode": "171146351",
    "dpc": "03031734201",
    "name": "ហ៊ាង ណែម"
  },
  {
    "barcode": "171146352",
    "dpc": "03031734301",
    "name": "ជា  កន្និកា ២"
  },
  {
    "barcode": "171146353",
    "dpc": "03031734401",
    "name": "អៀម សាខន"
  },
  {
    "barcode": "171146354",
    "dpc": "03031734501",
    "name": "កាត់ គឹមឡេង"
  },
  {
    "barcode": "171146355",
    "dpc": "03031734601",
    "name": "ឯម វរិទ្ធ"
  },
  {
    "barcode": "171146356",
    "dpc": "03031734701",
    "name": "បាន ណារិន"
  },
  {
    "barcode": "171146357",
    "dpc": "03031734801",
    "name": "សូ  លី"
  },
  {
    "barcode": "171146358",
    "dpc": "03031734901",
    "name": "ហោ គឹមសឿង"
  },
  {
    "barcode": "171146359",
    "dpc": "03031735001",
    "name": "កាយ ប៊ុនធី"
  },
  {
    "barcode": "171146360",
    "dpc": "03031735101",
    "name": "យ៉ាន់ បូផៃ"
  },
  {
    "barcode": "171146361",
    "dpc": "03031706001",
    "name": "ជា ប៊ន"
  },
  {
    "barcode": "171146362",
    "dpc": "03031706801",
    "name": "ឃឿត សុទ្ធាវី"
  },
  {
    "barcode": "171146363",
    "dpc": "03031744101",
    "name": "ជា វណ្ណី"
  },
  {
    "barcode": "171146364",
    "dpc": "03031707201",
    "name": "ម៉ៅ ស៊ុយ"
  },
  {
    "barcode": "171146365",
    "dpc": "03031707301",
    "name": "ទេព គន្ធ"
  },
  {
    "barcode": "171146366",
    "dpc": "03031707401",
    "name": "យី ឆន ១"
  },
  {
    "barcode": "171146367",
    "dpc": "03031707501",
    "name": "យី ឆន ២"
  },
  {
    "barcode": "171146368",
    "dpc": "03031744301",
    "name": "វ៉ា សំមុន្នី"
  },
  {
    "barcode": "171146369",
    "dpc": "03031705701",
    "name": "ឆាំង សុផាត"
  },
  {
    "barcode": "171146370",
    "dpc": "03031705801",
    "name": "អ៊ុយ ទិ"
  },
  {
    "barcode": "171146371",
    "dpc": "03031705901",
    "name": "ដួង សំ"
  },
  {
    "barcode": "171146372",
    "dpc": "03031711201",
    "name": "កាយ គន្ធជីវ"
  },
  {
    "barcode": "171146373",
    "dpc": "03031711101",
    "name": "យី ឡេង"
  },
  {
    "barcode": "171146374",
    "dpc": "03031711001",
    "name": "តាន់ ម៉ាល័យ"
  },
  {
    "barcode": "171146375",
    "dpc": "03031710801",
    "name": "ជី ឃី"
  },
  {
    "barcode": "171146376",
    "dpc": "03031710701",
    "name": "នូ នារី"
  },
  {
    "barcode": "171146377",
    "dpc": "03031710601",
    "name": "ពាង គឹមសៀង"
  },
  {
    "barcode": "171146378",
    "dpc": "03031710501",
    "name": "ឡេង ដារ៉ា"
  },
  {
    "barcode": "171146379",
    "dpc": "03031710401",
    "name": "ទ្រីវ ទី"
  },
  {
    "barcode": "171146380",
    "dpc": "03031710301",
    "name": "ឈិន សាលី"
  },
  {
    "barcode": "171146381",
    "dpc": "03031710201",
    "name": "ថាម ផេង"
  },
  {
    "barcode": "171146382",
    "dpc": "03031710101",
    "name": "ហ៊ិន ឆេងវ័ន"
  },
  {
    "barcode": "171146383",
    "dpc": "03031710001",
    "name": "ជុំ ចំរើន"
  },
  {
    "barcode": "171146384",
    "dpc": "03031709901",
    "name": "សេង ហុក"
  },
  {
    "barcode": "171146385",
    "dpc": "03031709801",
    "name": "រិន សុផាត"
  },
  {
    "barcode": "171146386",
    "dpc": "03031709701",
    "name": "នង គឹមស៊ុន"
  },
  {
    "barcode": "171146387",
    "dpc": "03031709601",
    "name": "យូវ វិចិត្រ"
  },
  {
    "barcode": "171146388",
    "dpc": "03031709501",
    "name": "គង វុទ្ធី"
  },
  {
    "barcode": "171146389",
    "dpc": "03031709401",
    "name": "ជុំ រ៉យ"
  },
  {
    "barcode": "171146390",
    "dpc": "03031709301",
    "name": "ផាន់ សំអុល"
  },
  {
    "barcode": "171146391",
    "dpc": "03031709201",
    "name": "ម៉េង ណាត"
  },
  {
    "barcode": "171146392",
    "dpc": "03031709101",
    "name": "កេតុ សឿ"
  },
  {
    "barcode": "171146393",
    "dpc": "03031708801",
    "name": "ថោង សុផល"
  },
  {
    "barcode": "171146394",
    "dpc": "03031706901",
    "name": "សូ សំអាន"
  },
  {
    "barcode": "171146395",
    "dpc": "03031707001",
    "name": "ស៊ុន ណារ៉ាធិបតី"
  },
  {
    "barcode": "171146396",
    "dpc": "03031707101",
    "name": "សូ សំអាន ២"
  },
  {
    "barcode": "171146397",
    "dpc": "03031706701",
    "name": "សួន សុវណ្ណរ៉ា"
  },
  {
    "barcode": "171146398",
    "dpc": "03031706601",
    "name": "ប៉ែន សេរី"
  },
  {
    "barcode": "171146399",
    "dpc": "03031706401",
    "name": "សូ សារិទ្ធ"
  },
  {
    "barcode": "171146400",
    "dpc": "03031706301",
    "name": "ខៀវ សំណាង ២"
  },
  {
    "barcode": "171146401",
    "dpc": "03031713101",
    "name": "កែវ ព្រំ"
  },
  {
    "barcode": "171146402",
    "dpc": "03031713001",
    "name": "រិះ វណ្ណា"
  },
  {
    "barcode": "171146403",
    "dpc": "03031712901",
    "name": "ជា ដាវុធ"
  },
  {
    "barcode": "171146404",
    "dpc": "03031712801",
    "name": "ជុក ម៉េងគង់ ៣"
  },
  {
    "barcode": "171146405",
    "dpc": "03031712701",
    "name": "ជុក ម៉េងគង់ ៣"
  },
  {
    "barcode": "171146406",
    "dpc": "03031712601",
    "name": "ជុក ម៉េងគង់ ៣"
  },
  {
    "barcode": "171146407",
    "dpc": "03031712501",
    "name": "លឹម ស្រ៊ុន"
  },
  {
    "barcode": "171146408",
    "dpc": "03031712401",
    "name": "សៅ ទេពសត្ថា"
  },
  {
    "barcode": "171146409",
    "dpc": "03031712301",
    "name": "ទូច ឆាង"
  },
  {
    "barcode": "171146410",
    "dpc": "03031712201",
    "name": "ឈិន សារិន"
  },
  {
    "barcode": "171146411",
    "dpc": "03031712101",
    "name": "យូ ស៊ីម"
  },
  {
    "barcode": "171146412",
    "dpc": "03031712001",
    "name": "ប្រាក់ ស៊ីម៉េតថា"
  },
  {
    "barcode": "171146413",
    "dpc": "03031711901",
    "name": "ធា ស៊ីវត្ថា"
  },
  {
    "barcode": "171146414",
    "dpc": "03031711801",
    "name": "ឈឹម ជិនណារី"
  },
  {
    "barcode": "171146415",
    "dpc": "03031711701",
    "name": "មឹក តារា"
  },
  {
    "barcode": "171146416",
    "dpc": "03031711601",
    "name": "សាន់ សំអាត"
  },
  {
    "barcode": "171146417",
    "dpc": "03031711401",
    "name": "សៀង ជឿន"
  },
  {
    "barcode": "171146418",
    "dpc": "03031711301",
    "name": "រៀល ថែម"
  },
  {
    "barcode": "171146419",
    "dpc": "03031705101",
    "name": "ណាំ សុវណ្ណ"
  },
  {
    "barcode": "171146420",
    "dpc": "03031743101",
    "name": "បែន ផន"
  },
  {
    "barcode": "171146421",
    "dpc": "03031744001",
    "name": "ជា ម៉ូល្លិកា"
  },
  {
    "barcode": "171146422",
    "dpc": "03031735201",
    "name": "សួន សាវឿន"
  },
  {
    "barcode": "171146423",
    "dpc": "03031735301",
    "name": "លឹម គឹមលី"
  },
  {
    "barcode": "171146424",
    "dpc": "03031745201",
    "name": "លឹម ស្រេង"
  },
  {
    "barcode": "171146425",
    "dpc": "03031745001",
    "name": "ចាន់ ប៊ុនទី"
  },
  {
    "barcode": "171146426",
    "dpc": "03031744801",
    "name": "ប៉ែន សំអូន"
  },
  {
    "barcode": "171146427",
    "dpc": "03031713701",
    "name": "កាយ  កិត្យា"
  },
  {
    "barcode": "171146428",
    "dpc": "03031715301",
    "name": "បាន់  សារុំ"
  },
  {
    "barcode": "171146429",
    "dpc": "03031715201",
    "name": "រិន  រ៉ា"
  },
  {
    "barcode": "171146430",
    "dpc": "03031715101",
    "name": "រស់  ជីវី"
  },
  {
    "barcode": "171146431",
    "dpc": "03031714901",
    "name": "អ៊ីម  ខៃ"
  },
  {
    "barcode": "171146432",
    "dpc": "03031714801",
    "name": "អែម  ញើង"
  },
  {
    "barcode": "171146433",
    "dpc": "03031714201",
    "name": "បាន់  លៀប"
  },
  {
    "barcode": "171146434",
    "dpc": "03031714101",
    "name": "លីវ    យាវ"
  },
  {
    "barcode": "171146435",
    "dpc": "03031714001",
    "name": "ហេង  ស៊ីម"
  },
  {
    "barcode": "171146436",
    "dpc": "03031713901",
    "name": "យក់  អឿ ២"
  },
  {
    "barcode": "171146437",
    "dpc": "03031705601",
    "name": "ផែន  វ៉ាន់ឌី"
  },
  {
    "barcode": "171146438",
    "dpc": "03031705501",
    "name": "គុយ  សំអាង"
  },
  {
    "barcode": "171146439",
    "dpc": "03031714301",
    "name": "ពុធ  សឿង"
  },
  {
    "barcode": "171146440",
    "dpc": "03031714401",
    "name": "គឹម  រ៉ា"
  },
  {
    "barcode": "171146441",
    "dpc": "03031719701",
    "name": "ចៅអធិការវត្តដំរីស"
  },
  {
    "barcode": "171146442",
    "dpc": "03031719601",
    "name": "ជាម  ច័ន្ទសោភ័ណ្ឌ"
  },
  {
    "barcode": "171146443",
    "dpc": "03031719401",
    "name": "ស៊ឹង  សៀន"
  },
  {
    "barcode": "171146444",
    "dpc": "03031719301",
    "name": "ទេព  រី"
  },
  {
    "barcode": "171146445",
    "dpc": "03031719201",
    "name": "សុខ  តុលា"
  },
  {
    "barcode": "171146446",
    "dpc": "03031716601",
    "name": "អេង  លី ២"
  },
  {
    "barcode": "171146447",
    "dpc": "03031716701",
    "name": "ភេ  សុខា"
  },
  {
    "barcode": "171146448",
    "dpc": "03031716801",
    "name": "លឹម បញ្ញា"
  },
  {
    "barcode": "171146449",
    "dpc": "03031716401",
    "name": "អេង  លី ១"
  },
  {
    "barcode": "171146450",
    "dpc": "03031716301",
    "name": "ហ៊ាង  គឹមលាភ"
  },
  {
    "barcode": "171146451",
    "dpc": "03031716201",
    "name": "អឿ  ឃឿត"
  },
  {
    "barcode": "171146452",
    "dpc": "03031716101",
    "name": "ស៊ុន  ធឿន"
  },
  {
    "barcode": "171146453",
    "dpc": "03031715801",
    "name": "ម៉េង  ណារី"
  },
  {
    "barcode": "171146454",
    "dpc": "03031715601",
    "name": "ជា  វឿន"
  },
  {
    "barcode": "171146455",
    "dpc": "03031715501",
    "name": "តែ  វុទ្ធី"
  },
  {
    "barcode": "171146456",
    "dpc": "03031743801",
    "name": "អៀម  សុខហឿន"
  },
  {
    "barcode": "171146457",
    "dpc": "03031743701",
    "name": "គ្រី  ចំរើន"
  },
  {
    "barcode": "171146458",
    "dpc": "03031717801",
    "name": "ម៉ាន់  កែវ"
  },
  {
    "barcode": "171146459",
    "dpc": "03031717701",
    "name": "ឯល  សារ៉ាត់"
  },
  {
    "barcode": "171146460",
    "dpc": "03031717601",
    "name": "ប៉ិន  ឆុំ"
  },
  {
    "barcode": "171146461",
    "dpc": "03031717501",
    "name": "វែន  លី"
  },
  {
    "barcode": "171146462",
    "dpc": "03031717401",
    "name": "ចាន់  សូវង្ស"
  },
  {
    "barcode": "171146463",
    "dpc": "03031717301",
    "name": "យីវ  ពៅ"
  },
  {
    "barcode": "171146464",
    "dpc": "03031717001",
    "name": "សំ  ណារិន"
  },
  {
    "barcode": "171146465",
    "dpc": "03031717101",
    "name": "ពុធ  កយ ២"
  },
  {
    "barcode": "171146466",
    "dpc": "03031716901",
    "name": "សោម  ហ៊ុន"
  },
  {
    "barcode": "171146467",
    "dpc": "03031717901",
    "name": "អ៊ឹម  ហៃ"
  },
  {
    "barcode": "171146468",
    "dpc": "03031718001",
    "name": "មៀច  សុមន៍"
  },
  {
    "barcode": "171146469",
    "dpc": "03031718101",
    "name": "ផាន់  ស៊ុនបុប្ផា"
  },
  {
    "barcode": "171146470",
    "dpc": "03031718201",
    "name": "លឹម  ឈុនទៀង"
  },
  {
    "barcode": "171146471",
    "dpc": "03031718301",
    "name": "មន្ទីរពត៌មានខេត្ត"
  },
  {
    "barcode": "171146472",
    "dpc": "03031718401",
    "name": "នូវ  យូណា"
  },
  {
    "barcode": "171146473",
    "dpc": "03031718501",
    "name": "ហួន  ហៀង"
  },
  {
    "barcode": "171146474",
    "dpc": "03031718601",
    "name": "គួច  រ៉ុង"
  },
  {
    "barcode": "171146475",
    "dpc": "03031743501",
    "name": "ញ៉យ  សួង"
  },
  {
    "barcode": "171146476",
    "dpc": "03031721701",
    "name": "រស់ ចាន់ថា"
  },
  {
    "barcode": "171146477",
    "dpc": "03031721901",
    "name": "សុខ គឹមសាន"
  },
  {
    "barcode": "171146478",
    "dpc": "03031720301",
    "name": "ហេង ឆាត"
  },
  {
    "barcode": "171146479",
    "dpc": "03031719901",
    "name": "ឆេង សុវណ្ណ"
  },
  {
    "barcode": "171146480",
    "dpc": "03031720001",
    "name": "វត្តដំរីស (កុដិលោកតា)"
  },
  {
    "barcode": "171146481",
    "dpc": "03031719801",
    "name": "វត្តដំរីស (សាលាឆាន់)"
  },
  {
    "barcode": "171146482",
    "dpc": "03031720101",
    "name": "វត្តដំរីស (ខាងត្បូង)"
  },
  {
    "barcode": "171146483",
    "dpc": "03031720201",
    "name": "វត្តដំរីស (កុដិដូនជី)"
  },
  {
    "barcode": "171146484",
    "dpc": "03031721801",
    "name": "សឹន សាន់"
  },
  {
    "barcode": "171146485",
    "dpc": "03031721601",
    "name": "សៅ ម៉ៃ"
  },
  {
    "barcode": "171146486",
    "dpc": "03031721501",
    "name": "គឹម យ៉យ"
  },
  {
    "barcode": "171146487",
    "dpc": "03031721401",
    "name": "មាឃ វៃនី"
  },
  {
    "barcode": "171146488",
    "dpc": "03031722101",
    "name": "សា  វ៉ាត់រ៉ាន់"
  },
  {
    "barcode": "171146489",
    "dpc": "03031721201",
    "name": "ហោ វុទ្ធី"
  },
  {
    "barcode": "171146490",
    "dpc": "03031721101",
    "name": "ម៉ែន ណន"
  },
  {
    "barcode": "171146491",
    "dpc": "03031721001",
    "name": "ម៉ាច គឹមឆាយ"
  },
  {
    "barcode": "171146492",
    "dpc": "03031720901",
    "name": "ជ្រុន ណារិន"
  },
  {
    "barcode": "171146493",
    "dpc": "03031720801",
    "name": "រស់ សាអ៊ីន"
  },
  {
    "barcode": "171146494",
    "dpc": "03031720601",
    "name": "ប្រាក់ បូរាណ"
  },
  {
    "barcode": "171146495",
    "dpc": "03031705201",
    "name": "ផ្លុង វ៉ៃ"
  },
  {
    "barcode": "171146496",
    "dpc": "03031720501",
    "name": "ម៉េង ហ៊ាង"
  },
  {
    "barcode": "171146497",
    "dpc": "03031722301",
    "name": "ហង្ស ម៉ាឡានី"
  },
  {
    "barcode": "171146498",
    "dpc": "03031722501",
    "name": "ហេង ជួង"
  },
  {
    "barcode": "171146499",
    "dpc": "03031722601",
    "name": "ខូវ យូឡុង"
  },
  {
    "barcode": "171146500",
    "dpc": "03031722701",
    "name": "ស៊្រុន   ហុង"
  },
  {
    "barcode": "171146501",
    "dpc": "03031722801",
    "name": "ចិន គឹមទូច"
  },
  {
    "barcode": "171146502",
    "dpc": "03031722901",
    "name": "ជាង សុខុម"
  },
  {
    "barcode": "171146503",
    "dpc": "03031723001",
    "name": "ប៊ុត ទឺ"
  },
  {
    "barcode": "171146504",
    "dpc": "03031723101",
    "name": "ព្រំ ស៊ន់"
  },
  {
    "barcode": "171146505",
    "dpc": "03031723201",
    "name": "កែវ សារុន"
  },
  {
    "barcode": "171146506",
    "dpc": "03031723301",
    "name": "គឹម ស្រេង"
  },
  {
    "barcode": "171146507",
    "dpc": "03031723401",
    "name": "ព្រំ ណូ"
  },
  {
    "barcode": "171146508",
    "dpc": "03031723501",
    "name": "លៀម តាំ"
  },
  {
    "barcode": "171146509",
    "dpc": "03031723601",
    "name": "ស៊ង ធី"
  },
  {
    "barcode": "171146510",
    "dpc": "03031723701",
    "name": "ទន់ ប៊ុនលី"
  },
  {
    "barcode": "171146511",
    "dpc": "03031723801",
    "name": "ខាត់ ថន"
  },
  {
    "barcode": "171146512",
    "dpc": "03031703301",
    "name": "លី  សុគុណ"
  },
  {
    "barcode": "171146513",
    "dpc": "03031705401",
    "name": "សេង  មឿន"
  },
  {
    "barcode": "171146514",
    "dpc": "03031713201",
    "name": "គង់  ស៊ីអេង"
  },
  {
    "barcode": "171146515",
    "dpc": "03031713301",
    "name": "អ៊ុក  កែវដាណា"
  },
  {
    "barcode": "171146516",
    "dpc": "03031713401",
    "name": "ហ៊ុន  ហ៊ាប"
  },
  {
    "barcode": "171146517",
    "dpc": "03031713501",
    "name": "ស៊ឹន  ណាវុធ"
  },
  {
    "barcode": "171146518",
    "dpc": "03031713601",
    "name": "អ៊ឹម  ចាន់រី"
  },
  {
    "barcode": "171146519",
    "dpc": "03031713801",
    "name": "យក់  អឿ ១"
  },
  {
    "barcode": "171146520",
    "dpc": "03031715701",
    "name": "ពុធ  កយ"
  },
  {
    "barcode": "171146521",
    "dpc": "03031715901",
    "name": "ម៉ម  សុភាព ១"
  },
  {
    "barcode": "171146522",
    "dpc": "03031716001",
    "name": "ម៉ម  សុភាព ២"
  },
  {
    "barcode": "171146523",
    "dpc": "03031716501",
    "name": "លី  កៅ"
  },
  {
    "barcode": "171146524",
    "dpc": "03031718701",
    "name": "សូ  សុវត្ថិ"
  },
  {
    "barcode": "171146525",
    "dpc": "03031718801",
    "name": "សោម  សុខា"
  },
  {
    "barcode": "171146526",
    "dpc": "03031719001",
    "name": "ចេង  សាវិត"
  },
  {
    "barcode": "171146527",
    "dpc": "03031719101",
    "name": "គី  រស្មី"
  },
  {
    "barcode": "171146528",
    "dpc": "03031720701",
    "name": "ថាច់  សុវណ្ណផល្លា"
  },
  {
    "barcode": "171146529",
    "dpc": "03031722001",
    "name": "គង់  ឆេងលី"
  },
  {
    "barcode": "171146530",
    "dpc": "03031722201",
    "name": "បាន  ហួត"
  },
  {
    "barcode": "171146531",
    "dpc": "03031722401",
    "name": "ចាត សំបូរ"
  },
  {
    "barcode": "171146532",
    "dpc": "03031728001",
    "name": "ជ័យ  វឌ្ឍនា"
  },
  {
    "barcode": "171146533",
    "dpc": "03031732001",
    "name": "លឹម  អេង"
  },
  {
    "barcode": "171146534",
    "dpc": "03031740701",
    "name": "តាំង  គឹមអ៊ាម"
  },
  {
    "barcode": "171146535",
    "dpc": "03031740801",
    "name": "យ៉ាំ  ស៊ីងហ៊"
  },
  {
    "barcode": "171146536",
    "dpc": "03031740901",
    "name": "ទុយ  វីន"
  },
  {
    "barcode": "171146537",
    "dpc": "03031741001",
    "name": "តាំង  ឈុន ៨"
  },
  {
    "barcode": "171146538",
    "dpc": "03031741101",
    "name": "ហោ  ផល្លា"
  },
  {
    "barcode": "171146539",
    "dpc": "03031741801",
    "name": "កាំង ប៊ុនអេង"
  },
  {
    "barcode": "171146540",
    "dpc": "03031741901",
    "name": "តាន់  គឹមហ៊រ"
  },
  {
    "barcode": "171146541",
    "dpc": "03031742101",
    "name": "តាន់  អេង"
  },
  {
    "barcode": "171146542",
    "dpc": "03031742501",
    "name": "លឹម  ហួត"
  },
  {
    "barcode": "171146543",
    "dpc": "03031742801",
    "name": "យូ  ម៉ៅ"
  },
  {
    "barcode": "171146544",
    "dpc": "03031743001",
    "name": "នង  លីនណា"
  },
  {
    "barcode": "171146545",
    "dpc": "03031743301",
    "name": "ម៉ៅ  សុខុម"
  },
  {
    "barcode": "171146546",
    "dpc": "03031743901",
    "name": "អាត  សាវី"
  },
  {
    "barcode": "171146547",
    "dpc": "03031744601",
    "name": "នៅ  ម៉ាលី"
  },
  {
    "barcode": "171146548",
    "dpc": "03031744701",
    "name": "ហេង  ណេង"
  },
  {
    "barcode": "171146549",
    "dpc": "03031746601",
    "name": "ខៀវ  ខុន"
  },
  {
    "barcode": "171146550",
    "dpc": "03031715001",
    "name": "នៅ  ញិន"
  },
  {
    "barcode": "171146551",
    "dpc": "03031748001",
    "name": "គង់ វឆ័យ"
  }
];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
