let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=

    [
        {
            "barcode": "171136607",
            "dpc": "03041848001",
            "name": "ស៊ុន សូ"
        },
        {
            "barcode": "171136608",
            "dpc": "03041828001",
            "name": "រត្ន  សារ៉ែម"
        },
        {
            "barcode": "171136609",
            "dpc": "03041812001",
            "name": "អ៊ុន  គីជន"
        },
        {
            "barcode": "171136610",
            "dpc": "03041811801",
            "name": "រឿន  រ៉េត"
        },
        {
            "barcode": "171136611",
            "dpc": "03041805301",
            "name": "ប៊ូ   ណាវី"
        },
        {
            "barcode": "171136612",
            "dpc": "03041805201",
            "name": "ប៊ូ  លាង"
        },
        {
            "barcode": "171136613",
            "dpc": "03041804901",
            "name": "លឹម  តុង"
        },
        {
            "barcode": "171136614",
            "dpc": "03041802901",
            "name": "ជូ  តឹក"
        },
        {
            "barcode": "171136615",
            "dpc": "03041831001",
            "name": "ម៉ម នាង"
        },
        {
            "barcode": "171136616",
            "dpc": "03041831101",
            "name": "ប្រាក់ សាលឿត"
        },
        {
            "barcode": "171136617",
            "dpc": "03041831201",
            "name": "ជី ខេង"
        },
        {
            "barcode": "171136618",
            "dpc": "03041831301",
            "name": "ផែ ប៊ុនឡុង"
        },
        {
            "barcode": "171136619",
            "dpc": "03041831401",
            "name": "ឆិវ សុខឡេង"
        },
        {
            "barcode": "171136620",
            "dpc": "03041831501",
            "name": "ទូច សេន"
        },
        {
            "barcode": "171136621",
            "dpc": "03041831601",
            "name": "ព្រីង បញ្ញារិទ្ធ"
        },
        {
            "barcode": "171136622",
            "dpc": "03041831701",
            "name": "ដន លន់"
        },
        {
            "barcode": "171136623",
            "dpc": "03041831801",
            "name": "លឿង លៀង"
        },
        {
            "barcode": "171136624",
            "dpc": "03041825201",
            "name": "សុខ ចំរើន"
        },
        {
            "barcode": "171136625",
            "dpc": "03041832401",
            "name": "សឿរ សុខុម"
        },
        {
            "barcode": "171136626",
            "dpc": "03041832301",
            "name": "ប៉ាង វុទ្ធី"
        },
        {
            "barcode": "171136627",
            "dpc": "03041832201",
            "name": "លឿង ណាវី"
        },
        {
            "barcode": "171136628",
            "dpc": "03041832001",
            "name": "ហួន សារ៉ាយ"
        },
        {
            "barcode": "171136629",
            "dpc": "03041832501",
            "name": "ដុះ ឈួម"
        },
        {
            "barcode": "171136630",
            "dpc": "03041832601",
            "name": "ទៀង មុនីរដ្ឋា"
        },
        {
            "barcode": "171136631",
            "dpc": "03041832801",
            "name": "ផុន ប្រុស"
        },
        {
            "barcode": "171136632",
            "dpc": "03041832901",
            "name": "ខាំ ឈៀង"
        },
        {
            "barcode": "171136633",
            "dpc": "03041833001",
            "name": "នៅ បុល"
        },
        {
            "barcode": "171136634",
            "dpc": "03041833201",
            "name": "អ៊ុក ឃ្នួច ១"
        },
        {
            "barcode": "171136635",
            "dpc": "03041833301",
            "name": "អ៊ុក ឃ្នួច ២"
        },
        {
            "barcode": "171136636",
            "dpc": "03041833401",
            "name": "ខាវ ហួត"
        },
        {
            "barcode": "171136637",
            "dpc": "03041833501",
            "name": "កាក់ សុខា"
        },
        {
            "barcode": "171136638",
            "dpc": "03041833601",
            "name": "ស៊ាង ហ៊ួត"
        },
        {
            "barcode": "171136639",
            "dpc": "03041833701",
            "name": "ហ៊ាង ថុង"
        },
        {
            "barcode": "171136640",
            "dpc": "03041833801",
            "name": "អ៊ិត វុទ្ធី"
        },
        {
            "barcode": "171136641",
            "dpc": "03041833901",
            "name": "ស៊ុំ លឹម"
        },
        {
            "barcode": "171136642",
            "dpc": "03041834101",
            "name": "តឹង អៀង"
        },
        {
            "barcode": "171136643",
            "dpc": "03041834201",
            "name": "លាង សំអ៊ុល"
        },
        {
            "barcode": "171136644",
            "dpc": "03041834301",
            "name": "សាន ហឿម"
        },
        {
            "barcode": "171136645",
            "dpc": "03041834401",
            "name": "វ៉ាន់ ប៊ុនធៀប"
        },
        {
            "barcode": "171136646",
            "dpc": "03041834501",
            "name": "ធាង  ណុង"
        },
        {
            "barcode": "171136647",
            "dpc": "03041834601",
            "name": "ស៊ុន គឹមថៃ"
        },
        {
            "barcode": "171136648",
            "dpc": "03041819801",
            "name": "សែស សារ៉ុម"
        },
        {
            "barcode": "171136649",
            "dpc": "03041834701",
            "name": "អ៊ុត ណែ"
        },
        {
            "barcode": "171136650",
            "dpc": "03041834801",
            "name": "ម៉ៅ មើរ"
        },
        {
            "barcode": "171136651",
            "dpc": "03041834901",
            "name": "លឿង សុវណ្ណា"
        },
        {
            "barcode": "171136652",
            "dpc": "03041835001",
            "name": "អ៊ឹម សុខឿន"
        },
        {
            "barcode": "171136653",
            "dpc": "03041835101",
            "name": "គឹម វណ្ណឌី"
        },
        {
            "barcode": "171136654",
            "dpc": "03041835201",
            "name": "ប្រាក់ យូ"
        },
        {
            "barcode": "171136655",
            "dpc": "03041835301",
            "name": "អ៊ុក វាសនា"
        },
        {
            "barcode": "171136656",
            "dpc": "03041835401",
            "name": "លឿង សុឃីម"
        },
        {
            "barcode": "171136657",
            "dpc": "03041835501",
            "name": "ជា  វណ្ណារិទ្ធ"
        },
        {
            "barcode": "171136658",
            "dpc": "03041835701",
            "name": "ស៊ឹម ប៊ុនធឿន"
        },
        {
            "barcode": "171136659",
            "dpc": "03041835801",
            "name": "ឃុត អ៊ឹង"
        },
        {
            "barcode": "171136660",
            "dpc": "03041835901",
            "name": "អ៊ុក ចន្ថា"
        },
        {
            "barcode": "171136661",
            "dpc": "03041836001",
            "name": "សុខ គឹមសួរ"
        },
        {
            "barcode": "171136662",
            "dpc": "03041836101",
            "name": "អ៊ីវ កុលស្ស"
        },
        {
            "barcode": "171136663",
            "dpc": "03041836201",
            "name": "កែវ នីម"
        },
        {
            "barcode": "171136664",
            "dpc": "03041836301",
            "name": "ឌី ថារី"
        },
        {
            "barcode": "171136665",
            "dpc": "03041836501",
            "name": "អ៊ុក គឹម"
        },
        {
            "barcode": "171136666",
            "dpc": "03041836601",
            "name": "នាង រដ្ឋា"
        },
        {
            "barcode": "171136667",
            "dpc": "03041836801",
            "name": "ធឹង គឹមហេង១"
        },
        {
            "barcode": "171136668",
            "dpc": "03041837801",
            "name": "អ៊ុំ សុខា"
        },
        {
            "barcode": "171136669",
            "dpc": "03041837701",
            "name": "គង់ សំភ័ស្ស"
        },
        {
            "barcode": "171136670",
            "dpc": "03041837601",
            "name": "អៀម ដានី"
        },
        {
            "barcode": "171136671",
            "dpc": "03041837501",
            "name": "សេង ពៅ"
        },
        {
            "barcode": "171136672",
            "dpc": "03041837401",
            "name": "សោម មុន្នីរ័ត្ន"
        },
        {
            "barcode": "171136673",
            "dpc": "03041837301",
            "name": "សួន សាវិញ"
        },
        {
            "barcode": "171136674",
            "dpc": "03041837101",
            "name": "ម៉ិល សុផល"
        },
        {
            "barcode": "171136675",
            "dpc": "03041802601",
            "name": "ឡែន សំអាត"
        },
        {
            "barcode": "171136676",
            "dpc": "03041837001",
            "name": "សេង សុវត្ថិឌី"
        },
        {
            "barcode": "171136677",
            "dpc": "03041836901",
            "name": "សេង សុខា"
        },
        {
            "barcode": "171136678",
            "dpc": "03041802101",
            "name": "លឹម ប៊ុនហេង"
        },
        {
            "barcode": "171136679",
            "dpc": "03041837901",
            "name": "ស៊ុន សុវណ្ណ"
        },
        {
            "barcode": "171136680",
            "dpc": "03041838001",
            "name": "ខឹម  សាមុត៉ុ"
        },
        {
            "barcode": "171136681",
            "dpc": "03041838101",
            "name": "សាប់ គឹមឆម"
        },
        {
            "barcode": "171136682",
            "dpc": "03041838201",
            "name": "អ៊ឹង ឡាយហ៊ក"
        },
        {
            "barcode": "171136683",
            "dpc": "03041838301",
            "name": "ជុំ ពោ"
        },
        {
            "barcode": "171136684",
            "dpc": "03041830101",
            "name": "ម៉ុង ហោ"
        },
        {
            "barcode": "171136685",
            "dpc": "03041830201",
            "name": "សែម សុគន្ធា"
        },
        {
            "barcode": "171136686",
            "dpc": "03041830401",
            "name": "ញ៉ែម រ៉ានី"
        },
        {
            "barcode": "171136687",
            "dpc": "03041837201",
            "name": "ហ្វីលីពីនបាហាយ"
        },
        {
            "barcode": "171136688",
            "dpc": "03041830601",
            "name": "ជា វិឆ្ឆ័យ"
        },
        {
            "barcode": "171136689",
            "dpc": "03041830501",
            "name": "សុង ឈុនលី"
        },
        {
            "barcode": "171136690",
            "dpc": "03041830801",
            "name": "ជា សារិន"
        },
        {
            "barcode": "171136691",
            "dpc": "03041830701",
            "name": "តាម វៃ"
        },
        {
            "barcode": "171136692",
            "dpc": "03041830901",
            "name": "ស៊ីន ឃន ២"
        },
        {
            "barcode": "171136693",
            "dpc": "03041830001",
            "name": "ម៉ៅ មឿង"
        },
        {
            "barcode": "171136694",
            "dpc": "03041829901",
            "name": "គូ សុងលី"
        },
        {
            "barcode": "171136695",
            "dpc": "03041829801",
            "name": "ផា រឿន"
        },
        {
            "barcode": "171136696",
            "dpc": "03041829601",
            "name": "យៀម សុផាត"
        },
        {
            "barcode": "171136697",
            "dpc": "03041829401",
            "name": "ឆាយ សុធា"
        },
        {
            "barcode": "171136698",
            "dpc": "03041829101",
            "name": "ជិត សុខា"
        },
        {
            "barcode": "171136699",
            "dpc": "03041829001",
            "name": "ម៉ែន សុវណ្ណ"
        },
        {
            "barcode": "171136700",
            "dpc": "03041828901",
            "name": "រស់ ហឿន"
        },
        {
            "barcode": "171136701",
            "dpc": "03041827901",
            "name": "គ្រាល សុភាព"
        },
        {
            "barcode": "171136702",
            "dpc": "03041827701",
            "name": "សួន  គឿន"
        },
        {
            "barcode": "171136703",
            "dpc": "03041827601",
            "name": "លន់ ប៊ុនឡេង"
        },
        {
            "barcode": "171136704",
            "dpc": "03041827501",
            "name": "សួន រិទ្ធី"
        },
        {
            "barcode": "171136705",
            "dpc": "03041829201",
            "name": "រ៉ែ សានិតា"
        },
        {
            "barcode": "171136706",
            "dpc": "03041827301",
            "name": "ច័ន្ទ  ស៊ីឡា"
        },
        {
            "barcode": "171136707",
            "dpc": "03041827201",
            "name": "យ៉ាង វ៉ាន់ហេង"
        },
        {
            "barcode": "171136708",
            "dpc": "03041827101",
            "name": "ហូយ  ចាន់ឌី"
        },
        {
            "barcode": "171136709",
            "dpc": "03041806701",
            "name": "ម៉ោញ សារ៉ាត់"
        },
        {
            "barcode": "171136710",
            "dpc": "03041827001",
            "name": "ប៊ូ ប៊ុនណាត"
        },
        {
            "barcode": "171136711",
            "dpc": "03041826901",
            "name": "អ៊ីវ រតនា"
        },
        {
            "barcode": "171136712",
            "dpc": "03041826801",
            "name": "ទៀង គឹមហេង"
        },
        {
            "barcode": "171136713",
            "dpc": "03041826701",
            "name": "តឹប  ហូវ"
        },
        {
            "barcode": "171136714",
            "dpc": "03041826601",
            "name": "អ៊ី អ៊ារ"
        },
        {
            "barcode": "171136715",
            "dpc": "03041826501",
            "name": "យឺន វាសនា"
        },
        {
            "barcode": "171136716",
            "dpc": "03041826301",
            "name": "ក្រិទ្ធ រិន"
        },
        {
            "barcode": "171136717",
            "dpc": "03041826201",
            "name": "ឆូយចំរើន"
        },
        {
            "barcode": "171136718",
            "dpc": "03041826101",
            "name": "ឃឹម ទិព្វមុនី"
        },
        {
            "barcode": "171136719",
            "dpc": "03041826001",
            "name": "ហម ភីរ៉ាត់"
        },
        {
            "barcode": "171136720",
            "dpc": "03041825901",
            "name": "ទូច សុម៉ាលី"
        },
        {
            "barcode": "171136721",
            "dpc": "03041825801",
            "name": "វ៉ាត វ៉ាន់ឆែ"
        },
        {
            "barcode": "171136722",
            "dpc": "03041825701",
            "name": "ឆាំ រ័ត្នជិគារ"
        },
        {
            "barcode": "171136723",
            "dpc": "03041825601",
            "name": "ឡុង សារឿន"
        },
        {
            "barcode": "171136724",
            "dpc": "03041825501",
            "name": "គុជ ស៊ីណា"
        },
        {
            "barcode": "171136725",
            "dpc": "03041825401",
            "name": "ហ៊ុយ វិចិត្រ"
        },
        {
            "barcode": "171136726",
            "dpc": "03041825301",
            "name": "ខៀវ ប៊ុនរឿប"
        },
        {
            "barcode": "171136727",
            "dpc": "03041825101",
            "name": "សួន សិលា"
        },
        {
            "barcode": "171136728",
            "dpc": "03041825001",
            "name": "ចាន់ សុធី"
        },
        {
            "barcode": "171136729",
            "dpc": "03041824901",
            "name": "យឹន  រឿប"
        },
        {
            "barcode": "171136730",
            "dpc": "03041824801",
            "name": "ចាន់ ឬទ្ធី"
        },
        {
            "barcode": "171136731",
            "dpc": "03041824701",
            "name": "ចាប ធូ"
        },
        {
            "barcode": "171136732",
            "dpc": "03041824601",
            "name": "ម៉ី ពៅ"
        },
        {
            "barcode": "171136733",
            "dpc": "03041824501",
            "name": "ខៀវ រ៉ាហ្វី"
        },
        {
            "barcode": "171136734",
            "dpc": "03041824401",
            "name": "សុខ គង់ ២"
        },
        {
            "barcode": "171136735",
            "dpc": "03041824301",
            "name": "លី ប៊ុនហេង"
        },
        {
            "barcode": "171136736",
            "dpc": "03041824201",
            "name": "ស៊ឹម ណាលី"
        },
        {
            "barcode": "171136737",
            "dpc": "03041824101",
            "name": "វិហារជិការអិល"
        },
        {
            "barcode": "171136738",
            "dpc": "03041824001",
            "name": "អ៊ិន តាំ"
        },
        {
            "barcode": "171136739",
            "dpc": "03041823901",
            "name": "សុខ គង់ ១"
        },
        {
            "barcode": "171136740",
            "dpc": "03041823801",
            "name": "ខៀវ រ៉ាហ្វី ២"
        },
        {
            "barcode": "171136741",
            "dpc": "03041823701",
            "name": "ភោគ ភាព"
        },
        {
            "barcode": "171136742",
            "dpc": "03041823601",
            "name": "វង្ស វ៉ាន់ណាវី"
        },
        {
            "barcode": "171136743",
            "dpc": "03041823501",
            "name": "វ៉ាន់ វីរៈ"
        },
        {
            "barcode": "171136744",
            "dpc": "03041823301",
            "name": "ដន លន់ ១"
        },
        {
            "barcode": "171136745",
            "dpc": "03041823201",
            "name": "គុយ  ថុល"
        },
        {
            "barcode": "171136746",
            "dpc": "03041823001",
            "name": "ទៀវ សឿម"
        },
        {
            "barcode": "171136747",
            "dpc": "03041822901",
            "name": "ឃុត ចាន់ដារ៉ា"
        },
        {
            "barcode": "171136748",
            "dpc": "03041822801",
            "name": "ហ៊ាន ប៊ុនធឿម"
        },
        {
            "barcode": "171136749",
            "dpc": "03041822601",
            "name": "មាឃ ម៉ារិន"
        },
        {
            "barcode": "171136750",
            "dpc": "03041822501",
            "name": "សុខ ណាគ្រី"
        },
        {
            "barcode": "171136751",
            "dpc": "03041822401",
            "name": "អ៊ឹង សុន្ធា"
        },
        {
            "barcode": "171136752",
            "dpc": "03041822301",
            "name": "សរ  ខាន់ថន"
        },
        {
            "barcode": "171136753",
            "dpc": "03041828201",
            "name": "ហ៊ាន ហ៊ឺម ២"
        },
        {
            "barcode": "171136754",
            "dpc": "03041822201",
            "name": "យាំ យ៉េត ១"
        },
        {
            "barcode": "171136755",
            "dpc": "03041822101",
            "name": "តឹក ប៊ុនឡុង"
        },
        {
            "barcode": "171136756",
            "dpc": "03041822001",
            "name": "ជួន  ហុង"
        },
        {
            "barcode": "171136757",
            "dpc": "03041821901",
            "name": "ហោ ហៀប"
        },
        {
            "barcode": "171136758",
            "dpc": "03041821801",
            "name": "ម៉ៅ សាវី"
        },
        {
            "barcode": "171136759",
            "dpc": "03041821701",
            "name": "ផេង សារុំ"
        },
        {
            "barcode": "171136760",
            "dpc": "03041821601",
            "name": "យង់   ទីណូ"
        },
        {
            "barcode": "171136761",
            "dpc": "03041821501",
            "name": "ព្រះវិហារចិន"
        },
        {
            "barcode": "171136762",
            "dpc": "03041802701",
            "name": "ញឹក សុផាណារ៉ាក់"
        },
        {
            "barcode": "171136763",
            "dpc": "03041821401",
            "name": "តូច លក្ខិណា"
        },
        {
            "barcode": "171136764",
            "dpc": "03041821201",
            "name": "កេស សលផល"
        },
        {
            "barcode": "171136765",
            "dpc": "03041821101",
            "name": "កេះ សោភ័ណ្ឌ ១"
        },
        {
            "barcode": "171136766",
            "dpc": "03041821001",
            "name": "ផាន់ វិបុល"
        },
        {
            "barcode": "171136767",
            "dpc": "03041820801",
            "name": "ចៅ យឿត"
        },
        {
            "barcode": "171136768",
            "dpc": "03041820701",
            "name": "ប៉ុល សាវុធ"
        },
        {
            "barcode": "171136769",
            "dpc": "03041820601",
            "name": "ធី ២"
        },
        {
            "barcode": "171136770",
            "dpc": "03041820501",
            "name": "ធី ១"
        },
        {
            "barcode": "171136771",
            "dpc": "03041820401",
            "name": "អ៊ី ប៊ុនរឿន"
        },
        {
            "barcode": "171136772",
            "dpc": "03041820301",
            "name": "ប៊ុន អើយកេះ"
        },
        {
            "barcode": "171136773",
            "dpc": "03041820201",
            "name": "មាស សារ៉ាត់"
        },
        {
            "barcode": "171136774",
            "dpc": "03041820101",
            "name": "ម៉ុត សាវិវណ្ណា"
        },
        {
            "barcode": "171136775",
            "dpc": "03041820001",
            "name": "កេះ ប៊ុនអើយ ១"
        },
        {
            "barcode": "171136776",
            "dpc": "03041819701",
            "name": "ឆឺន ផាន"
        },
        {
            "barcode": "171136777",
            "dpc": "03041819501",
            "name": "មុំវិសិទ្ធ"
        },
        {
            "barcode": "171136778",
            "dpc": "03041819401",
            "name": "សុខ គន្ធី ២"
        },
        {
            "barcode": "171136779",
            "dpc": "03041819301",
            "name": "ប៉ាល់ ពៅ"
        },
        {
            "barcode": "171136780",
            "dpc": "03041819101",
            "name": "កាន់ សុគន្ធ"
        },
        {
            "barcode": "171136781",
            "dpc": "03041819001",
            "name": "រស់ សុទ្ធ"
        },
        {
            "barcode": "171136782",
            "dpc": "03041818901",
            "name": "ហ៊ុយ គឹមថេត"
        },
        {
            "barcode": "171136783",
            "dpc": "03041818801",
            "name": "ហួ  សុផា"
        },
        {
            "barcode": "171136784",
            "dpc": "03041818701",
            "name": "ឈុន ង៉ោ"
        },
        {
            "barcode": "171136785",
            "dpc": "03041817501",
            "name": "សាយ ចំរើន"
        },
        {
            "barcode": "171136786",
            "dpc": "03041817601",
            "name": "កង សារ៉េន"
        },
        {
            "barcode": "171136787",
            "dpc": "03041817901",
            "name": "គង់ វុត្ថា"
        },
        {
            "barcode": "171136788",
            "dpc": "03041818301",
            "name": "ឡុង ម្លិះ"
        },
        {
            "barcode": "171136789",
            "dpc": "03041818401",
            "name": "ម៉ី យានឈុន"
        },
        {
            "barcode": "171136790",
            "dpc": "03041818501",
            "name": "ទិត ផល្លី"
        },
        {
            "barcode": "171136791",
            "dpc": "03041818601",
            "name": "អ៊ូច សាឡូន"
        },
        {
            "barcode": "171136792",
            "dpc": "03041818201",
            "name": "សាំង អ៊ាង"
        },
        {
            "barcode": "171136793",
            "dpc": "03041818101",
            "name": "សុខ គឹមអេង"
        },
        {
            "barcode": "171136794",
            "dpc": "03041818001",
            "name": "បេង លន់"
        },
        {
            "barcode": "171136795",
            "dpc": "03041817401",
            "name": "ប្រាក់ សាលឿត"
        },
        {
            "barcode": "171136796",
            "dpc": "03041817301",
            "name": "ឱ  ព្រឿង"
        },
        {
            "barcode": "171136797",
            "dpc": "03041804301",
            "name": "កេតុ សឿ"
        },
        {
            "barcode": "171136798",
            "dpc": "03041804401",
            "name": "តុប សារុន"
        },
        {
            "barcode": "171136799",
            "dpc": "03041804601",
            "name": "កៅ អៀងឡាយ"
        },
        {
            "barcode": "171136800",
            "dpc": "03041805001",
            "name": "យាំ វ៉ិត"
        },
        {
            "barcode": "171136801",
            "dpc": "03041805401",
            "name": "សៅ អ៊ុល"
        },
        {
            "barcode": "171136802",
            "dpc": "03041805701",
            "name": "សាម ប៊ុនធឿន"
        },
        {
            "barcode": "171136803",
            "dpc": "03041806201",
            "name": "យឹន  វឹង"
        },
        {
            "barcode": "171136804",
            "dpc": "03041806401",
            "name": "ហ្វាន់ ទី"
        },
        {
            "barcode": "171136805",
            "dpc": "03041806601",
            "name": "សុខ លន់"
        },
        {
            "barcode": "171136806",
            "dpc": "03041806801",
            "name": "ជិន ហ៊ាង"
        },
        {
            "barcode": "171136807",
            "dpc": "03041807001",
            "name": "យឹម វណ្ណថន"
        },
        {
            "barcode": "171136808",
            "dpc": "03041806901",
            "name": "ជី ឃីម"
        },
        {
            "barcode": "171136809",
            "dpc": "03041807101",
            "name": "សយ ផា"
        },
        {
            "barcode": "171136810",
            "dpc": "03041802801",
            "name": "លឹម កែវធី"
        },
        {
            "barcode": "171136811",
            "dpc": "03041806501",
            "name": "ខា ហេង"
        },
        {
            "barcode": "171136812",
            "dpc": "03041806301",
            "name": "ខាន់ មាណេ"
        },
        {
            "barcode": "171136813",
            "dpc": "03041806101",
            "name": "ឡុង ចន្ថា"
        },
        {
            "barcode": "171136814",
            "dpc": "03041806001",
            "name": "កែវ សំណាង"
        },
        {
            "barcode": "171136815",
            "dpc": "03041805901",
            "name": "ស៊ាន ផា"
        },
        {
            "barcode": "171136816",
            "dpc": "03041804701",
            "name": "ចៅ យីថង"
        },
        {
            "barcode": "171136817",
            "dpc": "03041805601",
            "name": "ទួន សុផល"
        },
        {
            "barcode": "171136818",
            "dpc": "03041805501",
            "name": "ព្រំ ណូ"
        },
        {
            "barcode": "171136819",
            "dpc": "03041805801",
            "name": "សុខ ចាន់មន្នី"
        },
        {
            "barcode": "171136820",
            "dpc": "03041804801",
            "name": "យ៉ាំ ឃួង"
        },
        {
            "barcode": "171136821",
            "dpc": "03041804501",
            "name": "ហេង ចាន់ថានី"
        },
        {
            "barcode": "171136822",
            "dpc": "03041804201",
            "name": "ជា ផល"
        },
        {
            "barcode": "171136823",
            "dpc": "03041804101",
            "name": "ហ៊ុត សុភាព"
        },
        {
            "barcode": "171136824",
            "dpc": "03041804001",
            "name": "សាយ ហាក់ស្រ៊ុន"
        },
        {
            "barcode": "171136825",
            "dpc": "03041803901",
            "name": "តុក គឹមសួរ"
        },
        {
            "barcode": "171136826",
            "dpc": "03041803801",
            "name": "ភួង សាវុធ"
        },
        {
            "barcode": "171136827",
            "dpc": "03041803701",
            "name": "គឹម គា"
        },
        {
            "barcode": "171136828",
            "dpc": "03041803601",
            "name": "គង់ សុខម៉េង"
        },
        {
            "barcode": "171136829",
            "dpc": "03041803501",
            "name": "កែវ ធី ៧៣"
        },
        {
            "barcode": "171136830",
            "dpc": "03041803401",
            "name": "ណុប សាមិ"
        },
        {
            "barcode": "171136831",
            "dpc": "03041803101",
            "name": "ធួន រ៉ាវុធ"
        },
        {
            "barcode": "171136832",
            "dpc": "03041803001",
            "name": "ស៊ាង មួយ"
        },
        {
            "barcode": "171136833",
            "dpc": "03041812601",
            "name": "អង្គការ អេ.អ.អឹម"
        },
        {
            "barcode": "171136834",
            "dpc": "03041802501",
            "name": "អៀម ធាម"
        },
        {
            "barcode": "171136835",
            "dpc": "03041802401",
            "name": "លឹម ស៊ុយសុវត្ថា"
        },
        {
            "barcode": "171136836",
            "dpc": "03041802001",
            "name": "អែត ហ្វូត ៣"
        },
        {
            "barcode": "171136837",
            "dpc": "03041801901",
            "name": "វ៉ែន ហុក"
        },
        {
            "barcode": "171136838",
            "dpc": "03041801801",
            "name": "សន សុខ២"
        },
        {
            "barcode": "171136839",
            "dpc": "03041801701",
            "name": "សន សុខ១"
        },
        {
            "barcode": "171136840",
            "dpc": "03041801301",
            "name": "ជា សង្ខារសរីវឌ្ឍ"
        },
        {
            "barcode": "171136841",
            "dpc": "03041801201",
            "name": "រស់ សាអ៊ីន"
        },
        {
            "barcode": "171136842",
            "dpc": "03041801101",
            "name": "លាង  ថុល ១"
        },
        {
            "barcode": "171136843",
            "dpc": "03041801001",
            "name": "សុខ សារ៉ូ"
        },
        {
            "barcode": "171136844",
            "dpc": "03041800901",
            "name": "ម៉ែន ញ៉ល"
        },
        {
            "barcode": "171136845",
            "dpc": "03041800801",
            "name": "អាត់ សាវ៉ន"
        },
        {
            "barcode": "171136846",
            "dpc": "03041800601",
            "name": "កាំមីតែល"
        },
        {
            "barcode": "171136847",
            "dpc": "03041800501",
            "name": "ក្រុមហ៊ុនម៉ូបីតែល"
        },
        {
            "barcode": "171136848",
            "dpc": "03041800401",
            "name": "ទូរគមនាគមន៍"
        },
        {
            "barcode": "171136849",
            "dpc": "03041800301",
            "name": "ឃុត អារឌី"
        },
        {
            "barcode": "171136850",
            "dpc": "03041800201",
            "name": "មាស សាយ"
        },
        {
            "barcode": "171136851",
            "dpc": "03041800101",
            "name": "គឹម  សំបូរ"
        },
        {
            "barcode": "171136852",
            "dpc": "03041801401",
            "name": "ហូ ឡាយ"
        },
        {
            "barcode": "171136853",
            "dpc": "03041801501",
            "name": "សំ  សុខ"
        },
        {
            "barcode": "171136854",
            "dpc": "03041801601",
            "name": "ហម ញង"
        },
        {
            "barcode": "171136855",
            "dpc": "03041846001",
            "name": "ជ័យ  សារិទ្ធ"
        },
        {
            "barcode": "171136856",
            "dpc": "03041845301",
            "name": "ទិត  វ៉ាន"
        },
        {
            "barcode": "171136857",
            "dpc": "03041844001",
            "name": "ម៉ែន  ស៊ី"
        },
        {
            "barcode": "171136858",
            "dpc": "03041838401",
            "name": "ឆាន់   សុជាតិ"
        },
        {
            "barcode": "171136859",
            "dpc": "03041829701",
            "name": "អ៊ូ  ដាវី"
        },
        {
            "barcode": "171136860",
            "dpc": "03041828701",
            "name": "ស៊ុយ  ជុក"
        },
        {
            "barcode": "171136861",
            "dpc": "03041828601",
            "name": "ព្រំ  ណូ"
        },
        {
            "barcode": "171136862",
            "dpc": "03041845901",
            "name": "ឆន  ប៊ុនថន"
        },
        {
            "barcode": "171136863",
            "dpc": "03041845801",
            "name": "ពៅ ប៊ុនថុន"
        },
        {
            "barcode": "171136864",
            "dpc": "03041845701",
            "name": "កែវ សុខា"
        },
        {
            "barcode": "171136865",
            "dpc": "03041845601",
            "name": "ឡូត សឿត"
        },
        {
            "barcode": "171136866",
            "dpc": "03041845501",
            "name": "អ៊ុំ ធឿន"
        },
        {
            "barcode": "171136867",
            "dpc": "03041845401",
            "name": "អោ ថុង"
        },
        {
            "barcode": "171136868",
            "dpc": "03041845101",
            "name": "សូយ ប៊ុនហឿន"
        },
        {
            "barcode": "171136869",
            "dpc": "03041845001",
            "name": "ណុប ម៉ៅ"
        },
        {
            "barcode": "171136870",
            "dpc": "03041844901",
            "name": "វូច ស្រេង"
        },
        {
            "barcode": "171136871",
            "dpc": "03041844801",
            "name": "អ៊ុក លី"
        },
        {
            "barcode": "171136872",
            "dpc": "03041844701",
            "name": "សុខ ប៉ុន"
        },
        {
            "barcode": "171136873",
            "dpc": "03041844601",
            "name": "សេង ប៊ុនហេង"
        },
        {
            "barcode": "171136874",
            "dpc": "03041844501",
            "name": "ទឹម សាម៉ី"
        },
        {
            "barcode": "171136875",
            "dpc": "03041844301",
            "name": "ឈុន ចំរើន"
        },
        {
            "barcode": "171136876",
            "dpc": "03041844201",
            "name": "ឈុន សម្ភស្ស"
        },
        {
            "barcode": "171136877",
            "dpc": "03041844101",
            "name": "ជា ចំរើន"
        },
        {
            "barcode": "171136878",
            "dpc": "03041843901",
            "name": "នេត ផល្លី"
        },
        {
            "barcode": "171136879",
            "dpc": "03041843801",
            "name": "សាំង ស៊ីវន"
        },
        {
            "barcode": "171136880",
            "dpc": "03041843601",
            "name": "ផន ថន"
        },
        {
            "barcode": "171136881",
            "dpc": "03041843501",
            "name": "ប៉ែន សារ៉ាត់"
        },
        {
            "barcode": "171136882",
            "dpc": "03041843401",
            "name": "ឆាន់ ណារ័ត្ន"
        },
        {
            "barcode": "171136883",
            "dpc": "03041843301",
            "name": "ស៊ិន សុផល"
        },
        {
            "barcode": "171136884",
            "dpc": "03041843201",
            "name": "មិន សាអែម"
        },
        {
            "barcode": "171136885",
            "dpc": "03041843101",
            "name": "គួច ហុង"
        },
        {
            "barcode": "171136886",
            "dpc": "03041843001",
            "name": "សូ មុន្នី"
        },
        {
            "barcode": "171136887",
            "dpc": "03041842901",
            "name": "ម៉ែន បូរី"
        },
        {
            "barcode": "171136888",
            "dpc": "03041842801",
            "name": "ស្រី ប៊ុនធឿន"
        },
        {
            "barcode": "171136889",
            "dpc": "03041842701",
            "name": "លន់ ឡូន"
        },
        {
            "barcode": "171136890",
            "dpc": "03041842601",
            "name": "ឌួង លី"
        },
        {
            "barcode": "171136891",
            "dpc": "03041842501",
            "name": "ណុប តុល"
        },
        {
            "barcode": "171136892",
            "dpc": "03041842401",
            "name": "ឈុំ ពុធ"
        },
        {
            "barcode": "171136893",
            "dpc": "03041842301",
            "name": "អ៊ូ សៀក"
        },
        {
            "barcode": "171136894",
            "dpc": "03041842201",
            "name": "អេ សារុំ"
        },
        {
            "barcode": "171136895",
            "dpc": "03041841101",
            "name": "ណុប ចាន់ជីនា"
        },
        {
            "barcode": "171136896",
            "dpc": "03041842101",
            "name": "ស៊ូ  ដាក់"
        },
        {
            "barcode": "171136897",
            "dpc": "03041842001",
            "name": "លឹម ជៀន"
        },
        {
            "barcode": "171136898",
            "dpc": "03041841901",
            "name": "ស្វាយ ពៅ"
        },
        {
            "barcode": "171136899",
            "dpc": "03041841801",
            "name": "ងូវ  ឈាង"
        },
        {
            "barcode": "171136900",
            "dpc": "03041841701",
            "name": "អ៊ិន ថៃលី"
        },
        {
            "barcode": "171136901",
            "dpc": "03041841601",
            "name": "អេង ផល្លា"
        },
        {
            "barcode": "171136902",
            "dpc": "03041841501",
            "name": "ជ័យ ធីដា"
        },
        {
            "barcode": "171136903",
            "dpc": "03041841401",
            "name": "កែវ ចន្ថា"
        },
        {
            "barcode": "171136904",
            "dpc": "03041841301",
            "name": "លី ប៊ុន"
        },
        {
            "barcode": "171136905",
            "dpc": "03041841201",
            "name": "ប្រាក់ កេះ"
        },
        {
            "barcode": "171136906",
            "dpc": "03041841001",
            "name": "ឈួន គឹមលៀន"
        },
        {
            "barcode": "171136907",
            "dpc": "03041840901",
            "name": "ហុល  វ៉ាន់ណារូ"
        },
        {
            "barcode": "171136908",
            "dpc": "03041840801",
            "name": "ឡេង វិសាល"
        },
        {
            "barcode": "171136909",
            "dpc": "03041840701",
            "name": "អៀវ  តេង"
        },
        {
            "barcode": "171136910",
            "dpc": "03041840601",
            "name": "ជា ម៉ារីយ៉ាន"
        },
        {
            "barcode": "171136911",
            "dpc": "03041840501",
            "name": "រ៉ាន់ ម៉ៅ"
        },
        {
            "barcode": "171136912",
            "dpc": "03041840401",
            "name": "រ៉ាន់ ដារី"
        },
        {
            "barcode": "171136913",
            "dpc": "03041840301",
            "name": "រិន រួម"
        },
        {
            "barcode": "171136914",
            "dpc": "03041840101",
            "name": "យស ពៅ"
        },
        {
            "barcode": "171136915",
            "dpc": "03041840001",
            "name": "ស  សុរិទ្ធ"
        },
        {
            "barcode": "171136916",
            "dpc": "03041839901",
            "name": "លី វិចិត្រ"
        },
        {
            "barcode": "171136917",
            "dpc": "03041839701",
            "name": "តុង ម៉ៅ"
        },
        {
            "barcode": "171136918",
            "dpc": "03041839601",
            "name": "ទង ស៊្រី"
        },
        {
            "barcode": "171136919",
            "dpc": "03041839501",
            "name": "ហ៊ីង ឡាង"
        },
        {
            "barcode": "171136920",
            "dpc": "03041839401",
            "name": "អ៊ូ សុដារិទ្ធ"
        },
        {
            "barcode": "171136921",
            "dpc": "03041839301",
            "name": "ឡេង ហន"
        },
        {
            "barcode": "171136922",
            "dpc": "03041839201",
            "name": "យូ ហេងស្រេង"
        },
        {
            "barcode": "171136923",
            "dpc": "03041839101",
            "name": "ស៊្រុន សុទិដ្ឋ"
        },
        {
            "barcode": "171136924",
            "dpc": "03041839001",
            "name": "ហុក ចាន់ថុល"
        },
        {
            "barcode": "171136925",
            "dpc": "03041838901",
            "name": "គង់ តាប"
        },
        {
            "barcode": "171136926",
            "dpc": "03041838801",
            "name": "ឡាយ ណារី"
        },
        {
            "barcode": "171136927",
            "dpc": "03041838701",
            "name": "សាំង ធី"
        },
        {
            "barcode": "171136928",
            "dpc": "03041838601",
            "name": "ចិន សាវ៉ាន"
        },
        {
            "barcode": "171136929",
            "dpc": "03041838501",
            "name": "ហេង សៅយ៉ាត"
        },
        {
            "barcode": "171136930",
            "dpc": "03041847901",
            "name": "អ៊ុច សុផាត"
        },
        {
            "barcode": "171136931",
            "dpc": "03041847801",
            "name": "ឡុង សុឃីម"
        },
        {
            "barcode": "171136932",
            "dpc": "03041847701",
            "name": "យង់  តាវ"
        },
        {
            "barcode": "171136933",
            "dpc": "03041847501",
            "name": "ម៉ក់ ទូច"
        },
        {
            "barcode": "171136934",
            "dpc": "03041847401",
            "name": "ផន ផល្លា"
        },
        {
            "barcode": "171136935",
            "dpc": "03041847301",
            "name": "ទូច ហាក់"
        },
        {
            "barcode": "171136936",
            "dpc": "03041847101",
            "name": "ម៉ែន កល្យាណ"
        },
        {
            "barcode": "171136937",
            "dpc": "03041846901",
            "name": "អៃ អ៊ី"
        },
        {
            "barcode": "171136938",
            "dpc": "03041846801",
            "name": "អ៊ិត សំបូរ"
        },
        {
            "barcode": "171136939",
            "dpc": "03041846701",
            "name": "ជួន  ហុង"
        },
        {
            "barcode": "171136940",
            "dpc": "03041846601",
            "name": "ណុប សោភ័ណ្ឌ"
        },
        {
            "barcode": "171136941",
            "dpc": "03041846501",
            "name": "នៅ  បូរិន"
        },
        {
            "barcode": "171136942",
            "dpc": "03041846401",
            "name": "អ៊ិត សំប៊ុន"
        },
        {
            "barcode": "171136943",
            "dpc": "03041846301",
            "name": "ម៉ម ណារ៉េត"
        },
        {
            "barcode": "171136944",
            "dpc": "03041846201",
            "name": "វ៉ាន់ ករ"
        },
        {
            "barcode": "171136945",
            "dpc": "03041846101",
            "name": "យឹង  ហឿប"
        },
        {
            "barcode": "171136946",
            "dpc": "03041809901",
            "name": "សូនី រស្មី"
        },
        {
            "barcode": "171136947",
            "dpc": "03041810101",
            "name": "ច័ន្ទ   មន្នី"
        },
        {
            "barcode": "171136948",
            "dpc": "03041809601",
            "name": "ឡេង សំអាត"
        },
        {
            "barcode": "171136949",
            "dpc": "03041809501",
            "name": "ខែក ស៊ីធឿន"
        },
        {
            "barcode": "171136950",
            "dpc": "03041809401",
            "name": "ខែក ស៊ីថុន"
        },
        {
            "barcode": "171136951",
            "dpc": "03041809301",
            "name": "ម៉ៅ ណារិទ្ធិ"
        },
        {
            "barcode": "171136952",
            "dpc": "03041809201",
            "name": "យូ ឆេង"
        },
        {
            "barcode": "171136953",
            "dpc": "03041809101",
            "name": "ប៉ិច ឆាតសារិ"
        },
        {
            "barcode": "171136954",
            "dpc": "03041809001",
            "name": "ស៊ីម សារិន"
        },
        {
            "barcode": "171136955",
            "dpc": "03041808901",
            "name": "លុក មន្នី"
        },
        {
            "barcode": "171136956",
            "dpc": "03041808801",
            "name": "ព្រុំ ប៊ុត"
        },
        {
            "barcode": "171136957",
            "dpc": "03041808701",
            "name": "ធូ ហួត"
        },
        {
            "barcode": "171136958",
            "dpc": "03041808601",
            "name": "យាន  ពៅ"
        },
        {
            "barcode": "171136959",
            "dpc": "03041808501",
            "name": "យូ សាន ១"
        },
        {
            "barcode": "171136960",
            "dpc": "03041808401",
            "name": "សិន  ញ៉ា"
        },
        {
            "barcode": "171136961",
            "dpc": "03041808301",
            "name": "រឿន វណ្ណស៊ី"
        },
        {
            "barcode": "171136962",
            "dpc": "03041808201",
            "name": "ជាន  ឡូញ"
        },
        {
            "barcode": "171136963",
            "dpc": "03041808101",
            "name": "កឺ សែត"
        },
        {
            "barcode": "171136964",
            "dpc": "03041808001",
            "name": "ម៉ុន  ម៉ុត"
        },
        {
            "barcode": "171136965",
            "dpc": "03041807901",
            "name": "សួន សុផល"
        },
        {
            "barcode": "171136966",
            "dpc": "03041807801",
            "name": "យូ ជីឃាង"
        },
        {
            "barcode": "171136967",
            "dpc": "03041807701",
            "name": "លី ម៉េង"
        },
        {
            "barcode": "171136968",
            "dpc": "03041807601",
            "name": "ចាន់ កណ្ណិកា"
        },
        {
            "barcode": "171136969",
            "dpc": "03041807501",
            "name": "សេក ទូច"
        },
        {
            "barcode": "171136970",
            "dpc": "03041807401",
            "name": "ឃួន ឱសថ"
        },
        {
            "barcode": "171136971",
            "dpc": "03041807301",
            "name": "ហេង អេង"
        },
        {
            "barcode": "171136972",
            "dpc": "03041807201",
            "name": "កៅ ស៊ីឡេង"
        },
        {
            "barcode": "171136973",
            "dpc": "03041809701",
            "name": "លក  សួរ"
        },
        {
            "barcode": "171136974",
            "dpc": "03041810201",
            "name": "រស់ ជីវ័ន្ត"
        },
        {
            "barcode": "171136975",
            "dpc": "03041810301",
            "name": "សែង ចិន្តា"
        },
        {
            "barcode": "171136976",
            "dpc": "03041810401",
            "name": "តឹក គឹមឡុង"
        },
        {
            "barcode": "171136977",
            "dpc": "03041810501",
            "name": "ឃុត សារ៉ុម"
        },
        {
            "barcode": "171136978",
            "dpc": "03041810601",
            "name": "នង   វុត្ថា"
        },
        {
            "barcode": "171136979",
            "dpc": "03041810701",
            "name": "សែ បូរ"
        },
        {
            "barcode": "171136980",
            "dpc": "03041810801",
            "name": "ហាក់ សំផុន"
        },
        {
            "barcode": "171136981",
            "dpc": "03041810901",
            "name": "ហួត លាងស៊ីម"
        },
        {
            "barcode": "171136982",
            "dpc": "03041811001",
            "name": "សុខ ណែម"
        },
        {
            "barcode": "171136983",
            "dpc": "03041811101",
            "name": "ទូច កុសល"
        },
        {
            "barcode": "171136984",
            "dpc": "03041811201",
            "name": "សោម សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171136985",
            "dpc": "03041811301",
            "name": "សោម ជូ"
        },
        {
            "barcode": "171136986",
            "dpc": "03041811501",
            "name": "ចាប ដារីណេត"
        },
        {
            "barcode": "171136987",
            "dpc": "03041811601",
            "name": "មាស រ៉ាស៊ីន"
        },
        {
            "barcode": "171136988",
            "dpc": "03041827401",
            "name": "សោម ថន"
        },
        {
            "barcode": "171136989",
            "dpc": "03041811701",
            "name": "អ៊ុយ ដារីន"
        },
        {
            "barcode": "171136990",
            "dpc": "03041811401",
            "name": "សោ សារី"
        },
        {
            "barcode": "171136991",
            "dpc": "03041811901",
            "name": "ពេក តារ៉ា"
        },
        {
            "barcode": "171136992",
            "dpc": "03041828801",
            "name": "លី ងួន"
        },
        {
            "barcode": "171136993",
            "dpc": "03041828501",
            "name": "សួន សំអាត"
        },
        {
            "barcode": "171136994",
            "dpc": "03041828401",
            "name": "ហួត  វី"
        },
        {
            "barcode": "171136995",
            "dpc": "03041828301",
            "name": "ផាត់ នី"
        },
        {
            "barcode": "171136996",
            "dpc": "03041817201",
            "name": "ហ្វាន់ ទី"
        },
        {
            "barcode": "171136997",
            "dpc": "03041817101",
            "name": "សយ  សារឿន"
        },
        {
            "barcode": "171136998",
            "dpc": "03041817001",
            "name": "យូ សាន"
        },
        {
            "barcode": "171136999",
            "dpc": "03041816901",
            "name": "ម៉ាច គឹមឆាយ"
        },
        {
            "barcode": "171137000",
            "dpc": "03041816801",
            "name": "ហ៊ីង សៀក"
        },
        {
            "barcode": "171137001",
            "dpc": "03041816701",
            "name": "ខ្លូត មី"
        },
        {
            "barcode": "171137002",
            "dpc": "03041816601",
            "name": "អ៊ិន សុខា"
        },
        {
            "barcode": "171137003",
            "dpc": "03041816501",
            "name": "ឃួយ  គឹមទ្រី"
        },
        {
            "barcode": "171137004",
            "dpc": "03041816401",
            "name": "សេង សុភី"
        },
        {
            "barcode": "171137005",
            "dpc": "03041816301",
            "name": "សុខ ជា"
        },
        {
            "barcode": "171137006",
            "dpc": "03041816201",
            "name": "ស៊ិន បូរ៉ាន់"
        },
        {
            "barcode": "171137007",
            "dpc": "03041816101",
            "name": "ស៊ិន ញិប"
        },
        {
            "barcode": "171137008",
            "dpc": "03041816001",
            "name": "ស៊ុយ ពិសិដ្ឋ"
        },
        {
            "barcode": "171137009",
            "dpc": "03041815901",
            "name": "លិន ណាវី"
        },
        {
            "barcode": "171137010",
            "dpc": "03041815801",
            "name": "ថោង មុំ"
        },
        {
            "barcode": "171137011",
            "dpc": "03041815701",
            "name": "ឌី ស៊ីម"
        },
        {
            "barcode": "171137012",
            "dpc": "03041815601",
            "name": "សោម  សូណែត"
        },
        {
            "barcode": "171137013",
            "dpc": "03041815501",
            "name": "ស៊ុន  ថាវ"
        },
        {
            "barcode": "171137014",
            "dpc": "03041815401",
            "name": "ជី សូហា"
        },
        {
            "barcode": "171137015",
            "dpc": "03041815301",
            "name": "ធឿម ស៊ីមុត"
        },
        {
            "barcode": "171137016",
            "dpc": "03041815201",
            "name": "ញ៉ែម ខេន"
        },
        {
            "barcode": "171137017",
            "dpc": "03041815101",
            "name": "អេង ម៉ុន"
        },
        {
            "barcode": "171137018",
            "dpc": "03041815001",
            "name": "ជា សំអាត"
        },
        {
            "barcode": "171137019",
            "dpc": "03041810001",
            "name": "លឹម សុធា"
        },
        {
            "barcode": "171137020",
            "dpc": "03041814901",
            "name": "ទឹម ថា"
        },
        {
            "barcode": "171137021",
            "dpc": "03041814801",
            "name": "អ៊ុំ សាំង"
        },
        {
            "barcode": "171137022",
            "dpc": "03041814701",
            "name": "អ៊ុំ ស្រី"
        },
        {
            "barcode": "171137023",
            "dpc": "03041814601",
            "name": "ឆាយ ឡាប"
        },
        {
            "barcode": "171137024",
            "dpc": "03041814501",
            "name": "មាស ពែវ"
        },
        {
            "barcode": "171137025",
            "dpc": "03041814401",
            "name": "គួច  សាវី"
        },
        {
            "barcode": "171137026",
            "dpc": "03041814301",
            "name": "ឃិម  សូរីយា"
        },
        {
            "barcode": "171137027",
            "dpc": "03041814201",
            "name": "សុខ ឡេង"
        },
        {
            "barcode": "171137028",
            "dpc": "03041814101",
            "name": "សុខ ណេង"
        },
        {
            "barcode": "171137029",
            "dpc": "03041813901",
            "name": "សុខ ឡេង"
        },
        {
            "barcode": "171137030",
            "dpc": "03041813801",
            "name": "ធុន អឿន"
        },
        {
            "barcode": "171137031",
            "dpc": "03041813701",
            "name": "ជា សាវី"
        },
        {
            "barcode": "171137032",
            "dpc": "03041813601",
            "name": "នុត ណែម"
        },
        {
            "barcode": "171137033",
            "dpc": "03041813501",
            "name": "ឥន ឡេង"
        },
        {
            "barcode": "171137034",
            "dpc": "03041813401",
            "name": "សុខ វិរៈ"
        },
        {
            "barcode": "171137035",
            "dpc": "03041813301",
            "name": "ហេង ប៊ុនវ៉ាត់"
        },
        {
            "barcode": "171137036",
            "dpc": "03041813201",
            "name": "ឥន ហេង"
        },
        {
            "barcode": "171137037",
            "dpc": "03041813101",
            "name": "អ៊ិន  សារ៉ន"
        },
        {
            "barcode": "171137038",
            "dpc": "03041813001",
            "name": "សុខ ហេង"
        },
        {
            "barcode": "171137039",
            "dpc": "03041812801",
            "name": "អ៊ុក  ឆេង"
        },
        {
            "barcode": "171137040",
            "dpc": "03041812701",
            "name": "នួន សំណាង"
        },
        {
            "barcode": "171137041",
            "dpc": "03041812101",
            "name": "អ៊ិន សាឡូត"
        },
        {
            "barcode": "171137042",
            "dpc": "03041812201",
            "name": "សុខ សុខា"
        },
        {
            "barcode": "171137043",
            "dpc": "03041812301",
            "name": "ហេង ម៉ៅ"
        },
        {
            "barcode": "171137044",
            "dpc": "03041812401",
            "name": "សួន នឿត"
        },
        {
            "barcode": "171137045",
            "dpc": "03041812501",
            "name": "ហែម សុខខី"
        }
    ]
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
