let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171137923",
            "dpc": "03041902401",
            "name": "ទូច រៀម"
        },
        {
            "barcode": "171137924",
            "dpc": "03041902501",
            "name": "កែវ ផលរដ្ឋ"
        },
        {
            "barcode": "171137925",
            "dpc": "03041913501",
            "name": "ជួង គឹមសាន"
        },
        {
            "barcode": "171137926",
            "dpc": "03041913601",
            "name": "ជិន ចាន់"
        },
        {
            "barcode": "171137927",
            "dpc": "03041913701",
            "name": "សែម ធួន"
        },
        {
            "barcode": "171137928",
            "dpc": "03041913801",
            "name": "លាង ឆេង"
        },
        {
            "barcode": "171137929",
            "dpc": "03041914001",
            "name": "ចាន់ នីស្សា"
        },
        {
            "barcode": "171137930",
            "dpc": "03041914101",
            "name": "សុខ ឌួង"
        },
        {
            "barcode": "171137931",
            "dpc": "03041914201",
            "name": "ឡៃ ហ៊ាង"
        },
        {
            "barcode": "171137932",
            "dpc": "03041914301",
            "name": "ហុក ហេង"
        },
        {
            "barcode": "171137933",
            "dpc": "03041914601",
            "name": "ដៀប គាំ"
        },
        {
            "barcode": "171137934",
            "dpc": "03041914701",
            "name": "តាន់ គឹមស្រូ"
        },
        {
            "barcode": "171137935",
            "dpc": "03041914801",
            "name": "ស៊ីវ ខេង"
        },
        {
            "barcode": "171137936",
            "dpc": "03041914901",
            "name": "ហែន ឆាំ"
        },
        {
            "barcode": "171137937",
            "dpc": "03041915001",
            "name": "កែ ឃាន"
        },
        {
            "barcode": "171137938",
            "dpc": "03041915101",
            "name": "ប្រាក់ ថាវី"
        },
        {
            "barcode": "171137939",
            "dpc": "03041915201",
            "name": "កែ ឆេន"
        },
        {
            "barcode": "171137940",
            "dpc": "03041915301",
            "name": "ម៉ូ ភឿត"
        },
        {
            "barcode": "171137941",
            "dpc": "03041915401",
            "name": "អៀម គុយ"
        },
        {
            "barcode": "171137942",
            "dpc": "03041915501",
            "name": "ហ៊ីង ចាន់ថន"
        },
        {
            "barcode": "171137943",
            "dpc": "03041915601",
            "name": "ភិន សុផាត"
        },
        {
            "barcode": "171137944",
            "dpc": "03041915701",
            "name": "អ៊ុច ភិន"
        },
        {
            "barcode": "171137945",
            "dpc": "03041915801",
            "name": "អ៊ុច សុភី"
        },
        {
            "barcode": "171137946",
            "dpc": "03041915901",
            "name": "អ៊ុក សារ៉េត"
        },
        {
            "barcode": "171137947",
            "dpc": "03041916001",
            "name": "ស៊ុន បូរី"
        },
        {
            "barcode": "171137948",
            "dpc": "03041916101",
            "name": "សេក ចាន់រស្មី"
        },
        {
            "barcode": "171137949",
            "dpc": "03041916201",
            "name": "ជ័យ ពីន"
        },
        {
            "barcode": "171137950",
            "dpc": "03041916301",
            "name": "ណុប គុំ"
        },
        {
            "barcode": "171137951",
            "dpc": "03041916401",
            "name": "ពៅ ឈឿន"
        },
        {
            "barcode": "171137952",
            "dpc": "03041916501",
            "name": "ពៅ វណ្ណា"
        },
        {
            "barcode": "171137953",
            "dpc": "03041916601",
            "name": "តឹក គឹមសន"
        },
        {
            "barcode": "171137954",
            "dpc": "03041916801",
            "name": "វឿត ចាន់ណា"
        },
        {
            "barcode": "171137955",
            "dpc": "03041916901",
            "name": "លិញ ផាន"
        },
        {
            "barcode": "171137956",
            "dpc": "03041917101",
            "name": "ម៉ូត វោយហូរ"
        },
        {
            "barcode": "171137957",
            "dpc": "03041917001",
            "name": "ជឹង គឹមសុន"
        },
        {
            "barcode": "171137958",
            "dpc": "03041917301",
            "name": "អេន សាខន"
        },
        {
            "barcode": "171137959",
            "dpc": "03041917401",
            "name": "វឿន វ័ន្ត"
        },
        {
            "barcode": "171137960",
            "dpc": "03041917501",
            "name": "ទិត យ៉ុម"
        },
        {
            "barcode": "171137961",
            "dpc": "03041917601",
            "name": "សេក សុផុន"
        },
        {
            "barcode": "171137962",
            "dpc": "03041917701",
            "name": "តិប សុមន្នី"
        },
        {
            "barcode": "171137963",
            "dpc": "03041917901",
            "name": "ទូច គង់"
        },
        {
            "barcode": "171137964",
            "dpc": "03041918101",
            "name": "វង  ស្រីទូច"
        },
        {
            "barcode": "171137965",
            "dpc": "03041918001",
            "name": "ទូច សឿង"
        },
        {
            "barcode": "171137966",
            "dpc": "03041918201",
            "name": "សេន វន"
        },
        {
            "barcode": "171137967",
            "dpc": "03041918301",
            "name": "សុខ នាង"
        },
        {
            "barcode": "171137968",
            "dpc": "03041918401",
            "name": "យិប សុគន្ធ"
        },
        {
            "barcode": "171137969",
            "dpc": "03041918501",
            "name": "ឆោម ប៊ុនធី"
        },
        {
            "barcode": "171137970",
            "dpc": "03041918601",
            "name": "ចាន់ មណ្ឌល"
        },
        {
            "barcode": "171137971",
            "dpc": "03041918701",
            "name": "ស៊ុំំ គឹមយ៉េង"
        },
        {
            "barcode": "171137972",
            "dpc": "03041918801",
            "name": "ម៉េង វែង"
        },
        {
            "barcode": "171137973",
            "dpc": "03041918901",
            "name": "ញ៉ែម កេត"
        },
        {
            "barcode": "171137974",
            "dpc": "03041919001",
            "name": "ស៊ីវ ខេន"
        },
        {
            "barcode": "171137975",
            "dpc": "03041919101",
            "name": "កែវ ស"
        },
        {
            "barcode": "171137976",
            "dpc": "03041919301",
            "name": "គុយ ចាន់ផេង"
        },
        {
            "barcode": "171137977",
            "dpc": "03041919401",
            "name": "តាំង ឆេងហ៊ាង"
        },
        {
            "barcode": "171137978",
            "dpc": "03041919501",
            "name": "ហឿង វណ្ណដេត"
        },
        {
            "barcode": "171137979",
            "dpc": "03041919601",
            "name": "អ៊ឹង សំបូរ"
        },
        {
            "barcode": "171137980",
            "dpc": "03041919701",
            "name": "កែវ ប៊ុននី"
        },
        {
            "barcode": "171137981",
            "dpc": "03041919801",
            "name": "ព្រឿន ស្រីរដ្ឋ"
        },
        {
            "barcode": "171137982",
            "dpc": "03041919901",
            "name": "ព្រីង   ចំរើន"
        },
        {
            "barcode": "171137983",
            "dpc": "03041920001",
            "name": "ទុង   រ៉ាដូ"
        },
        {
            "barcode": "171137984",
            "dpc": "03041920101",
            "name": "ម៉ិល ណេង"
        },
        {
            "barcode": "171137985",
            "dpc": "03041920201",
            "name": "ម៉ៅ សុផាត"
        },
        {
            "barcode": "171137986",
            "dpc": "03041920301",
            "name": "សៅ ស៊ីថា"
        },
        {
            "barcode": "171137987",
            "dpc": "03041920401",
            "name": "សំ ស៊ីណាត"
        },
        {
            "barcode": "171137988",
            "dpc": "03041920501",
            "name": "ហែម សាន"
        },
        {
            "barcode": "171137989",
            "dpc": "03041920701",
            "name": "អោក សុវណ្ណ"
        },
        {
            "barcode": "171137990",
            "dpc": "03041920801",
            "name": "សូ ម៉ន"
        },
        {
            "barcode": "171137991",
            "dpc": "03041920901",
            "name": "មាន ធន"
        },
        {
            "barcode": "171137992",
            "dpc": "03041921001",
            "name": "ដេន តាំង"
        },
        {
            "barcode": "171137993",
            "dpc": "03041921101",
            "name": "នៅ ស៊ីថា"
        },
        {
            "barcode": "171137994",
            "dpc": "03041921201",
            "name": "រុន  ថែល"
        },
        {
            "barcode": "171137995",
            "dpc": "03041921301",
            "name": "សូ សៀក"
        },
        {
            "barcode": "171137996",
            "dpc": "03041921401",
            "name": "កៅ សុខលី"
        },
        {
            "barcode": "171137997",
            "dpc": "03041921501",
            "name": "អ៊ឹម សារឿន"
        },
        {
            "barcode": "171137998",
            "dpc": "03041921601",
            "name": "ឡៃ ស៊ីណាត"
        },
        {
            "barcode": "171137999",
            "dpc": "03041921701",
            "name": "ព្រាប សុជាតា"
        },
        {
            "barcode": "171138000",
            "dpc": "03041921801",
            "name": "ងន់ ប៊ុន"
        },
        {
            "barcode": "171138001",
            "dpc": "03041921901",
            "name": "ឈឺន ឆូយ"
        },
        {
            "barcode": "171138002",
            "dpc": "03041922001",
            "name": "សេង ហៀប"
        },
        {
            "barcode": "171138003",
            "dpc": "03041922101",
            "name": "ម៉ឺន សុខុន"
        },
        {
            "barcode": "171138004",
            "dpc": "03041922201",
            "name": "នូ សាម៉ុន"
        },
        {
            "barcode": "171138005",
            "dpc": "03041922301",
            "name": "ប៉ោ គឹមវិទ្ធ"
        },
        {
            "barcode": "171138006",
            "dpc": "03041922401",
            "name": "គឹម យៀក"
        },
        {
            "barcode": "171138007",
            "dpc": "03041922501",
            "name": "គឹម ជៀន"
        },
        {
            "barcode": "171138008",
            "dpc": "03041922601",
            "name": "ទី គឹមអៀង"
        },
        {
            "barcode": "171138009",
            "dpc": "03041922701",
            "name": "ឡេង វិសាល"
        },
        {
            "barcode": "171138010",
            "dpc": "03041922901",
            "name": "សន មុន្នី"
        },
        {
            "barcode": "171138011",
            "dpc": "03041923001",
            "name": "គឹម សួរ"
        },
        {
            "barcode": "171138012",
            "dpc": "03041923101",
            "name": "ឈឹម  ឡែន"
        },
        {
            "barcode": "171138013",
            "dpc": "03041923201",
            "name": "ជុន ស៊ីថា"
        },
        {
            "barcode": "171138014",
            "dpc": "03041923401",
            "name": "ណុប ស្រីនាង"
        },
        {
            "barcode": "171138015",
            "dpc": "03041923501",
            "name": "នៅ សារឿត"
        },
        {
            "barcode": "171138016",
            "dpc": "03041923901",
            "name": "ឯក ធឿង"
        },
        {
            "barcode": "171138017",
            "dpc": "03041924001",
            "name": "មាឃខ ណារិន"
        },
        {
            "barcode": "171138018",
            "dpc": "03041924101",
            "name": "ហម  សុភា"
        },
        {
            "barcode": "171138019",
            "dpc": "03041924201",
            "name": "ទុយ វឺ"
        },
        {
            "barcode": "171138020",
            "dpc": "03041924301",
            "name": "រស់ រិទ្ធ"
        },
        {
            "barcode": "171138021",
            "dpc": "03041924401",
            "name": "សេង គង់"
        },
        {
            "barcode": "171138022",
            "dpc": "03041924501",
            "name": "គឹម សុខា"
        },
        {
            "barcode": "171138023",
            "dpc": "03041924601",
            "name": "ធូ សារិន"
        },
        {
            "barcode": "171138024",
            "dpc": "03041924701",
            "name": "កែវ ប៊ុនឈឿន"
        },
        {
            "barcode": "171138025",
            "dpc": "03041924801",
            "name": "ផេង ផល្លី"
        },
        {
            "barcode": "171138026",
            "dpc": "03041900101",
            "name": "ជិន នៅ"
        },
        {
            "barcode": "171138027",
            "dpc": "03041900201",
            "name": "រស់ សំអាត"
        },
        {
            "barcode": "171138028",
            "dpc": "03041902701",
            "name": "មុំ សាមឌី"
        },
        {
            "barcode": "171138029",
            "dpc": "03041902801",
            "name": "ស៊ុម លឹម"
        },
        {
            "barcode": "171138030",
            "dpc": "03041902901",
            "name": "ស៊ុម ឡេង"
        },
        {
            "barcode": "171138031",
            "dpc": "03041903101",
            "name": "គង់ ស្រគៀល"
        },
        {
            "barcode": "171138032",
            "dpc": "03041903401",
            "name": "ភឿ គឹមលី"
        },
        {
            "barcode": "171138033",
            "dpc": "03041903501",
            "name": "ប៉ែន ទូច"
        },
        {
            "barcode": "171138034",
            "dpc": "03041903601",
            "name": "ហែម ធុយ"
        },
        {
            "barcode": "171138035",
            "dpc": "03041903701",
            "name": "ពេជ្រ សុធា"
        },
        {
            "barcode": "171138036",
            "dpc": "03041903801",
            "name": "ខាត់ សុខ"
        },
        {
            "barcode": "171138037",
            "dpc": "03041903901",
            "name": "ស៊ិន ចាន់ពៅរ៉ូហ្សិត"
        },
        {
            "barcode": "171138038",
            "dpc": "03041904001",
            "name": "ឃុន សារ៉ាឌី"
        },
        {
            "barcode": "171138039",
            "dpc": "03041904101",
            "name": "ហ៊ុយ ហ៊ាង"
        },
        {
            "barcode": "171138040",
            "dpc": "03041904201",
            "name": "តាំង ពិសី"
        },
        {
            "barcode": "171138041",
            "dpc": "03041904301",
            "name": "ប៊ុន លី"
        },
        {
            "barcode": "171138042",
            "dpc": "03041904401",
            "name": "មុំ ហាក់"
        },
        {
            "barcode": "171138043",
            "dpc": "03041904501",
            "name": "អង់ រ៉ែម"
        },
        {
            "barcode": "171138044",
            "dpc": "03041904701",
            "name": "ឯម  សារុំ"
        },
        {
            "barcode": "171138045",
            "dpc": "03041904801",
            "name": "នៅ ម៉ុន"
        },
        {
            "barcode": "171138046",
            "dpc": "03041904901",
            "name": "ឯម សាវ៉ាត"
        },
        {
            "barcode": "171138047",
            "dpc": "03041905001",
            "name": "ចឹក សុខេង"
        },
        {
            "barcode": "171138048",
            "dpc": "03041905101",
            "name": "ណូ ណូត"
        },
        {
            "barcode": "171138049",
            "dpc": "03041905201",
            "name": "កែវ ផេង"
        },
        {
            "barcode": "171138050",
            "dpc": "03041905301",
            "name": "ហ៊ឹម គឹមលី"
        },
        {
            "barcode": "171138051",
            "dpc": "03041905401",
            "name": "សាយ រិទ្ធី"
        },
        {
            "barcode": "171138052",
            "dpc": "03041905501",
            "name": "កែវ យ៉ាន"
        },
        {
            "barcode": "171138053",
            "dpc": "03041905601",
            "name": "នុត ហ៊ាង"
        },
        {
            "barcode": "171138054",
            "dpc": "03041905701",
            "name": "អ៊ូច សុផាណាន"
        },
        {
            "barcode": "171138055",
            "dpc": "03041905801",
            "name": "ផាន សុភា"
        },
        {
            "barcode": "171138056",
            "dpc": "03041905901",
            "name": "ស៊ឹម សុឃន"
        },
        {
            "barcode": "171138057",
            "dpc": "03041906001",
            "name": "ពេជ្រ សុវណ្ណ"
        },
        {
            "barcode": "171138058",
            "dpc": "03041906101",
            "name": "ឆេង ណុល"
        },
        {
            "barcode": "171138059",
            "dpc": "03041904601",
            "name": "ខន អៀក"
        },
        {
            "barcode": "171138060",
            "dpc": "03041906201",
            "name": "សុខ ចាន់រ៉ា"
        },
        {
            "barcode": "171138061",
            "dpc": "03041906301",
            "name": "ឆេង មុំ"
        },
        {
            "barcode": "171138062",
            "dpc": "03041906401",
            "name": "សុខ ចាន់"
        },
        {
            "barcode": "171138063",
            "dpc": "03041906501",
            "name": "ម៉ង ប៉ោហ៊ុយ"
        },
        {
            "barcode": "171138064",
            "dpc": "03041906601",
            "name": "ទូច យ៉ាន"
        },
        {
            "barcode": "171138065",
            "dpc": "03041906701",
            "name": "លឹម ទាពីវ"
        },
        {
            "barcode": "171138066",
            "dpc": "03041906901",
            "name": "ជុន សុខា"
        },
        {
            "barcode": "171138067",
            "dpc": "03041907001",
            "name": "សោម រិទ្ធ"
        },
        {
            "barcode": "171138068",
            "dpc": "03041907101",
            "name": "យ៉ាន សៀន"
        },
        {
            "barcode": "171138069",
            "dpc": "03041907201",
            "name": "គី ភនចាយ"
        },
        {
            "barcode": "171138070",
            "dpc": "03041907301",
            "name": "ឃុត សំអឿន"
        },
        {
            "barcode": "171138071",
            "dpc": "03041907401",
            "name": "យឹម សែ"
        },
        {
            "barcode": "171138072",
            "dpc": "03041907501",
            "name": "អ៊ឹង កូយ"
        },
        {
            "barcode": "171138073",
            "dpc": "03041907601",
            "name": "សោម សុវណ្ណ"
        },
        {
            "barcode": "171138074",
            "dpc": "03041907701",
            "name": "សាលា ឃុំទួលតាឯក"
        },
        {
            "barcode": "171138075",
            "dpc": "03041907801",
            "name": "អ៊ឹង ចេងគ្រី"
        },
        {
            "barcode": "171138076",
            "dpc": "03041907901",
            "name": "ពា កយ"
        },
        {
            "barcode": "171138077",
            "dpc": "03041908001",
            "name": "ហុក កុសល"
        },
        {
            "barcode": "171138078",
            "dpc": "03041908101",
            "name": "ពៅ ហេឡែន"
        },
        {
            "barcode": "171138079",
            "dpc": "03041908201",
            "name": "គឹម ហួង"
        },
        {
            "barcode": "171138080",
            "dpc": "03041908301",
            "name": "ង៉ែត សារ៉ន"
        },
        {
            "barcode": "171138081",
            "dpc": "03041908401",
            "name": "គៀង សុគន្ធារី"
        },
        {
            "barcode": "171138082",
            "dpc": "03041908501",
            "name": "ហុក វុទ្ធី"
        },
        {
            "barcode": "171138083",
            "dpc": "03041908701",
            "name": "លី ហេងសៀក"
        },
        {
            "barcode": "171138084",
            "dpc": "03041908801",
            "name": "អ៊ឹង គួយ"
        },
        {
            "barcode": "171138085",
            "dpc": "03041908901",
            "name": "ហាក់  ស្រី"
        },
        {
            "barcode": "171138086",
            "dpc": "03041909001",
            "name": "ហង ប៊ុនថា"
        },
        {
            "barcode": "171138087",
            "dpc": "03041909101",
            "name": "សុខ លឹមហាក់"
        },
        {
            "barcode": "171138088",
            "dpc": "03041909201",
            "name": "ម៉ៅ ផាន់"
        },
        {
            "barcode": "171138089",
            "dpc": "03041909401",
            "name": "ហុក ឈុនឡេង"
        },
        {
            "barcode": "171138090",
            "dpc": "03041909501",
            "name": "ឡោ អ៊ូ"
        },
        {
            "barcode": "171138091",
            "dpc": "03041909601",
            "name": "ចាប កុយ"
        },
        {
            "barcode": "171138092",
            "dpc": "03041909701",
            "name": "អោម សារឿយ"
        },
        {
            "barcode": "171138093",
            "dpc": "03041909801",
            "name": "ថោង គឹមស្រូ"
        },
        {
            "barcode": "171138094",
            "dpc": "03041910101",
            "name": "អ៊ឹម ទ្រី"
        },
        {
            "barcode": "171138095",
            "dpc": "03041910201",
            "name": "ហង់ ម៉ាឡានី"
        },
        {
            "barcode": "171138096",
            "dpc": "03041910301",
            "name": "ងិន គឹមលាន"
        },
        {
            "barcode": "171138097",
            "dpc": "03041910401",
            "name": "ហ៊ិន មុំ"
        },
        {
            "barcode": "171138098",
            "dpc": "03041910601",
            "name": "វឿត លឿម"
        },
        {
            "barcode": "171138099",
            "dpc": "03041910701",
            "name": "ជៀម បូរ៉េន"
        },
        {
            "barcode": "171138100",
            "dpc": "03041910801",
            "name": "ថូ ធី"
        },
        {
            "barcode": "171138101",
            "dpc": "03041910901",
            "name": "ងួន ខុន"
        },
        {
            "barcode": "171138102",
            "dpc": "03041911001",
            "name": "ឈឹម សុម៉ាលី"
        },
        {
            "barcode": "171138103",
            "dpc": "03041911101",
            "name": "ឯម ចន្ថា"
        },
        {
            "barcode": "171138104",
            "dpc": "03041911201",
            "name": "ស៊ិន សម្បត្តិ"
        },
        {
            "barcode": "171138105",
            "dpc": "03041911301",
            "name": "សេង វ៉ាន់នឿន"
        },
        {
            "barcode": "171138106",
            "dpc": "03041911401",
            "name": "គង់ យ៉ានី"
        },
        {
            "barcode": "171138107",
            "dpc": "03041911501",
            "name": "ឡុង នាង"
        },
        {
            "barcode": "171138108",
            "dpc": "03041911601",
            "name": "កៅ សារ៉ុន"
        },
        {
            "barcode": "171138109",
            "dpc": "03041911701",
            "name": "ឡុង ប៊ុនថា"
        },
        {
            "barcode": "171138110",
            "dpc": "03041911801",
            "name": "ឆោម ប៊ុនធី"
        },
        {
            "barcode": "171138111",
            "dpc": "03041911901",
            "name": "តោ ទៀប"
        },
        {
            "barcode": "171138112",
            "dpc": "03041912001",
            "name": "កៅ ចាត"
        },
        {
            "barcode": "171138113",
            "dpc": "03041912201",
            "name": "ប៊ូ ហាំង"
        },
        {
            "barcode": "171138114",
            "dpc": "03041912301",
            "name": "ផាន់ ហៃ"
        },
        {
            "barcode": "171138115",
            "dpc": "03041912401",
            "name": "ភួយ  លាងអ៊ី"
        },
        {
            "barcode": "171138116",
            "dpc": "03041912501",
            "name": "គល់ ប្រឹម"
        },
        {
            "barcode": "171138117",
            "dpc": "03041912601",
            "name": "ភូ ចាយ"
        },
        {
            "barcode": "171138118",
            "dpc": "03041912701",
            "name": "ចាន់ ធី"
        },
        {
            "barcode": "171138119",
            "dpc": "03041912801",
            "name": "ឈាន ស៊ីណា"
        },
        {
            "barcode": "171138120",
            "dpc": "03041912901",
            "name": "ចាន់ អូន"
        },
        {
            "barcode": "171138121",
            "dpc": "03041913001",
            "name": "សេក តូ"
        },
        {
            "barcode": "171138122",
            "dpc": "03041913101",
            "name": "ខុន ដា"
        },
        {
            "barcode": "171138123",
            "dpc": "03041913201",
            "name": "ខុន សាឃឿត"
        },
        {
            "barcode": "171138124",
            "dpc": "03041913301",
            "name": "ខុន និមល"
        },
        {
            "barcode": "171138125",
            "dpc": "03041935001",
            "name": "សូ វ៉ែ"
        },
        {
            "barcode": "171138126",
            "dpc": "03041935101",
            "name": "សូ គឹមរឿត"
        },
        {
            "barcode": "171138127",
            "dpc": "03041935201",
            "name": "គី ជីវ័ន្ត"
        },
        {
            "barcode": "171138128",
            "dpc": "03041935301",
            "name": "ជិន សាខន"
        },
        {
            "barcode": "171138129",
            "dpc": "03041935701",
            "name": "ម៉ុត សុធារិទ្ធ"
        },
        {
            "barcode": "171138130",
            "dpc": "03041935801",
            "name": "កើត ម៉ូលី"
        },
        {
            "barcode": "171138131",
            "dpc": "03041935901",
            "name": "ហ៊ុន សារួន"
        },
        {
            "barcode": "171138132",
            "dpc": "03041936001",
            "name": "ពៅ សុភាព"
        },
        {
            "barcode": "171138133",
            "dpc": "03041936101",
            "name": "ស៊ឺន ប៊ុនថា"
        },
        {
            "barcode": "171138134",
            "dpc": "03041936301",
            "name": "ម៉ៅ សារួន"
        },
        {
            "barcode": "171138135",
            "dpc": "03041936401",
            "name": "កែវ សារឿន"
        },
        {
            "barcode": "171138136",
            "dpc": "03041936501",
            "name": "កែវ យឿង"
        },
        {
            "barcode": "171138137",
            "dpc": "03041936601",
            "name": "ប្រាក់ សុខា"
        },
        {
            "barcode": "171138138",
            "dpc": "03041936701",
            "name": "ប៉ាត់  សំណាង"
        },
        {
            "barcode": "171138139",
            "dpc": "03041936801",
            "name": "ជិន ហេង"
        },
        {
            "barcode": "171138140",
            "dpc": "03041936901",
            "name": "អៀម គៀង"
        },
        {
            "barcode": "171138141",
            "dpc": "03041937001",
            "name": "អ៊ឹម សារិន"
        },
        {
            "barcode": "171138142",
            "dpc": "03041937101",
            "name": "ម៉ៅ វ៉ា"
        },
        {
            "barcode": "171138143",
            "dpc": "03041937201",
            "name": "យ៉ាត ឌិន"
        },
        {
            "barcode": "171138144",
            "dpc": "03041937301",
            "name": "នួន ណារុំ"
        },
        {
            "barcode": "171138145",
            "dpc": "03041937401",
            "name": "សំរិត ឆន"
        },
        {
            "barcode": "171138146",
            "dpc": "03041937501",
            "name": "ប៉ាល់ ណាំ"
        },
        {
            "barcode": "171138147",
            "dpc": "03041937601",
            "name": "ស្កាន  សំបូរ"
        },
        {
            "barcode": "171138148",
            "dpc": "03041937701",
            "name": "អ៊ី ចាន់"
        },
        {
            "barcode": "171138149",
            "dpc": "03041937801",
            "name": "ឡៃ ស៊ាន"
        },
        {
            "barcode": "171138150",
            "dpc": "03041937901",
            "name": "កែម គាន"
        },
        {
            "barcode": "171138151",
            "dpc": "03041938001",
            "name": "អ៊ឹម វ៉ាន់ថា"
        },
        {
            "barcode": "171138152",
            "dpc": "03041938101",
            "name": "ទួន  រិទ្ធ"
        },
        {
            "barcode": "171138153",
            "dpc": "03041938201",
            "name": "លី ហួរ"
        },
        {
            "barcode": "171138154",
            "dpc": "03041938301",
            "name": "ផេង សុខា"
        },
        {
            "barcode": "171138155",
            "dpc": "03041938401",
            "name": "ង៉ាន សារ៉េត"
        },
        {
            "barcode": "171138156",
            "dpc": "03041938501",
            "name": "សួម  ឆាយ"
        },
        {
            "barcode": "171138157",
            "dpc": "03041938601",
            "name": "ស៊ុំ ភ័ណ្ឌ"
        },
        {
            "barcode": "171138158",
            "dpc": "03041938701",
            "name": "លន់ គឹមលី"
        },
        {
            "barcode": "171138159",
            "dpc": "03041938801",
            "name": "ក្តិប ជុំនិត"
        },
        {
            "barcode": "171138160",
            "dpc": "03041939001",
            "name": "ប៉ែន សារ៉ាត់"
        },
        {
            "barcode": "171138161",
            "dpc": "03041939101",
            "name": "នួន លឿប"
        },
        {
            "barcode": "171138162",
            "dpc": "03041939801",
            "name": "អេង ប៊ុនហេង"
        },
        {
            "barcode": "171138163",
            "dpc": "03041939301",
            "name": "វឿត ហឿម"
        },
        {
            "barcode": "171138164",
            "dpc": "03041939201",
            "name": "ជុំ ហាច"
        },
        {
            "barcode": "171138165",
            "dpc": "03041939401",
            "name": "ទីម  ហ៊ុច"
        },
        {
            "barcode": "171138166",
            "dpc": "03041939601",
            "name": "ផន កែវ"
        },
        {
            "barcode": "171138167",
            "dpc": "03041939501",
            "name": "គិម សឿន"
        },
        {
            "barcode": "171138168",
            "dpc": "03041939901",
            "name": "ទុយ គង់"
        },
        {
            "barcode": "171138169",
            "dpc": "03041940001",
            "name": "ស៊ុយ អេង"
        },
        {
            "barcode": "171138170",
            "dpc": "03041940201",
            "name": "ជា បុប្ផា"
        },
        {
            "barcode": "171138171",
            "dpc": "03041940301",
            "name": "យ៉ាត ស្រីមុំ"
        },
        {
            "barcode": "171138172",
            "dpc": "03041940401",
            "name": "ឡាយ យាន"
        },
        {
            "barcode": "171138173",
            "dpc": "03041940501",
            "name": "ឯម សារ៉ុម"
        },
        {
            "barcode": "171138174",
            "dpc": "03041940601",
            "name": "គឹម ស្រីម៉ៅ"
        },
        {
            "barcode": "171138175",
            "dpc": "03041940701",
            "name": "ទា សុម៉ាលី"
        },
        {
            "barcode": "171138176",
            "dpc": "03041940801",
            "name": "ម៉ី ណន"
        },
        {
            "barcode": "171138177",
            "dpc": "03041940901",
            "name": "ផន សុវណ្ណ"
        },
        {
            "barcode": "171138178",
            "dpc": "03041941101",
            "name": "អ៊ុក ពន្លឺ"
        },
        {
            "barcode": "171138179",
            "dpc": "03041941201",
            "name": "គុយ ព្រឿង"
        },
        {
            "barcode": "171138180",
            "dpc": "03041941301",
            "name": "គាត ហង្ស"
        },
        {
            "barcode": "171138181",
            "dpc": "03041941401",
            "name": "យឹង សំអុន"
        },
        {
            "barcode": "171138182",
            "dpc": "03041941501",
            "name": "សេង គឹមសួ"
        },
        {
            "barcode": "171138183",
            "dpc": "03041941601",
            "name": "ម៉េង អាន"
        },
        {
            "barcode": "171138184",
            "dpc": "03041941701",
            "name": "សុង ស៊ានហ៊ូ"
        },
        {
            "barcode": "171138185",
            "dpc": "03041941801",
            "name": "មៀច បូរ៉ា"
        },
        {
            "barcode": "171138186",
            "dpc": "03041941901",
            "name": "ចៅ ម៉េងសេង"
        },
        {
            "barcode": "171138187",
            "dpc": "03041942001",
            "name": "សេង ស្រីពៅ"
        },
        {
            "barcode": "171138188",
            "dpc": "03041942101",
            "name": "យិន ធិរ៉ាក់"
        },
        {
            "barcode": "171138189",
            "dpc": "03041942201",
            "name": "ម៉ៅ សេង"
        },
        {
            "barcode": "171138190",
            "dpc": "03041939701",
            "name": "សួន ស្រីមុំ"
        },
        {
            "barcode": "171138191",
            "dpc": "03041945701",
            "name": "ផ្លុង ផល្លា"
        },
        {
            "barcode": "171138192",
            "dpc": "03041926801",
            "name": "ជៀម សេរី"
        },
        {
            "barcode": "171138193",
            "dpc": "03041926901",
            "name": "សន ជេស"
        },
        {
            "barcode": "171138194",
            "dpc": "03041927001",
            "name": "ហួត សំណាង"
        },
        {
            "barcode": "171138195",
            "dpc": "03041926701",
            "name": "អៀង ចាន់"
        },
        {
            "barcode": "171138196",
            "dpc": "03041926601",
            "name": "សាន អឿម"
        },
        {
            "barcode": "171138197",
            "dpc": "03041926401",
            "name": "ប៉ែន សន"
        },
        {
            "barcode": "171138198",
            "dpc": "03041926301",
            "name": "ជា វិន"
        },
        {
            "barcode": "171138199",
            "dpc": "03041926201",
            "name": "ខេង ឡាយ"
        },
        {
            "barcode": "171138200",
            "dpc": "03041926101",
            "name": "ជា ពុទ្ធី"
        },
        {
            "barcode": "171138201",
            "dpc": "03041926001",
            "name": "ងូវ   ទៀប"
        },
        {
            "barcode": "171138202",
            "dpc": "03041925901",
            "name": "ជី វុទ្ធី"
        },
        {
            "barcode": "171138203",
            "dpc": "03041925801",
            "name": "ប៉ោ ស៊ឹមឡី"
        },
        {
            "barcode": "171138204",
            "dpc": "03041925701",
            "name": "គឹម ចរិយា"
        },
        {
            "barcode": "171138205",
            "dpc": "03041925601",
            "name": "រ៉ន វិរិន"
        },
        {
            "barcode": "171138206",
            "dpc": "03041925501",
            "name": "មុំ សាមឌី"
        },
        {
            "barcode": "171138207",
            "dpc": "03041925401",
            "name": "សៀង ទ្រី"
        },
        {
            "barcode": "171138208",
            "dpc": "03041925301",
            "name": "យ៉ក់   ខ្វៃ"
        },
        {
            "barcode": "171138209",
            "dpc": "03041925201",
            "name": "តាំង នី"
        },
        {
            "barcode": "171138210",
            "dpc": "03041925001",
            "name": "នៅ រ៉ុង"
        },
        {
            "barcode": "171138211",
            "dpc": "03041924901",
            "name": "ឈឹម សារ៉េត"
        },
        {
            "barcode": "171138212",
            "dpc": "03041934901",
            "name": "ជា ម៉េងយូ"
        },
        {
            "barcode": "171138213",
            "dpc": "03041934801",
            "name": "បេង ហួន"
        },
        {
            "barcode": "171138214",
            "dpc": "03041934701",
            "name": "ម៉ង់ វុទ្ធី"
        },
        {
            "barcode": "171138215",
            "dpc": "03041934601",
            "name": "ម៉ង់ វិរ៉ា"
        },
        {
            "barcode": "171138216",
            "dpc": "03041934501",
            "name": "ញឹក ប៊ុនឈៀត"
        },
        {
            "barcode": "171138217",
            "dpc": "03041934301",
            "name": "ហូង  ខាត់យិង"
        },
        {
            "barcode": "171138218",
            "dpc": "03041934201",
            "name": "ប៊ុត សំអែល"
        },
        {
            "barcode": "171138219",
            "dpc": "03041934101",
            "name": "ធិញ ឆាន់"
        },
        {
            "barcode": "171138220",
            "dpc": "03041934001",
            "name": "លឿង ម៉ឹង"
        },
        {
            "barcode": "171138221",
            "dpc": "03041933901",
            "name": "ផ្លុង សាយ"
        },
        {
            "barcode": "171138222",
            "dpc": "03041933801",
            "name": "មុំ សោភ័ណ្ឌ"
        },
        {
            "barcode": "171138223",
            "dpc": "03041933701",
            "name": "ហ៊ាង ហ៊ត"
        },
        {
            "barcode": "171138224",
            "dpc": "03041933601",
            "name": "កើត មនោរក្ស"
        },
        {
            "barcode": "171138225",
            "dpc": "03041933501",
            "name": "មណ្ឌលសុខភាពទួលតាឯក"
        },
        {
            "barcode": "171138226",
            "dpc": "03041933401",
            "name": "ញ៉ែម សារ៉េម"
        },
        {
            "barcode": "171138227",
            "dpc": "03041933301",
            "name": "តាន់ សុភាព"
        },
        {
            "barcode": "171138228",
            "dpc": "03041933101",
            "name": "ខាត់ ភឿន"
        },
        {
            "barcode": "171138229",
            "dpc": "03041933001",
            "name": "ពៅ ប៊ុនហាក់"
        },
        {
            "barcode": "171138230",
            "dpc": "03041932901",
            "name": "ជូ ស៊ីម"
        },
        {
            "barcode": "171138231",
            "dpc": "03041932801",
            "name": "អ៊ិត អ៊ុត"
        },
        {
            "barcode": "171138232",
            "dpc": "03041932701",
            "name": "ភុំ ហុង"
        },
        {
            "barcode": "171138233",
            "dpc": "03041932601",
            "name": "ភួង ម៉ាប់"
        },
        {
            "barcode": "171138234",
            "dpc": "03041932501",
            "name": "អ៊ិត គឹមស្រ៊ុន"
        },
        {
            "barcode": "171138235",
            "dpc": "03041932401",
            "name": "ស្រី ស៊ុន"
        },
        {
            "barcode": "171138236",
            "dpc": "03041932201",
            "name": "អ៊ិន វណ្ណៈ"
        },
        {
            "barcode": "171138237",
            "dpc": "03041932301",
            "name": "ណាវ សុខា"
        },
        {
            "barcode": "171138238",
            "dpc": "03041932101",
            "name": "សាម ភិត"
        },
        {
            "barcode": "171138239",
            "dpc": "03041932001",
            "name": "សេង អូន"
        },
        {
            "barcode": "171138240",
            "dpc": "03041931901",
            "name": "ឡេង វិសាល២"
        },
        {
            "barcode": "171138241",
            "dpc": "03041931801",
            "name": "ប៊ុន ម៉ា"
        },
        {
            "barcode": "171138242",
            "dpc": "03041931701",
            "name": "ហ៊ុយ គឹមថេត"
        },
        {
            "barcode": "171138243",
            "dpc": "03041931601",
            "name": "គឹម ជា"
        },
        {
            "barcode": "171138244",
            "dpc": "03041931501",
            "name": "សាយ ណន"
        },
        {
            "barcode": "171138245",
            "dpc": "03041931401",
            "name": "សុ ខា"
        },
        {
            "barcode": "171138246",
            "dpc": "03041931301",
            "name": "សរ សុរិទ្ធ"
        },
        {
            "barcode": "171138247",
            "dpc": "03041931201",
            "name": "សាយ ញ៉ុន"
        },
        {
            "barcode": "171138248",
            "dpc": "03041931101",
            "name": "កេញ វ៉ឿន"
        },
        {
            "barcode": "171138249",
            "dpc": "03041931001",
            "name": "សាលាបឋមសិក្សាអូរ ២"
        },
        {
            "barcode": "171138250",
            "dpc": "03041914501",
            "name": "យឺន សំពៅ"
        },
        {
            "barcode": "171138251",
            "dpc": "03041930801",
            "name": "ភឿន ពៅ"
        },
        {
            "barcode": "171138252",
            "dpc": "03041930901",
            "name": "គាំ ឌៀប"
        },
        {
            "barcode": "171138253",
            "dpc": "03041930701",
            "name": "គង់ ស៊ីឡា"
        },
        {
            "barcode": "171138254",
            "dpc": "03041930601",
            "name": "ជា គីមឈន"
        },
        {
            "barcode": "171138255",
            "dpc": "03041930001",
            "name": "ឆេង ពៅ"
        },
        {
            "barcode": "171138256",
            "dpc": "03041930401",
            "name": "ប៉ឹង  រ៉េត"
        },
        {
            "barcode": "171138257",
            "dpc": "03041930301",
            "name": "ជា ម៉ាលី"
        },
        {
            "barcode": "171138258",
            "dpc": "03041930101",
            "name": "គី ចន្ធូ"
        },
        {
            "barcode": "171138259",
            "dpc": "03041929901",
            "name": "ប៉ុល សារឿន"
        },
        {
            "barcode": "171138260",
            "dpc": "03041929601",
            "name": "ប៉ុយ ធៀន ១"
        },
        {
            "barcode": "171138261",
            "dpc": "03041929501",
            "name": "ជុំ ជីវ័ន្ត"
        },
        {
            "barcode": "171138262",
            "dpc": "03041929301",
            "name": "សំអាង សត្យា"
        },
        {
            "barcode": "171138263",
            "dpc": "03041929201",
            "name": "ម៉ុក ឌីណា"
        },
        {
            "barcode": "171138264",
            "dpc": "03041929101",
            "name": "អាត ម៉ៅ"
        },
        {
            "barcode": "171138265",
            "dpc": "03041928901",
            "name": "អ៊ុន ប៊ុនថា"
        },
        {
            "barcode": "171138266",
            "dpc": "03041928801",
            "name": "ហឿន សារ៉ាត់"
        },
        {
            "barcode": "171138267",
            "dpc": "03041928601",
            "name": "សាញ ណយ"
        },
        {
            "barcode": "171138268",
            "dpc": "03041928501",
            "name": "ហុយ  គឹមថង"
        },
        {
            "barcode": "171138269",
            "dpc": "03041928401",
            "name": "ផេង ដានី"
        },
        {
            "barcode": "171138270",
            "dpc": "03041928201",
            "name": "នា  គ្រី"
        },
        {
            "barcode": "171138271",
            "dpc": "03041928101",
            "name": "កែវ ឈុន"
        },
        {
            "barcode": "171138272",
            "dpc": "03041928001",
            "name": "ប៉ែន សាមុត"
        },
        {
            "barcode": "171138273",
            "dpc": "03041927901",
            "name": "ជា គឹម"
        },
        {
            "barcode": "171138274",
            "dpc": "03041927801",
            "name": "ជា សំបូរ"
        },
        {
            "barcode": "171138275",
            "dpc": "03041927701",
            "name": "កែ ស៊ីណូ"
        },
        {
            "barcode": "171138276",
            "dpc": "03041927601",
            "name": "ដៀប ប៊ន"
        },
        {
            "barcode": "171138277",
            "dpc": "03041927501",
            "name": "ចាំង យូរិន"
        },
        {
            "barcode": "171138278",
            "dpc": "03041927301",
            "name": "ភឿន ភិន"
        },
        {
            "barcode": "171138279",
            "dpc": "03041927201",
            "name": "តាន់ ហ៊ាង"
        },
        {
            "barcode": "171138280",
            "dpc": "03041927101",
            "name": "ហេង វ៉ាន់នី"
        },
        {
            "barcode": "171138281",
            "dpc": "03041930201",
            "name": "ឡាំ អ៊ាប"
        },
        {
            "barcode": "171138282",
            "dpc": "03041945501",
            "name": "ភ័ណ្ឌ កែវវិចិត្រ"
        },
        {
            "barcode": "171138283",
            "dpc": "03041945001",
            "name": "ស៊ិន សេន"
        },
        {
            "barcode": "171138284",
            "dpc": "03041945601",
            "name": "ស៊ ចន្ធូ"
        },
        {
            "barcode": "171138285",
            "dpc": "03041945201",
            "name": "គង់ សំអាន"
        },
        {
            "barcode": "171138286",
            "dpc": "03041945101",
            "name": "ឌី ម៉ា"
        },
        {
            "barcode": "171138287",
            "dpc": "03041945801",
            "name": "ចាន់ សេរី"
        },
        {
            "barcode": "171138288",
            "dpc": "03041945901",
            "name": "នូច  យ៉ា"
        },
        {
            "barcode": "171138289",
            "dpc": "03041946001",
            "name": "ង៉ែត សុផល"
        },
        {
            "barcode": "171138290",
            "dpc": "03041946101",
            "name": "មុំ យាន់"
        },
        {
            "barcode": "171138291",
            "dpc": "03041946301",
            "name": "ប៉ាត់ ថន"
        },
        {
            "barcode": "171138292",
            "dpc": "03041946401",
            "name": "ចាប សៀន"
        },
        {
            "barcode": "171138293",
            "dpc": "03041946501",
            "name": "ផ្លេក ពិសិទ្ធ"
        },
        {
            "barcode": "171138294",
            "dpc": "03041946601",
            "name": "ប៉ាត់ ថុល"
        },
        {
            "barcode": "171138295",
            "dpc": "03041946701",
            "name": "ផូ ផាន់ណារិទ្ធ"
        },
        {
            "barcode": "171138296",
            "dpc": "03041946801",
            "name": "ហែម ស្រស់"
        },
        {
            "barcode": "171138297",
            "dpc": "03041946901",
            "name": "ច្រាច់ មុំ"
        },
        {
            "barcode": "171138298",
            "dpc": "03041947001",
            "name": "ប៉ក់  ម៉េង"
        },
        {
            "barcode": "171138299",
            "dpc": "03041947101",
            "name": "គឹម ស៊ីវ"
        },
        {
            "barcode": "171138300",
            "dpc": "03041947201",
            "name": "គង់ សុខលាង"
        },
        {
            "barcode": "171138301",
            "dpc": "03041947301",
            "name": "ពិន  សំបូ"
        },
        {
            "barcode": "171138302",
            "dpc": "03041947401",
            "name": "សេង សុវ​ណ្ណ"
        },
        {
            "barcode": "171138303",
            "dpc": "03041947501",
            "name": "ប៉ង សុខា"
        },
        {
            "barcode": "171138304",
            "dpc": "03041947601",
            "name": "ឈួន ទូច"
        },
        {
            "barcode": "171138305",
            "dpc": "03041947701",
            "name": "គឹម សេត"
        },
        {
            "barcode": "171138306",
            "dpc": "03041947801",
            "name": "តាត ឃោសរ៉ាត់"
        },
        {
            "barcode": "171138307",
            "dpc": "03041947901",
            "name": "អៀង សុខុម"
        },
        {
            "barcode": "171138308",
            "dpc": "03041900701",
            "name": "ប្រាក់  ឌឿន"
        },
        {
            "barcode": "171138309",
            "dpc": "03041902301",
            "name": "ប៊ុន  ឡេង"
        },
        {
            "barcode": "171138310",
            "dpc": "03041902601",
            "name": "ជួន  រឿត"
        },
        {
            "barcode": "171138311",
            "dpc": "03041903001",
            "name": "គង់  សារឿន"
        },
        {
            "barcode": "171138312",
            "dpc": "03041929701",
            "name": "អ៊ុង  ង៉ាន់"
        },
        {
            "barcode": "171138313",
            "dpc": "03041929801",
            "name": "ប៉ុយ  ធៀន  ២"
        },
        {
            "barcode": "171138314",
            "dpc": "03041930501",
            "name": "ឈឹម  ឌឿម"
        },
        {
            "barcode": "171138315",
            "dpc": "03041942301",
            "name": "ឆែម  រដ្ឋា"
        },
        {
            "barcode": "171138316",
            "dpc": "03041942401",
            "name": "វ៉ាន់   វិចិត្រ ១"
        },
        {
            "barcode": "171138317",
            "dpc": "03041942501",
            "name": "នុយ  ប៊ុនជួយ"
        },
        {
            "barcode": "171138318",
            "dpc": "03041942601",
            "name": "ឈុក   ចាន់សុផា"
        },
        {
            "barcode": "171138319",
            "dpc": "03041942801",
            "name": "ជន  អឿន"
        },
        {
            "barcode": "171138320",
            "dpc": "03041942901",
            "name": "តែ  ពៅចិន្តា"
        },
        {
            "barcode": "171138321",
            "dpc": "03041943001",
            "name": "តូច  ពិសិទ្ធ"
        },
        {
            "barcode": "171138322",
            "dpc": "03041943101",
            "name": "អ៊ុច  សារឹម"
        },
        {
            "barcode": "171138323",
            "dpc": "03041943201",
            "name": "ជូ  ជិវ័ន"
        },
        {
            "barcode": "171138324",
            "dpc": "03041943301",
            "name": "ភុំ  ជិនណារ៉ា"
        },
        {
            "barcode": "171138325",
            "dpc": "03041943401",
            "name": "កង  ហាវ"
        },
        {
            "barcode": "171138326",
            "dpc": "03041943501",
            "name": "ស្រស់  ចំរើន"
        },
        {
            "barcode": "171138327",
            "dpc": "03041943601",
            "name": "ថុក  ប៊ុនធី"
        },
        {
            "barcode": "171138328",
            "dpc": "03041943701",
            "name": "គឹម  ស្រីពៅ"
        },
        {
            "barcode": "171138329",
            "dpc": "03041943801",
            "name": "ប៉េង  អាន"
        },
        {
            "barcode": "171138330",
            "dpc": "03041944001",
            "name": "ហុង  នាង"
        },
        {
            "barcode": "171138331",
            "dpc": "03041944101",
            "name": "សេង  ចាង"
        },
        {
            "barcode": "171138332",
            "dpc": "03041944201",
            "name": "សាំង  ឈិនហ៊ួ"
        },
        {
            "barcode": "171138333",
            "dpc": "03041944301",
            "name": "សឺន  សឿប"
        },
        {
            "barcode": "171138334",
            "dpc": "03041944401",
            "name": "ហម  សៀកឡាយ"
        },
        {
            "barcode": "171138335",
            "dpc": "03041944501",
            "name": "យ៉ាន់  ពេជ្រ"
        },
        {
            "barcode": "171138336",
            "dpc": "03041944601",
            "name": "ស៊ូ  ស៊ី"
        },
        {
            "barcode": "171138337",
            "dpc": "03041944701",
            "name": "រុន  ខុងណែត"
        },
        {
            "barcode": "171138338",
            "dpc": "03041944801",
            "name": "យ៉ាំ  ហុង"
        },
        {
            "barcode": "171138339",
            "dpc": "03041944901",
            "name": "ស៊ូន  នី"
        },
        {
            "barcode": "171138340",
            "dpc": "03041945301",
            "name": "គង់  សាន"
        },
        {
            "barcode": "171138341",
            "dpc": "03041945401",
            "name": "ថ្លែង  ហូ"
        },
        {
            "barcode": "171138342",
            "dpc": "03041946201",
            "name": "ឡុង  សំអឿន"
        },
        {
            "barcode": "171138343",
            "dpc": "03041901701",
            "name": "ឈឹម ចន្ថា"
        },
        {
            "barcode": "171138344",
            "dpc": "03041901601",
            "name": "កើត​ យុថា"
        },
        {
            "barcode": "171138345",
            "dpc": "03041901501",
            "name": "ទុយ ចាន់រតនះ"
        },
        {
            "barcode": "171138346",
            "dpc": "03041901401",
            "name": "យួម រ៉ាមី"
        },
        {
            "barcode": "171138347",
            "dpc": "03041900501",
            "name": "ស្វាយ ចាន់តារ៉ា"
        },
        {
            "barcode": "171138348",
            "dpc": "03041900401",
            "name": "ស្វាយ ចាន់ថា"
        },
        {
            "barcode": "171138349",
            "dpc": "03041900801",
            "name": "សាត សារ៉េត"
        },
        {
            "barcode": "171138350",
            "dpc": "03041900901",
            "name": "ម៉ែន ភេន"
        },
        {
            "barcode": "171138351",
            "dpc": "03041901001",
            "name": "សឿម រិន"
        },
        {
            "barcode": "171138352",
            "dpc": "03041901101",
            "name": "បៀន សាម៉ុន"
        },
        {
            "barcode": "171138353",
            "dpc": "03041901201",
            "name": "ស្វាយ ផល្លី"
        },
        {
            "barcode": "171138354",
            "dpc": "03041901301",
            "name": "សឿម ស្រី"
        },
        {
            "barcode": "171138355",
            "dpc": "03041900301",
            "name": "សាលាឃុំស្វាយប៉ោ"
        },
        {
            "barcode": "171138356",
            "dpc": "03041901901",
            "name": "យស់ សុគន្ធារិន្ទ"
        },
        {
            "barcode": "171138357",
            "dpc": "03041902001",
            "name": "ណុប  អេង"
        },
        {
            "barcode": "171138358",
            "dpc": "03041929401",
            "name": "ទូច  ផល្លី"
        },
        {
            "barcode": "171138359",
            "dpc": "03041902101",
            "name": "លឿង វិបុល"
        },
        {
            "barcode": "171138360",
            "dpc": "03041948001",
            "name": "សេង សាំងហុន"
        },
        {
            "barcode": "171142745",
            "dpc": "03041936701",
            "name": "ប៉ាត់  សំណាង"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
