let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=

    [
        {
            "barcode": "171138800",
            "dpc": "03042000101",
            "name": "លឿង រំចេក"
        },
        {
            "barcode": "171138801",
            "dpc": "03042000301",
            "name": "ជួប សុខុម"
        },
        {
            "barcode": "171138802",
            "dpc": "03042000501",
            "name": "លី ភក្តី"
        },
        {
            "barcode": "171138803",
            "dpc": "03042000401",
            "name": "អាហារដ្ឋានស្តាហ្វូត"
        },
        {
            "barcode": "171138804",
            "dpc": "03042000601",
            "name": "ផាត់ ណារុន"
        },
        {
            "barcode": "171138805",
            "dpc": "03042000701",
            "name": "ហូរ ភូរិន្ទ"
        },
        {
            "barcode": "171138806",
            "dpc": "03042000801",
            "name": "ឡុង សូផន"
        },
        {
            "barcode": "171138807",
            "dpc": "03042000901",
            "name": "លាក់ លួម"
        },
        {
            "barcode": "171138808",
            "dpc": "03042001001",
            "name": "ឈឹម ឌឹម"
        },
        {
            "barcode": "171138809",
            "dpc": "03042001101",
            "name": "ប៉ែន សារិន្ទ"
        },
        {
            "barcode": "171138810",
            "dpc": "03042001201",
            "name": "ជិម ជំនិត"
        },
        {
            "barcode": "171138811",
            "dpc": "03042001301",
            "name": "ញ៉ែត ចយ"
        },
        {
            "barcode": "171138812",
            "dpc": "03042001401",
            "name": "ឈុគ ចន្ថា"
        },
        {
            "barcode": "171138813",
            "dpc": "03042001501",
            "name": "សេង លក្ខិណា"
        },
        {
            "barcode": "171138814",
            "dpc": "03042001601",
            "name": "សូរ ទូន"
        },
        {
            "barcode": "171138815",
            "dpc": "03042001701",
            "name": "អោគ គុណ"
        },
        {
            "barcode": "171138816",
            "dpc": "03042001801",
            "name": "លី សំបឿន"
        },
        {
            "barcode": "171138817",
            "dpc": "03042001901",
            "name": "យូ សារឿន"
        },
        {
            "barcode": "171138818",
            "dpc": "03042002001",
            "name": "សៀង ណារិទ្ធ"
        },
        {
            "barcode": "171138819",
            "dpc": "03042002101",
            "name": "ឈួង វណ្ណា"
        },
        {
            "barcode": "171138820",
            "dpc": "03042002301",
            "name": "ជួន  សួរ"
        },
        {
            "barcode": "171138821",
            "dpc": "03042002401",
            "name": "ហុង គឹមលាង"
        },
        {
            "barcode": "171138822",
            "dpc": "03042002501",
            "name": "គង់ ពេជ្រ"
        },
        {
            "barcode": "171138823",
            "dpc": "03042002601",
            "name": "ឡម ស៊ីនឿន"
        },
        {
            "barcode": "171138824",
            "dpc": "03042002701",
            "name": "សុខ សារ៉ុម"
        },
        {
            "barcode": "171138825",
            "dpc": "03042002901",
            "name": "សុខ ផល្លី"
        },
        {
            "barcode": "171138826",
            "dpc": "03042003001",
            "name": "រិទ្ធ គឹមឡាង"
        },
        {
            "barcode": "171138827",
            "dpc": "03042023901",
            "name": "ឆេង សុភាព"
        },
        {
            "barcode": "171138828",
            "dpc": "03042024001",
            "name": "ឆេង សេងហាក់"
        },
        {
            "barcode": "171138829",
            "dpc": "03042024201",
            "name": "ហែម ក្យូ"
        },
        {
            "barcode": "171138830",
            "dpc": "03042024301",
            "name": "សាន់ ខា"
        },
        {
            "barcode": "171138831",
            "dpc": "03042024401",
            "name": "ហ៊ាន ប៉េងស្រ៊ុន"
        },
        {
            "barcode": "171138832",
            "dpc": "03042024501",
            "name": "ណៃ ព្រីឆា"
        },
        {
            "barcode": "171138833",
            "dpc": "03042024601",
            "name": "នី សាវ៉ាត់"
        },
        {
            "barcode": "171138834",
            "dpc": "03042024701",
            "name": "អៀប រឿប"
        },
        {
            "barcode": "171138835",
            "dpc": "03042024801",
            "name": "សួន សាវ៉េត"
        },
        {
            "barcode": "171138836",
            "dpc": "03042024901",
            "name": "ជៀម ទុំ"
        },
        {
            "barcode": "171138837",
            "dpc": "03042025201",
            "name": "ទន់ យឿន"
        },
        {
            "barcode": "171138838",
            "dpc": "03042025301",
            "name": "ឆាយ ឆេង"
        },
        {
            "barcode": "171138839",
            "dpc": "03042025401",
            "name": "ស៊ូ ឃោ"
        },
        {
            "barcode": "171138840",
            "dpc": "03042025501",
            "name": "អ៊ឹម ស្រីមុំ"
        },
        {
            "barcode": "171138841",
            "dpc": "03042025601",
            "name": "អ៊ុំ អែម"
        },
        {
            "barcode": "171138842",
            "dpc": "03042025701",
            "name": "យិន  ថារី"
        },
        {
            "barcode": "171138843",
            "dpc": "03042025901",
            "name": "គង់ សុភ័ក្ត"
        },
        {
            "barcode": "171138844",
            "dpc": "03042026001",
            "name": "ឡត សារ៉េត"
        },
        {
            "barcode": "171138845",
            "dpc": "03042026101",
            "name": "ម៉ី សៅ"
        },
        {
            "barcode": "171138846",
            "dpc": "03042026401",
            "name": "អ៊ុំ ប៉េងសុង"
        },
        {
            "barcode": "171138847",
            "dpc": "03042026501",
            "name": "ប៉ាល់ ហូរ"
        },
        {
            "barcode": "171138848",
            "dpc": "03042026601",
            "name": "សាំង ណារិន"
        },
        {
            "barcode": "171138849",
            "dpc": "03042026701",
            "name": "ឆេង ឈួន"
        },
        {
            "barcode": "171138850",
            "dpc": "03042026801",
            "name": "យ៉ែម សិរីវត្ត"
        },
        {
            "barcode": "171138851",
            "dpc": "03042026901",
            "name": "ពេជ្រ វណ្ណី"
        },
        {
            "barcode": "171138852",
            "dpc": "03042027001",
            "name": "ជា សុខា"
        },
        {
            "barcode": "171138853",
            "dpc": "03042027101",
            "name": "វង្ស ខាន់"
        },
        {
            "barcode": "171138854",
            "dpc": "03042027201",
            "name": "ឡាយ ហ៊ុំ"
        },
        {
            "barcode": "171138855",
            "dpc": "03042027301",
            "name": "ហម ហ៊ន"
        },
        {
            "barcode": "171138856",
            "dpc": "03042027401",
            "name": "ជូ ចាន់រិទ្ធ"
        },
        {
            "barcode": "171138857",
            "dpc": "03042027501",
            "name": "ស៊ុន ណារ៉េត"
        },
        {
            "barcode": "171138858",
            "dpc": "03042027601",
            "name": "តាំង ជាទ្រី"
        },
        {
            "barcode": "171138859",
            "dpc": "03042027701",
            "name": "ពិន សុវណ្ណ"
        },
        {
            "barcode": "171138860",
            "dpc": "03042027901",
            "name": "សោម សុផល"
        },
        {
            "barcode": "171138861",
            "dpc": "03042028001",
            "name": "មៀន បូ"
        },
        {
            "barcode": "171138862",
            "dpc": "03042028101",
            "name": "គឹម ពន្លក"
        },
        {
            "barcode": "171138863",
            "dpc": "03042028201",
            "name": "សួស សុភ័ក្រ"
        },
        {
            "barcode": "171138864",
            "dpc": "03042028301",
            "name": "ក្រូច ថែន"
        },
        {
            "barcode": "171138865",
            "dpc": "03042028501",
            "name": "ជា លី"
        },
        {
            "barcode": "171138866",
            "dpc": "03042028601",
            "name": "ស៊ឹម ឆេង"
        },
        {
            "barcode": "171138867",
            "dpc": "03042028701",
            "name": "ឆេង ហឿន"
        },
        {
            "barcode": "171138868",
            "dpc": "03042028801",
            "name": "ឈួន គឹមហេង"
        },
        {
            "barcode": "171138869",
            "dpc": "03042004201",
            "name": "ឌុំ ធារ៉ាក់"
        },
        {
            "barcode": "171138870",
            "dpc": "03042004401",
            "name": "ខេង សេដ្ឋា"
        },
        {
            "barcode": "171138871",
            "dpc": "03042008701",
            "name": "ឆាន់ ឌី ១"
        },
        {
            "barcode": "171138872",
            "dpc": "03042008801",
            "name": "លឹម ដារ៉ុង"
        },
        {
            "barcode": "171138873",
            "dpc": "03042008901",
            "name": "ស៊ុន ថេង"
        },
        {
            "barcode": "171138874",
            "dpc": "03042009001",
            "name": "កេង ស្សី"
        },
        {
            "barcode": "171138875",
            "dpc": "03042009101",
            "name": "កែវ សម្បត្តិ"
        },
        {
            "barcode": "171138876",
            "dpc": "03042009501",
            "name": "លាង សារ៉េន"
        },
        {
            "barcode": "171138877",
            "dpc": "03042009801",
            "name": "ជុង ឈី"
        },
        {
            "barcode": "171138878",
            "dpc": "03042009901",
            "name": "ធិន សារិន"
        },
        {
            "barcode": "171138879",
            "dpc": "03042010001",
            "name": "សោម កាឌុល"
        },
        {
            "barcode": "171138880",
            "dpc": "03042010201",
            "name": "កែវ ស៊ុន (មុខ)"
        },
        {
            "barcode": "171138881",
            "dpc": "03042010301",
            "name": "កែវ ស៊ុន (លើ)"
        },
        {
            "barcode": "171138882",
            "dpc": "03042010401",
            "name": "ហុក កុសល់"
        },
        {
            "barcode": "171138883",
            "dpc": "03042010501",
            "name": "សេង ហួត"
        },
        {
            "barcode": "171138884",
            "dpc": "03042010601",
            "name": "សៀង សង់ឯម"
        },
        {
            "barcode": "171138885",
            "dpc": "03042010701",
            "name": "ស៊ិន ស៊ីណាន"
        },
        {
            "barcode": "171138886",
            "dpc": "03042010801",
            "name": "គឹម វែង"
        },
        {
            "barcode": "171138887",
            "dpc": "03042010901",
            "name": "អ៊ុក ប្រុក"
        },
        {
            "barcode": "171138888",
            "dpc": "03042011201",
            "name": "សៀង ឯមវិសាលរ៉ាស៊ី"
        },
        {
            "barcode": "171138889",
            "dpc": "03042006301",
            "name": "ឆាន់ ឌី៧"
        },
        {
            "barcode": "171138890",
            "dpc": "03042006401",
            "name": "អ៊ឹង នី"
        },
        {
            "barcode": "171138891",
            "dpc": "03042006501",
            "name": "ឡែក  តង"
        },
        {
            "barcode": "171138892",
            "dpc": "03042006601",
            "name": "គង់ ឌឺ"
        },
        {
            "barcode": "171138893",
            "dpc": "03042006801",
            "name": "ស្រេង ខុន"
        },
        {
            "barcode": "171138894",
            "dpc": "03042006901",
            "name": "លន់ ស្រូយ"
        },
        {
            "barcode": "171138895",
            "dpc": "03042007001",
            "name": "ស៊ុង  ឌីណា"
        },
        {
            "barcode": "171138896",
            "dpc": "03042007101",
            "name": "តុប សៀរ"
        },
        {
            "barcode": "171138897",
            "dpc": "03042007201",
            "name": "ម៉ែន សួរ"
        },
        {
            "barcode": "171138898",
            "dpc": "03042007301",
            "name": "ខាន់ សាវុធ"
        },
        {
            "barcode": "171138899",
            "dpc": "03042007601",
            "name": "ម៉ុន ម៉ុត"
        },
        {
            "barcode": "171138900",
            "dpc": "03042007701",
            "name": "ឆាន់ ឌី ៥"
        },
        {
            "barcode": "171138901",
            "dpc": "03042007801",
            "name": "អ៊ូច ឃ៊ីម"
        },
        {
            "barcode": "171138902",
            "dpc": "03042008101",
            "name": "ឆៃ  ឆិល"
        },
        {
            "barcode": "171138903",
            "dpc": "03042008001",
            "name": "អ៊ូ ចិន"
        },
        {
            "barcode": "171138904",
            "dpc": "03042007901",
            "name": "ឈឿម សុខា"
        },
        {
            "barcode": "171138905",
            "dpc": "03042008301",
            "name": "ជឹម  ធាវី"
        },
        {
            "barcode": "171138906",
            "dpc": "03042008201",
            "name": "ឆាន់ ឌី ២"
        },
        {
            "barcode": "171138907",
            "dpc": "03042008601",
            "name": "ស៊ុម តក់"
        },
        {
            "barcode": "171138908",
            "dpc": "03042008501",
            "name": "លាង សារ៉េន ២"
        },
        {
            "barcode": "171138909",
            "dpc": "03042008401",
            "name": "បេន សាវុធ"
        },
        {
            "barcode": "171138910",
            "dpc": "03042007401",
            "name": "មៀច បាន"
        },
        {
            "barcode": "171138911",
            "dpc": "03042006201",
            "name": "ម៉ែន ឃុន"
        },
        {
            "barcode": "171138912",
            "dpc": "03042003101",
            "name": "ដាញ់ ស៊ឹម"
        },
        {
            "barcode": "171138913",
            "dpc": "03042003301",
            "name": "ឆាន់ ជួយ"
        },
        {
            "barcode": "171138914",
            "dpc": "03042003401",
            "name": "ភូ គឹមហ៊ុន"
        },
        {
            "barcode": "171138915",
            "dpc": "03042003501",
            "name": "ទៀង សារ៉ន"
        },
        {
            "barcode": "171138916",
            "dpc": "03042003601",
            "name": "សុក កែន"
        },
        {
            "barcode": "171138917",
            "dpc": "03042003701",
            "name": "ប៊ុន ម៉េង"
        },
        {
            "barcode": "171138918",
            "dpc": "03042003801",
            "name": "អ៊ិន សាម៉ុន"
        },
        {
            "barcode": "171138919",
            "dpc": "03042003901",
            "name": "គុជ នាង"
        },
        {
            "barcode": "171138920",
            "dpc": "03042004001",
            "name": "ជឹម ភើយ"
        },
        {
            "barcode": "171138921",
            "dpc": "03042006001",
            "name": "ដែង  មករា"
        },
        {
            "barcode": "171138922",
            "dpc": "03042005901",
            "name": "អ៊ុយ ហោ"
        },
        {
            "barcode": "171138923",
            "dpc": "03042005801",
            "name": "សរ សាវន"
        },
        {
            "barcode": "171138924",
            "dpc": "03042005701",
            "name": "អ៊ាប ម៉េងឡេង"
        },
        {
            "barcode": "171138925",
            "dpc": "03042005501",
            "name": "ថេត លឿត"
        },
        {
            "barcode": "171138926",
            "dpc": "03042005401",
            "name": "កែវ សាវី"
        },
        {
            "barcode": "171138927",
            "dpc": "03042005201",
            "name": "ហួរ  ឆុង"
        },
        {
            "barcode": "171138928",
            "dpc": "03042005101",
            "name": "ហាក់ ឆៃលាង"
        },
        {
            "barcode": "171138929",
            "dpc": "03042005001",
            "name": "តែ លី"
        },
        {
            "barcode": "171138930",
            "dpc": "03042004901",
            "name": "ប៊ុន ថុង"
        },
        {
            "barcode": "171138931",
            "dpc": "03042004801",
            "name": "ឆុង ឆៃលី"
        },
        {
            "barcode": "171138932",
            "dpc": "03042004701",
            "name": "ង៉ូវ ហួយ"
        },
        {
            "barcode": "171138933",
            "dpc": "03042004601",
            "name": "ឆោម រី"
        },
        {
            "barcode": "171138934",
            "dpc": "03042004501",
            "name": "ផន វណ្ណថា"
        },
        {
            "barcode": "171138935",
            "dpc": "03042011601",
            "name": "វឹង ហាំង ១"
        },
        {
            "barcode": "171138936",
            "dpc": "03042011701",
            "name": "វឹង ហាំង ២"
        },
        {
            "barcode": "171138937",
            "dpc": "03042011501",
            "name": "ស៊្រុន  គីមហុង"
        },
        {
            "barcode": "171138938",
            "dpc": "03042011401",
            "name": "ឈឹម ណារ៉ុង"
        },
        {
            "barcode": "171138939",
            "dpc": "03042011301",
            "name": "អ៊ុង សារ៉ាវី"
        },
        {
            "barcode": "171138940",
            "dpc": "03042012501",
            "name": "ប៊ូ គង់"
        },
        {
            "barcode": "171138941",
            "dpc": "03042012301",
            "name": "ប៉ែន ណាច"
        },
        {
            "barcode": "171138942",
            "dpc": "03042012201",
            "name": "ស៊ាង ហួត"
        },
        {
            "barcode": "171138943",
            "dpc": "03042012101",
            "name": "អ៊ុក ស៊ុន"
        },
        {
            "barcode": "171138944",
            "dpc": "03042012001",
            "name": "គឹម ធីសោភ័ណ្ឌ"
        },
        {
            "barcode": "171138945",
            "dpc": "03042011901",
            "name": "ជឹម ដារ៉ារដ្ឋ"
        },
        {
            "barcode": "171138946",
            "dpc": "03042011801",
            "name": "សឹង ថន"
        },
        {
            "barcode": "171138947",
            "dpc": "03042012801",
            "name": "ឡេង សេងណា"
        },
        {
            "barcode": "171138948",
            "dpc": "03042012701",
            "name": "សេរី ចរិយា"
        },
        {
            "barcode": "171138949",
            "dpc": "03042012901",
            "name": "លី ស្រីពៅ"
        },
        {
            "barcode": "171138950",
            "dpc": "03042013001",
            "name": "សាត តារា"
        },
        {
            "barcode": "171138951",
            "dpc": "03042013101",
            "name": "ប៉ិច សុខចាន់"
        },
        {
            "barcode": "171138952",
            "dpc": "03042013301",
            "name": "រស់ វិសិទ្ធ"
        },
        {
            "barcode": "171138953",
            "dpc": "03042013401",
            "name": "ប្រាក់ សំបូរ"
        },
        {
            "barcode": "171138954",
            "dpc": "03042013501",
            "name": "យិន ស៊ីណា"
        },
        {
            "barcode": "171138955",
            "dpc": "03042013601",
            "name": "ភេទ សុផុន"
        },
        {
            "barcode": "171138956",
            "dpc": "03042013701",
            "name": "សាយ ផាត"
        },
        {
            "barcode": "171138957",
            "dpc": "03042013801",
            "name": "តុង គឹមជាង"
        },
        {
            "barcode": "171138958",
            "dpc": "03042013901",
            "name": "នង សារុន"
        },
        {
            "barcode": "171138959",
            "dpc": "03042014001",
            "name": "ជឹម សុខា"
        },
        {
            "barcode": "171138960",
            "dpc": "03042014101",
            "name": "តុល សុផាត"
        },
        {
            "barcode": "171138961",
            "dpc": "03042014201",
            "name": "ធឹង គឹមហេង"
        },
        {
            "barcode": "171138962",
            "dpc": "03042014301",
            "name": "ជា ហ៊ាន"
        },
        {
            "barcode": "171138963",
            "dpc": "03042014401",
            "name": "ជា វ៉ាសាយ"
        },
        {
            "barcode": "171138964",
            "dpc": "03042014501",
            "name": "សៅ សំអុល"
        },
        {
            "barcode": "171138965",
            "dpc": "03042014601",
            "name": "ជា ស្រីទូច"
        },
        {
            "barcode": "171138966",
            "dpc": "03042014701",
            "name": "អ៊ុក សំអ៊ុន"
        },
        {
            "barcode": "171138967",
            "dpc": "03042014801",
            "name": "សុខ ប៊ុនធឿន"
        },
        {
            "barcode": "171138968",
            "dpc": "03042014901",
            "name": "ឡាច សំអាន"
        },
        {
            "barcode": "171138969",
            "dpc": "03042015001",
            "name": "ឡេង ខាន់"
        },
        {
            "barcode": "171138970",
            "dpc": "03042015101",
            "name": "រ៉ាត់ ថាវី"
        },
        {
            "barcode": "171138971",
            "dpc": "03042015201",
            "name": "អ៊ីវ ថន"
        },
        {
            "barcode": "171138972",
            "dpc": "03042015401",
            "name": "ទ្រី សុង"
        },
        {
            "barcode": "171138973",
            "dpc": "03042033201",
            "name": "ភូ សារឿន"
        },
        {
            "barcode": "171138974",
            "dpc": "03042033301",
            "name": "ប៉ាច សុគុណ្ណា"
        },
        {
            "barcode": "171138975",
            "dpc": "03042033401",
            "name": "នួន ណែម"
        },
        {
            "barcode": "171138976",
            "dpc": "03042015501",
            "name": "កុមារកំព្រារ"
        },
        {
            "barcode": "171138977",
            "dpc": "03042035601",
            "name": "លីអើរ៉ុនស៊ីថាន់"
        },
        {
            "barcode": "171138978",
            "dpc": "03042019801",
            "name": "ស្សី សាង"
        },
        {
            "barcode": "171138979",
            "dpc": "03042019901",
            "name": "ចេង សុខគាង"
        },
        {
            "barcode": "171138980",
            "dpc": "03042020001",
            "name": "យឹម សុខា"
        },
        {
            "barcode": "171138981",
            "dpc": "03042020101",
            "name": "អ៊ុក ណង"
        },
        {
            "barcode": "171138982",
            "dpc": "03042020201",
            "name": "អៀក កៀវ"
        },
        {
            "barcode": "171138983",
            "dpc": "03042020301",
            "name": "សៀង គឹមយី"
        },
        {
            "barcode": "171138984",
            "dpc": "03042020501",
            "name": "លី  គឹមធី"
        },
        {
            "barcode": "171138985",
            "dpc": "03042020701",
            "name": "ជីវ  ដឿន ២"
        },
        {
            "barcode": "171138986",
            "dpc": "03042019001",
            "name": "អ៊ិត សុប៉ុញ"
        },
        {
            "barcode": "171138987",
            "dpc": "03042020801",
            "name": "ជា រស់"
        },
        {
            "barcode": "171138988",
            "dpc": "03042020901",
            "name": "ថៃ  ហេង"
        },
        {
            "barcode": "171138989",
            "dpc": "03042021001",
            "name": "ថាត សារ៉េត"
        },
        {
            "barcode": "171138990",
            "dpc": "03042021201",
            "name": "ចឹក ខឹម"
        },
        {
            "barcode": "171138991",
            "dpc": "03042021301",
            "name": "គឹម វុធ"
        },
        {
            "barcode": "171138992",
            "dpc": "03042021401",
            "name": "យស់ សោភា"
        },
        {
            "barcode": "171138993",
            "dpc": "03042021501",
            "name": "ឌួង សុខុន"
        },
        {
            "barcode": "171138994",
            "dpc": "03042021601",
            "name": "សាញ់ ហួយ"
        },
        {
            "barcode": "171138995",
            "dpc": "03042021701",
            "name": "ប៉ាន់ ផល្លា"
        },
        {
            "barcode": "171138996",
            "dpc": "03042021901",
            "name": "ប៉ែន វណ្ណា"
        },
        {
            "barcode": "171138997",
            "dpc": "03042022001",
            "name": "សេង សុខា"
        },
        {
            "barcode": "171138998",
            "dpc": "03042022101",
            "name": "វ៉ាត់ សុវណ្ណ"
        },
        {
            "barcode": "171138999",
            "dpc": "03042011101",
            "name": "ឈិន ឆេត"
        },
        {
            "barcode": "171139000",
            "dpc": "03042022201",
            "name": "សៀង ហេង"
        },
        {
            "barcode": "171139001",
            "dpc": "03042022301",
            "name": "ហួត លុយ"
        },
        {
            "barcode": "171139002",
            "dpc": "03042022401",
            "name": "ស៊ូ សារិន"
        },
        {
            "barcode": "171139003",
            "dpc": "03042022501",
            "name": "ចក់ ពេជ្រ"
        },
        {
            "barcode": "171139004",
            "dpc": "03042022601",
            "name": "សំ ផល្លី"
        },
        {
            "barcode": "171139005",
            "dpc": "03042022701",
            "name": "មឿន មាន"
        },
        {
            "barcode": "171139006",
            "dpc": "03042022801",
            "name": "សូ សយ"
        },
        {
            "barcode": "171139007",
            "dpc": "03042022901",
            "name": "ជា ចំរ៉ុង"
        },
        {
            "barcode": "171139008",
            "dpc": "03042023001",
            "name": "កែវ សំ"
        },
        {
            "barcode": "171139009",
            "dpc": "03042023101",
            "name": "យូ សេងហ៊ាង"
        },
        {
            "barcode": "171139010",
            "dpc": "03042023201",
            "name": "ប៊ុន ធឿន"
        },
        {
            "barcode": "171139011",
            "dpc": "03042023301",
            "name": "ប៉ែន ឡឹង"
        },
        {
            "barcode": "171139012",
            "dpc": "03042023401",
            "name": "សោម សុមាលី"
        },
        {
            "barcode": "171139013",
            "dpc": "03042023501",
            "name": "សួង រ៉ា"
        },
        {
            "barcode": "171139014",
            "dpc": "03042023601",
            "name": "ញ៉ែម វណ្ឌី"
        },
        {
            "barcode": "171139015",
            "dpc": "03042023701",
            "name": "វ៉ាន់ សុធាវី"
        },
        {
            "barcode": "171139016",
            "dpc": "03042012401",
            "name": "សុខ  សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171139017",
            "dpc": "03042015301",
            "name": "គឹម  ណាវី"
        },
        {
            "barcode": "171139018",
            "dpc": "03042015701",
            "name": "ស្រី  ស៊្ររ"
        },
        {
            "barcode": "171139019",
            "dpc": "03042015801",
            "name": "ជុំ  សុភាព"
        },
        {
            "barcode": "171139020",
            "dpc": "03042015901",
            "name": "ថាប់  ធឿន"
        },
        {
            "barcode": "171139021",
            "dpc": "03042016001",
            "name": "មិន  ថាវី"
        },
        {
            "barcode": "171139022",
            "dpc": "03042016101",
            "name": "អ៊ុំ  សុធិញ"
        },
        {
            "barcode": "171139023",
            "dpc": "03042016201",
            "name": "កែវ  សុផន"
        },
        {
            "barcode": "171139024",
            "dpc": "03042016301",
            "name": "ម៉ម  សារឿន"
        },
        {
            "barcode": "171139025",
            "dpc": "03042016401",
            "name": "ឈិត  ថា"
        },
        {
            "barcode": "171139026",
            "dpc": "03042016501",
            "name": "សំ  សុខុម"
        },
        {
            "barcode": "171139027",
            "dpc": "03042016601",
            "name": "ជា  ចាន់ដា"
        },
        {
            "barcode": "171139028",
            "dpc": "03042016701",
            "name": "ហួត  លីឆេង"
        },
        {
            "barcode": "171139029",
            "dpc": "03042016801",
            "name": "នាង  វណ្ណះ"
        },
        {
            "barcode": "171139030",
            "dpc": "03042016901",
            "name": "សេង  ផន"
        },
        {
            "barcode": "171139031",
            "dpc": "03042017001",
            "name": "ហឿន  ឌីន"
        },
        {
            "barcode": "171139032",
            "dpc": "03042017101",
            "name": "ឡ  គឹមលន់"
        },
        {
            "barcode": "171139033",
            "dpc": "03042017201",
            "name": "ជាម  តេង"
        },
        {
            "barcode": "171139034",
            "dpc": "03042017301",
            "name": "ចក់  រិទ្ធី"
        },
        {
            "barcode": "171139035",
            "dpc": "03042017401",
            "name": "អ៊ឹង  ផល្គុន"
        },
        {
            "barcode": "171139036",
            "dpc": "03042017501",
            "name": "គង់  កុសល្យ"
        },
        {
            "barcode": "171139037",
            "dpc": "03042017601",
            "name": "ឌី  សុវណ្ណ"
        },
        {
            "barcode": "171139038",
            "dpc": "03042017701",
            "name": "ម៉ាង  គឹមស៊ាន"
        },
        {
            "barcode": "171139039",
            "dpc": "03042017901",
            "name": "ប៊ុន  មុំ"
        },
        {
            "barcode": "171139040",
            "dpc": "03042018001",
            "name": "ឈិន  សំណាង"
        },
        {
            "barcode": "171139041",
            "dpc": "03042018101",
            "name": "តឹក  សំណាក់ ១"
        },
        {
            "barcode": "171139042",
            "dpc": "03042018201",
            "name": "តឹក  សំណាក់ ២"
        },
        {
            "barcode": "171139043",
            "dpc": "03042018301",
            "name": "ហាក់   លាន"
        },
        {
            "barcode": "171139044",
            "dpc": "03042018401",
            "name": "ឃី  យ៉ា"
        },
        {
            "barcode": "171139045",
            "dpc": "03042018501",
            "name": "ងួន  លាង"
        },
        {
            "barcode": "171139046",
            "dpc": "03042018601",
            "name": "តិច  ជ្រិន"
        },
        {
            "barcode": "171139047",
            "dpc": "03042018701",
            "name": "ហែម  ប៉ាច"
        },
        {
            "barcode": "171139048",
            "dpc": "03042018801",
            "name": "ងិន  សំអុន"
        },
        {
            "barcode": "171139049",
            "dpc": "03042018901",
            "name": "ម៉ម  សារឿន"
        },
        {
            "barcode": "171139050",
            "dpc": "03042019101",
            "name": "ហេង  រតនា"
        },
        {
            "barcode": "171139051",
            "dpc": "03042019201",
            "name": "ខៀវ  តារា"
        },
        {
            "barcode": "171139052",
            "dpc": "03042019401",
            "name": "ប៊ិច  ប៊ុនធឿន"
        },
        {
            "barcode": "171139053",
            "dpc": "03042019501",
            "name": "វ៉ាត  វីរៈ"
        },
        {
            "barcode": "171139054",
            "dpc": "03042019701",
            "name": "សេក  ឆក"
        },
        {
            "barcode": "171139055",
            "dpc": "03042028901",
            "name": "ឆោម  ឆូយ"
        },
        {
            "barcode": "171139056",
            "dpc": "03042029001",
            "name": "រ៉ែម  ណេង"
        },
        {
            "barcode": "171139057",
            "dpc": "03042029101",
            "name": "ឆោម  ឆាត់"
        },
        {
            "barcode": "171139058",
            "dpc": "03042029201",
            "name": "ខ្លូត  ចំរ៉ាត់"
        },
        {
            "barcode": "171139059",
            "dpc": "03042029301",
            "name": "ចក់  សុន"
        },
        {
            "barcode": "171139060",
            "dpc": "03042029601",
            "name": "ព្រុំ  រាសី"
        },
        {
            "barcode": "171139061",
            "dpc": "03042029701",
            "name": "ជឿន  ដេត"
        },
        {
            "barcode": "171139062",
            "dpc": "03042029801",
            "name": "ហែម  អឿន"
        },
        {
            "barcode": "171139063",
            "dpc": "03042029901",
            "name": "ផេង  ឡូញ"
        },
        {
            "barcode": "171139064",
            "dpc": "03042030001",
            "name": "សួស  សុភ័ក្រ ២"
        },
        {
            "barcode": "171139065",
            "dpc": "03042030201",
            "name": "ព្រំ  គឹមឆេង"
        },
        {
            "barcode": "171139066",
            "dpc": "03042030301",
            "name": "សួន  តាំង"
        },
        {
            "barcode": "171139067",
            "dpc": "03042030401",
            "name": "ឡៅ  សុខា"
        },
        {
            "barcode": "171139068",
            "dpc": "03042030501",
            "name": "ឃុត  សំផុន"
        },
        {
            "barcode": "171139069",
            "dpc": "03042030601",
            "name": "ចែម  សារិទ្ធ"
        },
        {
            "barcode": "171139070",
            "dpc": "03042030701",
            "name": "សំ  ភារុំ"
        },
        {
            "barcode": "171139071",
            "dpc": "03042030801",
            "name": "ឆន  ឈៀង"
        },
        {
            "barcode": "171139072",
            "dpc": "03042030901",
            "name": "គង់  គា"
        },
        {
            "barcode": "171139073",
            "dpc": "03042031001",
            "name": "សូ  សុគន្ធា"
        },
        {
            "barcode": "171139074",
            "dpc": "03042031101",
            "name": "វណ្ណ  មឿន"
        },
        {
            "barcode": "171139075",
            "dpc": "03042031201",
            "name": "អ៊ុក  តែម"
        },
        {
            "barcode": "171139076",
            "dpc": "03042031301",
            "name": "ឈឹម  យ៉េង"
        },
        {
            "barcode": "171139077",
            "dpc": "03042031401",
            "name": "ទិត្យ  យង់"
        },
        {
            "barcode": "171139078",
            "dpc": "03042031501",
            "name": "ឌុក  ពូល"
        },
        {
            "barcode": "171139079",
            "dpc": "03042031601",
            "name": "ឡត  សារ៉េត"
        },
        {
            "barcode": "171139080",
            "dpc": "03042031701",
            "name": "អ៊ុង  សុផល"
        },
        {
            "barcode": "171139081",
            "dpc": "03042031801",
            "name": "សឿន  ស៊ីម"
        },
        {
            "barcode": "171139082",
            "dpc": "03042032001",
            "name": "ភេម   សុខុម"
        },
        {
            "barcode": "171139083",
            "dpc": "03042032101",
            "name": "ភេម  រឿត"
        },
        {
            "barcode": "171139084",
            "dpc": "03042032201",
            "name": "លិស  ពិសិទ្ធ"
        },
        {
            "barcode": "171139085",
            "dpc": "03042032301",
            "name": "អ៊ុំ  សាម៉េត ២"
        },
        {
            "barcode": "171139086",
            "dpc": "03042032401",
            "name": "ញ៉ែម  កញ្ញា"
        },
        {
            "barcode": "171139087",
            "dpc": "03042032501",
            "name": "អ៊ុក  ចាន់ថុល"
        },
        {
            "barcode": "171139088",
            "dpc": "03042032601",
            "name": "ស៊ឹង  សុផា"
        },
        {
            "barcode": "171139089",
            "dpc": "03042032701",
            "name": "គង់  សេរីវុធ"
        },
        {
            "barcode": "171139090",
            "dpc": "03042032801",
            "name": "តា   ឈួម"
        },
        {
            "barcode": "171139091",
            "dpc": "03042032901",
            "name": "អ៊ុក  ផាវណ្ណី"
        },
        {
            "barcode": "171139092",
            "dpc": "03042033001",
            "name": "ចៅ  ហាវ"
        },
        {
            "barcode": "171139093",
            "dpc": "03042033101",
            "name": "រស់   វិន"
        },
        {
            "barcode": "171139094",
            "dpc": "03042033501",
            "name": "ចាន់  សុខ"
        },
        {
            "barcode": "171139095",
            "dpc": "03042033601",
            "name": "កាន់  វិបុល"
        },
        {
            "barcode": "171139096",
            "dpc": "03042033701",
            "name": "អ៊ាង  លក្ខិណា"
        },
        {
            "barcode": "171139097",
            "dpc": "03042033801",
            "name": "អ៊ាង  ហេង"
        },
        {
            "barcode": "171139098",
            "dpc": "03042033901",
            "name": "ឆៃ  សុវណ្ណ"
        },
        {
            "barcode": "171139099",
            "dpc": "03042034001",
            "name": "យស  សារិទ្ធ"
        },
        {
            "barcode": "171139100",
            "dpc": "03042034101",
            "name": "សាំង  សាគួន"
        },
        {
            "barcode": "171139101",
            "dpc": "03042034201",
            "name": "មាស  នី"
        },
        {
            "barcode": "171139102",
            "dpc": "03042034301",
            "name": "សុខ  ណាលីន"
        },
        {
            "barcode": "171139103",
            "dpc": "03042034401",
            "name": "ញឹក  យឿង"
        },
        {
            "barcode": "171139104",
            "dpc": "03042034501",
            "name": "សាន  ឧស្សា"
        },
        {
            "barcode": "171139105",
            "dpc": "03042034701",
            "name": "ត្រេង  វុទ្ធី"
        },
        {
            "barcode": "171139106",
            "dpc": "03042034801",
            "name": "សេក សម្បត្តិ"
        },
        {
            "barcode": "171139107",
            "dpc": "03042034901",
            "name": "ប៊ុន  ថើន"
        },
        {
            "barcode": "171139108",
            "dpc": "03042035101",
            "name": "ថាន់  រដ្ឋា"
        },
        {
            "barcode": "171139109",
            "dpc": "03042035201",
            "name": "គា  សឺន"
        },
        {
            "barcode": "171139110",
            "dpc": "03042035301",
            "name": "សំរិទ្ធ  សីលា"
        },
        {
            "barcode": "171139111",
            "dpc": "03042035401",
            "name": "ជា  សាង"
        },
        {
            "barcode": "171139112",
            "dpc": "03042035701",
            "name": "ម៉េត  សុខុម"
        },
        {
            "barcode": "171139113",
            "dpc": "03042036001",
            "name": "ប៉ក់  សុងរិទ្ធិ"
        },
        {
            "barcode": "171139114",
            "dpc": "03042036101",
            "name": "ព្រហ្ម  ប៊ុនណាវី"
        },
        {
            "barcode": "171139115",
            "dpc": "03042036201",
            "name": "យូ  សុង"
        },
        {
            "barcode": "171139116",
            "dpc": "03042036301",
            "name": "កែវ  ចាន់ផល"
        },
        {
            "barcode": "171139117",
            "dpc": "03042036401",
            "name": "គិញ  សារុន"
        },
        {
            "barcode": "171139118",
            "dpc": "03042036501",
            "name": "ហម  អារុន"
        },
        {
            "barcode": "171139119",
            "dpc": "03042036601",
            "name": "ង៉ែត  ពិសិទ្ធ"
        },
        {
            "barcode": "171139120",
            "dpc": "03042036801",
            "name": "ជី  សុខហ៊ាង"
        },
        {
            "barcode": "171139121",
            "dpc": "03042036901",
            "name": "ឃឹម  ផេង"
        },
        {
            "barcode": "171139122",
            "dpc": "03042037001",
            "name": "ងួន  ភី"
        },
        {
            "barcode": "171139123",
            "dpc": "03042037201",
            "name": "ខឹម  ជីម"
        },
        {
            "barcode": "171139124",
            "dpc": "03042037301",
            "name": "ហូ  យកលីន"
        },
        {
            "barcode": "171139125",
            "dpc": "03042037501",
            "name": "ទិន  សុផល"
        },
        {
            "barcode": "171139126",
            "dpc": "03042037601",
            "name": "ដេត  សារិទ្ធ"
        },
        {
            "barcode": "171139127",
            "dpc": "03042038301",
            "name": "គឹម   ទៀង"
        },
        {
            "barcode": "171139128",
            "dpc": "03042043001",
            "name": "ឡាត  សាវេត"
        },
        {
            "barcode": "171139129",
            "dpc": "03042047701",
            "name": "ម៉ៅ  សុផុន"
        },
        {
            "barcode": "171139130",
            "dpc": "03042037801",
            "name": "អ៊ឹងចេង"
        },
        {
            "barcode": "171139131",
            "dpc": "03042037901",
            "name": "ខឿន ភាន់"
        },
        {
            "barcode": "171139132",
            "dpc": "03042038001",
            "name": "ឈិត ឆាយ"
        },
        {
            "barcode": "171139133",
            "dpc": "03042038101",
            "name": "ពេទ្យ ឈៀង"
        },
        {
            "barcode": "171139134",
            "dpc": "03042038401",
            "name": "គុល គុណ"
        },
        {
            "barcode": "171139135",
            "dpc": "03042038501",
            "name": "អៀង ធី"
        },
        {
            "barcode": "171139136",
            "dpc": "03042038601",
            "name": "ហុង ហៃ"
        },
        {
            "barcode": "171139137",
            "dpc": "03042038901",
            "name": "ជិន សល់"
        },
        {
            "barcode": "171139138",
            "dpc": "03042039001",
            "name": "សៅ ឈុំ"
        },
        {
            "barcode": "171139139",
            "dpc": "03042039101",
            "name": "ម៉ៃ ម៉ារិទ្ធ"
        },
        {
            "barcode": "171139140",
            "dpc": "03042039401",
            "name": "អ៊ិត ដារ៉ា"
        },
        {
            "barcode": "171139141",
            "dpc": "03042039201",
            "name": "ម៉ិល  សាម៉េត"
        },
        {
            "barcode": "171139142",
            "dpc": "03042039301",
            "name": "លឹម  ណុន"
        },
        {
            "barcode": "171139143",
            "dpc": "03042038701",
            "name": "យិន យៀន"
        },
        {
            "barcode": "171139144",
            "dpc": "03042040001",
            "name": "សំបូរ ផូ"
        },
        {
            "barcode": "171139145",
            "dpc": "03042040101",
            "name": "សួស សុគន្ធី"
        },
        {
            "barcode": "171139146",
            "dpc": "03042040201",
            "name": "ប៉ូ ស៊ីថន"
        },
        {
            "barcode": "171139147",
            "dpc": "03042040301",
            "name": "ថាច់ ធី"
        },
        {
            "barcode": "171139148",
            "dpc": "03042040401",
            "name": "ទឹម ស្សី"
        },
        {
            "barcode": "171139149",
            "dpc": "03042040601",
            "name": "សឺន សានសម្បត្តិ"
        },
        {
            "barcode": "171139150",
            "dpc": "03042040701",
            "name": "ពៅ វណ្ណៈ"
        },
        {
            "barcode": "171139151",
            "dpc": "03042040801",
            "name": "ថោង វិចិត្រ"
        },
        {
            "barcode": "171139152",
            "dpc": "03042040901",
            "name": "យស សុផាត"
        },
        {
            "barcode": "171139153",
            "dpc": "03042041101",
            "name": "ថាច់ លី"
        },
        {
            "barcode": "171139154",
            "dpc": "03042045401",
            "name": "ឈឹម សុវណ្ណ"
        },
        {
            "barcode": "171139155",
            "dpc": "03042045501",
            "name": "ហោ សំប៊ុន"
        },
        {
            "barcode": "171139156",
            "dpc": "03042045601",
            "name": "លុច គឿន"
        },
        {
            "barcode": "171139157",
            "dpc": "03042045801",
            "name": "ជ័យ ធីតា"
        },
        {
            "barcode": "171139158",
            "dpc": "03042045901",
            "name": "រិត កប"
        },
        {
            "barcode": "171139159",
            "dpc": "03042046101",
            "name": "សាញ់ សុភាព"
        },
        {
            "barcode": "171139160",
            "dpc": "03042045701",
            "name": "ឯម ស៊ា"
        },
        {
            "barcode": "171139161",
            "dpc": "03042046201",
            "name": "គង់ ដាវី"
        },
        {
            "barcode": "171139162",
            "dpc": "03042046301",
            "name": "ហៃ គឹមឈួន"
        },
        {
            "barcode": "171139163",
            "dpc": "03042046401",
            "name": "យ៉ែម ចាន់តារ៉ា"
        },
        {
            "barcode": "171139164",
            "dpc": "03042039901",
            "name": "ឆោម ឆុង"
        },
        {
            "barcode": "171139165",
            "dpc": "03042039701",
            "name": "គឹម សុផល"
        },
        {
            "barcode": "171139166",
            "dpc": "03042039601",
            "name": "អ៊ុក សារិន"
        },
        {
            "barcode": "171139167",
            "dpc": "03042046501",
            "name": "សំ សុដារ៉ា"
        },
        {
            "barcode": "171139168",
            "dpc": "03042046601",
            "name": "ឃុន ភី"
        },
        {
            "barcode": "171139169",
            "dpc": "03042046801",
            "name": "អៀម សំអាត"
        },
        {
            "barcode": "171139170",
            "dpc": "03042047001",
            "name": "អ៊ឹង ឈៀង"
        },
        {
            "barcode": "171139171",
            "dpc": "03042047101",
            "name": "បាន ប៉េងលី"
        },
        {
            "barcode": "171139172",
            "dpc": "03042047201",
            "name": "អ៊ួន រ៉ុត"
        },
        {
            "barcode": "171139173",
            "dpc": "03042047301",
            "name": "អ៊ុត រ៉ុន"
        },
        {
            "barcode": "171139174",
            "dpc": "03042047401",
            "name": "ហៃ ប៊ុនឈួ"
        },
        {
            "barcode": "171139175",
            "dpc": "03042047501",
            "name": "ស៊ូ ណាវី"
        },
        {
            "barcode": "171139176",
            "dpc": "03042042001",
            "name": "សេង សុធាវី"
        },
        {
            "barcode": "171139177",
            "dpc": "03042042101",
            "name": "ងី ឆេងអៀង"
        },
        {
            "barcode": "171139178",
            "dpc": "03042042201",
            "name": "តូ ឈុនវៀង"
        },
        {
            "barcode": "171139179",
            "dpc": "03042042301",
            "name": "ព្រំ ហ៊ន"
        },
        {
            "barcode": "171139180",
            "dpc": "03042042401",
            "name": "អេង សាវ៉ាត"
        },
        {
            "barcode": "171139181",
            "dpc": "03042042501",
            "name": "អ៊ឹង ហូវ"
        },
        {
            "barcode": "171139182",
            "dpc": "03042042601",
            "name": "យ៉ា វីរៈ"
        },
        {
            "barcode": "171139183",
            "dpc": "03042042701",
            "name": "ឆែម រ៉ូ"
        },
        {
            "barcode": "171139184",
            "dpc": "03042042801",
            "name": "យ៉ន យ៉ង់"
        },
        {
            "barcode": "171139185",
            "dpc": "03042042901",
            "name": "ហ៊ួយ ស៊ុនថន"
        },
        {
            "barcode": "171139186",
            "dpc": "03042043101",
            "name": "អ៊ុក ដារ៉ា"
        },
        {
            "barcode": "171139187",
            "dpc": "03042044501",
            "name": "ប៉ូ យៀត"
        },
        {
            "barcode": "171139188",
            "dpc": "03042044601",
            "name": "ម៉ក់  រ៉ាត់"
        },
        {
            "barcode": "171139189",
            "dpc": "03042044701",
            "name": "គុយ អោក"
        },
        {
            "barcode": "171139190",
            "dpc": "03042044801",
            "name": "សាន ហឿន"
        },
        {
            "barcode": "171139191",
            "dpc": "03042044901",
            "name": "ប៊ុន រឿង"
        },
        {
            "barcode": "171139192",
            "dpc": "03042044401",
            "name": "ជុំ រៀប"
        },
        {
            "barcode": "171139193",
            "dpc": "03042044301",
            "name": "ណាំ សុរឿង"
        },
        {
            "barcode": "171139194",
            "dpc": "03042044201",
            "name": "អន សុខាវី"
        },
        {
            "barcode": "171139195",
            "dpc": "03042044101",
            "name": "អន ចរិយា"
        },
        {
            "barcode": "171139196",
            "dpc": "03042044001",
            "name": "ហោ គឹមហួន"
        },
        {
            "barcode": "171139197",
            "dpc": "03042043901",
            "name": "មាឃ ឆវីវណ្ណ"
        },
        {
            "barcode": "171139198",
            "dpc": "03042043801",
            "name": "ឌុច ចំរើន"
        },
        {
            "barcode": "171139199",
            "dpc": "03042043601",
            "name": "អឿង សុគន្ធ"
        },
        {
            "barcode": "171139200",
            "dpc": "03042043701",
            "name": "សយ សុវណ្ណ"
        },
        {
            "barcode": "171139201",
            "dpc": "03042043501",
            "name": "អឿង ថាវី"
        },
        {
            "barcode": "171139202",
            "dpc": "03042043401",
            "name": "ជា រួន"
        },
        {
            "barcode": "171139203",
            "dpc": "03042043301",
            "name": "អៀប គុយហួត"
        },
        {
            "barcode": "171139204",
            "dpc": "03042043201",
            "name": "សៀ ទៀង"
        },
        {
            "barcode": "171139205",
            "dpc": "03042041901",
            "name": "វត្តគរ"
        },
        {
            "barcode": "171139206",
            "dpc": "03042041801",
            "name": "សាលាបឋមសិក្សាវត្តគរ"
        },
        {
            "barcode": "171139207",
            "dpc": "03042041701",
            "name": "អ៊ូរ គឹមហុក"
        },
        {
            "barcode": "171139208",
            "dpc": "03042041601",
            "name": "ផេង ធឿន"
        },
        {
            "barcode": "171139209",
            "dpc": "03042041501",
            "name": "ឌី ពៀច"
        },
        {
            "barcode": "171139210",
            "dpc": "03042041401",
            "name": "ឈឿន ទី"
        },
        {
            "barcode": "171139211",
            "dpc": "03042041301",
            "name": "ពៅ សាវើយ"
        },
        {
            "barcode": "171139212",
            "dpc": "03042041201",
            "name": "ស៊ា លីវ"
        },
        {
            "barcode": "171139213",
            "dpc": "03042045001",
            "name": "អៀក ប៊ុនកើន"
        },
        {
            "barcode": "171139214",
            "dpc": "03042045101",
            "name": "ថោង ដានាប២"
        },
        {
            "barcode": "171139215",
            "dpc": "03042045201",
            "name": "ថោង ដានាប១"
        },
        {
            "barcode": "171139216",
            "dpc": "03042046901",
            "name": "ឡោ ណងហេង"
        },
        {
            "barcode": "171139217",
            "dpc": "03042046701",
            "name": "យៀង ឃិត"
        },
        {
            "barcode": "171139218",
            "dpc": "03042047801",
            "name": "ប៉ក់ ម៉ៅ"
        },
        {
            "barcode": "171139219",
            "dpc": "03042047901",
            "name": "ជួន វ៉ាន់លី"
        },
        {
            "barcode": "171139220",
            "dpc": "03042039801",
            "name": "ឃួន នឿន ២"
        },
        {
            "barcode": "171139221",
            "dpc": "03042048001",
            "name": "យុគន្ធរ្ធ សំបូរ១"
        }
    ]
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
