let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171144788",
            "dpc": "03042103601",
            "name": "សួន សុខុម"
        },
        {
            "barcode": "171144789",
            "dpc": "03042103801",
            "name": "ស៊ូ ម៉ារីយ៉ាន"
        },
        {
            "barcode": "171144790",
            "dpc": "03042104201",
            "name": "ទូត យើ"
        },
        {
            "barcode": "171144791",
            "dpc": "03042104301",
            "name": "ម៉ាន់ ម៉ាត់"
        },
        {
            "barcode": "171144792",
            "dpc": "03042104401",
            "name": "ស៊ូ ដាគីន"
        },
        {
            "barcode": "171144793",
            "dpc": "03042104501",
            "name": "យ៉ា ហ្វាហ្ស៊ី"
        },
        {
            "barcode": "171144794",
            "dpc": "03042104601",
            "name": "ម៉ាន សារី"
        },
        {
            "barcode": "171144795",
            "dpc": "03042104701",
            "name": "សុ សារ៉ស់"
        },
        {
            "barcode": "171144796",
            "dpc": "03042104801",
            "name": "ម៉ាត់ ប៉ាត់ទ្រី"
        },
        {
            "barcode": "171144797",
            "dpc": "03042105501",
            "name": "រិទ្ធ វណ្ណនី"
        },
        {
            "barcode": "171144798",
            "dpc": "03042105701",
            "name": "នាក់ រ៉ា"
        },
        {
            "barcode": "171144799",
            "dpc": "03042105801",
            "name": "ណុះ រី"
        },
        {
            "barcode": "171144800",
            "dpc": "03042106901",
            "name": "ស៊ូ កើ"
        },
        {
            "barcode": "171144801",
            "dpc": "03042107001",
            "name": "ទា ហ៊ីអ៊ី"
        },
        {
            "barcode": "171144802",
            "dpc": "03042107101",
            "name": "ទា ខលិក"
        },
        {
            "barcode": "171144803",
            "dpc": "03042107201",
            "name": "អួម សីលា"
        },
        {
            "barcode": "171144804",
            "dpc": "03042107301",
            "name": "ហ៊ីម ម៉ាស់"
        },
        {
            "barcode": "171144805",
            "dpc": "03042107401",
            "name": "ភិន ទន់"
        },
        {
            "barcode": "171144806",
            "dpc": "03042107501",
            "name": "ម៉ាត់ ខរី"
        },
        {
            "barcode": "171144807",
            "dpc": "03042108001",
            "name": "សាន គឹមសាត"
        },
        {
            "barcode": "171144808",
            "dpc": "03042119701",
            "name": "ម៉ាន ខាន"
        },
        {
            "barcode": "171144809",
            "dpc": "03042119901",
            "name": "ម៉ន អាត"
        },
        {
            "barcode": "171144810",
            "dpc": "03042120001",
            "name": "យ៉ា គីម"
        },
        {
            "barcode": "171144811",
            "dpc": "03042120101",
            "name": "ម៉ាត់ ស្រីលីន"
        },
        {
            "barcode": "171144812",
            "dpc": "03042100101",
            "name": "អ៊ូន សុខរីន"
        },
        {
            "barcode": "171144813",
            "dpc": "03042120301",
            "name": "ម៉ាន ផាន់ណារ៉ា"
        },
        {
            "barcode": "171144814",
            "dpc": "03042120201",
            "name": "ម៉ាន រដ្ឋា"
        },
        {
            "barcode": "171144815",
            "dpc": "03042121701",
            "name": "ម៉ាន កុសល់"
        },
        {
            "barcode": "171144816",
            "dpc": "03042119101",
            "name": "ម៉ាន វណ្ណា"
        },
        {
            "barcode": "171144817",
            "dpc": "03042120701",
            "name": "សុះ អាំងទីណាស់"
        },
        {
            "barcode": "171144818",
            "dpc": "03042120501",
            "name": "ម៉ុង់ សាន្ត"
        },
        {
            "barcode": "171144819",
            "dpc": "03042120601",
            "name": "ធៀន លី"
        },
        {
            "barcode": "171144820",
            "dpc": "03042119401",
            "name": "ណាល់ សំណាង"
        },
        {
            "barcode": "171144821",
            "dpc": "03042119301",
            "name": "យិន ឈឹង"
        },
        {
            "barcode": "171144822",
            "dpc": "03042119201",
            "name": "លី ណាស់"
        },
        {
            "barcode": "171144823",
            "dpc": "03042118401",
            "name": "ឡុង សុគន្ធារី"
        },
        {
            "barcode": "171144824",
            "dpc": "03042118201",
            "name": "ឈិន ស"
        },
        {
            "barcode": "171144825",
            "dpc": "03042118301",
            "name": "អ៊ុន ចិន្តា"
        },
        {
            "barcode": "171144826",
            "dpc": "03042118101",
            "name": "ទិន ផល្លា"
        },
        {
            "barcode": "171144827",
            "dpc": "03042118001",
            "name": "ស៊ុន សុខា"
        },
        {
            "barcode": "171144828",
            "dpc": "03042117601",
            "name": "វិន សេន"
        },
        {
            "barcode": "171144829",
            "dpc": "03042117501",
            "name": "ឈុំ យ៉ាន"
        },
        {
            "barcode": "171144830",
            "dpc": "03042117401",
            "name": "ឈុំ ទូច"
        },
        {
            "barcode": "171144831",
            "dpc": "03042116801",
            "name": "ចាន់ វិចិត្រ"
        },
        {
            "barcode": "171144832",
            "dpc": "03042116701",
            "name": "ស៊ុន សុរីយ៉ា"
        },
        {
            "barcode": "171144833",
            "dpc": "03042116601",
            "name": "គន គីមសេង"
        },
        {
            "barcode": "171144834",
            "dpc": "03042116501",
            "name": "ម៉ាត់ រីម"
        },
        {
            "barcode": "171144835",
            "dpc": "03042116001",
            "name": "ឱ សេរី"
        },
        {
            "barcode": "171144836",
            "dpc": "03042116201",
            "name": "យូ រ៉ាហ្វាត់"
        },
        {
            "barcode": "171144837",
            "dpc": "03042116101",
            "name": "ឡិប វណ្ណរូ"
        },
        {
            "barcode": "171144838",
            "dpc": "03042116301",
            "name": "ម៉ាត់ រើ"
        },
        {
            "barcode": "171144839",
            "dpc": "03042116401",
            "name": "គង់ ម៉ារី"
        },
        {
            "barcode": "171144840",
            "dpc": "03042116901",
            "name": "សួន ដា"
        },
        {
            "barcode": "171144841",
            "dpc": "03042117101",
            "name": "ឆង់ ថាន"
        },
        {
            "barcode": "171144842",
            "dpc": "03042117301",
            "name": "ម៉ែន សុភ័ក្ត្រ"
        },
        {
            "barcode": "171144843",
            "dpc": "03042117201",
            "name": "ប្រាក់ គឹមលាង"
        },
        {
            "barcode": "171144844",
            "dpc": "03042117001",
            "name": "ស៊ុន ម៉ាយ៉ាសិទ្ធ"
        },
        {
            "barcode": "171144845",
            "dpc": "03042117701",
            "name": "ខ្លូត ចន្តា"
        },
        {
            "barcode": "171144846",
            "dpc": "03042117801",
            "name": "ខុន ស្រីពៅ"
        },
        {
            "barcode": "171144847",
            "dpc": "03042117901",
            "name": "យឹម នៅ"
        },
        {
            "barcode": "171144848",
            "dpc": "03042115901",
            "name": "បឿន ផាត់"
        },
        {
            "barcode": "171144849",
            "dpc": "03042115801",
            "name": "សួន ចាន់ណា"
        },
        {
            "barcode": "171144850",
            "dpc": "03042115701",
            "name": "អោ ចំរ៉ុង"
        },
        {
            "barcode": "171144851",
            "dpc": "03042115601",
            "name": "ហ៊ីម ម៉ាសូគី"
        },
        {
            "barcode": "171144852",
            "dpc": "03042115501",
            "name": "លី ខា"
        },
        {
            "barcode": "171144853",
            "dpc": "03042108101",
            "name": "ប៉ាង រីម"
        },
        {
            "barcode": "171144854",
            "dpc": "03042108201",
            "name": "ជឹង សុខហេង"
        },
        {
            "barcode": "171144855",
            "dpc": "03042108301",
            "name": "ម៉ូត ពេជ្រ"
        },
        {
            "barcode": "171144856",
            "dpc": "03042107901",
            "name": "ខាន ប្រហ៊ីម"
        },
        {
            "barcode": "171144857",
            "dpc": "03042107801",
            "name": "អ៊ីសាលាស៊ី"
        },
        {
            "barcode": "171144858",
            "dpc": "03042107701",
            "name": "កៅ ប៊ូរ"
        },
        {
            "barcode": "171144859",
            "dpc": "03042106801",
            "name": "ស៊ិន សុវណ្ណ"
        },
        {
            "barcode": "171144860",
            "dpc": "03042106701",
            "name": "យ៉េប សីហាស់"
        },
        {
            "barcode": "171144861",
            "dpc": "03042106601",
            "name": "ស៊ូ សរ"
        },
        {
            "barcode": "171144862",
            "dpc": "03042106501",
            "name": "លាស់ សេត"
        },
        {
            "barcode": "171144863",
            "dpc": "03042106201",
            "name": "យ៉ែប ស្លាម៉ាស់"
        },
        {
            "barcode": "171144864",
            "dpc": "03042106301",
            "name": "ម៉ាត់ សារិន"
        },
        {
            "barcode": "171144865",
            "dpc": "03042106401",
            "name": "នី ម៉ាត់"
        },
        {
            "barcode": "171144866",
            "dpc": "03042106101",
            "name": "ម៉ាត់ ម៉ាលី"
        },
        {
            "barcode": "171144867",
            "dpc": "03042106001",
            "name": "គង់ ទូច"
        },
        {
            "barcode": "171144868",
            "dpc": "03042105901",
            "name": "ជា ចំណង់"
        },
        {
            "barcode": "171144869",
            "dpc": "03042105301",
            "name": "ឡុក សូដានី"
        },
        {
            "barcode": "171144870",
            "dpc": "03042105001",
            "name": "ទិត ដាវី"
        },
        {
            "barcode": "171144871",
            "dpc": "03042104901",
            "name": "ទិត កន្យា"
        },
        {
            "barcode": "171144872",
            "dpc": "03042105401",
            "name": "សួន សារឿន"
        },
        {
            "barcode": "171144873",
            "dpc": "03042105101",
            "name": "អ៊ូម ដាលី"
        },
        {
            "barcode": "171144874",
            "dpc": "03042105201",
            "name": "ឯម សុជាតា"
        },
        {
            "barcode": "171144875",
            "dpc": "03042104001",
            "name": "អ៊ីស្កាន់ដេ ហ្សាកាស៊ី"
        },
        {
            "barcode": "171144876",
            "dpc": "03042103901",
            "name": "ហាក់ នឿម"
        },
        {
            "barcode": "171144877",
            "dpc": "03042103701",
            "name": "ឆួន យ៉ាន"
        },
        {
            "barcode": "171144878",
            "dpc": "03042102901",
            "name": "ម៉ាន យ៉ាន"
        },
        {
            "barcode": "171144879",
            "dpc": "03042103001",
            "name": "សុះ យូកូប"
        },
        {
            "barcode": "171144880",
            "dpc": "03042103101",
            "name": "លី សាទ"
        },
        {
            "barcode": "171144881",
            "dpc": "03042103201",
            "name": "សុខ វង្ស"
        },
        {
            "barcode": "171144882",
            "dpc": "03042103401",
            "name": "អៀង អៃរ៉ា"
        },
        {
            "barcode": "171144883",
            "dpc": "03042103301",
            "name": "អៀង ដាណេ"
        },
        {
            "barcode": "171144884",
            "dpc": "03042103501",
            "name": "ជា ហួន"
        },
        {
            "barcode": "171144885",
            "dpc": "03042102801",
            "name": "ជា ម៉ៅ"
        },
        {
            "barcode": "171144886",
            "dpc": "03042102701",
            "name": "ឡែក ស្រីហ្វីយ៉ាស់"
        },
        {
            "barcode": "171144887",
            "dpc": "03042102601",
            "name": "កា សេន"
        },
        {
            "barcode": "171144888",
            "dpc": "03042102501",
            "name": "ម៉ាត់ ដូម៉ាន"
        },
        {
            "barcode": "171144889",
            "dpc": "03042102301",
            "name": "កប ដា"
        },
        {
            "barcode": "171144890",
            "dpc": "03042102201",
            "name": "ទូច មុន្នី"
        },
        {
            "barcode": "171144891",
            "dpc": "03042102001",
            "name": "ថាប់ ធឿន"
        },
        {
            "barcode": "171144892",
            "dpc": "03042101901",
            "name": "ថាប់ វ៉ាន់ធៀង"
        },
        {
            "barcode": "171144893",
            "dpc": "03042101801",
            "name": "ពៅ សូរ៉ាង"
        },
        {
            "barcode": "171144894",
            "dpc": "03042101701",
            "name": "វង្ស ឆាត"
        },
        {
            "barcode": "171144895",
            "dpc": "03042101601",
            "name": "តាំង សាន់"
        },
        {
            "barcode": "171144896",
            "dpc": "03042101401",
            "name": "ហៃ សុភី"
        },
        {
            "barcode": "171144897",
            "dpc": "03042101501",
            "name": "ខេង ហោ"
        },
        {
            "barcode": "171144898",
            "dpc": "03042101301",
            "name": "សួន សេង"
        },
        {
            "barcode": "171144899",
            "dpc": "03042101201",
            "name": "នួន តាន់"
        },
        {
            "barcode": "171144900",
            "dpc": "03042101101",
            "name": "អ៊ឹម វ៉ាន់ធី"
        },
        {
            "barcode": "171144901",
            "dpc": "03042101001",
            "name": "ឈួម ឈង"
        },
        {
            "barcode": "171144902",
            "dpc": "03042100801",
            "name": "មាស ផាន់ណា"
        },
        {
            "barcode": "171144903",
            "dpc": "03042100701",
            "name": "ស៊ួន ពៅ"
        },
        {
            "barcode": "171144904",
            "dpc": "03042100601",
            "name": "ហ៊ុន សូវណ្ណា"
        },
        {
            "barcode": "171144905",
            "dpc": "03042100501",
            "name": "ទិត សុខា ១"
        },
        {
            "barcode": "171144906",
            "dpc": "03042100401",
            "name": "ស៊ូ សារី"
        },
        {
            "barcode": "171144907",
            "dpc": "03042100301",
            "name": "ជុំ ចាន់ហាន"
        },
        {
            "barcode": "171144908",
            "dpc": "03042100201",
            "name": "ម៉ាត់ ម៉ារីណា"
        },
        {
            "barcode": "171144909",
            "dpc": "03042107601",
            "name": "ទុយ ខរ"
        },
        {
            "barcode": "171144910",
            "dpc": "03042108401",
            "name": "ហ៊ុន ចាន់ដារ៉ា"
        },
        {
            "barcode": "171144911",
            "dpc": "03042108501",
            "name": "ចំរើន ភារម្យ"
        },
        {
            "barcode": "171144912",
            "dpc": "03042108601",
            "name": "ឌុក មៀនសូភៀន"
        },
        {
            "barcode": "171144913",
            "dpc": "03042108701",
            "name": "សាម ចំរ៉ាត់"
        },
        {
            "barcode": "171144914",
            "dpc": "03042108801",
            "name": "ឆាំ ផល្តុន"
        },
        {
            "barcode": "171144915",
            "dpc": "03042108901",
            "name": "ស៊ឹម រ៉ា"
        },
        {
            "barcode": "171144916",
            "dpc": "03042109001",
            "name": "គឹម លី"
        },
        {
            "barcode": "171144917",
            "dpc": "03042109101",
            "name": "ឆាំ ពុទ្ធារ៉ា"
        },
        {
            "barcode": "171144918",
            "dpc": "03042109201",
            "name": "ឯម ប៉ិលប៊ុណ្តាត"
        },
        {
            "barcode": "171144919",
            "dpc": "03042109301",
            "name": "កែម ភី"
        },
        {
            "barcode": "171144920",
            "dpc": "03042109401",
            "name": "វ័ន គឹមស៊ាន"
        },
        {
            "barcode": "171144921",
            "dpc": "03042109501",
            "name": "ហែ សុធា"
        },
        {
            "barcode": "171144922",
            "dpc": "03042109601",
            "name": "ស៊ឹម យ៉ា"
        },
        {
            "barcode": "171144923",
            "dpc": "03042109701",
            "name": "សឹម ម៉ាត់សារុន"
        },
        {
            "barcode": "171144924",
            "dpc": "03042109801",
            "name": "នុត រ៉ា"
        },
        {
            "barcode": "171144925",
            "dpc": "03042109901",
            "name": "ឌុក ឈឿប"
        },
        {
            "barcode": "171144926",
            "dpc": "03042110001",
            "name": "ទីន លក្ឌា"
        },
        {
            "barcode": "171144927",
            "dpc": "03042110101",
            "name": "ឃុំ កាំ"
        },
        {
            "barcode": "171144928",
            "dpc": "03042110201",
            "name": "តោ ណែ"
        },
        {
            "barcode": "171144929",
            "dpc": "03042110301",
            "name": "នឹម សាលី"
        },
        {
            "barcode": "171144930",
            "dpc": "03042110401",
            "name": "សឿន វុបុល"
        },
        {
            "barcode": "171144931",
            "dpc": "03042110501",
            "name": "សឿន សឿត"
        },
        {
            "barcode": "171144932",
            "dpc": "03042110601",
            "name": "យ៉ង់ ដេម"
        },
        {
            "barcode": "171144933",
            "dpc": "03042110701",
            "name": "គុជ ឃឿត"
        },
        {
            "barcode": "171144934",
            "dpc": "03042110801",
            "name": "ទូច សុធី"
        },
        {
            "barcode": "171144935",
            "dpc": "03042110901",
            "name": "សំ ហឿប"
        },
        {
            "barcode": "171144936",
            "dpc": "03042111001",
            "name": "សំ ហឿត"
        },
        {
            "barcode": "171144937",
            "dpc": "03042111101",
            "name": "ប៊ុត ធៀម"
        },
        {
            "barcode": "171144938",
            "dpc": "03042111201",
            "name": "ថាច់ សឿ"
        },
        {
            "barcode": "171144939",
            "dpc": "03042111301",
            "name": "ឡាន ឆាយ"
        },
        {
            "barcode": "171144940",
            "dpc": "03042111401",
            "name": "ស៊ា ស៊ីនួន"
        },
        {
            "barcode": "171144941",
            "dpc": "03042111501",
            "name": "អ៊ឹម គុជ"
        },
        {
            "barcode": "171144942",
            "dpc": "03042111601",
            "name": "ឡុង ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171144943",
            "dpc": "03042111701",
            "name": "ទ្រី ហេង"
        },
        {
            "barcode": "171144944",
            "dpc": "03042111801",
            "name": "នន់ រីវ"
        },
        {
            "barcode": "171144945",
            "dpc": "03042111901",
            "name": "ឯម វិចិត្រ"
        },
        {
            "barcode": "171144946",
            "dpc": "03042112001",
            "name": "សាន ណាវី"
        },
        {
            "barcode": "171144947",
            "dpc": "03042112101",
            "name": "តន់ សុំរ៉ង"
        },
        {
            "barcode": "171144948",
            "dpc": "03042112201",
            "name": "សួម កំសត់"
        },
        {
            "barcode": "171144949",
            "dpc": "03042112301",
            "name": "ថាប់ សឿប"
        },
        {
            "barcode": "171144950",
            "dpc": "03042112401",
            "name": "ប៉ែន ធុល"
        },
        {
            "barcode": "171144951",
            "dpc": "03042112501",
            "name": "ប៉ែន ប៊ុនធឿន"
        },
        {
            "barcode": "171144952",
            "dpc": "03042112601",
            "name": "រ៉ូ រ៉ា"
        },
        {
            "barcode": "171144953",
            "dpc": "03042112801",
            "name": "វឿន ទូច"
        },
        {
            "barcode": "171144954",
            "dpc": "03042112901",
            "name": "ហាន ធី"
        },
        {
            "barcode": "171144955",
            "dpc": "03042113001",
            "name": "ស៊ិន ធឿប"
        },
        {
            "barcode": "171144956",
            "dpc": "03042113201",
            "name": "សេក សុគន្ធារី"
        },
        {
            "barcode": "171144957",
            "dpc": "03042113301",
            "name": "ផាត់ សុឃឿន"
        },
        {
            "barcode": "171144958",
            "dpc": "03042113501",
            "name": "ថៃ វណ្ណា"
        },
        {
            "barcode": "171144959",
            "dpc": "03042113601",
            "name": "លី គៀតគី"
        },
        {
            "barcode": "171144960",
            "dpc": "03042113701",
            "name": "សុះ ព្រែក"
        },
        {
            "barcode": "171144961",
            "dpc": "03042113801",
            "name": "ហែម រឿប"
        },
        {
            "barcode": "171144962",
            "dpc": "03042113901",
            "name": "ស៊ិន កូយ"
        },
        {
            "barcode": "171144963",
            "dpc": "03042114001",
            "name": "រូប ថា"
        },
        {
            "barcode": "171144964",
            "dpc": "03042114101",
            "name": "ឈួន សាវិន"
        },
        {
            "barcode": "171144965",
            "dpc": "03042114201",
            "name": "ឈឹម បាន"
        },
        {
            "barcode": "171144966",
            "dpc": "03042114401",
            "name": "មិន យន់"
        },
        {
            "barcode": "171144967",
            "dpc": "03042114501",
            "name": "ឈឹម សារឿត"
        },
        {
            "barcode": "171144968",
            "dpc": "03042114601",
            "name": "ហួត ហ៊"
        },
        {
            "barcode": "171144969",
            "dpc": "03042114701",
            "name": "រ៉ូ រី"
        },
        {
            "barcode": "171144970",
            "dpc": "03042114801",
            "name": "ស៊ីវ ជឿន"
        },
        {
            "barcode": "171144971",
            "dpc": "03042114901",
            "name": "មួន សុជាតិ"
        },
        {
            "barcode": "171144972",
            "dpc": "03042115001",
            "name": "ហ៊ុល ធៀង"
        },
        {
            "barcode": "171144973",
            "dpc": "03042115101",
            "name": "ប៉ុល សុផាត"
        },
        {
            "barcode": "171144974",
            "dpc": "03042115201",
            "name": "ទ័រ ការីម"
        },
        {
            "barcode": "171144975",
            "dpc": "03042115301",
            "name": "ជា ឃិន"
        },
        {
            "barcode": "171144976",
            "dpc": "03042115401",
            "name": "គ្រៀល ហៀង"
        },
        {
            "barcode": "171144977",
            "dpc": "03042118501",
            "name": "សោ ថងឌី"
        },
        {
            "barcode": "171144978",
            "dpc": "03042118601",
            "name": "ស៊ិន យោប"
        },
        {
            "barcode": "171144979",
            "dpc": "03042118701",
            "name": "មិន សុចាន់"
        },
        {
            "barcode": "171144980",
            "dpc": "03042118801",
            "name": "ស៊ូ ចិន្តា"
        },
        {
            "barcode": "171144981",
            "dpc": "03042119001",
            "name": "លី ម៉ាប់"
        },
        {
            "barcode": "171144982",
            "dpc": "03042119601",
            "name": "សាន់ យ៉ាស់"
        },
        {
            "barcode": "171144983",
            "dpc": "03042119801",
            "name": "ថរ សារ៉េត"
        },
        {
            "barcode": "171144984",
            "dpc": "03042120401",
            "name": "ស សុគន្ធ"
        },
        {
            "barcode": "171144985",
            "dpc": "03042120801",
            "name": "ជៃ រ៉ឺ"
        },
        {
            "barcode": "171144986",
            "dpc": "03042120901",
            "name": "រីម រើន"
        },
        {
            "barcode": "171144987",
            "dpc": "03042121001",
            "name": "នី សាម៉េត"
        },
        {
            "barcode": "171144988",
            "dpc": "03042121101",
            "name": "ទីន អ៊ីសើ"
        },
        {
            "barcode": "171144989",
            "dpc": "03042121201",
            "name": "តាត គឹម"
        },
        {
            "barcode": "171144990",
            "dpc": "03042121301",
            "name": "ឯល ការីម ២"
        },
        {
            "barcode": "171144991",
            "dpc": "03042121401",
            "name": "ឈឿន ឈុំ"
        },
        {
            "barcode": "171144992",
            "dpc": "03042121501",
            "name": "ឡិប អារ៉ាហ្វាត់"
        },
        {
            "barcode": "171144993",
            "dpc": "03042121601",
            "name": "សុប ឡេស"
        },
        {
            "barcode": "171144994",
            "dpc": "03042121801",
            "name": "នាក់ ជា ២"
        },
        {
            "barcode": "171144995",
            "dpc": "03042121901",
            "name": "ស្មាន មូស្កាន"
        },
        {
            "barcode": "171144996",
            "dpc": "03042122001",
            "name": "តឹក អាន"
        },
        {
            "barcode": "171144997",
            "dpc": "03042122101",
            "name": "ឡែម ឃឿត"
        },
        {
            "barcode": "171144998",
            "dpc": "03042122201",
            "name": "ស៊ិន សុធារី"
        },
        {
            "barcode": "171144999",
            "dpc": "03042122301",
            "name": "ឆាត ផត់"
        },
        {
            "barcode": "171145000",
            "dpc": "03042122401",
            "name": "រីម រ៉ុម"
        },
        {
            "barcode": "171145001",
            "dpc": "03042122501",
            "name": "សុះ សៀត"
        },
        {
            "barcode": "171145002",
            "dpc": "03042122601",
            "name": "អ៊ុក ប៊ុនធឿន"
        },
        {
            "barcode": "171145003",
            "dpc": "03042122701",
            "name": "ទឹម ហួត"
        },
        {
            "barcode": "171145004",
            "dpc": "03042122801",
            "name": "លិស ឡេត"
        },
        {
            "barcode": "171145005",
            "dpc": "03042122901",
            "name": "វ៉ន សាវី"
        },
        {
            "barcode": "171145006",
            "dpc": "03042123001",
            "name": "ម៉ម រិទ្ធី"
        },
        {
            "barcode": "171145007",
            "dpc": "03042123101",
            "name": "ថាប់ កូឡាប"
        },
        {
            "barcode": "171145008",
            "dpc": "03042123201",
            "name": "យ៉ាយ ឡូត"
        },
        {
            "barcode": "171145009",
            "dpc": "03042123301",
            "name": "វង់ វឿត"
        },
        {
            "barcode": "171145010",
            "dpc": "03042123401",
            "name": "ហម សុភាព"
        },
        {
            "barcode": "171145011",
            "dpc": "03042123601",
            "name": "ម៉ៅ កំសាន្ត"
        },
        {
            "barcode": "171145012",
            "dpc": "03042123701",
            "name": "ញឹម ច្រៀប"
        },
        {
            "barcode": "171145013",
            "dpc": "03042123801",
            "name": "អ៊ុន ហ៊ីង"
        },
        {
            "barcode": "171145014",
            "dpc": "03042123901",
            "name": "ពត ធី"
        },
        {
            "barcode": "171145015",
            "dpc": "03042124001",
            "name": "សុខ សម្បត្តិ"
        },
        {
            "barcode": "171145016",
            "dpc": "03042124101",
            "name": "ព្រាន សុខ"
        },
        {
            "barcode": "171145017",
            "dpc": "03042124201",
            "name": "ឈឿន ឈុំ ២"
        },
        {
            "barcode": "171145018",
            "dpc": "03042124301",
            "name": "នៅ ស៊ាន"
        },
        {
            "barcode": "171145019",
            "dpc": "03042124401",
            "name": "ផាន ថន"
        },
        {
            "barcode": "171145020",
            "dpc": "03042124501",
            "name": "ម៉ សុផល"
        },
        {
            "barcode": "171145021",
            "dpc": "03042124601",
            "name": "ហាន កក"
        },
        {
            "barcode": "171145022",
            "dpc": "03042124701",
            "name": "ជា មុំ"
        },
        {
            "barcode": "171145023",
            "dpc": "03042124801",
            "name": "គល់ សាវឿន"
        },
        {
            "barcode": "171145024",
            "dpc": "03042124901",
            "name": "ម៉ាក ស៊ីម"
        },
        {
            "barcode": "171145025",
            "dpc": "03042125001",
            "name": "អឿន អឿត"
        },
        {
            "barcode": "171145026",
            "dpc": "03042125101",
            "name": "អឿម អង"
        },
        {
            "barcode": "171145027",
            "dpc": "03042125201",
            "name": "រាជ ថាវរៈ"
        },
        {
            "barcode": "171145028",
            "dpc": "03042125301",
            "name": "ផាន់ វ៉ាន់"
        },
        {
            "barcode": "171145029",
            "dpc": "03042125401",
            "name": "ធៀម គង់ជាតិ"
        },
        {
            "barcode": "171145030",
            "dpc": "03042125501",
            "name": "ជួន សុផល"
        },
        {
            "barcode": "171145031",
            "dpc": "03042125601",
            "name": "លឹម សៀរ"
        },
        {
            "barcode": "171145032",
            "dpc": "03042125701",
            "name": "អ៊ូច រ៉េត"
        },
        {
            "barcode": "171145033",
            "dpc": "03042125801",
            "name": "ស ប៉ាច"
        },
        {
            "barcode": "171145034",
            "dpc": "03042125901",
            "name": "បឿន ភឿត"
        },
        {
            "barcode": "171145035",
            "dpc": "03042126001",
            "name": "អឿន អេង"
        },
        {
            "barcode": "171145036",
            "dpc": "03042126101",
            "name": "ស សារឿន"
        },
        {
            "barcode": "171145037",
            "dpc": "03042126201",
            "name": "យ័ន្ត យ៉ុង"
        },
        {
            "barcode": "171145038",
            "dpc": "03042126301",
            "name": "ហៀង ហ៊ន"
        },
        {
            "barcode": "171145039",
            "dpc": "03042126401",
            "name": "គង់ សារ៉ៅ"
        },
        {
            "barcode": "171145040",
            "dpc": "03042126501",
            "name": "អ៊ឹម សារម្យ"
        },
        {
            "barcode": "171145041",
            "dpc": "03042126601",
            "name": "អឿន សុភាព"
        },
        {
            "barcode": "171145042",
            "dpc": "03042126701",
            "name": "អឿន នៅ"
        },
        {
            "barcode": "171145043",
            "dpc": "03042126801",
            "name": "ឆៃ ស៊ុយ"
        },
        {
            "barcode": "171145044",
            "dpc": "03042126901",
            "name": "ឌឿន ដុស"
        },
        {
            "barcode": "171145045",
            "dpc": "03042127001",
            "name": "លុយ សុផល"
        },
        {
            "barcode": "171145046",
            "dpc": "03042127101",
            "name": "ទ្រី ជួរ"
        },
        {
            "barcode": "171145047",
            "dpc": "03042127201",
            "name": "ឃាន សុឃុន"
        },
        {
            "barcode": "171145048",
            "dpc": "03042127301",
            "name": "គាំ រី"
        },
        {
            "barcode": "171145049",
            "dpc": "03042127401",
            "name": "ទី អេង"
        },
        {
            "barcode": "171145050",
            "dpc": "03042127501",
            "name": "អ៊ុង ប៉ូច"
        },
        {
            "barcode": "171145051",
            "dpc": "03042127601",
            "name": "ឡឹក ចាន់ នី"
        },
        {
            "barcode": "171145052",
            "dpc": "03042127701",
            "name": "អ៊ុន ទី"
        },
        {
            "barcode": "171145053",
            "dpc": "03042127801",
            "name": "ឌឿន រ៉ឺន"
        },
        {
            "barcode": "171145054",
            "dpc": "03042127901",
            "name": "តាំង ថន"
        },
        {
            "barcode": "171145055",
            "dpc": "03042128001",
            "name": "ហេង ទេវី"
        },
        {
            "barcode": "171145056",
            "dpc": "03042128101",
            "name": "ប៉ោក មុំ"
        },
        {
            "barcode": "171145057",
            "dpc": "03042128201",
            "name": "យឿន យ៉េត"
        },
        {
            "barcode": "171145058",
            "dpc": "03042128401",
            "name": "ដួង ឃុន"
        },
        {
            "barcode": "171145059",
            "dpc": "03042128501",
            "name": "តាន់ ឈីវ"
        },
        {
            "barcode": "171145060",
            "dpc": "03042128601",
            "name": "សុខ អាន"
        },
        {
            "barcode": "171145061",
            "dpc": "03042128701",
            "name": "សិក រឿន"
        },
        {
            "barcode": "171145062",
            "dpc": "03042128801",
            "name": "ម៉ែន រុំ"
        },
        {
            "barcode": "171145063",
            "dpc": "03042128901",
            "name": "ម៉ម យ៉ាន"
        },
        {
            "barcode": "171145064",
            "dpc": "03042129101",
            "name": "ច័ន្ទ សុវណ្ណារិទ្ធ"
        },
        {
            "barcode": "171145065",
            "dpc": "03042129201",
            "name": "លាន លៀង"
        },
        {
            "barcode": "171145066",
            "dpc": "03042129301",
            "name": "យឹម ពៅវឌ្ឍនៈ"
        },
        {
            "barcode": "171145067",
            "dpc": "03042129501",
            "name": "លឹម ចាន់ដារ៉ា"
        },
        {
            "barcode": "171145068",
            "dpc": "03042129601",
            "name": "សា ធឿន"
        },
        {
            "barcode": "171145069",
            "dpc": "03042129701",
            "name": "រ័ត្ន ជាសារឿន"
        },
        {
            "barcode": "171145070",
            "dpc": "03042129801",
            "name": "ញាំ ហ៊ុច"
        },
        {
            "barcode": "171145071",
            "dpc": "03042129901",
            "name": "ណែម រ៉េត"
        },
        {
            "barcode": "171145072",
            "dpc": "03042130001",
            "name": "ត្រឹង សែនសុធី"
        },
        {
            "barcode": "171145073",
            "dpc": "03042130101",
            "name": "មាន សាម៉េត"
        },
        {
            "barcode": "171145074",
            "dpc": "03042130201",
            "name": "ក្រួច ម៉ឹក"
        },
        {
            "barcode": "171145075",
            "dpc": "03042130301",
            "name": "ម៉ិ ភីណា"
        },
        {
            "barcode": "171145076",
            "dpc": "03042130401",
            "name": "ឈិត រ៉ែម"
        },
        {
            "barcode": "171145077",
            "dpc": "03042130501",
            "name": "ស្រី សុបិន្ត"
        },
        {
            "barcode": "171145078",
            "dpc": "03042130601",
            "name": "ម៉េត សុភ័ក្រ"
        },
        {
            "barcode": "171145079",
            "dpc": "03042130701",
            "name": "លិម ស៊ុយ"
        },
        {
            "barcode": "171145080",
            "dpc": "03042130801",
            "name": "កែវ មករា"
        },
        {
            "barcode": "171145081",
            "dpc": "03042130901",
            "name": "គង់ សារៀង"
        },
        {
            "barcode": "171145082",
            "dpc": "03042131001",
            "name": "ញុក៉ុ សុផល"
        },
        {
            "barcode": "171145083",
            "dpc": "03042131101",
            "name": "ឌុច ឌួង"
        },
        {
            "barcode": "171145084",
            "dpc": "03042131201",
            "name": "អ៊ី លក់សាច់ជ្រូក"
        },
        {
            "barcode": "171145085",
            "dpc": "03042131301",
            "name": "ឃាន ឃឿន"
        },
        {
            "barcode": "171145086",
            "dpc": "03042131401",
            "name": "យឹម សឿម"
        },
        {
            "barcode": "171145087",
            "dpc": "03042131501",
            "name": "បឿន សឹន"
        },
        {
            "barcode": "171145088",
            "dpc": "03042131601",
            "name": "ជួន ឃិន"
        },
        {
            "barcode": "171145089",
            "dpc": "03042131701",
            "name": "សំ ម៉ាច"
        },
        {
            "barcode": "171145090",
            "dpc": "03042131801",
            "name": "ឌុច ហ៊ល"
        },
        {
            "barcode": "171145091",
            "dpc": "03042131901",
            "name": "ឡាន ប៉ូន"
        },
        {
            "barcode": "171145092",
            "dpc": "03042132001",
            "name": "ហួត ប៊ុនធឿន"
        },
        {
            "barcode": "171145093",
            "dpc": "03042132101",
            "name": "សូ លន់"
        },
        {
            "barcode": "171145094",
            "dpc": "03042132201",
            "name": "ហួត សុគន្ធា"
        },
        {
            "barcode": "171145095",
            "dpc": "03042132301",
            "name": "ណុប យួន"
        },
        {
            "barcode": "171145096",
            "dpc": "03042132501",
            "name": "ស សំណាង"
        },
        {
            "barcode": "171145097",
            "dpc": "03042132601",
            "name": "មួង ធី"
        },
        {
            "barcode": "171145098",
            "dpc": "03042132701",
            "name": "លឹម លក្ខិណា"
        },
        {
            "barcode": "171145099",
            "dpc": "03042132801",
            "name": "លឹម ព្រន"
        },
        {
            "barcode": "171145100",
            "dpc": "03042132901",
            "name": "ឡៅ ឡេត"
        },
        {
            "barcode": "171145101",
            "dpc": "03042133001",
            "name": "យ៉ក ចាន់ណារ៉ា"
        },
        {
            "barcode": "171145102",
            "dpc": "03042133101",
            "name": "អ៊ួន ចាន់រួន"
        },
        {
            "barcode": "171145103",
            "dpc": "03042133201",
            "name": "មឿត ណារិន"
        },
        {
            "barcode": "171145104",
            "dpc": "03042133301",
            "name": "សោម សុខា"
        },
        {
            "barcode": "171145105",
            "dpc": "03042133401",
            "name": "ទេព ប៊ុនណ្ណា"
        },
        {
            "barcode": "171145106",
            "dpc": "03042133501",
            "name": "ញ៉ែម ស្រី"
        },
        {
            "barcode": "171145107",
            "dpc": "03042133601",
            "name": "លឹម សុវណ្ណា"
        },
        {
            "barcode": "171145108",
            "dpc": "03042133701",
            "name": "ឡាច លន់"
        },
        {
            "barcode": "171145109",
            "dpc": "03042133801",
            "name": "ស៊ន សង្វាត"
        },
        {
            "barcode": "171145110",
            "dpc": "03042133901",
            "name": "ប៉ុន សារឿន"
        },
        {
            "barcode": "171145111",
            "dpc": "03042134001",
            "name": "ជេត សាវុន"
        },
        {
            "barcode": "171145112",
            "dpc": "03042134101",
            "name": "សែម សាបើយ"
        },
        {
            "barcode": "171145113",
            "dpc": "03042134201",
            "name": "គល់ សារ៉ុម"
        },
        {
            "barcode": "171145114",
            "dpc": "03042134301",
            "name": "មីន ខ្លឹង"
        },
        {
            "barcode": "171145115",
            "dpc": "03042134501",
            "name": "ស៊ន ចាន់ដារ៉ា"
        },
        {
            "barcode": "171145116",
            "dpc": "03042134601",
            "name": "ពេជ្រ រស្មី"
        },
        {
            "barcode": "171145117",
            "dpc": "03042134701",
            "name": "មីត ស្មាន"
        },
        {
            "barcode": "171145118",
            "dpc": "03042134801",
            "name": "មាស សុខុម"
        },
        {
            "barcode": "171145119",
            "dpc": "03042134901",
            "name": "ឡន សារុំ"
        },
        {
            "barcode": "171145120",
            "dpc": "03042135001",
            "name": "ណុះ ផាត់ទីម៉ាស់"
        },
        {
            "barcode": "171145121",
            "dpc": "03042135101",
            "name": "ស៊ីត សា"
        },
        {
            "barcode": "171145122",
            "dpc": "03042135201",
            "name": "សន មារឌី"
        },
        {
            "barcode": "171145123",
            "dpc": "03042135301",
            "name": "លី កូប"
        },
        {
            "barcode": "171145124",
            "dpc": "03042135401",
            "name": "កែវ ច័ន្ទសុគន្ធា"
        },
        {
            "barcode": "171145125",
            "dpc": "03042135501",
            "name": "នៅ នី"
        },
        {
            "barcode": "171145126",
            "dpc": "03042135601",
            "name": "វ៉ាត សិម៉ឹ"
        },
        {
            "barcode": "171145127",
            "dpc": "03042135701",
            "name": "រ៉ិល សាន់"
        },
        {
            "barcode": "171145128",
            "dpc": "03042135801",
            "name": "កែវ ពៅ"
        },
        {
            "barcode": "171145129",
            "dpc": "03042135901",
            "name": "ជុំ សម្បត្តិ"
        },
        {
            "barcode": "171145130",
            "dpc": "03042136101",
            "name": "លី សុខម៉ី"
        },
        {
            "barcode": "171145131",
            "dpc": "03042136201",
            "name": "សួង សុភាព"
        },
        {
            "barcode": "171145132",
            "dpc": "03042136301",
            "name": "តុង ប៊ុននាង"
        },
        {
            "barcode": "171145133",
            "dpc": "03042136401",
            "name": "អ៊ីត ស្រឡេះ"
        },
        {
            "barcode": "171145134",
            "dpc": "03042136501",
            "name": "អ៊ីណា"
        },
        {
            "barcode": "171145135",
            "dpc": "03042136601",
            "name": "ឡាយ បំរ៉ុង"
        },
        {
            "barcode": "171145136",
            "dpc": "03042136801",
            "name": "ទីន សើហ្វីអ៊ី"
        },
        {
            "barcode": "171145137",
            "dpc": "03042136901",
            "name": "លី គីយ៉ា"
        },
        {
            "barcode": "171145138",
            "dpc": "03042137001",
            "name": "សេន ហ្វាស៊ី"
        },
        {
            "barcode": "171145139",
            "dpc": "03042137101",
            "name": "មីត ម៉ាត់"
        },
        {
            "barcode": "171145140",
            "dpc": "03042137201",
            "name": "ម៉ាត់ សាឡេះ"
        },
        {
            "barcode": "171145141",
            "dpc": "03042137401",
            "name": "កូប សុះ"
        },
        {
            "barcode": "171145142",
            "dpc": "03042137501",
            "name": "ស៊ុន សាវុន"
        },
        {
            "barcode": "171145143",
            "dpc": "03042137601",
            "name": "សុខ សាយ"
        },
        {
            "barcode": "171145144",
            "dpc": "03042137701",
            "name": "ពៅ កង"
        },
        {
            "barcode": "171145145",
            "dpc": "03042137801",
            "name": "យ៉ា យូសុះ"
        },
        {
            "barcode": "171145146",
            "dpc": "03042137901",
            "name": "ទីន ស្លេះ"
        },
        {
            "barcode": "171145147",
            "dpc": "03042138001",
            "name": "ឡិប ណើស"
        },
        {
            "barcode": "171145148",
            "dpc": "03042138101",
            "name": "ម៉ក់ សារ៉ើន"
        },
        {
            "barcode": "171145149",
            "dpc": "03042138301",
            "name": "ឡឹង ស៊្រាន"
        },
        {
            "barcode": "171145150",
            "dpc": "03042138401",
            "name": "សា ម៉ាអាត"
        },
        {
            "barcode": "171145151",
            "dpc": "03042138501",
            "name": "ងួន ផល"
        },
        {
            "barcode": "171145152",
            "dpc": "03042138601",
            "name": "ឱ សាវ៉ាត"
        },
        {
            "barcode": "171145153",
            "dpc": "03042138701",
            "name": "ឆាយ តាំង"
        },
        {
            "barcode": "171145154",
            "dpc": "03042138801",
            "name": "អឿន អាន"
        },
        {
            "barcode": "171145155",
            "dpc": "03042138901",
            "name": "តាន់ ជូឈៀង"
        },
        {
            "barcode": "171145156",
            "dpc": "03042139001",
            "name": "ម៉ៅ គី"
        },
        {
            "barcode": "171145157",
            "dpc": "03042139101",
            "name": "សារ៉ង សុផានី"
        },
        {
            "barcode": "171145158",
            "dpc": "03042139201",
            "name": "ថុល ផារី"
        },
        {
            "barcode": "171145159",
            "dpc": "03042139301",
            "name": "ឈិត ប៊ុនទ្រី"
        },
        {
            "barcode": "171145160",
            "dpc": "03042139401",
            "name": "អឿន សុខ"
        },
        {
            "barcode": "171145161",
            "dpc": "03042139501",
            "name": "ហោ សុវណ្ណ"
        },
        {
            "barcode": "171145162",
            "dpc": "03042139601",
            "name": "លី វណ្ណារ៉ា"
        },
        {
            "barcode": "171145163",
            "dpc": "03042139701",
            "name": "លួន សុថារី"
        },
        {
            "barcode": "171145164",
            "dpc": "03042139801",
            "name": "តាន់ ប្រុស"
        },
        {
            "barcode": "171145165",
            "dpc": "03042140101",
            "name": "ហូ សាន់"
        },
        {
            "barcode": "171145166",
            "dpc": "03042140201",
            "name": "យិន ហួង"
        },
        {
            "barcode": "171145167",
            "dpc": "03042140301",
            "name": "ស៊ិន លន"
        },
        {
            "barcode": "171145168",
            "dpc": "03042140401",
            "name": "ឡឹប ខរី"
        },
        {
            "barcode": "171145169",
            "dpc": "03042140501",
            "name": "លី ហាប់ស្រស់"
        },
        {
            "barcode": "171145170",
            "dpc": "03042140601",
            "name": "ស៊ុន ប៊ុនសុង"
        },
        {
            "barcode": "171145171",
            "dpc": "03042140701",
            "name": "ថោង វណ្ណះ"
        },
        {
            "barcode": "171145172",
            "dpc": "03042140801",
            "name": "ម៉ូត ម៉ាន"
        },
        {
            "barcode": "171145173",
            "dpc": "03042140901",
            "name": "សឿន ហាន"
        },
        {
            "barcode": "171145174",
            "dpc": "03042141001",
            "name": "សុះ តាស់"
        },
        {
            "barcode": "171145175",
            "dpc": "03042141101",
            "name": "សុះ ត្រហៀក"
        },
        {
            "barcode": "171145176",
            "dpc": "03042141201",
            "name": "ហ្វា ហាយ័ត"
        },
        {
            "barcode": "171145177",
            "dpc": "03042141301",
            "name": "រ៉េះ ហាស៊ីណាស់"
        },
        {
            "barcode": "171145178",
            "dpc": "03042141401",
            "name": "ឡិប មូសើ"
        },
        {
            "barcode": "171145179",
            "dpc": "03042141501",
            "name": "ហ៊ីម សាឡេះ"
        },
        {
            "barcode": "171145180",
            "dpc": "03042141701",
            "name": "ពៀន ប៉ូយ"
        },
        {
            "barcode": "171145181",
            "dpc": "03042141801",
            "name": "លី ម៉េង"
        },
        {
            "barcode": "171145182",
            "dpc": "03042141901",
            "name": "រ៉ិល ម៉ាន"
        },
        {
            "barcode": "171145183",
            "dpc": "03042142001",
            "name": "ទារ៍ សារ៉ាត់"
        },
        {
            "barcode": "171145184",
            "dpc": "03042142101",
            "name": "រ៉េស យូសុះ"
        },
        {
            "barcode": "171145185",
            "dpc": "03042142201",
            "name": "លី សំរ៉ស់"
        },
        {
            "barcode": "171145186",
            "dpc": "03042142301",
            "name": "ស្លេស ស្មាអែល"
        },
        {
            "barcode": "171145187",
            "dpc": "03042142401",
            "name": "នួន សារ៉េន"
        },
        {
            "barcode": "171145188",
            "dpc": "03042142501",
            "name": "ម៉ាត់ ហាំលី"
        },
        {
            "barcode": "171145189",
            "dpc": "03042142601",
            "name": "អ៊ូ រ៉ូន"
        },
        {
            "barcode": "171145190",
            "dpc": "03042142701",
            "name": "ផាន ផាន់"
        },
        {
            "barcode": "171145191",
            "dpc": "03042142801",
            "name": "ចេក ណើប"
        },
        {
            "barcode": "171145192",
            "dpc": "03042142901",
            "name": "ម៉ូត សារុន"
        },
        {
            "barcode": "171145193",
            "dpc": "03042143001",
            "name": "ស៊ូ ហ្វីយ៉ាន"
        },
        {
            "barcode": "171145194",
            "dpc": "03042143101",
            "name": "ឡោះ សាត"
        },
        {
            "barcode": "171145195",
            "dpc": "03042143201",
            "name": "ហ្វាន់ អាទីកាស់"
        },
        {
            "barcode": "171145196",
            "dpc": "03042143301",
            "name": "សើ សាត"
        },
        {
            "barcode": "171145197",
            "dpc": "03042143401",
            "name": "រុន ម៉ាលី"
        },
        {
            "barcode": "171145198",
            "dpc": "03042143501",
            "name": "ស្វាយ យ៉ិន"
        },
        {
            "barcode": "171145199",
            "dpc": "03042143601",
            "name": "ហ្វាស់ មាត់លី"
        },
        {
            "barcode": "171145200",
            "dpc": "03042143701",
            "name": "សេន ម៉ារី"
        },
        {
            "barcode": "171145201",
            "dpc": "03042143801",
            "name": "រេត សាហ៊ី្វ"
        },
        {
            "barcode": "171145202",
            "dpc": "03042143901",
            "name": "ហ៊ី្វ ហ្វៀស"
        },
        {
            "barcode": "171145203",
            "dpc": "03042144001",
            "name": "ទីន ប្រុស"
        },
        {
            "barcode": "171145204",
            "dpc": "03042144201",
            "name": "ឈឿត ម៉ាត់"
        },
        {
            "barcode": "171145205",
            "dpc": "03042144301",
            "name": "យ៉ុន សេន"
        },
        {
            "barcode": "171145206",
            "dpc": "03042144401",
            "name": "ឡឹប វណ្ណា"
        },
        {
            "barcode": "171145207",
            "dpc": "03042144501",
            "name": "ហ្វាស់ រ៉ស៊ីឌី"
        },
        {
            "barcode": "171145208",
            "dpc": "03042144601",
            "name": "ឯល ណាន"
        },
        {
            "barcode": "171145209",
            "dpc": "03042144701",
            "name": "ម៉ាត់ ស៊ីណាត"
        },
        {
            "barcode": "171145210",
            "dpc": "03042144801",
            "name": "ឯល ការីម ១"
        },
        {
            "barcode": "171145211",
            "dpc": "03042144901",
            "name": "ម៉ីន យូសុះ"
        },
        {
            "barcode": "171145212",
            "dpc": "03042145001",
            "name": "សុះ សារ៉ន"
        },
        {
            "barcode": "171145213",
            "dpc": "03042145101",
            "name": "ស៊ឹម ហែមី"
        },
        {
            "barcode": "171145214",
            "dpc": "03042145201",
            "name": "យ៉ើ កាម៉ារីយ៉ាស់"
        },
        {
            "barcode": "171145215",
            "dpc": "03042145301",
            "name": "សឹម ហាំម៉ាស់"
        },
        {
            "barcode": "171145216",
            "dpc": "03042145401",
            "name": "ម៉ូត ម៉ាន"
        },
        {
            "barcode": "171145217",
            "dpc": "03042145501",
            "name": "លី សេត"
        },
        {
            "barcode": "171145218",
            "dpc": "03042145601",
            "name": "មីន កល្លី"
        },
        {
            "barcode": "171145219",
            "dpc": "03042145701",
            "name": "ឃ្លីន ម៉ារីយ៉ាន"
        },
        {
            "barcode": "171145220",
            "dpc": "03042145801",
            "name": "ឡេះ សើ"
        },
        {
            "barcode": "171145221",
            "dpc": "03042145901",
            "name": "ឡោះ ហាំ"
        },
        {
            "barcode": "171145222",
            "dpc": "03042146001",
            "name": "ឯល អ៊ីសា"
        },
        {
            "barcode": "171145223",
            "dpc": "03042146101",
            "name": "ទូ ឡោះយ៉ាន"
        },
        {
            "barcode": "171145224",
            "dpc": "03042146201",
            "name": "ស្លេះ សាលីម"
        },
        {
            "barcode": "171145225",
            "dpc": "03042146301",
            "name": "ផេង ឡា"
        },
        {
            "barcode": "171145226",
            "dpc": "03042146401",
            "name": "វ៉ន សុផា"
        },
        {
            "barcode": "171145227",
            "dpc": "03042146501",
            "name": "សុះ យ៉ានី"
        },
        {
            "barcode": "171145228",
            "dpc": "03042146601",
            "name": "អែល សាវីវ៉ាន់ហ្ស៊េន"
        },
        {
            "barcode": "171145229",
            "dpc": "03042146701",
            "name": "សឹម រ៉សេត"
        },
        {
            "barcode": "171145230",
            "dpc": "03042146801",
            "name": "យ៉ាន់ ណូ"
        },
        {
            "barcode": "171145231",
            "dpc": "03042146901",
            "name": "ម៉ាន កាទ័រ"
        },
        {
            "barcode": "171145232",
            "dpc": "03042147001",
            "name": "ឯល ម៉ាស់"
        },
        {
            "barcode": "171145233",
            "dpc": "03042147101",
            "name": "សុះ ណាគាត"
        },
        {
            "barcode": "171145234",
            "dpc": "03042147201",
            "name": "លី ស្មាន"
        },
        {
            "barcode": "171145235",
            "dpc": "03042147301",
            "name": "ម៉ៅ ឡេះ"
        },
        {
            "barcode": "171145236",
            "dpc": "03042147401",
            "name": "ម៉ូត ម៉ាន"
        },
        {
            "barcode": "171145237",
            "dpc": "03042147501",
            "name": "ជា ផល្លា"
        },
        {
            "barcode": "171145238",
            "dpc": "03042147601",
            "name": "អ៊ុំ ស្រីមុំ"
        },
        {
            "barcode": "171145239",
            "dpc": "03042147701",
            "name": "រុន ហ្វាត់"
        },
        {
            "barcode": "171145240",
            "dpc": "03042147801",
            "name": "យ៉ា រំម្លី"
        },
        {
            "barcode": "171145241",
            "dpc": "03042147901",
            "name": "រ៉េះ កាណាឌី"
        },
        {
            "barcode": "171145242",
            "dpc": "03042148001",
            "name": "លី រ៉ស៊ី"
        }
    ];


barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
