let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "BBWS171144067",
            "dpc": "03052200301",
            "name": "សណ្ឋាគារប៉ារីស"
        },
        {
            "barcode": "BBWS171144068",
            "dpc": "03052200401",
            "name": "សណ្ឋាគាររ៉ូយ៉ាល់"
        },
        {
            "barcode": "BBWS171144069",
            "dpc": "03052200501",
            "name": "សណ្ឋាគាររ៉ូយ៉ាល់"
        },
        {
            "barcode": "BBWS171144070",
            "dpc": "03052200701",
            "name": "សណ្ឋាគារអន្តរជាតិ"
        },
        {
            "barcode": "BBWS171144071",
            "dpc": "03052200801",
            "name": "សណ្ឋាគារតេអូ"
        },
        {
            "barcode": "BBWS171144072",
            "dpc": "03052200901",
            "name": "សណ្ឋាគារតេអូ"
        },
        {
            "barcode": "BBWS171144073",
            "dpc": "03052201001",
            "name": "គ្លីនិកបាត់ដំបង"
        },
        {
            "barcode": "BBWS171144074",
            "dpc": "03052201101",
            "name": "ផ្ទះ.សំណាក់មនោរម្យ"
        },
        {
            "barcode": "BBWS171144075",
            "dpc": "03052201201",
            "name": "ភោជនីយដ្ឋានសប្បាយណាស់"
        },
        {
            "barcode": "BBWS171144076",
            "dpc": "03052201301",
            "name": "សួន សារុន ត្បូងវត្តសង្កែ"
        },
        {
            "barcode": "BBWS171144077",
            "dpc": "03052201501",
            "name": "ប៊ុត គឹមស៊ាន"
        },
        {
            "barcode": "BBWS171144078",
            "dpc": "03052201601",
            "name": "យ៉ម ចំរើន ១"
        },
        {
            "barcode": "BBWS171144079",
            "dpc": "03052201701",
            "name": "វែង  ស៊្រុន ៣"
        },
        {
            "barcode": "BBWS171144080",
            "dpc": "03052201801",
            "name": "សុខ សុខុន  ពន្ឋនាគារ"
        },
        {
            "barcode": "BBWS171144081",
            "dpc": "03052201901",
            "name": "រោងចក្រអគ្គិសនី(ក្រោមសាតូដូ)"
        },
        {
            "barcode": "BBWS171144082",
            "dpc": "03052202001",
            "name": "រោងចក្រអគ្គិសនី ២"
        },
        {
            "barcode": "BBWS171144083",
            "dpc": "03052202101",
            "name": "មណ្ឌលកុមារកំព្រា SOS"
        },
        {
            "barcode": "BBWS171144084",
            "dpc": "03052202201",
            "name": "យ៉ម ចំរើន ១"
        },
        {
            "barcode": "BBWS171144085",
            "dpc": "03052202301",
            "name": "អាជីវកម្មទឹកបរិសុទ្ធបន្ទាយស្រី"
        },
        {
            "barcode": "BBWS171144086",
            "dpc": "03052202401",
            "name": "សមាគមជនជាតិចិនលាងហួ"
        },
        {
            "barcode": "BBWS171144087",
            "dpc": "03052202501",
            "name": "លឹម ឆាយ ១"
        },
        {
            "barcode": "BBWS171144088",
            "dpc": "03052202601",
            "name": "សាខាគយនិងរដ្ឋាករខេត្ត"
        },
        {
            "barcode": "BBWS171144089",
            "dpc": "03052202701",
            "name": "អង្គការ ឃែ រំចេក៤"
        },
        {
            "barcode": "BBWS171144090",
            "dpc": "03052202801",
            "name": "សណ្ឋាគារ វិមានមាស"
        },
        {
            "barcode": "BBWS171144091",
            "dpc": "03052202901",
            "name": "តែ តៃលី ផ្សារលើ"
        },
        {
            "barcode": "BBWS171144092",
            "dpc": "03052203001",
            "name": "អ៊ុន ម៉េង​ សណ្ឋាគារអាស៊ី"
        },
        {
            "barcode": "BBWS171144093",
            "dpc": "03052203101",
            "name": "ស្ថានអគ្គកុងស៊ុលវៀតណាម"
        },
        {
            "barcode": "BBWS171144094",
            "dpc": "03052203201",
            "name": "ហម ចិត្រ"
        },
        {
            "barcode": "BBWS171144095",
            "dpc": "03052203301",
            "name": "ឃឹម វុទ្ធី"
        },
        {
            "barcode": "BBWS171144096",
            "dpc": "03052203401",
            "name": "សេង វ៉ាឡាត់"
        },
        {
            "barcode": "BBWS171144097",
            "dpc": "03052203501",
            "name": "ប្រព័ន្ធទឹកចូលផ្សារណាត់"
        },
        {
            "barcode": "BBWS171144098",
            "dpc": "03052203601",
            "name": "ស៊ុន សារ៉េត"
        },
        {
            "barcode": "BBWS171144099",
            "dpc": "03052203701",
            "name": "យ៉ាន បូផៃ សាច់អាំង២"
        },
        {
            "barcode": "BBWS171144100",
            "dpc": "03052203801",
            "name": "សុខ សុខុន ពីស៊ីនទឹក"
        },
        {
            "barcode": "BBWS171144101",
            "dpc": "03052203901",
            "name": "សៀ ស៊ិន"
        },
        {
            "barcode": "BBWS171144102",
            "dpc": "03052204001",
            "name": "អាហារដ្ឋានសន្តិភាព"
        },
        {
            "barcode": "BBWS171144103",
            "dpc": "03052204101",
            "name": "ឡេន រ៉ា លក់ពោះគោ២កន្លៈ"
        },
        {
            "barcode": "BBWS171144104",
            "dpc": "03052204201",
            "name": "ងួន ហួត (ថៃលី)"
        },
        {
            "barcode": "BBWS171144105",
            "dpc": "03052204301",
            "name": "ឈុន លីម"
        },
        {
            "barcode": "BBWS171144106",
            "dpc": "03052204401",
            "name": "ជា ថូន ផ្លូវលេខ៣"
        },
        {
            "barcode": "BBWS171144107",
            "dpc": "03052204501",
            "name": "ភោជនីយដ្ឋាន សួនយុវ័ន"
        },
        {
            "barcode": "BBWS171144108",
            "dpc": "03052204601",
            "name": "ទាន់សម័យម៉ាស្សាខារ៉ាអូខេ"
        },
        {
            "barcode": "BBWS171144109",
            "dpc": "03052204701",
            "name": "ទូច   លាងខេង"
        },
        {
            "barcode": "BBWS171144110",
            "dpc": "03052204801",
            "name": "ពៅ គឹមហាន(លក់គុយទាវ)"
        },
        {
            "barcode": "BBWS171144111",
            "dpc": "03052204901",
            "name": "ជឹម  ចំណាន(ឥន្ទ្រីយ៍មាស)"
        },
        {
            "barcode": "BBWS171144112",
            "dpc": "03052205001",
            "name": "អ៊ុយ លីវ(ប្រេងឥន្ទនៈឡាអេ)"
        },
        {
            "barcode": "BBWS171144113",
            "dpc": "03052205101",
            "name": "ហាក់ ឡេង(លក់គុយទាវឡាអេ)"
        },
        {
            "barcode": "BBWS171144114",
            "dpc": "03052205201",
            "name": "អាជីវកម្មសាណាត់២ (សេងហ៊ួ)"
        },
        {
            "barcode": "BBWS171144115",
            "dpc": "03052205301",
            "name": "ផិត ផៃណុង"
        },
        {
            "barcode": "BBWS171144116",
            "dpc": "03052205501",
            "name": "សោម  សាឃឿង"
        },
        {
            "barcode": "BBWS171144117",
            "dpc": "03052205601",
            "name": "សឿ រតនា"
        },
        {
            "barcode": "BBWS171144118",
            "dpc": "03052205701",
            "name": "ស្ថានីយ៏ តូតាល់"
        },
        {
            "barcode": "BBWS171144119",
            "dpc": "03052205801",
            "name": "ឃន ណារិទ្ធ"
        },
        {
            "barcode": "BBWS171144120",
            "dpc": "03052205901",
            "name": "សណ្ឋាគារស្តារ អ៊ុន ផល្លា"
        },
        {
            "barcode": "BBWS171144121",
            "dpc": "03052206001",
            "name": "សណ្ឋាគារ ឃីង"
        },
        {
            "barcode": "BBWS171144122",
            "dpc": "03052206101",
            "name": "ឡេង ហេង(សណ្ឋាគារ)"
        },
        {
            "barcode": "BBWS171144123",
            "dpc": "03052206201",
            "name": "វិច តូរីយ៉ា(សណ្ឋាគារ)"
        },
        {
            "barcode": "BBWS171144124",
            "dpc": "03052206301",
            "name": "ប៊ុន ពៅ រតនៈ(សណ្ឋាគារ)"
        },
        {
            "barcode": "BBWS171144125",
            "dpc": "03052206401",
            "name": "ជុក គឹមហ៊ាប់"
        },
        {
            "barcode": "BBWS171144126",
            "dpc": "03052206601",
            "name": "ហូ លីដេ(ផ្ទះសំណាក់)"
        },
        {
            "barcode": "BBWS171144127",
            "dpc": "03052206701",
            "name": "គុយ ទ្រី"
        },
        {
            "barcode": "BBWS171144128",
            "dpc": "03052206801",
            "name": "សោ ថាលី  កូលាបស"
        },
        {
            "barcode": "BBWS171144129",
            "dpc": "03052206901",
            "name": "ង៉ែត សុគន្ធ   (លក់បាយ )"
        },
        {
            "barcode": "BBWS171144130",
            "dpc": "03052207001",
            "name": "ប៉ោ  វណ្ណះ ១"
        },
        {
            "barcode": "BBWS171144131",
            "dpc": "03052207101",
            "name": "វត្តពោវាល"
        },
        {
            "barcode": "BBWS171144132",
            "dpc": "03052207201",
            "name": "ស៊ុន  ប៊ុនតារា(ផ្សារលើ)"
        },
        {
            "barcode": "BBWS171144133",
            "dpc": "03052207301",
            "name": "ប្រេង តេលា"
        },
        {
            "barcode": "BBWS171144134",
            "dpc": "03052207401",
            "name": "ជា  ពលរិទ្ធ    ខារ៉ាអូឃេ"
        },
        {
            "barcode": "BBWS171144135",
            "dpc": "03052207501",
            "name": "ឃេ អូ  ភោជនីយដ្ឋាន"
        },
        {
            "barcode": "BBWS171144136",
            "dpc": "03052207601",
            "name": "ហួន ហៀង  ភោជនីយដ្ឋានអាស៊ានបៀរ"
        },
        {
            "barcode": "BBWS171144137",
            "dpc": "03052207701",
            "name": "ជឹម  ពៅ"
        },
        {
            "barcode": "BBWS171144138",
            "dpc": "03052207801",
            "name": "សុខ  រ៉ាថន ១"
        },
        {
            "barcode": "BBWS171144139",
            "dpc": "03052207901",
            "name": "ឡុង សុធី  ភោជនីយដ្ឋាន"
        },
        {
            "barcode": "BBWS171144140",
            "dpc": "03052208001",
            "name": "ម៉ៅ ហួរ  បណ្តុះសណ្តែក"
        },
        {
            "barcode": "BBWS171144141",
            "dpc": "03052208101",
            "name": "នូវ សាវុធ មៃមៃ ភោជនីយដ្ឋាន"
        },
        {
            "barcode": "BBWS171144142",
            "dpc": "03052208201",
            "name": "វី  ឆែ"
        },
        {
            "barcode": "BBWS171144143",
            "dpc": "03052208301",
            "name": "ញ៉ែម វណ្ណា  លាង ឡាន"
        },
        {
            "barcode": "BBWS171144144",
            "dpc": "03052208401",
            "name": "ម៉ៅ សេងថៃ   ភរំចេក៤"
        },
        {
            "barcode": "BBWS171144145",
            "dpc": "03052208501",
            "name": "សណ្ឋាគារ បាណន់"
        },
        {
            "barcode": "BBWS171144146",
            "dpc": "03052208601",
            "name": "យូ ចាន់ទី"
        },
        {
            "barcode": "BBWS171144147",
            "dpc": "03052208801",
            "name": "ផ្សារ ក្រណាត់ បឹងឈូក"
        },
        {
            "barcode": "BBWS171144148",
            "dpc": "03052208901",
            "name": "ព្រៈវិហារកាតូលិក ១"
        },
        {
            "barcode": "BBWS171144149",
            "dpc": "03052209001",
            "name": "គីម វែង  លាង ឡាន"
        },
        {
            "barcode": "BBWS171144150",
            "dpc": "03052209101",
            "name": "យ៉ុន តូរ៉ាត់ ឃេអូរ"
        },
        {
            "barcode": "BBWS171144151",
            "dpc": "03052209201",
            "name": "ស៊ីន ឃន   (សាច់គោអាំង )"
        },
        {
            "barcode": "BBWS171144152",
            "dpc": "03052209301",
            "name": "សមាគមគុយទាវ"
        },
        {
            "barcode": "BBWS171144153",
            "dpc": "03052209401",
            "name": "វិញ  សាន់"
        },
        {
            "barcode": "BBWS171144154",
            "dpc": "03052209501",
            "name": "នរោត្តម ចក្រាវុធ"
        },
        {
            "barcode": "BBWS171144155",
            "dpc": "03052209601",
            "name": "ណា ណៃ"
        },
        {
            "barcode": "BBWS171144156",
            "dpc": "03052209801",
            "name": "ឯ.ឧ. ងិន ឃន ៣"
        },
        {
            "barcode": "BBWS171144157",
            "dpc": "03052209901",
            "name": "ជ្រិន ញ៉"
        },
        {
            "barcode": "BBWS171144158",
            "dpc": "03052210001",
            "name": "សកលវិទ្យាល័យ ប្រជាជាតិ"
        },
        {
            "barcode": "BBWS171144159",
            "dpc": "03052210101",
            "name": "អា  មួយ"
        },
        {
            "barcode": "BBWS171144160",
            "dpc": "03052210201",
            "name": "កែវ វ៉ាន់ទី"
        },
        {
            "barcode": "BBWS171144161",
            "dpc": "03052210301",
            "name": "សណ្នាគារ ជយ័ជំនៈ"
        },
        {
            "barcode": "BBWS171144162",
            "dpc": "03052210401",
            "name": "ខៀវ ផុន"
        },
        {
            "barcode": "BBWS171144163",
            "dpc": "03052210501",
            "name": "នូ ណូរ៉ា"
        },
        {
            "barcode": "BBWS171144164",
            "dpc": "03052210601",
            "name": "ថាច់ សង្វាត"
        },
        {
            "barcode": "BBWS171144165",
            "dpc": "03052210701",
            "name": "គឹម សារី"
        },
        {
            "barcode": "BBWS171144166",
            "dpc": "03052210801",
            "name": "ចំណតរថយន្ត"
        },
        {
            "barcode": "BBWS171144167",
            "dpc": "03052210901",
            "name": "ប៊ុន សេង (គ្លីនិកសុខភាព)"
        },
        {
            "barcode": "BBWS171144168",
            "dpc": "03052211001",
            "name": "សុខ  សុខុម"
        },
        {
            "barcode": "BBWS171144169",
            "dpc": "03052211101",
            "name": "ផ្សារលក់ត្រី"
        },
        {
            "barcode": "BBWS171144170",
            "dpc": "03052211201",
            "name": "ជា   សង្វាសេរីវឌ្ឍន៏"
        },
        {
            "barcode": "BBWS171144171",
            "dpc": "03052211301",
            "name": "ព្រៈវិហារកាតូលិក ២"
        },
        {
            "barcode": "BBWS171144172",
            "dpc": "03052211401",
            "name": "អ៊ី ផេង"
        },
        {
            "barcode": "BBWS171144173",
            "dpc": "03052211501",
            "name": "វែង ស៊្រុន"
        },
        {
            "barcode": "BBWS171144174",
            "dpc": "03052211601",
            "name": "អេង ពេញ"
        },
        {
            "barcode": "BBWS171144175",
            "dpc": "03052211701",
            "name": "គង់ យឿម ផ្ទ.  ក.  ភ."
        },
        {
            "barcode": "BBWS171144176",
            "dpc": "03052211901",
            "name": "ប៊ុន សេង ១"
        },
        {
            "barcode": "BBWS171144177",
            "dpc": "03052212001",
            "name": "អង្កការ អេ អ អឹម"
        },
        {
            "barcode": "BBWS171144178",
            "dpc": "03052212101",
            "name": "គិត   រ៉ាវី"
        },
        {
            "barcode": "BBWS171144179",
            "dpc": "03052212201",
            "name": "ហេង យាន (ហាងអ៊ិចហ្គោល )"
        },
        {
            "barcode": "BBWS171144180",
            "dpc": "03052212301",
            "name": "ផ្ទះ.សំណាក់ភ្នំខៀវ"
        },
        {
            "barcode": "BBWS171144181",
            "dpc": "03052212401",
            "name": "សំ  កុល"
        },
        {
            "barcode": "BBWS171144182",
            "dpc": "03052212501",
            "name": "សេង សុម៉ាឡៃ (ខារាអូខេហេបភី )"
        },
        {
            "barcode": "BBWS171144183",
            "dpc": "03052212601",
            "name": "ណង  ណារ័ត្ន"
        },
        {
            "barcode": "BBWS171144184",
            "dpc": "03052212701",
            "name": "លឹម ភិចហួរ"
        },
        {
            "barcode": "BBWS171144185",
            "dpc": "03052212801",
            "name": "លឹម ឆាយ ២"
        },
        {
            "barcode": "BBWS171144186",
            "dpc": "03052212901",
            "name": "លឹម ឆាយ ៣"
        },
        {
            "barcode": "BBWS171144187",
            "dpc": "03052213001",
            "name": "លឹម ឆាយ ៤"
        },
        {
            "barcode": "BBWS171144188",
            "dpc": "03052213101",
            "name": "ជី អែស ធី"
        },
        {
            "barcode": "BBWS171144189",
            "dpc": "03052213201",
            "name": "ហួន សាយ"
        },
        {
            "barcode": "BBWS171144190",
            "dpc": "03052213301",
            "name": "ក្រុម ជុំនុំ ប៊ី អែស ធី"
        },
        {
            "barcode": "BBWS171144191",
            "dpc": "03052213401",
            "name": "អេង សុខនេត"
        },
        {
            "barcode": "BBWS171144192",
            "dpc": "03052213501",
            "name": "រស់ សារ៉ន"
        },
        {
            "barcode": "BBWS171144193",
            "dpc": "03052213601",
            "name": "លឹម  ឈួងសៀ"
        },
        {
            "barcode": "BBWS171144194",
            "dpc": "03052213701",
            "name": "យ៉ា សារឿន"
        },
        {
            "barcode": "BBWS171144195",
            "dpc": "03052213801",
            "name": "រស់ ពិសិដ្ឋ"
        },
        {
            "barcode": "BBWS171144196",
            "dpc": "03052213901",
            "name": "វែង ស៊្រុន ២"
        },
        {
            "barcode": "BBWS171144197",
            "dpc": "03052214001",
            "name": "រិន វិសាល ១"
        },
        {
            "barcode": "BBWS171144198",
            "dpc": "03052214101",
            "name": "ស៊ិន ហួរ"
        },
        {
            "barcode": "BBWS171144199",
            "dpc": "03052214201",
            "name": "ហែម សុធា"
        },
        {
            "barcode": "BBWS171144200",
            "dpc": "03052214301",
            "name": "សាលារៀន យូ.អ៊ឹម.អ៊ី"
        },
        {
            "barcode": "BBWS171144201",
            "dpc": "03052214401",
            "name": "គឹម សុខ"
        },
        {
            "barcode": "BBWS171144202",
            "dpc": "03052214501",
            "name": "ការ៉ាស់សាំង តេលា (អន្លង់វិល )"
        },
        {
            "barcode": "BBWS171144203",
            "dpc": "03052214601",
            "name": "កុមារឥតព្រំដែន"
        },
        {
            "barcode": "BBWS171144204",
            "dpc": "03052214701",
            "name": "ហុង ឆាយ"
        },
        {
            "barcode": "BBWS171144205",
            "dpc": "03052214801",
            "name": "ហៃ ភួង"
        },
        {
            "barcode": "BBWS171144206",
            "dpc": "03052214901",
            "name": "អ៊ារ ថៃភួង"
        },
        {
            "barcode": "BBWS171144207",
            "dpc": "03052215001",
            "name": "វិទ្យាល័យបៀលប្រាយ ១"
        },
        {
            "barcode": "BBWS171144208",
            "dpc": "03052215101",
            "name": "កូវ ជីងប៊ុង"
        },
        {
            "barcode": "BBWS171144209",
            "dpc": "03052215201",
            "name": "សួន ឆៀត (ស្ទួន២៣ )"
        },
        {
            "barcode": "BBWS171144210",
            "dpc": "03052215301",
            "name": "ធា   លឹម"
        },
        {
            "barcode": "BBWS171144211",
            "dpc": "03052215401",
            "name": "សត្តឃាត"
        },
        {
            "barcode": "BBWS171144212",
            "dpc": "03052215501",
            "name": "សំ   គីម ២"
        },
        {
            "barcode": "BBWS171144213",
            "dpc": "03052215601",
            "name": "ព្រឿន  សឿត"
        },
        {
            "barcode": "BBWS171144214",
            "dpc": "03052215701",
            "name": "អ៊ុត   មួយ ១"
        },
        {
            "barcode": "BBWS171144215",
            "dpc": "03052215801",
            "name": "អ៊ុត   មួយ ២"
        },
        {
            "barcode": "BBWS171144216",
            "dpc": "03052215901",
            "name": "ថាំ   ស៊ុនថូ"
        },
        {
            "barcode": "BBWS171144217",
            "dpc": "03052216001",
            "name": "វែង   សុផល"
        },
        {
            "barcode": "BBWS171144218",
            "dpc": "03052216101",
            "name": "ប៉ា   សុជាតិវង្ស"
        },
        {
            "barcode": "BBWS171144219",
            "dpc": "03052216301",
            "name": "ចាន់   សម្ជស្ស"
        },
        {
            "barcode": "BBWS171144220",
            "dpc": "03052216401",
            "name": "តាំង  ជុងខេង"
        },
        {
            "barcode": "BBWS171144221",
            "dpc": "03052216501",
            "name": "ឡូ   សុផល"
        },
        {
            "barcode": "BBWS171144222",
            "dpc": "03052216601",
            "name": "សាប៊ូ  អូហ្សាណូ"
        },
        {
            "barcode": "BBWS171144223",
            "dpc": "03052216701",
            "name": "នក់   ម៉ង់"
        },
        {
            "barcode": "BBWS171144224",
            "dpc": "03052216801",
            "name": "សយ បូរ៉ា"
        },
        {
            "barcode": "BBWS171144225",
            "dpc": "03052216901",
            "name": "ហ៊ុយុ ហេង"
        },
        {
            "barcode": "BBWS171144226",
            "dpc": "03052217101",
            "name": "ហុង  សារិន"
        },
        {
            "barcode": "BBWS171144227",
            "dpc": "03052217201",
            "name": "ឌុក អៀក"
        },
        {
            "barcode": "BBWS171144228",
            "dpc": "03052217401",
            "name": "សេរី ចរិយា ១"
        },
        {
            "barcode": "BBWS171144229",
            "dpc": "03052217501",
            "name": "សេរី ចរិយា ២"
        },
        {
            "barcode": "BBWS171144230",
            "dpc": "03052217601",
            "name": "ណៃ គឹមសុន ២"
        },
        {
            "barcode": "BBWS171144231",
            "dpc": "03052217701",
            "name": "សេង សុទ្ធី"
        },
        {
            "barcode": "BBWS171144232",
            "dpc": "03052217801",
            "name": "មាស សុភាព"
        },
        {
            "barcode": "BBWS171144233",
            "dpc": "03052217901",
            "name": "ប៊ន សោ ភ័ណ"
        },
        {
            "barcode": "BBWS171144234",
            "dpc": "03052218101",
            "name": "វិទ្យាល័យបៀលប្រាយ ២"
        },
        {
            "barcode": "BBWS171144235",
            "dpc": "03052218201",
            "name": "ងិន ឃន ១"
        },
        {
            "barcode": "BBWS171144236",
            "dpc": "03052218301",
            "name": "ងិន ឃន ៤"
        },
        {
            "barcode": "BBWS171144237",
            "dpc": "03052218401",
            "name": "ងិន ឃន ៥"
        },
        {
            "barcode": "BBWS171144238",
            "dpc": "03052218501",
            "name": "ងិន ឃន ៦"
        },
        {
            "barcode": "BBWS171144239",
            "dpc": "03052218601",
            "name": "យ៉ម   ចំរើន ៤"
        },
        {
            "barcode": "BBWS171144240",
            "dpc": "03052218701",
            "name": "សណ្ឋាគារស្ទឹងសង្កែ"
        },
        {
            "barcode": "BBWS171144241",
            "dpc": "03052218801",
            "name": "ហេង លាប"
        },
        {
            "barcode": "BBWS171144242",
            "dpc": "03052218901",
            "name": "វ៉ាន់  ហម"
        },
        {
            "barcode": "BBWS171144243",
            "dpc": "03052219001",
            "name": "រស់ យាន"
        },
        {
            "barcode": "BBWS171144244",
            "dpc": "03052219101",
            "name": "ភោជនីយដ្ឋាន វិមានរៀម"
        },
        {
            "barcode": "BBWS171144245",
            "dpc": "03052219301",
            "name": "សួន  រើន"
        },
        {
            "barcode": "BBWS171144246",
            "dpc": "03052219401",
            "name": "លឹម  ទៀហេង"
        },
        {
            "barcode": "BBWS171144247",
            "dpc": "03052219501",
            "name": "បេង  ភី ១"
        },
        {
            "barcode": "BBWS171144248",
            "dpc": "03052219601",
            "name": "កាកបាទក្រហម"
        },
        {
            "barcode": "BBWS171144249",
            "dpc": "03052219701",
            "name": "ប៊ុន  សេង ២"
        },
        {
            "barcode": "BBWS171144250",
            "dpc": "03052219801",
            "name": "តូ  មិត"
        },
        {
            "barcode": "BBWS171144251",
            "dpc": "03052219901",
            "name": "ហេង តុលា"
        },
        {
            "barcode": "BBWS171144252",
            "dpc": "03052220101",
            "name": "តូតាល់អន្លងវិល"
        },
        {
            "barcode": "BBWS171144253",
            "dpc": "03052220201",
            "name": "សាឌុន  សារិទ្ធ"
        },
        {
            "barcode": "BBWS171144254",
            "dpc": "03052220301",
            "name": "ជាម ចាន់សោភ័ណ"
        },
        {
            "barcode": "BBWS171144255",
            "dpc": "03052220401",
            "name": "ម៉ៅ  អេង"
        },
        {
            "barcode": "BBWS171144256",
            "dpc": "03052220501",
            "name": "ឡុង  សុធី ២"
        },
        {
            "barcode": "BBWS171144257",
            "dpc": "03052220601",
            "name": "ហត្ថ  ធី"
        },
        {
            "barcode": "BBWS171144258",
            "dpc": "03052220701",
            "name": "យិន  គិតឡេង"
        },
        {
            "barcode": "BBWS171144259",
            "dpc": "03052220901",
            "name": "អ៊ឹង  គឹមលី"
        },
        {
            "barcode": "BBWS171144260",
            "dpc": "03052221001",
            "name": "មាស ចាន់ធឿន"
        },
        {
            "barcode": "BBWS171144261",
            "dpc": "03052221101",
            "name": "រី  រឿន"
        },
        {
            "barcode": "BBWS171144262",
            "dpc": "03052221201",
            "name": "ណាំ  ទុំ (រ៉ាក់ )"
        },
        {
            "barcode": "BBWS171144263",
            "dpc": "03052221301",
            "name": "ហួយ ចន្ធី"
        },
        {
            "barcode": "BBWS171144264",
            "dpc": "03052221401",
            "name": "រាជ  សុវណ្ណារិទ្ធ (ហូលីដេ ២ )"
        },
        {
            "barcode": "BBWS171144265",
            "dpc": "03052221501",
            "name": "អ៊ឹង  គីរីរ័ត្ន"
        },
        {
            "barcode": "BBWS171144266",
            "dpc": "03052221601",
            "name": "ប៉ាត់  ផលបុត្រ"
        },
        {
            "barcode": "BBWS171144267",
            "dpc": "03052221701",
            "name": "ប៊ុន  សុវណ្ណ"
        },
        {
            "barcode": "BBWS171144268",
            "dpc": "03052221801",
            "name": "យន់  ណូរ៉ាត"
        },
        {
            "barcode": "BBWS171144269",
            "dpc": "03052221901",
            "name": "ង៉ូវ  វែងហុក"
        },
        {
            "barcode": "BBWS171144270",
            "dpc": "03052222001",
            "name": "ខេមរាបាត់ដំបង ១"
        },
        {
            "barcode": "BBWS171144271",
            "dpc": "03052222101",
            "name": "ខេមរាបាត់ដំបង ២"
        },
        {
            "barcode": "BBWS171144272",
            "dpc": "03052222201",
            "name": "រាត្រីស្ទឹងសង្គែ"
        },
        {
            "barcode": "BBWS171144273",
            "dpc": "03052222401",
            "name": "ប៉ោ  វណ្ណះ"
        },
        {
            "barcode": "BBWS171144274",
            "dpc": "03052222501",
            "name": "ចាន់  ធី"
        },
        {
            "barcode": "BBWS171144275",
            "dpc": "03052222601",
            "name": "សុខ  រ៉ាថន (ការ៉ាស់សាំង សូគីម៉ិច  )"
        },
        {
            "barcode": "BBWS171144276",
            "dpc": "03052222701",
            "name": "ឈឹម  ស៊ួ"
        },
        {
            "barcode": "BBWS171144277",
            "dpc": "03052222801",
            "name": "មឹក  ហេង"
        },
        {
            "barcode": "BBWS171144278",
            "dpc": "03052222901",
            "name": "តាំង  ឈុន (ប៉ូលីស )"
        },
        {
            "barcode": "BBWS171144279",
            "dpc": "03052223001",
            "name": "សុខ  ឡាវ"
        },
        {
            "barcode": "BBWS171144280",
            "dpc": "03052223101",
            "name": "លឹម  សេងហ៊ួរ"
        },
        {
            "barcode": "BBWS171144281",
            "dpc": "03052223301",
            "name": "ជា  អេង ២"
        },
        {
            "barcode": "BBWS171144282",
            "dpc": "03052223401",
            "name": "ហោ  តុងហាប់"
        },
        {
            "barcode": "BBWS171144283",
            "dpc": "03052223501",
            "name": "បេង  ភី"
        },
        {
            "barcode": "BBWS171144284",
            "dpc": "03052223601",
            "name": "បេ  សារឿន"
        },
        {
            "barcode": "BBWS171144285",
            "dpc": "03052223801",
            "name": "ហម  សាម៉ុន"
        },
        {
            "barcode": "BBWS171144286",
            "dpc": "03052223901",
            "name": "បង្គន់អនាម័យសាធាណះ"
        },
        {
            "barcode": "BBWS171144287",
            "dpc": "03052224001",
            "name": "តុក  សុងសួ"
        },
        {
            "barcode": "BBWS171144288",
            "dpc": "03052224101",
            "name": "សិប្បកម្មលូ"
        },
        {
            "barcode": "BBWS171144289",
            "dpc": "03052224201",
            "name": "បួន  សៀ"
        },
        {
            "barcode": "BBWS171144290",
            "dpc": "03052224301",
            "name": "ដៃដែក"
        },
        {
            "barcode": "BBWS171144291",
            "dpc": "03052224401",
            "name": "ស  ឌឿ"
        },
        {
            "barcode": "BBWS171144292",
            "dpc": "03052224501",
            "name": "អ៊ុំ  ចំរើន"
        },
        {
            "barcode": "BBWS171144293",
            "dpc": "03052224601",
            "name": "ហ៊ូ  រតនា"
        },
        {
            "barcode": "BBWS171144294",
            "dpc": "03052224701",
            "name": "ឌុក  ឆវេត"
        },
        {
            "barcode": "BBWS171144295",
            "dpc": "03052224801",
            "name": "អ៊ុំ  អេង"
        },
        {
            "barcode": "BBWS171144296",
            "dpc": "03052224901",
            "name": "សាលា អ៊ី.ស៊ី.ស៊ី"
        },
        {
            "barcode": "BBWS171144297",
            "dpc": "03052225001",
            "name": "ហួន  ហេង"
        },
        {
            "barcode": "BBWS171144298",
            "dpc": "03052225101",
            "name": "ស៊ុន លីនណា"
        },
        {
            "barcode": "BBWS171144299",
            "dpc": "03052225201",
            "name": "នៅ  យូរឡុង (វត្តសូភី )"
        },
        {
            "barcode": "BBWS171144300",
            "dpc": "03052225301",
            "name": "វត្តពោធិក្នុង"
        },
        {
            "barcode": "BBWS171144301",
            "dpc": "03052225401",
            "name": "កុង  យក់"
        },
        {
            "barcode": "BBWS171144302",
            "dpc": "03052225501",
            "name": "តាំង  ឡាយ"
        },
        {
            "barcode": "BBWS171144303",
            "dpc": "03052225601",
            "name": "ឈិត  សុក"
        },
        {
            "barcode": "BBWS171144304",
            "dpc": "03052225701",
            "name": "អែម  សុផល"
        },
        {
            "barcode": "BBWS171144305",
            "dpc": "03052225801",
            "name": "សន  និល"
        },
        {
            "barcode": "BBWS171144306",
            "dpc": "03052225901",
            "name": "គឹម  មុន្នី"
        },
        {
            "barcode": "BBWS171144307",
            "dpc": "03052226001",
            "name": "អ៊ុក  ស៊ីណយ"
        },
        {
            "barcode": "BBWS171144308",
            "dpc": "03052226101",
            "name": "ប្រាក់  ព្រី"
        },
        {
            "barcode": "BBWS171144309",
            "dpc": "03052226201",
            "name": "ងួន  ពន្លក"
        },
        {
            "barcode": "BBWS171144310",
            "dpc": "03052226301",
            "name": "សេង  ប៊ូ"
        },
        {
            "barcode": "BBWS171144311",
            "dpc": "03052226501",
            "name": "ផ្សារថ្មី"
        },
        {
            "barcode": "BBWS171144312",
            "dpc": "03052226601",
            "name": "តាំង  ម៉េងគង់"
        },
        {
            "barcode": "BBWS171144313",
            "dpc": "03052226701",
            "name": "វត្តផ្សារថ្មី"
        },
        {
            "barcode": "BBWS171144314",
            "dpc": "03052226801",
            "name": "ចេង  អឿន"
        },
        {
            "barcode": "BBWS171144315",
            "dpc": "03052226901",
            "name": "ក្រុមហ៊ុន អិលឌីអែស"
        },
        {
            "barcode": "BBWS171144316",
            "dpc": "03052227001",
            "name": "តុប  ថូលីណា ១"
        },
        {
            "barcode": "BBWS171144317",
            "dpc": "03052227101",
            "name": "តុប  ថូលីណា ២"
        },
        {
            "barcode": "BBWS171144318",
            "dpc": "03052227201",
            "name": "ឡាំ  ឆៃលីន"
        },
        {
            "barcode": "BBWS171144319",
            "dpc": "03052227301",
            "name": "វ៉ាន់  ណារ៉េត"
        },
        {
            "barcode": "BBWS171144320",
            "dpc": "03052227401",
            "name": "នៅ  សិទ្ធិគុណ"
        },
        {
            "barcode": "BBWS171144321",
            "dpc": "03052227501",
            "name": "សួន  វណ្ណនេត"
        },
        {
            "barcode": "BBWS171144322",
            "dpc": "03052227601",
            "name": "សៀ   ស៊ិន ១"
        },
        {
            "barcode": "BBWS171144323",
            "dpc": "03052227701",
            "name": "គាន  ថៃ ១"
        },
        {
            "barcode": "BBWS171144324",
            "dpc": "03052227801",
            "name": "ឃុន  ងួនហុង"
        },
        {
            "barcode": "BBWS171144325",
            "dpc": "03052227901",
            "name": "វិទ្យាល័យបៀលប្រាយ ៣"
        },
        {
            "barcode": "BBWS171144326",
            "dpc": "03052228001",
            "name": "សន  សុភ័ក្រ"
        },
        {
            "barcode": "BBWS171144327",
            "dpc": "03052228101",
            "name": "ឡុង  ចន្ថា"
        },
        {
            "barcode": "BBWS171144328",
            "dpc": "03052228201",
            "name": "ម៉ម  បណ្ឌិត"
        },
        {
            "barcode": "BBWS171144329",
            "dpc": "03052228301",
            "name": "គង់  ធី"
        },
        {
            "barcode": "BBWS171144330",
            "dpc": "03052228501",
            "name": "លក  វណ្ណ"
        },
        {
            "barcode": "BBWS171144331",
            "dpc": "03052228601",
            "name": "វ៉ាត់   ស៊ីម"
        },
        {
            "barcode": "BBWS171144332",
            "dpc": "03052228701",
            "name": "ហ៊ាង  រ៉ាវុធ"
        },
        {
            "barcode": "BBWS171144333",
            "dpc": "03052228801",
            "name": "ទៀប  រី ២"
        },
        {
            "barcode": "BBWS171144334",
            "dpc": "03052228901",
            "name": "លឹម  ហូ"
        },
        {
            "barcode": "BBWS171144335",
            "dpc": "03052229001",
            "name": "ខឹម  សាឃឿន"
        },
        {
            "barcode": "BBWS171144336",
            "dpc": "03052229201",
            "name": "សឹង  លី"
        },
        {
            "barcode": "BBWS171144337",
            "dpc": "03052229301",
            "name": "ឯម  សុវណ្ណារ៉ា"
        },
        {
            "barcode": "BBWS171144338",
            "dpc": "03052229401",
            "name": "ទឹម  វណ្ណា"
        },
        {
            "barcode": "BBWS171144339",
            "dpc": "03052229501",
            "name": "ផុន  ផាវុធ"
        },
        {
            "barcode": "BBWS171144340",
            "dpc": "03052229601",
            "name": "ឈុំ  ចាន់"
        },
        {
            "barcode": "BBWS171144341",
            "dpc": "03052229701",
            "name": "វត្តកណ្តាល"
        },
        {
            "barcode": "BBWS171144342",
            "dpc": "03052229801",
            "name": "ឌិត  ជិន"
        },
        {
            "barcode": "BBWS171144343",
            "dpc": "03052229901",
            "name": "ជួប  យ៉ុម"
        },
        {
            "barcode": "BBWS171145243",
            "dpc": "03052225001",
            "name": "ហួន  ហេង"
        },
        {
            "barcode": "BBWS171145244",
            "dpc": "03052225001",
            "name": "ហួន  ហេង"
        },
        {
            "barcode": "BBWS171145245",
            "dpc": "03052215801",
            "name": "អ៊ុត   មួយ ២"
        },
        {
            "barcode": "BBWS171145246",
            "dpc": "03052218801",
            "name": "ហេង លាប"
        },
        {
            "barcode": "BBWS180208511",
            "dpc": "03052200301",
            "name": "សណ្ឋាគារប៉ារីស"
        },
        {
            "barcode": "BBWS180208512",
            "dpc": "03052200401",
            "name": "សណ្ឋាគាររ៉ូយ៉ាល់"
        },
        {
            "barcode": "BBWS180208513",
            "dpc": "03052200501",
            "name": "សណ្ឋាគាររ៉ូយ៉ាល់"
        },
        {
            "barcode": "BBWS180208514",
            "dpc": "03052200701",
            "name": "សណ្ឋាគារអន្តរជាតិ"
        },
        {
            "barcode": "BBWS180208515",
            "dpc": "03052200801",
            "name": "សណ្ឋាគារតេអូ"
        },
        {
            "barcode": "BBWS180208516",
            "dpc": "03052200901",
            "name": "សណ្ឋាគារតេអូ"
        },
        {
            "barcode": "BBWS180208517",
            "dpc": "03052201001",
            "name": "គ្លីនិកបាត់ដំបង"
        },
        {
            "barcode": "BBWS180208518",
            "dpc": "03052201101",
            "name": "ផ្ទះ.សំណាក់មនោរម្យ"
        },
        {
            "barcode": "BBWS180208519",
            "dpc": "03052201201",
            "name": "ភោជនីយដ្ឋានសប្បាយណាស់"
        },
        {
            "barcode": "BBWS180208520",
            "dpc": "03052201301",
            "name": "សួន សារុន ត្បូងវត្តសង្កែ"
        },
        {
            "barcode": "BBWS180208521",
            "dpc": "03052201501",
            "name": "ប៊ុត គឹមស៊ាន"
        },
        {
            "barcode": "BBWS180208522",
            "dpc": "03052201601",
            "name": "យ៉ម ចំរើន ១"
        },
        {
            "barcode": "BBWS180208523",
            "dpc": "03052201701",
            "name": "វែង  ស៊្រុន ៣"
        },
        {
            "barcode": "BBWS180208524",
            "dpc": "03052201801",
            "name": "សុខ សុខុន  ពន្ឋនាគារ"
        },
        {
            "barcode": "BBWS180208525",
            "dpc": "03052201901",
            "name": "រោងចក្រអគ្គិសនី(ក្រោមសាតូដូ)"
        },
        {
            "barcode": "BBWS180208526",
            "dpc": "03052202001",
            "name": "រោងចក្រអគ្គិសនី ២"
        },
        {
            "barcode": "BBWS180208527",
            "dpc": "03052202101",
            "name": "មណ្ឌលកុមារកំព្រា SOS"
        },
        {
            "barcode": "BBWS180208528",
            "dpc": "03052202201",
            "name": "យ៉ម ចំរើន ១"
        },
        {
            "barcode": "BBWS180208529",
            "dpc": "03052202301",
            "name": "អាជីវកម្មទឹកបរិសុទ្ធបន្ទាយស្រី"
        },
        {
            "barcode": "BBWS180208530",
            "dpc": "03052202401",
            "name": "សមាគមជនជាតិចិនលាងហួ"
        },
        {
            "barcode": "BBWS180208531",
            "dpc": "03052202501",
            "name": "លឹម ឆាយ ១"
        },
        {
            "barcode": "BBWS180208532",
            "dpc": "03052202601",
            "name": "សាខាគយនិងរដ្ឋាករខេត្ត"
        },
        {
            "barcode": "BBWS180208533",
            "dpc": "03052202701",
            "name": "អង្គការ ឃែ រំចេក៤"
        },
        {
            "barcode": "BBWS180208534",
            "dpc": "03052202801",
            "name": "សណ្ឋាគារ វិមានមាស"
        },
        {
            "barcode": "BBWS180208535",
            "dpc": "03052202901",
            "name": "តែ តៃលី ផ្សារលើ"
        },
        {
            "barcode": "BBWS180208536",
            "dpc": "03052203001",
            "name": "អ៊ុន ម៉េង​ សណ្ឋាគារអាស៊ី"
        },
        {
            "barcode": "BBWS180208537",
            "dpc": "03052203101",
            "name": "ស្ថានអគ្គកុងស៊ុលវៀតណាម"
        },
        {
            "barcode": "BBWS180208538",
            "dpc": "03052203201",
            "name": "ហម ចិត្រ"
        },
        {
            "barcode": "BBWS180208539",
            "dpc": "03052203301",
            "name": "ឃឹម វុទ្ធី"
        },
        {
            "barcode": "BBWS180208540",
            "dpc": "03052203401",
            "name": "សេង វ៉ាឡាត់"
        },
        {
            "barcode": "BBWS180208541",
            "dpc": "03052203501",
            "name": "ប្រព័ន្ធទឹកចូលផ្សារណាត់"
        },
        {
            "barcode": "BBWS180208542",
            "dpc": "03052203601",
            "name": "ស៊ុន សារ៉េត"
        },
        {
            "barcode": "BBWS180208543",
            "dpc": "03052203701",
            "name": "យ៉ាន បូផៃ សាច់អាំង២"
        },
        {
            "barcode": "BBWS180208544",
            "dpc": "03052203801",
            "name": "សុខ សុខុន ពីស៊ីនទឹក"
        },
        {
            "barcode": "BBWS180208545",
            "dpc": "03052203901",
            "name": "សៀ ស៊ិន"
        },
        {
            "barcode": "BBWS180208546",
            "dpc": "03052204001",
            "name": "អាហារដ្ឋានសន្តិភាព"
        },
        {
            "barcode": "BBWS180208547",
            "dpc": "03052204101",
            "name": "ឡេន រ៉ា លក់ពោះគោ២កន្លៈ"
        },
        {
            "barcode": "BBWS180208548",
            "dpc": "03052204201",
            "name": "ងួន ហួត (ថៃលី)"
        },
        {
            "barcode": "BBWS180208549",
            "dpc": "03052204301",
            "name": "ឈុន លីម"
        },
        {
            "barcode": "BBWS180208550",
            "dpc": "03052204401",
            "name": "ជា ថូន ផ្លូវលេខ៣"
        },
        {
            "barcode": "BBWS180208551",
            "dpc": "03052204501",
            "name": "ភោជនីយដ្ឋាន សួនយុវ័ន"
        },
        {
            "barcode": "BBWS180208552",
            "dpc": "03052204601",
            "name": "ទាន់សម័យម៉ាស្សាខារ៉ាអូខេ"
        },
        {
            "barcode": "BBWS180208553",
            "dpc": "03052204701",
            "name": "ទូច   លាងខេង"
        },
        {
            "barcode": "BBWS180208554",
            "dpc": "03052204801",
            "name": "ពៅ គឹមហាន(លក់គុយទាវ)"
        },
        {
            "barcode": "BBWS180208555",
            "dpc": "03052204901",
            "name": "ជឹម  ចំណាន(ឥន្ទ្រីយ៍មាស)"
        },
        {
            "barcode": "BBWS180208556",
            "dpc": "03052205001",
            "name": "អ៊ុយ លីវ(ប្រេងឥន្ទនៈឡាអេ)"
        },
        {
            "barcode": "BBWS180208557",
            "dpc": "03052205101",
            "name": "ហាក់ ឡេង(លក់គុយទាវឡាអេ)"
        },
        {
            "barcode": "BBWS180208558",
            "dpc": "03052205201",
            "name": "អាជីវកម្មសាណាត់២ (សេងហ៊ួ)"
        },
        {
            "barcode": "BBWS180208559",
            "dpc": "03052205301",
            "name": "ផិត ផៃណុង"
        },
        {
            "barcode": "BBWS180208560",
            "dpc": "03052205501",
            "name": "សោម  សាឃឿង"
        },
        {
            "barcode": "BBWS180208561",
            "dpc": "03052205601",
            "name": "សឿ រតនា"
        },
        {
            "barcode": "BBWS180208562",
            "dpc": "03052205701",
            "name": "ស្ថានីយ៏ តូតាល់"
        },
        {
            "barcode": "BBWS180208563",
            "dpc": "03052205801",
            "name": "ឃន ណារិទ្ធ"
        },
        {
            "barcode": "BBWS180208564",
            "dpc": "03052205901",
            "name": "សណ្ឋាគារស្តារ អ៊ុន ផល្លា"
        },
        {
            "barcode": "BBWS180208565",
            "dpc": "03052206001",
            "name": "សណ្ឋាគារ ឃីង"
        },
        {
            "barcode": "BBWS180208566",
            "dpc": "03052206101",
            "name": "ឡេង ហេង(សណ្ឋាគារ)"
        },
        {
            "barcode": "BBWS180208567",
            "dpc": "03052206201",
            "name": "វិច តូរីយ៉ា(សណ្ឋាគារ)"
        },
        {
            "barcode": "BBWS180208568",
            "dpc": "03052206301",
            "name": "ប៊ុន ពៅ រតនៈ(សណ្ឋាគារ)"
        },
        {
            "barcode": "BBWS180208569",
            "dpc": "03052206401",
            "name": "ជុក គឹមហ៊ាប់"
        },
        {
            "barcode": "BBWS180208570",
            "dpc": "03052206601",
            "name": "ហូ លីដេ(ផ្ទះសំណាក់)"
        },
        {
            "barcode": "BBWS180208571",
            "dpc": "03052206701",
            "name": "គុយ ទ្រី"
        },
        {
            "barcode": "BBWS180208572",
            "dpc": "03052206801",
            "name": "សោ ថាលី  កូលាបស"
        },
        {
            "barcode": "BBWS180208573",
            "dpc": "03052206901",
            "name": "ង៉ែត សុគន្ធ   (លក់បាយ )"
        },
        {
            "barcode": "BBWS180208574",
            "dpc": "03052207001",
            "name": "ប៉ោ  វណ្ណះ ១"
        },
        {
            "barcode": "BBWS180208575",
            "dpc": "03052207101",
            "name": "វត្តពោវាល"
        },
        {
            "barcode": "BBWS180208576",
            "dpc": "03052207201",
            "name": "ស៊ុន  ប៊ុនតារា(ផ្សារលើ)"
        },
        {
            "barcode": "BBWS180208577",
            "dpc": "03052207301",
            "name": "ប្រេង តេលា"
        },
        {
            "barcode": "BBWS180208578",
            "dpc": "03052207401",
            "name": "ជា  ពលរិទ្ធ    ខារ៉ាអូឃេ"
        },
        {
            "barcode": "BBWS180208579",
            "dpc": "03052207501",
            "name": "ឃេ អូ  ភោជនីយដ្ឋាន"
        },
        {
            "barcode": "BBWS180208580",
            "dpc": "03052207601",
            "name": "ហួន ហៀង  ភោជនីយដ្ឋានអាស៊ានបៀរ"
        },
        {
            "barcode": "BBWS180208581",
            "dpc": "03052207701",
            "name": "ជឹម  ពៅ"
        },
        {
            "barcode": "BBWS180208582",
            "dpc": "03052207801",
            "name": "សុខ  រ៉ាថន ១"
        },
        {
            "barcode": "BBWS180208583",
            "dpc": "03052207901",
            "name": "ឡុង សុធី  ភោជនីយដ្ឋាន"
        },
        {
            "barcode": "BBWS180208584",
            "dpc": "03052208001",
            "name": "ម៉ៅ ហួរ  បណ្តុះសណ្តែក"
        },
        {
            "barcode": "BBWS180208585",
            "dpc": "03052208101",
            "name": "នូវ សាវុធ មៃមៃ ភោជនីយដ្ឋាន"
        },
        {
            "barcode": "BBWS180208586",
            "dpc": "03052208201",
            "name": "វី  ឆែ"
        },
        {
            "barcode": "BBWS180208587",
            "dpc": "03052208301",
            "name": "ញ៉ែម វណ្ណា  លាង ឡាន"
        },
        {
            "barcode": "BBWS180208588",
            "dpc": "03052208401",
            "name": "ម៉ៅ សេងថៃ   ភរំចេក៤"
        },
        {
            "barcode": "BBWS180208589",
            "dpc": "03052208501",
            "name": "សណ្ឋាគារ បាណន់"
        },
        {
            "barcode": "BBWS180208590",
            "dpc": "03052208601",
            "name": "យូ ចាន់ទី"
        },
        {
            "barcode": "BBWS180208591",
            "dpc": "03052208801",
            "name": "ផ្សារ ក្រណាត់ បឹងឈូក"
        },
        {
            "barcode": "BBWS180208592",
            "dpc": "03052208901",
            "name": "ព្រៈវិហារកាតូលិក ១"
        },
        {
            "barcode": "BBWS180208593",
            "dpc": "03052209001",
            "name": "គីម វែង  លាង ឡាន"
        },
        {
            "barcode": "BBWS180208594",
            "dpc": "03052209101",
            "name": "យ៉ុន តូរ៉ាត់ ឃេអូរ"
        },
        {
            "barcode": "BBWS180208595",
            "dpc": "03052209201",
            "name": "ស៊ីន ឃន   (សាច់គោអាំង )"
        },
        {
            "barcode": "BBWS180208596",
            "dpc": "03052209301",
            "name": "សមាគមគុយទាវ"
        },
        {
            "barcode": "BBWS180208597",
            "dpc": "03052209401",
            "name": "វិញ  សាន់"
        },
        {
            "barcode": "BBWS180208598",
            "dpc": "03052209501",
            "name": "នរោត្តម ចក្រាវុធ"
        },
        {
            "barcode": "BBWS180208599",
            "dpc": "03052209601",
            "name": "ណា ណៃ"
        },
        {
            "barcode": "BBWS180208600",
            "dpc": "03052209801",
            "name": "ឯ.ឧ. ងិន ឃន ៣"
        },
        {
            "barcode": "BBWS180208601",
            "dpc": "03052209901",
            "name": "ជ្រិន ញ៉"
        },
        {
            "barcode": "BBWS180208602",
            "dpc": "03052210001",
            "name": "សកលវិទ្យាល័យ ប្រជាជាតិ"
        },
        {
            "barcode": "BBWS180208603",
            "dpc": "03052210101",
            "name": "អា  មួយ"
        },
        {
            "barcode": "BBWS180208604",
            "dpc": "03052210201",
            "name": "កែវ វ៉ាន់ទី"
        },
        {
            "barcode": "BBWS180208605",
            "dpc": "03052210301",
            "name": "សណ្នាគារ ជយ័ជំនៈ"
        },
        {
            "barcode": "BBWS180208606",
            "dpc": "03052210401",
            "name": "ខៀវ ផុន"
        },
        {
            "barcode": "BBWS180208607",
            "dpc": "03052210601",
            "name": "ថាច់ សង្វាត"
        },
        {
            "barcode": "BBWS180208608",
            "dpc": "03052210701",
            "name": "គឹម សារី"
        },
        {
            "barcode": "BBWS180208609",
            "dpc": "03052210801",
            "name": "ចំណតរថយន្ត"
        },
        {
            "barcode": "BBWS180208610",
            "dpc": "03052210901",
            "name": "ប៊ុន សេង (គ្លីនិកសុខភាព)"
        },
        {
            "barcode": "BBWS180208611",
            "dpc": "03052211001",
            "name": "សុខ  សុខុម"
        },
        {
            "barcode": "BBWS180208612",
            "dpc": "03052211101",
            "name": "ផ្សារលក់ត្រី"
        },
        {
            "barcode": "BBWS180208613",
            "dpc": "03052211201",
            "name": "ជា   សង្វាសេរីវឌ្ឍន៏"
        },
        {
            "barcode": "BBWS180208614",
            "dpc": "03052211301",
            "name": "ព្រៈវិហារកាតូលិក ២"
        },
        {
            "barcode": "BBWS180208615",
            "dpc": "03052211401",
            "name": "អ៊ី ផេង"
        },
        {
            "barcode": "BBWS180208616",
            "dpc": "03052211501",
            "name": "វែង ស៊្រុន"
        },
        {
            "barcode": "BBWS180208617",
            "dpc": "03052211601",
            "name": "អេង ពេញ"
        },
        {
            "barcode": "BBWS180208618",
            "dpc": "03052211701",
            "name": "គង់ យឿម ផ្ទ.  ក.  ភ."
        },
        {
            "barcode": "BBWS180208619",
            "dpc": "03052211901",
            "name": "ប៊ុន សេង ១"
        },
        {
            "barcode": "BBWS180208620",
            "dpc": "03052212001",
            "name": "អង្កការ អេ អ អឹម"
        },
        {
            "barcode": "BBWS180208621",
            "dpc": "03052212101",
            "name": "គិត   រ៉ាវី"
        },
        {
            "barcode": "BBWS180208622",
            "dpc": "03052212201",
            "name": "ហេង យាន (ហាងអ៊ិចហ្គោល )"
        },
        {
            "barcode": "BBWS180208623",
            "dpc": "03052212301",
            "name": "ផ្ទះ.សំណាក់ភ្នំខៀវ"
        },
        {
            "barcode": "BBWS180208624",
            "dpc": "03052212401",
            "name": "សំ  កុល"
        },
        {
            "barcode": "BBWS180208625",
            "dpc": "03052212501",
            "name": "សេង សុម៉ាឡៃ (ខារាអូខេហេបភី )"
        },
        {
            "barcode": "BBWS180208626",
            "dpc": "03052212601",
            "name": "ណង  ណារ័ត្ន"
        },
        {
            "barcode": "BBWS180208627",
            "dpc": "03052212701",
            "name": "លឹម ភិចហួរ"
        },
        {
            "barcode": "BBWS180208628",
            "dpc": "03052212801",
            "name": "លឹម ឆាយ ២"
        },
        {
            "barcode": "BBWS180208629",
            "dpc": "03052212901",
            "name": "លឹម ឆាយ ៣"
        },
        {
            "barcode": "BBWS180208630",
            "dpc": "03052213001",
            "name": "លឹម ឆាយ ៤"
        },
        {
            "barcode": "BBWS180208631",
            "dpc": "03052213101",
            "name": "ជី អែស ធី"
        },
        {
            "barcode": "BBWS180208632",
            "dpc": "03052213201",
            "name": "ហួន សាយ"
        },
        {
            "barcode": "BBWS180208633",
            "dpc": "03052213301",
            "name": "ក្រុម ជុំនុំ ប៊ី អែស ធី"
        },
        {
            "barcode": "BBWS180208634",
            "dpc": "03052213401",
            "name": "អេង សុខនេត"
        },
        {
            "barcode": "BBWS180208635",
            "dpc": "03052213501",
            "name": "រស់ សារ៉ន"
        },
        {
            "barcode": "BBWS180208636",
            "dpc": "03052213601",
            "name": "លឹម  ឈួងសៀ"
        },
        {
            "barcode": "BBWS180208637",
            "dpc": "03052213701",
            "name": "យ៉ា សារឿន"
        },
        {
            "barcode": "BBWS180208638",
            "dpc": "03052213801",
            "name": "រស់ ពិសិដ្ឋ"
        },
        {
            "barcode": "BBWS180208639",
            "dpc": "03052213901",
            "name": "វែង ស៊្រុន ២"
        },
        {
            "barcode": "BBWS180208640",
            "dpc": "03052214001",
            "name": "រិន វិសាល ១"
        },
        {
            "barcode": "BBWS180208641",
            "dpc": "03052214101",
            "name": "ស៊ិន ហួរ"
        },
        {
            "barcode": "BBWS180208642",
            "dpc": "03052214201",
            "name": "ហែម សុធា"
        },
        {
            "barcode": "BBWS180208643",
            "dpc": "03052214301",
            "name": "សាលារៀន យូ.អ៊ឹម.អ៊ី"
        },
        {
            "barcode": "BBWS180208644",
            "dpc": "03052214401",
            "name": "គឹម សុខ"
        },
        {
            "barcode": "BBWS180208645",
            "dpc": "03052214501",
            "name": "ការ៉ាស់សាំង តេលា (អន្លង់វិល )"
        },
        {
            "barcode": "BBWS180208646",
            "dpc": "03052214601",
            "name": "កុមារឥតព្រំដែន"
        },
        {
            "barcode": "BBWS180208647",
            "dpc": "03052214701",
            "name": "ហុង ឆាយ"
        },
        {
            "barcode": "BBWS180208648",
            "dpc": "03052214801",
            "name": "ហៃ ភួង"
        },
        {
            "barcode": "BBWS180208649",
            "dpc": "03052214901",
            "name": "អ៊ារ ថៃភួង"
        },
        {
            "barcode": "BBWS180208650",
            "dpc": "03052215001",
            "name": "វិទ្យាល័យបៀលប្រាយ ១"
        },
        {
            "barcode": "BBWS180208651",
            "dpc": "03052215101",
            "name": "កូវ ជីងប៊ុង"
        },
        {
            "barcode": "BBWS180208652",
            "dpc": "03052215201",
            "name": "សួន ឆៀត (ស្ទួន២៣ )"
        },
        {
            "barcode": "BBWS180208653",
            "dpc": "03052215301",
            "name": "ធា   លឹម"
        },
        {
            "barcode": "BBWS180208654",
            "dpc": "03052215401",
            "name": "សត្តឃាត"
        },
        {
            "barcode": "BBWS180208655",
            "dpc": "03052215501",
            "name": "សំ   គីម ២"
        },
        {
            "barcode": "BBWS180208656",
            "dpc": "03052215601",
            "name": "ព្រឿន  សឿត"
        },
        {
            "barcode": "BBWS180208657",
            "dpc": "03052215701",
            "name": "អ៊ុត   មួយ ១"
        },
        {
            "barcode": "BBWS180208658",
            "dpc": "03052215801",
            "name": "អ៊ុត   មួយ ២"
        },
        {
            "barcode": "BBWS180208659",
            "dpc": "03052215901",
            "name": "ថាំ   ស៊ុនថូ"
        },
        {
            "barcode": "BBWS180208660",
            "dpc": "03052216001",
            "name": "វែង   សុផល"
        },
        {
            "barcode": "BBWS180208661",
            "dpc": "03052216101",
            "name": "ប៉ា   សុជាតិវង្ស"
        },
        {
            "barcode": "BBWS180208662",
            "dpc": "03052216301",
            "name": "ចាន់   សម្ជស្ស"
        },
        {
            "barcode": "BBWS180208663",
            "dpc": "03052216401",
            "name": "តាំង  ជុងខេង"
        },
        {
            "barcode": "BBWS180208664",
            "dpc": "03052216501",
            "name": "ឡូ   សុផល"
        },
        {
            "barcode": "BBWS180208665",
            "dpc": "03052216601",
            "name": "សាប៊ូ  អូហ្សាណូ"
        },
        {
            "barcode": "BBWS180208666",
            "dpc": "03052216701",
            "name": "នក់   ម៉ង់"
        },
        {
            "barcode": "BBWS180208667",
            "dpc": "03052216801",
            "name": "សយ បូរ៉ា"
        },
        {
            "barcode": "BBWS180208668",
            "dpc": "03052216901",
            "name": "ហ៊ុយុ ហេង"
        },
        {
            "barcode": "BBWS180208669",
            "dpc": "03052217101",
            "name": "ហុង  សារិន"
        },
        {
            "barcode": "BBWS180208670",
            "dpc": "03052217201",
            "name": "ឌុក អៀក"
        },
        {
            "barcode": "BBWS180208671",
            "dpc": "03052217401",
            "name": "សេរី ចរិយា ១"
        },
        {
            "barcode": "BBWS180208672",
            "dpc": "03052217501",
            "name": "សេរី ចរិយា ២"
        },
        {
            "barcode": "BBWS180208673",
            "dpc": "03052217601",
            "name": "ណៃ គឹមសុន ២"
        },
        {
            "barcode": "BBWS180208674",
            "dpc": "03052217701",
            "name": "សេង សុទ្ធី"
        },
        {
            "barcode": "BBWS180208675",
            "dpc": "03052217801",
            "name": "មាស សុភាព"
        },
        {
            "barcode": "BBWS180208676",
            "dpc": "03052217901",
            "name": "ប៊ន សោ ភ័ណ"
        },
        {
            "barcode": "BBWS180208677",
            "dpc": "03052218101",
            "name": "វិទ្យាល័យបៀលប្រាយ ២"
        },
        {
            "barcode": "BBWS180208678",
            "dpc": "03052218201",
            "name": "ងិន ឃន ១"
        },
        {
            "barcode": "BBWS180208679",
            "dpc": "03052218301",
            "name": "ងិន ឃន ៤"
        },
        {
            "barcode": "BBWS180208680",
            "dpc": "03052218401",
            "name": "ងិន ឃន ៥"
        },
        {
            "barcode": "BBWS180208681",
            "dpc": "03052218501",
            "name": "ងិន ឃន ៦"
        },
        {
            "barcode": "BBWS180208682",
            "dpc": "03052218601",
            "name": "យ៉ម   ចំរើន ៤"
        },
        {
            "barcode": "BBWS180208683",
            "dpc": "03052218701",
            "name": "សណ្ឋាគារស្ទឹងសង្កែ"
        },
        {
            "barcode": "BBWS180208684",
            "dpc": "03052218801",
            "name": "ហេង លាប"
        },
        {
            "barcode": "BBWS180208685",
            "dpc": "03052218901",
            "name": "វ៉ាន់  ហម"
        },
        {
            "barcode": "BBWS180208686",
            "dpc": "03052219001",
            "name": "រស់ យាន"
        },
        {
            "barcode": "BBWS180208687",
            "dpc": "03052219101",
            "name": "ភោជនីយដ្ឋាន វិមានរៀម"
        },
        {
            "barcode": "BBWS180208688",
            "dpc": "03052219301",
            "name": "សួន  រើន"
        },
        {
            "barcode": "BBWS180208689",
            "dpc": "03052219401",
            "name": "លឹម  ទៀហេង"
        },
        {
            "barcode": "BBWS180208690",
            "dpc": "03052219501",
            "name": "បេង  ភី ១"
        },
        {
            "barcode": "BBWS180208691",
            "dpc": "03052219601",
            "name": "កាកបាទក្រហម"
        },
        {
            "barcode": "BBWS180208692",
            "dpc": "03052219701",
            "name": "ប៊ុន  សេង ២"
        },
        {
            "barcode": "BBWS180208693",
            "dpc": "03052219801",
            "name": "តូ  មិត"
        },
        {
            "barcode": "BBWS180208694",
            "dpc": "03052219901",
            "name": "ហេង តុលា"
        },
        {
            "barcode": "BBWS180208695",
            "dpc": "03052220101",
            "name": "តូតាល់អន្លងវិល"
        },
        {
            "barcode": "BBWS180208696",
            "dpc": "03052220201",
            "name": "សាឌុន  សារិទ្ធ"
        },
        {
            "barcode": "BBWS180208697",
            "dpc": "03052220301",
            "name": "ជាម ចាន់សោភ័ណ"
        },
        {
            "barcode": "BBWS180208698",
            "dpc": "03052220401",
            "name": "ម៉ៅ  អេង"
        },
        {
            "barcode": "BBWS180208699",
            "dpc": "03052220501",
            "name": "ឡុង  សុធី ២"
        },
        {
            "barcode": "BBWS180208700",
            "dpc": "03052220601",
            "name": "ហត្ថ  ធី"
        },
        {
            "barcode": "BBWS180208701",
            "dpc": "03052220701",
            "name": "យិន  គិតឡេង"
        },
        {
            "barcode": "BBWS180208702",
            "dpc": "03052220901",
            "name": "អ៊ឹង  គឹមលី"
        },
        {
            "barcode": "BBWS180208703",
            "dpc": "03052221001",
            "name": "មាស ចាន់ធឿន"
        },
        {
            "barcode": "BBWS180208704",
            "dpc": "03052221101",
            "name": "រី  រឿន"
        },
        {
            "barcode": "BBWS180208705",
            "dpc": "03052221201",
            "name": "ណាំ  ទុំ (រ៉ាក់ )"
        },
        {
            "barcode": "BBWS180208706",
            "dpc": "03052221301",
            "name": "ហួយ ចន្ធី"
        },
        {
            "barcode": "BBWS180208707",
            "dpc": "03052221401",
            "name": "រាជ  សុវណ្ណារិទ្ធ (ហូលីដេ ២ )"
        },
        {
            "barcode": "BBWS180208708",
            "dpc": "03052221501",
            "name": "អ៊ឹង  គីរីរ័ត្ន"
        },
        {
            "barcode": "BBWS180208709",
            "dpc": "03052221601",
            "name": "ប៉ាត់  ផលបុត្រ"
        },
        {
            "barcode": "BBWS180208710",
            "dpc": "03052221701",
            "name": "ប៊ុន  សុវណ្ណ"
        },
        {
            "barcode": "BBWS180208711",
            "dpc": "03052221801",
            "name": "យន់  ណូរ៉ាត"
        },
        {
            "barcode": "BBWS180208712",
            "dpc": "03052221901",
            "name": "ង៉ូវ  វែងហុក"
        },
        {
            "barcode": "BBWS180208713",
            "dpc": "03052222001",
            "name": "ខេមរាបាត់ដំបង ១"
        },
        {
            "barcode": "BBWS180208714",
            "dpc": "03052222101",
            "name": "ខេមរាបាត់ដំបង ២"
        },
        {
            "barcode": "BBWS180208715",
            "dpc": "03052222201",
            "name": "រាត្រីស្ទឹងសង្គែ"
        },
        {
            "barcode": "BBWS180208716",
            "dpc": "03052222401",
            "name": "ប៉ោ  វណ្ណះ"
        },
        {
            "barcode": "BBWS180208717",
            "dpc": "03052222501",
            "name": "ចាន់  ធី"
        },
        {
            "barcode": "BBWS180208718",
            "dpc": "03052222601",
            "name": "សុខ  រ៉ាថន (ការ៉ាស់សាំង សូគីម៉ិច  )"
        },
        {
            "barcode": "BBWS180208719",
            "dpc": "03052222701",
            "name": "ឈឹម  ស៊ួ"
        },
        {
            "barcode": "BBWS180208720",
            "dpc": "03052222801",
            "name": "មឹក  ហេង"
        },
        {
            "barcode": "BBWS180208721",
            "dpc": "03052222901",
            "name": "តាំង  ឈុន (ប៉ូលីស )"
        },
        {
            "barcode": "BBWS180208722",
            "dpc": "03052223001",
            "name": "សុខ  ឡាវ"
        },
        {
            "barcode": "BBWS180208723",
            "dpc": "03052223101",
            "name": "លឹម  សេងហ៊ួរ"
        },
        {
            "barcode": "BBWS180208724",
            "dpc": "03052223301",
            "name": "ជា  អេង ២"
        },
        {
            "barcode": "BBWS180208725",
            "dpc": "03052223401",
            "name": "ហោ  តុងហាប់"
        },
        {
            "barcode": "BBWS180208726",
            "dpc": "03052223501",
            "name": "បេង  ភី"
        },
        {
            "barcode": "BBWS180208727",
            "dpc": "03052223601",
            "name": "បេ  សារឿន"
        },
        {
            "barcode": "BBWS180208728",
            "dpc": "03052223801",
            "name": "ហម  សាម៉ុន"
        },
        {
            "barcode": "BBWS180208729",
            "dpc": "03052223901",
            "name": "បង្គន់អនាម័យសាធាណះ"
        },
        {
            "barcode": "BBWS180208730",
            "dpc": "03052224001",
            "name": "តុក  សុងសួ"
        },
        {
            "barcode": "BBWS180208731",
            "dpc": "03052224101",
            "name": "សិប្បកម្មលូ"
        },
        {
            "barcode": "BBWS180208732",
            "dpc": "03052224201",
            "name": "បួន  សៀ"
        },
        {
            "barcode": "BBWS180208733",
            "dpc": "03052224301",
            "name": "ដៃដែក"
        },
        {
            "barcode": "BBWS180208734",
            "dpc": "03052224401",
            "name": "ស  ឌឿ"
        },
        {
            "barcode": "BBWS180208735",
            "dpc": "03052224501",
            "name": "អ៊ុំ  ចំរើន"
        },
        {
            "barcode": "BBWS180208736",
            "dpc": "03052224601",
            "name": "ហ៊ូ  រតនា"
        },
        {
            "barcode": "BBWS180208737",
            "dpc": "03052224701",
            "name": "ឌុក  ឆវេត"
        },
        {
            "barcode": "BBWS180208738",
            "dpc": "03052224801",
            "name": "អ៊ុំ  អេង"
        },
        {
            "barcode": "BBWS180208739",
            "dpc": "03052224901",
            "name": "សាលា អ៊ី.ស៊ី.ស៊ី"
        },
        {
            "barcode": "BBWS180208740",
            "dpc": "03052225001",
            "name": "ហួន  ហេង"
        },
        {
            "barcode": "BBWS180208741",
            "dpc": "03052225101",
            "name": "ស៊ុន លីនណា"
        },
        {
            "barcode": "BBWS180208742",
            "dpc": "03052225201",
            "name": "នៅ  យូរឡុង (វត្តសូភី )"
        },
        {
            "barcode": "BBWS180208743",
            "dpc": "03052225301",
            "name": "វត្តពោធិក្នុង"
        },
        {
            "barcode": "BBWS180208744",
            "dpc": "03052225401",
            "name": "កុង  យក់"
        },
        {
            "barcode": "BBWS180208745",
            "dpc": "03052225501",
            "name": "តាំង  ឡាយ"
        },
        {
            "barcode": "BBWS180208746",
            "dpc": "03052225601",
            "name": "ឈិត  សុក"
        },
        {
            "barcode": "BBWS180208747",
            "dpc": "03052225701",
            "name": "អែម  សុផល"
        },
        {
            "barcode": "BBWS180208748",
            "dpc": "03052225801",
            "name": "សន  និល"
        },
        {
            "barcode": "BBWS180208749",
            "dpc": "03052225901",
            "name": "គឹម  មុន្នី"
        },
        {
            "barcode": "BBWS180208750",
            "dpc": "03052226001",
            "name": "អ៊ុក  ស៊ីណយ"
        },
        {
            "barcode": "BBWS180208751",
            "dpc": "03052226101",
            "name": "ប្រាក់  ព្រី"
        },
        {
            "barcode": "BBWS180208752",
            "dpc": "03052226201",
            "name": "ងួន  ពន្លក"
        },
        {
            "barcode": "BBWS180208753",
            "dpc": "03052226301",
            "name": "សេង  ប៊ូ"
        },
        {
            "barcode": "BBWS180208754",
            "dpc": "03052226501",
            "name": "ផ្សារថ្មី"
        },
        {
            "barcode": "BBWS180208755",
            "dpc": "03052226601",
            "name": "តាំង  ម៉េងគង់"
        },
        {
            "barcode": "BBWS180208756",
            "dpc": "03052226701",
            "name": "វត្តផ្សារថ្មី"
        },
        {
            "barcode": "BBWS180208757",
            "dpc": "03052226801",
            "name": "ចេង  អឿន"
        },
        {
            "barcode": "BBWS180208758",
            "dpc": "03052226901",
            "name": "ក្រុមហ៊ុន អិលឌីអែស"
        },
        {
            "barcode": "BBWS180208759",
            "dpc": "03052227001",
            "name": "តុប  ថូលីណា ១"
        },
        {
            "barcode": "BBWS180208760",
            "dpc": "03052227101",
            "name": "តុប  ថូលីណា ២"
        },
        {
            "barcode": "BBWS180208761",
            "dpc": "03052227201",
            "name": "ឡាំ  ឆៃលីន"
        },
        {
            "barcode": "BBWS180208762",
            "dpc": "03052227301",
            "name": "វ៉ាន់  ណារ៉េត"
        },
        {
            "barcode": "BBWS180208763",
            "dpc": "03052227401",
            "name": "នៅ  សិទ្ធិគុណ"
        },
        {
            "barcode": "BBWS180208764",
            "dpc": "03052227501",
            "name": "សួន  វណ្ណនេត"
        },
        {
            "barcode": "BBWS180208765",
            "dpc": "03052227601",
            "name": "សៀ   ស៊ិន ១"
        },
        {
            "barcode": "BBWS180208766",
            "dpc": "03052227701",
            "name": "គាន  ថៃ ១"
        },
        {
            "barcode": "BBWS180208767",
            "dpc": "03052227801",
            "name": "ឃុន  ងួនហុង"
        },
        {
            "barcode": "BBWS180208768",
            "dpc": "03052227901",
            "name": "វិទ្យាល័យបៀលប្រាយ ៣"
        },
        {
            "barcode": "BBWS180208769",
            "dpc": "03052228001",
            "name": "សន  សុភ័ក្រ"
        },
        {
            "barcode": "BBWS180208770",
            "dpc": "03052228101",
            "name": "ឡុង  ចន្ថា"
        },
        {
            "barcode": "BBWS180208771",
            "dpc": "03052228201",
            "name": "ម៉ម  បណ្ឌិត"
        },
        {
            "barcode": "BBWS180208772",
            "dpc": "03052228301",
            "name": "គង់  ធី"
        },
        {
            "barcode": "BBWS180208773",
            "dpc": "03052228501",
            "name": "លក  វណ្ណ"
        },
        {
            "barcode": "BBWS180208774",
            "dpc": "03052228601",
            "name": "វ៉ាត់   ស៊ីម"
        },
        {
            "barcode": "BBWS180208775",
            "dpc": "03052228701",
            "name": "ហ៊ាង  រ៉ាវុធ"
        },
        {
            "barcode": "BBWS180208776",
            "dpc": "03052228801",
            "name": "ទៀប  រី ២"
        },
        {
            "barcode": "BBWS180208777",
            "dpc": "03052228901",
            "name": "លឹម  ហូ"
        },
        {
            "barcode": "BBWS180208778",
            "dpc": "03052229001",
            "name": "ខឹម  សាឃឿន"
        },
        {
            "barcode": "BBWS180208779",
            "dpc": "03052229201",
            "name": "សឹង  លី"
        },
        {
            "barcode": "BBWS180208780",
            "dpc": "03052229301",
            "name": "ឯម  សុវណ្ណារ៉ា"
        },
        {
            "barcode": "BBWS180208781",
            "dpc": "03052229401",
            "name": "ទឹម  វណ្ណា"
        },
        {
            "barcode": "BBWS180208782",
            "dpc": "03052229501",
            "name": "ផុន  ផាវុធ"
        },
        {
            "barcode": "BBWS180208783",
            "dpc": "03052229601",
            "name": "ឈុំ  ចាន់"
        },
        {
            "barcode": "BBWS180208784",
            "dpc": "03052229701",
            "name": "វត្តកណ្តាល"
        },
        {
            "barcode": "BBWS180208785",
            "dpc": "03052229801",
            "name": "ឌិត  ជិន"
        },
        {
            "barcode": "BBWS180208786",
            "dpc": "03052229901",
            "name": "ជួប  យ៉ុម"
        },
        {
            "barcode": "BBWS180208787",
            "dpc": "03052210501",
            "name": "នូ ណូរ៉ា"
        }
    ]

    /*
    [
        {
            "barcode": "171144067",
            "dpc": "03052200301",
            "name": "សណ្ឋាគារប៉ារីស"
        },
        {
            "barcode": "171144068",
            "dpc": "03052200401",
            "name": "សណ្ឋាគាររ៉ូយ៉ាល់"
        },
        {
            "barcode": "171144069",
            "dpc": "03052200501",
            "name": "សណ្ឋាគាររ៉ូយ៉ាល់"
        },
        {
            "barcode": "171144070",
            "dpc": "03052200701",
            "name": "សណ្ឋាគារអន្តរជាតិ"
        },
        {
            "barcode": "171144071",
            "dpc": "03052200801",
            "name": "សណ្ឋាគារតេអូ"
        },
        {
            "barcode": "171144072",
            "dpc": "03052200901",
            "name": "សណ្ឋាគារតេអូ"
        },
        {
            "barcode": "171144073",
            "dpc": "03052201001",
            "name": "គ្លីនិកបាត់ដំបង"
        },
        {
            "barcode": "171144074",
            "dpc": "03052201101",
            "name": "ផ្ទះ.សំណាក់មនោរម្យ"
        },
        {
            "barcode": "171144075",
            "dpc": "03052201201",
            "name": "ភោជនីយដ្ឋានសប្បាយណាស់"
        },
        {
            "barcode": "171144076",
            "dpc": "03052201301",
            "name": "សួន សារុន ត្បូងវត្តសង្កែ"
        },
        {
            "barcode": "171144077",
            "dpc": "03052201501",
            "name": "ប៊ុត គឹមស៊ាន"
        },
        {
            "barcode": "171144078",
            "dpc": "03052201601",
            "name": "យ៉ម ចំរើន ១"
        },
        {
            "barcode": "171144079",
            "dpc": "03052201701",
            "name": "វែង  ស៊្រុន ៣"
        },
        {
            "barcode": "171144080",
            "dpc": "03052201801",
            "name": "សុខ សុខុន  ពន្ឋនាគារ"
        },
        {
            "barcode": "171144081",
            "dpc": "03052201901",
            "name": "រោងចក្រអគ្គិសនី(ក្រោមសាតូដូ)"
        },
        {
            "barcode": "171144082",
            "dpc": "03052202001",
            "name": "រោងចក្រអគ្គិសនី ២"
        },
        {
            "barcode": "171144083",
            "dpc": "03052202101",
            "name": "មណ្ឌលកុមារកំព្រា SOS"
        },
        {
            "barcode": "171144084",
            "dpc": "03052202201",
            "name": "យ៉ម ចំរើន ១"
        },
        {
            "barcode": "171144085",
            "dpc": "03052202301",
            "name": "អាជីវកម្មទឹកបរិសុទ្ធបន្ទាយស្រី"
        },
        {
            "barcode": "171144086",
            "dpc": "03052202401",
            "name": "សមាគមជនជាតិចិនលាងហួ"
        },
        {
            "barcode": "171144087",
            "dpc": "03052202501",
            "name": "លឹម ឆាយ ១"
        },
        {
            "barcode": "171144088",
            "dpc": "03052202601",
            "name": "សាខាគយនិងរដ្ឋាករខេត្ត"
        },
        {
            "barcode": "171144089",
            "dpc": "03052202701",
            "name": "អង្គការ ឃែ រំចេក៤"
        },
        {
            "barcode": "171144090",
            "dpc": "03052202801",
            "name": "សណ្ឋាគារ វិមានមាស"
        },
        {
            "barcode": "171144091",
            "dpc": "03052202901",
            "name": "តែ តៃលី ផ្សារលើ"
        },
        {
            "barcode": "171144092",
            "dpc": "03052203001",
            "name": "អ៊ុន ម៉េង​ សណ្ឋាគារអាស៊ី"
        },
        {
            "barcode": "171144093",
            "dpc": "03052203101",
            "name": "ស្ថានអគ្គកុងស៊ុលវៀតណាម"
        },
        {
            "barcode": "171144094",
            "dpc": "03052203201",
            "name": "ហម ចិត្រ"
        },
        {
            "barcode": "171144095",
            "dpc": "03052203301",
            "name": "ឃឹម វុទ្ធី"
        },
        {
            "barcode": "171144096",
            "dpc": "03052203401",
            "name": "សេង វ៉ាឡាត់"
        },
        {
            "barcode": "171144097",
            "dpc": "03052203501",
            "name": "ប្រព័ន្ធទឹកចូលផ្សារណាត់"
        },
        {
            "barcode": "171144098",
            "dpc": "03052203601",
            "name": "ស៊ុន សារ៉េត"
        },
        {
            "barcode": "171144099",
            "dpc": "03052203701",
            "name": "យ៉ាន បូផៃ សាច់អាំង២"
        },
        {
            "barcode": "171144100",
            "dpc": "03052203801",
            "name": "សុខ សុខុន ពីស៊ីនទឹក"
        },
        {
            "barcode": "171144101",
            "dpc": "03052203901",
            "name": "សៀ ស៊ិន"
        },
        {
            "barcode": "171144102",
            "dpc": "03052204001",
            "name": "អាហារដ្ឋានសន្តិភាព"
        },
        {
            "barcode": "171144103",
            "dpc": "03052204101",
            "name": "ឡេន រ៉ា លក់ពោះគោ២កន្លៈ"
        },
        {
            "barcode": "171144104",
            "dpc": "03052204201",
            "name": "ងួន ហួត (ថៃលី)"
        },
        {
            "barcode": "171144105",
            "dpc": "03052204301",
            "name": "ឈុន លីម"
        },
        {
            "barcode": "171144106",
            "dpc": "03052204401",
            "name": "ជា ថូន ផ្លូវលេខ៣"
        },
        {
            "barcode": "171144107",
            "dpc": "03052204501",
            "name": "ភោជនីយដ្ឋាន សួនយុវ័ន"
        },
        {
            "barcode": "171144108",
            "dpc": "03052204601",
            "name": "ទាន់សម័យម៉ាស្សាខារ៉ាអូខេ"
        },
        {
            "barcode": "171144109",
            "dpc": "03052204701",
            "name": "ទូច   លាងខេង"
        },
        {
            "barcode": "171144110",
            "dpc": "03052204801",
            "name": "ពៅ គឹមហាន(លក់គុយទាវ)"
        },
        {
            "barcode": "171144111",
            "dpc": "03052204901",
            "name": "ជឹម  ចំណាន(ឥន្ទ្រីយ៍មាស)"
        },
        {
            "barcode": "171144112",
            "dpc": "03052205001",
            "name": "អ៊ុយ លីវ(ប្រេងឥន្ទនៈឡាអេ)"
        },
        {
            "barcode": "171144113",
            "dpc": "03052205101",
            "name": "ហាក់ ឡេង(លក់គុយទាវឡាអេ)"
        },
        {
            "barcode": "171144114",
            "dpc": "03052205201",
            "name": "អាជីវកម្មសាណាត់២ (សេងហ៊ួ)"
        },
        {
            "barcode": "171144115",
            "dpc": "03052205301",
            "name": "ផិត ផៃណុង"
        },
        {
            "barcode": "171144116",
            "dpc": "03052205501",
            "name": "សោម  សាឃឿង"
        },
        {
            "barcode": "171144117",
            "dpc": "03052205601",
            "name": "សឿ រតនា"
        },
        {
            "barcode": "171144118",
            "dpc": "03052205701",
            "name": "ស្ថានីយ៏ តូតាល់"
        },
        {
            "barcode": "171144119",
            "dpc": "03052205801",
            "name": "ឃន ណារិទ្ធ"
        },
        {
            "barcode": "171144120",
            "dpc": "03052205901",
            "name": "សណ្ឋាគារស្តារ អ៊ុន ផល្លា"
        },
        {
            "barcode": "171144121",
            "dpc": "03052206001",
            "name": "សណ្ឋាគារ ឃីង"
        },
        {
            "barcode": "171144122",
            "dpc": "03052206101",
            "name": "ឡេង ហេង(សណ្ឋាគារ)"
        },
        {
            "barcode": "171144123",
            "dpc": "03052206201",
            "name": "វិច តូរីយ៉ា(សណ្ឋាគារ)"
        },
        {
            "barcode": "171144124",
            "dpc": "03052206301",
            "name": "ប៊ុន ពៅ រតនៈ(សណ្ឋាគារ)"
        },
        {
            "barcode": "171144125",
            "dpc": "03052206401",
            "name": "ជុក គឹមហ៊ាប់"
        },
        {
            "barcode": "171144126",
            "dpc": "03052206601",
            "name": "ហូ លីដេ(ផ្ទះសំណាក់)"
        },
        {
            "barcode": "171144127",
            "dpc": "03052206701",
            "name": "គុយ ទ្រី"
        },
        {
            "barcode": "171144128",
            "dpc": "03052206801",
            "name": "សោ ថាលី  កូលាបស"
        },
        {
            "barcode": "171144129",
            "dpc": "03052206901",
            "name": "ង៉ែត សុគន្ធ   (លក់បាយ )"
        },
        {
            "barcode": "171144130",
            "dpc": "03052207001",
            "name": "ប៉ោ  វណ្ណះ ១"
        },
        {
            "barcode": "171144131",
            "dpc": "03052207101",
            "name": "វត្តពោវាល"
        },
        {
            "barcode": "171144132",
            "dpc": "03052207201",
            "name": "ស៊ុន  ប៊ុនតារា(ផ្សារលើ)"
        },
        {
            "barcode": "171144133",
            "dpc": "03052207301",
            "name": "ប្រេង តេលា"
        },
        {
            "barcode": "171144134",
            "dpc": "03052207401",
            "name": "ជា  ពលរិទ្ធ    ខារ៉ាអូឃេ"
        },
        {
            "barcode": "171144135",
            "dpc": "03052207501",
            "name": "ឃេ អូ  ភោជនីយដ្ឋាន"
        },
        {
            "barcode": "171144136",
            "dpc": "03052207601",
            "name": "ហួន ហៀង  ភោជនីយដ្ឋានអាស៊ានបៀរ"
        },
        {
            "barcode": "171144137",
            "dpc": "03052207701",
            "name": "ជឹម  ពៅ"
        },
        {
            "barcode": "171144138",
            "dpc": "03052207801",
            "name": "សុខ  រ៉ាថន ១"
        },
        {
            "barcode": "171144139",
            "dpc": "03052207901",
            "name": "ឡុង សុធី  ភោជនីយដ្ឋាន"
        },
        {
            "barcode": "171144140",
            "dpc": "03052208001",
            "name": "ម៉ៅ ហួរ  បណ្តុះសណ្តែក"
        },
        {
            "barcode": "171144141",
            "dpc": "03052208101",
            "name": "នូវ សាវុធ មៃមៃ ភោជនីយដ្ឋាន"
        },
        {
            "barcode": "171144142",
            "dpc": "03052208201",
            "name": "វី  ឆែ"
        },
        {
            "barcode": "171144143",
            "dpc": "03052208301",
            "name": "ញ៉ែម វណ្ណា  លាង ឡាន"
        },
        {
            "barcode": "171144144",
            "dpc": "03052208401",
            "name": "ម៉ៅ សេងថៃ   ភរំចេក៤"
        },
        {
            "barcode": "171144145",
            "dpc": "03052208501",
            "name": "សណ្ឋាគារ បាណន់"
        },
        {
            "barcode": "171144146",
            "dpc": "03052208601",
            "name": "យូ ចាន់ទី"
        },
        {
            "barcode": "171144147",
            "dpc": "03052208801",
            "name": "ផ្សារ ក្រណាត់ បឹងឈូក"
        },
        {
            "barcode": "171144148",
            "dpc": "03052208901",
            "name": "ព្រៈវិហារកាតូលិក ១"
        },
        {
            "barcode": "171144149",
            "dpc": "03052209001",
            "name": "គីម វែង  លាង ឡាន"
        },
        {
            "barcode": "171144150",
            "dpc": "03052209101",
            "name": "យ៉ុន តូរ៉ាត់ ឃេអូរ"
        },
        {
            "barcode": "171144151",
            "dpc": "03052209201",
            "name": "ស៊ីន ឃន   (សាច់គោអាំង )"
        },
        {
            "barcode": "171144152",
            "dpc": "03052209301",
            "name": "សមាគមគុយទាវ"
        },
        {
            "barcode": "171144153",
            "dpc": "03052209401",
            "name": "វិញ  សាន់"
        },
        {
            "barcode": "171144154",
            "dpc": "03052209501",
            "name": "នរោត្តម ចក្រាវុធ"
        },
        {
            "barcode": "171144155",
            "dpc": "03052209601",
            "name": "ណា ណៃ"
        },
        {
            "barcode": "171144156",
            "dpc": "03052209801",
            "name": "ឯ.ឧ. ងិន ឃន ៣"
        },
        {
            "barcode": "171144157",
            "dpc": "03052209901",
            "name": "ជ្រិន ញ៉"
        },
        {
            "barcode": "171144158",
            "dpc": "03052210001",
            "name": "សកលវិទ្យាល័យ ប្រជាជាតិ"
        },
        {
            "barcode": "171144159",
            "dpc": "03052210101",
            "name": "អា  មួយ"
        },
        {
            "barcode": "171144160",
            "dpc": "03052210201",
            "name": "កែវ វ៉ាន់ទី"
        },
        {
            "barcode": "171144161",
            "dpc": "03052210301",
            "name": "សណ្នាគារ ជយ័ជំនៈ"
        },
        {
            "barcode": "171144162",
            "dpc": "03052210401",
            "name": "ខៀវ ផុន"
        },
        {
            "barcode": "171144163",
            "dpc": "03052210501",
            "name": "នូ ណូរ៉ា"
        },
        {
            "barcode": "171144164",
            "dpc": "03052210601",
            "name": "ថាច់ សង្វាត"
        },
        {
            "barcode": "171144165",
            "dpc": "03052210701",
            "name": "គឹម សារី"
        },
        {
            "barcode": "171144166",
            "dpc": "03052210801",
            "name": "ចំណតរថយន្ត"
        },
        {
            "barcode": "171144167",
            "dpc": "03052210901",
            "name": "ប៊ុន សេង (គ្លីនិកសុខភាព)"
        },
        {
            "barcode": "171144168",
            "dpc": "03052211001",
            "name": "សុខ  សុខុម"
        },
        {
            "barcode": "171144169",
            "dpc": "03052211101",
            "name": "ផ្សារលក់ត្រី"
        },
        {
            "barcode": "171144170",
            "dpc": "03052211201",
            "name": "ជា   សង្វាសេរីវឌ្ឍន៏"
        },
        {
            "barcode": "171144171",
            "dpc": "03052211301",
            "name": "ព្រៈវិហារកាតូលិក ២"
        },
        {
            "barcode": "171144172",
            "dpc": "03052211401",
            "name": "អ៊ី ផេង"
        },
        {
            "barcode": "171144173",
            "dpc": "03052211501",
            "name": "វែង ស៊្រុន"
        },
        {
            "barcode": "171144174",
            "dpc": "03052211601",
            "name": "អេង ពេញ"
        },
        {
            "barcode": "171144175",
            "dpc": "03052211701",
            "name": "គង់ យឿម ផ្ទ.  ក.  ភ."
        },
        {
            "barcode": "171144176",
            "dpc": "03052211901",
            "name": "ប៊ុន សេង ១"
        },
        {
            "barcode": "171144177",
            "dpc": "03052212001",
            "name": "អង្កការ អេ អ អឹម"
        },
        {
            "barcode": "171144178",
            "dpc": "03052212101",
            "name": "គិត   រ៉ាវី"
        },
        {
            "barcode": "171144179",
            "dpc": "03052212201",
            "name": "ហេង យាន (ហាងអ៊ិចហ្គោល )"
        },
        {
            "barcode": "171144180",
            "dpc": "03052212301",
            "name": "ផ្ទះ.សំណាក់ភ្នំខៀវ"
        },
        {
            "barcode": "171144181",
            "dpc": "03052212401",
            "name": "សំ  កុល"
        },
        {
            "barcode": "171144182",
            "dpc": "03052212501",
            "name": "សេង សុម៉ាឡៃ (ខារាអូខេហេបភី )"
        },
        {
            "barcode": "171144183",
            "dpc": "03052212601",
            "name": "ណង  ណារ័ត្ន"
        },
        {
            "barcode": "171144184",
            "dpc": "03052212701",
            "name": "លឹម ភិចហួរ"
        },
        {
            "barcode": "171144185",
            "dpc": "03052212801",
            "name": "លឹម ឆាយ ២"
        },
        {
            "barcode": "171144186",
            "dpc": "03052212901",
            "name": "លឹម ឆាយ ៣"
        },
        {
            "barcode": "171144187",
            "dpc": "03052213001",
            "name": "លឹម ឆាយ ៤"
        },
        {
            "barcode": "171144188",
            "dpc": "03052213101",
            "name": "ជី អែស ធី"
        },
        {
            "barcode": "171144189",
            "dpc": "03052213201",
            "name": "ហួន សាយ"
        },
        {
            "barcode": "171144190",
            "dpc": "03052213301",
            "name": "ក្រុម ជុំនុំ ប៊ី អែស ធី"
        },
        {
            "barcode": "171144191",
            "dpc": "03052213401",
            "name": "អេង សុខនេត"
        },
        {
            "barcode": "171144192",
            "dpc": "03052213501",
            "name": "រស់ សារ៉ន"
        },
        {
            "barcode": "171144193",
            "dpc": "03052213601",
            "name": "លឹម  ឈួងសៀ"
        },
        {
            "barcode": "171144194",
            "dpc": "03052213701",
            "name": "យ៉ា សារឿន"
        },
        {
            "barcode": "171144195",
            "dpc": "03052213801",
            "name": "រស់ ពិសិដ្ឋ"
        },
        {
            "barcode": "171144196",
            "dpc": "03052213901",
            "name": "វែង ស៊្រុន ២"
        },
        {
            "barcode": "171144197",
            "dpc": "03052214001",
            "name": "រិន វិសាល ១"
        },
        {
            "barcode": "171144198",
            "dpc": "03052214101",
            "name": "ស៊ិន ហួរ"
        },
        {
            "barcode": "171144199",
            "dpc": "03052214201",
            "name": "ហែម សុធា"
        },
        {
            "barcode": "171144200",
            "dpc": "03052214301",
            "name": "សាលារៀន យូ.អ៊ឹម.អ៊ី"
        },
        {
            "barcode": "171144201",
            "dpc": "03052214401",
            "name": "គឹម សុខ"
        },
        {
            "barcode": "171144202",
            "dpc": "03052214501",
            "name": "ការ៉ាស់សាំង តេលា (អន្លង់វិល )"
        },
        {
            "barcode": "171144203",
            "dpc": "03052214601",
            "name": "កុមារឥតព្រំដែន"
        },
        {
            "barcode": "171144204",
            "dpc": "03052214701",
            "name": "ហុង ឆាយ"
        },
        {
            "barcode": "171144205",
            "dpc": "03052214801",
            "name": "ហៃ ភួង"
        },
        {
            "barcode": "171144206",
            "dpc": "03052214901",
            "name": "អ៊ារ ថៃភួង"
        },
        {
            "barcode": "171144207",
            "dpc": "03052215001",
            "name": "វិទ្យាល័យបៀលប្រាយ ១"
        },
        {
            "barcode": "171144208",
            "dpc": "03052215101",
            "name": "កូវ ជីងប៊ុង"
        },
        {
            "barcode": "171144209",
            "dpc": "03052215201",
            "name": "សួន ឆៀត (ស្ទួន២៣ )"
        },
        {
            "barcode": "171144210",
            "dpc": "03052215301",
            "name": "ធា   លឹម"
        },
        {
            "barcode": "171144211",
            "dpc": "03052215401",
            "name": "សត្តឃាត"
        },
        {
            "barcode": "171144212",
            "dpc": "03052215501",
            "name": "សំ   គីម ២"
        },
        {
            "barcode": "171144213",
            "dpc": "03052215601",
            "name": "ព្រឿន  សឿត"
        },
        {
            "barcode": "171144214",
            "dpc": "03052215701",
            "name": "អ៊ុត   មួយ ១"
        },
        {
            "barcode": "171144215",
            "dpc": "03052215801",
            "name": "អ៊ុត   មួយ ២"
        },
        {
            "barcode": "171144216",
            "dpc": "03052215901",
            "name": "ថាំ   ស៊ុនថូ"
        },
        {
            "barcode": "171144217",
            "dpc": "03052216001",
            "name": "វែង   សុផល"
        },
        {
            "barcode": "171144218",
            "dpc": "03052216101",
            "name": "ប៉ា   សុជាតិវង្ស"
        },
        {
            "barcode": "171144219",
            "dpc": "03052216301",
            "name": "ចាន់   សម្ជស្ស"
        },
        {
            "barcode": "171144220",
            "dpc": "03052216401",
            "name": "តាំង  ជុងខេង"
        },
        {
            "barcode": "171144221",
            "dpc": "03052216501",
            "name": "ឡូ   សុផល"
        },
        {
            "barcode": "171144222",
            "dpc": "03052216601",
            "name": "សាប៊ូ  អូហ្សាណូ"
        },
        {
            "barcode": "171144223",
            "dpc": "03052216701",
            "name": "នក់   ម៉ង់"
        },
        {
            "barcode": "171144224",
            "dpc": "03052216801",
            "name": "សយ បូរ៉ា"
        },
        {
            "barcode": "171144225",
            "dpc": "03052216901",
            "name": "ហ៊ុយុ ហេង"
        },
        {
            "barcode": "171144226",
            "dpc": "03052217101",
            "name": "ហុង  សារិន"
        },
        {
            "barcode": "171144227",
            "dpc": "03052217201",
            "name": "ឌុក អៀក"
        },
        {
            "barcode": "171144228",
            "dpc": "03052217401",
            "name": "សេរី ចរិយា ១"
        },
        {
            "barcode": "171144229",
            "dpc": "03052217501",
            "name": "សេរី ចរិយា ២"
        },
        {
            "barcode": "171144230",
            "dpc": "03052217601",
            "name": "ណៃ គឹមសុន ២"
        },
        {
            "barcode": "171144231",
            "dpc": "03052217701",
            "name": "សេង សុទ្ធី"
        },
        {
            "barcode": "171144232",
            "dpc": "03052217801",
            "name": "មាស សុភាព"
        },
        {
            "barcode": "171144233",
            "dpc": "03052217901",
            "name": "ប៊ន សោ ភ័ណ"
        },
        {
            "barcode": "171144234",
            "dpc": "03052218101",
            "name": "វិទ្យាល័យបៀលប្រាយ ២"
        },
        {
            "barcode": "171144235",
            "dpc": "03052218201",
            "name": "ងិន ឃន ១"
        },
        {
            "barcode": "171144236",
            "dpc": "03052218301",
            "name": "ងិន ឃន ៤"
        },
        {
            "barcode": "171144237",
            "dpc": "03052218401",
            "name": "ងិន ឃន ៥"
        },
        {
            "barcode": "171144238",
            "dpc": "03052218501",
            "name": "ងិន ឃន ៦"
        },
        {
            "barcode": "171144239",
            "dpc": "03052218601",
            "name": "យ៉ម   ចំរើន ៤"
        },
        {
            "barcode": "171144240",
            "dpc": "03052218701",
            "name": "សណ្ឋាគារស្ទឹងសង្កែ"
        },
        {
            "barcode": "171144241",
            "dpc": "03052218801",
            "name": "ហេង លាប"
        },
        {
            "barcode": "171144242",
            "dpc": "03052218901",
            "name": "វ៉ាន់  ហម"
        },
        {
            "barcode": "171144243",
            "dpc": "03052219001",
            "name": "រស់ យាន"
        },
        {
            "barcode": "171144244",
            "dpc": "03052219101",
            "name": "ភោជនីយដ្ឋាន វិមានរៀម"
        },
        {
            "barcode": "171144245",
            "dpc": "03052219301",
            "name": "សួន  រើន"
        },
        {
            "barcode": "171144246",
            "dpc": "03052219401",
            "name": "លឹម  ទៀហេង"
        },
        {
            "barcode": "171144247",
            "dpc": "03052219501",
            "name": "បេង  ភី ១"
        },
        {
            "barcode": "171144248",
            "dpc": "03052219601",
            "name": "កាកបាទក្រហម"
        },
        {
            "barcode": "171144249",
            "dpc": "03052219701",
            "name": "ប៊ុន  សេង ២"
        },
        {
            "barcode": "171144250",
            "dpc": "03052219801",
            "name": "តូ  មិត"
        },
        {
            "barcode": "171144251",
            "dpc": "03052219901",
            "name": "ហេង តុលា"
        },
        {
            "barcode": "171144252",
            "dpc": "03052220101",
            "name": "តូតាល់អន្លងវិល"
        },
        {
            "barcode": "171144253",
            "dpc": "03052220201",
            "name": "សាឌុន  សារិទ្ធ"
        },
        {
            "barcode": "171144254",
            "dpc": "03052220301",
            "name": "ជាម ចាន់សោភ័ណ"
        },
        {
            "barcode": "171144255",
            "dpc": "03052220401",
            "name": "ម៉ៅ  អេង"
        },
        {
            "barcode": "171144256",
            "dpc": "03052220501",
            "name": "ឡុង  សុធី ២"
        },
        {
            "barcode": "171144257",
            "dpc": "03052220601",
            "name": "ហត្ថ  ធី"
        },
        {
            "barcode": "171144258",
            "dpc": "03052220701",
            "name": "យិន  គិតឡេង"
        },
        {
            "barcode": "171144259",
            "dpc": "03052220901",
            "name": "អ៊ឹង  គឹមលី"
        },
        {
            "barcode": "171144260",
            "dpc": "03052221001",
            "name": "មាស ចាន់ធឿន"
        },
        {
            "barcode": "171144261",
            "dpc": "03052221101",
            "name": "រី  រឿន"
        },
        {
            "barcode": "171144262",
            "dpc": "03052221201",
            "name": "ណាំ  ទុំ (រ៉ាក់ )"
        },
        {
            "barcode": "171144263",
            "dpc": "03052221301",
            "name": "ហួយ ចន្ធី"
        },
        {
            "barcode": "171144264",
            "dpc": "03052221401",
            "name": "រាជ  សុវណ្ណារិទ្ធ (ហូលីដេ ២ )"
        },
        {
            "barcode": "171144265",
            "dpc": "03052221501",
            "name": "អ៊ឹង  គីរីរ័ត្ន"
        },
        {
            "barcode": "171144266",
            "dpc": "03052221601",
            "name": "ប៉ាត់  ផលបុត្រ"
        },
        {
            "barcode": "171144267",
            "dpc": "03052221701",
            "name": "ប៊ុន  សុវណ្ណ"
        },
        {
            "barcode": "171144268",
            "dpc": "03052221801",
            "name": "យន់  ណូរ៉ាត"
        },
        {
            "barcode": "171144269",
            "dpc": "03052221901",
            "name": "ង៉ូវ  វែងហុក"
        },
        {
            "barcode": "171144270",
            "dpc": "03052222001",
            "name": "ខេមរាបាត់ដំបង ១"
        },
        {
            "barcode": "171144271",
            "dpc": "03052222101",
            "name": "ខេមរាបាត់ដំបង ២"
        },
        {
            "barcode": "171144272",
            "dpc": "03052222201",
            "name": "រាត្រីស្ទឹងសង្គែ"
        },
        {
            "barcode": "171144273",
            "dpc": "03052222401",
            "name": "ប៉ោ  វណ្ណះ"
        },
        {
            "barcode": "171144274",
            "dpc": "03052222501",
            "name": "ចាន់  ធី"
        },
        {
            "barcode": "171144275",
            "dpc": "03052222601",
            "name": "សុខ  រ៉ាថន (ការ៉ាស់សាំង សូគីម៉ិច  )"
        },
        {
            "barcode": "171144276",
            "dpc": "03052222701",
            "name": "ឈឹម  ស៊ួ"
        },
        {
            "barcode": "171144277",
            "dpc": "03052222801",
            "name": "មឹក  ហេង"
        },
        {
            "barcode": "171144278",
            "dpc": "03052222901",
            "name": "តាំង  ឈុន (ប៉ូលីស )"
        },
        {
            "barcode": "171144279",
            "dpc": "03052223001",
            "name": "សុខ  ឡាវ"
        },
        {
            "barcode": "171144280",
            "dpc": "03052223101",
            "name": "លឹម  សេងហ៊ួរ"
        },
        {
            "barcode": "171144281",
            "dpc": "03052223301",
            "name": "ជា  អេង ២"
        },
        {
            "barcode": "171144282",
            "dpc": "03052223401",
            "name": "ហោ  តុងហាប់"
        },
        {
            "barcode": "171144283",
            "dpc": "03052223501",
            "name": "បេង  ភី"
        },
        {
            "barcode": "171144284",
            "dpc": "03052223601",
            "name": "បេ  សារឿន"
        },
        {
            "barcode": "171144285",
            "dpc": "03052223801",
            "name": "ហម  សាម៉ុន"
        },
        {
            "barcode": "171144286",
            "dpc": "03052223901",
            "name": "បង្គន់អនាម័យសាធាណះ"
        },
        {
            "barcode": "171144287",
            "dpc": "03052224001",
            "name": "តុក  សុងសួ"
        },
        {
            "barcode": "171144288",
            "dpc": "03052224101",
            "name": "សិប្បកម្មលូ"
        },
        {
            "barcode": "171144289",
            "dpc": "03052224201",
            "name": "បួន  សៀ"
        },
        {
            "barcode": "171144290",
            "dpc": "03052224301",
            "name": "ដៃដែក"
        },
        {
            "barcode": "171144291",
            "dpc": "03052224401",
            "name": "ស  ឌឿ"
        },
        {
            "barcode": "171144292",
            "dpc": "03052224501",
            "name": "អ៊ុំ  ចំរើន"
        },
        {
            "barcode": "171144293",
            "dpc": "03052224601",
            "name": "ហ៊ូ  រតនា"
        },
        {
            "barcode": "171144294",
            "dpc": "03052224701",
            "name": "ឌុក  ឆវេត"
        },
        {
            "barcode": "171144295",
            "dpc": "03052224801",
            "name": "អ៊ុំ  អេង"
        },
        {
            "barcode": "171144296",
            "dpc": "03052224901",
            "name": "សាលា អ៊ី.ស៊ី.ស៊ី"
        },
        {
            "barcode": "171144297",
            "dpc": "03052225001",
            "name": "ហួន  ហេង"
        },
        {
            "barcode": "171144298",
            "dpc": "03052225101",
            "name": "ស៊ុន លីនណា"
        },
        {
            "barcode": "171144299",
            "dpc": "03052225201",
            "name": "នៅ  យូរឡុង (វត្តសូភី )"
        },
        {
            "barcode": "171144300",
            "dpc": "03052225301",
            "name": "វត្តពោធិក្នុង"
        },
        {
            "barcode": "171144301",
            "dpc": "03052225401",
            "name": "កុង  យក់"
        },
        {
            "barcode": "171144302",
            "dpc": "03052225501",
            "name": "តាំង  ឡាយ"
        },
        {
            "barcode": "171144303",
            "dpc": "03052225601",
            "name": "ឈិត  សុក"
        },
        {
            "barcode": "171144304",
            "dpc": "03052225701",
            "name": "អែម  សុផល"
        },
        {
            "barcode": "171144305",
            "dpc": "03052225801",
            "name": "សន  និល"
        },
        {
            "barcode": "171144306",
            "dpc": "03052225901",
            "name": "គឹម  មុន្នី"
        },
        {
            "barcode": "171144307",
            "dpc": "03052226001",
            "name": "អ៊ុក  ស៊ីណយ"
        },
        {
            "barcode": "171144308",
            "dpc": "03052226101",
            "name": "ប្រាក់  ព្រី"
        },
        {
            "barcode": "171144309",
            "dpc": "03052226201",
            "name": "ងួន  ពន្លក"
        },
        {
            "barcode": "171144310",
            "dpc": "03052226301",
            "name": "សេង  ប៊ូ"
        },
        {
            "barcode": "171144311",
            "dpc": "03052226501",
            "name": "ផ្សារថ្មី"
        },
        {
            "barcode": "171144312",
            "dpc": "03052226601",
            "name": "តាំង  ម៉េងគង់"
        },
        {
            "barcode": "171144313",
            "dpc": "03052226701",
            "name": "វត្តផ្សារថ្មី"
        },
        {
            "barcode": "171144314",
            "dpc": "03052226801",
            "name": "ចេង  អឿន"
        },
        {
            "barcode": "171144315",
            "dpc": "03052226901",
            "name": "ក្រុមហ៊ុន អិលឌីអែស"
        },
        {
            "barcode": "171144316",
            "dpc": "03052227001",
            "name": "តុប  ថូលីណា ១"
        },
        {
            "barcode": "171144317",
            "dpc": "03052227101",
            "name": "តុប  ថូលីណា ២"
        },
        {
            "barcode": "171144318",
            "dpc": "03052227201",
            "name": "ឡាំ  ឆៃលីន"
        },
        {
            "barcode": "171144319",
            "dpc": "03052227301",
            "name": "វ៉ាន់  ណារ៉េត"
        },
        {
            "barcode": "171144320",
            "dpc": "03052227401",
            "name": "នៅ  សិទ្ធិគុណ"
        },
        {
            "barcode": "171144321",
            "dpc": "03052227501",
            "name": "សួន  វណ្ណនេត"
        },
        {
            "barcode": "171144322",
            "dpc": "03052227601",
            "name": "សៀ   ស៊ិន ១"
        },
        {
            "barcode": "171144323",
            "dpc": "03052227701",
            "name": "គាន  ថៃ ១"
        },
        {
            "barcode": "171144324",
            "dpc": "03052227801",
            "name": "ឃុន  ងួនហុង"
        },
        {
            "barcode": "171144325",
            "dpc": "03052227901",
            "name": "វិទ្យាល័យបៀលប្រាយ ៣"
        },
        {
            "barcode": "171144326",
            "dpc": "03052228001",
            "name": "សន  សុភ័ក្រ"
        },
        {
            "barcode": "171144327",
            "dpc": "03052228101",
            "name": "ឡុង  ចន្ថា"
        },
        {
            "barcode": "171144328",
            "dpc": "03052228201",
            "name": "ម៉ម  បណ្ឌិត"
        },
        {
            "barcode": "171144329",
            "dpc": "03052228301",
            "name": "គង់  ធី"
        },
        {
            "barcode": "171144330",
            "dpc": "03052228501",
            "name": "លក  វណ្ណ"
        },
        {
            "barcode": "171144331",
            "dpc": "03052228601",
            "name": "វ៉ាត់   ស៊ីម"
        },
        {
            "barcode": "171144332",
            "dpc": "03052228701",
            "name": "ហ៊ាង  រ៉ាវុធ"
        },
        {
            "barcode": "171144333",
            "dpc": "03052228801",
            "name": "ទៀប  រី ២"
        },
        {
            "barcode": "171144334",
            "dpc": "03052228901",
            "name": "លឹម  ហូ"
        },
        {
            "barcode": "171144335",
            "dpc": "03052229001",
            "name": "ខឹម  សាឃឿន"
        },
        {
            "barcode": "171144336",
            "dpc": "03052229201",
            "name": "សឹង  លី"
        },
        {
            "barcode": "171144337",
            "dpc": "03052229301",
            "name": "ឯម  សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171144338",
            "dpc": "03052229401",
            "name": "ទឹម  វណ្ណា"
        },
        {
            "barcode": "171144339",
            "dpc": "03052229501",
            "name": "ផុន  ផាវុធ"
        },
        {
            "barcode": "171144340",
            "dpc": "03052229601",
            "name": "ឈុំ  ចាន់"
        },
        {
            "barcode": "171144341",
            "dpc": "03052229701",
            "name": "វត្តកណ្តាល"
        },
        {
            "barcode": "171144342",
            "dpc": "03052229801",
            "name": "ឌិត  ជិន"
        },
        {
            "barcode": "171144343",
            "dpc": "03052229901",
            "name": "ជួប  យ៉ុម"
        },
        {
            "barcode": "171145243",
            "dpc": "03052225001",
            "name": "ហួន  ហេង"
        },
        {
            "barcode": "171145244",
            "dpc": "03052225001",
            "name": "ហួន  ហេង"
        },
        {
            "barcode": "171145245",
            "dpc": "03052215801",
            "name": "អ៊ុត   មួយ ២"
        },
        {
            "barcode": "171145246",
            "dpc": "03052218801",
            "name": "ហេង លាប"
        }
    ];

*/
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
