let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171142319",
            "dpc": "03042334901",
            "name": "ហួង សារូ"
        },
        {
            "barcode": "171142320",
            "dpc": "03042347001",
            "name": "គុញ សាត"
        },
        {
            "barcode": "171142321",
            "dpc": "03042302001",
            "name": "ឈួយ សាមឿន"
        },
        {
            "barcode": "171142322",
            "dpc": "03042343501",
            "name": "ធ្យូង យ៉ន់"
        },
        {
            "barcode": "171142323",
            "dpc": "03042305101",
            "name": "សែម សម្បត្តិ"
        },
        {
            "barcode": "171142324",
            "dpc": "03042305201",
            "name": "គា ពិសិដ្ឋ"
        },
        {
            "barcode": "171142325",
            "dpc": "03042305401",
            "name": "នួន ស្រី"
        },
        {
            "barcode": "171142326",
            "dpc": "03042305301",
            "name": "កែវ រតនា"
        },
        {
            "barcode": "171142327",
            "dpc": "03042340901",
            "name": "រ៉េណ្ណាច័ន្ទម៉ារី"
        },
        {
            "barcode": "171142328",
            "dpc": "03042341001",
            "name": "សោ ចាន់ដេត"
        },
        {
            "barcode": "171142329",
            "dpc": "03042343601",
            "name": "កើយ ភាព"
        },
        {
            "barcode": "171142330",
            "dpc": "03042346401",
            "name": "ស៊ឹម ហាន"
        },
        {
            "barcode": "171142331",
            "dpc": "03042345601",
            "name": "រស់ គីមអេង"
        },
        {
            "barcode": "171142332",
            "dpc": "03042304801",
            "name": "វ៉ុន ប៊ុនធឿន"
        },
        {
            "barcode": "171142333",
            "dpc": "03042304901",
            "name": "នេត ភឹម"
        },
        {
            "barcode": "171142334",
            "dpc": "03042305001",
            "name": "សេក សឺត"
        },
        {
            "barcode": "171142335",
            "dpc": "03042306801",
            "name": "ព្រំ សំអាន"
        },
        {
            "barcode": "171142336",
            "dpc": "03042306901",
            "name": "ប៉ាត់ ចំរើន"
        },
        {
            "barcode": "171142337",
            "dpc": "03042339301",
            "name": "ឃួន នី"
        },
        {
            "barcode": "171142338",
            "dpc": "03042307001",
            "name": "ប៊ុន សារឿន"
        },
        {
            "barcode": "171142339",
            "dpc": "03042306701",
            "name": "ញ៉ែម សោភ័ណ"
        },
        {
            "barcode": "171142340",
            "dpc": "03042307101",
            "name": "រិទ្ធ វិសាល"
        },
        {
            "barcode": "171142341",
            "dpc": "03042307201",
            "name": "ប៊ុន ទិត្យារិទ្ធ"
        },
        {
            "barcode": "171142342",
            "dpc": "03042307301",
            "name": "អ៊ុល សុខសាន"
        },
        {
            "barcode": "171142343",
            "dpc": "03042307401",
            "name": "វណ្ណ ចរិយា"
        },
        {
            "barcode": "171142344",
            "dpc": "03042346101",
            "name": "ដេម ឌីណា"
        },
        {
            "barcode": "171142345",
            "dpc": "03042329901",
            "name": "ឆឹង អៀក"
        },
        {
            "barcode": "171142346",
            "dpc": "03042305601",
            "name": "ហួន ចំរើន"
        },
        {
            "barcode": "171142347",
            "dpc": "03042305801",
            "name": "ស៊ុន សុខ"
        },
        {
            "barcode": "171142348",
            "dpc": "03042305901",
            "name": "សំរិត ឆន១"
        },
        {
            "barcode": "171142349",
            "dpc": "03042306001",
            "name": "អ៊ុំ ដារី"
        },
        {
            "barcode": "171142350",
            "dpc": "03042341201",
            "name": "ប៉ង់ រីនីមីហ្សែល"
        },
        {
            "barcode": "171142351",
            "dpc": "03042306101",
            "name": "កូយ ហឿន"
        },
        {
            "barcode": "171142352",
            "dpc": "03042306201",
            "name": "ចាប មុំ"
        },
        {
            "barcode": "171142353",
            "dpc": "03042337801",
            "name": "សាំង ទក្ខិណា"
        },
        {
            "barcode": "171142354",
            "dpc": "03042337901",
            "name": "ហួត សុខុន"
        },
        {
            "barcode": "171142355",
            "dpc": "03042338001",
            "name": "សាំង វណ្ណី"
        },
        {
            "barcode": "171142356",
            "dpc": "03042345001",
            "name": "លឹម ប៉ោសេង"
        },
        {
            "barcode": "171142357",
            "dpc": "03042344301",
            "name": "វិញ សុខហៀក"
        },
        {
            "barcode": "171142358",
            "dpc": "03042338501",
            "name": "វួច ស្រេង"
        },
        {
            "barcode": "171142359",
            "dpc": "03042338601",
            "name": "សោម សម្បត្តិ"
        },
        {
            "barcode": "171142360",
            "dpc": "03042308801",
            "name": "ម៉ែន ចាន់នឿម"
        },
        {
            "barcode": "171142361",
            "dpc": "03042308701",
            "name": "កង សេដ្ឋា"
        },
        {
            "barcode": "171142362",
            "dpc": "03042307801",
            "name": "ឆោម ប៊ុនខន"
        },
        {
            "barcode": "171142363",
            "dpc": "03042338101",
            "name": "នេត សាវ"
        },
        {
            "barcode": "171142364",
            "dpc": "03042338201",
            "name": "ទៀង សុផល"
        },
        {
            "barcode": "171142365",
            "dpc": "03042308601",
            "name": "ហៀង ឆីវគុណ"
        },
        {
            "barcode": "171142366",
            "dpc": "03042332501",
            "name": "ង៉ែត រឹម"
        },
        {
            "barcode": "171142367",
            "dpc": "03042308201",
            "name": "សុខ ជា"
        },
        {
            "barcode": "171142368",
            "dpc": "03042339601",
            "name": "ទូច អង្គារិទ្ធ"
        },
        {
            "barcode": "171142369",
            "dpc": "03042339501",
            "name": "ឌុំ សារ៉ាត់"
        },
        {
            "barcode": "171142370",
            "dpc": "03042339401",
            "name": "សុវណ្ណ វឿន"
        },
        {
            "barcode": "171142371",
            "dpc": "03042307601",
            "name": "ឆុំ វណ្ណារី"
        },
        {
            "barcode": "171142372",
            "dpc": "03042339801",
            "name": "គី ពៅ"
        },
        {
            "barcode": "171142373",
            "dpc": "03042338901",
            "name": "ហេង ម៉ាឌីណូ"
        },
        {
            "barcode": "171142374",
            "dpc": "03042308501",
            "name": "សឿ ចាន់រ៉ាស៊ី"
        },
        {
            "barcode": "171142375",
            "dpc": "03042345401",
            "name": "ឡាក់ តាំងស៊ីន"
        },
        {
            "barcode": "171142376",
            "dpc": "03042332401",
            "name": "អ៊ុល ថាវី"
        },
        {
            "barcode": "171142377",
            "dpc": "03042309001",
            "name": "ផុន ផល"
        },
        {
            "barcode": "171142378",
            "dpc": "03042309101",
            "name": "ម៉ៃ ភ្លើន"
        },
        {
            "barcode": "171142379",
            "dpc": "03042309201",
            "name": "សរ សុរិទ្ធ"
        },
        {
            "barcode": "171142380",
            "dpc": "03042309301",
            "name": "លឹម ហ្កិចឡាយ"
        },
        {
            "barcode": "171142381",
            "dpc": "03042309401",
            "name": "ឯម វរិទ្ធ"
        },
        {
            "barcode": "171142382",
            "dpc": "03042309501",
            "name": "ទេព ឧត្តម"
        },
        {
            "barcode": "171142383",
            "dpc": "03042309601",
            "name": "កែវ ប៊ុនឆែម"
        },
        {
            "barcode": "171142384",
            "dpc": "03042309701",
            "name": "ទេព ប៊ុនណារិទ្ធ"
        },
        {
            "barcode": "171142385",
            "dpc": "03042309801",
            "name": "អ៊ុំ សឹង"
        },
        {
            "barcode": "171142386",
            "dpc": "03042343701",
            "name": "អ៊ុំ គឹមស៊ុន"
        },
        {
            "barcode": "171142387",
            "dpc": "03042309901",
            "name": "បេ គឹមសាន"
        },
        {
            "barcode": "171142388",
            "dpc": "03042310001",
            "name": "អ៊ុំ គឹមសាន"
        },
        {
            "barcode": "171142389",
            "dpc": "03042310101",
            "name": "អ៊ុំ ទូច"
        },
        {
            "barcode": "171142390",
            "dpc": "03042310301",
            "name": "ចាន់ ឈុនលីកា"
        },
        {
            "barcode": "171142391",
            "dpc": "03042310201",
            "name": "ស្វាយ សំអឿន"
        },
        {
            "barcode": "171142392",
            "dpc": "03042310401",
            "name": "ប៉ែន រិទ្ធី"
        },
        {
            "barcode": "171142393",
            "dpc": "03042310501",
            "name": "ទុយ វុទ្ធី"
        },
        {
            "barcode": "171142394",
            "dpc": "03042310601",
            "name": "ពៅ សុវណ្ណ"
        },
        {
            "barcode": "171142395",
            "dpc": "03042310701",
            "name": "ងិន សូលីដា"
        },
        {
            "barcode": "171142396",
            "dpc": "03042310801",
            "name": "សៀន ចន្ថា"
        },
        {
            "barcode": "171142397",
            "dpc": "03042310901",
            "name": "ឡុញ ឃឿម"
        },
        {
            "barcode": "171142398",
            "dpc": "03042311001",
            "name": "ឡុង សំអៀត"
        },
        {
            "barcode": "171142399",
            "dpc": "03042311101",
            "name": "អ៊ុក សារ៉ាក់"
        },
        {
            "barcode": "171142400",
            "dpc": "03042311201",
            "name": "អ៊ុយ ប៊ូ"
        },
        {
            "barcode": "171142401",
            "dpc": "03042311301",
            "name": "ឈើយ សុខេត"
        },
        {
            "barcode": "171142402",
            "dpc": "03042347101",
            "name": "ប៊ុន សុធាវី"
        },
        {
            "barcode": "171142403",
            "dpc": "03042338401",
            "name": "សាលារៀនបាឡាត់"
        },
        {
            "barcode": "171142404",
            "dpc": "03042347201",
            "name": "ប៊ុន ធឹង ២"
        },
        {
            "barcode": "171142405",
            "dpc": "03042301701",
            "name": "លឹម ឃៀង"
        },
        {
            "barcode": "171142406",
            "dpc": "03042304301",
            "name": "ឡាយ សុវណ្ណមុន្នីរាជ ២"
        },
        {
            "barcode": "171142407",
            "dpc": "03042304701",
            "name": "ហួត ធូ"
        },
        {
            "barcode": "171142408",
            "dpc": "03042305701",
            "name": "សៅ សារិន"
        },
        {
            "barcode": "171142409",
            "dpc": "03042306301",
            "name": "លី ស៊្រូយ"
        },
        {
            "barcode": "171142410",
            "dpc": "03042306401",
            "name": "ទោម ថាច"
        },
        {
            "barcode": "171142411",
            "dpc": "03042306601",
            "name": "សេក ណៃហ៊ុន"
        },
        {
            "barcode": "171142412",
            "dpc": "03042307501",
            "name": "ណៃ ធៀង"
        },
        {
            "barcode": "171142413",
            "dpc": "03042307701",
            "name": "ប៉ិល សុជាតិ"
        },
        {
            "barcode": "171142414",
            "dpc": "03042307901",
            "name": "ម៉ៅ សុខុម"
        },
        {
            "barcode": "171142415",
            "dpc": "03042308101",
            "name": "អ៊ុង ណារៀង"
        },
        {
            "barcode": "171142416",
            "dpc": "03042308401",
            "name": "ជា ចាយ"
        },
        {
            "barcode": "171142417",
            "dpc": "03042312101",
            "name": "មឿន សារ៉េត"
        },
        {
            "barcode": "171142418",
            "dpc": "03042312501",
            "name": "ឡុង ហ៊ាន"
        },
        {
            "barcode": "171142419",
            "dpc": "03042312701",
            "name": "ព្រំ ផា"
        },
        {
            "barcode": "171142420",
            "dpc": "03042312801",
            "name": "សាត ទ្រី"
        },
        {
            "barcode": "171142421",
            "dpc": "03042312901",
            "name": "នូវ សារឿន"
        },
        {
            "barcode": "171142422",
            "dpc": "03042313001",
            "name": "ជិន ស៊ន"
        },
        {
            "barcode": "171142423",
            "dpc": "03042313101",
            "name": "នាង សុភ័ក្រ"
        },
        {
            "barcode": "171142424",
            "dpc": "03042313201",
            "name": "មាស យ៉ានី"
        },
        {
            "barcode": "171142425",
            "dpc": "03042313301",
            "name": "អយ គា"
        },
        {
            "barcode": "171142426",
            "dpc": "03042313401",
            "name": "ឈុន ផានី"
        },
        {
            "barcode": "171142427",
            "dpc": "03042314701",
            "name": "ម៉ៅ ហ៊ាន"
        },
        {
            "barcode": "171142428",
            "dpc": "03042315101",
            "name": "ចាប ស៊ុនថាយ"
        },
        {
            "barcode": "171142429",
            "dpc": "03042315301",
            "name": "លឹម ឡៃស៊ាង"
        },
        {
            "barcode": "171142430",
            "dpc": "03042315401",
            "name": "នង សារ៉ែន"
        },
        {
            "barcode": "171142431",
            "dpc": "03042315501",
            "name": "ឡម វៀត"
        },
        {
            "barcode": "171142432",
            "dpc": "03042329201",
            "name": "ប៊ុន ធឹង"
        },
        {
            "barcode": "171142433",
            "dpc": "03042330101",
            "name": "លាង កឹមលន់"
        },
        {
            "barcode": "171142434",
            "dpc": "03042330401",
            "name": "ធិន ម៉ាក់ធែល"
        },
        {
            "barcode": "171142435",
            "dpc": "03042332301",
            "name": "អ៊ិន ឧត្តម"
        },
        {
            "barcode": "171142436",
            "dpc": "03042332701",
            "name": "ផូ គឹមស្រៀង"
        },
        {
            "barcode": "171142437",
            "dpc": "03042333601",
            "name": "អ៊ិត សាខន"
        },
        {
            "barcode": "171142438",
            "dpc": "03042333901",
            "name": "សន សុង"
        },
        {
            "barcode": "171142439",
            "dpc": "03042334201",
            "name": "ញ៉ែ រ៉េត"
        },
        {
            "barcode": "171142440",
            "dpc": "03042334701",
            "name": "ស៊ី ធីអេស៊ា"
        },
        {
            "barcode": "171142441",
            "dpc": "03042335401",
            "name": "កែវ ចន្ថា"
        },
        {
            "barcode": "171142442",
            "dpc": "03042336801",
            "name": "អ៊ុត បុប្ជា"
        },
        {
            "barcode": "171142443",
            "dpc": "03042337601",
            "name": "ធុច រ៉ា"
        },
        {
            "barcode": "171142444",
            "dpc": "03042337701",
            "name": "មាស កាន"
        },
        {
            "barcode": "171142445",
            "dpc": "03042338301",
            "name": "រ៉ា សុផុន"
        },
        {
            "barcode": "171142446",
            "dpc": "03042338701",
            "name": "ប៊ុន គង់"
        },
        {
            "barcode": "171142447",
            "dpc": "03042339701",
            "name": "សូ សំស័ក្ត"
        },
        {
            "barcode": "171142448",
            "dpc": "03042340501",
            "name": "ស៊ីវ លានគីម"
        },
        {
            "barcode": "171142449",
            "dpc": "03042340601",
            "name": "ស៊្រុនុ គឹមហុង"
        },
        {
            "barcode": "171142450",
            "dpc": "03042341101",
            "name": "ព្រហ្ម រតនៈ"
        },
        {
            "barcode": "171142451",
            "dpc": "03042342101",
            "name": "អ៊ុក ណារិទ្ធ"
        },
        {
            "barcode": "171142452",
            "dpc": "03042342201",
            "name": "អ៊ុក លី"
        },
        {
            "barcode": "171142453",
            "dpc": "03042342601",
            "name": "កែវ សាវ៉ៃហ៊ែន"
        },
        {
            "barcode": "171142454",
            "dpc": "03042342701",
            "name": "ទៀង វ៉ា"
        },
        {
            "barcode": "171142455",
            "dpc": "03042344701",
            "name": "ហង់ សុភ័ក្ត្រ"
        },
        {
            "barcode": "171142456",
            "dpc": "03042344801",
            "name": "គុំ កញ្ញា"
        },
        {
            "barcode": "171142457",
            "dpc": "03042344901",
            "name": "អ៊ុល ហ៊ួន"
        },
        {
            "barcode": "171142458",
            "dpc": "03042345201",
            "name": "ទ្រី នាង"
        },
        {
            "barcode": "171142459",
            "dpc": "03042345301",
            "name": "ពេជ្រ សុធា"
        },
        {
            "barcode": "171142460",
            "dpc": "03042346901",
            "name": "យឺ ដារ៉ុត"
        },
        {
            "barcode": "171142461",
            "dpc": "03042347501",
            "name": "ហេង អ៊ាប"
        },
        {
            "barcode": "171142462",
            "dpc": "03042347601",
            "name": "ហ៊ាង សុមនា ១"
        },
        {
            "barcode": "171142463",
            "dpc": "03042347701",
            "name": "ហ៊ាង សុមនា ២"
        },
        {
            "barcode": "171142464",
            "dpc": "03042347801",
            "name": "ជាម ណារ៉ុង"
        },
        {
            "barcode": "171142465",
            "dpc": "03042332201",
            "name": "សាយ សារុន"
        },
        {
            "barcode": "171142466",
            "dpc": "03042311401",
            "name": "សុំ ថាន"
        },
        {
            "barcode": "171142467",
            "dpc": "03042300101",
            "name": "អែត ហ្វូតត ១៧"
        },
        {
            "barcode": "171142468",
            "dpc": "03042300201",
            "name": "អែត ហ្វូត ១៨"
        },
        {
            "barcode": "171142469",
            "dpc": "03042300601",
            "name": "អៀង វឌ្ឍនា"
        },
        {
            "barcode": "171142470",
            "dpc": "03042300701",
            "name": "ស៊ុន សុផាត"
        },
        {
            "barcode": "171142471",
            "dpc": "03042300801",
            "name": "ចាន់ អេងបី"
        },
        {
            "barcode": "171142472",
            "dpc": "03042300901",
            "name": "ចាន់ ចេក"
        },
        {
            "barcode": "171142473",
            "dpc": "03042345501",
            "name": "សេង ម៉ៅ"
        },
        {
            "barcode": "171142474",
            "dpc": "03042301901",
            "name": "ភួង សាវ៉ាវុធ"
        },
        {
            "barcode": "171142475",
            "dpc": "03042301801",
            "name": "គង់ វុត្ថា"
        },
        {
            "barcode": "171142476",
            "dpc": "03042301201",
            "name": "គីម មួយ ២"
        },
        {
            "barcode": "171142477",
            "dpc": "03042301101",
            "name": "គីម មួយ ១"
        },
        {
            "barcode": "171142478",
            "dpc": "03042301301",
            "name": "សុខ អៀម"
        },
        {
            "barcode": "171142479",
            "dpc": "03042301401",
            "name": "ស៊ុយ សុវណ្ណគិរី"
        },
        {
            "barcode": "171142480",
            "dpc": "03042311901",
            "name": "ជៀវ វន"
        },
        {
            "barcode": "171142481",
            "dpc": "03042336701",
            "name": "ខា ហេង"
        },
        {
            "barcode": "171142482",
            "dpc": "03042302201",
            "name": "ទឹម សាវ៉ាត"
        },
        {
            "barcode": "171142483",
            "dpc": "03042347301",
            "name": "ពេជ្រ សុធា"
        },
        {
            "barcode": "171142484",
            "dpc": "03042302401",
            "name": "នួន ចំរើន"
        },
        {
            "barcode": "171142485",
            "dpc": "03042334001",
            "name": "សុច ហុង"
        },
        {
            "barcode": "171142486",
            "dpc": "03042334101",
            "name": "ឡោ ងួន"
        },
        {
            "barcode": "171142487",
            "dpc": "03042334401",
            "name": "ផែ រ៉ាន់"
        },
        {
            "barcode": "171142488",
            "dpc": "03042302501",
            "name": "ឃន សុធារី"
        },
        {
            "barcode": "171142489",
            "dpc": "03042302601",
            "name": "ផៃ សុវណ្ណ"
        },
        {
            "barcode": "171142490",
            "dpc": "03042332601",
            "name": "អ៊ូច សុខា"
        },
        {
            "barcode": "171142491",
            "dpc": "03042346801",
            "name": "ប៉ក់ វីណា"
        },
        {
            "barcode": "171142492",
            "dpc": "03042302701",
            "name": "មិន គឹមសួរ"
        },
        {
            "barcode": "171142493",
            "dpc": "03042302801",
            "name": "យឹម ផល្លី"
        },
        {
            "barcode": "171142494",
            "dpc": "03042302901",
            "name": "ង៉ាន សំ"
        },
        {
            "barcode": "171142495",
            "dpc": "03042303001",
            "name": "វ៉ុន ឆុង"
        },
        {
            "barcode": "171142496",
            "dpc": "03042333201",
            "name": "ស៊ុន វុទ្ធី"
        },
        {
            "barcode": "171142497",
            "dpc": "03042333301",
            "name": "ស៊ុន ប៊ុនធឿន"
        },
        {
            "barcode": "171142498",
            "dpc": "03042303201",
            "name": "ព្រំ សុខា"
        },
        {
            "barcode": "171142499",
            "dpc": "03042313801",
            "name": "វ៉ិត គឹមលី"
        },
        {
            "barcode": "171142500",
            "dpc": "03042303301",
            "name": "ម៉ុង ហោ"
        },
        {
            "barcode": "171142501",
            "dpc": "03042333401",
            "name": "គួន ធី"
        },
        {
            "barcode": "171142502",
            "dpc": "03042304501",
            "name": "រស់ ប៊ុនរ័ត្ន"
        },
        {
            "barcode": "171142503",
            "dpc": "03042304601",
            "name": "លាក់ ណាត"
        },
        {
            "barcode": "171142504",
            "dpc": "03042303401",
            "name": "ហួត តាវ"
        },
        {
            "barcode": "171142505",
            "dpc": "03042333101",
            "name": "ស្វឺយ ប៊ុនណារ៉េត"
        },
        {
            "barcode": "171142506",
            "dpc": "03042330001",
            "name": "គួច ធិរិទ្ធ"
        },
        {
            "barcode": "171142507",
            "dpc": "03042304101",
            "name": "តែ ណាំ"
        },
        {
            "barcode": "171142508",
            "dpc": "03042304201",
            "name": "ម៉ី ចំរើន"
        },
        {
            "barcode": "171142509",
            "dpc": "03042334601",
            "name": "សោម រិទ្ធី"
        },
        {
            "barcode": "171142510",
            "dpc": "03042329601",
            "name": "តាន់ សុជិត"
        },
        {
            "barcode": "171142511",
            "dpc": "03042340201",
            "name": "យ៉ាន ហួត"
        },
        {
            "barcode": "171142512",
            "dpc": "03042333001",
            "name": "ធាម សំអុល"
        },
        {
            "barcode": "171142513",
            "dpc": "03042341901",
            "name": "ឈឿត ឈឿត"
        },
        {
            "barcode": "171142514",
            "dpc": "03042347901",
            "name": "ចន ដារ៉ាឡុងយូហាន់សុន"
        },
        {
            "barcode": "171142515",
            "dpc": "03042341701",
            "name": "ជួន សុផា"
        },
        {
            "barcode": "171142516",
            "dpc": "03042336101",
            "name": "ប្រាក់ បូរាណ"
        },
        {
            "barcode": "171142517",
            "dpc": "03042335701",
            "name": "ចន្ទ័ សុភា"
        },
        {
            "barcode": "171142518",
            "dpc": "03042331801",
            "name": "សុខ ចេង"
        },
        {
            "barcode": "171142519",
            "dpc": "03042344601",
            "name": "ប៉ែន សេដ្ឋា"
        },
        {
            "barcode": "171142520",
            "dpc": "03042342001",
            "name": "អិល ស៊ីដារ៉ាវុទ្ធី"
        },
        {
            "barcode": "171142521",
            "dpc": "03042341801",
            "name": "ម៉ម សារឿន"
        },
        {
            "barcode": "171142522",
            "dpc": "03042340701",
            "name": "នូ​ សា"
        },
        {
            "barcode": "171142523",
            "dpc": "03042335801",
            "name": "សួរ សុកវិសាល"
        },
        {
            "barcode": "171142524",
            "dpc": "03042336201",
            "name": "ជា សង្ខារសរីវឌ្ឍន៍"
        },
        {
            "barcode": "171142525",
            "dpc": "03042336301",
            "name": "ស៊ូ កុសល់"
        },
        {
            "barcode": "171142526",
            "dpc": "03042304001",
            "name": "ធឹង គឹមហេង២"
        },
        {
            "barcode": "171142527",
            "dpc": "03042343401",
            "name": "សេស សារ៉ុម"
        },
        {
            "barcode": "171142528",
            "dpc": "03042303901",
            "name": "ប៊ូ អ៊ុល"
        },
        {
            "barcode": "171142529",
            "dpc": "03042303701",
            "name": "វង្ស សាវ៉ែ"
        },
        {
            "barcode": "171142530",
            "dpc": "03042303801",
            "name": "ហោ ប៊ុនម៉េង"
        },
        {
            "barcode": "171142531",
            "dpc": "03042303501",
            "name": "កែវ សៅសុភត្រា"
        },
        {
            "barcode": "171142532",
            "dpc": "03042333801",
            "name": "គិត ចាន់ថន"
        },
        {
            "barcode": "171142533",
            "dpc": "03042311501",
            "name": "បឹង កូរ៉េ"
        },
        {
            "barcode": "171142534",
            "dpc": "03042311601",
            "name": "សុខ សីហា"
        },
        {
            "barcode": "171142535",
            "dpc": "03042332801",
            "name": "ស្វាយ នាង"
        },
        {
            "barcode": "171142536",
            "dpc": "03042314501",
            "name": "អ៊ឹម ឆែរ៉ាត់"
        },
        {
            "barcode": "171142537",
            "dpc": "03042345801",
            "name": "អួន ណេង"
        },
        {
            "barcode": "171142538",
            "dpc": "03042314601",
            "name": "អួន ណាង"
        },
        {
            "barcode": "171142539",
            "dpc": "03042334501",
            "name": "ឡម សានឿន"
        },
        {
            "barcode": "171142540",
            "dpc": "03042311701",
            "name": "សួន ឆោមសាវ៉ាត"
        },
        {
            "barcode": "171142541",
            "dpc": "03042311801",
            "name": "សុខ សារ៉េត"
        },
        {
            "barcode": "171142542",
            "dpc": "03042312001",
            "name": "កែវ រ៉ា"
        },
        {
            "barcode": "171142543",
            "dpc": "03042312201",
            "name": "តាំង ស្រីហុង"
        },
        {
            "barcode": "171142544",
            "dpc": "03042312401",
            "name": "ពិន ជុំ"
        },
        {
            "barcode": "171142545",
            "dpc": "03042312301",
            "name": "សៀង ហួត"
        },
        {
            "barcode": "171142546",
            "dpc": "03042347401",
            "name": "វង្ស នាង"
        },
        {
            "barcode": "171142547",
            "dpc": "03042331201",
            "name": "កេង សាវ័យ"
        },
        {
            "barcode": "171142548",
            "dpc": "03042312601",
            "name": "ឃី យ៉ា"
        },
        {
            "barcode": "171142549",
            "dpc": "03042345701",
            "name": "គង់ គឹមសាន"
        },
        {
            "barcode": "171142550",
            "dpc": "03042313901",
            "name": "ជ្រិន ញ៉"
        },
        {
            "barcode": "171142551",
            "dpc": "03042313601",
            "name": "សួន ញ៉ិប"
        },
        {
            "barcode": "171142552",
            "dpc": "03042313701",
            "name": "ឌឹម វណ្ណៈ"
        },
        {
            "barcode": "171142553",
            "dpc": "03042314001",
            "name": "នេត ប៊ី"
        },
        {
            "barcode": "171142554",
            "dpc": "03042314101",
            "name": "រស់ សុចន"
        },
        {
            "barcode": "171142555",
            "dpc": "03042314301",
            "name": "ប្រម ម៉េត"
        },
        {
            "barcode": "171142556",
            "dpc": "03042314201",
            "name": "តន់ គឹមសេង"
        },
        {
            "barcode": "171142557",
            "dpc": "03042314401",
            "name": "ឡុញ សំ"
        },
        {
            "barcode": "171142558",
            "dpc": "03042345901",
            "name": "ម៉ី សុវណ្ណ"
        },
        {
            "barcode": "171142559",
            "dpc": "03042315601",
            "name": "លៀវ ភឿ"
        },
        {
            "barcode": "171142560",
            "dpc": "03042315701",
            "name": "អៀង វុទ្ធី"
        },
        {
            "barcode": "171142561",
            "dpc": "03042315801",
            "name": "ញ៉ែម ឃីម"
        },
        {
            "barcode": "171142562",
            "dpc": "03042315901",
            "name": "គឹម សារៀប"
        },
        {
            "barcode": "171142563",
            "dpc": "03042316001",
            "name": "សំ អឿត"
        },
        {
            "barcode": "171142564",
            "dpc": "03042344401",
            "name": "សាំង សុខុម"
        },
        {
            "barcode": "171142565",
            "dpc": "03042342301",
            "name": "ញ៉ែម វុឌ្ឍឹង"
        },
        {
            "barcode": "171142566",
            "dpc": "03042318201",
            "name": "ជួន សារឿន"
        },
        {
            "barcode": "171142567",
            "dpc": "03042318301",
            "name": "អៀង សាវន"
        },
        {
            "barcode": "171142568",
            "dpc": "03042318401",
            "name": "ហុន គឹមហាង"
        },
        {
            "barcode": "171142569",
            "dpc": "03042318501",
            "name": "ឈិន សុធារី"
        },
        {
            "barcode": "171142570",
            "dpc": "03042318601",
            "name": "ព្រាប ចំរើន"
        },
        {
            "barcode": "171142571",
            "dpc": "03042318701",
            "name": "អឿន វី"
        },
        {
            "barcode": "171142572",
            "dpc": "03042318801",
            "name": "ពៀវ ណាវី"
        },
        {
            "barcode": "171142573",
            "dpc": "03042318901",
            "name": "ច្រិច ជ្រឿម"
        },
        {
            "barcode": "171142574",
            "dpc": "03042319001",
            "name": "អ៊ឹង នារីរ័ត្ន"
        },
        {
            "barcode": "171142575",
            "dpc": "03042319101",
            "name": "យិន ខេមម៉ា"
        },
        {
            "barcode": "171142576",
            "dpc": "03042319201",
            "name": "អ៊ិត ប៊ុនសូម"
        },
        {
            "barcode": "171142577",
            "dpc": "03042319301",
            "name": "យួម ធឹង"
        },
        {
            "barcode": "171142578",
            "dpc": "03042319401",
            "name": "សែម សឿន"
        },
        {
            "barcode": "171142579",
            "dpc": "03042319501",
            "name": "ប៊ូ ប៉ិច"
        },
        {
            "barcode": "171142580",
            "dpc": "03042319601",
            "name": "ស៊ឹម លីហៀង"
        },
        {
            "barcode": "171142581",
            "dpc": "03042319701",
            "name": "ស៊ឹម លៀងហេង"
        },
        {
            "barcode": "171142582",
            "dpc": "03042319801",
            "name": "រ៉ូ រុំ"
        },
        {
            "barcode": "171142583",
            "dpc": "03042319901",
            "name": "ហែម សុខ"
        },
        {
            "barcode": "171142584",
            "dpc": "03042320001",
            "name": "សៅ សុផល"
        },
        {
            "barcode": "171142585",
            "dpc": "03042320101",
            "name": "ម៉ី សារ៉ាត់"
        },
        {
            "barcode": "171142586",
            "dpc": "03042320201",
            "name": "យួម វ៉ាន់"
        },
        {
            "barcode": "171142587",
            "dpc": "03042320301",
            "name": "ឈឹម វាសនា"
        },
        {
            "barcode": "171142588",
            "dpc": "03042320401",
            "name": "ប្រេម សុខណា"
        },
        {
            "barcode": "171142589",
            "dpc": "03042320501",
            "name": "សៅ រស់"
        },
        {
            "barcode": "171142590",
            "dpc": "03042320601",
            "name": "មេឃ សារឿន"
        },
        {
            "barcode": "171142591",
            "dpc": "03042320701",
            "name": "យ៉ាន់ យឿប"
        },
        {
            "barcode": "171142592",
            "dpc": "03042320801",
            "name": "ជឿម សាវុធ"
        },
        {
            "barcode": "171142593",
            "dpc": "03042320901",
            "name": "ឡុង សេម"
        },
        {
            "barcode": "171142594",
            "dpc": "03042321001",
            "name": "រ៉ូ សារ៉ាន់"
        },
        {
            "barcode": "171142595",
            "dpc": "03042321101",
            "name": "យួម វ៉ាន់ធី"
        },
        {
            "barcode": "171142596",
            "dpc": "03042321201",
            "name": "យួម ធី"
        },
        {
            "barcode": "171142597",
            "dpc": "03042321301",
            "name": "ឃួន សុខណា"
        },
        {
            "barcode": "171142598",
            "dpc": "03042321501",
            "name": "អ៊ិត ញ៉ក់"
        },
        {
            "barcode": "171142599",
            "dpc": "03042321601",
            "name": "អ៊ិត វណ្ណា"
        },
        {
            "barcode": "171142600",
            "dpc": "03042321701",
            "name": "ថាច់ ធី"
        },
        {
            "barcode": "171142601",
            "dpc": "03042321801",
            "name": "ហ៊ាន គឹមលុន"
        },
        {
            "barcode": "171142602",
            "dpc": "03042321901",
            "name": "មុំ បារាំង"
        },
        {
            "barcode": "171142603",
            "dpc": "03042322001",
            "name": "ជេត សោភ័ណ"
        },
        {
            "barcode": "171142604",
            "dpc": "03042322101",
            "name": "ឆ្នៃ សូរីវង្ស"
        },
        {
            "barcode": "171142605",
            "dpc": "03042322201",
            "name": "អំ អឿន"
        },
        {
            "barcode": "171142606",
            "dpc": "03042322301",
            "name": "ជា សាវាត់"
        },
        {
            "barcode": "171142607",
            "dpc": "03042322401",
            "name": "ឃឿម សុខុម"
        },
        {
            "barcode": "171142608",
            "dpc": "03042322501",
            "name": "ស្មិត មាត"
        },
        {
            "barcode": "171142609",
            "dpc": "03042322601",
            "name": "ម៉ក់ ហួន"
        },
        {
            "barcode": "171142610",
            "dpc": "03042322701",
            "name": "យ៉ៃ ប៊ុនឆេន"
        },
        {
            "barcode": "171142611",
            "dpc": "03042322801",
            "name": "ម៉ម ទូច"
        },
        {
            "barcode": "171142612",
            "dpc": "03042322901",
            "name": "ឃី ឌីដាលីន"
        },
        {
            "barcode": "171142613",
            "dpc": "03042329701",
            "name": "ក្រួច ថែម"
        },
        {
            "barcode": "171142614",
            "dpc": "03042323001",
            "name": "ភួង ញ៉ន"
        },
        {
            "barcode": "171142615",
            "dpc": "03042323101",
            "name": "លួង សុម៉ាលី"
        },
        {
            "barcode": "171142616",
            "dpc": "03042304401",
            "name": "លឹម លាង"
        },
        {
            "barcode": "171142617",
            "dpc": "03042342501",
            "name": "យិន គឹមសេង"
        },
        {
            "barcode": "171142618",
            "dpc": "03042323201",
            "name": "មឿន ម៉េង"
        },
        {
            "barcode": "171142619",
            "dpc": "03042323301",
            "name": "គឹម ឈឿង"
        },
        {
            "barcode": "171142620",
            "dpc": "03042317701",
            "name": "ប្រាក់ សុភា"
        },
        {
            "barcode": "171142621",
            "dpc": "03042317801",
            "name": "រ័ត្ន ទី"
        },
        {
            "barcode": "171142622",
            "dpc": "03042317901",
            "name": "សុវណ្ណ ប្រណិត"
        },
        {
            "barcode": "171142623",
            "dpc": "03042338801",
            "name": "សំ ភារំ"
        },
        {
            "barcode": "171142624",
            "dpc": "03042336901",
            "name": "ចាន់ យ៉ា"
        },
        {
            "barcode": "171142625",
            "dpc": "03042334801",
            "name": "ប៊ុន រិទ្ធសុធេប"
        },
        {
            "barcode": "171142626",
            "dpc": "03042318101",
            "name": "ប៊ុន រិទ្ធលន់ដា"
        },
        {
            "barcode": "171142627",
            "dpc": "03042326001",
            "name": "ជួយ តាំង"
        },
        {
            "barcode": "171142628",
            "dpc": "03042326301",
            "name": "ទិត្យ មុន្នីការ"
        },
        {
            "barcode": "171142629",
            "dpc": "03042326401",
            "name": "អាស្រមយាយជី"
        },
        {
            "barcode": "171142630",
            "dpc": "03042326501",
            "name": "លី នីម"
        },
        {
            "barcode": "171142631",
            "dpc": "03042326801",
            "name": "ឈឹម សារ៉ាត់"
        },
        {
            "barcode": "171142632",
            "dpc": "03042331601",
            "name": "ឆែម ចន្ថា"
        },
        {
            "barcode": "171142633",
            "dpc": "03042331701",
            "name": "ឆែម សាម៉ុន"
        },
        {
            "barcode": "171142634",
            "dpc": "03042326901",
            "name": "ទង ស៊្រី"
        },
        {
            "barcode": "171142635",
            "dpc": "03042316301",
            "name": "ឆែម រចនា"
        },
        {
            "barcode": "171142636",
            "dpc": "03042317101",
            "name": "គង់ យូរ៉ា"
        },
        {
            "barcode": "171142637",
            "dpc": "03042317001",
            "name": "អ៊ុយ រុន"
        },
        {
            "barcode": "171142638",
            "dpc": "03042316901",
            "name": "ម៉ៅ លីវ"
        },
        {
            "barcode": "171142639",
            "dpc": "03042316801",
            "name": "ម៉ក់ ថាវី"
        },
        {
            "barcode": "171142640",
            "dpc": "03042316501",
            "name": "គឹម នូ"
        },
        {
            "barcode": "171142641",
            "dpc": "03042316401",
            "name": "កៅ សារឿន"
        },
        {
            "barcode": "171142642",
            "dpc": "03042316701",
            "name": "យី ទិត្យសាធកូរមី"
        },
        {
            "barcode": "171142643",
            "dpc": "03042316601",
            "name": "សយ សារុំ"
        },
        {
            "barcode": "171142644",
            "dpc": "03042316201",
            "name": "យ័ប ហុង"
        },
        {
            "barcode": "171142645",
            "dpc": "03042317201",
            "name": "យឹម ពឿត"
        },
        {
            "barcode": "171142646",
            "dpc": "03042317401",
            "name": "គឹម សុមន"
        },
        {
            "barcode": "171142647",
            "dpc": "03042326701",
            "name": "កឹម សារុំ"
        },
        {
            "barcode": "171142648",
            "dpc": "03042317501",
            "name": "អ៊ិត រ៉ាស៊ី"
        },
        {
            "barcode": "171142649",
            "dpc": "03042346001",
            "name": "កុច រ៉ា ២"
        },
        {
            "barcode": "171142650",
            "dpc": "03042331901",
            "name": "ប៊ិត ជឹម"
        },
        {
            "barcode": "171142651",
            "dpc": "03042318001",
            "name": "ពៅ សាវើយ"
        },
        {
            "barcode": "171142652",
            "dpc": "03042340101",
            "name": "ពៅ សាវើយ ២"
        },
        {
            "barcode": "171142653",
            "dpc": "03042324201",
            "name": "បូរ សុភា"
        },
        {
            "barcode": "171142654",
            "dpc": "03042324601",
            "name": "ញ៉េប សោភ័ណ្ឌ"
        },
        {
            "barcode": "171142655",
            "dpc": "03042324501",
            "name": "ងូវ ញន"
        },
        {
            "barcode": "171142656",
            "dpc": "03042324401",
            "name": "ត្រង់ ពេក"
        },
        {
            "barcode": "171142657",
            "dpc": "03042323901",
            "name": "ចាន់ លីវែង"
        },
        {
            "barcode": "171142658",
            "dpc": "03042323801",
            "name": "សោ ប៊ុនរ៉េត"
        },
        {
            "barcode": "171142659",
            "dpc": "03042323701",
            "name": "ហម រតនា"
        },
        {
            "barcode": "171142660",
            "dpc": "03042323601",
            "name": "ស៊ិន ចំរ៉ាត់"
        },
        {
            "barcode": "171142661",
            "dpc": "03042323501",
            "name": "ញៀន ញុន"
        },
        {
            "barcode": "171142662",
            "dpc": "03042323401",
            "name": "សុខ ចំរើន"
        },
        {
            "barcode": "171142663",
            "dpc": "03042330201",
            "name": "វណ្ណ ចាន់ថា"
        },
        {
            "barcode": "171142664",
            "dpc": "03042342401",
            "name": "ប្រាក់ ស៊ីវន"
        },
        {
            "barcode": "171142665",
            "dpc": "03042324701",
            "name": "ខៀវ ផុន"
        },
        {
            "barcode": "171142666",
            "dpc": "03042324801",
            "name": "ស៊ឹម មួយគង់"
        },
        {
            "barcode": "171142667",
            "dpc": "03042341601",
            "name": "ដេត សារ័ត្ន"
        },
        {
            "barcode": "171142668",
            "dpc": "03042341501",
            "name": "ប៊ុន គឹមស៊ា"
        },
        {
            "barcode": "171142669",
            "dpc": "03042341401",
            "name": "ហួត ស៊ីវ៉ន"
        },
        {
            "barcode": "171142670",
            "dpc": "03042324901",
            "name": "គង់ ប៊ូ"
        },
        {
            "barcode": "171142671",
            "dpc": "03042325001",
            "name": "លាយ សាវែក"
        },
        {
            "barcode": "171142672",
            "dpc": "03042325101",
            "name": "ឡុច សំអឿន"
        },
        {
            "barcode": "171142673",
            "dpc": "03042330901",
            "name": "អេង ដុង"
        },
        {
            "barcode": "171142674",
            "dpc": "03042325201",
            "name": "រី សតបាត់ដំបង"
        },
        {
            "barcode": "171142675",
            "dpc": "03042325301",
            "name": "ចឹក ម៉ុយ"
        },
        {
            "barcode": "171142676",
            "dpc": "03042325401",
            "name": "ហ៊ីយ ថែប"
        },
        {
            "barcode": "171142677",
            "dpc": "03042346701",
            "name": "ពុន ឡាន់"
        },
        {
            "barcode": "171142678",
            "dpc": "03042346601",
            "name": "ឈឿន ប៊ុនលី"
        },
        {
            "barcode": "171142679",
            "dpc": "03042340801",
            "name": "គឹម ហៀង"
        },
        {
            "barcode": "171142680",
            "dpc": "03042325601",
            "name": "អ៊ឹង ហូវ"
        },
        {
            "barcode": "171142681",
            "dpc": "03042325701",
            "name": "គណៈបក្សវត្តគរ"
        },
        {
            "barcode": "171142682",
            "dpc": "03042329801",
            "name": "ដេត ស្រីទូច"
        },
        {
            "barcode": "171142683",
            "dpc": "03042325801",
            "name": "កែវ តាំងយ៉េត"
        },
        {
            "barcode": "171142684",
            "dpc": "03042337001",
            "name": "សុផល សុផានា"
        },
        {
            "barcode": "171142685",
            "dpc": "03042337101",
            "name": "តាំង ចុង"
        },
        {
            "barcode": "171142686",
            "dpc": "03042342801",
            "name": "លិញ ម្លិះ"
        },
        {
            "barcode": "171142687",
            "dpc": "03042342901",
            "name": "យិន រ៉ា"
        },
        {
            "barcode": "171142688",
            "dpc": "03042336001",
            "name": "ស៊ិន សង់អឿប"
        },
        {
            "barcode": "171142689",
            "dpc": "03042344001",
            "name": "ឈៀង ឈៀន"
        },
        {
            "barcode": "171142690",
            "dpc": "03042343901",
            "name": "វង្ស ធានី"
        },
        {
            "barcode": "171142691",
            "dpc": "03042343801",
            "name": "ទឹម សៀកឆេង"
        },
        {
            "barcode": "171142692",
            "dpc": "03042344501",
            "name": "មុំ អួន"
        },
        {
            "barcode": "171142693",
            "dpc": "03042329301",
            "name": "គណៈកម្មាធិការរៀបចំបោះឆ្នោត"
        },
        {
            "barcode": "171142694",
            "dpc": "03042329101",
            "name": "ទឹម ជូនេត្រ"
        },
        {
            "barcode": "171142695",
            "dpc": "03042329001",
            "name": "ផន សុភាព"
        },
        {
            "barcode": "171142696",
            "dpc": "03042328901",
            "name": "ម៉ាន សាម៉ន"
        },
        {
            "barcode": "171142697",
            "dpc": "03042328801",
            "name": "ម៉ន សាវ៉ាត"
        },
        {
            "barcode": "171142698",
            "dpc": "03042328701",
            "name": "ឡុង ផន"
        },
        {
            "barcode": "171142699",
            "dpc": "03042328601",
            "name": "សេក រដ្ឋា"
        },
        {
            "barcode": "171142700",
            "dpc": "03042328501",
            "name": "ឆែម សុឃិន"
        },
        {
            "barcode": "171142701",
            "dpc": "03042328301",
            "name": "កែវ សុផល"
        },
        {
            "barcode": "171142702",
            "dpc": "03042328201",
            "name": "កង ណាវី"
        },
        {
            "barcode": "171142703",
            "dpc": "03042328101",
            "name": "កង វុត្ថា"
        },
        {
            "barcode": "171142704",
            "dpc": "03042328001",
            "name": "កង វណ្ណដា"
        },
        {
            "barcode": "171142705",
            "dpc": "03042327901",
            "name": "កង វណ្ណី"
        },
        {
            "barcode": "171142706",
            "dpc": "03042327701",
            "name": "តាប់ សំណាង"
        },
        {
            "barcode": "171142707",
            "dpc": "03042327601",
            "name": "អ៊ី ស៊ីណែត"
        },
        {
            "barcode": "171142708",
            "dpc": "03042327501",
            "name": "ម៉ៅ សម្បូណ៍"
        },
        {
            "barcode": "171142709",
            "dpc": "03042327401",
            "name": "សួយ សុខាន់"
        },
        {
            "barcode": "171142710",
            "dpc": "03042327301",
            "name": "ម៉ៅ សម្បត្តិ"
        },
        {
            "barcode": "171142711",
            "dpc": "03042327201",
            "name": "រស់ ប៊ុនហែម"
        },
        {
            "barcode": "171142712",
            "dpc": "03042327101",
            "name": "ទូច ចរិយា"
        },
        {
            "barcode": "171142713",
            "dpc": "03042327001",
            "name": "ហេង លីស"
        },
        {
            "barcode": "171142714",
            "dpc": "03042331001",
            "name": "ជា ម៉ូលីកា"
        },
        {
            "barcode": "171142715",
            "dpc": "03042344101",
            "name": "យឹម កូឡា"
        },
        {
            "barcode": "171142716",
            "dpc": "03042341301",
            "name": "ហ៊ុម ប៊ុនឡា"
        },
        {
            "barcode": "171142717",
            "dpc": "03042339901",
            "name": "ញាណ ហាង"
        },
        {
            "barcode": "171142718",
            "dpc": "03042340001",
            "name": "ហង់ ឡាយអៀត២"
        },
        {
            "barcode": "171142719",
            "dpc": "03042335601",
            "name": "គុយ រិសិដ្ឋ"
        },
        {
            "barcode": "171142720",
            "dpc": "03042339201",
            "name": "អៀម ផល្លី"
        },
        {
            "barcode": "171142721",
            "dpc": "03042340401",
            "name": "អ៊ុយ សុទ្ធី"
        },
        {
            "barcode": "171142722",
            "dpc": "03042326601",
            "name": "ភិន ហេង"
        },
        {
            "barcode": "171142723",
            "dpc": "03042340301",
            "name": "ស៊ុត ផារឿន"
        },
        {
            "barcode": "171142724",
            "dpc": "03042339101",
            "name": "ងួន ស្គីដែន"
        },
        {
            "barcode": "171142725",
            "dpc": "03042339001",
            "name": "តុក គឹមស្រ៊ុន"
        },
        {
            "barcode": "171142726",
            "dpc": "03042331501",
            "name": "វ៉ន វឿត"
        },
        {
            "barcode": "171142727",
            "dpc": "03042330701",
            "name": "ឡេង វណ្ណា"
        },
        {
            "barcode": "171142728",
            "dpc": "03042330601",
            "name": "ឈុន សំបូរ័ត្ន"
        },
        {
            "barcode": "171142729",
            "dpc": "03042332001",
            "name": "ឆោម សុធារី"
        },
        {
            "barcode": "171142730",
            "dpc": "03042337501",
            "name": "សេង ចាន់លី"
        },
        {
            "barcode": "171142731",
            "dpc": "03042337201",
            "name": "ជា សុថានិត"
        },
        {
            "barcode": "171142732",
            "dpc": "03042325901",
            "name": "មឿន ឈឿន"
        },
        {
            "barcode": "171142733",
            "dpc": "03042344201",
            "name": "ក្រើក លួត"
        },
        {
            "barcode": "171142734",
            "dpc": "03042335001",
            "name": "ឌិត យ៉ាន"
        },
        {
            "barcode": "171142735",
            "dpc": "03042335101",
            "name": "ថូ ភិន"
        },
        {
            "barcode": "171142736",
            "dpc": "03042335501",
            "name": "គី គុយឡេង"
        },
        {
            "barcode": "171142737",
            "dpc": "03042343001",
            "name": "សេង ប៊ុនន្នី"
        },
        {
            "barcode": "171142738",
            "dpc": "03042345101",
            "name": "លឹម ឡុន"
        },
        {
            "barcode": "171142739",
            "dpc": "03042346201",
            "name": "ស៊ីវ៉ុន ខែមរ៉ុន២"
        },
        {
            "barcode": "171142740",
            "dpc": "03042343101",
            "name": "ភោគ ច័ន្ទសាវុន"
        },
        {
            "barcode": "171142741",
            "dpc": "03042335201",
            "name": "ញាណ កុសល"
        },
        {
            "barcode": "171142742",
            "dpc": "03042343201",
            "name": "វ៉យ គល់"
        },
        {
            "barcode": "171142743",
            "dpc": "03042346301",
            "name": "វាំង សុផល់"
        },
        {
            "barcode": "171142744",
            "dpc": "03042348001",
            "name": "ប៉ាច ផល្លា"
        }
    ];


barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
