let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171148067",
            "dpc": "03012436401",
            "name": "ប៊ុតចាន់ ធី"
        },
        {
            "barcode": "171148068",
            "dpc": "03012436501",
            "name": "ជៀម ផារុំ"
        },
        {
            "barcode": "171148069",
            "dpc": "03012429801",
            "name": "សួន សុផល"
        },
        {
            "barcode": "171148070",
            "dpc": "03012424601",
            "name": "ហេង ឆាយ"
        },
        {
            "barcode": "171148071",
            "dpc": "03012422501",
            "name": "ចាយ បូរាន"
        },
        {
            "barcode": "171148072",
            "dpc": "03012414001",
            "name": "ហាយ ហួត"
        },
        {
            "barcode": "171148073",
            "dpc": "03012427001",
            "name": "លី ទ្រឿង"
        },
        {
            "barcode": "171148074",
            "dpc": "03012427101",
            "name": "ឈៀង គឹមឈួន"
        },
        {
            "barcode": "171148075",
            "dpc": "03012427201",
            "name": "ជី យិន"
        },
        {
            "barcode": "171148076",
            "dpc": "03012413701",
            "name": "ផាន ទិត្យ"
        },
        {
            "barcode": "171148077",
            "dpc": "03012440001",
            "name": "អ៊ុំ ស៊ុយ"
        },
        {
            "barcode": "171148078",
            "dpc": "03012400501",
            "name": "នី ស្រីម៉ៅ"
        },
        {
            "barcode": "171148079",
            "dpc": "03012436001",
            "name": "ដែង វណ្ណនី"
        },
        {
            "barcode": "171148080",
            "dpc": "03012424501",
            "name": "ហេង ចាន់ថន"
        },
        {
            "barcode": "171148081",
            "dpc": "03012406201",
            "name": "លី ហុង"
        },
        {
            "barcode": "171148082",
            "dpc": "03012418601",
            "name": "សាញ់ សាន្ត"
        },
        {
            "barcode": "171148083",
            "dpc": "03012418701",
            "name": "យឹម ផល្លី"
        },
        {
            "barcode": "171148084",
            "dpc": "03012421901",
            "name": "ជឺ សំណាង"
        },
        {
            "barcode": "171148085",
            "dpc": "03012436801",
            "name": "ឆឹង ឆន"
        },
        {
            "barcode": "171148086",
            "dpc": "03012423101",
            "name": "សុខ សុភាព"
        },
        {
            "barcode": "171148087",
            "dpc": "03012422001",
            "name": "ធី សុផន"
        },
        {
            "barcode": "171148088",
            "dpc": "03012429901",
            "name": "ស៊ីម សារី"
        },
        {
            "barcode": "171148089",
            "dpc": "03012403901",
            "name": "ង៉ែត ប្រម"
        },
        {
            "barcode": "171148090",
            "dpc": "03012423001",
            "name": "ប៊ុត សាវង្ស២(អាស្រម)"
        },
        {
            "barcode": "171148091",
            "dpc": "03012430101",
            "name": "ខៀវ សែ"
        },
        {
            "barcode": "171148092",
            "dpc": "03012436101",
            "name": "ហេង កាវជា"
        },
        {
            "barcode": "171148093",
            "dpc": "03012430401",
            "name": "យឿត ស៊ីថា"
        },
        {
            "barcode": "171148094",
            "dpc": "03012414401",
            "name": "យឹម សម្រស់"
        },
        {
            "barcode": "171148095",
            "dpc": "03012442801",
            "name": "យិន ហ៊ាប"
        },
        {
            "barcode": "171148096",
            "dpc": "03012437101",
            "name": "ចាន់ ម៉េង"
        },
        {
            "barcode": "171148097",
            "dpc": "03012430301",
            "name": "កែវ ខឿង"
        },
        {
            "barcode": "171148098",
            "dpc": "03012438701",
            "name": "ណន អុន"
        },
        {
            "barcode": "171148099",
            "dpc": "03012440901",
            "name": "អ៊ា មករា"
        },
        {
            "barcode": "171148100",
            "dpc": "03012420301",
            "name": "ស៊ុន សុផាត"
        },
        {
            "barcode": "171148101",
            "dpc": "03012420401",
            "name": "បេង ចេង"
        },
        {
            "barcode": "171148102",
            "dpc": "03012434301",
            "name": "វង្ស សុខយ៉េម"
        },
        {
            "barcode": "171148103",
            "dpc": "03012437001",
            "name": "ឡុង សំបូរ"
        },
        {
            "barcode": "171148104",
            "dpc": "03012433001",
            "name": "អ៊ុំ វណ្ណៈ"
        },
        {
            "barcode": "171148105",
            "dpc": "03012447001",
            "name": "ចត សុផានី"
        },
        {
            "barcode": "171148106",
            "dpc": "03012436301",
            "name": "សេង សារ៉េត"
        },
        {
            "barcode": "171148107",
            "dpc": "03012446901",
            "name": "សុខ ធូក"
        },
        {
            "barcode": "171148108",
            "dpc": "03012443201",
            "name": "សេង នី"
        },
        {
            "barcode": "171148109",
            "dpc": "03012402301",
            "name": "រ៉ាយ នី"
        },
        {
            "barcode": "171148110",
            "dpc": "03012403001",
            "name": "ឆោម ឆដា"
        },
        {
            "barcode": "171148111",
            "dpc": "03012439301",
            "name": "ប៉ាង គឹមស៊ា"
        },
        {
            "barcode": "171148112",
            "dpc": "03012418901",
            "name": "អយ ដេវី"
        },
        {
            "barcode": "171148113",
            "dpc": "03012430201",
            "name": "ហម សាម៉េត"
        },
        {
            "barcode": "171148114",
            "dpc": "03012414301",
            "name": "ទូច ជឹម"
        },
        {
            "barcode": "171148115",
            "dpc": "03012421701",
            "name": "គង់ ជុនដា"
        },
        {
            "barcode": "171148116",
            "dpc": "03012430701",
            "name": "ជូ កែវពិសិទ្ធ"
        },
        {
            "barcode": "171148117",
            "dpc": "03012414701",
            "name": "ម៉ែន សំបូរ"
        },
        {
            "barcode": "171148118",
            "dpc": "03012430601",
            "name": "អ៊ុច សិទ្ធិ"
        },
        {
            "barcode": "171148119",
            "dpc": "03012400301",
            "name": "ឡុង ផាវុទ្ធីយ៉ា"
        },
        {
            "barcode": "171148120",
            "dpc": "03012447401",
            "name": "លី ស៊ីណា"
        },
        {
            "barcode": "171148121",
            "dpc": "03012424701",
            "name": "លី មន្នី"
        },
        {
            "barcode": "171148122",
            "dpc": "03012413501",
            "name": "នរៈ កិត្យា"
        },
        {
            "barcode": "171148123",
            "dpc": "03012413601",
            "name": "សែម សារ៉ាត់"
        },
        {
            "barcode": "171148124",
            "dpc": "03012411901",
            "name": "លោភ សំអាង"
        },
        {
            "barcode": "171148125",
            "dpc": "03012402101",
            "name": "ប៉ង សុភ័ណ្ឌ"
        },
        {
            "barcode": "171148126",
            "dpc": "03012406001",
            "name": "ឃឹម សុគន្ធា"
        },
        {
            "barcode": "171148127",
            "dpc": "03012405701",
            "name": "រាជ កែវសុវណ្ណៈ"
        },
        {
            "barcode": "171148128",
            "dpc": "03012421001",
            "name": "អ៊ី សេងឡុង"
        },
        {
            "barcode": "171148129",
            "dpc": "03012405801",
            "name": "គង់ សារ៉េត"
        },
        {
            "barcode": "171148130",
            "dpc": "03012413901",
            "name": "តាំង សុខកាង"
        },
        {
            "barcode": "171148131",
            "dpc": "03012438801",
            "name": "អឿន តុញ"
        },
        {
            "barcode": "171148132",
            "dpc": "03012433201",
            "name": "ប្រាក់ ចន្ធូ"
        },
        {
            "barcode": "171148133",
            "dpc": "03012414201",
            "name": "ស៊្រីន សុគន្ធថូ"
        },
        {
            "barcode": "171148134",
            "dpc": "03012414601",
            "name": "ម៉ុន សារិទ្ធ"
        },
        {
            "barcode": "171148135",
            "dpc": "03012414501",
            "name": "មាស ស្រី"
        },
        {
            "barcode": "171148136",
            "dpc": "03012445101",
            "name": "គីវ គឹមផា"
        },
        {
            "barcode": "171148137",
            "dpc": "03012432301",
            "name": "ពេជ្រ សារិទ្ធ"
        },
        {
            "barcode": "171148138",
            "dpc": "03012405901",
            "name": "ប៉ា សុធារី"
        },
        {
            "barcode": "171148139",
            "dpc": "03012430501",
            "name": "អ៊ី រី"
        },
        {
            "barcode": "171148140",
            "dpc": "03012405101",
            "name": "តាំង មុយយូម"
        },
        {
            "barcode": "171148141",
            "dpc": "03012414801",
            "name": "ញេប គង់"
        },
        {
            "barcode": "171148142",
            "dpc": "03012414901",
            "name": "ដូង ស៊ីថា"
        },
        {
            "barcode": "171148143",
            "dpc": "03012423201",
            "name": "ដា ស៊ីដេត"
        },
        {
            "barcode": "171148144",
            "dpc": "03012419101",
            "name": "ម៉ាន់ ប្រុស"
        },
        {
            "barcode": "171148145",
            "dpc": "03012411501",
            "name": "លាង ផាន់ដេត"
        },
        {
            "barcode": "171148146",
            "dpc": "03012411601",
            "name": "សំ ចិន្តា"
        },
        {
            "barcode": "171148147",
            "dpc": "03012413401",
            "name": "ស្រួច លីម"
        },
        {
            "barcode": "171148148",
            "dpc": "03012434401",
            "name": "រស់ អួម"
        },
        {
            "barcode": "171148149",
            "dpc": "03012401601",
            "name": "គឹម អាន ២"
        },
        {
            "barcode": "171148150",
            "dpc": "03012433501",
            "name": "សន សុផល"
        },
        {
            "barcode": "171148151",
            "dpc": "03012426601",
            "name": "ផេង អង"
        },
        {
            "barcode": "171148152",
            "dpc": "03012418801",
            "name": "រាយ សំអាត"
        },
        {
            "barcode": "171148153",
            "dpc": "03012404901",
            "name": "សៅ សំណាង"
        },
        {
            "barcode": "171148154",
            "dpc": "03012427801",
            "name": "អ៊ិន សុឃឿន"
        },
        {
            "barcode": "171148155",
            "dpc": "03012427501",
            "name": "ថន សុភារម្យ"
        },
        {
            "barcode": "171148156",
            "dpc": "03012427601",
            "name": "ថេត នារ័ត្ត"
        },
        {
            "barcode": "171148157",
            "dpc": "03012427701",
            "name": "ភិត ទុន"
        },
        {
            "barcode": "171148158",
            "dpc": "03012442901",
            "name": "ព្រុយ ហ៊ីង"
        },
        {
            "barcode": "171148159",
            "dpc": "03012438901",
            "name": "កើង ស្រីយ៉ា"
        },
        {
            "barcode": "171148160",
            "dpc": "03012436601",
            "name": "ឈុន បូរ៉ា"
        },
        {
            "barcode": "171148161",
            "dpc": "03012433801",
            "name": "ហួន កុសល់"
        },
        {
            "barcode": "171148162",
            "dpc": "03012439801",
            "name": "ចាន់ សម្បត្តិ"
        },
        {
            "barcode": "171148163",
            "dpc": "03012439101",
            "name": "សំ ប្រសិទ្ធ"
        },
        {
            "barcode": "171148164",
            "dpc": "03012439701",
            "name": "ទិត សេដ្ឋា"
        },
        {
            "barcode": "171148165",
            "dpc": "03012447601",
            "name": "ថាច់ សុខពិសី"
        },
        {
            "barcode": "171148166",
            "dpc": "03012433901",
            "name": "មាស ស៊ីណាត"
        },
        {
            "barcode": "171148167",
            "dpc": "03012404101",
            "name": "ណៃ រតនា"
        },
        {
            "barcode": "171148168",
            "dpc": "03012447901",
            "name": "ភិន ណៃ"
        },
        {
            "barcode": "171148169",
            "dpc": "03012447501",
            "name": "ញៀវ ញឹម"
        },
        {
            "barcode": "171148170",
            "dpc": "03012427901",
            "name": "ប៉ោ វ៉ាត"
        },
        {
            "barcode": "171148171",
            "dpc": "03012413301",
            "name": "នូ សាណាល់"
        },
        {
            "barcode": "171148172",
            "dpc": "03012440101",
            "name": "តាន់ វឌ្ឍនី"
        },
        {
            "barcode": "171148173",
            "dpc": "03012440201",
            "name": "ពេញ ដារ៉ារដ្ឋ"
        },
        {
            "barcode": "171148174",
            "dpc": "03012440301",
            "name": "គឹម សង្ហា"
        },
        {
            "barcode": "171148175",
            "dpc": "03012440401",
            "name": "សែប សុផល"
        },
        {
            "barcode": "171148176",
            "dpc": "03012440501",
            "name": "ហូរ រិម"
        },
        {
            "barcode": "171148177",
            "dpc": "03012445601",
            "name": "ញ៉ូវ ចាន់រ៉ា"
        },
        {
            "barcode": "171148178",
            "dpc": "03012440701",
            "name": "ពេជ្រ សុខប៉ូ"
        },
        {
            "barcode": "171148179",
            "dpc": "03012440801",
            "name": "លឹម សុធី"
        },
        {
            "barcode": "171148180",
            "dpc": "03012447201",
            "name": "រ៉ុង ស៊ីដែន"
        },
        {
            "barcode": "171148181",
            "dpc": "03012436201",
            "name": "គឿន រ៉ូម៉ា"
        },
        {
            "barcode": "171148182",
            "dpc": "03012405301",
            "name": "ឡុង ប៊ុនសេង"
        },
        {
            "barcode": "171148183",
            "dpc": "03012427301",
            "name": "ព្រហ្ម សម្បត្តិ"
        },
        {
            "barcode": "171148184",
            "dpc": "03012405401",
            "name": "ជឺ សុខា"
        },
        {
            "barcode": "171148185",
            "dpc": "03012432501",
            "name": "វ៉ាត ស៊ីម"
        },
        {
            "barcode": "171148186",
            "dpc": "03012400401",
            "name": "ឡេង ពៅ"
        },
        {
            "barcode": "171148187",
            "dpc": "03012400601",
            "name": "គឹម ពន្លក"
        },
        {
            "barcode": "171148188",
            "dpc": "03012400701",
            "name": "សុខ សេង"
        },
        {
            "barcode": "171148189",
            "dpc": "03012401101",
            "name": "ហុង ហ៊"
        },
        {
            "barcode": "171148190",
            "dpc": "03012401501",
            "name": "ទូច គឹមសាន"
        },
        {
            "barcode": "171148191",
            "dpc": "03012402901",
            "name": "ហេង ណារិទ្ធ"
        },
        {
            "barcode": "171148192",
            "dpc": "03012404001",
            "name": "ស៊ុម សំណាង"
        },
        {
            "barcode": "171148193",
            "dpc": "03012404701",
            "name": "ឃុន វ៉ាន់ថា"
        },
        {
            "barcode": "171148194",
            "dpc": "03012405001",
            "name": "ស៊ីម ឡៃ"
        },
        {
            "barcode": "171148195",
            "dpc": "03012407601",
            "name": "ប៊ូ ប៊ុនសុង"
        },
        {
            "barcode": "171148196",
            "dpc": "03012408201",
            "name": "ភិន ស៊ីដែន"
        },
        {
            "barcode": "171148197",
            "dpc": "03012409901",
            "name": "ឥន សុវណ្ណា"
        },
        {
            "barcode": "171148198",
            "dpc": "03012411301",
            "name": "អ៊ូ វ៉ាន់ធឿន"
        },
        {
            "barcode": "171148199",
            "dpc": "03012411401",
            "name": "ឈៀង សុភី"
        },
        {
            "barcode": "171148200",
            "dpc": "03012413001",
            "name": "អូច អែម"
        },
        {
            "barcode": "171148201",
            "dpc": "03012415901",
            "name": "ភីវ ចំរើន"
        },
        {
            "barcode": "171148202",
            "dpc": "03012416101",
            "name": "ឈុន សម្បត្តិ"
        },
        {
            "barcode": "171148203",
            "dpc": "03012416601",
            "name": "ទូច មករា"
        },
        {
            "barcode": "171148204",
            "dpc": "03012418001",
            "name": "គង់ បណ្តូល"
        },
        {
            "barcode": "171148205",
            "dpc": "03012418201",
            "name": "លឿង សុភក្ត្រ័"
        },
        {
            "barcode": "171148206",
            "dpc": "03012418401",
            "name": "ចែម ធី"
        },
        {
            "barcode": "171148207",
            "dpc": "03012419201",
            "name": "សែម ទូច"
        },
        {
            "barcode": "171148208",
            "dpc": "03012419401",
            "name": "រ៉ែម បូរ៉ា"
        },
        {
            "barcode": "171148209",
            "dpc": "03012419601",
            "name": "អំ ផល្លី"
        },
        {
            "barcode": "171148210",
            "dpc": "03012419701",
            "name": "លី ហុង"
        },
        {
            "barcode": "171148211",
            "dpc": "03012420101",
            "name": "ប៉ិច ជិនដារ៉ា"
        },
        {
            "barcode": "171148212",
            "dpc": "03012420201",
            "name": "តាន់ ស៊ុនលាង"
        },
        {
            "barcode": "171148213",
            "dpc": "03012421301",
            "name": "ឈួរ ម៉េងឆ័រ"
        },
        {
            "barcode": "171148214",
            "dpc": "03012421601",
            "name": "សេង ដាវ៉ីត"
        },
        {
            "barcode": "171148215",
            "dpc": "03012422101",
            "name": "អួង ណារ៉ុម"
        },
        {
            "barcode": "171148216",
            "dpc": "03012422201",
            "name": "ឆាត់ ឆាយមោរ៉ា"
        },
        {
            "barcode": "171148217",
            "dpc": "03012422301",
            "name": "លត យ៉ុម"
        },
        {
            "barcode": "171148218",
            "dpc": "03012422401",
            "name": "ទូត រុំម្លាស់ ២"
        },
        {
            "barcode": "171148219",
            "dpc": "03012423501",
            "name": "ឃឿង ហ៊ួ"
        },
        {
            "barcode": "171148220",
            "dpc": "03012423901",
            "name": "សុខ សូនី"
        },
        {
            "barcode": "171148221",
            "dpc": "03012426101",
            "name": "ម៉ិល ស៊ុត"
        },
        {
            "barcode": "171148222",
            "dpc": "03012426701",
            "name": "តាំង សៀងហៃ"
        },
        {
            "barcode": "171148223",
            "dpc": "03012428801",
            "name": "ឆេង ប៊ុនថេង"
        },
        {
            "barcode": "171148224",
            "dpc": "03012428901",
            "name": "បឿន យិក"
        },
        {
            "barcode": "171148225",
            "dpc": "03012429401",
            "name": "ឃីម ប៊ុនផេង"
        },
        {
            "barcode": "171148226",
            "dpc": "03012429501",
            "name": "គាំ សុផល"
        },
        {
            "barcode": "171148227",
            "dpc": "03012429601",
            "name": "គង់ រុំ"
        },
        {
            "barcode": "171148228",
            "dpc": "03012430001",
            "name": "ងី ឡាក់"
        },
        {
            "barcode": "171148229",
            "dpc": "03012431801",
            "name": "ធី ហ៊ួរ"
        },
        {
            "barcode": "171148230",
            "dpc": "03012432201",
            "name": "វ៉ា មុន្នីរដ្ឋ"
        },
        {
            "barcode": "171148231",
            "dpc": "03012432901",
            "name": "យ៉ម ចំរើន"
        },
        {
            "barcode": "171148232",
            "dpc": "03012433601",
            "name": "ជា ផល្លា"
        },
        {
            "barcode": "171148233",
            "dpc": "03012434001",
            "name": "ប៊ុន សួលាងសុង"
        },
        {
            "barcode": "171148234",
            "dpc": "03012435701",
            "name": "ម៉ៅ ធីតា"
        },
        {
            "barcode": "171148235",
            "dpc": "03012436701",
            "name": "អឿម ចាន់ណារដ្ឋ"
        },
        {
            "barcode": "171148236",
            "dpc": "03012437201",
            "name": "មុំ ធីយ៉ា"
        },
        {
            "barcode": "171148237",
            "dpc": "03012437301",
            "name": "គឹម សុខសាន្ត"
        },
        {
            "barcode": "171148238",
            "dpc": "03012437401",
            "name": "ឡុង ពៅ"
        },
        {
            "barcode": "171148239",
            "dpc": "03012438501",
            "name": "ណៃ សុឃាង"
        },
        {
            "barcode": "171148240",
            "dpc": "03012439501",
            "name": "ផុន វណ្ណនិត"
        },
        {
            "barcode": "171148241",
            "dpc": "03012439901",
            "name": "អ៊ុង យឿន"
        },
        {
            "barcode": "171148242",
            "dpc": "03012440601",
            "name": "នូ ផល្លី"
        },
        {
            "barcode": "171148243",
            "dpc": "03012441101",
            "name": "ទី សុភិន"
        },
        {
            "barcode": "171148244",
            "dpc": "03012441701",
            "name": "អ៊ាន ធឿន"
        },
        {
            "barcode": "171148245",
            "dpc": "03012442201",
            "name": "សាលាបឋមសិក្សាអន្លង់វិល"
        },
        {
            "barcode": "171148246",
            "dpc": "03012442301",
            "name": "លី រតនៈ"
        },
        {
            "barcode": "171148247",
            "dpc": "03012442501",
            "name": "សុខ សាមុត"
        },
        {
            "barcode": "171148248",
            "dpc": "03012442601",
            "name": "ទិត លីនដា ២"
        },
        {
            "barcode": "171148249",
            "dpc": "03012442701",
            "name": "បេ បេត"
        },
        {
            "barcode": "171148250",
            "dpc": "03012443001",
            "name": "មាស កុយ"
        },
        {
            "barcode": "171148251",
            "dpc": "03012443601",
            "name": "លឿង សុតុល"
        },
        {
            "barcode": "171148252",
            "dpc": "03012444301",
            "name": "ប្រុក គឿន ៤"
        },
        {
            "barcode": "171148253",
            "dpc": "03012444801",
            "name": "ម៉ែន ផាត"
        },
        {
            "barcode": "171148254",
            "dpc": "03012444901",
            "name": "ហង់ បូរីណា"
        },
        {
            "barcode": "171148255",
            "dpc": "03012445201",
            "name": "ញ៉ុក ចំរើន"
        },
        {
            "barcode": "171148256",
            "dpc": "03012445301",
            "name": "ម៉ែន ផល្លី"
        },
        {
            "barcode": "171148257",
            "dpc": "03012445401",
            "name": "ងួន ហ្សឺឌី"
        },
        {
            "barcode": "171148258",
            "dpc": "03012445501",
            "name": "វែង គឹមលី"
        },
        {
            "barcode": "171148259",
            "dpc": "03012445901",
            "name": "ខាត់ ហ៊ួរ"
        },
        {
            "barcode": "171148260",
            "dpc": "03012446501",
            "name": "សិទ្ធិ ហុងស៊ិន"
        },
        {
            "barcode": "171148261",
            "dpc": "03012447101",
            "name": "ទី សុខ"
        },
        {
            "barcode": "171148262",
            "dpc": "03012447701",
            "name": "នុន សំបូរ"
        },
        {
            "barcode": "171148263",
            "dpc": "03012447801",
            "name": "លី យ៉ាត"
        },
        {
            "barcode": "171148264",
            "dpc": "03012418101",
            "name": "ប៊ុន រ៉ាឌី"
        },
        {
            "barcode": "171148265",
            "dpc": "03012434701",
            "name": "ឈឹន ឈុន"
        },
        {
            "barcode": "171148266",
            "dpc": "03012402001",
            "name": "អៀប ផាត"
        },
        {
            "barcode": "171148267",
            "dpc": "03012443501",
            "name": "អនសុខម៉ាលភាព ២"
        },
        {
            "barcode": "171148268",
            "dpc": "03012420801",
            "name": "ងិន ពៅ"
        },
        {
            "barcode": "171148269",
            "dpc": "03012443401",
            "name": "ហួត ឆេងលី"
        },
        {
            "barcode": "171148270",
            "dpc": "03012429201",
            "name": "លួង ប្រាថ្នា"
        },
        {
            "barcode": "171148271",
            "dpc": "03012433101",
            "name": "ង៉ែត ផារិន"
        },
        {
            "barcode": "171148272",
            "dpc": "03012441001",
            "name": "ទុំ ស៊ីណាត"
        },
        {
            "barcode": "171148273",
            "dpc": "03012445701",
            "name": "ស៊ុយ សំណាង"
        },
        {
            "barcode": "171148274",
            "dpc": "03012412301",
            "name": "ទិត្យ ចន្នី"
        },
        {
            "barcode": "171148275",
            "dpc": "03012434901",
            "name": "មល់ សាហឿម"
        },
        {
            "barcode": "171148276",
            "dpc": "03012438201",
            "name": "ហ៊ុន ហ៊ី"
        },
        {
            "barcode": "171148277",
            "dpc": "03012438601",
            "name": "ជួន សុផុន"
        },
        {
            "barcode": "171148278",
            "dpc": "03012403101",
            "name": "ពេជ្រ ស្រីកែវ"
        },
        {
            "barcode": "171148279",
            "dpc": "03012445801",
            "name": "វុត ស៊ីនួន"
        },
        {
            "barcode": "171148280",
            "dpc": "03012420701",
            "name": "អៀប រដ្ឋា"
        },
        {
            "barcode": "171148281",
            "dpc": "03012402201",
            "name": "ឡុង ប៊ុនម៉េង"
        },
        {
            "barcode": "171148282",
            "dpc": "03012424901",
            "name": "ម៉ី អេង"
        },
        {
            "barcode": "171148283",
            "dpc": "03012406101",
            "name": "គី ឋាមរ៉ា"
        },
        {
            "barcode": "171148284",
            "dpc": "03012432401",
            "name": "តាង ម៉ារីន"
        },
        {
            "barcode": "171148285",
            "dpc": "03012422801",
            "name": "រឿម កង"
        },
        {
            "barcode": "171148286",
            "dpc": "03012415801",
            "name": "ពុំ ភិរម្យ"
        },
        {
            "barcode": "171148287",
            "dpc": "03012438401",
            "name": "យ៉ាំ ចិត្រា"
        },
        {
            "barcode": "171148288",
            "dpc": "03012415501",
            "name": "ឡាំង លីអៀង"
        },
        {
            "barcode": "171148289",
            "dpc": "03012444601",
            "name": "ភឿក ឡុងឌី"
        },
        {
            "barcode": "171148290",
            "dpc": "03012415701",
            "name": "អ៊ុំ អង"
        },
        {
            "barcode": "171148291",
            "dpc": "03012444701",
            "name": "ឡុង ម៉ារ៉ា"
        },
        {
            "barcode": "171148292",
            "dpc": "03012404201",
            "name": "លី ហេង"
        },
        {
            "barcode": "171148293",
            "dpc": "03012402401",
            "name": "សួន ស៊ីន"
        },
        {
            "barcode": "171148294",
            "dpc": "03012439001",
            "name": "ទូច ផានី"
        },
        {
            "barcode": "171148295",
            "dpc": "03012430901",
            "name": "ព្រំ ឈឺន"
        },
        {
            "barcode": "171148296",
            "dpc": "03012431001",
            "name": "ឆាយ រិទ្ធី"
        },
        {
            "barcode": "171148297",
            "dpc": "03012431101",
            "name": "ទូច ចានណារី"
        },
        {
            "barcode": "171148298",
            "dpc": "03012412401",
            "name": "សយ វ័យ"
        },
        {
            "barcode": "171148299",
            "dpc": "03012435101",
            "name": "ពេជ្រ សុភា"
        },
        {
            "barcode": "171148300",
            "dpc": "03012438101",
            "name": "ឡាយ វ៉ិត"
        },
        {
            "barcode": "171148301",
            "dpc": "03012435001",
            "name": "អ៊ុក សុវណ្ណ"
        },
        {
            "barcode": "171148302",
            "dpc": "03012412801",
            "name": "ប៊ូ សុជាត"
        },
        {
            "barcode": "171148303",
            "dpc": "03012438301",
            "name": "ហួន ចិត្រា"
        },
        {
            "barcode": "171148304",
            "dpc": "03012438001",
            "name": "សុខ នឿន"
        },
        {
            "barcode": "171148305",
            "dpc": "03012425101",
            "name": "ខេង ផល្លា"
        },
        {
            "barcode": "171148306",
            "dpc": "03012412701",
            "name": "រស វិចិត្រ"
        },
        {
            "barcode": "171148307",
            "dpc": "03012412601",
            "name": "យុត សោភ័ណ្ឌ"
        },
        {
            "barcode": "171148308",
            "dpc": "03012403201",
            "name": "ពេជ្រ សេរីទុំ"
        },
        {
            "barcode": "171148309",
            "dpc": "03012444401",
            "name": "សាន់ សល់"
        },
        {
            "barcode": "171148310",
            "dpc": "03012412901",
            "name": "ឆាយ សេរី"
        },
        {
            "barcode": "171148311",
            "dpc": "03012400901",
            "name": "ចូត ប៊ុនណាវី"
        },
        {
            "barcode": "171148312",
            "dpc": "03012434801",
            "name": "នូ គឹមស៊ុង"
        },
        {
            "barcode": "171148313",
            "dpc": "03012405601",
            "name": "ហាក់ ស៊ី"
        },
        {
            "barcode": "171148314",
            "dpc": "03012444501",
            "name": "ប៉ុញ សុវណ្ណរិទ្ធ ២"
        },
        {
            "barcode": "171148315",
            "dpc": "03012405501",
            "name": "ឆែម ប៊ុនធឿន"
        },
        {
            "barcode": "171148316",
            "dpc": "03012417401",
            "name": "អុក គីមឡា"
        },
        {
            "barcode": "171148317",
            "dpc": "03012417501",
            "name": "ឈុន សារិទ្ធ"
        },
        {
            "barcode": "171148318",
            "dpc": "03012428501",
            "name": "ឃឿង តាន់ ១"
        },
        {
            "barcode": "171148319",
            "dpc": "03012428401",
            "name": "អ៊ឹង គឺ"
        },
        {
            "barcode": "171148320",
            "dpc": "03012428301",
            "name": "ធូរ៉េ វត្តី ២"
        },
        {
            "barcode": "171148321",
            "dpc": "03012412001",
            "name": "លី សុផល"
        },
        {
            "barcode": "171148322",
            "dpc": "03012419901",
            "name": "ឆុន សុភាព"
        },
        {
            "barcode": "171148323",
            "dpc": "03012428201",
            "name": "ខេង សុធា"
        },
        {
            "barcode": "171148324",
            "dpc": "03012443301",
            "name": "អ៊ុច សាវន"
        },
        {
            "barcode": "171148325",
            "dpc": "03012404601",
            "name": "យឿន ប៊ុនធី"
        },
        {
            "barcode": "171148326",
            "dpc": "03012416001",
            "name": "លី ហាក"
        },
        {
            "barcode": "171148327",
            "dpc": "03012402801",
            "name": "ឈឹម សារ៉ន"
        },
        {
            "barcode": "171148328",
            "dpc": "03012408501",
            "name": "ងិន សាវុន"
        },
        {
            "barcode": "171148329",
            "dpc": "03012419001",
            "name": "លៀង ហួត"
        },
        {
            "barcode": "171148330",
            "dpc": "03012408601",
            "name": "ម៉ែន ឆាយ"
        },
        {
            "barcode": "171148331",
            "dpc": "03012408801",
            "name": "ចាន សាវ៉ន"
        },
        {
            "barcode": "171148332",
            "dpc": "03012408901",
            "name": "ខៀវ សាវឿន"
        },
        {
            "barcode": "171148333",
            "dpc": "03012409001",
            "name": "ថន ប៊ុនថុង"
        },
        {
            "barcode": "171148334",
            "dpc": "03012409101",
            "name": "អ៊ុយ ម៉ៃ"
        },
        {
            "barcode": "171148335",
            "dpc": "03012409201",
            "name": "សុខ ប៊ុនធឿន"
        },
        {
            "barcode": "171148336",
            "dpc": "03012409301",
            "name": "ពៅ ឃួន"
        },
        {
            "barcode": "171148337",
            "dpc": "03012409401",
            "name": "ពៅ ហ៊ុច"
        },
        {
            "barcode": "171148338",
            "dpc": "03012409501",
            "name": "ង៉ែត សុភ័ណ"
        },
        {
            "barcode": "171148339",
            "dpc": "03012409601",
            "name": "អួម សុភាព"
        },
        {
            "barcode": "171148340",
            "dpc": "03012410201",
            "name": "ស៊ុន សុភាព"
        },
        {
            "barcode": "171148341",
            "dpc": "03012410101",
            "name": "ផុន ស៊ីណាត"
        },
        {
            "barcode": "171148342",
            "dpc": "03012413801",
            "name": "ចាន ស៊ីថា"
        },
        {
            "barcode": "171148343",
            "dpc": "03012410001",
            "name": "ប្រាក់ យ៉ា"
        },
        {
            "barcode": "171148344",
            "dpc": "03012410301",
            "name": "សូ ចាន់ថា"
        },
        {
            "barcode": "171148345",
            "dpc": "03012409801",
            "name": "ពៅ វី"
        },
        {
            "barcode": "171148346",
            "dpc": "03012409701",
            "name": "ឡុង ខុន"
        },
        {
            "barcode": "171148347",
            "dpc": "03012402501",
            "name": "សុខ ធឹមហ៊ាង"
        },
        {
            "barcode": "171148348",
            "dpc": "03012402601",
            "name": "ព្រាប សុប៊ុន"
        },
        {
            "barcode": "171148349",
            "dpc": "03012402701",
            "name": "ផាត ភូន"
        },
        {
            "barcode": "171148350",
            "dpc": "03012408001",
            "name": "ជឹម វីតា"
        },
        {
            "barcode": "171148351",
            "dpc": "03012411801",
            "name": "ម៉េង លាង"
        },
        {
            "barcode": "171148352",
            "dpc": "03012401201",
            "name": "អាន សារាយ"
        },
        {
            "barcode": "171148353",
            "dpc": "03012408101",
            "name": "សំរិត គឹម"
        },
        {
            "barcode": "171148354",
            "dpc": "03012401001",
            "name": "យ៉ាង យ៉ុង"
        },
        {
            "barcode": "171148355",
            "dpc": "03012426401",
            "name": "សុខ សុផុន"
        },
        {
            "barcode": "171148356",
            "dpc": "03012407401",
            "name": "ឡី ស៊ីណា"
        },
        {
            "barcode": "171148357",
            "dpc": "03012407301",
            "name": "ថេន សុក្ខៈ"
        },
        {
            "barcode": "171148358",
            "dpc": "03012407201",
            "name": "ថេន ស្រីរុំ"
        },
        {
            "barcode": "171148359",
            "dpc": "03012407101",
            "name": "សាលសហគមន័"
        },
        {
            "barcode": "171148360",
            "dpc": "03012407001",
            "name": "ឈួត បូរី"
        },
        {
            "barcode": "171148361",
            "dpc": "03012406901",
            "name": "ទុយ សាវ៉ាត"
        },
        {
            "barcode": "171148362",
            "dpc": "03012407801",
            "name": "កង អាត"
        },
        {
            "barcode": "171148363",
            "dpc": "03012407701",
            "name": "ឈឹម គី"
        },
        {
            "barcode": "171148364",
            "dpc": "03012426901",
            "name": "លី ឡាង"
        },
        {
            "barcode": "171148365",
            "dpc": "03012406801",
            "name": "ផែង ផាត"
        },
        {
            "barcode": "171148366",
            "dpc": "03012407501",
            "name": "កង សារី"
        },
        {
            "barcode": "171148367",
            "dpc": "03012406701",
            "name": "ហែល រតនា"
        },
        {
            "barcode": "171148368",
            "dpc": "03012401901",
            "name": "ទូច សោភ័ណ"
        },
        {
            "barcode": "171148369",
            "dpc": "03012426801",
            "name": "ឆាន់ សូភី"
        },
        {
            "barcode": "171148370",
            "dpc": "03012401701",
            "name": "លឿង ពៅ"
        },
        {
            "barcode": "171148371",
            "dpc": "03012406601",
            "name": "ប៊ី សុភាព"
        },
        {
            "barcode": "171148372",
            "dpc": "03012406501",
            "name": "រឿន ផល"
        },
        {
            "barcode": "171148373",
            "dpc": "03012406401",
            "name": "ហម ថៃ"
        },
        {
            "barcode": "171148374",
            "dpc": "03012429001",
            "name": "សាត ធីដា"
        },
        {
            "barcode": "171148375",
            "dpc": "03012406301",
            "name": "សឿន ម៉េងទ្រី"
        },
        {
            "barcode": "171148376",
            "dpc": "03012421801",
            "name": "លី សុវណ្ណនី"
        },
        {
            "barcode": "171148377",
            "dpc": "03012429701",
            "name": "អ៊ុំ ឆៃ"
        },
        {
            "barcode": "171148378",
            "dpc": "03012408401",
            "name": "ហម សាឃឿន"
        },
        {
            "barcode": "171148379",
            "dpc": "03012426501",
            "name": "ង៉ែត សុខនី"
        },
        {
            "barcode": "171148380",
            "dpc": "03012429101",
            "name": "ហ៊ាវ រិទ្ធី"
        },
        {
            "barcode": "171148381",
            "dpc": "03012407901",
            "name": "ជ័យ សុភាព"
        },
        {
            "barcode": "171148382",
            "dpc": "03012439401",
            "name": "បឹង កូឡាប"
        },
        {
            "barcode": "171148383",
            "dpc": "03012417201",
            "name": "សុខ ចាន់រិទ្ធី"
        },
        {
            "barcode": "171148384",
            "dpc": "03012414101",
            "name": "សាំង ប៊ុនថេន"
        },
        {
            "barcode": "171148385",
            "dpc": "03012433401",
            "name": "ជា សៀ"
        },
        {
            "barcode": "171148386",
            "dpc": "03012433301",
            "name": "ហែម សុផល"
        },
        {
            "barcode": "171148387",
            "dpc": "03012417301",
            "name": "ជា គឹមលី"
        },
        {
            "barcode": "171148388",
            "dpc": "03012423401",
            "name": "ប្រាក់ សៅវីរី"
        },
        {
            "barcode": "171148389",
            "dpc": "03012423301",
            "name": "ប្រាក់ សុភាព"
        },
        {
            "barcode": "171148390",
            "dpc": "03012446201",
            "name": "វ៉ា ដារិន"
        },
        {
            "barcode": "171148391",
            "dpc": "03012441201",
            "name": "ទូច សូភី"
        },
        {
            "barcode": "171148392",
            "dpc": "03012429301",
            "name": "ឈុយ ឆៃយ៉ា"
        },
        {
            "barcode": "171148393",
            "dpc": "03012434201",
            "name": "ចាន់ ចិន្ថា"
        },
        {
            "barcode": "171148394",
            "dpc": "03012434101",
            "name": "កែន ទុយ"
        },
        {
            "barcode": "171148395",
            "dpc": "03012443101",
            "name": "សាលារៀន ១៣មករា"
        },
        {
            "barcode": "171148396",
            "dpc": "03012439201",
            "name": "យ៉ាល សំអ៊ុល"
        },
        {
            "barcode": "171148397",
            "dpc": "03012435901",
            "name": "ថេន ព្រលឹង"
        },
        {
            "barcode": "171148398",
            "dpc": "03012424301",
            "name": "គឹម សុធារ៉ា"
        },
        {
            "barcode": "171148399",
            "dpc": "03012434501",
            "name": "ចេង សំណាង"
        },
        {
            "barcode": "171148400",
            "dpc": "03012416201",
            "name": "សែម គឹមហ៊ាត"
        },
        {
            "barcode": "171148401",
            "dpc": "03012416301",
            "name": "ឃៀង គន្ធា"
        },
        {
            "barcode": "171148402",
            "dpc": "03012416401",
            "name": "ចាន់ ថុល"
        },
        {
            "barcode": "171148403",
            "dpc": "03012422601",
            "name": "សុ ជីវី"
        },
        {
            "barcode": "171148404",
            "dpc": "03012416501",
            "name": "ជឹម គង្គា"
        },
        {
            "barcode": "171148405",
            "dpc": "03012416701",
            "name": "ឆេង ស៊ីម៉ន"
        },
        {
            "barcode": "171148406",
            "dpc": "03012410401",
            "name": "លី គន្ធា"
        },
        {
            "barcode": "171148407",
            "dpc": "03012410501",
            "name": "អ៊ុំ សុភ័ក្រ"
        },
        {
            "barcode": "171148408",
            "dpc": "03012410601",
            "name": "សូ ហេង"
        },
        {
            "barcode": "171148409",
            "dpc": "03012410701",
            "name": "ព្រំ ភា"
        },
        {
            "barcode": "171148410",
            "dpc": "03012410901",
            "name": "វ៉ាន ថន"
        },
        {
            "barcode": "171148411",
            "dpc": "03012411001",
            "name": "វ៉ន ជៀន"
        },
        {
            "barcode": "171148412",
            "dpc": "03012411701",
            "name": "លី ហាក់"
        },
        {
            "barcode": "171148413",
            "dpc": "03012422701",
            "name": "សុខ សាត"
        },
        {
            "barcode": "171148414",
            "dpc": "03012422901",
            "name": "យ៉ា បូណា"
        },
        {
            "barcode": "171148415",
            "dpc": "03012443801",
            "name": "ឈួយ ណារ៉ែត"
        },
        {
            "barcode": "171148416",
            "dpc": "03012403301",
            "name": "ម៉ុក សុផាណារ៉ា"
        },
        {
            "barcode": "171148417",
            "dpc": "03012431201",
            "name": "ថង ធី"
        },
        {
            "barcode": "171148418",
            "dpc": "03012424201",
            "name": "យីវ ទូច"
        },
        {
            "barcode": "171148419",
            "dpc": "03012426201",
            "name": "ហេង វាតកំសត់"
        },
        {
            "barcode": "171148420",
            "dpc": "03012435501",
            "name": "ហួន ពៅ"
        },
        {
            "barcode": "171148421",
            "dpc": "03012417901",
            "name": "ហូ ច័ន្ទពិសី"
        },
        {
            "barcode": "171148422",
            "dpc": "03012425601",
            "name": "ធី សារ៉ាត់"
        },
        {
            "barcode": "171148423",
            "dpc": "03012425701",
            "name": "ពេជ្រ ដារ៉ារិទ្ធ"
        },
        {
            "barcode": "171148424",
            "dpc": "03012416801",
            "name": "អ៊ុំ ឡុញ"
        },
        {
            "barcode": "171148425",
            "dpc": "03012416901",
            "name": "អែម សេង"
        },
        {
            "barcode": "171148426",
            "dpc": "03012417001",
            "name": "ខែម សារ៉ុម"
        },
        {
            "barcode": "171148427",
            "dpc": "03012417101",
            "name": "ចាន់ កូ"
        },
        {
            "barcode": "171148428",
            "dpc": "03012423601",
            "name": "ប៉ុក គឹមលៀម"
        },
        {
            "barcode": "171148429",
            "dpc": "03012420901",
            "name": "ឡាយ គន្ធា"
        },
        {
            "barcode": "171148430",
            "dpc": "03012435601",
            "name": "អឿន សុឡេង"
        },
        {
            "barcode": "171148431",
            "dpc": "03012419301",
            "name": "មិន លីហួរ"
        },
        {
            "barcode": "171148432",
            "dpc": "03012417601",
            "name": "ពៅ វិរៈ ១"
        },
        {
            "barcode": "171148433",
            "dpc": "03012417701",
            "name": "ពៅ វិរៈ ២"
        },
        {
            "barcode": "171148434",
            "dpc": "03012442401",
            "name": "អែម សារ៉េត"
        },
        {
            "barcode": "171148435",
            "dpc": "03012424001",
            "name": "ខេង ពិសិដ្ឋ"
        },
        {
            "barcode": "171148436",
            "dpc": "03012446001",
            "name": "សយ សានី"
        },
        {
            "barcode": "171148437",
            "dpc": "03012425401",
            "name": "ឃុត ស៊ីម"
        },
        {
            "barcode": "171148438",
            "dpc": "03012425501",
            "name": "សាន្ត សារិន"
        },
        {
            "barcode": "171148439",
            "dpc": "03012425301",
            "name": "ទូច យ៉េត"
        },
        {
            "barcode": "171148440",
            "dpc": "03012425001",
            "name": "យាន រិទ្ធីវង្ស"
        },
        {
            "barcode": "171148441",
            "dpc": "03012444201",
            "name": "អេង សុភី"
        },
        {
            "barcode": "171148442",
            "dpc": "03012425201",
            "name": "រី រ័ត្ន"
        },
        {
            "barcode": "171148443",
            "dpc": "03012446101",
            "name": "ង៉ែត សាម៉ៃ"
        },
        {
            "barcode": "171148444",
            "dpc": "03012444001",
            "name": "គង់ ឈួន"
        },
        {
            "barcode": "171148445",
            "dpc": "03012423801",
            "name": "លាម សុឃឿម"
        },
        {
            "barcode": "171148446",
            "dpc": "03012412201",
            "name": "ឆម ភិរុណ"
        },
        {
            "barcode": "171148447",
            "dpc": "03012432801",
            "name": "ផាន់ ណារិទ្ធ"
        },
        {
            "barcode": "171148448",
            "dpc": "03012415601",
            "name": "ឈៀង រឿត"
        },
        {
            "barcode": "171148449",
            "dpc": "03012443901",
            "name": "អូន ចាន់ណារី"
        },
        {
            "barcode": "171148450",
            "dpc": "03012412101",
            "name": "ពិន សុវណ្ណ"
        },
        {
            "barcode": "171148451",
            "dpc": "03012428701",
            "name": "យាំ ចិត្ត្រា"
        },
        {
            "barcode": "171148452",
            "dpc": "03012430801",
            "name": "យូ ពៅ"
        },
        {
            "barcode": "171148453",
            "dpc": "03012421401",
            "name": "ពៅ វិរៈ ៣"
        },
        {
            "barcode": "171148454",
            "dpc": "03012432701",
            "name": "ឈួន ចាន់ថន"
        },
        {
            "barcode": "171148455",
            "dpc": "03012424101",
            "name": "ម៉ែង គឹមលី"
        },
        {
            "barcode": "171148456",
            "dpc": "03012444101",
            "name": "សាំង សុធារិទ្ធ"
        },
        {
            "barcode": "171148457",
            "dpc": "03012432601",
            "name": "ហត្ថ ធី"
        },
        {
            "barcode": "171148458",
            "dpc": "03012441301",
            "name": "លី គឹមសាន្ត"
        },
        {
            "barcode": "171148459",
            "dpc": "03012423701",
            "name": "ញាណ វណ្ណៈ"
        },
        {
            "barcode": "171148460",
            "dpc": "03012441401",
            "name": "ងួន សេង"
        },
        {
            "barcode": "171148461",
            "dpc": "03012419501",
            "name": "ណាំ ផាច"
        },
        {
            "barcode": "171148462",
            "dpc": "03012441501",
            "name": "ឈុត ណាលីន"
        },
        {
            "barcode": "171148463",
            "dpc": "03012441601",
            "name": "អួត សឿត"
        },
        {
            "barcode": "171148464",
            "dpc": "03012428101",
            "name": "សារុំ ចានថេត"
        },
        {
            "barcode": "171148465",
            "dpc": "03012420601",
            "name": "សៀង ណេង"
        },
        {
            "barcode": "171148466",
            "dpc": "03012424801",
            "name": "ឆាំ សុភាព"
        },
        {
            "barcode": "171148467",
            "dpc": "03012435201",
            "name": "ធូ ចាន់ថា"
        },
        {
            "barcode": "171148468",
            "dpc": "03012447301",
            "name": "តាត សុភី"
        },
        {
            "barcode": "171148469",
            "dpc": "03012403601",
            "name": "សាយ សៀន"
        },
        {
            "barcode": "171148470",
            "dpc": "03012431901",
            "name": "រឿន វីរៈ"
        },
        {
            "barcode": "171148471",
            "dpc": "03012432001",
            "name": "ហួត ហឿប"
        },
        {
            "barcode": "171148472",
            "dpc": "03012432101",
            "name": "សាម មាន"
        },
        {
            "barcode": "171148473",
            "dpc": "03012400801",
            "name": "អ៊ា គឹមជឿន"
        },
        {
            "barcode": "171148474",
            "dpc": "03012404401",
            "name": "វុន សុគន្ធ"
        },
        {
            "barcode": "171148475",
            "dpc": "03012404301",
            "name": "អ៊ុំ សាវ៉ៃ"
        },
        {
            "barcode": "171148476",
            "dpc": "03012404501",
            "name": "ហ៊ីង គឹមហឿន"
        },
        {
            "barcode": "171148477",
            "dpc": "03012420001",
            "name": "ពៅ ទិញ"
        },
        {
            "barcode": "171148478",
            "dpc": "03012403401",
            "name": "ជឹម និមិត្ត"
        },
        {
            "barcode": "171148479",
            "dpc": "03012437501",
            "name": "ឌី ផល្លី"
        },
        {
            "barcode": "171148480",
            "dpc": "03012437601",
            "name": "វ៉ា ទៀង"
        },
        {
            "barcode": "171148481",
            "dpc": "03012437701",
            "name": "ចែ ធុល"
        },
        {
            "barcode": "171148482",
            "dpc": "03012403501",
            "name": "ណូល សំណាង"
        },
        {
            "barcode": "171148483",
            "dpc": "03012435401",
            "name": "វ៉ែន ពីង"
        },
        {
            "barcode": "171148484",
            "dpc": "03012401301",
            "name": "សុខ ពៅ"
        },
        {
            "barcode": "171148485",
            "dpc": "03012403701",
            "name": "សុខ ញ៉ាញ់"
        },
        {
            "barcode": "171148486",
            "dpc": "03012404801",
            "name": "ណុច ម៉ៅ"
        },
        {
            "barcode": "171148487",
            "dpc": "03012401401",
            "name": "អេង ណូ"
        },
        {
            "barcode": "171148488",
            "dpc": "03012446801",
            "name": "ម៉ៅ ផល្លា"
        },
        {
            "barcode": "171148489",
            "dpc": "03012446701",
            "name": "ស៊ុម ភូង"
        },
        {
            "barcode": "171148490",
            "dpc": "03012446601",
            "name": "ស៊ុម សុភី"
        },
        {
            "barcode": "171148491",
            "dpc": "03012415401",
            "name": "យាន ធី"
        },
        {
            "barcode": "171148492",
            "dpc": "03012446401",
            "name": "សុខ សាឃឿម"
        },
        {
            "barcode": "171148493",
            "dpc": "03012431601",
            "name": "ហួត នរា"
        },
        {
            "barcode": "171148494",
            "dpc": "03012403801",
            "name": "ឡាញ់ សំណាង"
        },
        {
            "barcode": "171148495",
            "dpc": "03012418301",
            "name": "សឹង ពុទ្ធារ៉ា"
        },
        {
            "barcode": "171148496",
            "dpc": "03012419801",
            "name": "ទេព សំណាង"
        },
        {
            "barcode": "171148497",
            "dpc": "03012421201",
            "name": "ម៉ៅ ប៊ុនឈឿង"
        },
        {
            "barcode": "171148498",
            "dpc": "03012421101",
            "name": "អឿង ពេជ្រ"
        },
        {
            "barcode": "171148499",
            "dpc": "03012442101",
            "name": "អៀង មុំ"
        },
        {
            "barcode": "171148500",
            "dpc": "03012431301",
            "name": "អ៊ុំ ម៉ូលីដា"
        },
        {
            "barcode": "171148501",
            "dpc": "03012413101",
            "name": "អ៊ឹង ធឹង"
        },
        {
            "barcode": "171148502",
            "dpc": "03012431401",
            "name": "គឹម សារឿន"
        },
        {
            "barcode": "171148503",
            "dpc": "03012435301",
            "name": "ជា សុហួត"
        },
        {
            "barcode": "171148504",
            "dpc": "03012428001",
            "name": "អឿន អ៊ុយ"
        },
        {
            "barcode": "171148505",
            "dpc": "03012400201",
            "name": "ព្រំ អឿន"
        },
        {
            "barcode": "171148506",
            "dpc": "03012400101",
            "name": "បាន ចំរើន"
        },
        {
            "barcode": "171148507",
            "dpc": "03012437901",
            "name": "សុខ កានីកា"
        },
        {
            "barcode": "171148508",
            "dpc": "03012425801",
            "name": "ហេង ប៊ុនហៀង"
        },
        {
            "barcode": "171148509",
            "dpc": "03012441801",
            "name": "ប្រម ព្រឿង"
        },
        {
            "barcode": "171148510",
            "dpc": "03012441901",
            "name": "ឈើន រដ្ឋា"
        },
        {
            "barcode": "171148511",
            "dpc": "03012425901",
            "name": "ដែង សាវ៉ុង"
        },
        {
            "barcode": "171148512",
            "dpc": "03012434601",
            "name": "ម៉ាង ចានថូ"
        },
        {
            "barcode": "171148513",
            "dpc": "03012442001",
            "name": "សោ និយមរ័ត្ន"
        },
        {
            "barcode": "171148514",
            "dpc": "03012448001",
            "name": "ចាន់ ឌី"
        }
    ];


barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
