let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171147072",
            "dpc": "03022515101",
            "name": "ញឹក ប៊ុនឆប"
        },
        {
            "barcode": "171147073",
            "dpc": "03022523601",
            "name": "ម៉ាន ណាស៊ី"
        },
        {
            "barcode": "171147074",
            "dpc": "03022519901",
            "name": "រេះ ម៉ាត់"
        },
        {
            "barcode": "171147075",
            "dpc": "03022502601",
            "name": "សាប់ សារ៉េត"
        },
        {
            "barcode": "171147076",
            "dpc": "03022521401",
            "name": "អឿ សាយ័ណ្ណ"
        },
        {
            "barcode": "171147077",
            "dpc": "03022513601",
            "name": "គ្រី ស៊ិនលាង"
        },
        {
            "barcode": "171147078",
            "dpc": "03022547001",
            "name": "ឈឿន ពុទ្ធី"
        },
        {
            "barcode": "171147079",
            "dpc": "03022513701",
            "name": "ខាត់ ខាន"
        },
        {
            "barcode": "171147080",
            "dpc": "03022513801",
            "name": "ឌុន អន"
        },
        {
            "barcode": "171147081",
            "dpc": "03022513901",
            "name": "ស៊ុន ចំរើន"
        },
        {
            "barcode": "171147082",
            "dpc": "03022514201",
            "name": "តែ ឆុន"
        },
        {
            "barcode": "171147083",
            "dpc": "03022514101",
            "name": "សេង ពិសិទ្ធ"
        },
        {
            "barcode": "171147084",
            "dpc": "03022514001",
            "name": "សេង រ៉េន"
        },
        {
            "barcode": "171147085",
            "dpc": "03022508201",
            "name": "រ៉េះ សើ"
        },
        {
            "barcode": "171147086",
            "dpc": "03022508301",
            "name": "ស៊ូ សាទ្រី"
        },
        {
            "barcode": "171147087",
            "dpc": "03022513501",
            "name": "ឯល យ៉ាន"
        },
        {
            "barcode": "171147088",
            "dpc": "03022508401",
            "name": "ម៉ក់ ឃឿត"
        },
        {
            "barcode": "171147089",
            "dpc": "03022508601",
            "name": "ចេស សារឿន"
        },
        {
            "barcode": "171147090",
            "dpc": "03022513301",
            "name": "សាម ខុន"
        },
        {
            "barcode": "171147091",
            "dpc": "03022513401",
            "name": "សឿង ឡន"
        },
        {
            "barcode": "171147092",
            "dpc": "03022513201",
            "name": "ខូរ ឡាង"
        },
        {
            "barcode": "171147093",
            "dpc": "03022513101",
            "name": "ផល ផន"
        },
        {
            "barcode": "171147094",
            "dpc": "03022515301",
            "name": "ឯក ចាន់ថន"
        },
        {
            "barcode": "171147095",
            "dpc": "03022543901",
            "name": "ណុប ណារ៉ា ២"
        },
        {
            "barcode": "171147096",
            "dpc": "03022518301",
            "name": "សាន ស៊ីវន"
        },
        {
            "barcode": "171147097",
            "dpc": "03022518401",
            "name": "សុខ សុភ័ណ"
        },
        {
            "barcode": "171147098",
            "dpc": "03022502701",
            "name": "សួន សូរិន"
        },
        {
            "barcode": "171147099",
            "dpc": "03022502801",
            "name": "សួន វណ្ណារិទ្ធ"
        },
        {
            "barcode": "171147100",
            "dpc": "03022502901",
            "name": "រ៉ាត់ រី"
        },
        {
            "barcode": "171147101",
            "dpc": "03022503001",
            "name": "ឌី សុខពេញ"
        },
        {
            "barcode": "171147102",
            "dpc": "03022503101",
            "name": "ហួន សុធីរិទ្ធ"
        },
        {
            "barcode": "171147103",
            "dpc": "03022503201",
            "name": "ម៉ាត់ សុគ្រី"
        },
        {
            "barcode": "171147104",
            "dpc": "03022503301",
            "name": "អុំ យ៉ាន់"
        },
        {
            "barcode": "171147105",
            "dpc": "03022504601",
            "name": "ប៊ុន សុភាព"
        },
        {
            "barcode": "171147106",
            "dpc": "03022507001",
            "name": "ម៉ា ការីន"
        },
        {
            "barcode": "171147107",
            "dpc": "03022507801",
            "name": "ឡេះ នូប៉េះ"
        },
        {
            "barcode": "171147108",
            "dpc": "03022507901",
            "name": "ជ័យ សុភាព"
        },
        {
            "barcode": "171147109",
            "dpc": "03022508001",
            "name": "ផន ឃួន"
        },
        {
            "barcode": "171147110",
            "dpc": "03022508101",
            "name": "គង់ ចន្ថា"
        },
        {
            "barcode": "171147111",
            "dpc": "03022508701",
            "name": "ថង ឌឿន"
        },
        {
            "barcode": "171147112",
            "dpc": "03022508801",
            "name": "សាប់ មណា"
        },
        {
            "barcode": "171147113",
            "dpc": "03022508901",
            "name": "វ៉ាន់ រីយ៉ា"
        },
        {
            "barcode": "171147114",
            "dpc": "03022509001",
            "name": "សុខ រឿម"
        },
        {
            "barcode": "171147115",
            "dpc": "03022509101",
            "name": "ជា ហ៊ាង"
        },
        {
            "barcode": "171147116",
            "dpc": "03022509201",
            "name": "សៅ គាន"
        },
        {
            "barcode": "171147117",
            "dpc": "03022509301",
            "name": "ស៊ូ យ៉ន"
        },
        {
            "barcode": "171147118",
            "dpc": "03022509401",
            "name": "ឈុន ឡាយ"
        },
        {
            "barcode": "171147119",
            "dpc": "03022509501",
            "name": "ម៉ាន រី"
        },
        {
            "barcode": "171147120",
            "dpc": "03022509601",
            "name": "ទេព ស៊ុន"
        },
        {
            "barcode": "171147121",
            "dpc": "03022509701",
            "name": "តាំ ម៉ាស់"
        },
        {
            "barcode": "171147122",
            "dpc": "03022511701",
            "name": "សេង នាង"
        },
        {
            "barcode": "171147123",
            "dpc": "03022511801",
            "name": "វង្ស ភុំ"
        },
        {
            "barcode": "171147124",
            "dpc": "03022511901",
            "name": "តន់ ណាវ"
        },
        {
            "barcode": "171147125",
            "dpc": "03022512401",
            "name": "ព្រឿន ចាន់វ៉ន"
        },
        {
            "barcode": "171147126",
            "dpc": "03022515401",
            "name": "ខ្វាន់ ចំរើន"
        },
        {
            "barcode": "171147127",
            "dpc": "03022521301",
            "name": "មណ្ឌលសុខភាពស្លាកែត"
        },
        {
            "barcode": "171147128",
            "dpc": "03022539901",
            "name": "ស៊ុន ផាត"
        },
        {
            "barcode": "171147129",
            "dpc": "03022544701",
            "name": "អ៊ុច វណ្ណ"
        },
        {
            "barcode": "171147130",
            "dpc": "03022544801",
            "name": "ម៉ាក់ ផល្លី"
        },
        {
            "barcode": "171147131",
            "dpc": "03022544901",
            "name": "ប៊ុន សំអាន"
        },
        {
            "barcode": "171147132",
            "dpc": "03022545001",
            "name": "ម៉ុត ផល្លី"
        },
        {
            "barcode": "171147133",
            "dpc": "03022502401",
            "name": "ទូច ជួន"
        },
        {
            "barcode": "171147134",
            "dpc": "03022503401",
            "name": "កែវ សុវណ្ណារិទ្ធ"
        },
        {
            "barcode": "171147135",
            "dpc": "03022503501",
            "name": "ឈៀង នេត"
        },
        {
            "barcode": "171147136",
            "dpc": "03022503601",
            "name": "វង្ស កង"
        },
        {
            "barcode": "171147137",
            "dpc": "03022503701",
            "name": "ឆាំ ពៅ"
        },
        {
            "barcode": "171147138",
            "dpc": "03022503801",
            "name": "វង្ស ធួក"
        },
        {
            "barcode": "171147139",
            "dpc": "03022503901",
            "name": "ម៉េត ដាវុធ"
        },
        {
            "barcode": "171147140",
            "dpc": "03022507201",
            "name": "តែម ចំរើន"
        },
        {
            "barcode": "171147141",
            "dpc": "03022507401",
            "name": "ហង់ ផា"
        },
        {
            "barcode": "171147142",
            "dpc": "03022507501",
            "name": "នុត ឡី"
        },
        {
            "barcode": "171147143",
            "dpc": "03022507601",
            "name": "លី ណាស៊ី"
        },
        {
            "barcode": "171147144",
            "dpc": "03022507701",
            "name": "វង្ស ថន"
        },
        {
            "barcode": "171147145",
            "dpc": "03022511501",
            "name": "កាំង ប៉េង"
        },
        {
            "barcode": "171147146",
            "dpc": "03022511601",
            "name": "ឈុន ធឿន"
        },
        {
            "barcode": "171147147",
            "dpc": "03022512201",
            "name": "រឿន សាវីន"
        },
        {
            "barcode": "171147148",
            "dpc": "03022523801",
            "name": "យ៉ន សុភ័ក្រធីតា"
        },
        {
            "barcode": "171147149",
            "dpc": "03022523901",
            "name": "តឹង ចាន់ធី"
        },
        {
            "barcode": "171147150",
            "dpc": "03022524001",
            "name": "និន ណុន"
        },
        {
            "barcode": "171147151",
            "dpc": "03022539801",
            "name": "ញ៉ែម ផល្លី"
        },
        {
            "barcode": "171147152",
            "dpc": "03022523001",
            "name": "អ៊ុក ចាន់ម៉ាលី ២"
        },
        {
            "barcode": "171147153",
            "dpc": "03022506801",
            "name": "ទេព ចយ"
        },
        {
            "barcode": "171147154",
            "dpc": "03022513001",
            "name": "ទឹម សុផាន់ណា"
        },
        {
            "barcode": "171147155",
            "dpc": "03022502301",
            "name": "សំ សុន"
        },
        {
            "barcode": "171147156",
            "dpc": "03022539601",
            "name": "ឡឹក រិវឌ្ឍន៍"
        },
        {
            "barcode": "171147157",
            "dpc": "03022512101",
            "name": "អ៊ឹម សុភាព"
        },
        {
            "barcode": "171147158",
            "dpc": "03022514701",
            "name": "ជា ផល្លី"
        },
        {
            "barcode": "171147159",
            "dpc": "03022514801",
            "name": "ពៅ ប្រុស"
        },
        {
            "barcode": "171147160",
            "dpc": "03022522901",
            "name": "នួន សិលា"
        },
        {
            "barcode": "171147161",
            "dpc": "03022523701",
            "name": "ប៊ុន ថាវ"
        },
        {
            "barcode": "171147162",
            "dpc": "03022518101",
            "name": "មាស សាម៉ុន"
        },
        {
            "barcode": "171147163",
            "dpc": "03022515501",
            "name": "ឈួម សាវី ២"
        },
        {
            "barcode": "171147164",
            "dpc": "03022501301",
            "name": "សេង លន់"
        },
        {
            "barcode": "171147165",
            "dpc": "03022502501",
            "name": "ជៀប យឿត"
        },
        {
            "barcode": "171147166",
            "dpc": "03022510501",
            "name": "មាស ម៉ូលីវណ្ណ"
        },
        {
            "barcode": "171147167",
            "dpc": "03022510601",
            "name": "មាស ចំណូល"
        },
        {
            "barcode": "171147168",
            "dpc": "03022524101",
            "name": "ឡាយ សុខហេង"
        },
        {
            "barcode": "171147169",
            "dpc": "03022522301",
            "name": "ឡាយ ស្រីអូន"
        },
        {
            "barcode": "171147170",
            "dpc": "03022506101",
            "name": "ឡាយ គីមហ៊ួរ"
        },
        {
            "barcode": "171147171",
            "dpc": "03022506001",
            "name": "ឡាយ សុខហេង ២"
        },
        {
            "barcode": "171147172",
            "dpc": "03022505901",
            "name": "ឡាយ សុខហេង ១"
        },
        {
            "barcode": "171147173",
            "dpc": "03022501601",
            "name": "វ៉ាយ សារ ២"
        },
        {
            "barcode": "171147174",
            "dpc": "03022506201",
            "name": "ឡាត ហ៊ត"
        },
        {
            "barcode": "171147175",
            "dpc": "03022520901",
            "name": "រឿន ប្រាថ្មា"
        },
        {
            "barcode": "171147176",
            "dpc": "03022515601",
            "name": "ឈឹម វណ្ណា"
        },
        {
            "barcode": "171147177",
            "dpc": "03022518001",
            "name": "ពឿន ពៅ"
        },
        {
            "barcode": "171147178",
            "dpc": "03022511401",
            "name": "ស៊ី សំណាង"
        },
        {
            "barcode": "171147179",
            "dpc": "03022511301",
            "name": "ប៊ុន សុង"
        },
        {
            "barcode": "171147180",
            "dpc": "03022524401",
            "name": "ជា សុខជា"
        },
        {
            "barcode": "171147181",
            "dpc": "03022541001",
            "name": "ស៊ិន ប៊ុនលី"
        },
        {
            "barcode": "171147182",
            "dpc": "03022540901",
            "name": "ពៅ រស្មី"
        },
        {
            "barcode": "171147183",
            "dpc": "03022540801",
            "name": "ស៊ន ពៅ"
        },
        {
            "barcode": "171147184",
            "dpc": "03022540701",
            "name": "កេង សុខម៉េង"
        },
        {
            "barcode": "171147185",
            "dpc": "03022501801",
            "name": "លឹម សុខធី"
        },
        {
            "barcode": "171147186",
            "dpc": "03022512801",
            "name": "លឹម ប៉ោហុង"
        },
        {
            "barcode": "171147187",
            "dpc": "03022512001",
            "name": "ជួន សុខុម"
        },
        {
            "barcode": "171147188",
            "dpc": "03022522801",
            "name": "ព្រាប សុភ័ក្រ"
        },
        {
            "barcode": "171147189",
            "dpc": "03022522701",
            "name": "ភួង ផល្លី"
        },
        {
            "barcode": "171147190",
            "dpc": "03022522601",
            "name": "អ៊ុក សាខន"
        },
        {
            "barcode": "171147191",
            "dpc": "03022514901",
            "name": "ឡាយ ស្រីមុំ"
        },
        {
            "barcode": "171147192",
            "dpc": "03022515001",
            "name": "សោម ម៉ៅ"
        },
        {
            "barcode": "171147193",
            "dpc": "03022539701",
            "name": "ឡាយ ផល្លី"
        },
        {
            "barcode": "171147194",
            "dpc": "03022544601",
            "name": "គី ស៊ីណែត"
        },
        {
            "barcode": "171147195",
            "dpc": "03022545101",
            "name": "ទេព កែវចាន់ដារ៉ា"
        },
        {
            "barcode": "171147196",
            "dpc": "03022523101",
            "name": "ខែម សារិន"
        },
        {
            "barcode": "171147197",
            "dpc": "03022523201",
            "name": "គង់ ពៅ"
        },
        {
            "barcode": "171147198",
            "dpc": "03022544301",
            "name": "ភី គឹមលាង"
        },
        {
            "barcode": "171147199",
            "dpc": "03022517701",
            "name": "ច័ន្ទ និមល"
        },
        {
            "barcode": "171147200",
            "dpc": "03022514401",
            "name": "សេង ពុទ្ធា"
        },
        {
            "barcode": "171147201",
            "dpc": "03022524201",
            "name": "ជ័យ វុទ្ធី"
        },
        {
            "barcode": "171147202",
            "dpc": "03022518201",
            "name": "សុន សុភាព"
        },
        {
            "barcode": "171147203",
            "dpc": "03022517601",
            "name": "ពៅ វិជ្ជា"
        },
        {
            "barcode": "171147204",
            "dpc": "03022517501",
            "name": "នូ គីម"
        },
        {
            "barcode": "171147205",
            "dpc": "03022521201",
            "name": "យី ប៊ុនលុច"
        },
        {
            "barcode": "171147206",
            "dpc": "03022506401",
            "name": "ឡាច រិទ្ធី"
        },
        {
            "barcode": "171147207",
            "dpc": "03022512601",
            "name": "សាន ប៊ុនសាត"
        },
        {
            "barcode": "171147208",
            "dpc": "03022502101",
            "name": "ចាន់ សេន"
        },
        {
            "barcode": "171147209",
            "dpc": "03022544101",
            "name": "ស្រី ម៉ៃ"
        },
        {
            "barcode": "171147210",
            "dpc": "03022544001",
            "name": "ងឹ វណ្ណះ"
        },
        {
            "barcode": "171147211",
            "dpc": "03022521001",
            "name": "រ៉ន សុគន្ធា"
        },
        {
            "barcode": "171147212",
            "dpc": "03022519401",
            "name": "ថៃ វណ្ណារ៉ា"
        },
        {
            "barcode": "171147213",
            "dpc": "03022519501",
            "name": "ថៃ វណ្ណី"
        },
        {
            "barcode": "171147214",
            "dpc": "03022519601",
            "name": "តិច ថុង"
        },
        {
            "barcode": "171147215",
            "dpc": "03022520001",
            "name": "ជឺ នី"
        },
        {
            "barcode": "171147216",
            "dpc": "03022519701",
            "name": "ជា សុភាព"
        },
        {
            "barcode": "171147217",
            "dpc": "03022519801",
            "name": "សេង សៀន"
        },
        {
            "barcode": "171147218",
            "dpc": "03022510001",
            "name": "ឈឿង សុវណ្ណី"
        },
        {
            "barcode": "171147219",
            "dpc": "03022515801",
            "name": "ជុំ វណ្ណា"
        },
        {
            "barcode": "171147220",
            "dpc": "03022520701",
            "name": "គុជ ជ័រ"
        },
        {
            "barcode": "171147221",
            "dpc": "03022515701",
            "name": "ប៊ុន ភាព"
        },
        {
            "barcode": "171147222",
            "dpc": "03022512701",
            "name": "គង់​ ស៊ីថា"
        },
        {
            "barcode": "171147223",
            "dpc": "03022506701",
            "name": "កែវ សារឿន"
        },
        {
            "barcode": "171147224",
            "dpc": "03022517001",
            "name": "ឌី វុទ្ធី"
        },
        {
            "barcode": "171147225",
            "dpc": "03022519201",
            "name": "ផន ភិន"
        },
        {
            "barcode": "171147226",
            "dpc": "03022506601",
            "name": "ឈុន ឡាយ"
        },
        {
            "barcode": "171147227",
            "dpc": "03022506501",
            "name": "អឿង សាវរី"
        },
        {
            "barcode": "171147228",
            "dpc": "03022522501",
            "name": "ងួន ហេង"
        },
        {
            "barcode": "171147229",
            "dpc": "03022544501",
            "name": "សៅ សិច"
        },
        {
            "barcode": "171147230",
            "dpc": "03022544401",
            "name": "សេង ណាក់"
        },
        {
            "barcode": "171147231",
            "dpc": "03022509901",
            "name": "ចក់ នាង"
        },
        {
            "barcode": "171147232",
            "dpc": "03022523401",
            "name": "ហ៊ុន សោភ័ណ្ឌ"
        },
        {
            "barcode": "171147233",
            "dpc": "03022523501",
            "name": "អៀម ស៊ីវន"
        },
        {
            "barcode": "171147234",
            "dpc": "03022509801",
            "name": "ផាន់ សុគុណ"
        },
        {
            "barcode": "171147235",
            "dpc": "03022541401",
            "name": "ផុន សុភ័ណ្ឌ"
        },
        {
            "barcode": "171147236",
            "dpc": "03022547801",
            "name": "អ៊ាង សុខា"
        },
        {
            "barcode": "171147237",
            "dpc": "03022541501",
            "name": "មាស ហង្ស"
        },
        {
            "barcode": "171147238",
            "dpc": "03022546601",
            "name": "ទិត សៅរី"
        },
        {
            "barcode": "171147239",
            "dpc": "03022541601",
            "name": "ឡេង អូន"
        },
        {
            "barcode": "171147240",
            "dpc": "03022541701",
            "name": "ឈឿន ខូយ"
        },
        {
            "barcode": "171147241",
            "dpc": "03022541801",
            "name": "ពៅ វី"
        },
        {
            "barcode": "171147242",
            "dpc": "03022541901",
            "name": "មឿង សារ៉ន"
        },
        {
            "barcode": "171147243",
            "dpc": "03022542001",
            "name": "ស៊ឹម សារ៉េត"
        },
        {
            "barcode": "171147244",
            "dpc": "03022546501",
            "name": "ទូច សារីម"
        },
        {
            "barcode": "171147245",
            "dpc": "03022546401",
            "name": "វែង ស្រីនី"
        },
        {
            "barcode": "171147246",
            "dpc": "03022517201",
            "name": "ញ៉ ភាព"
        },
        {
            "barcode": "171147247",
            "dpc": "03022543501",
            "name": "មិម យ៉ន"
        },
        {
            "barcode": "171147248",
            "dpc": "03022536301",
            "name": "ហ៊ីន ផល្លី"
        },
        {
            "barcode": "171147249",
            "dpc": "03022526101",
            "name": "ភឿក សាខន"
        },
        {
            "barcode": "171147250",
            "dpc": "03022536201",
            "name": "សំ សុៈ"
        },
        {
            "barcode": "171147251",
            "dpc": "03022526001",
            "name": "អៀង គឹមហួយ"
        },
        {
            "barcode": "171147252",
            "dpc": "03022546301",
            "name": "យិន គិន"
        },
        {
            "barcode": "171147253",
            "dpc": "03022546201",
            "name": "ទឹម ម៉ាឡៃ"
        },
        {
            "barcode": "171147254",
            "dpc": "03022525801",
            "name": "កែវ ចាន់នី"
        },
        {
            "barcode": "171147255",
            "dpc": "03022525701",
            "name": "យិប សុផាន់"
        },
        {
            "barcode": "171147256",
            "dpc": "03022542101",
            "name": "ឡុង ណុប"
        },
        {
            "barcode": "171147257",
            "dpc": "03022525601",
            "name": "តេង អឿន"
        },
        {
            "barcode": "171147258",
            "dpc": "03022525501",
            "name": "តូ សេង"
        },
        {
            "barcode": "171147259",
            "dpc": "03022525401",
            "name": "រី យ៉ាន់"
        },
        {
            "barcode": "171147260",
            "dpc": "03022525301",
            "name": "ហេង រុំម្នី"
        },
        {
            "barcode": "171147261",
            "dpc": "03022536101",
            "name": "សំ សម្បត្តិ"
        },
        {
            "barcode": "171147262",
            "dpc": "03022536001",
            "name": "ខា សារិន"
        },
        {
            "barcode": "171147263",
            "dpc": "03022535901",
            "name": "ឈិម សុផាន"
        },
        {
            "barcode": "171147264",
            "dpc": "03022525201",
            "name": "ខ្លូត សុខុម"
        },
        {
            "barcode": "171147265",
            "dpc": "03022535801",
            "name": "ភិន ញឿន"
        },
        {
            "barcode": "171147266",
            "dpc": "03022535701",
            "name": "ម៉ៃ សុឃុល"
        },
        {
            "barcode": "171147267",
            "dpc": "03022535601",
            "name": "ប៉ុន សាគុណ"
        },
        {
            "barcode": "171147268",
            "dpc": "03022535501",
            "name": "ហ៊ុន ឃឿង"
        },
        {
            "barcode": "171147269",
            "dpc": "03022535401",
            "name": "ហ៊ុន ពៅ"
        },
        {
            "barcode": "171147270",
            "dpc": "03022535301",
            "name": "ហ៊ុន ធ្នូ"
        },
        {
            "barcode": "171147271",
            "dpc": "03022518601",
            "name": "សួង លាង"
        },
        {
            "barcode": "171147272",
            "dpc": "03022535201",
            "name": "ឃុន វិបុល"
        },
        {
            "barcode": "171147273",
            "dpc": "03022535101",
            "name": "ម៉ម រិន"
        },
        {
            "barcode": "171147274",
            "dpc": "03022517101",
            "name": "ហ៊ុន ចាប"
        },
        {
            "barcode": "171147275",
            "dpc": "03022518701",
            "name": "វ៉ែន វ៉ូ"
        },
        {
            "barcode": "171147276",
            "dpc": "03022525001",
            "name": "វិញ ហេង"
        },
        {
            "barcode": "171147277",
            "dpc": "03022502201",
            "name": "គ្រី ទូច"
        },
        {
            "barcode": "171147278",
            "dpc": "03022541301",
            "name": "ងួន ចាន់រតនា"
        },
        {
            "barcode": "171147279",
            "dpc": "03022547501",
            "name": "សោម ថន"
        },
        {
            "barcode": "171147280",
            "dpc": "03022547301",
            "name": "ខាវ រតនា"
        },
        {
            "barcode": "171147281",
            "dpc": "03022547401",
            "name": "សាន ស៊ីថា"
        },
        {
            "barcode": "171147282",
            "dpc": "03022545201",
            "name": "អួង វ៉ា"
        },
        {
            "barcode": "171147283",
            "dpc": "03022516701",
            "name": "ចេស សាម៉េត"
        },
        {
            "barcode": "171147284",
            "dpc": "03022516801",
            "name": "សៅ ឆុន"
        },
        {
            "barcode": "171147285",
            "dpc": "03022516901",
            "name": "ស៊ីវ លឿត"
        },
        {
            "barcode": "171147286",
            "dpc": "03022526201",
            "name": "ហួន សំណាង"
        },
        {
            "barcode": "171147287",
            "dpc": "03022536401",
            "name": "មឿន សុផាន់នី"
        },
        {
            "barcode": "171147288",
            "dpc": "03022526301",
            "name": "ប៊ុត យ៉ាត"
        },
        {
            "barcode": "171147289",
            "dpc": "03022536501",
            "name": "យី សៀកហាន"
        },
        {
            "barcode": "171147290",
            "dpc": "03022526401",
            "name": "ឡាក់ រស់"
        },
        {
            "barcode": "171147291",
            "dpc": "03022543301",
            "name": "ចាប សារុន"
        },
        {
            "barcode": "171147292",
            "dpc": "03022526501",
            "name": "ឈួន ចន្ធូ"
        },
        {
            "barcode": "171147293",
            "dpc": "03022526601",
            "name": "សាំង ឆៃ"
        },
        {
            "barcode": "171147294",
            "dpc": "03022526701",
            "name": "ឃុន មិនា"
        },
        {
            "barcode": "171147295",
            "dpc": "03022543101",
            "name": "ឆាំ កុសល់"
        },
        {
            "barcode": "171147296",
            "dpc": "03022526801",
            "name": "ម៉ាង សុវណ្ណ"
        },
        {
            "barcode": "171147297",
            "dpc": "03022526901",
            "name": "ព្រីង អូន"
        },
        {
            "barcode": "171147298",
            "dpc": "03022527001",
            "name": "គាវ ម៉ៅ"
        },
        {
            "barcode": "171147299",
            "dpc": "03022527101",
            "name": "អក្ខរ៉ាសម័យ"
        },
        {
            "barcode": "171147300",
            "dpc": "03022527201",
            "name": "អុល សុជា"
        },
        {
            "barcode": "171147301",
            "dpc": "03022542901",
            "name": "រត្ន ស្រីពេជ្រ"
        },
        {
            "barcode": "171147302",
            "dpc": "03022527301",
            "name": "មួង សុធា"
        },
        {
            "barcode": "171147303",
            "dpc": "03022527401",
            "name": "ឈិត សាលៀប"
        },
        {
            "barcode": "171147304",
            "dpc": "03022527501",
            "name": "ពៅ ពឿន"
        },
        {
            "barcode": "171147305",
            "dpc": "03022527601",
            "name": "សុខ ផូ"
        },
        {
            "barcode": "171147306",
            "dpc": "03022527701",
            "name": "សំ យ៉ាន់"
        },
        {
            "barcode": "171147307",
            "dpc": "03022536601",
            "name": "ឌិម ផុន"
        },
        {
            "barcode": "171147308",
            "dpc": "03022527801",
            "name": "តិប អេង"
        },
        {
            "barcode": "171147309",
            "dpc": "03022542701",
            "name": "វឿន សុណន់"
        },
        {
            "barcode": "171147310",
            "dpc": "03022536701",
            "name": "រ័ត្ន ស្រីលី"
        },
        {
            "barcode": "171147311",
            "dpc": "03022527901",
            "name": "ឡេង សំណាង"
        },
        {
            "barcode": "171147312",
            "dpc": "03022536801",
            "name": "នៅ ស៊ីមន"
        },
        {
            "barcode": "171147313",
            "dpc": "03022536901",
            "name": "ឈុំ សឿត"
        },
        {
            "barcode": "171147314",
            "dpc": "03022537001",
            "name": "ឈឹម សុគីម"
        },
        {
            "barcode": "171147315",
            "dpc": "03022528001",
            "name": "អាន ស៊ីហាក"
        },
        {
            "barcode": "171147316",
            "dpc": "03022528101",
            "name": "អួន សារ៉េន"
        },
        {
            "barcode": "171147317",
            "dpc": "03022537101",
            "name": "អួន រិទ្ធ"
        },
        {
            "barcode": "171147318",
            "dpc": "03022545801",
            "name": "គុជ ដារីយ៉ាន"
        },
        {
            "barcode": "171147319",
            "dpc": "03022528201",
            "name": "ប៉ូ មុំ"
        },
        {
            "barcode": "171147320",
            "dpc": "03022537201",
            "name": "សុខ អេង"
        },
        {
            "barcode": "171147321",
            "dpc": "03022528301",
            "name": "សំ សុផាត"
        },
        {
            "barcode": "171147322",
            "dpc": "03022528401",
            "name": "ហែម នី"
        },
        {
            "barcode": "171147323",
            "dpc": "03022528501",
            "name": "រិន ស្រីមុំ"
        },
        {
            "barcode": "171147324",
            "dpc": "03022528601",
            "name": "ខៀវ លាភ"
        },
        {
            "barcode": "171147325",
            "dpc": "03022537301",
            "name": "ខៀវ ចាន់ថង"
        },
        {
            "barcode": "171147326",
            "dpc": "03022528701",
            "name": "យីម សំអុល"
        },
        {
            "barcode": "171147327",
            "dpc": "03022528801",
            "name": "ស៊ុន សាវឿន"
        },
        {
            "barcode": "171147328",
            "dpc": "03022537401",
            "name": "ចាន់ សុភា"
        },
        {
            "barcode": "171147329",
            "dpc": "03022528901",
            "name": "ឈុន ឆេង"
        },
        {
            "barcode": "171147330",
            "dpc": "03022529001",
            "name": "អុំ រ៉ន"
        },
        {
            "barcode": "171147331",
            "dpc": "03022537501",
            "name": "ងិន ផល្លា"
        },
        {
            "barcode": "171147332",
            "dpc": "03022529101",
            "name": "ងិន សារ៉ាន់"
        },
        {
            "barcode": "171147333",
            "dpc": "03022543201",
            "name": "ឆៃ គីមសឿន"
        },
        {
            "barcode": "171147334",
            "dpc": "03022529201",
            "name": "ម៉ាង សារឿត"
        },
        {
            "barcode": "171147335",
            "dpc": "03022529301",
            "name": "ពេញ ចិន្តា"
        },
        {
            "barcode": "171147336",
            "dpc": "03022529401",
            "name": "ចាន់ ស៊ីដេត"
        },
        {
            "barcode": "171147337",
            "dpc": "03022529501",
            "name": "ហួត គឹមឡាយ"
        },
        {
            "barcode": "171147338",
            "dpc": "03022537601",
            "name": "ពេជ្រ សារឿន"
        },
        {
            "barcode": "171147339",
            "dpc": "03022529701",
            "name": "ម៉ុត សារ៉េត"
        },
        {
            "barcode": "171147340",
            "dpc": "03022543401",
            "name": "ទឹម សុផាន់នី"
        },
        {
            "barcode": "171147341",
            "dpc": "03022529801",
            "name": "សាន់ ហុង"
        },
        {
            "barcode": "171147342",
            "dpc": "03022546101",
            "name": "អួន វី"
        },
        {
            "barcode": "171147343",
            "dpc": "03022529901",
            "name": "ម៉េង ងន់ហេង"
        },
        {
            "barcode": "171147344",
            "dpc": "03022537701",
            "name": "មឿង ប៊ុនថា"
        },
        {
            "barcode": "171147345",
            "dpc": "03022530001",
            "name": "ឆោម សុវណ្ណ"
        },
        {
            "barcode": "171147346",
            "dpc": "03022530201",
            "name": "ស៊ុន សារ៉េត"
        },
        {
            "barcode": "171147347",
            "dpc": "03022530301",
            "name": "ង៉ូវ ដាវី"
        },
        {
            "barcode": "171147348",
            "dpc": "03022530401",
            "name": "ស៊ុំ សុវណ្ណ"
        },
        {
            "barcode": "171147349",
            "dpc": "03022530501",
            "name": "ហៀន ភាព"
        },
        {
            "barcode": "171147350",
            "dpc": "03022542301",
            "name": "រស់ ប៊ុនណាត"
        },
        {
            "barcode": "171147351",
            "dpc": "03022530601",
            "name": "ហ៊ុន សាត"
        },
        {
            "barcode": "171147352",
            "dpc": "03022530701",
            "name": "ទូច ចន្ធូ"
        },
        {
            "barcode": "171147353",
            "dpc": "03022530801",
            "name": "ចាប ចន្នី"
        },
        {
            "barcode": "171147354",
            "dpc": "03022530901",
            "name": "ហួន លាងសេង"
        },
        {
            "barcode": "171147355",
            "dpc": "03022531001",
            "name": "នៅ ស៊ីម"
        },
        {
            "barcode": "171147356",
            "dpc": "03022531101",
            "name": "ឡឹក ជីម"
        },
        {
            "barcode": "171147357",
            "dpc": "03022531301",
            "name": "ស៊ុន សារីម"
        },
        {
            "barcode": "171147358",
            "dpc": "03022531401",
            "name": "កុយ សំអូន"
        },
        {
            "barcode": "171147359",
            "dpc": "03022531501",
            "name": "អុំ ង៉ា"
        },
        {
            "barcode": "171147360",
            "dpc": "03022531601",
            "name": "ឡុង កាន"
        },
        {
            "barcode": "171147361",
            "dpc": "03022531701",
            "name": "ទេស សាវេត"
        },
        {
            "barcode": "171147362",
            "dpc": "03022531801",
            "name": "សំ ទន់"
        },
        {
            "barcode": "171147363",
            "dpc": "03022531901",
            "name": "មួង សូដា"
        },
        {
            "barcode": "171147364",
            "dpc": "03022532001",
            "name": "មិន ហ៊ីង"
        },
        {
            "barcode": "171147365",
            "dpc": "03022532101",
            "name": "សូ សឿន"
        },
        {
            "barcode": "171147366",
            "dpc": "03022537801",
            "name": "ម៉ៅ ម៉ាន់"
        },
        {
            "barcode": "171147367",
            "dpc": "03022537901",
            "name": "ភិន ង៉ា"
        },
        {
            "barcode": "171147368",
            "dpc": "03022538001",
            "name": "ចាន់ វី"
        },
        {
            "barcode": "171147369",
            "dpc": "03022532201",
            "name": "ហាច រដ្ឋា"
        },
        {
            "barcode": "171147370",
            "dpc": "03022532301",
            "name": "ហាច ម៉ៅ"
        },
        {
            "barcode": "171147371",
            "dpc": "03022538101",
            "name": "សឿន សាវុធ"
        },
        {
            "barcode": "171147372",
            "dpc": "03022538201",
            "name": "វិត ហាប់"
        },
        {
            "barcode": "171147373",
            "dpc": "03022542501",
            "name": "លន សម្បត្តិ"
        },
        {
            "barcode": "171147374",
            "dpc": "03022532401",
            "name": "ឡុក រឿម"
        },
        {
            "barcode": "171147375",
            "dpc": "03022538301",
            "name": "ង៉ូវ សុក"
        },
        {
            "barcode": "171147376",
            "dpc": "03022538401",
            "name": "ខាំ ឡៃ"
        },
        {
            "barcode": "171147377",
            "dpc": "03022538501",
            "name": "លិម សុវណ្ណ"
        },
        {
            "barcode": "171147378",
            "dpc": "03022538601",
            "name": "សាត សារ៉ាយ"
        },
        {
            "barcode": "171147379",
            "dpc": "03022538701",
            "name": "ញ៉ែប ប៊ុនថា"
        },
        {
            "barcode": "171147380",
            "dpc": "03022538801",
            "name": "សេក ស៊ីថា"
        },
        {
            "barcode": "171147381",
            "dpc": "03022538901",
            "name": "ប៉ិល ពៅ"
        },
        {
            "barcode": "171147382",
            "dpc": "03022532501",
            "name": "យ៉េត គឹមហ៊ន"
        },
        {
            "barcode": "171147383",
            "dpc": "03022539001",
            "name": "ស៊ុន រិន"
        },
        {
            "barcode": "171147384",
            "dpc": "03022532601",
            "name": "ឡែម ធី"
        },
        {
            "barcode": "171147385",
            "dpc": "03022532701",
            "name": "ម៉ាត់ លី"
        },
        {
            "barcode": "171147386",
            "dpc": "03022532801",
            "name": "សំ សាន"
        },
        {
            "barcode": "171147387",
            "dpc": "03022545901",
            "name": "អួង សុផល"
        },
        {
            "barcode": "171147388",
            "dpc": "03022532901",
            "name": "ម៉ម បូរី"
        },
        {
            "barcode": "171147389",
            "dpc": "03022533001",
            "name": "ញឹក ការ"
        },
        {
            "barcode": "171147390",
            "dpc": "03022533101",
            "name": "សេង ហួន"
        },
        {
            "barcode": "171147391",
            "dpc": "03022533201",
            "name": "ញឹក នី"
        },
        {
            "barcode": "171147392",
            "dpc": "03022533301",
            "name": "ប៊ួ ស៊ីណា"
        },
        {
            "barcode": "171147393",
            "dpc": "03022533401",
            "name": "ជា ស្រីមាស"
        },
        {
            "barcode": "171147394",
            "dpc": "03022533501",
            "name": "យ៉ុន គ្រោង"
        },
        {
            "barcode": "171147395",
            "dpc": "03022533601",
            "name": "មី ទូច"
        },
        {
            "barcode": "171147396",
            "dpc": "03022533701",
            "name": "សុខ សំអុន"
        },
        {
            "barcode": "171147397",
            "dpc": "03022533801",
            "name": "ស៊ុំ សំណាង"
        },
        {
            "barcode": "171147398",
            "dpc": "03022533901",
            "name": "ភឿក សំប៊ុន"
        },
        {
            "barcode": "171147399",
            "dpc": "03022534101",
            "name": "ស៊ុម ស៊ីនឿត"
        },
        {
            "barcode": "171147400",
            "dpc": "03022539101",
            "name": "ចាន់ ណូរ៉ា"
        },
        {
            "barcode": "171147401",
            "dpc": "03022534201",
            "name": "ភឿក សម្បត្តិ"
        },
        {
            "barcode": "171147402",
            "dpc": "03022546001",
            "name": "ប្រាក់ វ៉ាស់ធី"
        },
        {
            "barcode": "171147403",
            "dpc": "03022534301",
            "name": "ហ៊ាន បូផា"
        },
        {
            "barcode": "171147404",
            "dpc": "03022505801",
            "name": "សេង ស្រីណែត"
        },
        {
            "barcode": "171147405",
            "dpc": "03022501501",
            "name": "ប្លង់ ស៊ីនណារ៉ា"
        },
        {
            "barcode": "171147406",
            "dpc": "03022518901",
            "name": "អុំ ខុម"
        },
        {
            "barcode": "171147407",
            "dpc": "03022518801",
            "name": "យ៉ត សំបូរ"
        },
        {
            "barcode": "171147408",
            "dpc": "03022517301",
            "name": "ឡុង ខុនវណ្ឌី"
        },
        {
            "barcode": "171147409",
            "dpc": "03022517401",
            "name": "គង់ លន"
        },
        {
            "barcode": "171147410",
            "dpc": "03022524501",
            "name": "ផាត់ រ៉ា"
        },
        {
            "barcode": "171147411",
            "dpc": "03022519001",
            "name": "ឡុង សារ៉ាន់"
        },
        {
            "barcode": "171147412",
            "dpc": "03022501401",
            "name": "សុខ ស៊ីណាត"
        },
        {
            "barcode": "171147413",
            "dpc": "03022507101",
            "name": "ញ៉េប ចំរើន"
        },
        {
            "barcode": "171147414",
            "dpc": "03022512501",
            "name": "ឈីវ ឈឿត"
        },
        {
            "barcode": "171147415",
            "dpc": "03022520401",
            "name": "ជុំ ចាន់ដារ៉ារិទ្ធ"
        },
        {
            "barcode": "171147416",
            "dpc": "03022547201",
            "name": "សុខ រ៉ាឌី"
        },
        {
            "barcode": "171147417",
            "dpc": "03022534801",
            "name": "ស៊ុង ស៊ីវ៉ាន់"
        },
        {
            "barcode": "171147418",
            "dpc": "03022534901",
            "name": "សួន ជំនិត"
        },
        {
            "barcode": "171147419",
            "dpc": "03022547601",
            "name": "គង់ សំអាត"
        },
        {
            "barcode": "171147420",
            "dpc": "03022547701",
            "name": "ឈឿម ផល្លី"
        },
        {
            "barcode": "171147421",
            "dpc": "03022520501",
            "name": "សៅ ឆុន"
        },
        {
            "barcode": "171147422",
            "dpc": "03022500101",
            "name": "ឌុក ដារ៉ារិទ្ធ"
        },
        {
            "barcode": "171147423",
            "dpc": "03022500201",
            "name": "គ្រី ចន្ថា"
        },
        {
            "barcode": "171147424",
            "dpc": "03022500301",
            "name": "អង្គការក្តីសង្ឍឹមនៃកុមារ"
        },
        {
            "barcode": "171147425",
            "dpc": "03022504701",
            "name": "ភឹង ឆាន"
        },
        {
            "barcode": "171147426",
            "dpc": "03022504801",
            "name": "រឿម ធុច"
        },
        {
            "barcode": "171147427",
            "dpc": "03022505001",
            "name": "សំ វីរះ"
        },
        {
            "barcode": "171147428",
            "dpc": "03022505101",
            "name": "ឡិប អារ៉ាហ្វាត់"
        },
        {
            "barcode": "171147429",
            "dpc": "03022510401",
            "name": "ឯល ម៉ាស់"
        },
        {
            "barcode": "171147430",
            "dpc": "03022510701",
            "name": "សេម សុផល"
        },
        {
            "barcode": "171147431",
            "dpc": "03022515201",
            "name": "ស៊ីត សេត"
        },
        {
            "barcode": "171147432",
            "dpc": "03022516001",
            "name": "ជាង ឃ្លោក"
        },
        {
            "barcode": "171147433",
            "dpc": "03022516501",
            "name": "ដាំ ចំរើន"
        },
        {
            "barcode": "171147434",
            "dpc": "03022516601",
            "name": "គណៈបក្សសង្កាត់ ស្លាកែត"
        },
        {
            "barcode": "171147435",
            "dpc": "03022518501",
            "name": "ទេស កាសូម"
        },
        {
            "barcode": "171147436",
            "dpc": "03022521101",
            "name": "ដួង សំរស្មី"
        },
        {
            "barcode": "171147437",
            "dpc": "03022521501",
            "name": "វ៉ាត ស៊ីម"
        },
        {
            "barcode": "171147438",
            "dpc": "03022522401",
            "name": "អ៊ឹង ទី"
        },
        {
            "barcode": "171147439",
            "dpc": "03022523301",
            "name": "ម៉ាត់ ម៉ារី"
        },
        {
            "barcode": "171147440",
            "dpc": "03022524601",
            "name": "ហេង ប៊ុនលី"
        },
        {
            "barcode": "171147441",
            "dpc": "03022524701",
            "name": "ទឹម ហ៊ីង"
        },
        {
            "barcode": "171147442",
            "dpc": "03022525101",
            "name": "សួន នួន"
        },
        {
            "barcode": "171147443",
            "dpc": "03022540001",
            "name": "សែ ទូច"
        },
        {
            "barcode": "171147444",
            "dpc": "03022540101",
            "name": "ច្រែង រិទ្ធី"
        },
        {
            "barcode": "171147445",
            "dpc": "03022540201",
            "name": "ឡុង សាវ៉ាត"
        },
        {
            "barcode": "171147446",
            "dpc": "03022542601",
            "name": "ខាន់ ហុង"
        },
        {
            "barcode": "171147447",
            "dpc": "03022545301",
            "name": "ទីន សា"
        },
        {
            "barcode": "171147448",
            "dpc": "03022545401",
            "name": "ឌុក ឈូក"
        },
        {
            "barcode": "171147449",
            "dpc": "03022545601",
            "name": "ឯល ការីម ២"
        },
        {
            "barcode": "171147450",
            "dpc": "03022520101",
            "name": "សេង ហៃ១"
        },
        {
            "barcode": "171147451",
            "dpc": "03022543801",
            "name": "ត្រិច ថា"
        },
        {
            "barcode": "171147452",
            "dpc": "03022543701",
            "name": "វន់ វិបុល"
        },
        {
            "barcode": "171147453",
            "dpc": "03022534501",
            "name": "ប៊ុន វ៉ាន់ថា"
        },
        {
            "barcode": "171147454",
            "dpc": "03022521601",
            "name": "កែវ សាយ"
        },
        {
            "barcode": "171147455",
            "dpc": "03022521701",
            "name": "អ៊ី សំណាង"
        },
        {
            "barcode": "171147456",
            "dpc": "03022516101",
            "name": "ឯម ភិន"
        },
        {
            "barcode": "171147457",
            "dpc": "03022514501",
            "name": "ឈាន ឆឹម"
        },
        {
            "barcode": "171147458",
            "dpc": "03022510801",
            "name": "សួន ស៊ាប"
        },
        {
            "barcode": "171147459",
            "dpc": "03022534601",
            "name": "វណ្ណ កញ្ចណា"
        },
        {
            "barcode": "171147460",
            "dpc": "03022522001",
            "name": "ប៊ុន រ៉ន"
        },
        {
            "barcode": "171147461",
            "dpc": "03022521901",
            "name": "ជឿ គឹមឆាយ"
        },
        {
            "barcode": "171147462",
            "dpc": "03022521801",
            "name": "លី ង៉ា"
        },
        {
            "barcode": "171147463",
            "dpc": "03022517801",
            "name": "យិប វ៉ៃ"
        },
        {
            "barcode": "171147464",
            "dpc": "03022516201",
            "name": "ឈួម រួម"
        },
        {
            "barcode": "171147465",
            "dpc": "03022511001",
            "name": "សំ សាវៀង"
        },
        {
            "barcode": "171147466",
            "dpc": "03022510901",
            "name": "សេង ជា"
        },
        {
            "barcode": "171147467",
            "dpc": "03022500501",
            "name": "សុច ក្រួច"
        },
        {
            "barcode": "171147468",
            "dpc": "03022522201",
            "name": "ពុំ វណ្ណ"
        },
        {
            "barcode": "171147469",
            "dpc": "03022520201",
            "name": "យិន សាវុធ"
        },
        {
            "barcode": "171147470",
            "dpc": "03022511101",
            "name": "សេង គឹមហ៊ាក"
        },
        {
            "barcode": "171147471",
            "dpc": "03022505501",
            "name": "លុន ឆោម"
        },
        {
            "barcode": "171147472",
            "dpc": "03022505401",
            "name": "យុទ្ធ ពន្លក"
        },
        {
            "barcode": "171147473",
            "dpc": "03022500701",
            "name": "ពិន ចាន់នៀត"
        },
        {
            "barcode": "171147474",
            "dpc": "03022500601",
            "name": "ញឹម មន្ថា"
        },
        {
            "barcode": "171147475",
            "dpc": "03022546801",
            "name": "ប៊ុន រុំ"
        },
        {
            "barcode": "171147476",
            "dpc": "03022539301",
            "name": "យ៉ិន សារ៉ុម"
        },
        {
            "barcode": "171147477",
            "dpc": "03022505301",
            "name": "លឹម សុភ័ក្រ"
        },
        {
            "barcode": "171147478",
            "dpc": "03022539501",
            "name": "ជា ទ្រីប៊ុនរ័ត្ន"
        },
        {
            "barcode": "171147479",
            "dpc": "03022514601",
            "name": "វង់ កក្កដា"
        },
        {
            "barcode": "171147480",
            "dpc": "03022500901",
            "name": "ភួង សាមុត"
        },
        {
            "barcode": "171147481",
            "dpc": "03022500801",
            "name": "អឿ មេត្រី"
        },
        {
            "barcode": "171147482",
            "dpc": "03022501201",
            "name": "ហ៊ីម សុខខា"
        },
        {
            "barcode": "171147483",
            "dpc": "03022501101",
            "name": "យូ ស៊ីជ្រុន"
        },
        {
            "barcode": "171147484",
            "dpc": "03022501001",
            "name": "សាលា ឧបោសថសីល"
        },
        {
            "barcode": "171147485",
            "dpc": "03022520301",
            "name": "សឿម ស៊ុន"
        },
        {
            "barcode": "171147486",
            "dpc": "03022516301",
            "name": "រី រិទ្ធី"
        },
        {
            "barcode": "171147487",
            "dpc": "03022505701",
            "name": "អេន ស៊ីណា"
        },
        {
            "barcode": "171147488",
            "dpc": "03022505601",
            "name": "អេន សាវឌី"
        },
        {
            "barcode": "171147489",
            "dpc": "03022504901",
            "name": "ទេព នីន"
        },
        {
            "barcode": "171147490",
            "dpc": "03022546901",
            "name": "លឹម ទូច"
        },
        {
            "barcode": "171147491",
            "dpc": "03022539401",
            "name": "រស់ សារ៉ុន"
        },
        {
            "barcode": "171147492",
            "dpc": "03022534701",
            "name": "លឿម វុទ្ធី"
        },
        {
            "barcode": "171147493",
            "dpc": "03022522101",
            "name": "លីម តូយ"
        },
        {
            "barcode": "171147494",
            "dpc": "03022519101",
            "name": "តូច ខៃ"
        },
        {
            "barcode": "171147495",
            "dpc": "03022517901",
            "name": "ទន វិន"
        },
        {
            "barcode": "171147496",
            "dpc": "03022520601",
            "name": "យឿង យ៉េត"
        },
        {
            "barcode": "171147497",
            "dpc": "03022511201",
            "name": "សៀង សុថង ៤"
        },
        {
            "barcode": "171147498",
            "dpc": "03022505201",
            "name": "ហាំង ឡេង"
        },
        {
            "barcode": "171147499",
            "dpc": "03022516401",
            "name": "ទីវ ជូឡុង"
        },
        {
            "barcode": "171147500",
            "dpc": "03022520801",
            "name": "វិត រិទ្ធី"
        },
        {
            "barcode": "171147501",
            "dpc": "03022547101",
            "name": "សុខ ប៊ុនដារ៉ា"
        },
        {
            "barcode": "171147502",
            "dpc": "03022510201",
            "name": "ម៉ាត រ៉ែ"
        },
        {
            "barcode": "171147503",
            "dpc": "03022504001",
            "name": "ឡេះ ហ្វាស៊ី"
        },
        {
            "barcode": "171147504",
            "dpc": "03022504201",
            "name": "ណុះ សារិទ្ធ"
        },
        {
            "barcode": "171147505",
            "dpc": "03022504101",
            "name": "យី សេមម៉ូស្លីម"
        },
        {
            "barcode": "171147506",
            "dpc": "03022515901",
            "name": "ណាម មុនី"
        },
        {
            "barcode": "171147507",
            "dpc": "03022504401",
            "name": "រស់ ម៉ៅ"
        },
        {
            "barcode": "171147508",
            "dpc": "03022524801",
            "name": "សឹម ហ៊ូសាន"
        },
        {
            "barcode": "171147509",
            "dpc": "03022519301",
            "name": "លី រ៉ានី"
        },
        {
            "barcode": "171147510",
            "dpc": "03022510101",
            "name": "ទា ប៊ីណា"
        },
        {
            "barcode": "171147511",
            "dpc": "03022504301",
            "name": "កៅ ជប៉ុន"
        },
        {
            "barcode": "171147512",
            "dpc": "03022535001",
            "name": "ប្រាក់ ចាន់ណា"
        },
        {
            "barcode": "171147513",
            "dpc": "03022540601",
            "name": "លឹម សុភ័ណ្ឌ"
        },
        {
            "barcode": "171147514",
            "dpc": "03022540501",
            "name": "ហុង សុភាព"
        },
        {
            "barcode": "171147515",
            "dpc": "03022540301",
            "name": "អឿ ប៊ុនថន"
        },
        {
            "barcode": "171147516",
            "dpc": "03022547901",
            "name": "ផេង រុងរឿង"
        },
        {
            "barcode": "171147517",
            "dpc": "03022548001",
            "name": "ពេជ្រ គឹមធា"
        },
        {
            "barcode": "171148066",
            "dpc": "03022523001",
            "name": "អ៊ុក ចាន់ម៉ាលី ២"
        }
    ];


barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
