let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=

    [
        {
            "barcode": "171145247",
            "dpc": "03032630301",
            "name": "ពៅ ជ្រិន"
        },
        {
            "barcode": "171145248",
            "dpc": "03032618401",
            "name": "វ៉ាន់ សុខា"
        },
        {
            "barcode": "171145249",
            "dpc": "03032607301",
            "name": "ពៅ ស្រីពេជ្រ"
        },
        {
            "barcode": "171145250",
            "dpc": "03032642101",
            "name": "ទិន សាមិត្ត"
        },
        {
            "barcode": "171145251",
            "dpc": "03032637801",
            "name": "ថូ សុភា"
        },
        {
            "barcode": "171145252",
            "dpc": "03032630501",
            "name": "ប៉ែន សារ៉ា"
        },
        {
            "barcode": "171145253",
            "dpc": "03032630101",
            "name": "មុយ គារ"
        },
        {
            "barcode": "171145254",
            "dpc": "03032630001",
            "name": "ឡាយ អូន"
        },
        {
            "barcode": "171145255",
            "dpc": "03032628801",
            "name": "យ៉ាន់ យឿន"
        },
        {
            "barcode": "171145256",
            "dpc": "03032622401",
            "name": "លន់ យឿន"
        },
        {
            "barcode": "171145257",
            "dpc": "03032614901",
            "name": "មុត មាន"
        },
        {
            "barcode": "171145258",
            "dpc": "03032614701",
            "name": "តាំង ប៊ុនហួត"
        },
        {
            "barcode": "171145259",
            "dpc": "03032605301",
            "name": "សេក វណ្ណថន"
        },
        {
            "barcode": "171145260",
            "dpc": "03032605201",
            "name": "តាន់ គឹមឡេង"
        },
        {
            "barcode": "171145261",
            "dpc": "03032601001",
            "name": "ញ៉ែម គឹមហេង"
        },
        {
            "barcode": "171145262",
            "dpc": "03032634501",
            "name": "កែ សៅ"
        },
        {
            "barcode": "171145263",
            "dpc": "03032626201",
            "name": "ជឿន គឹមសួរ"
        },
        {
            "barcode": "171145264",
            "dpc": "03032621501",
            "name": "ដួង ដារ៉ា"
        },
        {
            "barcode": "171145265",
            "dpc": "03032621401",
            "name": "ព្រំ ចំរើន"
        },
        {
            "barcode": "171145266",
            "dpc": "03032600801",
            "name": "ច័ន្ទ ថាវី"
        },
        {
            "barcode": "171145267",
            "dpc": "03032627201",
            "name": "យឹម ខេមរៈ"
        },
        {
            "barcode": "171145268",
            "dpc": "03032621201",
            "name": "ឈឹម សាមុន"
        },
        {
            "barcode": "171145269",
            "dpc": "03032619501",
            "name": "ចាន់ សេង"
        },
        {
            "barcode": "171145270",
            "dpc": "03032615301",
            "name": "ម៉ាស់ ម៉ាត់សេត"
        },
        {
            "barcode": "171145271",
            "dpc": "03032614801",
            "name": "ជា លែងហួត"
        },
        {
            "barcode": "171145272",
            "dpc": "03032607701",
            "name": "ចាន់ សុខា"
        },
        {
            "barcode": "171145273",
            "dpc": "03032600901",
            "name": "ឡិប ណាវី"
        },
        {
            "barcode": "171145274",
            "dpc": "03032626601",
            "name": "ញ៉ែម សុធូ"
        },
        {
            "barcode": "171145275",
            "dpc": "03032626101",
            "name": "ជា ខាំ"
        },
        {
            "barcode": "171145276",
            "dpc": "03032626001",
            "name": "ជា ពន្លឺរស្មី"
        },
        {
            "barcode": "171145277",
            "dpc": "03032625901",
            "name": "ហោ ឃឺន"
        },
        {
            "barcode": "171145278",
            "dpc": "03032625801",
            "name": "ជា ង៉ិត"
        },
        {
            "barcode": "171145279",
            "dpc": "03032625701",
            "name": "ព្រុំ វណ្ណារី"
        },
        {
            "barcode": "171145280",
            "dpc": "03032624601",
            "name": "ឃុន ចន្ធី"
        },
        {
            "barcode": "171145281",
            "dpc": "03032623001",
            "name": "វី សាវង់"
        },
        {
            "barcode": "171145282",
            "dpc": "03032621801",
            "name": "កែវ អន"
        },
        {
            "barcode": "171145283",
            "dpc": "03032621701",
            "name": "ណម សុផាន"
        },
        {
            "barcode": "171145284",
            "dpc": "03032619601",
            "name": "វ៉ាន់ ស៊ីន"
        },
        {
            "barcode": "171145285",
            "dpc": "03032605601",
            "name": "ចុន ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171145286",
            "dpc": "03032636401",
            "name": "ជា ធូ"
        },
        {
            "barcode": "171145287",
            "dpc": "03032636201",
            "name": "តឹក ឃុន"
        },
        {
            "barcode": "171145288",
            "dpc": "03032634401",
            "name": "លី កែវ"
        },
        {
            "barcode": "171145289",
            "dpc": "03032630401",
            "name": "ឆន វុទ្ធា"
        },
        {
            "barcode": "171145290",
            "dpc": "03032626501",
            "name": "សួន សុដានី"
        },
        {
            "barcode": "171145291",
            "dpc": "03032626401",
            "name": "កែវ ចាន់ថុល"
        },
        {
            "barcode": "171145292",
            "dpc": "03032623201",
            "name": "ស៊ុក វ៉ាន់ឌី"
        },
        {
            "barcode": "171145293",
            "dpc": "03032623101",
            "name": "ឈឹម ភីណាល់"
        },
        {
            "barcode": "171145294",
            "dpc": "03032622701",
            "name": "សុន សាវឿន"
        },
        {
            "barcode": "171145295",
            "dpc": "03032619701",
            "name": "ហាន់ ហ៊ីម"
        },
        {
            "barcode": "171145296",
            "dpc": "03032614201",
            "name": "ហង់ វណ្ណី"
        },
        {
            "barcode": "171145297",
            "dpc": "03032614101",
            "name": "ក្រេម ប៉ូលីន"
        },
        {
            "barcode": "171145298",
            "dpc": "03032610701",
            "name": "ចាន់ ណារ៉ុង"
        },
        {
            "barcode": "171145299",
            "dpc": "03032608601",
            "name": "លី សុខសីហា"
        },
        {
            "barcode": "171145300",
            "dpc": "03032608301",
            "name": "ប៉ុន សេដ្ឋា"
        },
        {
            "barcode": "171145301",
            "dpc": "03032607601",
            "name": "សយ វ៉ិន"
        },
        {
            "barcode": "171145302",
            "dpc": "03032607501",
            "name": "ឯក កេត"
        },
        {
            "barcode": "171145303",
            "dpc": "03032607401",
            "name": "សរ សំណាង"
        },
        {
            "barcode": "171145304",
            "dpc": "03032606601",
            "name": "ហាវ ចន្ទតារា"
        },
        {
            "barcode": "171145305",
            "dpc": "03032640101",
            "name": "តាំង គី"
        },
        {
            "barcode": "171145306",
            "dpc": "03032608001",
            "name": "វ៉ាន់ សារុំ"
        },
        {
            "barcode": "171145307",
            "dpc": "03032633501",
            "name": "ទួន ថាវី"
        },
        {
            "barcode": "171145308",
            "dpc": "03032618501",
            "name": "លី ម៉ៃហ្វុង"
        },
        {
            "barcode": "171145309",
            "dpc": "03032602501",
            "name": "លឹម ខន"
        },
        {
            "barcode": "171145310",
            "dpc": "03032601601",
            "name": "នុត ធួក"
        },
        {
            "barcode": "171145311",
            "dpc": "03032637701",
            "name": "ថុន ថាលីន"
        },
        {
            "barcode": "171145312",
            "dpc": "03032625201",
            "name": "លី អ៊ុតនី"
        },
        {
            "barcode": "171145313",
            "dpc": "03032629701",
            "name": "នាង ណៃ"
        },
        {
            "barcode": "171145314",
            "dpc": "03032602401",
            "name": "គឹម ណារេត"
        },
        {
            "barcode": "171145315",
            "dpc": "03032635601",
            "name": "ជា សុផាន់ណា"
        },
        {
            "barcode": "171145316",
            "dpc": "03032617601",
            "name": "កង សុវណ្ណអង្គារ"
        },
        {
            "barcode": "171145317",
            "dpc": "03032635501",
            "name": "ឡាច ផូ"
        },
        {
            "barcode": "171145318",
            "dpc": "03032637601",
            "name": "ជួង កែវរដ្ឋា"
        },
        {
            "barcode": "171145319",
            "dpc": "03032618901",
            "name": "ចៅ ណាង"
        },
        {
            "barcode": "171145320",
            "dpc": "03032634001",
            "name": "សំ ផន"
        },
        {
            "barcode": "171145321",
            "dpc": "03032602201",
            "name": "សំ ជ្រីម"
        },
        {
            "barcode": "171145322",
            "dpc": "03032624701",
            "name": "ឡូញ ពៅ"
        },
        {
            "barcode": "171145323",
            "dpc": "03032619001",
            "name": "កែវ សុវណ្ណ"
        },
        {
            "barcode": "171145324",
            "dpc": "03032602901",
            "name": "ហង់ វណ្ឌី"
        },
        {
            "barcode": "171145325",
            "dpc": "03032640801",
            "name": "ប៉ុក វ៉ុង"
        },
        {
            "barcode": "171145326",
            "dpc": "03032618701",
            "name": "ជូ កែវពិសិដ្ឋ"
        },
        {
            "barcode": "171145327",
            "dpc": "03032622601",
            "name": "នៅ ចាន់"
        },
        {
            "barcode": "171145328",
            "dpc": "03032618801",
            "name": "ហាប់ វី"
        },
        {
            "barcode": "171145329",
            "dpc": "03032601101",
            "name": "សុខ អេង"
        },
        {
            "barcode": "171145330",
            "dpc": "03032600101",
            "name": "គឹម ឡី"
        },
        {
            "barcode": "171145331",
            "dpc": "03032644101",
            "name": "ស៊ុន សុវណ្ណារិទ្ធ"
        },
        {
            "barcode": "171145332",
            "dpc": "03032644001",
            "name": "នួន សុខា"
        },
        {
            "barcode": "171145333",
            "dpc": "03032622501",
            "name": "ដែក ចាន់នួន"
        },
        {
            "barcode": "171145334",
            "dpc": "03032633801",
            "name": "អ៊ុង សុភ័ណ្ឌ"
        },
        {
            "barcode": "171145335",
            "dpc": "03032640301",
            "name": "ដោ ស៊ីនឿន"
        },
        {
            "barcode": "171145336",
            "dpc": "03032635701",
            "name": "ណាំ ណាន"
        },
        {
            "barcode": "171145337",
            "dpc": "03032633601",
            "name": "ស៊ិន សុជាតិ"
        },
        {
            "barcode": "171145338",
            "dpc": "03032632101",
            "name": "លី វ៉ាន់ណា"
        },
        {
            "barcode": "171145339",
            "dpc": "03032632001",
            "name": "គឹម លាង"
        },
        {
            "barcode": "171145340",
            "dpc": "03032633701",
            "name": "ប៉ាល់ តឹក"
        },
        {
            "barcode": "171145341",
            "dpc": "03032628301",
            "name": "ទឹម បំរ៉ុង"
        },
        {
            "barcode": "171145342",
            "dpc": "03032606701",
            "name": "ហុក ហេង"
        },
        {
            "barcode": "171145343",
            "dpc": "03032606501",
            "name": "ដួង ភាច"
        },
        {
            "barcode": "171145344",
            "dpc": "03032619801",
            "name": "សុខ សូល័ក្ខណ៍"
        },
        {
            "barcode": "171145345",
            "dpc": "03032608401",
            "name": "ឡាច ផេង"
        },
        {
            "barcode": "171145346",
            "dpc": "03032625501",
            "name": "ហុង ជីហាក់"
        },
        {
            "barcode": "171145347",
            "dpc": "03032624501",
            "name": "សុខ ណាវី"
        },
        {
            "barcode": "171145348",
            "dpc": "03032628701",
            "name": "ចិន មុំ(វត្តទួលតាឯក)"
        },
        {
            "barcode": "171145349",
            "dpc": "03032636101",
            "name": "ហេង ណេង"
        },
        {
            "barcode": "171145350",
            "dpc": "03032636001",
            "name": "ជិន ហឿន"
        },
        {
            "barcode": "171145351",
            "dpc": "03032632201",
            "name": "ទេព ករុណា"
        },
        {
            "barcode": "171145352",
            "dpc": "03032605701",
            "name": "យូ បូរ"
        },
        {
            "barcode": "171145353",
            "dpc": "03032633401",
            "name": "សេក ហួយ"
        },
        {
            "barcode": "171145354",
            "dpc": "03032608201",
            "name": "អ៊ុច សុខហ៊ាង"
        },
        {
            "barcode": "171145355",
            "dpc": "03032607801",
            "name": "ថង ឈិនសុភា"
        },
        {
            "barcode": "171145356",
            "dpc": "03032644501",
            "name": "ទួន សុខម៉េង"
        },
        {
            "barcode": "171145357",
            "dpc": "03032607901",
            "name": "ឡុង សារេត"
        },
        {
            "barcode": "171145358",
            "dpc": "03032619201",
            "name": "រិន ពន្លក"
        },
        {
            "barcode": "171145359",
            "dpc": "03032637501",
            "name": "ច្រឹង ច័ន្ទរស្មី"
        },
        {
            "barcode": "171145360",
            "dpc": "03032628601",
            "name": "ហេង វុទ្ធី"
        },
        {
            "barcode": "171145361",
            "dpc": "03032615201",
            "name": "សេង សោម៉ា"
        },
        {
            "barcode": "171145362",
            "dpc": "03032619101",
            "name": "ម៉ែន សំអុល"
        },
        {
            "barcode": "171145363",
            "dpc": "03032635901",
            "name": "ទ្រី គឹមហៀង"
        },
        {
            "barcode": "171145364",
            "dpc": "03032603101",
            "name": "វង្ស ណៃ"
        },
        {
            "barcode": "171145365",
            "dpc": "03032600601",
            "name": "ឈុន លីណា"
        },
        {
            "barcode": "171145366",
            "dpc": "03032603001",
            "name": "ហាក់ ស្រី"
        },
        {
            "barcode": "171145367",
            "dpc": "03032622801",
            "name": "ឡុង វិត"
        },
        {
            "barcode": "171145368",
            "dpc": "03032631801",
            "name": "សេង រ៉ានី"
        },
        {
            "barcode": "171145369",
            "dpc": "03032633901",
            "name": "ហ៊ាង សុខហេង"
        },
        {
            "barcode": "171145370",
            "dpc": "03032631901",
            "name": "ឈាង សែម"
        },
        {
            "barcode": "171145371",
            "dpc": "03032600201",
            "name": "ឃុត សោភ័ណ"
        },
        {
            "barcode": "171145372",
            "dpc": "03032602601",
            "name": "រ៉ុន ចាន់ធី"
        },
        {
            "barcode": "171145373",
            "dpc": "03032602701",
            "name": "សុខ ចំរើន"
        },
        {
            "barcode": "171145374",
            "dpc": "03032621901",
            "name": "មឿត សាមឿន"
        },
        {
            "barcode": "171145375",
            "dpc": "03032603201",
            "name": "នួន សុគុណ"
        },
        {
            "barcode": "171145376",
            "dpc": "03032630201",
            "name": "ឃាន សំណាង"
        },
        {
            "barcode": "171145377",
            "dpc": "03032633301",
            "name": "គង់ សម"
        },
        {
            "barcode": "171145378",
            "dpc": "03032602101",
            "name": "សៅ សុភក្តិ"
        },
        {
            "barcode": "171145379",
            "dpc": "03032605901",
            "name": "មាស លីហួយ"
        },
        {
            "barcode": "171145380",
            "dpc": "03032609401",
            "name": "ប៊ុន ណាក់"
        },
        {
            "barcode": "171145381",
            "dpc": "03032620901",
            "name": "តាំង យ៉ាវ"
        },
        {
            "barcode": "171145382",
            "dpc": "03032630801",
            "name": "តែ គឹមសួន"
        },
        {
            "barcode": "171145383",
            "dpc": "03032615401",
            "name": "ម៉ៅ សុវណ្ណារី"
        },
        {
            "barcode": "171145384",
            "dpc": "03032641201",
            "name": "លី ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171145385",
            "dpc": "03032633001",
            "name": "លាង ហាក់"
        },
        {
            "barcode": "171145386",
            "dpc": "03032639901",
            "name": "ហុក កុសល៤"
        },
        {
            "barcode": "171145387",
            "dpc": "03032640001",
            "name": "បៅ តុង"
        },
        {
            "barcode": "171145388",
            "dpc": "03032643901",
            "name": "លឹម ឃុន"
        },
        {
            "barcode": "171145389",
            "dpc": "03032636701",
            "name": "សួ លី១"
        },
        {
            "barcode": "171145390",
            "dpc": "03032638501",
            "name": "ឡុង ផន"
        },
        {
            "barcode": "171145391",
            "dpc": "03032638601",
            "name": "សែន គីមស៊ន"
        },
        {
            "barcode": "171145392",
            "dpc": "03032643701",
            "name": "សំ សេង"
        },
        {
            "barcode": "171145393",
            "dpc": "03032627701",
            "name": "យៀង គឹមយ៉ា"
        },
        {
            "barcode": "171145394",
            "dpc": "03032636801",
            "name": "សំ សេង ១"
        },
        {
            "barcode": "171145395",
            "dpc": "03032643801",
            "name": "កេង កន្និដ្ឋា"
        },
        {
            "barcode": "171145396",
            "dpc": "03032616301",
            "name": "លី ឆទិញ"
        },
        {
            "barcode": "171145397",
            "dpc": "03032620801",
            "name": "ភៀន សុផល"
        },
        {
            "barcode": "171145398",
            "dpc": "03032617701",
            "name": "សួ លី"
        },
        {
            "barcode": "171145399",
            "dpc": "03032606401",
            "name": "សុខ ភាព"
        },
        {
            "barcode": "171145400",
            "dpc": "03032606801",
            "name": "គឹម លី"
        },
        {
            "barcode": "171145401",
            "dpc": "03032614001",
            "name": "ជួន ប៉ូឡូ"
        },
        {
            "barcode": "171145402",
            "dpc": "03032621101",
            "name": "ជា វិដេ"
        },
        {
            "barcode": "171145403",
            "dpc": "03032629601",
            "name": "ហ៊ី ស៊ីថា"
        },
        {
            "barcode": "171145404",
            "dpc": "03032610501",
            "name": "តន់ សាវ៉ាត់"
        },
        {
            "barcode": "171145405",
            "dpc": "03032621001",
            "name": "ជា ពេង"
        },
        {
            "barcode": "171145406",
            "dpc": "03032638401",
            "name": "សោម សំនៀង"
        },
        {
            "barcode": "171145407",
            "dpc": "03032639201",
            "name": "សេង សុខនី"
        },
        {
            "barcode": "171145408",
            "dpc": "03032600401",
            "name": "កេង សុខហេង"
        },
        {
            "barcode": "171145409",
            "dpc": "03032609301",
            "name": "ថន គឹមហុង ១"
        },
        {
            "barcode": "171145410",
            "dpc": "03032607101",
            "name": "លឹម រក្សា"
        },
        {
            "barcode": "171145411",
            "dpc": "03032607201",
            "name": "តាំង ហុកសេង"
        },
        {
            "barcode": "171145412",
            "dpc": "03032610201",
            "name": "ឆាន់ រឿន"
        },
        {
            "barcode": "171145413",
            "dpc": "03032606301",
            "name": "មាស ឧត្តម"
        },
        {
            "barcode": "171145414",
            "dpc": "03032606201",
            "name": "លាង ហាវ"
        },
        {
            "barcode": "171145415",
            "dpc": "03032645401",
            "name": "ង៉ោ គន្ធា"
        },
        {
            "barcode": "171145416",
            "dpc": "03032645301",
            "name": "ហ៊ុយ ស៊ីម១"
        },
        {
            "barcode": "171145417",
            "dpc": "03032610101",
            "name": "តាន់ ឡួង"
        },
        {
            "barcode": "171145418",
            "dpc": "03032616801",
            "name": "ឃូ ឡេង"
        },
        {
            "barcode": "171145419",
            "dpc": "03032609501",
            "name": "សុខ ឡេង"
        },
        {
            "barcode": "171145420",
            "dpc": "03032609201",
            "name": "ជា ចំរើន"
        },
        {
            "barcode": "171145421",
            "dpc": "03032603801",
            "name": "ហ្គូវ លាងគា"
        },
        {
            "barcode": "171145422",
            "dpc": "03032609101",
            "name": "សាន ពលៈ"
        },
        {
            "barcode": "171145423",
            "dpc": "03032630901",
            "name": "អេង ម៉េង"
        },
        {
            "barcode": "171145424",
            "dpc": "03032601901",
            "name": "យ៉ង់ ហាវ"
        },
        {
            "barcode": "171145425",
            "dpc": "03032609001",
            "name": "តាំង សុខហ៊ី"
        },
        {
            "barcode": "171145426",
            "dpc": "03032627601",
            "name": "ហុង ស៊ីវ"
        },
        {
            "barcode": "171145427",
            "dpc": "03032639401",
            "name": "ឃីម គឹមលាង"
        },
        {
            "barcode": "171145428",
            "dpc": "03032616101",
            "name": "គឹម ពេជ្រ"
        },
        {
            "barcode": "171145429",
            "dpc": "03032610301",
            "name": "ម៉ៃ ផាណា"
        },
        {
            "barcode": "171145430",
            "dpc": "03032606901",
            "name": "សួរ ឃីម"
        },
        {
            "barcode": "171145431",
            "dpc": "03032647901",
            "name": "ញ៉ែម តិច"
        },
        {
            "barcode": "171145432",
            "dpc": "03032647801",
            "name": "អ៊ុន ទាគួង"
        },
        {
            "barcode": "171145433",
            "dpc": "03032647701",
            "name": "អ៊ុន ណារ៉ុង"
        },
        {
            "barcode": "171145434",
            "dpc": "03032647601",
            "name": "ឌឹម វីរោចន៍"
        },
        {
            "barcode": "171145435",
            "dpc": "03032647501",
            "name": "ស៊ី នួន"
        },
        {
            "barcode": "171145436",
            "dpc": "03032647301",
            "name": "ជិន ហុក"
        },
        {
            "barcode": "171145437",
            "dpc": "03032647201",
            "name": "ហឿង សុជាតិ"
        },
        {
            "barcode": "171145438",
            "dpc": "03032647101",
            "name": "តាន់ សៅដេត"
        },
        {
            "barcode": "171145439",
            "dpc": "03032647001",
            "name": "រ៉េន្ទ សុធន់"
        },
        {
            "barcode": "171145440",
            "dpc": "03032646501",
            "name": "កៅ សារ៉ាឌី"
        },
        {
            "barcode": "171145441",
            "dpc": "03032646401",
            "name": "ហ៊ួរ ហាវ"
        },
        {
            "barcode": "171145442",
            "dpc": "03032646301",
            "name": "រិម សុវឌ្ឍនា"
        },
        {
            "barcode": "171145443",
            "dpc": "03032628501",
            "name": "ជឺ ពុំ៤"
        },
        {
            "barcode": "171145444",
            "dpc": "03032635301",
            "name": "ហេង ទន"
        },
        {
            "barcode": "171145445",
            "dpc": "03032623401",
            "name": "ស៊ុន សាវ៉ាត"
        },
        {
            "barcode": "171145446",
            "dpc": "03032629501",
            "name": "យ៉ុង យី"
        },
        {
            "barcode": "171145447",
            "dpc": "03032615801",
            "name": "ស្វាង សាវី"
        },
        {
            "barcode": "171145448",
            "dpc": "03032627501",
            "name": "សែម ដារា"
        },
        {
            "barcode": "171145449",
            "dpc": "03032615901",
            "name": "នេត អង់តូនី"
        },
        {
            "barcode": "171145450",
            "dpc": "03032620701",
            "name": "យូ គាសៀង"
        },
        {
            "barcode": "171145451",
            "dpc": "03032620601",
            "name": "ចាំង វិនខង"
        },
        {
            "barcode": "171145452",
            "dpc": "03032623501",
            "name": "សេង លាងហេង"
        },
        {
            "barcode": "171145453",
            "dpc": "03032620501",
            "name": "ហេង សុខហួត"
        },
        {
            "barcode": "171145454",
            "dpc": "03032618201",
            "name": "ហូ គឹមហេង"
        },
        {
            "barcode": "171145455",
            "dpc": "03032618101",
            "name": "ដាញ់ អេងប៊ុនវ៉ាន់"
        },
        {
            "barcode": "171145456",
            "dpc": "03032616601",
            "name": "កឿន សត្យា"
        },
        {
            "barcode": "171145457",
            "dpc": "03032617301",
            "name": "ជឺ ពុំ ១"
        },
        {
            "barcode": "171145458",
            "dpc": "03032620401",
            "name": "ឆ អ៊ឹង"
        },
        {
            "barcode": "171145459",
            "dpc": "03032641901",
            "name": "តាំង ផេងហ៊ី"
        },
        {
            "barcode": "171145460",
            "dpc": "03032642001",
            "name": "តាំង ផេងហ៊ី ១"
        },
        {
            "barcode": "171145461",
            "dpc": "03032616501",
            "name": "ងិន សុកជា"
        },
        {
            "barcode": "171145462",
            "dpc": "03032616401",
            "name": "ស៊ី ថាពេជ្រ"
        },
        {
            "barcode": "171145463",
            "dpc": "03032617201",
            "name": "សាន់ ហៃ"
        },
        {
            "barcode": "171145464",
            "dpc": "03032615701",
            "name": "គឹម ម៉ូលី"
        },
        {
            "barcode": "171145465",
            "dpc": "03032615601",
            "name": "គា លីហូវ"
        },
        {
            "barcode": "171145466",
            "dpc": "03032615501",
            "name": "យូ គាសី"
        },
        {
            "barcode": "171145467",
            "dpc": "03032623601",
            "name": "ថា ប៊ុនធឿន"
        },
        {
            "barcode": "171145468",
            "dpc": "03032620201",
            "name": "សុខ ធី"
        },
        {
            "barcode": "171145469",
            "dpc": "03032623701",
            "name": "យ៉ាន់ ម៉ៅ"
        },
        {
            "barcode": "171145470",
            "dpc": "03032623801",
            "name": "រិន សម្បត្តិ"
        },
        {
            "barcode": "171145471",
            "dpc": "03032638801",
            "name": "នឹម ស៊ីនួន"
        },
        {
            "barcode": "171145472",
            "dpc": "03032626301",
            "name": "អ៊ិន ឧត្តម"
        },
        {
            "barcode": "171145473",
            "dpc": "03032619401",
            "name": "ហេង ហុក១"
        },
        {
            "barcode": "171145474",
            "dpc": "03032624201",
            "name": "លីម ម៉ីយិន"
        },
        {
            "barcode": "171145475",
            "dpc": "03032623901",
            "name": "សុខ រ៉ែន"
        },
        {
            "barcode": "171145476",
            "dpc": "03032627901",
            "name": "ឯម សាវ៉ាត់"
        },
        {
            "barcode": "171145477",
            "dpc": "03032632401",
            "name": "ឡុង អេងថៃ"
        },
        {
            "barcode": "171145478",
            "dpc": "03032632301",
            "name": "ទុយ វីន"
        },
        {
            "barcode": "171145479",
            "dpc": "03032629201",
            "name": "សូ សុកិត្យា"
        },
        {
            "barcode": "171145480",
            "dpc": "03032628101",
            "name": "ពៅ កញ្ញា"
        },
        {
            "barcode": "171145481",
            "dpc": "03032633101",
            "name": "ពឹង គឹមជូ"
        },
        {
            "barcode": "171145482",
            "dpc": "03032645701",
            "name": "ចៅ ស៊ីនលី"
        },
        {
            "barcode": "171145483",
            "dpc": "03032639601",
            "name": "សុង ហេង"
        },
        {
            "barcode": "171145484",
            "dpc": "03032631001",
            "name": "វ៉ាត ទូច"
        },
        {
            "barcode": "171145485",
            "dpc": "03032641301",
            "name": "តាំង សុវឌ្ឍនា"
        },
        {
            "barcode": "171145486",
            "dpc": "03032631101",
            "name": "តាន់ ប៊ុនពៅ"
        },
        {
            "barcode": "171145487",
            "dpc": "03032645501",
            "name": "ប៊ុន ហឿន ១"
        },
        {
            "barcode": "171145488",
            "dpc": "03032634601",
            "name": "ឡាយ ច័ន្ទរិទ្ធ"
        },
        {
            "barcode": "171145489",
            "dpc": "03032623301",
            "name": "ស៊ុំ នារ៉ា"
        },
        {
            "barcode": "171145490",
            "dpc": "03032639501",
            "name": "ធុច វ៉ា"
        },
        {
            "barcode": "171145491",
            "dpc": "03032627801",
            "name": "ធុច វណ្ណារ៉ាត់"
        },
        {
            "barcode": "171145492",
            "dpc": "03032625601",
            "name": "ពា លីហួរ"
        },
        {
            "barcode": "171145493",
            "dpc": "03032610601",
            "name": "ឈាង គុយ ហ៊ី"
        },
        {
            "barcode": "171145494",
            "dpc": "03032610401",
            "name": "សេម សេង"
        },
        {
            "barcode": "171145495",
            "dpc": "03032637201",
            "name": "សុធី គីរី"
        },
        {
            "barcode": "171145496",
            "dpc": "03032638901",
            "name": "ហួត ថាវី"
        },
        {
            "barcode": "171145497",
            "dpc": "03032643601",
            "name": "ជា បុប្ផា"
        },
        {
            "barcode": "171145498",
            "dpc": "03032631501",
            "name": "ហ៊ុន ម៉ាលីស"
        },
        {
            "barcode": "171145499",
            "dpc": "03032632801",
            "name": "អ៊ឹង ឡៃគីម"
        },
        {
            "barcode": "171145500",
            "dpc": "03032632701",
            "name": "អាង យ៉េង"
        },
        {
            "barcode": "171145501",
            "dpc": "03032632601",
            "name": "ចេង លីស៊ុនឃាង"
        },
        {
            "barcode": "171145502",
            "dpc": "03032628201",
            "name": "ច័ន្ទ ថន"
        },
        {
            "barcode": "171145503",
            "dpc": "03032643501",
            "name": "ចន្ទ័ ហេង"
        },
        {
            "barcode": "171145504",
            "dpc": "03032632501",
            "name": "ខៀវ ផាត់ជិន្នី"
        },
        {
            "barcode": "171145505",
            "dpc": "03032637101",
            "name": "ភោគ សុភី"
        },
        {
            "barcode": "171145506",
            "dpc": "03032645801",
            "name": "ស៊ិន សេរីរ័ត្ន"
        },
        {
            "barcode": "171145507",
            "dpc": "03032639801",
            "name": "ហង្ស សុធារ័ត្ន"
        },
        {
            "barcode": "171145508",
            "dpc": "03032645901",
            "name": "លឹម សុខខេង ១"
        },
        {
            "barcode": "171145509",
            "dpc": "03032646001",
            "name": "លឹម សុខខេង ២"
        },
        {
            "barcode": "171145510",
            "dpc": "03032639001",
            "name": "ហៀង ម៉ារី"
        },
        {
            "barcode": "171145511",
            "dpc": "03032641701",
            "name": "ម៉ែង សុធាកន្និដ្ឋា"
        },
        {
            "barcode": "171145512",
            "dpc": "03032641601",
            "name": "ទឹម ប៊ុនធី"
        },
        {
            "barcode": "171145513",
            "dpc": "03032646101",
            "name": "ហាន ស៊ីហ៊ីប"
        },
        {
            "barcode": "171145514",
            "dpc": "03032637301",
            "name": "ប៊ិច សារឿត"
        },
        {
            "barcode": "171145515",
            "dpc": "03032640601",
            "name": "ពៅ ទិញ"
        },
        {
            "barcode": "171145516",
            "dpc": "03032617401",
            "name": "ងិន ចេង"
        },
        {
            "barcode": "171145517",
            "dpc": "03032617801",
            "name": "អាន ទីត"
        },
        {
            "barcode": "171145518",
            "dpc": "03032617901",
            "name": "អាន ទីត១"
        },
        {
            "barcode": "171145519",
            "dpc": "03032624001",
            "name": "សេង ស្រីពៅ"
        },
        {
            "barcode": "171145520",
            "dpc": "03032616001",
            "name": "សេង ស្រីពៅ ១"
        },
        {
            "barcode": "171145521",
            "dpc": "03032607001",
            "name": "ម៉ាក់ លីណា"
        },
        {
            "barcode": "171145522",
            "dpc": "03032629801",
            "name": "ហុក កុសល២"
        },
        {
            "barcode": "171145523",
            "dpc": "03032616701",
            "name": "ហុក កុសល"
        },
        {
            "barcode": "171145524",
            "dpc": "03032629301",
            "name": "អ៊ឹម ច័ន្ទសុធា"
        },
        {
            "barcode": "171145525",
            "dpc": "03032631201",
            "name": "តាំង ណាំផេង"
        },
        {
            "barcode": "171145526",
            "dpc": "03032629401",
            "name": "ស៊ាវ សុវិជ្ជរី"
        },
        {
            "barcode": "171145527",
            "dpc": "03032639701",
            "name": "ហ៊ឹង ហូលិវុធ"
        },
        {
            "barcode": "171145528",
            "dpc": "03032620101",
            "name": "ម៉ុក សុវណ្ណឌី"
        },
        {
            "barcode": "171145529",
            "dpc": "03032641501",
            "name": "ទិត ច័ន្ទ្រកេសី"
        },
        {
            "barcode": "171145530",
            "dpc": "03032631301",
            "name": "វ៉ើន វណ្ណៈ"
        },
        {
            "barcode": "171145531",
            "dpc": "03032625401",
            "name": "ផ្សាររោងចក្រតំបាញ"
        },
        {
            "barcode": "171145532",
            "dpc": "03032630601",
            "name": "ចាន់ ហួត"
        },
        {
            "barcode": "171145533",
            "dpc": "03032628901",
            "name": "អ៊ឹង សួរ"
        },
        {
            "barcode": "171145534",
            "dpc": "03032629001",
            "name": "ប៊ុន ចំរើន"
        },
        {
            "barcode": "171145535",
            "dpc": "03032629901",
            "name": "ងី លាងសេង"
        },
        {
            "barcode": "171145536",
            "dpc": "03032603901",
            "name": "តាន់ មីសស្សែល ២៥៦"
        },
        {
            "barcode": "171145537",
            "dpc": "03032613701",
            "name": "តាន់ មីសស្សែល ២៥២"
        },
        {
            "barcode": "171145538",
            "dpc": "03032613601",
            "name": "តាន់ មីសស្សែល ២៥០"
        },
        {
            "barcode": "171145539",
            "dpc": "03032613401",
            "name": "តាន់ មីសស្សែល ២៤៦"
        },
        {
            "barcode": "171145540",
            "dpc": "03032613301",
            "name": "តាន់ មីសស្សែល ២៤៤"
        },
        {
            "barcode": "171145541",
            "dpc": "03032613201",
            "name": "តាន់ មីសស្សែល ២៤២"
        },
        {
            "barcode": "171145542",
            "dpc": "03032613001",
            "name": "តាន់ មីសស្សែល ២៣៨"
        },
        {
            "barcode": "171145543",
            "dpc": "03032612901",
            "name": "តាន់ មីសស្សែល ២៣៦"
        },
        {
            "barcode": "171145544",
            "dpc": "03032612801",
            "name": "តាន់ មីសស្សែល ២៣៤"
        },
        {
            "barcode": "171145545",
            "dpc": "03032612701",
            "name": "តាន់ មីសស្សែល ២៣២"
        },
        {
            "barcode": "171145546",
            "dpc": "03032612601",
            "name": "តាន់ មីសស្សែល ២៣០"
        },
        {
            "barcode": "171145547",
            "dpc": "03032612501",
            "name": "តាន់ មីសស្សែល ២២៨"
        },
        {
            "barcode": "171145548",
            "dpc": "03032612401",
            "name": "តាន់ មីសស្សែល ២២៦"
        },
        {
            "barcode": "171145549",
            "dpc": "03032610801",
            "name": "តាន់ មីសស្សែល ២២៥"
        },
        {
            "barcode": "171145550",
            "dpc": "03032611001",
            "name": "តាន់ មីសស្សែល ២២៩"
        },
        {
            "barcode": "171145551",
            "dpc": "03032611101",
            "name": "តាន់ មីសស្សែល ២៣១"
        },
        {
            "barcode": "171145552",
            "dpc": "03032611201",
            "name": "តាន់ មីសស្សែល ២៣៣"
        },
        {
            "barcode": "171145553",
            "dpc": "03032611401",
            "name": "តាន់ មីសស្សែល ២៣៧"
        },
        {
            "barcode": "171145554",
            "dpc": "03032611501",
            "name": "តាន់ មីសស្សែល ២៣៩"
        },
        {
            "barcode": "171145555",
            "dpc": "03032611601",
            "name": "តាន់ មីសស្សែល ២៤១"
        },
        {
            "barcode": "171145556",
            "dpc": "03032612101",
            "name": "តាន់ មីសស្សែល ២៥១"
        },
        {
            "barcode": "171145557",
            "dpc": "03032612201",
            "name": "តាន់ មីសស្សែល ២៥៣"
        },
        {
            "barcode": "171145558",
            "dpc": "03032612301",
            "name": "តាន់ មីសស្សែល ២៥៥"
        },
        {
            "barcode": "171145559",
            "dpc": "03032605001",
            "name": "សឿន ចន្ថា"
        },
        {
            "barcode": "171145560",
            "dpc": "03032622201",
            "name": "រ៉ូ រ៉យ៉ា"
        },
        {
            "barcode": "171145561",
            "dpc": "03032605101",
            "name": "ជា បូព្រី"
        },
        {
            "barcode": "171145562",
            "dpc": "03032600501",
            "name": "ស៊ុន សុផា"
        },
        {
            "barcode": "171145563",
            "dpc": "03032621601",
            "name": "ផែ ណាំជៀវ"
        },
        {
            "barcode": "171145564",
            "dpc": "03032602801",
            "name": "ពិន ទី"
        },
        {
            "barcode": "171145565",
            "dpc": "03032603301",
            "name": "ម៉ី ផល្លា"
        },
        {
            "barcode": "171145566",
            "dpc": "03032622301",
            "name": "គឹម ឡាង"
        },
        {
            "barcode": "171145567",
            "dpc": "03032600301",
            "name": "ថាំង ចន្ថា"
        },
        {
            "barcode": "171145568",
            "dpc": "03032617001",
            "name": "ង៉ែត រ៉ែម"
        },
        {
            "barcode": "171145569",
            "dpc": "03032618601",
            "name": "ស្រី ម៉ានិត"
        },
        {
            "barcode": "171145570",
            "dpc": "03032638301",
            "name": "វិទ្យាល័យព្រះមុន្នីវង្ស"
        },
        {
            "barcode": "171145571",
            "dpc": "03032604701",
            "name": "សាបូអូហ្សាណូ"
        },
        {
            "barcode": "171145572",
            "dpc": "03032604101",
            "name": "គឹម ធីតា"
        },
        {
            "barcode": "171145573",
            "dpc": "03032604201",
            "name": "សុខ រីន"
        },
        {
            "barcode": "171145574",
            "dpc": "03032604601",
            "name": "កឹម សាផាន្នភិរម្យ"
        },
        {
            "barcode": "171145575",
            "dpc": "03032608801",
            "name": "ចាប ក្លូត"
        },
        {
            "barcode": "171145576",
            "dpc": "03032608901",
            "name": "ប៉ិល សុវណ្ណា"
        },
        {
            "barcode": "171145577",
            "dpc": "03032604401",
            "name": "ភោគ សុភី"
        },
        {
            "barcode": "171145578",
            "dpc": "03032604501",
            "name": "ហេង រតនា"
        },
        {
            "barcode": "171145579",
            "dpc": "03032638201",
            "name": "វិទ្យាល័យ សោហឺ"
        },
        {
            "barcode": "171145580",
            "dpc": "03032605501",
            "name": "ចេង រស្មី"
        },
        {
            "barcode": "171145581",
            "dpc": "03032608501",
            "name": "ចាន់ ឃឿង"
        },
        {
            "barcode": "171145582",
            "dpc": "03032624101",
            "name": "ឌុល ម៉ូលី"
        },
        {
            "barcode": "171145583",
            "dpc": "03032617101",
            "name": "ឈួម ប៉ាន"
        },
        {
            "barcode": "171145584",
            "dpc": "03032601701",
            "name": "គួច វែង"
        },
        {
            "barcode": "171145585",
            "dpc": "03032601401",
            "name": "ឈីវ គី"
        },
        {
            "barcode": "171145586",
            "dpc": "03032638001",
            "name": "ឌួង វណ្ណា ១"
        },
        {
            "barcode": "171145587",
            "dpc": "03032634801",
            "name": "ចាន់ ប៊ុនធឿន"
        },
        {
            "barcode": "171145588",
            "dpc": "03032624401",
            "name": "ឆាយ គឹមជា"
        },
        {
            "barcode": "171145589",
            "dpc": "03032614301",
            "name": "គង់ សុផល"
        },
        {
            "barcode": "171145590",
            "dpc": "03032603601",
            "name": "អៀ ម៉េងលុច"
        },
        {
            "barcode": "171145591",
            "dpc": "03032635201",
            "name": "ហ៊ាង សុខគីម"
        },
        {
            "barcode": "171145592",
            "dpc": "03032626801",
            "name": "សាន ហូ"
        },
        {
            "barcode": "171145593",
            "dpc": "03032606001",
            "name": "ធនាគារវឌ្ឍនៈ"
        },
        {
            "barcode": "171145594",
            "dpc": "03032617501",
            "name": "ជុំ សុខែម"
        },
        {
            "barcode": "171145595",
            "dpc": "03032626901",
            "name": "វៀច សេង"
        },
        {
            "barcode": "171145596",
            "dpc": "03032641101",
            "name": "ម៉ុក សារុំ"
        },
        {
            "barcode": "171145597",
            "dpc": "03032614401",
            "name": "ឃួន ប៊ុនធី"
        },
        {
            "barcode": "171145598",
            "dpc": "03032604301",
            "name": "ជា ពៅ"
        },
        {
            "barcode": "171145599",
            "dpc": "03032634201",
            "name": "ថោង សាវឿន"
        },
        {
            "barcode": "171145600",
            "dpc": "03032615101",
            "name": "ធួន ពន្លឺ"
        },
        {
            "barcode": "171145601",
            "dpc": "03032615001",
            "name": "ញ៉ក់ ចំរ៉ុង"
        },
        {
            "barcode": "171145602",
            "dpc": "03032601801",
            "name": "សួន គឹមអេង"
        },
        {
            "barcode": "171145603",
            "dpc": "03032603701",
            "name": "គឹម ហន"
        },
        {
            "barcode": "171145604",
            "dpc": "03032619901",
            "name": "នក់ ម៉ង់"
        },
        {
            "barcode": "171145605",
            "dpc": "03032635101",
            "name": "តាំង ចាន់ធី"
        },
        {
            "barcode": "171145606",
            "dpc": "03032601201",
            "name": "លឹម ស៊ីវហ្គិច"
        },
        {
            "barcode": "171145607",
            "dpc": "03032601301",
            "name": "ឈួន សុភាព"
        },
        {
            "barcode": "171145608",
            "dpc": "03032635001",
            "name": "ម៉ៅ ហ៊ួរ"
        },
        {
            "barcode": "171145609",
            "dpc": "03032625101",
            "name": "ធុច រ៉ា"
        },
        {
            "barcode": "171145610",
            "dpc": "03032629101",
            "name": "ណៃ ហុង"
        },
        {
            "barcode": "171145611",
            "dpc": "03032625301",
            "name": "ឈឿត ដានី"
        },
        {
            "barcode": "171145612",
            "dpc": "03032625001",
            "name": "រោ សេងវី"
        },
        {
            "barcode": "171145613",
            "dpc": "03032622901",
            "name": "ហ៊ុយ សុធារិទ្ធ"
        },
        {
            "barcode": "171145614",
            "dpc": "03032630701",
            "name": "ប៉ុក សុជាតិ"
        },
        {
            "barcode": "171145615",
            "dpc": "03032634101",
            "name": "តាន់ សុជិត"
        },
        {
            "barcode": "171145616",
            "dpc": "03032603401",
            "name": "ជា សុខ"
        },
        {
            "barcode": "171145617",
            "dpc": "03032638101",
            "name": "សាលា ២ធ្នូ"
        },
        {
            "barcode": "171145618",
            "dpc": "03032608701",
            "name": "យូ រ៉ាណេ"
        },
        {
            "barcode": "171145619",
            "dpc": "03032601501",
            "name": "ច្រឹក ណារ៉េត"
        },
        {
            "barcode": "171145620",
            "dpc": "03032600701",
            "name": "ឧប កែវផល្លី"
        },
        {
            "barcode": "171145621",
            "dpc": "03032640401",
            "name": "ឈុន ប៊ូ"
        },
        {
            "barcode": "171145622",
            "dpc": "03032602301",
            "name": "លីវ ប៊ុនឆេង"
        },
        {
            "barcode": "171145623",
            "dpc": "03032603501",
            "name": "ចាន់ ឃាង"
        },
        {
            "barcode": "171145624",
            "dpc": "03032604801",
            "name": "សែម នី"
        },
        {
            "barcode": "171145625",
            "dpc": "03032606101",
            "name": "ប៊ុន សារ៉ាវុធ"
        },
        {
            "barcode": "171145626",
            "dpc": "03032608101",
            "name": "ឈួរ មួយគាង"
        },
        {
            "barcode": "171145627",
            "dpc": "03032618001",
            "name": "ជេត សម្បត្តិ"
        },
        {
            "barcode": "171145628",
            "dpc": "03032624301",
            "name": "ជា សង្វាម៉ាលតី"
        },
        {
            "barcode": "171145629",
            "dpc": "03032624901",
            "name": "មៀច សុមន៍"
        },
        {
            "barcode": "171145630",
            "dpc": "03032626701",
            "name": "គូ គឹមស៊ា"
        },
        {
            "barcode": "171145631",
            "dpc": "03032627001",
            "name": "យ៉េត ហ៊ុន"
        },
        {
            "barcode": "171145632",
            "dpc": "03032627101",
            "name": "លី ចំរើន"
        },
        {
            "barcode": "171145633",
            "dpc": "03032631601",
            "name": "ពេជ្រ ផារី"
        },
        {
            "barcode": "171145634",
            "dpc": "03032631701",
            "name": "គុយ ផេង"
        },
        {
            "barcode": "171145635",
            "dpc": "03032634301",
            "name": "តាន់ មីសស្សែល ៣១"
        },
        {
            "barcode": "171145636",
            "dpc": "03032634901",
            "name": "ប៉ិល វណ្ណា"
        },
        {
            "barcode": "171145637",
            "dpc": "03032635401",
            "name": "សេង ប៉ោឡាយ"
        },
        {
            "barcode": "171145638",
            "dpc": "03032637901",
            "name": "ចាន់ ថន"
        },
        {
            "barcode": "171145639",
            "dpc": "03032640501",
            "name": "ឃួន ប៊ុនធី"
        },
        {
            "barcode": "171145640",
            "dpc": "03032640701",
            "name": "សាខាកាំកុងត្រូល"
        },
        {
            "barcode": "171145641",
            "dpc": "03032640901",
            "name": "ស៊ុំ យិធា"
        },
        {
            "barcode": "171145642",
            "dpc": "03032641001",
            "name": "ជូ គង់"
        },
        {
            "barcode": "171145643",
            "dpc": "03032642401",
            "name": "តាន់ មីសស្សែល ២១៤"
        },
        {
            "barcode": "171145644",
            "dpc": "03032642801",
            "name": "តាន់ មីសស្សែល ២០៦"
        },
        {
            "barcode": "171145645",
            "dpc": "03032643301",
            "name": "តាន់ មីសស្សែល ២១៣"
        },
        {
            "barcode": "171145646",
            "dpc": "03032644201",
            "name": "ចាន់ សុធានី"
        },
        {
            "barcode": "171145647",
            "dpc": "03032644301",
            "name": "លី គឹមឡាយ"
        },
        {
            "barcode": "171145648",
            "dpc": "03032644401",
            "name": "អ៊ាង ផល្លា"
        },
        {
            "barcode": "171145649",
            "dpc": "03032644601",
            "name": "ទី ទីត"
        },
        {
            "barcode": "171145650",
            "dpc": "03032644701",
            "name": "ហេង គឹមលី"
        },
        {
            "barcode": "171145651",
            "dpc": "03032644801",
            "name": "វ៉ាន់ នី"
        },
        {
            "barcode": "171145652",
            "dpc": "03032644901",
            "name": "អ៊ុន ណារ៉ុង"
        },
        {
            "barcode": "171145653",
            "dpc": "03032645001",
            "name": "អ៊ុំ ណារ៉ុង"
        },
        {
            "barcode": "171145654",
            "dpc": "03032645101",
            "name": "ជាង ហេង"
        },
        {
            "barcode": "171145655",
            "dpc": "03032645201",
            "name": "លឹម សេងហួរ"
        },
        {
            "barcode": "171145656",
            "dpc": "03032648001",
            "name": "ម៉ីចន្ទ័ មុន្នី"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
