let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=

    [
        {
            "barcode": "171130422",
            "dpc": "03022706801",
            "name": "អំ ឆាំ"
        },
        {
            "barcode": "171130423",
            "dpc": "03022733301",
            "name": "សេង សុដានី"
        },
        {
            "barcode": "171130424",
            "dpc": "03022708601",
            "name": "សៀ ចំរើន"
        },
        {
            "barcode": "171130425",
            "dpc": "03022708501",
            "name": "ខៀវ សាមឿន"
        },
        {
            "barcode": "171130426",
            "dpc": "03022708401",
            "name": "វ៉ាន ណាស៊ារ"
        },
        {
            "barcode": "171130427",
            "dpc": "03022738401",
            "name": "ណម ផល្លា"
        },
        {
            "barcode": "171130428",
            "dpc": "03022703301",
            "name": "សួន សុខុន"
        },
        {
            "barcode": "171130429",
            "dpc": "03022728001",
            "name": "សួស សាលីន"
        },
        {
            "barcode": "171130430",
            "dpc": "03022728101",
            "name": "រ៉ សាក់"
        },
        {
            "barcode": "171130431",
            "dpc": "03022728301",
            "name": "ឡោះ សាវី"
        },
        {
            "barcode": "171130432",
            "dpc": "03022728701",
            "name": "ស៊ិន អ៊ិករ៉េៈ"
        },
        {
            "barcode": "171130433",
            "dpc": "03022732701",
            "name": "លី សាលីម"
        },
        {
            "barcode": "171130434",
            "dpc": "03022732801",
            "name": "មួន រីហ្វីន"
        },
        {
            "barcode": "171130435",
            "dpc": "03022732901",
            "name": "ឡេះ ឯល"
        },
        {
            "barcode": "171130436",
            "dpc": "03022733001",
            "name": "ជួន ចំណាប់"
        },
        {
            "barcode": "171130437",
            "dpc": "03022738101",
            "name": "ម៉ាស្ទីនឌីយ៉ាសុទី្ទន"
        },
        {
            "barcode": "171130438",
            "dpc": "03022743001",
            "name": "ជួប សាវង្ស"
        },
        {
            "barcode": "171130439",
            "dpc": "03022703401",
            "name": "ម៉ាន កៅហ្វិច"
        },
        {
            "barcode": "171130440",
            "dpc": "03022703501",
            "name": "ម៉េត អាស៊ីយ៉ាស់"
        },
        {
            "barcode": "171130441",
            "dpc": "03022706901",
            "name": "ស៊ុប សារី"
        },
        {
            "barcode": "171130442",
            "dpc": "03022718601",
            "name": "សួន ចាន់រ័ត្ន"
        },
        {
            "barcode": "171130443",
            "dpc": "03022719301",
            "name": "សាន់ ដន"
        },
        {
            "barcode": "171130444",
            "dpc": "03022719501",
            "name": "ប៉ាង សិលា"
        },
        {
            "barcode": "171130445",
            "dpc": "03022727901",
            "name": "ម៉ាត់ កាស់"
        },
        {
            "barcode": "171130446",
            "dpc": "03022733501",
            "name": "ចក់ ស្រស់"
        },
        {
            "barcode": "171130447",
            "dpc": "03022742801",
            "name": "ម៉ាត់ ហាទីរីន"
        },
        {
            "barcode": "171130448",
            "dpc": "03022706701",
            "name": "ហង្ស ញ៉ុក"
        },
        {
            "barcode": "171130449",
            "dpc": "03022742701",
            "name": "សឹម សូរ"
        },
        {
            "barcode": "171130450",
            "dpc": "03022742601",
            "name": "ជួនណារ៉េត"
        },
        {
            "barcode": "171130451",
            "dpc": "03022707001",
            "name": "នូ សារិទ្ធ"
        },
        {
            "barcode": "171130452",
            "dpc": "03022704501",
            "name": "វ៉ា ធឿន"
        },
        {
            "barcode": "171130453",
            "dpc": "03022703901",
            "name": "ហុង ពិសី"
        },
        {
            "barcode": "171130454",
            "dpc": "03022726101",
            "name": "កែវ ឈុនលី"
        },
        {
            "barcode": "171130455",
            "dpc": "03022717101",
            "name": "សុខ នាង"
        },
        {
            "barcode": "171130456",
            "dpc": "03022705001",
            "name": "ហេង សុធា"
        },
        {
            "barcode": "171130457",
            "dpc": "03022721201",
            "name": "គឹម ណន"
        },
        {
            "barcode": "171130458",
            "dpc": "03022704801",
            "name": "ខែម សារ៉ាត់"
        },
        {
            "barcode": "171130459",
            "dpc": "03022707101",
            "name": "ទុយ ស៊ីន"
        },
        {
            "barcode": "171130460",
            "dpc": "03022702101",
            "name": "មាស មាលតី"
        },
        {
            "barcode": "171130461",
            "dpc": "03022727301",
            "name": "ប៉េង សាវី"
        },
        {
            "barcode": "171130462",
            "dpc": "03022733101",
            "name": "កាង សៀក"
        },
        {
            "barcode": "171130463",
            "dpc": "03022727501",
            "name": "ដែន ណារ៉ុម"
        },
        {
            "barcode": "171130464",
            "dpc": "03022732601",
            "name": "ឃុត ចាន់ថន"
        },
        {
            "barcode": "171130465",
            "dpc": "03022736401",
            "name": "ក្រង់ ចាន់លី"
        },
        {
            "barcode": "171130466",
            "dpc": "03022705101",
            "name": "គឹម ឡូន"
        },
        {
            "barcode": "171130467",
            "dpc": "03022736501",
            "name": "ម៉ី សាវ៉ុង"
        },
        {
            "barcode": "171130468",
            "dpc": "03022743901",
            "name": "ស៊ុយ សំណាង"
        },
        {
            "barcode": "171130469",
            "dpc": "03022732301",
            "name": "ឈឹង រតនៈ"
        },
        {
            "barcode": "171130470",
            "dpc": "03022720901",
            "name": "សុខ ខេង"
        },
        {
            "barcode": "171130471",
            "dpc": "03022712901",
            "name": "ទូច រិទ្ធី"
        },
        {
            "barcode": "171130472",
            "dpc": "03022713001",
            "name": "ហ៊ាង សុចាន់"
        },
        {
            "barcode": "171130473",
            "dpc": "03022725901",
            "name": "ខៀវ ពន្លឺ"
        },
        {
            "barcode": "171130474",
            "dpc": "03022726001",
            "name": "ដំ រ៉ាឌី"
        },
        {
            "barcode": "171130475",
            "dpc": "03022711701",
            "name": "សឿម សឿង"
        },
        {
            "barcode": "171130476",
            "dpc": "03022705601",
            "name": "សួន សុវណ្ណ"
        },
        {
            "barcode": "171130477",
            "dpc": "03022720001",
            "name": "កូយ កុសល់"
        },
        {
            "barcode": "171130478",
            "dpc": "03022731301",
            "name": "ប៊ុន សុផល"
        },
        {
            "barcode": "171130479",
            "dpc": "03022717401",
            "name": "ថន វិណេត"
        },
        {
            "barcode": "171130480",
            "dpc": "03022700401",
            "name": "សៀ ឈាងហេង"
        },
        {
            "barcode": "171130481",
            "dpc": "03022736801",
            "name": "លី អូន"
        },
        {
            "barcode": "171130482",
            "dpc": "03022700301",
            "name": "យ៉ែម មឿន"
        },
        {
            "barcode": "171130483",
            "dpc": "03022704401",
            "name": "ឡាំង ង៉ាយ"
        },
        {
            "barcode": "171130484",
            "dpc": "03022713101",
            "name": "ឡៅ ប៊ួយ"
        },
        {
            "barcode": "171130485",
            "dpc": "03022725201",
            "name": "ញ៉ែម សុជាតិ"
        },
        {
            "barcode": "171130486",
            "dpc": "03022702701",
            "name": "ជុក ឯក"
        },
        {
            "barcode": "171130487",
            "dpc": "03022730301",
            "name": "អ៊ឹម អ៊ាម"
        },
        {
            "barcode": "171130488",
            "dpc": "03022716301",
            "name": "តាំង ស៊ីវហេង"
        },
        {
            "barcode": "171130489",
            "dpc": "03022730501",
            "name": "ឡុង ហូ"
        },
        {
            "barcode": "171130490",
            "dpc": "03022705901",
            "name": "ទ្រិញ អាន"
        },
        {
            "barcode": "171130491",
            "dpc": "03022730401",
            "name": "ចាន់ ប៊ុនធឿន"
        },
        {
            "barcode": "171130492",
            "dpc": "03022725501",
            "name": "ឡាយ សាំងថង២"
        },
        {
            "barcode": "171130493",
            "dpc": "03022736601",
            "name": "ជួប ចំរើន"
        },
        {
            "barcode": "171130494",
            "dpc": "03022709901",
            "name": "ឡេង ខេង"
        },
        {
            "barcode": "171130495",
            "dpc": "03022714501",
            "name": "ហេង ស៊ីឌឿន"
        },
        {
            "barcode": "171130496",
            "dpc": "03022714401",
            "name": "ហ៊ួ ម៉ុងហួត"
        },
        {
            "barcode": "171130497",
            "dpc": "03022714301",
            "name": "អួម ម៉ៅ"
        },
        {
            "barcode": "171130498",
            "dpc": "03022737801",
            "name": "សួន បុផ្ផា"
        },
        {
            "barcode": "171130499",
            "dpc": "03022709801",
            "name": "ម៉ី យ៉ានឈឿន"
        },
        {
            "barcode": "171130500",
            "dpc": "03022729101",
            "name": "ឡាយ រិទ្ធវង្ស២"
        },
        {
            "barcode": "171130501",
            "dpc": "03022722101",
            "name": "ពៅ ចាន់ថា"
        },
        {
            "barcode": "171130502",
            "dpc": "03022722201",
            "name": "ពៅ អេង"
        },
        {
            "barcode": "171130503",
            "dpc": "03022722301",
            "name": "សៅ វ៉ាន់ឌី"
        },
        {
            "barcode": "171130504",
            "dpc": "03022722401",
            "name": "កែវ សុវណ្ណដេត"
        },
        {
            "barcode": "171130505",
            "dpc": "03022704601",
            "name": "មុំ ឆវី"
        },
        {
            "barcode": "171130506",
            "dpc": "03022704701",
            "name": "ហុង លី"
        },
        {
            "barcode": "171130507",
            "dpc": "03022701901",
            "name": "សុខ សឿត"
        },
        {
            "barcode": "171130508",
            "dpc": "03022701801",
            "name": "ម៉ាត សាត"
        },
        {
            "barcode": "171130509",
            "dpc": "03022737901",
            "name": "ស្ហើង ណាន"
        },
        {
            "barcode": "171130510",
            "dpc": "03022737701",
            "name": "ឌី សំបូរ"
        },
        {
            "barcode": "171130511",
            "dpc": "03022729001",
            "name": "យុន រ៉ាអ៊ូល"
        },
        {
            "barcode": "171130512",
            "dpc": "03022736901",
            "name": "គឹម ឈឿន"
        },
        {
            "barcode": "171130513",
            "dpc": "03022742501",
            "name": "សែម ចន្ថា"
        },
        {
            "barcode": "171130514",
            "dpc": "03022737101",
            "name": "សៀវ សារិទ្ធ"
        },
        {
            "barcode": "171130515",
            "dpc": "03022737301",
            "name": "ជា សៀង"
        },
        {
            "barcode": "171130516",
            "dpc": "03022737201",
            "name": "នួន ប៉េង"
        },
        {
            "barcode": "171130517",
            "dpc": "03022737401",
            "name": "ញឹម សាវី"
        },
        {
            "barcode": "171130518",
            "dpc": "03022737601",
            "name": "លាង គឹមហាន"
        },
        {
            "barcode": "171130519",
            "dpc": "03022742301",
            "name": "ង៉ែត សារ៉េត"
        },
        {
            "barcode": "171130520",
            "dpc": "03022742201",
            "name": "មាស សុជាតិ"
        },
        {
            "barcode": "171130521",
            "dpc": "03022738501",
            "name": "ម៉ែន សម្បត្តិ"
        },
        {
            "barcode": "171130522",
            "dpc": "03022702201",
            "name": "គីង សារឿន"
        },
        {
            "barcode": "171130523",
            "dpc": "03022727801",
            "name": "ហេង វែងឈៀង"
        },
        {
            "barcode": "171130524",
            "dpc": "03022713901",
            "name": "សួស លាង"
        },
        {
            "barcode": "171130525",
            "dpc": "03022718501",
            "name": "កូវ ជិញសៀង"
        },
        {
            "barcode": "171130526",
            "dpc": "03022732001",
            "name": "កង ស៊ិន"
        },
        {
            "barcode": "171130527",
            "dpc": "03022721901",
            "name": "រ៉េត ប៊ុនធឿន"
        },
        {
            "barcode": "171130528",
            "dpc": "03022732101",
            "name": "វី វឹង"
        },
        {
            "barcode": "171130529",
            "dpc": "03022713501",
            "name": "ឡឹម ឈាន"
        },
        {
            "barcode": "171130530",
            "dpc": "03022701301",
            "name": "ចាន់ សាមឿន"
        },
        {
            "barcode": "171130531",
            "dpc": "03022716801",
            "name": "មាស សារឿន"
        },
        {
            "barcode": "171130532",
            "dpc": "03022714801",
            "name": "អៀង ហាក់"
        },
        {
            "barcode": "171130533",
            "dpc": "03022724101",
            "name": "យ៉ិន ចាន់ម៉ូនីកា"
        },
        {
            "barcode": "171130534",
            "dpc": "03022724201",
            "name": "ម៉ៅ សុជាតិ"
        },
        {
            "barcode": "171130535",
            "dpc": "03022714601",
            "name": "ប៉ាត់ ភុន"
        },
        {
            "barcode": "171130536",
            "dpc": "03022717001",
            "name": "ហ៊ុន វិបុល"
        },
        {
            "barcode": "171130537",
            "dpc": "03022701201",
            "name": "តាំង ហ្គិច"
        },
        {
            "barcode": "171130538",
            "dpc": "03022703601",
            "name": "ហេង ចាន់"
        },
        {
            "barcode": "171130539",
            "dpc": "03022708101",
            "name": "ចាន់ ធី"
        },
        {
            "barcode": "171130540",
            "dpc": "03022708001",
            "name": "ស ឌីណា"
        },
        {
            "barcode": "171130541",
            "dpc": "03022707901",
            "name": "លី ថាវី"
        },
        {
            "barcode": "171130542",
            "dpc": "03022703801",
            "name": "វ៉ាន់ ឌី"
        },
        {
            "barcode": "171130543",
            "dpc": "03022703701",
            "name": "ស៊ី វ៉ូន"
        },
        {
            "barcode": "171130544",
            "dpc": "03022719701",
            "name": "អ៊ុច ឆាំ"
        },
        {
            "barcode": "171130545",
            "dpc": "03022702901",
            "name": "រ៉េន វឌ្ឍនៈ"
        },
        {
            "barcode": "171130546",
            "dpc": "03022714701",
            "name": "ម៉ុយ ដាវ៉ិត"
        },
        {
            "barcode": "171130547",
            "dpc": "03022738301",
            "name": "សោម អៀ"
        },
        {
            "barcode": "171130548",
            "dpc": "03022713601",
            "name": "ម៉េង ម៉ារី"
        },
        {
            "barcode": "171130549",
            "dpc": "03022715001",
            "name": "គីម ផល្លា"
        },
        {
            "barcode": "171130550",
            "dpc": "03022715101",
            "name": "ប៉ិច ផល្លា"
        },
        {
            "barcode": "171130551",
            "dpc": "03022713701",
            "name": "សំ នៀង"
        },
        {
            "barcode": "171130552",
            "dpc": "03022738201",
            "name": "រស់ សាវ៉ុន"
        },
        {
            "barcode": "171130553",
            "dpc": "03022743201",
            "name": "អ៊ុយ សុង"
        },
        {
            "barcode": "171130554",
            "dpc": "03022720201",
            "name": "វ៉ាន់ ចាន់ធី"
        },
        {
            "barcode": "171130555",
            "dpc": "03022733201",
            "name": "គង់ សុជឿន"
        },
        {
            "barcode": "171130556",
            "dpc": "03022717701",
            "name": "យិន ថាវ"
        },
        {
            "barcode": "171130557",
            "dpc": "03022711001",
            "name": "សុត ធី"
        },
        {
            "barcode": "171130558",
            "dpc": "03022703101",
            "name": "វ៉ែន វួច"
        },
        {
            "barcode": "171130559",
            "dpc": "03022740601",
            "name": "ឡោ ជេដ្ឋា"
        },
        {
            "barcode": "171130560",
            "dpc": "03022704201",
            "name": "ឡោ អង"
        },
        {
            "barcode": "171130561",
            "dpc": "03022709201",
            "name": "ម៉ៅ សូវៀត"
        },
        {
            "barcode": "171130562",
            "dpc": "03022746701",
            "name": "ចាន់ សាវុធ"
        },
        {
            "barcode": "171130563",
            "dpc": "03022746801",
            "name": "ឆន សុវណ្ណគីរី"
        },
        {
            "barcode": "171130564",
            "dpc": "03022746901",
            "name": "អ៊ី សាវៃ"
        },
        {
            "barcode": "171130565",
            "dpc": "03022747001",
            "name": "អុង ពិទូ"
        },
        {
            "barcode": "171130566",
            "dpc": "03022747101",
            "name": "ពេជ្រ សុផៃ"
        },
        {
            "barcode": "171130567",
            "dpc": "03022747201",
            "name": "ឌួង សុខុម"
        },
        {
            "barcode": "171130568",
            "dpc": "03022747301",
            "name": "ញៀវ សឿត"
        },
        {
            "barcode": "171130569",
            "dpc": "03022747401",
            "name": "ម៉ក់ រ៉ាស៊ី"
        },
        {
            "barcode": "171130570",
            "dpc": "03022747501",
            "name": "សៀង រុំចង់"
        },
        {
            "barcode": "171130571",
            "dpc": "03022734501",
            "name": "ចិន ឡាវ"
        },
        {
            "barcode": "171130572",
            "dpc": "03022740701",
            "name": "ពិន សុភា"
        },
        {
            "barcode": "171130573",
            "dpc": "03022747901",
            "name": "សេង ខី"
        },
        {
            "barcode": "171130574",
            "dpc": "03022734601",
            "name": "សាត សឿម"
        },
        {
            "barcode": "171130575",
            "dpc": "03022726501",
            "name": "ងួន តុលា"
        },
        {
            "barcode": "171130576",
            "dpc": "03022711801",
            "name": "ស៊ុំ សឿន"
        },
        {
            "barcode": "171130577",
            "dpc": "03022731601",
            "name": "ពួកជុំនំគ្រីស្ទបរិស័ទខ្មែរ"
        },
        {
            "barcode": "171130578",
            "dpc": "03022723801",
            "name": "ង៉ែត ប៉េង"
        },
        {
            "barcode": "171130579",
            "dpc": "03022723901",
            "name": "ឃុន ស៊ីន"
        },
        {
            "barcode": "171130580",
            "dpc": "03022735301",
            "name": "ស្រី ណឹង"
        },
        {
            "barcode": "171130581",
            "dpc": "03022735401",
            "name": "លឹម ស៊ិនណារ៉ា"
        },
        {
            "barcode": "171130582",
            "dpc": "03022735201",
            "name": "ឃុន ឃឿត"
        },
        {
            "barcode": "171130583",
            "dpc": "03022727201",
            "name": "យក់ វីណង"
        },
        {
            "barcode": "171130584",
            "dpc": "03022702801",
            "name": "រឿន សំណាង"
        },
        {
            "barcode": "171130585",
            "dpc": "03022722001",
            "name": "គឹម សុង"
        },
        {
            "barcode": "171130586",
            "dpc": "03022709401",
            "name": "អ៊ី សុវត្ថិ"
        },
        {
            "barcode": "171130587",
            "dpc": "03022735001",
            "name": "ដាំ សុង២"
        },
        {
            "barcode": "171130588",
            "dpc": "03022735101",
            "name": "ហ៊ាង សមាជ"
        },
        {
            "barcode": "171130589",
            "dpc": "03022711201",
            "name": "ដាំ លេខា"
        },
        {
            "barcode": "171130590",
            "dpc": "03022724301",
            "name": "សួស សុខន"
        },
        {
            "barcode": "171130591",
            "dpc": "03022711401",
            "name": "អៀ គឹមហៀង"
        },
        {
            "barcode": "171130592",
            "dpc": "03022713801",
            "name": "ចៅ ធៀង"
        },
        {
            "barcode": "171130593",
            "dpc": "03022707201",
            "name": "ហ៊ុំ ព្រេន"
        },
        {
            "barcode": "171130594",
            "dpc": "03022741201",
            "name": "វ៉ិច សន្ដិភាព"
        },
        {
            "barcode": "171130595",
            "dpc": "03022741301",
            "name": "យិម សុត"
        },
        {
            "barcode": "171130596",
            "dpc": "03022739501",
            "name": "នួន សុភឿន"
        },
        {
            "barcode": "171130597",
            "dpc": "03022700901",
            "name": "អេង សុយីន"
        },
        {
            "barcode": "171130598",
            "dpc": "03022716601",
            "name": "ស៊ីនម៉ុម"
        },
        {
            "barcode": "171130599",
            "dpc": "03022711101",
            "name": "ណាក សាវ៉ាត"
        },
        {
            "barcode": "171130600",
            "dpc": "03022705201",
            "name": "ស នាង"
        },
        {
            "barcode": "171130601",
            "dpc": "03022731801",
            "name": "សន គីរី"
        },
        {
            "barcode": "171130602",
            "dpc": "03022725601",
            "name": "ឡេង សំអុល"
        },
        {
            "barcode": "171130603",
            "dpc": "03022724401",
            "name": "ខឹម ហឿង"
        },
        {
            "barcode": "171130604",
            "dpc": "03022720101",
            "name": "ពួកជំនុំជំនឿលើព្រះកម្ពីប៊ីម"
        },
        {
            "barcode": "171130605",
            "dpc": "03022700801",
            "name": "សឿន សុបាល"
        },
        {
            "barcode": "171130606",
            "dpc": "03022740001",
            "name": "សូ សាវុធ"
        },
        {
            "barcode": "171130607",
            "dpc": "03022700601",
            "name": "ប៊ុន សាខន"
        },
        {
            "barcode": "171130608",
            "dpc": "03022700701",
            "name": "ឈួន ហ៊ាប"
        },
        {
            "barcode": "171130609",
            "dpc": "03022740101",
            "name": "ម៉ី ហ៊ុំ"
        },
        {
            "barcode": "171130610",
            "dpc": "03022740401",
            "name": "ព្រឿម ស៊ីណាត"
        },
        {
            "barcode": "171130611",
            "dpc": "03022740501",
            "name": "ជា ង៉ិ"
        },
        {
            "barcode": "171130612",
            "dpc": "03022705701",
            "name": "ស៊ាង ដុំ"
        },
        {
            "barcode": "171130613",
            "dpc": "03022707301",
            "name": "ហេង រំភើយ"
        },
        {
            "barcode": "171130614",
            "dpc": "03022716501",
            "name": "ហុក គា"
        },
        {
            "barcode": "171130615",
            "dpc": "03022709501",
            "name": "ផាត់ សុងសៀង"
        },
        {
            "barcode": "171130616",
            "dpc": "03022720301",
            "name": "រស់ ចាន់កុសល"
        },
        {
            "barcode": "171130617",
            "dpc": "03022714901",
            "name": "ណៃ គឹមសុន"
        },
        {
            "barcode": "171130618",
            "dpc": "03022716001",
            "name": "វៀង រ៉ាវី"
        },
        {
            "barcode": "171130619",
            "dpc": "03022715901",
            "name": "វណ សង្ហា"
        },
        {
            "barcode": "171130620",
            "dpc": "03022701101",
            "name": "អ៊ុក ហារ៉ាឌី"
        },
        {
            "barcode": "171130621",
            "dpc": "03022716401",
            "name": "ជា សុផល"
        },
        {
            "barcode": "171130622",
            "dpc": "03022732201",
            "name": "ហៀក ស៊ីនឿន"
        },
        {
            "barcode": "171130623",
            "dpc": "03022705401",
            "name": "យៀម កុងស៊ុន"
        },
        {
            "barcode": "171130624",
            "dpc": "03022711301",
            "name": "ហុង ដាវុធ"
        },
        {
            "barcode": "171130625",
            "dpc": "03022741501",
            "name": "យ៉ឹម យ៉ុង"
        },
        {
            "barcode": "171130626",
            "dpc": "03022741401",
            "name": "ជឿម ច្រិប"
        },
        {
            "barcode": "171130627",
            "dpc": "03022701001",
            "name": "អុំ ស៊ីនួន"
        },
        {
            "barcode": "171130628",
            "dpc": "03022724001",
            "name": "សយ វុទ្ធា"
        },
        {
            "barcode": "171130629",
            "dpc": "03022720701",
            "name": "នួន គឹមសួរ"
        },
        {
            "barcode": "171130630",
            "dpc": "03022709301",
            "name": "នាង សុភក្ត្រ"
        },
        {
            "barcode": "171130631",
            "dpc": "03022741101",
            "name": "សៅ ទិត្យ"
        },
        {
            "barcode": "171130632",
            "dpc": "03022735601",
            "name": "លី ម៉ាល័យ"
        },
        {
            "barcode": "171130633",
            "dpc": "03022735501",
            "name": "យួម សុវណ្ណ"
        },
        {
            "barcode": "171130634",
            "dpc": "03022741001",
            "name": "គ្រី សុណន់"
        },
        {
            "barcode": "171130635",
            "dpc": "03022705501",
            "name": "គឹម វណ្ណា"
        },
        {
            "barcode": "171130636",
            "dpc": "03022723401",
            "name": "សុខ សាមន្នី១"
        },
        {
            "barcode": "171130637",
            "dpc": "03022723501",
            "name": "សុខ សាមន្នី២"
        },
        {
            "barcode": "171130638",
            "dpc": "03022723601",
            "name": "សុខ សាមន្នី៣"
        },
        {
            "barcode": "171130639",
            "dpc": "03022723701",
            "name": "សុខ សាមន្នី៤"
        },
        {
            "barcode": "171130640",
            "dpc": "03022700501",
            "name": "ឈុន អេង"
        },
        {
            "barcode": "171130641",
            "dpc": "03022702001",
            "name": "សោម សុចិត្ត"
        },
        {
            "barcode": "171130642",
            "dpc": "03022703201",
            "name": "គង់ សុន"
        },
        {
            "barcode": "171130643",
            "dpc": "03022704901",
            "name": "អ៊ួន គឹមណង"
        },
        {
            "barcode": "171130644",
            "dpc": "03022705801",
            "name": "ថន ចាន់ធឿន"
        },
        {
            "barcode": "171130645",
            "dpc": "03022706101",
            "name": "ម៉េត លី"
        },
        {
            "barcode": "171130646",
            "dpc": "03022706201",
            "name": "សេង ហុង"
        },
        {
            "barcode": "171130647",
            "dpc": "03022706401",
            "name": "ជុច សាកន"
        },
        {
            "barcode": "171130648",
            "dpc": "03022706501",
            "name": "ជួន ហ៊ួរ"
        },
        {
            "barcode": "171130649",
            "dpc": "03022706601",
            "name": "សុខ លុច"
        },
        {
            "barcode": "171130650",
            "dpc": "03022707401",
            "name": "ឯល ដារ៉េះ"
        },
        {
            "barcode": "171130651",
            "dpc": "03022707501",
            "name": "លី ស្មាន"
        },
        {
            "barcode": "171130652",
            "dpc": "03022707601",
            "name": "ឆោ វីរីយ៉ា"
        },
        {
            "barcode": "171130653",
            "dpc": "03022709601",
            "name": "សេន ណារី"
        },
        {
            "barcode": "171130654",
            "dpc": "03022709701",
            "name": "លី យ៉ាមី"
        },
        {
            "barcode": "171130655",
            "dpc": "03022710001",
            "name": "រ៉េះ យ៉ើ"
        },
        {
            "barcode": "171130656",
            "dpc": "03022710701",
            "name": "គឹម សូលីណែត"
        },
        {
            "barcode": "171130657",
            "dpc": "03022710901",
            "name": "សាឡេៈ រ៉ហ្វី"
        },
        {
            "barcode": "171130658",
            "dpc": "03022711501",
            "name": "អុំ ម៉ាលី"
        },
        {
            "barcode": "171130659",
            "dpc": "03022711901",
            "name": "ស៊ីវ លឿប"
        },
        {
            "barcode": "171130660",
            "dpc": "03022712001",
            "name": "មាន សារ៉ាត់"
        },
        {
            "barcode": "171130661",
            "dpc": "03022712101",
            "name": "ហម សុភក្រ័"
        },
        {
            "barcode": "171130662",
            "dpc": "03022712601",
            "name": "ហ៊ឹម ពុធសុវណ្ណ"
        },
        {
            "barcode": "171130663",
            "dpc": "03022712701",
            "name": "សាំង លីម"
        },
        {
            "barcode": "171130664",
            "dpc": "03022712801",
            "name": "លាង ឡា"
        },
        {
            "barcode": "171130665",
            "dpc": "03022713401",
            "name": "វ៉ាន់ រក្សា"
        },
        {
            "barcode": "171130666",
            "dpc": "03022714001",
            "name": "លី យ៉េត"
        },
        {
            "barcode": "171130667",
            "dpc": "03022715201",
            "name": "ឡោះ អាស្សីហ្សាស់"
        },
        {
            "barcode": "171130668",
            "dpc": "03022715301",
            "name": "ភឹត ស៊ីណា"
        },
        {
            "barcode": "171130669",
            "dpc": "03022715401",
            "name": "វ័រ វី"
        },
        {
            "barcode": "171130670",
            "dpc": "03022715501",
            "name": "ម៉ាត់ រ៉ភីយ៉ាស់"
        },
        {
            "barcode": "171130671",
            "dpc": "03022715601",
            "name": "សួន សុផល"
        },
        {
            "barcode": "171130672",
            "dpc": "03022715701",
            "name": "កែវ រ៉ស៊ីឌី"
        },
        {
            "barcode": "171130673",
            "dpc": "03022715801",
            "name": "អ៊ិន សភីយ៉ា"
        },
        {
            "barcode": "171130674",
            "dpc": "03022716101",
            "name": "សំ ហឿប"
        },
        {
            "barcode": "171130675",
            "dpc": "03022716201",
            "name": "លឿង សុខា"
        },
        {
            "barcode": "171130676",
            "dpc": "03022716701",
            "name": "ហួត ការី"
        },
        {
            "barcode": "171130677",
            "dpc": "03022716901",
            "name": "ទៀ ហ៊នី"
        },
        {
            "barcode": "171130678",
            "dpc": "03022718401",
            "name": "សំ គីមសេង"
        },
        {
            "barcode": "171130679",
            "dpc": "03022718701",
            "name": "លី ឆេង"
        },
        {
            "barcode": "171130680",
            "dpc": "03022718801",
            "name": "ឯល រ៉ូហ្សាត"
        },
        {
            "barcode": "171130681",
            "dpc": "03022718901",
            "name": "ហាប់ ស្រីមុំ"
        },
        {
            "barcode": "171130682",
            "dpc": "03022719001",
            "name": "ថាប់ សុធានី"
        },
        {
            "barcode": "171130683",
            "dpc": "03022719101",
            "name": "វ៉ាន់ ថា"
        },
        {
            "barcode": "171130684",
            "dpc": "03022719201",
            "name": "ម៉ៅ ដារ៉ា"
        },
        {
            "barcode": "171130685",
            "dpc": "03022719601",
            "name": "សំ ហេង"
        },
        {
            "barcode": "171130686",
            "dpc": "03022720601",
            "name": "ហួយ ចន្នី"
        },
        {
            "barcode": "171130687",
            "dpc": "03022721401",
            "name": "ឈិត ចាន់ភីរម្យ"
        },
        {
            "barcode": "171130688",
            "dpc": "03022721501",
            "name": "ម៉ូត សាគីរីន"
        },
        {
            "barcode": "171130689",
            "dpc": "03022721601",
            "name": "ប៉ោល ថន"
        },
        {
            "barcode": "171130690",
            "dpc": "03022721701",
            "name": "សំអែល សាវុធ"
        },
        {
            "barcode": "171130691",
            "dpc": "03022721801",
            "name": "រ័ត្ន សោភ័ណ្ឌ"
        },
        {
            "barcode": "171130692",
            "dpc": "03022722601",
            "name": "ផ្សារទំនើបភួ ពុយ"
        },
        {
            "barcode": "171130693",
            "dpc": "03022722701",
            "name": "ភួ ពុយ"
        },
        {
            "barcode": "171130694",
            "dpc": "03022722801",
            "name": "អ៊ឹង រស្មី"
        },
        {
            "barcode": "171130695",
            "dpc": "03022723301",
            "name": "ឡាច សម្បត្តិ"
        },
        {
            "barcode": "171130696",
            "dpc": "03022724701",
            "name": "ចៅ ហា"
        },
        {
            "barcode": "171130697",
            "dpc": "03022724801",
            "name": "គឹម ចន្ថា"
        },
        {
            "barcode": "171130698",
            "dpc": "03022725801",
            "name": "អ៊ុន សុផាត"
        },
        {
            "barcode": "171130699",
            "dpc": "03022726201",
            "name": "ហាំង ឡេង"
        },
        {
            "barcode": "171130700",
            "dpc": "03022726301",
            "name": "កុយ ណាឬទ្ធិ"
        },
        {
            "barcode": "171130701",
            "dpc": "03022726401",
            "name": "រ៉ែម ចឹក"
        },
        {
            "barcode": "171130702",
            "dpc": "03022726601",
            "name": "មាស ភី"
        },
        {
            "barcode": "171130703",
            "dpc": "03022726701",
            "name": "ញ៉ិល បូណាវី"
        },
        {
            "barcode": "171130704",
            "dpc": "03022726801",
            "name": "មាស សារពេជ្រ"
        },
        {
            "barcode": "171130705",
            "dpc": "03022726901",
            "name": "បាន សាវ៉េត"
        },
        {
            "barcode": "171130706",
            "dpc": "03022727001",
            "name": "ងី ហេង"
        },
        {
            "barcode": "171130707",
            "dpc": "03022727401",
            "name": "កូយ ម៉ុយ"
        },
        {
            "barcode": "171130708",
            "dpc": "03022727601",
            "name": "សែម សារ៉ាត់"
        },
        {
            "barcode": "171130709",
            "dpc": "03022727701",
            "name": "ងួន ភារម្យ"
        },
        {
            "barcode": "171130710",
            "dpc": "03022728201",
            "name": "ទួត រ៉ើន"
        },
        {
            "barcode": "171130711",
            "dpc": "03022728401",
            "name": "ឱ ចំរ៉ុង ២"
        },
        {
            "barcode": "171130712",
            "dpc": "03022728501",
            "name": "លី ម៉ាត់តារេៈ"
        },
        {
            "barcode": "171130713",
            "dpc": "03022728601",
            "name": "ស៊ីន ផាទីម៉ាស់"
        },
        {
            "barcode": "171130714",
            "dpc": "03022728801",
            "name": "ឃុត សេន"
        },
        {
            "barcode": "171130715",
            "dpc": "03022728901",
            "name": "ទី ធី"
        },
        {
            "barcode": "171130716",
            "dpc": "03022729201",
            "name": "ង៉ត ញ៉ាញ់"
        },
        {
            "barcode": "171130717",
            "dpc": "03022729301",
            "name": "ផន វិចិត្រ"
        },
        {
            "barcode": "171130718",
            "dpc": "03022729401",
            "name": "ហែម ណារ័ត្ន"
        },
        {
            "barcode": "171130719",
            "dpc": "03022729701",
            "name": "អុំ ឌិន"
        },
        {
            "barcode": "171130720",
            "dpc": "03022730001",
            "name": "ទូច ហ៊ីង"
        },
        {
            "barcode": "171130721",
            "dpc": "03022730101",
            "name": "ឃុន យឿន"
        },
        {
            "barcode": "171130722",
            "dpc": "03022730201",
            "name": "ប៉ុល ពេជ្រ"
        },
        {
            "barcode": "171130723",
            "dpc": "03022730601",
            "name": "ថៃ ចិន្តា"
        },
        {
            "barcode": "171130724",
            "dpc": "03022730701",
            "name": "មិន នាង"
        },
        {
            "barcode": "171130725",
            "dpc": "03022730901",
            "name": "ឯក សុត្តារ៉ា"
        },
        {
            "barcode": "171130726",
            "dpc": "03022731101",
            "name": "យិន លាងហេង"
        },
        {
            "barcode": "171130727",
            "dpc": "03022731201",
            "name": "ម៉ៃ សាមុត"
        },
        {
            "barcode": "171130728",
            "dpc": "03022731501",
            "name": "ឡាយ សុខឡេង"
        },
        {
            "barcode": "171130729",
            "dpc": "03022731701",
            "name": "អ៊ុក ធឹម"
        },
        {
            "barcode": "171130730",
            "dpc": "03022731901",
            "name": "ថ ធឿន"
        },
        {
            "barcode": "171130731",
            "dpc": "03022732401",
            "name": "អ៊ឹម ម៉ុន់"
        },
        {
            "barcode": "171130732",
            "dpc": "03022732501",
            "name": "ស៊ិន វណ្ណា"
        },
        {
            "barcode": "171130733",
            "dpc": "03022733401",
            "name": "សាំង សំណាង"
        },
        {
            "barcode": "171130734",
            "dpc": "03022733601",
            "name": "សួន សុខគា"
        },
        {
            "barcode": "171130735",
            "dpc": "03022733801",
            "name": "ងួន សេង"
        },
        {
            "barcode": "171130736",
            "dpc": "03022733901",
            "name": "ជួន កៅ"
        },
        {
            "barcode": "171130737",
            "dpc": "03022734001",
            "name": "អៀម ប៊ុននី"
        },
        {
            "barcode": "171130738",
            "dpc": "03022734201",
            "name": "សើន ចំរើន"
        },
        {
            "barcode": "171130739",
            "dpc": "03022734301",
            "name": "ទៀ ស៊ានី"
        },
        {
            "barcode": "171130740",
            "dpc": "03022734401",
            "name": "ម៉ុក សុថារី"
        },
        {
            "barcode": "171130741",
            "dpc": "03022734801",
            "name": "សន សុធី"
        },
        {
            "barcode": "171130742",
            "dpc": "03022734901",
            "name": "អ៊ុំ​ ឡ្ញុញ"
        },
        {
            "barcode": "171130743",
            "dpc": "03022735701",
            "name": "និល យឿត"
        },
        {
            "barcode": "171130744",
            "dpc": "03022735801",
            "name": "ឡឹក សុភា"
        },
        {
            "barcode": "171130745",
            "dpc": "03022735901",
            "name": "អ៊ុក ឧសភា"
        },
        {
            "barcode": "171130746",
            "dpc": "03022736001",
            "name": "ហម រិទ្ឋី១"
        },
        {
            "barcode": "171130747",
            "dpc": "03022736101",
            "name": "ហម រិទ្ឋី"
        },
        {
            "barcode": "171130748",
            "dpc": "03022736201",
            "name": "ឆន ណារី"
        },
        {
            "barcode": "171130749",
            "dpc": "03022736301",
            "name": "ឈុំ សិទ្ឋិ"
        },
        {
            "barcode": "171130750",
            "dpc": "03022736701",
            "name": "ងិន ចំរើន"
        },
        {
            "barcode": "171130751",
            "dpc": "03022738001",
            "name": "ពៅ សុជិន"
        },
        {
            "barcode": "171130752",
            "dpc": "03022738601",
            "name": "ម៉ាក់ នឿន"
        },
        {
            "barcode": "171130753",
            "dpc": "03022738701",
            "name": "ខន សុខលី"
        },
        {
            "barcode": "171130754",
            "dpc": "03022738801",
            "name": "សៀង សែម"
        },
        {
            "barcode": "171130755",
            "dpc": "03022738901",
            "name": "សូត្រ លិម"
        },
        {
            "barcode": "171130756",
            "dpc": "03022739001",
            "name": "ឯល យូសុះ"
        },
        {
            "barcode": "171130757",
            "dpc": "03022739101",
            "name": "កាត សាវ៉ាត"
        },
        {
            "barcode": "171130758",
            "dpc": "03022739201",
            "name": "និល ណារ៉ាន់"
        },
        {
            "barcode": "171130759",
            "dpc": "03022739301",
            "name": "គីន រ៉ម៉ាហ្វ្សី់"
        },
        {
            "barcode": "171130760",
            "dpc": "03022739401",
            "name": "រស់ ថន"
        },
        {
            "barcode": "171130761",
            "dpc": "03022740301",
            "name": "ឌឿប រិទ្វី"
        },
        {
            "barcode": "171130762",
            "dpc": "03022740801",
            "name": "ឆៃ វាសនា"
        },
        {
            "barcode": "171130763",
            "dpc": "03022740901",
            "name": "សេង ភាព"
        },
        {
            "barcode": "171130764",
            "dpc": "03022741601",
            "name": "អ៊ុក សំអូន"
        },
        {
            "barcode": "171130765",
            "dpc": "03022741801",
            "name": "ងិន ពៅ"
        },
        {
            "barcode": "171130766",
            "dpc": "03022741901",
            "name": "មួន គង់"
        },
        {
            "barcode": "171130767",
            "dpc": "03022742001",
            "name": "គឹម រូឡង់"
        },
        {
            "barcode": "171130768",
            "dpc": "03022742101",
            "name": "វង្ស សារឿន"
        },
        {
            "barcode": "171130769",
            "dpc": "03022743301",
            "name": "ឆា ឆួប"
        },
        {
            "barcode": "171130770",
            "dpc": "03022743401",
            "name": "សុទ្វ សុន"
        },
        {
            "barcode": "171130771",
            "dpc": "03022743501",
            "name": "ខ្លូត សុខ"
        },
        {
            "barcode": "171130772",
            "dpc": "03022743601",
            "name": "ឌុច វិចិត្រ"
        },
        {
            "barcode": "171130773",
            "dpc": "03022743701",
            "name": "អ៊ុក យ៉េន"
        },
        {
            "barcode": "171130774",
            "dpc": "03022743801",
            "name": "ស៊ុន សុះ"
        },
        {
            "barcode": "171130775",
            "dpc": "03022745401",
            "name": "ចន្ទ័ ហេង"
        },
        {
            "barcode": "171130776",
            "dpc": "03022747601",
            "name": "ឡោ ម៉ាប់"
        },
        {
            "barcode": "171130777",
            "dpc": "03022747701",
            "name": "សំ ពៅ"
        },
        {
            "barcode": "171130778",
            "dpc": "03022747801",
            "name": "រៀប ឆេងគាម"
        },
        {
            "barcode": "171130779",
            "dpc": "03022718101",
            "name": "ពៅ បុប្ជា"
        },
        {
            "barcode": "171130780",
            "dpc": "03022745701",
            "name": "ហ៊ុយ ហេង"
        },
        {
            "barcode": "171130781",
            "dpc": "03022734101",
            "name": "ម៉ៅ វែង"
        },
        {
            "barcode": "171130782",
            "dpc": "03022722901",
            "name": "សៅ មិនាអង្គារ៉ា"
        },
        {
            "barcode": "171130783",
            "dpc": "03022717201",
            "name": "សេក សាគុណ"
        },
        {
            "barcode": "171130784",
            "dpc": "03022712301",
            "name": "អ៊ុង សុផាត"
        },
        {
            "barcode": "171130785",
            "dpc": "03022710201",
            "name": "លុយ សារុន"
        },
        {
            "barcode": "171130786",
            "dpc": "03022717301",
            "name": "ឈិន សឿន"
        },
        {
            "barcode": "171130787",
            "dpc": "03022745901",
            "name": "លន់ ឡោ"
        },
        {
            "barcode": "171130788",
            "dpc": "03022724901",
            "name": "ឡោ ប៊ុនឡេង"
        },
        {
            "barcode": "171130789",
            "dpc": "03022710401",
            "name": "សំ សារុន"
        },
        {
            "barcode": "171130790",
            "dpc": "03022710301",
            "name": "ជុំ ភាជ"
        },
        {
            "barcode": "171130791",
            "dpc": "03022710101",
            "name": "ហ៊ុន ដារា"
        },
        {
            "barcode": "171130792",
            "dpc": "03022704101",
            "name": "អឿង សាវិញ"
        },
        {
            "barcode": "171130793",
            "dpc": "03022704001",
            "name": "ជា ដារ៉ា"
        },
        {
            "barcode": "171130794",
            "dpc": "03022700101",
            "name": "យក់ សំអឿន"
        },
        {
            "barcode": "171130795",
            "dpc": "03022746101",
            "name": "យឿម សុភ័ណដារ៉ា"
        },
        {
            "barcode": "171130796",
            "dpc": "03022746001",
            "name": "និល គុយហេង"
        },
        {
            "barcode": "171130797",
            "dpc": "03022723001",
            "name": "គង់ ដារ័ត្ន"
        },
        {
            "barcode": "171130798",
            "dpc": "03022720401",
            "name": "ជា​ សុខ"
        },
        {
            "barcode": "171130799",
            "dpc": "03022714101",
            "name": "អ៊ុំ ចាន់ណា"
        },
        {
            "barcode": "171130800",
            "dpc": "03022709101",
            "name": "ឃួយ ហ៊ាង"
        },
        {
            "barcode": "171130801",
            "dpc": "03022702501",
            "name": "យន យេន"
        },
        {
            "barcode": "171130802",
            "dpc": "03022746501",
            "name": "ឌី ឃាង"
        },
        {
            "barcode": "171130803",
            "dpc": "03022746301",
            "name": "ដិប ឪរ័ត្នន៍"
        },
        {
            "barcode": "171130804",
            "dpc": "03022746201",
            "name": "ហ៊ន សុភ័ណ"
        },
        {
            "barcode": "171130805",
            "dpc": "03022729901",
            "name": "វង់ ពិដោ"
        },
        {
            "barcode": "171130806",
            "dpc": "03022729801",
            "name": "ខាវ ណារ៉េត"
        },
        {
            "barcode": "171130807",
            "dpc": "03022725001",
            "name": "យឹម ប៊ុនរឿន"
        },
        {
            "barcode": "171130808",
            "dpc": "03022723201",
            "name": "ណុប គុំ"
        },
        {
            "barcode": "171130809",
            "dpc": "03022723101",
            "name": "ស៊ាន ណៃធី"
        },
        {
            "barcode": "171130810",
            "dpc": "03022718001",
            "name": "កុច រីណា"
        },
        {
            "barcode": "171130811",
            "dpc": "03022712401",
            "name": "អុំ ស៊ីណាត"
        },
        {
            "barcode": "171130812",
            "dpc": "03022710601",
            "name": "វែង គឹមហៀក"
        },
        {
            "barcode": "171130813",
            "dpc": "03022710501",
            "name": "ឯក ពេជ្រ"
        },
        {
            "barcode": "171130814",
            "dpc": "03022746401",
            "name": "សួន សារុំ"
        },
        {
            "barcode": "171130815",
            "dpc": "03022739601",
            "name": "ង៉ែត សាវ៉ុន"
        },
        {
            "barcode": "171130816",
            "dpc": "03022718201",
            "name": "ទុយ អារ៉ាម"
        },
        {
            "barcode": "171130817",
            "dpc": "03022712501",
            "name": "លីវ មុំ"
        },
        {
            "barcode": "171130818",
            "dpc": "03022739901",
            "name": "មុំ អ៊ាន"
        },
        {
            "barcode": "171130819",
            "dpc": "03022739801",
            "name": "វន អេននី"
        },
        {
            "barcode": "171130820",
            "dpc": "03022739701",
            "name": "ខាវ យៀង"
        },
        {
            "barcode": "171130821",
            "dpc": "03022727101",
            "name": "លី គឹមធី"
        },
        {
            "barcode": "171130822",
            "dpc": "03022714201",
            "name": "ធា ចិន"
        },
        {
            "barcode": "171130823",
            "dpc": "03022704301",
            "name": "គុំ វង្សមុន្នី"
        },
        {
            "barcode": "171130824",
            "dpc": "03022720501",
            "name": "លី ពិសេត"
        },
        {
            "barcode": "171130825",
            "dpc": "03022717501",
            "name": "មុត សុធា"
        },
        {
            "barcode": "171130826",
            "dpc": "03022717601",
            "name": "រស់ ណារ៉ុង"
        },
        {
            "barcode": "171130827",
            "dpc": "03022700201",
            "name": "សំអុន សំណាង"
        },
        {
            "barcode": "171130828",
            "dpc": "03022712201",
            "name": "គីម សយ"
        },
        {
            "barcode": "171130829",
            "dpc": "03022721001",
            "name": "ហោ សុតន"
        },
        {
            "barcode": "171130830",
            "dpc": "03022725401",
            "name": "ស៊្រី ម៉េង"
        },
        {
            "barcode": "171130831",
            "dpc": "03022731401",
            "name": "ផាង ស៊ីលូថូ"
        },
        {
            "barcode": "171130832",
            "dpc": "03022713301",
            "name": "ចាន់ សម្បត្តិ"
        },
        {
            "barcode": "171130833",
            "dpc": "03022708201",
            "name": "ជា​ ហ៊ាង"
        },
        {
            "barcode": "171130834",
            "dpc": "03022745301",
            "name": "គឹម ហួត"
        },
        {
            "barcode": "171130835",
            "dpc": "03022745201",
            "name": "ចាន់ បូរ៉ា"
        },
        {
            "barcode": "171130836",
            "dpc": "03022744001",
            "name": "តាំង សុផល"
        },
        {
            "barcode": "171130837",
            "dpc": "03022744101",
            "name": "កែវ វុទ្ធី"
        },
        {
            "barcode": "171130838",
            "dpc": "03022744201",
            "name": "ថា ឡាង"
        },
        {
            "barcode": "171130839",
            "dpc": "03022744301",
            "name": "ប៉ោ មី"
        },
        {
            "barcode": "171130840",
            "dpc": "03022744401",
            "name": "ហ៊ាង"
        },
        {
            "barcode": "171130841",
            "dpc": "03022744501",
            "name": "មាស គន្ធេង"
        },
        {
            "barcode": "171130842",
            "dpc": "03022744601",
            "name": "ម៉ៅ ម៉ន"
        },
        {
            "barcode": "171130843",
            "dpc": "03022744701",
            "name": "អៀង សុធា"
        },
        {
            "barcode": "171130844",
            "dpc": "03022744801",
            "name": "គ្រូ រ័ត្ន"
        },
        {
            "barcode": "171130845",
            "dpc": "03022744901",
            "name": "ណឹង បូណា"
        },
        {
            "barcode": "171130846",
            "dpc": "03022745001",
            "name": "គ្រូ ភីរម្យ"
        },
        {
            "barcode": "171130847",
            "dpc": "03022745101",
            "name": "ជឹង ម៉ុយលី"
        },
        {
            "barcode": "171130848",
            "dpc": "03022708301",
            "name": "ចុង ផែត"
        },
        {
            "barcode": "171130849",
            "dpc": "03022724601",
            "name": "ហេង វែងឈាន"
        },
        {
            "barcode": "171130850",
            "dpc": "03022702301",
            "name": "ហេង នារតី"
        },
        {
            "barcode": "171130851",
            "dpc": "03022701501",
            "name": "ឡោះ ម៉ាស់"
        },
        {
            "barcode": "171130852",
            "dpc": "03022701701",
            "name": "ឯល លីណា"
        },
        {
            "barcode": "171130853",
            "dpc": "03022701401",
            "name": "យ៉េន សាវី"
        },
        {
            "barcode": "171130854",
            "dpc": "03022707701",
            "name": "ម៉ាន ម៉ាត់លី"
        },
        {
            "barcode": "171130855",
            "dpc": "03022701601",
            "name": "ខៀវ ពេជ្ររស្មីសុវណ្ណ"
        },
        {
            "barcode": "171130856",
            "dpc": "03022748001",
            "name": "ឌី សុខ"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
