let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=

    [
        {
            "barcode": "171141898",
            "dpc": "03042927401",
            "name": "ហេង ធិ"
        },
        {
            "barcode": "171141899",
            "dpc": "03042927301",
            "name": "សោម អូន"
        },
        {
            "barcode": "171141900",
            "dpc": "03042927201",
            "name": "ជិន លន់"
        },
        {
            "barcode": "171141901",
            "dpc": "03042904201",
            "name": "នាម សុភា"
        },
        {
            "barcode": "171141902",
            "dpc": "03042917201",
            "name": "រួម ស៊ីនាថ"
        },
        {
            "barcode": "171141903",
            "dpc": "03042923401",
            "name": "ទេព រ៉ានី"
        },
        {
            "barcode": "171141904",
            "dpc": "03042935201",
            "name": "ធួង ងន់សេង"
        },
        {
            "barcode": "171141905",
            "dpc": "03042926701",
            "name": "យិន ឡាង"
        },
        {
            "barcode": "171141906",
            "dpc": "03042919401",
            "name": "ឡាច វិត"
        },
        {
            "barcode": "171141907",
            "dpc": "03042919501",
            "name": "ហុង ភាព"
        },
        {
            "barcode": "171141908",
            "dpc": "03042919701",
            "name": "សំ សារឿត"
        },
        {
            "barcode": "171141909",
            "dpc": "03042919801",
            "name": "ហង្ស រី"
        },
        {
            "barcode": "171141910",
            "dpc": "03042927501",
            "name": "ទៀប ចាន់ធឿន"
        },
        {
            "barcode": "171141911",
            "dpc": "03042935001",
            "name": "គីម លី"
        },
        {
            "barcode": "171141912",
            "dpc": "03042933801",
            "name": "ឡិប ទ៉នី"
        },
        {
            "barcode": "171141913",
            "dpc": "03042920301",
            "name": "ណុប ស្រីនាង ១"
        },
        {
            "barcode": "171141914",
            "dpc": "03042920401",
            "name": "កែវ បញ្ញា"
        },
        {
            "barcode": "171141915",
            "dpc": "03042920501",
            "name": "សុខ វាសនា"
        },
        {
            "barcode": "171141916",
            "dpc": "03042920601",
            "name": "ហុក លីហេង"
        },
        {
            "barcode": "171141917",
            "dpc": "03042920701",
            "name": "យ៉ុន សម្ភស្ស"
        },
        {
            "barcode": "171141918",
            "dpc": "03042908701",
            "name": "អ៊ុក មៃ"
        },
        {
            "barcode": "171141919",
            "dpc": "03042931501",
            "name": "ជា ដានី"
        },
        {
            "barcode": "171141920",
            "dpc": "03042909001",
            "name": "ហេង យី"
        },
        {
            "barcode": "171141921",
            "dpc": "03042931601",
            "name": "ឡាប ប៉េងគី"
        },
        {
            "barcode": "171141922",
            "dpc": "03042905401",
            "name": "គឹម យ៉ាន"
        },
        {
            "barcode": "171141923",
            "dpc": "03042901701",
            "name": "ឆុំ ស្លីម៉ាត់"
        },
        {
            "barcode": "171141924",
            "dpc": "03042912901",
            "name": "ពៅ ចាន់ថា"
        },
        {
            "barcode": "171141925",
            "dpc": "03042914601",
            "name": "ឈឺន សំណាង"
        },
        {
            "barcode": "171141926",
            "dpc": "03042914501",
            "name": "វាំង បាន"
        },
        {
            "barcode": "171141927",
            "dpc": "03042929201",
            "name": "សាយ សាវី"
        },
        {
            "barcode": "171141928",
            "dpc": "03042914401",
            "name": "ដាំ ម៉េង"
        },
        {
            "barcode": "171141929",
            "dpc": "03042909501",
            "name": "សេង ឡុង"
        },
        {
            "barcode": "171141930",
            "dpc": "03042910801",
            "name": "ហុក រតនា"
        },
        {
            "barcode": "171141931",
            "dpc": "03042907301",
            "name": "ងិន ឆប"
        },
        {
            "barcode": "171141932",
            "dpc": "03042910901",
            "name": "ជុំ សអ៊ុន"
        },
        {
            "barcode": "171141933",
            "dpc": "03042909801",
            "name": "វិញ សាវឿន"
        },
        {
            "barcode": "171141934",
            "dpc": "03042902901",
            "name": "តែ ប៊ុនលី"
        },
        {
            "barcode": "171141935",
            "dpc": "03042911501",
            "name": "រេន សុខារ៉ា"
        },
        {
            "barcode": "171141936",
            "dpc": "03042900401",
            "name": "វិន វន"
        },
        {
            "barcode": "171141937",
            "dpc": "03042911101",
            "name": "ធី សោភា"
        },
        {
            "barcode": "171141938",
            "dpc": "03042910601",
            "name": "ជា វិចិត្រ"
        },
        {
            "barcode": "171141939",
            "dpc": "03042908401",
            "name": "ហៀក សុភ័ក្រ"
        },
        {
            "barcode": "171141940",
            "dpc": "03042916201",
            "name": "ឈៀង សុផាន់ដា"
        },
        {
            "barcode": "171141941",
            "dpc": "03042919901",
            "name": "ហ៊ាង រស្មី"
        },
        {
            "barcode": "171141942",
            "dpc": "03042917701",
            "name": "ឈិត អារុណ"
        },
        {
            "barcode": "171141943",
            "dpc": "03042931701",
            "name": "រ៉ន កណ្ណិកា"
        },
        {
            "barcode": "171141944",
            "dpc": "03042924301",
            "name": "ព្រាប យឿម"
        },
        {
            "barcode": "171141945",
            "dpc": "03042934201",
            "name": "សោម កុសល"
        },
        {
            "barcode": "171141946",
            "dpc": "03042909401",
            "name": "ខែម សឿន"
        },
        {
            "barcode": "171141947",
            "dpc": "03042936801",
            "name": "ទេព ភារម"
        },
        {
            "barcode": "171141948",
            "dpc": "03042931801",
            "name": "ចាន់ តេងសូនី"
        },
        {
            "barcode": "171141949",
            "dpc": "03042903501",
            "name": "លឹម គឹមជា"
        },
        {
            "barcode": "171141950",
            "dpc": "03042903601",
            "name": "ឌឿន ឆន"
        },
        {
            "barcode": "171141951",
            "dpc": "03042925901",
            "name": "ចាន់ សារិទ្ធិ"
        },
        {
            "barcode": "171141952",
            "dpc": "03042917001",
            "name": "ខែម សារិទ្ធី"
        },
        {
            "barcode": "171141953",
            "dpc": "03042909301",
            "name": "ង៉ែត គឹមឈឿន"
        },
        {
            "barcode": "171141954",
            "dpc": "03042927701",
            "name": "សំ សឿន"
        },
        {
            "barcode": "171141955",
            "dpc": "03042914701",
            "name": "ជួន សំណាង"
        },
        {
            "barcode": "171141956",
            "dpc": "03042921601",
            "name": "ធិម ម៉ារដ្ឋ"
        },
        {
            "barcode": "171141957",
            "dpc": "03042921701",
            "name": "លី សារឿន"
        },
        {
            "barcode": "171141958",
            "dpc": "03042900101",
            "name": "នួច ផុន"
        },
        {
            "barcode": "171141959",
            "dpc": "03042904501",
            "name": "សាលា CUS"
        },
        {
            "barcode": "171141960",
            "dpc": "03042901401",
            "name": "សាន់ ស៊ីនឿន"
        },
        {
            "barcode": "171141961",
            "dpc": "03042934301",
            "name": "ឈួម សំណាង"
        },
        {
            "barcode": "171141962",
            "dpc": "03042913101",
            "name": "ហុង សុខហេង"
        },
        {
            "barcode": "171141963",
            "dpc": "03042913201",
            "name": "ហុង សុខសិរី"
        },
        {
            "barcode": "171141964",
            "dpc": "03042917801",
            "name": "មុត សំ"
        },
        {
            "barcode": "171141965",
            "dpc": "03042913301",
            "name": "ទូច យ៉ាសិទ្ធិ"
        },
        {
            "barcode": "171141966",
            "dpc": "03042911201",
            "name": "គាំ សំអាត"
        },
        {
            "barcode": "171141967",
            "dpc": "03042909901",
            "name": "វង្ស សារិទ្ធភក្ដី"
        },
        {
            "barcode": "171141968",
            "dpc": "03042913001",
            "name": "ប៉ុច ជំនឿន"
        },
        {
            "barcode": "171141969",
            "dpc": "03042919301",
            "name": "ង៉ែត មុំ"
        },
        {
            "barcode": "171141970",
            "dpc": "03042928001",
            "name": "បនា សុខា"
        },
        {
            "barcode": "171141971",
            "dpc": "03042908301",
            "name": "អុល ថូ"
        },
        {
            "barcode": "171141972",
            "dpc": "03042913401",
            "name": "ញ៉ែម រតនា"
        },
        {
            "barcode": "171141973",
            "dpc": "03042935101",
            "name": "ភិន ធឿន"
        },
        {
            "barcode": "171141974",
            "dpc": "03042902101",
            "name": "លាន ឡាត់"
        },
        {
            "barcode": "171141975",
            "dpc": "03042928401",
            "name": "សន សុខនិ"
        },
        {
            "barcode": "171141976",
            "dpc": "03042936301",
            "name": "អ៊ុត ស៊ីណាត១"
        },
        {
            "barcode": "171141977",
            "dpc": "03042936601",
            "name": "ឌុច រតនា"
        },
        {
            "barcode": "171141978",
            "dpc": "03042936701",
            "name": "គុយ សុងលាង"
        },
        {
            "barcode": "171141979",
            "dpc": "03042904301",
            "name": "សាលាវត្តកំផែង"
        },
        {
            "barcode": "171141980",
            "dpc": "03042904401",
            "name": "វិទ្យាល័យសម្តេចឪ"
        },
        {
            "barcode": "171141981",
            "dpc": "03042901501",
            "name": "សាំង ប៊ុនម៉ៅ"
        },
        {
            "barcode": "171141982",
            "dpc": "03042901601",
            "name": "ជា សុផល់"
        },
        {
            "barcode": "171141983",
            "dpc": "03042923501",
            "name": "សុខ មុំ"
        },
        {
            "barcode": "171141984",
            "dpc": "03042936001",
            "name": "ធិន នរសីហា"
        },
        {
            "barcode": "171141985",
            "dpc": "03042907501",
            "name": "ភឿក ឡុងឌី"
        },
        {
            "barcode": "171141986",
            "dpc": "03042907601",
            "name": "កឹម ភឹម"
        },
        {
            "barcode": "171141987",
            "dpc": "03042901801",
            "name": "ឈួ ឡៃហ៊ាង"
        },
        {
            "barcode": "171141988",
            "dpc": "03042901201",
            "name": "ឡេង ស៊ីណា"
        },
        {
            "barcode": "171141989",
            "dpc": "03042932101",
            "name": "ហែម សុធា"
        },
        {
            "barcode": "171141990",
            "dpc": "03042935801",
            "name": "តែ ស៊ីណូ"
        },
        {
            "barcode": "171141991",
            "dpc": "03042933501",
            "name": "គឹម ទៀង"
        },
        {
            "barcode": "171141992",
            "dpc": "03042911601",
            "name": "រិទ្ធ ដាណេ"
        },
        {
            "barcode": "171141993",
            "dpc": "03042910001",
            "name": "តាំង ហ៊ីង"
        },
        {
            "barcode": "171141994",
            "dpc": "03042900901",
            "name": "ឈិន ផាត់ឌី"
        },
        {
            "barcode": "171141995",
            "dpc": "03042930301",
            "name": "ឃួន នឿន៣"
        },
        {
            "barcode": "171141996",
            "dpc": "03042926901",
            "name": "អ៊ុត ក្លឹង ៣"
        },
        {
            "barcode": "171141997",
            "dpc": "03042913501",
            "name": "ស៊ា រឿត"
        },
        {
            "barcode": "171141998",
            "dpc": "03042916601",
            "name": "សយ តឹង"
        },
        {
            "barcode": "171141999",
            "dpc": "03042916701",
            "name": "យិន វន"
        },
        {
            "barcode": "171142000",
            "dpc": "03042916801",
            "name": "ថយ សុភា"
        },
        {
            "barcode": "171142001",
            "dpc": "03042926001",
            "name": "ជា ពិសី"
        },
        {
            "barcode": "171142002",
            "dpc": "03042926101",
            "name": "ថៃ សាម៉ុន"
        },
        {
            "barcode": "171142003",
            "dpc": "03042930401",
            "name": "សូន្យ ណាវុធ"
        },
        {
            "barcode": "171142004",
            "dpc": "03042930601",
            "name": "នីវ ថាន"
        },
        {
            "barcode": "171142005",
            "dpc": "03042930701",
            "name": "ផុន សារ៉ុម"
        },
        {
            "barcode": "171142006",
            "dpc": "03042930501",
            "name": "មឿង មឿន"
        },
        {
            "barcode": "171142007",
            "dpc": "03042930801",
            "name": "សូ ស៊ីម"
        },
        {
            "barcode": "171142008",
            "dpc": "03042930901",
            "name": "អុំ ភីនីសារ៉ា"
        },
        {
            "barcode": "171142009",
            "dpc": "03042931101",
            "name": "វ៉ាន់ ច័ន្ទ"
        },
        {
            "barcode": "171142010",
            "dpc": "03042933301",
            "name": "អួន ណែម"
        },
        {
            "barcode": "171142011",
            "dpc": "03042902201",
            "name": "លីន វណ្ណា"
        },
        {
            "barcode": "171142012",
            "dpc": "03042915901",
            "name": "ម៉ៅ សុជាតិ"
        },
        {
            "barcode": "171142013",
            "dpc": "03042915801",
            "name": "ឃុន ងួនហុង"
        },
        {
            "barcode": "171142014",
            "dpc": "03042934601",
            "name": "យី គក់"
        },
        {
            "barcode": "171142015",
            "dpc": "03042934501",
            "name": "ហុក សំសិទ្ធិ"
        },
        {
            "barcode": "171142016",
            "dpc": "03042923201",
            "name": "ឈឹម សារឿន"
        },
        {
            "barcode": "171142017",
            "dpc": "03042937901",
            "name": "ឃឹម គឹម"
        },
        {
            "barcode": "171142018",
            "dpc": "03042937801",
            "name": "បេង ប៊ុនអាត"
        },
        {
            "barcode": "171142019",
            "dpc": "03042937701",
            "name": "ស៊ុំ ចំរើន"
        },
        {
            "barcode": "171142020",
            "dpc": "03042937601",
            "name": "សំ សុធា"
        },
        {
            "barcode": "171142021",
            "dpc": "03042937201",
            "name": "ប្រោញ វុទ្ធី"
        },
        {
            "barcode": "171142022",
            "dpc": "03042937301",
            "name": "ឌួង អ៊ុត"
        },
        {
            "barcode": "171142023",
            "dpc": "03042937401",
            "name": "អឿន វុទ្ធី"
        },
        {
            "barcode": "171142024",
            "dpc": "03042937501",
            "name": "ស៊ុយ គឹមសឿន"
        },
        {
            "barcode": "171142025",
            "dpc": "03042937101",
            "name": "លួន ភាព"
        },
        {
            "barcode": "171142026",
            "dpc": "03042908501",
            "name": "ឆេង គឹមអាន"
        },
        {
            "barcode": "171142027",
            "dpc": "03042933401",
            "name": "ផាត់ ផារើយ"
        },
        {
            "barcode": "171142028",
            "dpc": "03042916101",
            "name": "យ៉ន ទីណា"
        },
        {
            "barcode": "171142029",
            "dpc": "03042913801",
            "name": "ឈួ គី"
        },
        {
            "barcode": "171142030",
            "dpc": "03042928201",
            "name": "ហ៊ន សារ៉ាត់"
        },
        {
            "barcode": "171142031",
            "dpc": "03042928101",
            "name": "យ៉ត យឿត"
        },
        {
            "barcode": "171142032",
            "dpc": "03042902401",
            "name": "វ៉ន ពៅ"
        },
        {
            "barcode": "171142033",
            "dpc": "03042911301",
            "name": "ឡុច វណ្ណផា"
        },
        {
            "barcode": "171142034",
            "dpc": "03042913601",
            "name": "ឡាច បូរ៉ា"
        },
        {
            "barcode": "171142035",
            "dpc": "03042926401",
            "name": "ង៉ែត មាន"
        },
        {
            "barcode": "171142036",
            "dpc": "03042906101",
            "name": "ជួង សុថា"
        },
        {
            "barcode": "171142037",
            "dpc": "03042902301",
            "name": "ប៉ិច សារ៉ែម"
        },
        {
            "barcode": "171142038",
            "dpc": "03042912301",
            "name": "មាន សុខរ៉ា"
        },
        {
            "barcode": "171142039",
            "dpc": "03042900701",
            "name": "ទួត ដារិទ្ធ"
        },
        {
            "barcode": "171142040",
            "dpc": "03042922201",
            "name": "សន ណាវី"
        },
        {
            "barcode": "171142041",
            "dpc": "03042922101",
            "name": "ឆាន់ វាសនា"
        },
        {
            "barcode": "171142042",
            "dpc": "03042922001",
            "name": "ធូក វុទ្ធី"
        },
        {
            "barcode": "171142043",
            "dpc": "03042933201",
            "name": "ព្រិស គឹមស៊ួ"
        },
        {
            "barcode": "171142044",
            "dpc": "03042900201",
            "name": "ឈួយ វិចិត្រ"
        },
        {
            "barcode": "171142045",
            "dpc": "03042901101",
            "name": "ស៊ិប សូលី"
        },
        {
            "barcode": "171142046",
            "dpc": "03042910201",
            "name": "សេង សុវុធដារ៉ា"
        },
        {
            "barcode": "171142047",
            "dpc": "03042922401",
            "name": "វ៉ាន់ វឌ្ឍនា"
        },
        {
            "barcode": "171142048",
            "dpc": "03042912001",
            "name": "គង់ រិន"
        },
        {
            "barcode": "171142049",
            "dpc": "03042922501",
            "name": "អាត វាសនា"
        },
        {
            "barcode": "171142050",
            "dpc": "03042929001",
            "name": "ឈួន ដាវី"
        },
        {
            "barcode": "171142051",
            "dpc": "03042914001",
            "name": "អ៊ុក វឌ្ឍរ័ត្ន"
        },
        {
            "barcode": "171142052",
            "dpc": "03042934401",
            "name": "ជា វណ្ណៈ"
        },
        {
            "barcode": "171142053",
            "dpc": "03042904901",
            "name": "មន្ទីរស្រាវជ្រាវ"
        },
        {
            "barcode": "171142054",
            "dpc": "03042905101",
            "name": "ប៉ិន វណ្ណៈ"
        },
        {
            "barcode": "171142055",
            "dpc": "03042922601",
            "name": "ប៊ី សុភ័ក្រ"
        },
        {
            "barcode": "171142056",
            "dpc": "03042922701",
            "name": "យន ឡាណា"
        },
        {
            "barcode": "171142057",
            "dpc": "03042902001",
            "name": "ឡុង ស៊ីណាត"
        },
        {
            "barcode": "171142058",
            "dpc": "03042923001",
            "name": "ប៉ែន ចិន្តា"
        },
        {
            "barcode": "171142059",
            "dpc": "03042905201",
            "name": "ចាន់ សំបូរ"
        },
        {
            "barcode": "171142060",
            "dpc": "03042922901",
            "name": "យូ ភីរុន"
        },
        {
            "barcode": "171142061",
            "dpc": "03042922801",
            "name": "ហេង ម៉េងហួត"
        },
        {
            "barcode": "171142062",
            "dpc": "03042916301",
            "name": "ឌិន សឿង"
        },
        {
            "barcode": "171142063",
            "dpc": "03042904001",
            "name": "ទង ស្រី"
        },
        {
            "barcode": "171142064",
            "dpc": "03042904701",
            "name": "ភោគ សុជាតិ"
        },
        {
            "barcode": "171142065",
            "dpc": "03042903901",
            "name": "មៀន ឈឿន"
        },
        {
            "barcode": "171142066",
            "dpc": "03042926501",
            "name": "គិន ស៊ុន"
        },
        {
            "barcode": "171142067",
            "dpc": "03042926601",
            "name": "ភិន រិន"
        },
        {
            "barcode": "171142068",
            "dpc": "03042900601",
            "name": "សឿ សំអុល"
        },
        {
            "barcode": "171142069",
            "dpc": "03042906401",
            "name": "ភោគ សុជាតិ"
        },
        {
            "barcode": "171142070",
            "dpc": "03042906501",
            "name": "រស់ សុភាព"
        },
        {
            "barcode": "171142071",
            "dpc": "03042929101",
            "name": "ឈឿង វុទ្ធី"
        },
        {
            "barcode": "171142072",
            "dpc": "03042901001",
            "name": "សុខ ស៊ីថា"
        },
        {
            "barcode": "171142073",
            "dpc": "03042931001",
            "name": "ស៊ីង សាន"
        },
        {
            "barcode": "171142074",
            "dpc": "03042900301",
            "name": "នូ សុរិយា"
        },
        {
            "barcode": "171142075",
            "dpc": "03042900501",
            "name": "យស់ ម៉ារ៉ា"
        },
        {
            "barcode": "171142076",
            "dpc": "03042901301",
            "name": "អូន ហ្វៃ"
        },
        {
            "barcode": "171142077",
            "dpc": "03042901901",
            "name": "ឡឹក រ៉ៃយ៉ា"
        },
        {
            "barcode": "171142078",
            "dpc": "03042902501",
            "name": "ឈឿត ដានី"
        },
        {
            "barcode": "171142079",
            "dpc": "03042902601",
            "name": "លេខ ពៅ"
        },
        {
            "barcode": "171142080",
            "dpc": "03042902701",
            "name": "ស៊ុន សំណាង"
        },
        {
            "barcode": "171142081",
            "dpc": "03042903101",
            "name": "ពេជ្រ សុផេង"
        },
        {
            "barcode": "171142082",
            "dpc": "03042903201",
            "name": "លីម ប៊ុនណា"
        },
        {
            "barcode": "171142083",
            "dpc": "03042903301",
            "name": "គួយ សុខជា"
        },
        {
            "barcode": "171142084",
            "dpc": "03042903401",
            "name": "សុខ ជីវី"
        },
        {
            "barcode": "171142085",
            "dpc": "03042903701",
            "name": "មឹង មុនីរម្យ"
        },
        {
            "barcode": "171142086",
            "dpc": "03042904801",
            "name": "យិន ម៉ៅ"
        },
        {
            "barcode": "171142087",
            "dpc": "03042905001",
            "name": "ហូវ សុមុនី"
        },
        {
            "barcode": "171142088",
            "dpc": "03042905301",
            "name": "ហួយ ចន្ធី"
        },
        {
            "barcode": "171142089",
            "dpc": "03042905501",
            "name": "កែវ ចន្ថា ២"
        },
        {
            "barcode": "171142090",
            "dpc": "03042905601",
            "name": "វ៉ែន ទូច"
        },
        {
            "barcode": "171142091",
            "dpc": "03042905701",
            "name": "អែតហ្វូត ២៥"
        },
        {
            "barcode": "171142092",
            "dpc": "03042905801",
            "name": "ប៉ែន អូន"
        },
        {
            "barcode": "171142093",
            "dpc": "03042905901",
            "name": "ផាវ ផល"
        },
        {
            "barcode": "171142094",
            "dpc": "03042906001",
            "name": "ទូច សម្បត្តិ"
        },
        {
            "barcode": "171142095",
            "dpc": "03042906201",
            "name": "សាំង វាសនា"
        },
        {
            "barcode": "171142096",
            "dpc": "03042906301",
            "name": "ជឹម ចាន់ថន"
        },
        {
            "barcode": "171142097",
            "dpc": "03042906601",
            "name": "សាន"
        },
        {
            "barcode": "171142098",
            "dpc": "03042906701",
            "name": "ហ្គេច ម៉េងសូរី"
        },
        {
            "barcode": "171142099",
            "dpc": "03042906801",
            "name": "សុខុម សុខាលីន"
        },
        {
            "barcode": "171142100",
            "dpc": "03042906901",
            "name": "ឃុន ហ៊ីម"
        },
        {
            "barcode": "171142101",
            "dpc": "03042907001",
            "name": "សុង ណាំង"
        },
        {
            "barcode": "171142102",
            "dpc": "03042907101",
            "name": "ទូច ប៊ុនថេន"
        },
        {
            "barcode": "171142103",
            "dpc": "03042907201",
            "name": "ថន ថុលសុវណ្ណវិបុល"
        },
        {
            "barcode": "171142104",
            "dpc": "03042907401",
            "name": "សំណាង សីម៉ា"
        },
        {
            "barcode": "171142105",
            "dpc": "03042907701",
            "name": "កៅ អ៊ាងឡាយ ២"
        },
        {
            "barcode": "171142106",
            "dpc": "03042907801",
            "name": "បុន៊ សុខាណា"
        },
        {
            "barcode": "171142107",
            "dpc": "03042907901",
            "name": "ប៊ុន រដ្ឋា"
        },
        {
            "barcode": "171142108",
            "dpc": "03042908001",
            "name": "ប៊ុន វុទ្ធី"
        },
        {
            "barcode": "171142109",
            "dpc": "03042908101",
            "name": "សាំង សុធារស"
        },
        {
            "barcode": "171142110",
            "dpc": "03042908201",
            "name": "ឆៃ សុខុម"
        },
        {
            "barcode": "171142111",
            "dpc": "03042908601",
            "name": "ហ៊ុយ បៀន"
        },
        {
            "barcode": "171142112",
            "dpc": "03042908801",
            "name": "ឆឹង នី"
        },
        {
            "barcode": "171142113",
            "dpc": "03042908901",
            "name": "ឡេង ស៊ីណា ៤"
        },
        {
            "barcode": "171142114",
            "dpc": "03042909101",
            "name": "ហេង ផល្លី"
        },
        {
            "barcode": "171142115",
            "dpc": "03042909601",
            "name": "អ៊ុង ហេម"
        },
        {
            "barcode": "171142116",
            "dpc": "03042910101",
            "name": "សិបុ លឿត"
        },
        {
            "barcode": "171142117",
            "dpc": "03042910301",
            "name": "គុយ ប៉េងស៊្រាង"
        },
        {
            "barcode": "171142118",
            "dpc": "03042910401",
            "name": "ឈុន ថា"
        },
        {
            "barcode": "171142119",
            "dpc": "03042910501",
            "name": "ស៊ុន ហុង"
        },
        {
            "barcode": "171142120",
            "dpc": "03042910701",
            "name": "កុយ ស៊ីដេត"
        },
        {
            "barcode": "171142121",
            "dpc": "03042911001",
            "name": "ឯក សំយុទ្ធ"
        },
        {
            "barcode": "171142122",
            "dpc": "03042911401",
            "name": "នេត ស៊ីថន"
        },
        {
            "barcode": "171142123",
            "dpc": "03042911701",
            "name": "ហួរ ឆុង"
        },
        {
            "barcode": "171142124",
            "dpc": "03042911801",
            "name": "យុត តុងហាន់"
        },
        {
            "barcode": "171142125",
            "dpc": "03042911901",
            "name": "ឡៃ ចិន"
        },
        {
            "barcode": "171142126",
            "dpc": "03042912201",
            "name": "ឈុន បូទំ"
        },
        {
            "barcode": "171142127",
            "dpc": "03042912401",
            "name": "វែង ហុក"
        },
        {
            "barcode": "171142128",
            "dpc": "03042912501",
            "name": "ជៀម សុខា"
        },
        {
            "barcode": "171142129",
            "dpc": "03042912601",
            "name": "តាំង ឡាយ"
        },
        {
            "barcode": "171142130",
            "dpc": "03042912701",
            "name": "អ៊ីវ ថន"
        },
        {
            "barcode": "171142131",
            "dpc": "03042912801",
            "name": "ទេព វណ្ណា"
        },
        {
            "barcode": "171142132",
            "dpc": "03042914101",
            "name": "ឈឹម សារ៉េត"
        },
        {
            "barcode": "171142133",
            "dpc": "03042914201",
            "name": "សំ សុខហេង"
        },
        {
            "barcode": "171142134",
            "dpc": "03042914301",
            "name": "សាន ចន"
        },
        {
            "barcode": "171142135",
            "dpc": "03042914801",
            "name": "ឌឿក វណ្ណា"
        },
        {
            "barcode": "171142136",
            "dpc": "03042914901",
            "name": "លៀង វិច្ឆិកា"
        },
        {
            "barcode": "171142137",
            "dpc": "03042915001",
            "name": "លាង សម្ផស្ស"
        },
        {
            "barcode": "171142138",
            "dpc": "03042915101",
            "name": "ឡៅ ប៊ុនលីដា"
        },
        {
            "barcode": "171142139",
            "dpc": "03042915201",
            "name": "ហ៊ួន ធារី"
        },
        {
            "barcode": "171142140",
            "dpc": "03042915301",
            "name": "ញ៉ុក ឆវី"
        },
        {
            "barcode": "171142141",
            "dpc": "03042915401",
            "name": "ទ្រិញ យី បូរីផ្សារលើ"
        },
        {
            "barcode": "171142142",
            "dpc": "03042915501",
            "name": "ហ៊ាង សុម៉ាណា បូរីផ្សារេលី"
        },
        {
            "barcode": "171142143",
            "dpc": "03042915601",
            "name": "បនា ឡង បូរីផ្សារលើ"
        },
        {
            "barcode": "171142144",
            "dpc": "03042915701",
            "name": "ហ៊ឹង ផល្លា"
        },
        {
            "barcode": "171142145",
            "dpc": "03042916901",
            "name": "ចាន់ សុធី"
        },
        {
            "barcode": "171142146",
            "dpc": "03042917301",
            "name": "គា ចាន់នី"
        },
        {
            "barcode": "171142147",
            "dpc": "03042917601",
            "name": "ថាន់ រដ្ឋា"
        },
        {
            "barcode": "171142148",
            "dpc": "03042917901",
            "name": "ប៉ែន សុវណ្ណតារា"
        },
        {
            "barcode": "171142149",
            "dpc": "03042918001",
            "name": "ធួន រ៉ាវុធ"
        },
        {
            "barcode": "171142150",
            "dpc": "03042918101",
            "name": "ឡិប សុធា"
        },
        {
            "barcode": "171142151",
            "dpc": "03042918201",
            "name": "លឿង ណាគ្រី"
        },
        {
            "barcode": "171142152",
            "dpc": "03042918301",
            "name": "តិ ចាន់គុណ"
        },
        {
            "barcode": "171142153",
            "dpc": "03042918701",
            "name": "ប៉ុស្តន៍បាយ័ន្ត"
        },
        {
            "barcode": "171142154",
            "dpc": "03042918801",
            "name": "គឹម វុទ្ឌី"
        },
        {
            "barcode": "171142155",
            "dpc": "03042918901",
            "name": "ប្រាក់ វុទ្ធី"
        },
        {
            "barcode": "171142156",
            "dpc": "03042919001",
            "name": "ហុង ចាន់ណា"
        },
        {
            "barcode": "171142157",
            "dpc": "03042919101",
            "name": "ធនាគារកាណាឌីយ៉ា"
        },
        {
            "barcode": "171142158",
            "dpc": "03042919201",
            "name": "ធនាគារប្រៃណីយ៍"
        },
        {
            "barcode": "171142159",
            "dpc": "03042920001",
            "name": "សំ ដារ៉ាវុធ"
        },
        {
            "barcode": "171142160",
            "dpc": "03042920801",
            "name": "កៅ សុផារី"
        },
        {
            "barcode": "171142161",
            "dpc": "03042920901",
            "name": "ពៅ ជា"
        },
        {
            "barcode": "171142162",
            "dpc": "03042921001",
            "name": "ម៉ម សំអុល"
        },
        {
            "barcode": "171142163",
            "dpc": "03042921101",
            "name": "មុំ សុផល"
        },
        {
            "barcode": "171142164",
            "dpc": "03042921201",
            "name": "ព្រំ សុផល"
        },
        {
            "barcode": "171142165",
            "dpc": "03042921401",
            "name": "លឹម ហាក់"
        },
        {
            "barcode": "171142166",
            "dpc": "03042921501",
            "name": "ម៉ុង ធី"
        },
        {
            "barcode": "171142167",
            "dpc": "03042921801",
            "name": "ណៃ វុន"
        },
        {
            "barcode": "171142168",
            "dpc": "03042921901",
            "name": "លឹម ស៊ីថា"
        },
        {
            "barcode": "171142169",
            "dpc": "03042922301",
            "name": "ហុង ស៊ីថា"
        },
        {
            "barcode": "171142170",
            "dpc": "03042923101",
            "name": "អ៊ាន ចន្ទ័ណា"
        },
        {
            "barcode": "171142171",
            "dpc": "03042923601",
            "name": "ដោក ហេង"
        },
        {
            "barcode": "171142172",
            "dpc": "03042923701",
            "name": "ស៊ង លួត"
        },
        {
            "barcode": "171142173",
            "dpc": "03042923801",
            "name": "យិន ធីរ៉ាក់"
        },
        {
            "barcode": "171142174",
            "dpc": "03042923901",
            "name": "វង្ស ឌីណា"
        },
        {
            "barcode": "171142175",
            "dpc": "03042924001",
            "name": "កែវ ជី"
        },
        {
            "barcode": "171142176",
            "dpc": "03042924101",
            "name": "ប៊ុត គីម"
        },
        {
            "barcode": "171142177",
            "dpc": "03042924201",
            "name": "ឯក ម៉ារ៉ាឌី"
        },
        {
            "barcode": "171142178",
            "dpc": "03042924401",
            "name": "នៅ តុលា"
        },
        {
            "barcode": "171142179",
            "dpc": "03042924501",
            "name": "សោម សម្បត្តិ"
        },
        {
            "barcode": "171142180",
            "dpc": "03042924601",
            "name": "សំរទ្ធ ណារី"
        },
        {
            "barcode": "171142181",
            "dpc": "03042924701",
            "name": "ហាក់ ស៊្រី"
        },
        {
            "barcode": "171142182",
            "dpc": "03042924801",
            "name": "ម៉ៅ រឿង"
        },
        {
            "barcode": "171142183",
            "dpc": "03042924901",
            "name": "ព្រឹង តិ"
        },
        {
            "barcode": "171142184",
            "dpc": "03042925001",
            "name": "ម៉ី សំអាង"
        },
        {
            "barcode": "171142185",
            "dpc": "03042925101",
            "name": "ស្រី មុន្នីរិទ្ធ"
        },
        {
            "barcode": "171142186",
            "dpc": "03042925201",
            "name": "គ្រីន ប៊ុនធី"
        },
        {
            "barcode": "171142187",
            "dpc": "03042925301",
            "name": "ស្រេង ឡៃស៊ាង"
        },
        {
            "barcode": "171142188",
            "dpc": "03042925401",
            "name": "វេទ ដារ៉ា"
        },
        {
            "barcode": "171142189",
            "dpc": "03042925501",
            "name": "នួន ម៉ារីន"
        },
        {
            "barcode": "171142190",
            "dpc": "03042925601",
            "name": "វ៉ាន់ សំបូរ"
        },
        {
            "barcode": "171142191",
            "dpc": "03042925801",
            "name": "សុខ ចាន់ធឿន"
        },
        {
            "barcode": "171142192",
            "dpc": "03042926201",
            "name": "ជា សាវឹម"
        },
        {
            "barcode": "171142193",
            "dpc": "03042926301",
            "name": "លន់ ឆឿន"
        },
        {
            "barcode": "171142194",
            "dpc": "03042927001",
            "name": "សាំង សែន"
        },
        {
            "barcode": "171142195",
            "dpc": "03042927101",
            "name": "គង់ រិទ្ធ"
        },
        {
            "barcode": "171142196",
            "dpc": "03042927801",
            "name": "ឈីត រដ្ឋា"
        },
        {
            "barcode": "171142197",
            "dpc": "03042927901",
            "name": "ហ៊ុយ កុសល់"
        },
        {
            "barcode": "171142198",
            "dpc": "03042928301",
            "name": "សុខ ប៊ុនដារ៉ា"
        },
        {
            "barcode": "171142199",
            "dpc": "03042928601",
            "name": "ជុំ រិទ្ធី"
        },
        {
            "barcode": "171142200",
            "dpc": "03042928801",
            "name": "តឹក សំណាក់ ៣"
        },
        {
            "barcode": "171142201",
            "dpc": "03042928901",
            "name": "សារ៉ង ម៉ាឡា"
        },
        {
            "barcode": "171142202",
            "dpc": "03042929301",
            "name": "ប៉េង វុត្ថា"
        },
        {
            "barcode": "171142203",
            "dpc": "03042929401",
            "name": "ម៉ី សយ"
        },
        {
            "barcode": "171142204",
            "dpc": "03042929501",
            "name": "ជូ អរុណ"
        },
        {
            "barcode": "171142205",
            "dpc": "03042929601",
            "name": "ជា រ៉ុង"
        },
        {
            "barcode": "171142206",
            "dpc": "03042929801",
            "name": "វ៉េង ហុក"
        },
        {
            "barcode": "171142207",
            "dpc": "03042930001",
            "name": "ជៀម សុខា ២"
        },
        {
            "barcode": "171142208",
            "dpc": "03042931201",
            "name": "ស៊ុន សារុន"
        },
        {
            "barcode": "171142209",
            "dpc": "03042931301",
            "name": "ស៊ត ស៊ិន"
        },
        {
            "barcode": "171142210",
            "dpc": "03042931901",
            "name": "អ៊ុយ ថារិទ្ធ"
        },
        {
            "barcode": "171142211",
            "dpc": "03042932001",
            "name": "ខឹម យ៉ាន់"
        },
        {
            "barcode": "171142212",
            "dpc": "03042932201",
            "name": "នូវ ចាន់ដារ៉ា"
        },
        {
            "barcode": "171142213",
            "dpc": "03042932501",
            "name": "គុំ វិចិត្ត"
        },
        {
            "barcode": "171142214",
            "dpc": "03042932601",
            "name": "គូ សុងលី"
        },
        {
            "barcode": "171142215",
            "dpc": "03042932701",
            "name": "ស៊ូ សានិត"
        },
        {
            "barcode": "171142216",
            "dpc": "03042932801",
            "name": "ហុង ស៊ីថា"
        },
        {
            "barcode": "171142217",
            "dpc": "03042932901",
            "name": "គង់ ឡេង"
        },
        {
            "barcode": "171142218",
            "dpc": "03042933001",
            "name": "គន់ សូផល្លី"
        },
        {
            "barcode": "171142219",
            "dpc": "03042933601",
            "name": "លេង ណែត"
        },
        {
            "barcode": "171142220",
            "dpc": "03042933701",
            "name": "សុខ យ៉ារ៉ា"
        },
        {
            "barcode": "171142221",
            "dpc": "03042934001",
            "name": "សួង សុគុណ"
        },
        {
            "barcode": "171142222",
            "dpc": "03042934101",
            "name": "ម៉េង វណ្ណៈ"
        },
        {
            "barcode": "171142223",
            "dpc": "03042934701",
            "name": "វុទ្ធ រដ្ឋា"
        },
        {
            "barcode": "171142224",
            "dpc": "03042934801",
            "name": "ហេង ចរិយា"
        },
        {
            "barcode": "171142225",
            "dpc": "03042934901",
            "name": "ឈុន សំបូររ័ត្ន"
        },
        {
            "barcode": "171142226",
            "dpc": "03042935301",
            "name": "យី សុងគី"
        },
        {
            "barcode": "171142227",
            "dpc": "03042935401",
            "name": "ញឹក ប៊ុនឈៀត"
        },
        {
            "barcode": "171142228",
            "dpc": "03042935501",
            "name": "ស៊ាន រ៉ូសេត"
        },
        {
            "barcode": "171142229",
            "dpc": "03042935601",
            "name": "ពិន សុគន្ធ"
        },
        {
            "barcode": "171142230",
            "dpc": "03042935701",
            "name": "ភូ សុខជា"
        },
        {
            "barcode": "171142231",
            "dpc": "03042936101",
            "name": "គី ផល"
        },
        {
            "barcode": "171142232",
            "dpc": "03042936201",
            "name": "ធួន រ៉ាវុធ"
        },
        {
            "barcode": "171142233",
            "dpc": "03042936901",
            "name": "ដែង ខាន់"
        },
        {
            "barcode": "171142234",
            "dpc": "03042937001",
            "name": "ទៀង សុង"
        },
        {
            "barcode": "171142235",
            "dpc": "03042938001",
            "name": "សក់ សំពឿន"
        },
        {
            "barcode": "171142236",
            "dpc": "03042938101",
            "name": "កាយ សុផល"
        },
        {
            "barcode": "171142237",
            "dpc": "03042938201",
            "name": "ជា ភួយ"
        },
        {
            "barcode": "171142238",
            "dpc": "03042938301",
            "name": "ជា ឈឿង"
        },
        {
            "barcode": "171142239",
            "dpc": "03042938401",
            "name": "ជា ខ"
        },
        {
            "barcode": "171142240",
            "dpc": "03042938501",
            "name": "ជា ហិញ"
        },
        {
            "barcode": "171142241",
            "dpc": "03042938601",
            "name": "ជា គង់"
        },
        {
            "barcode": "171142242",
            "dpc": "03042938701",
            "name": "ឈឹម កី"
        },
        {
            "barcode": "171142243",
            "dpc": "03042938801",
            "name": "ឈឹម ឈួង"
        },
        {
            "barcode": "171142244",
            "dpc": "03042938901",
            "name": "អ៊ិត បេង"
        },
        {
            "barcode": "171142245",
            "dpc": "03042939001",
            "name": "ជី គឹមហួយ"
        },
        {
            "barcode": "171142246",
            "dpc": "03042939101",
            "name": "អ៊ិត ពុំ"
        },
        {
            "barcode": "171142247",
            "dpc": "03042939201",
            "name": "មឿក សាមាជ"
        },
        {
            "barcode": "171142248",
            "dpc": "03042939301",
            "name": "ចែត ពាន"
        },
        {
            "barcode": "171142249",
            "dpc": "03042939401",
            "name": "ទៀង ប៊ុនទិត្យ"
        },
        {
            "barcode": "171142250",
            "dpc": "03042939501",
            "name": "អ៊ុច សន"
        },
        {
            "barcode": "171142251",
            "dpc": "03042939601",
            "name": "ទឹម សុផេត"
        },
        {
            "barcode": "171142252",
            "dpc": "03042939701",
            "name": "ឈួត សុខា"
        },
        {
            "barcode": "171142253",
            "dpc": "03042939801",
            "name": "ឈឿន សុវណ្ណា"
        },
        {
            "barcode": "171142254",
            "dpc": "03042939901",
            "name": "ផន ផាន"
        },
        {
            "barcode": "171142255",
            "dpc": "03042940001",
            "name": "ជ សេងហៀង"
        },
        {
            "barcode": "171142256",
            "dpc": "03042940101",
            "name": "ទូច វ៉ាន់ថន"
        },
        {
            "barcode": "171142257",
            "dpc": "03042940201",
            "name": "ម៉ៅ វិចិត្រ"
        },
        {
            "barcode": "171142258",
            "dpc": "03042940301",
            "name": "អោក សុវត្ថិ"
        },
        {
            "barcode": "171142259",
            "dpc": "03042940501",
            "name": "ប៊ួ ព្រីដា"
        },
        {
            "barcode": "171142260",
            "dpc": "03042940601",
            "name": "បៀ មុន្នី"
        },
        {
            "barcode": "171142261",
            "dpc": "03042940701",
            "name": "ងួន រី"
        },
        {
            "barcode": "171142262",
            "dpc": "03042940801",
            "name": "គី ណារិន"
        },
        {
            "barcode": "171142263",
            "dpc": "03042940901",
            "name": "សាង ឡេង"
        },
        {
            "barcode": "171142264",
            "dpc": "03042941001",
            "name": "ជួន ស្រីនី"
        },
        {
            "barcode": "171142265",
            "dpc": "03042941101",
            "name": "អោក រៀត"
        },
        {
            "barcode": "171142266",
            "dpc": "03042941201",
            "name": "រុន រដ្ឋា"
        },
        {
            "barcode": "171142267",
            "dpc": "03042941301",
            "name": "សៀង សារិទ្ធ"
        },
        {
            "barcode": "171142268",
            "dpc": "03042941401",
            "name": "រុន ពិសិដ្ឋ"
        },
        {
            "barcode": "171142269",
            "dpc": "03042941501",
            "name": "ឆាយ បាន"
        },
        {
            "barcode": "171142270",
            "dpc": "03042941601",
            "name": "វាត វិបុល"
        },
        {
            "barcode": "171142271",
            "dpc": "03042941801",
            "name": "វ៉ាត សុខលី"
        },
        {
            "barcode": "171142272",
            "dpc": "03042941901",
            "name": "ញែម កឿន"
        },
        {
            "barcode": "171142273",
            "dpc": "03042942001",
            "name": "ម៉ៅ មិ"
        },
        {
            "barcode": "171142274",
            "dpc": "03042942101",
            "name": "យ៉េត ម៉ាន"
        },
        {
            "barcode": "171142275",
            "dpc": "03042942201",
            "name": "ចំរើន រិទ្ធិ"
        },
        {
            "barcode": "171142276",
            "dpc": "03042942301",
            "name": "ចាប យន"
        },
        {
            "barcode": "171142277",
            "dpc": "03042942801",
            "name": "ពៅ ញាណ"
        },
        {
            "barcode": "171142278",
            "dpc": "03042942901",
            "name": "ពៅ អុក"
        },
        {
            "barcode": "171142279",
            "dpc": "03042943001",
            "name": "ង៉ាម នងរដ្ឋា"
        },
        {
            "barcode": "171142280",
            "dpc": "03042943101",
            "name": "ឈឿន សុវណ្ណះ"
        },
        {
            "barcode": "171142281",
            "dpc": "03042943301",
            "name": "នួន សាន"
        },
        {
            "barcode": "171142282",
            "dpc": "03042943401",
            "name": "ចន្ទ័ សុជាតិ"
        },
        {
            "barcode": "171142283",
            "dpc": "03042943501",
            "name": "ហ៊ត បួ"
        },
        {
            "barcode": "171142284",
            "dpc": "03042943601",
            "name": "សុខ លីគា"
        },
        {
            "barcode": "171142285",
            "dpc": "03042943701",
            "name": "មួន ថានី"
        },
        {
            "barcode": "171142286",
            "dpc": "03042943801",
            "name": "ឡុច វណ្ណថា"
        },
        {
            "barcode": "171142287",
            "dpc": "03042943901",
            "name": "គង់ បាន"
        },
        {
            "barcode": "171142288",
            "dpc": "03042944001",
            "name": "រីន សុភាព"
        },
        {
            "barcode": "171142289",
            "dpc": "03042944201",
            "name": "ស៊ុត សាវ៉ៃ"
        },
        {
            "barcode": "171142290",
            "dpc": "03042944301",
            "name": "អ៊ឹម សុខធា"
        },
        {
            "barcode": "171142291",
            "dpc": "03042944401",
            "name": "ថន ថេរ"
        },
        {
            "barcode": "171142292",
            "dpc": "03042944501",
            "name": "មាស សុផាត"
        },
        {
            "barcode": "171142293",
            "dpc": "03042944601",
            "name": "ប្រាក់ កុសល់"
        },
        {
            "barcode": "171142294",
            "dpc": "03042944701",
            "name": "កន គឹមស៊"
        },
        {
            "barcode": "171142295",
            "dpc": "03042945001",
            "name": "ភោគ ធារី"
        },
        {
            "barcode": "171142296",
            "dpc": "03042945101",
            "name": "ទួត សាទុំ"
        },
        {
            "barcode": "171142297",
            "dpc": "03042945201",
            "name": "ចាន់ សុខុម"
        },
        {
            "barcode": "171142298",
            "dpc": "03042945401",
            "name": "អ៊ាម ងិ"
        },
        {
            "barcode": "171142299",
            "dpc": "03042945601",
            "name": "អ៊ុម សំ"
        },
        {
            "barcode": "171142300",
            "dpc": "03042945701",
            "name": "សាំង យឿន"
        },
        {
            "barcode": "171142301",
            "dpc": "03042945801",
            "name": "អោក បេងឈុន"
        },
        {
            "barcode": "171142302",
            "dpc": "03042945901",
            "name": "ភឿក បេងឈាន"
        },
        {
            "barcode": "171142303",
            "dpc": "03042946201",
            "name": "ម៉ាក យូរ៉ាត់"
        },
        {
            "barcode": "171142304",
            "dpc": "03042946301",
            "name": "អាង ចុងបរ"
        },
        {
            "barcode": "171142305",
            "dpc": "03042946401",
            "name": "ស៊ិន សុគន្ធ"
        },
        {
            "barcode": "171142306",
            "dpc": "03042946501",
            "name": "ឈឿម យិន"
        },
        {
            "barcode": "171142307",
            "dpc": "03042946601",
            "name": "ទេព បញ្ញា"
        },
        {
            "barcode": "171142308",
            "dpc": "03042946701",
            "name": "ហ៊ុល បឋម"
        },
        {
            "barcode": "171142309",
            "dpc": "03042947001",
            "name": "ហ៊ុល ម៉ាឡៃ"
        },
        {
            "barcode": "171142310",
            "dpc": "03042947101",
            "name": "អឿប ល្បត់"
        },
        {
            "barcode": "171142311",
            "dpc": "03042947201",
            "name": "រៀង"
        },
        {
            "barcode": "171142312",
            "dpc": "03042947301",
            "name": "ពៅ"
        },
        {
            "barcode": "171142313",
            "dpc": "03042947401",
            "name": "ម្លិះ គឹមបេង"
        },
        {
            "barcode": "171142314",
            "dpc": "03042947501",
            "name": "ឆយ សារិន"
        },
        {
            "barcode": "171142315",
            "dpc": "03042947601",
            "name": "ភិន សុថេត"
        },
        {
            "barcode": "171142316",
            "dpc": "03042947701",
            "name": "ស៊ាន ចាន់ធា"
        },
        {
            "barcode": "171142317",
            "dpc": "03042947801",
            "name": "គៀង ហាន"
        },
        {
            "barcode": "171142318",
            "dpc": "03042947901",
            "name": "ប៊ុត ចាន់សុថា"
        },
        {
            "barcode": "171145657",
            "dpc": "03042948001",
            "name": "សុខ សុម៉ាលី"
        }
    ]

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
