let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171130858",
            "dpc": "03013004501",
            "name": "គឹម ហៀក"
        },
        {
            "barcode": "171130859",
            "dpc": "03013007401",
            "name": "ប៉ិច ស៊ីណា"
        },
        {
            "barcode": "171130860",
            "dpc": "03013006801",
            "name": "យឿម ដារ៉ៃ"
        },
        {
            "barcode": "171130861",
            "dpc": "03013006701",
            "name": "ទីន ហាន"
        },
        {
            "barcode": "171130862",
            "dpc": "03013006601",
            "name": "ម៉ៅ រ៉ាម៉ន"
        },
        {
            "barcode": "171130863",
            "dpc": "03013002101",
            "name": "ផាន លីហុង"
        },
        {
            "barcode": "171130864",
            "dpc": "03013001001",
            "name": "ហេង ប៊ុនធឿន"
        },
        {
            "barcode": "171130865",
            "dpc": "03013013201",
            "name": "ស៊ន ហាន"
        },
        {
            "barcode": "171130866",
            "dpc": "03013018201",
            "name": "ហេង ចំរើន"
        },
        {
            "barcode": "171130867",
            "dpc": "03013012701",
            "name": "អ៊ុក គឹមឡេក"
        },
        {
            "barcode": "171130868",
            "dpc": "03013003801",
            "name": "រឿន ភារុណ"
        },
        {
            "barcode": "171130869",
            "dpc": "03013012001",
            "name": "គឹម បុផា"
        },
        {
            "barcode": "171130870",
            "dpc": "03013005701",
            "name": "ម៉ៅ ហួយ"
        },
        {
            "barcode": "171130871",
            "dpc": "03013011901",
            "name": "តូច ចេវ"
        },
        {
            "barcode": "171130872",
            "dpc": "03013001401",
            "name": "សន ពៅ"
        },
        {
            "barcode": "171130873",
            "dpc": "03013013001",
            "name": "រស្មី គឹមហេង"
        },
        {
            "barcode": "171130874",
            "dpc": "03013001201",
            "name": "រ៉ាយ នូរ"
        },
        {
            "barcode": "171130875",
            "dpc": "03013017801",
            "name": "អ៊ុ ចាន់សួរ"
        },
        {
            "barcode": "171130876",
            "dpc": "03013001601",
            "name": "រឿន រ៉េត"
        },
        {
            "barcode": "171130877",
            "dpc": "03013001701",
            "name": "តឹក រ៉ាវុធ"
        },
        {
            "barcode": "171130878",
            "dpc": "03013004301",
            "name": "អ៊ុក សុខហេង"
        },
        {
            "barcode": "171130879",
            "dpc": "03013012101",
            "name": "ប្រាក់ ស៊ីវត្ថា"
        },
        {
            "barcode": "171130880",
            "dpc": "03013015201",
            "name": "សាលារៀន រតនៈ"
        },
        {
            "barcode": "171130881",
            "dpc": "03013007001",
            "name": "សូ សាវី"
        },
        {
            "barcode": "171130882",
            "dpc": "03013007301",
            "name": "ពុំ ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171130883",
            "dpc": "03013012801",
            "name": "យស់ យឿន"
        },
        {
            "barcode": "171130884",
            "dpc": "03013013101",
            "name": "គង់ ស៊ីវន"
        },
        {
            "barcode": "171130885",
            "dpc": "03013004801",
            "name": "ស៊ុន សំបូរ"
        },
        {
            "barcode": "171130886",
            "dpc": "03013020201",
            "name": "ព្រំ ឌីផាណេត"
        },
        {
            "barcode": "171130887",
            "dpc": "03013020501",
            "name": "តាន់ ប៊ុនធឿន"
        },
        {
            "barcode": "171130888",
            "dpc": "03013007201",
            "name": "ភិន ភារិទ្ធ"
        },
        {
            "barcode": "171130889",
            "dpc": "03013000901",
            "name": "ប៉ាន់ វូចឡា"
        },
        {
            "barcode": "171130890",
            "dpc": "03013020301",
            "name": "សុខ ជួង"
        },
        {
            "barcode": "171130891",
            "dpc": "03013020401",
            "name": "ពុំ រតនា"
        },
        {
            "barcode": "171130892",
            "dpc": "03013024501",
            "name": "យូ វុទ្ធី"
        },
        {
            "barcode": "171130893",
            "dpc": "03013024601",
            "name": "ថាច់ រដើយ"
        },
        {
            "barcode": "171130894",
            "dpc": "03013013701",
            "name": "សេន ហ៊ូយ"
        },
        {
            "barcode": "171130895",
            "dpc": "03013013801",
            "name": "គង់ ឡុច"
        },
        {
            "barcode": "171130896",
            "dpc": "03013004901",
            "name": "សុត គឹមរ៉ា"
        },
        {
            "barcode": "171130897",
            "dpc": "03013003601",
            "name": "តាំង ជាវសែ"
        },
        {
            "barcode": "171130898",
            "dpc": "03013024401",
            "name": "ស្រែ ធី"
        },
        {
            "barcode": "171130899",
            "dpc": "03013000201",
            "name": "ស៊ិន ឡៃ"
        },
        {
            "barcode": "171130900",
            "dpc": "03013000301",
            "name": "ប៊ន សុវណ្ណ"
        },
        {
            "barcode": "171130901",
            "dpc": "03013000401",
            "name": "ពែល អមរា"
        },
        {
            "barcode": "171130902",
            "dpc": "03013000501",
            "name": "នន់ សាវីន"
        },
        {
            "barcode": "171130903",
            "dpc": "03013008901",
            "name": "ឈុំ ឈុន"
        },
        {
            "barcode": "171130904",
            "dpc": "03013005601",
            "name": "ឈាវ តែម"
        },
        {
            "barcode": "171130905",
            "dpc": "03013000701",
            "name": "គ្រឿន ណាំ"
        },
        {
            "barcode": "171130906",
            "dpc": "03013001301",
            "name": "ប្រាក់ រ៉ាឌី"
        },
        {
            "barcode": "171130907",
            "dpc": "03013001801",
            "name": "ម៉ៅ មន្នី"
        },
        {
            "barcode": "171130908",
            "dpc": "03013001901",
            "name": "ហាក់ ប៊ុនថាន"
        },
        {
            "barcode": "171130909",
            "dpc": "03013002001",
            "name": "កែវ សុខា"
        },
        {
            "barcode": "171130910",
            "dpc": "03013002201",
            "name": "ពិន ធារី"
        },
        {
            "barcode": "171130911",
            "dpc": "03013002301",
            "name": "ណុប រ៉ាវុធ"
        },
        {
            "barcode": "171130912",
            "dpc": "03013002401",
            "name": "ស្រេង ស៊ីនួ ១"
        },
        {
            "barcode": "171130913",
            "dpc": "03013003101",
            "name": "ម៉េង សោផា"
        },
        {
            "barcode": "171130914",
            "dpc": "03013003301",
            "name": "ហេង រីណា"
        },
        {
            "barcode": "171130915",
            "dpc": "03013003501",
            "name": "មីត សាឡេះ"
        },
        {
            "barcode": "171130916",
            "dpc": "03013004001",
            "name": "ចាប ថុល"
        },
        {
            "barcode": "171130917",
            "dpc": "03013004101",
            "name": "ហុង លីណា"
        },
        {
            "barcode": "171130918",
            "dpc": "03013004201",
            "name": "ប៉ាល់ គឹមស៊ាន"
        },
        {
            "barcode": "171130919",
            "dpc": "03013004401",
            "name": "ឡុង ធារិន"
        },
        {
            "barcode": "171130920",
            "dpc": "03013005101",
            "name": "សុ វឺត"
        },
        {
            "barcode": "171130921",
            "dpc": "03013005201",
            "name": "ណាង ស្រីនី"
        },
        {
            "barcode": "171130922",
            "dpc": "03013005301",
            "name": "អ៊ី ហ៊ីម"
        },
        {
            "barcode": "171130923",
            "dpc": "03013005401",
            "name": "អេង ង៉ោ"
        },
        {
            "barcode": "171130924",
            "dpc": "03013005501",
            "name": "ង៉ែត លាង"
        },
        {
            "barcode": "171130925",
            "dpc": "03013005801",
            "name": "ឈាវ រី"
        },
        {
            "barcode": "171130926",
            "dpc": "03013005901",
            "name": "ជា ទូច"
        },
        {
            "barcode": "171130927",
            "dpc": "03013006001",
            "name": "យិន លីនដា"
        },
        {
            "barcode": "171130928",
            "dpc": "03013006101",
            "name": "សំ វណ្ណា"
        },
        {
            "barcode": "171130929",
            "dpc": "03013006201",
            "name": "តឹក ជ័យមង្គល"
        },
        {
            "barcode": "171130930",
            "dpc": "03013006301",
            "name": "ម៉ី បុរី"
        },
        {
            "barcode": "171130931",
            "dpc": "03013006401",
            "name": "ចាន់ គឹមអេង"
        },
        {
            "barcode": "171130932",
            "dpc": "03013006501",
            "name": "តាំង ផេងហ៊ី"
        },
        {
            "barcode": "171130933",
            "dpc": "03013006901",
            "name": "ស៊ីម ទៀង"
        },
        {
            "barcode": "171130934",
            "dpc": "03013007101",
            "name": "ប៊ុត ទូច"
        },
        {
            "barcode": "171130935",
            "dpc": "03013007501",
            "name": "ហុង ផេង"
        },
        {
            "barcode": "171130936",
            "dpc": "03013007601",
            "name": "គីវ បុប្ជា"
        },
        {
            "barcode": "171130937",
            "dpc": "03013008101",
            "name": "ស៊ុន សុភាព"
        },
        {
            "barcode": "171130938",
            "dpc": "03013008201",
            "name": "ពូ សុភា"
        },
        {
            "barcode": "171130939",
            "dpc": "03013008401",
            "name": "កុយ ដោក"
        },
        {
            "barcode": "171130940",
            "dpc": "03013008701",
            "name": "ហេង សុខម្នី"
        },
        {
            "barcode": "171130941",
            "dpc": "03013009001",
            "name": "ហុង ហាវ"
        },
        {
            "barcode": "171130942",
            "dpc": "03013009201",
            "name": "ម៉ុត រឹម"
        },
        {
            "barcode": "171130943",
            "dpc": "03013009301",
            "name": "តុល សុផល"
        },
        {
            "barcode": "171130944",
            "dpc": "03013009401",
            "name": "កិច ង៉ោ"
        },
        {
            "barcode": "171130945",
            "dpc": "03013009601",
            "name": "លឹម ផៃ"
        },
        {
            "barcode": "171130946",
            "dpc": "03013009701",
            "name": "ម៉េង សុគិត"
        },
        {
            "barcode": "171130947",
            "dpc": "03013009801",
            "name": "នី លីហេង"
        },
        {
            "barcode": "171130948",
            "dpc": "03013009901",
            "name": "ឈិត ប៊ុនឆន"
        },
        {
            "barcode": "171130949",
            "dpc": "03013010201",
            "name": "សៀន ស៊ីនួន"
        },
        {
            "barcode": "171130950",
            "dpc": "03013010301",
            "name": "អៀន សារឿន"
        },
        {
            "barcode": "171130951",
            "dpc": "03013010401",
            "name": "សឿន សឿង"
        },
        {
            "barcode": "171130952",
            "dpc": "03013010501",
            "name": "ភឹម ឌី"
        },
        {
            "barcode": "171130953",
            "dpc": "03013010601",
            "name": "សុង សឹម"
        },
        {
            "barcode": "171130954",
            "dpc": "03013010701",
            "name": "សែម សាន្ត"
        },
        {
            "barcode": "171130955",
            "dpc": "03013010801",
            "name": "ឯក វណ្ណៈ"
        },
        {
            "barcode": "171130956",
            "dpc": "03013010901",
            "name": "ឯក ចំរើន"
        },
        {
            "barcode": "171130957",
            "dpc": "03013011001",
            "name": "ហួត ចក្រី"
        },
        {
            "barcode": "171130958",
            "dpc": "03013011101",
            "name": "ហេត រើត"
        },
        {
            "barcode": "171130959",
            "dpc": "03013011301",
            "name": "ហាស ប៊ុនហាប់"
        },
        {
            "barcode": "171130960",
            "dpc": "03013011401",
            "name": "អុំ សារិន"
        },
        {
            "barcode": "171130961",
            "dpc": "03013011501",
            "name": "ឡក់ បូរ៉េត"
        },
        {
            "barcode": "171130962",
            "dpc": "03013011601",
            "name": "ពៅ មាន"
        },
        {
            "barcode": "171130963",
            "dpc": "03013011701",
            "name": "ងួន ធូ"
        },
        {
            "barcode": "171130964",
            "dpc": "03013011801",
            "name": "ប៉ែត ហ៊ាងកាំង"
        },
        {
            "barcode": "171130965",
            "dpc": "03013012201",
            "name": "វណ្ណ ចន្លី"
        },
        {
            "barcode": "171130966",
            "dpc": "03013012401",
            "name": "ឡាន ប៊ុនរ៉ូស៊ី"
        },
        {
            "barcode": "171130967",
            "dpc": "03013012501",
            "name": "ពេជ្រ វណ្ណា ៤"
        },
        {
            "barcode": "171130968",
            "dpc": "03013012601",
            "name": "វន សម្បត្តិ"
        },
        {
            "barcode": "171130969",
            "dpc": "03013013301",
            "name": "មៀច មុន្នីរដ្ឋ"
        },
        {
            "barcode": "171130970",
            "dpc": "03013013601",
            "name": "លី ឡាយហុង"
        },
        {
            "barcode": "171130971",
            "dpc": "03013013901",
            "name": "វិទ្យាល័យនេតយ៉ង់"
        },
        {
            "barcode": "171130972",
            "dpc": "03013014001",
            "name": "សាលាធនធាន វិទ្យាល័យនេតយ៉ង់"
        },
        {
            "barcode": "171130973",
            "dpc": "03013014101",
            "name": "សាលាបឋមសិក្សា សម្តេចជាស៊ីម"
        },
        {
            "barcode": "171130974",
            "dpc": "03013014601",
            "name": "កែវ សាម៉ុន"
        },
        {
            "barcode": "171130975",
            "dpc": "03013014701",
            "name": "សែម ផង់"
        },
        {
            "barcode": "171130976",
            "dpc": "03013014801",
            "name": "អ៊ុយ សំអុល"
        },
        {
            "barcode": "171130977",
            "dpc": "03013014901",
            "name": "ស៊ូ សុភាវី"
        },
        {
            "barcode": "171130978",
            "dpc": "03013015001",
            "name": "ហៀង ខន"
        },
        {
            "barcode": "171130979",
            "dpc": "03013015101",
            "name": "មាស ដារ៉ា"
        },
        {
            "barcode": "171130980",
            "dpc": "03013015301",
            "name": "វែង នឿត"
        },
        {
            "barcode": "171130981",
            "dpc": "03013015401",
            "name": "ផាន សារឿន"
        },
        {
            "barcode": "171130982",
            "dpc": "03013015501",
            "name": "សួរ តឿ"
        },
        {
            "barcode": "171130983",
            "dpc": "03013015601",
            "name": "សៀង ឌី"
        },
        {
            "barcode": "171130984",
            "dpc": "03013015701",
            "name": "ឡាច សុខា"
        },
        {
            "barcode": "171130985",
            "dpc": "03013015801",
            "name": "ងួន សុផល"
        },
        {
            "barcode": "171130986",
            "dpc": "03013016001",
            "name": "ឈឹម រដ្ឋា"
        },
        {
            "barcode": "171130987",
            "dpc": "03013016201",
            "name": "អ៊ាង ប៉ូច"
        },
        {
            "barcode": "171130988",
            "dpc": "03013016401",
            "name": "នន់ វណ្ណះ"
        },
        {
            "barcode": "171130989",
            "dpc": "03013016701",
            "name": "ពៅ លាង"
        },
        {
            "barcode": "171130990",
            "dpc": "03013016801",
            "name": "លីន គុយហេង"
        },
        {
            "barcode": "171130991",
            "dpc": "03013017001",
            "name": "ធា ងួនត្រាយ ២"
        },
        {
            "barcode": "171130992",
            "dpc": "03013017101",
            "name": "លី ហៀន"
        },
        {
            "barcode": "171130993",
            "dpc": "03013017201",
            "name": "ទឺ ម៉ារ៉ាឌី"
        },
        {
            "barcode": "171130994",
            "dpc": "03013017301",
            "name": "ដាំ សីហា"
        },
        {
            "barcode": "171130995",
            "dpc": "03013017401",
            "name": "ណៃ រត្ថនី"
        },
        {
            "barcode": "171130996",
            "dpc": "03013017601",
            "name": "អេង សុខនេត"
        },
        {
            "barcode": "171130997",
            "dpc": "03013017901",
            "name": "លាង អេង"
        },
        {
            "barcode": "171130998",
            "dpc": "03013018101",
            "name": "ស៊ឹម សុភា"
        },
        {
            "barcode": "171130999",
            "dpc": "03013018301",
            "name": "ឃុន ប៊ុនុផាត"
        },
        {
            "barcode": "171131000",
            "dpc": "03013018801",
            "name": "ស៊ាន ពៅ"
        },
        {
            "barcode": "171131001",
            "dpc": "03013018901",
            "name": "ទឹម តារាខេមរិត្យ"
        },
        {
            "barcode": "171131002",
            "dpc": "03013019001",
            "name": "ឌុច សំណាង"
        },
        {
            "barcode": "171131003",
            "dpc": "03013019101",
            "name": "ឆាយ ស៊ីថា"
        },
        {
            "barcode": "171131004",
            "dpc": "03013019201",
            "name": "សេរី ពិសិដ្ឋ"
        },
        {
            "barcode": "171131005",
            "dpc": "03013019301",
            "name": "ចេង គ្រឹះស្នា"
        },
        {
            "barcode": "171131006",
            "dpc": "03013019601",
            "name": "ទុយ គី"
        },
        {
            "barcode": "171131007",
            "dpc": "03013019801",
            "name": "អៀវ នី"
        },
        {
            "barcode": "171131008",
            "dpc": "03013019901",
            "name": "ឆេង សោភណ័"
        },
        {
            "barcode": "171131009",
            "dpc": "03013020001",
            "name": "ព្រាប ចិន្តា"
        },
        {
            "barcode": "171131010",
            "dpc": "03013020101",
            "name": "គីវ គឹមផា"
        },
        {
            "barcode": "171131011",
            "dpc": "03013020601",
            "name": "ឈឹន សុគន្ធា"
        },
        {
            "barcode": "171131012",
            "dpc": "03013020701",
            "name": "ទេស ស៊ីន"
        },
        {
            "barcode": "171131013",
            "dpc": "03013020801",
            "name": "ឡេង ងី"
        },
        {
            "barcode": "171131014",
            "dpc": "03013020901",
            "name": "សាយ រស់"
        },
        {
            "barcode": "171131015",
            "dpc": "03013021001",
            "name": "សៀន ឈួក"
        },
        {
            "barcode": "171131016",
            "dpc": "03013021101",
            "name": "កុត ជួ"
        },
        {
            "barcode": "171131017",
            "dpc": "03013021201",
            "name": "យោម ណារិន"
        },
        {
            "barcode": "171131018",
            "dpc": "03013021301",
            "name": "លឹម ភីន"
        },
        {
            "barcode": "171131019",
            "dpc": "03013021401",
            "name": "ទូច សុឃឿត"
        },
        {
            "barcode": "171131020",
            "dpc": "03013021501",
            "name": "ភាច វែង"
        },
        {
            "barcode": "171131021",
            "dpc": "03013021601",
            "name": "បូ ធា"
        },
        {
            "barcode": "171131022",
            "dpc": "03013021701",
            "name": "ញឹម ជេដ្ឋា"
        },
        {
            "barcode": "171131023",
            "dpc": "03013021801",
            "name": "អ៊ាន សារ៉ែន"
        },
        {
            "barcode": "171131024",
            "dpc": "03013021901",
            "name": "ចាប លន់"
        },
        {
            "barcode": "171131025",
            "dpc": "03013022001",
            "name": "មាឃ សាមិត្ត"
        },
        {
            "barcode": "171131026",
            "dpc": "03013022101",
            "name": "យ៉ាន់ យូន"
        },
        {
            "barcode": "171131027",
            "dpc": "03013022201",
            "name": "ប៊ុត ម៉ាឡា"
        },
        {
            "barcode": "171131028",
            "dpc": "03013022301",
            "name": "ស៊ុយ ឈួប"
        },
        {
            "barcode": "171131029",
            "dpc": "03013022401",
            "name": "ឃឹម លំទោន"
        },
        {
            "barcode": "171131030",
            "dpc": "03013022501",
            "name": "ធុច សំណាង"
        },
        {
            "barcode": "171131031",
            "dpc": "03013022701",
            "name": "កាន សុខខួច"
        },
        {
            "barcode": "171131032",
            "dpc": "03013022801",
            "name": "ប៉ិន ហេងផល្លា"
        },
        {
            "barcode": "171131033",
            "dpc": "03013022901",
            "name": "ម៉េត សុបញ្ញា"
        },
        {
            "barcode": "171131034",
            "dpc": "03013023001",
            "name": "ម៉ៅ ហៀក"
        },
        {
            "barcode": "171131035",
            "dpc": "03013023101",
            "name": "សួស ម៉ន"
        },
        {
            "barcode": "171131036",
            "dpc": "03013023201",
            "name": "ពក វណ្ណា"
        },
        {
            "barcode": "171131037",
            "dpc": "03013023301",
            "name": "ជឹម អាត"
        },
        {
            "barcode": "171131038",
            "dpc": "03013023401",
            "name": "យក់ គា"
        },
        {
            "barcode": "171131039",
            "dpc": "03013023501",
            "name": "សោម ពៅ"
        },
        {
            "barcode": "171131040",
            "dpc": "03013023601",
            "name": "ប្រឹម យឿត"
        },
        {
            "barcode": "171131041",
            "dpc": "03013023901",
            "name": "ម៉ៅ សុភាព"
        },
        {
            "barcode": "171131042",
            "dpc": "03013024001",
            "name": "សារឿន សំអាត"
        },
        {
            "barcode": "171131043",
            "dpc": "03013024101",
            "name": "អឿង ខេង"
        },
        {
            "barcode": "171131044",
            "dpc": "03013024201",
            "name": "លី លឿត"
        },
        {
            "barcode": "171131045",
            "dpc": "03013024301",
            "name": "កែប ប៊ុនធឿន"
        },
        {
            "barcode": "171131046",
            "dpc": "03013024801",
            "name": "ជិន ចន្ថា"
        },
        {
            "barcode": "171131047",
            "dpc": "03013025001",
            "name": "ង៉ា ដៀប"
        },
        {
            "barcode": "171131048",
            "dpc": "03013025101",
            "name": "អឿម អេម"
        },
        {
            "barcode": "171131049",
            "dpc": "03013025201",
            "name": "ដឿន អ៊ុច"
        },
        {
            "barcode": "171131050",
            "dpc": "03013025301",
            "name": "កន រ៉ា"
        },
        {
            "barcode": "171131051",
            "dpc": "03013025401",
            "name": "ឆាន ថេត"
        },
        {
            "barcode": "171131052",
            "dpc": "03013025501",
            "name": "ហុង ហ៊ួម"
        },
        {
            "barcode": "171131053",
            "dpc": "03013025701",
            "name": "ពៅ ចន្ទ័សីលា"
        },
        {
            "barcode": "171131054",
            "dpc": "03013025801",
            "name": "ឡុង អ៊ីដារ៉ូ"
        },
        {
            "barcode": "171131055",
            "dpc": "03013026001",
            "name": "ណុប ណារ៉ា"
        },
        {
            "barcode": "171131056",
            "dpc": "03013026101",
            "name": "សុខ ណាំ"
        },
        {
            "barcode": "171131057",
            "dpc": "03013026301",
            "name": "ប៊ុត សាវង្ស"
        },
        {
            "barcode": "171131058",
            "dpc": "03013026401",
            "name": "ស៊ាង ចាន់ធាម"
        },
        {
            "barcode": "171131059",
            "dpc": "03013026501",
            "name": "អូច ញឹម"
        },
        {
            "barcode": "171131060",
            "dpc": "03013026601",
            "name": "មុំ ស៊ុមនា"
        },
        {
            "barcode": "171131061",
            "dpc": "03013026701",
            "name": "មាន់ ពីវន"
        },
        {
            "barcode": "171131062",
            "dpc": "03013026801",
            "name": "ហែម ថាលីកា"
        },
        {
            "barcode": "171131063",
            "dpc": "03013026901",
            "name": "អួន ហ៊ុល"
        },
        {
            "barcode": "171131064",
            "dpc": "03013027001",
            "name": "សៀង វ៉ាន់"
        },
        {
            "barcode": "171131065",
            "dpc": "03013027101",
            "name": "តាំង សៀកគង់"
        },
        {
            "barcode": "171131066",
            "dpc": "03013027201",
            "name": "ឌុច រ៉ាមី"
        },
        {
            "barcode": "171131067",
            "dpc": "03013027301",
            "name": "យស ឈុនលី"
        },
        {
            "barcode": "171131068",
            "dpc": "03013027401",
            "name": "ជឿន សុភា"
        },
        {
            "barcode": "171131069",
            "dpc": "03013027501",
            "name": "ហុង សុវណ្ណ"
        },
        {
            "barcode": "171131070",
            "dpc": "03013027701",
            "name": "សៅ សាលឿន"
        },
        {
            "barcode": "171131071",
            "dpc": "03013027801",
            "name": "អ៊ូច ស៊ីវត្ថា"
        },
        {
            "barcode": "171131072",
            "dpc": "03013027901",
            "name": "ម៉ម ណាត"
        },
        {
            "barcode": "171131073",
            "dpc": "03013028001",
            "name": "តាំង ប៉េងអាន"
        },
        {
            "barcode": "171131074",
            "dpc": "03013028101",
            "name": "ឃួន ឈឿត ៤"
        },
        {
            "barcode": "171131075",
            "dpc": "03013028201",
            "name": "ហុក វីរៈ"
        },
        {
            "barcode": "171131076",
            "dpc": "03013028301",
            "name": "វ៉ាន់ សុភ័ណ"
        },
        {
            "barcode": "171131077",
            "dpc": "03013028401",
            "name": "មាស ឆេង"
        },
        {
            "barcode": "171131078",
            "dpc": "03013029101",
            "name": "ហ៊ី បូរិទ្ធ"
        },
        {
            "barcode": "171131079",
            "dpc": "03013029201",
            "name": "អ៊ឹង ជីណាំ"
        },
        {
            "barcode": "171131080",
            "dpc": "03013029301",
            "name": "ឆាត់ ចាន់ឌី"
        },
        {
            "barcode": "171131081",
            "dpc": "03013029401",
            "name": "ឆាន ចន្ថា"
        },
        {
            "barcode": "171131082",
            "dpc": "03013029501",
            "name": "ខ្លូត ចរិយា"
        },
        {
            "barcode": "171131083",
            "dpc": "03013029601",
            "name": "ឈន ទីន"
        },
        {
            "barcode": "171131084",
            "dpc": "03013029801",
            "name": "កែវ រ៉ា"
        },
        {
            "barcode": "171131085",
            "dpc": "03013029901",
            "name": "ធឿន សាវេត"
        },
        {
            "barcode": "171131086",
            "dpc": "03013030001",
            "name": "ណាត វណ្ណដូ"
        },
        {
            "barcode": "171131087",
            "dpc": "03013030101",
            "name": "អឿង លាង"
        },
        {
            "barcode": "171131088",
            "dpc": "03013030201",
            "name": "កែវ ណាវី"
        },
        {
            "barcode": "171131089",
            "dpc": "03013030301",
            "name": "រ៉ុម រី"
        },
        {
            "barcode": "171131090",
            "dpc": "03013030501",
            "name": "ប៉ាល់ សុវណ្ណារិទ្ធ"
        },
        {
            "barcode": "171131091",
            "dpc": "03013030601",
            "name": "ស៊ុំ សុវត្ថាយ"
        },
        {
            "barcode": "171131092",
            "dpc": "03013030701",
            "name": "កីម ញ៉"
        },
        {
            "barcode": "171131093",
            "dpc": "03013030801",
            "name": "ពេជ្រ សុខា"
        },
        {
            "barcode": "171131094",
            "dpc": "03013030901",
            "name": "ជិន សឹងហុន"
        },
        {
            "barcode": "171131095",
            "dpc": "03013031001",
            "name": "ឡែន ចិត្ត្រា"
        },
        {
            "barcode": "171131096",
            "dpc": "03013031101",
            "name": "ម៉ៅ មុនី"
        },
        {
            "barcode": "171131097",
            "dpc": "03013031201",
            "name": "ប៉ែន សាវឿន"
        },
        {
            "barcode": "171131098",
            "dpc": "03013031301",
            "name": "ឈិន សុភៈ"
        },
        {
            "barcode": "171131099",
            "dpc": "03013031501",
            "name": "យូ ម៉ុងហូត"
        },
        {
            "barcode": "171131100",
            "dpc": "03013031601",
            "name": "កែវ សាវ័ន្ត"
        },
        {
            "barcode": "171131101",
            "dpc": "03013031701",
            "name": "អ៊ូ សារឿន"
        },
        {
            "barcode": "171131102",
            "dpc": "03013031801",
            "name": "សឹង ម៉ារិទ្ធ ២"
        },
        {
            "barcode": "171131103",
            "dpc": "03013031901",
            "name": "ណៃ ប៉ុនរិទ្ធ"
        },
        {
            "barcode": "171131104",
            "dpc": "03013032001",
            "name": "ព្រំ ស្រីមុំ"
        },
        {
            "barcode": "171131105",
            "dpc": "03013032101",
            "name": "ទន ចាន់ទី"
        },
        {
            "barcode": "171131106",
            "dpc": "03013032201",
            "name": "យ៉ូន រដ្ឋា"
        },
        {
            "barcode": "171131107",
            "dpc": "03013032401",
            "name": "សាយ ប៊ុនលី"
        },
        {
            "barcode": "171131108",
            "dpc": "03013032501",
            "name": "ហ៊ីង ស៊ាត"
        },
        {
            "barcode": "171131109",
            "dpc": "03013032601",
            "name": "ឡាច ចន្ថា"
        },
        {
            "barcode": "171131110",
            "dpc": "03013032701",
            "name": "ឌិម ចន្ថា"
        },
        {
            "barcode": "171131111",
            "dpc": "03013032801",
            "name": "ជូប ត្រា"
        },
        {
            "barcode": "171131112",
            "dpc": "03013032901",
            "name": "គឹម សារ៉ន"
        },
        {
            "barcode": "171131113",
            "dpc": "03013033001",
            "name": "ម៉ា មន្ថា"
        },
        {
            "barcode": "171131114",
            "dpc": "03013033101",
            "name": "សួន ជា"
        },
        {
            "barcode": "171131115",
            "dpc": "03013033301",
            "name": "មាន ឡាយ"
        },
        {
            "barcode": "171131116",
            "dpc": "03013033401",
            "name": "មាស វោន"
        },
        {
            "barcode": "171131117",
            "dpc": "03013033501",
            "name": "ទី គឹមហង្ស"
        },
        {
            "barcode": "171131118",
            "dpc": "03013033601",
            "name": "ទិញ ហៀង"
        },
        {
            "barcode": "171131119",
            "dpc": "03013033701",
            "name": "សយ សេរី"
        },
        {
            "barcode": "171131120",
            "dpc": "03013033801",
            "name": "ជឿម រដ្ឋា"
        },
        {
            "barcode": "171131121",
            "dpc": "03013033901",
            "name": "ល័ក្ខ ផល្លីន"
        },
        {
            "barcode": "171131122",
            "dpc": "03013034001",
            "name": "ព្រំ ដារ៉ា"
        },
        {
            "barcode": "171131123",
            "dpc": "03013034101",
            "name": "រ៉ុង យ៉ាង"
        },
        {
            "barcode": "171131124",
            "dpc": "03013034201",
            "name": "មាន ដូន"
        },
        {
            "barcode": "171131125",
            "dpc": "03013034301",
            "name": "រ៉ែម គឹមហ៊ត"
        },
        {
            "barcode": "171131126",
            "dpc": "03013034401",
            "name": "ឡាំ ញឹក"
        },
        {
            "barcode": "171131127",
            "dpc": "03013034501",
            "name": "ជា សៅឌី"
        },
        {
            "barcode": "171131128",
            "dpc": "03013034701",
            "name": "ពៅ វិត"
        },
        {
            "barcode": "171131129",
            "dpc": "03013034901",
            "name": "សុខ សុវណ្ណ"
        },
        {
            "barcode": "171131130",
            "dpc": "03013035001",
            "name": "លី សុផាត"
        },
        {
            "barcode": "171131131",
            "dpc": "03013035101",
            "name": "ទឹម ភិរុណ"
        },
        {
            "barcode": "171131132",
            "dpc": "03013035201",
            "name": "ព្រំ សាឃឿន"
        },
        {
            "barcode": "171131133",
            "dpc": "03013035301",
            "name": "ម៉ក់ សឿន"
        },
        {
            "barcode": "171131134",
            "dpc": "03013035401",
            "name": "ជា សាមាន"
        },
        {
            "barcode": "171131135",
            "dpc": "03013035501",
            "name": "សេង នឿត"
        },
        {
            "barcode": "171131136",
            "dpc": "03013035601",
            "name": "ស៊ីន ឃីម"
        },
        {
            "barcode": "171131137",
            "dpc": "03013035701",
            "name": "ជួន សុខខួច"
        },
        {
            "barcode": "171131138",
            "dpc": "03013035801",
            "name": "អ៊ូច វណ្ណៈ"
        },
        {
            "barcode": "171131139",
            "dpc": "03013035901",
            "name": "សៅ សារិន"
        },
        {
            "barcode": "171131140",
            "dpc": "03013036001",
            "name": "ស សារិន"
        },
        {
            "barcode": "171131141",
            "dpc": "03013036101",
            "name": "យ៉ាត យៀង"
        },
        {
            "barcode": "171131142",
            "dpc": "03013036201",
            "name": "សៀង ហេង"
        },
        {
            "barcode": "171131143",
            "dpc": "03013036301",
            "name": "ចាន់ ផូ"
        },
        {
            "barcode": "171131144",
            "dpc": "03013036401",
            "name": "ហ៊ី គា"
        },
        {
            "barcode": "171131145",
            "dpc": "03013036501",
            "name": "គា ពេជ្រមេត្រី"
        },
        {
            "barcode": "171131146",
            "dpc": "03013036601",
            "name": "ចៅ ភឿត"
        },
        {
            "barcode": "171131147",
            "dpc": "03013036701",
            "name": "អ៊ឹង ម៉េងសេង"
        },
        {
            "barcode": "171131148",
            "dpc": "03013036801",
            "name": "ជា បូរី"
        },
        {
            "barcode": "171131149",
            "dpc": "03013036901",
            "name": "សុខ សុខុន"
        },
        {
            "barcode": "171131150",
            "dpc": "03013037001",
            "name": "នង បំណង"
        },
        {
            "barcode": "171131151",
            "dpc": "03013037101",
            "name": "ស៊ុំ មុំ"
        },
        {
            "barcode": "171131152",
            "dpc": "03013037201",
            "name": "យូ ចាន់ធារី"
        },
        {
            "barcode": "171131153",
            "dpc": "03013037301",
            "name": "ទិត្យ សោភ័ណ្ឌ"
        },
        {
            "barcode": "171131154",
            "dpc": "03013037401",
            "name": "ហួត ផានិត"
        },
        {
            "barcode": "171131155",
            "dpc": "03013037501",
            "name": "ម៉េង ប្រាកដ"
        },
        {
            "barcode": "171131156",
            "dpc": "03013037601",
            "name": "ឡម គឹមយូ"
        },
        {
            "barcode": "171131157",
            "dpc": "03013037701",
            "name": "ប៊ុន ឡេកូ"
        },
        {
            "barcode": "171131158",
            "dpc": "03013037901",
            "name": "សៅ ម៉េងសែ"
        },
        {
            "barcode": "171131159",
            "dpc": "03013038001",
            "name": "សៅ ម៉េងសែ២"
        },
        {
            "barcode": "171131160",
            "dpc": "03013038101",
            "name": "ដួង ណាគ្រី"
        },
        {
            "barcode": "171131161",
            "dpc": "03013038201",
            "name": "វ៉ាន់ គឹមហុង"
        },
        {
            "barcode": "171131162",
            "dpc": "03013038401",
            "name": "ជោត សំណាង"
        },
        {
            "barcode": "171131163",
            "dpc": "03013038501",
            "name": "ជោត ដារ៉ា"
        },
        {
            "barcode": "171131164",
            "dpc": "03013038601",
            "name": "សាំង សារ៉េត"
        },
        {
            "barcode": "171131165",
            "dpc": "03013038701",
            "name": "ឃឹម ពិសី"
        },
        {
            "barcode": "171131166",
            "dpc": "03013038801",
            "name": "ឈិន វុទ្ឋី"
        },
        {
            "barcode": "171131167",
            "dpc": "03013038901",
            "name": "អ៊ុំ សារ៉េត"
        },
        {
            "barcode": "171131168",
            "dpc": "03013039001",
            "name": "សឺន ប៊ុនផាត"
        },
        {
            "barcode": "171131169",
            "dpc": "03013039101",
            "name": "ឈិត បុទុម"
        },
        {
            "barcode": "171131170",
            "dpc": "03013039201",
            "name": "ម៉ៅ រុន"
        },
        {
            "barcode": "171131171",
            "dpc": "03013039301",
            "name": "លើម ពោដេត"
        },
        {
            "barcode": "171131172",
            "dpc": "03013039401",
            "name": "គង់ ប៊ន"
        },
        {
            "barcode": "171131173",
            "dpc": "03013039501",
            "name": "ចាន់ វ៉ាន់ថេន"
        },
        {
            "barcode": "171131174",
            "dpc": "03013031401",
            "name": "សេង ជ័យវុទ្ធី"
        },
        {
            "barcode": "171131175",
            "dpc": "03013007901",
            "name": "ប៊ុន គឹមតេង"
        },
        {
            "barcode": "171131176",
            "dpc": "03013016301",
            "name": "អ៊ុន លាភ"
        },
        {
            "barcode": "171131177",
            "dpc": "03013032301",
            "name": "ចៅ ធឿន"
        },
        {
            "barcode": "171131178",
            "dpc": "03013023801",
            "name": "តោ ចាន់សីលា"
        },
        {
            "barcode": "171131179",
            "dpc": "03013003701",
            "name": "គន្ធ គឹមលាភ"
        },
        {
            "barcode": "171131180",
            "dpc": "03013008001",
            "name": "រៀម សារ៉េត"
        },
        {
            "barcode": "171131181",
            "dpc": "03013024901",
            "name": "អ៊ី ធី"
        },
        {
            "barcode": "171131182",
            "dpc": "03013002601",
            "name": "ណុប សម្បត្តិ"
        },
        {
            "barcode": "171131183",
            "dpc": "03013002501",
            "name": "ស្រេង ស៊ីនួន ២"
        },
        {
            "barcode": "171131184",
            "dpc": "03013000101",
            "name": "អ៊ន ប៊ុនធឿន"
        },
        {
            "barcode": "171131185",
            "dpc": "03013005001",
            "name": "សុខ វណ្ណី"
        },
        {
            "barcode": "171131186",
            "dpc": "03013015901",
            "name": "សោម ធី"
        },
        {
            "barcode": "171131187",
            "dpc": "03013013501",
            "name": "ជិម មុនី"
        },
        {
            "barcode": "171131188",
            "dpc": "03013010001",
            "name": "គុម សុខុម"
        },
        {
            "barcode": "171131189",
            "dpc": "03013007701",
            "name": "ញ៉ែម ប៉ក់"
        },
        {
            "barcode": "171131190",
            "dpc": "03013004701",
            "name": "សេង វិស័ក្ត"
        },
        {
            "barcode": "171131191",
            "dpc": "03013009501",
            "name": "គុណ ឆាយ"
        },
        {
            "barcode": "171131192",
            "dpc": "03013014401",
            "name": "បាន រដ្ឋ"
        },
        {
            "barcode": "171131193",
            "dpc": "03013014501",
            "name": "ព្រហ្ម សំណាង"
        },
        {
            "barcode": "171131194",
            "dpc": "03013014301",
            "name": "ឃុន សាមិត្ត"
        },
        {
            "barcode": "171131195",
            "dpc": "03013008501",
            "name": "ទេព ធិញ"
        },
        {
            "barcode": "171131196",
            "dpc": "03013008601",
            "name": "ងួន កិត្យា"
        },
        {
            "barcode": "171131197",
            "dpc": "03013022601",
            "name": "ភួង អេង"
        },
        {
            "barcode": "171131198",
            "dpc": "03013002901",
            "name": "លី ហ៊ាង"
        },
        {
            "barcode": "171131199",
            "dpc": "03013003001",
            "name": "ជាង សាវ៉េន"
        },
        {
            "barcode": "171131200",
            "dpc": "03013008301",
            "name": "ឈឹម សុភា"
        },
        {
            "barcode": "171131201",
            "dpc": "03013002801",
            "name": "ចៅ ញ៉ា"
        },
        {
            "barcode": "171131202",
            "dpc": "03013018501",
            "name": "ហ៊ាញ ហ៊ួរ"
        },
        {
            "barcode": "171131203",
            "dpc": "03013018601",
            "name": "យ៉ាន សុភា"
        },
        {
            "barcode": "171131204",
            "dpc": "03013003201",
            "name": "អ៊ិត អាន"
        },
        {
            "barcode": "171131205",
            "dpc": "03013002701",
            "name": "អ៊ាន សារឿត"
        },
        {
            "barcode": "171131206",
            "dpc": "03013039601",
            "name": "ដែង សាធិត"
        },
        {
            "barcode": "171131207",
            "dpc": "03013039701",
            "name": "គង់ ចន្ថា"
        },
        {
            "barcode": "171131208",
            "dpc": "03013039901",
            "name": "សឹង សុវណ្ណ"
        },
        {
            "barcode": "171131209",
            "dpc": "03013040001",
            "name": "ញៀវ សាអង"
        },
        {
            "barcode": "171131210",
            "dpc": "03013040101",
            "name": "រឿម សុផល"
        },
        {
            "barcode": "171131211",
            "dpc": "03013040201",
            "name": "ផល សុភាព"
        },
        {
            "barcode": "171131212",
            "dpc": "03013040301",
            "name": "ទេព ឈឿន"
        },
        {
            "barcode": "171131213",
            "dpc": "03013040401",
            "name": "ខេ ភី"
        },
        {
            "barcode": "171131214",
            "dpc": "03013040501",
            "name": "ចាន់ ដារ៉ា"
        },
        {
            "barcode": "171131215",
            "dpc": "03013040601",
            "name": "លី ឈុំ"
        },
        {
            "barcode": "171131216",
            "dpc": "03013040701",
            "name": "ជា ហឿន"
        },
        {
            "barcode": "171131217",
            "dpc": "03013040801",
            "name": "ឈិន ហ៊ន"
        },
        {
            "barcode": "171131218",
            "dpc": "03013040901",
            "name": "ដួង ជីវ៊ន្ត"
        },
        {
            "barcode": "171131219",
            "dpc": "03013041001",
            "name": "ប៉ន ឈៀង"
        },
        {
            "barcode": "171131220",
            "dpc": "03013041101",
            "name": "យួម សានី"
        },
        {
            "barcode": "171131221",
            "dpc": "03013041201",
            "name": "អង្គការខ្មែរជំនាន់ថ្មី"
        },
        {
            "barcode": "171131222",
            "dpc": "03013041301",
            "name": "ឈឿម ណារិទ្ឋ"
        },
        {
            "barcode": "171131223",
            "dpc": "03013041401",
            "name": "ទស់ ធឿត"
        },
        {
            "barcode": "171131224",
            "dpc": "03013041501",
            "name": "អែម សុឃឿន"
        },
        {
            "barcode": "171131225",
            "dpc": "03013041601",
            "name": "ហឿន បុផ្ផា"
        },
        {
            "barcode": "171131226",
            "dpc": "03013041701",
            "name": "ហេង ប៊ុនធឿន"
        },
        {
            "barcode": "171131227",
            "dpc": "03013041801",
            "name": "ទាម ម៉េងហុក"
        },
        {
            "barcode": "171131228",
            "dpc": "03013041901",
            "name": "លន់ វិទូ"
        },
        {
            "barcode": "171131229",
            "dpc": "03013042001",
            "name": "ឆេង ឃេង"
        },
        {
            "barcode": "171131230",
            "dpc": "03013042101",
            "name": "ឃេ សុធឿន"
        },
        {
            "barcode": "171131231",
            "dpc": "03013042201",
            "name": "ឡេង ទូច"
        },
        {
            "barcode": "171131232",
            "dpc": "03013042301",
            "name": "ខៀវ វ៉ាន់ស៊ី"
        },
        {
            "barcode": "171131233",
            "dpc": "03013042401",
            "name": "ឈួន សុវណ្ណារី"
        },
        {
            "barcode": "171131234",
            "dpc": "03013042501",
            "name": "ម៉ិល សាវ៉ុន"
        },
        {
            "barcode": "171131235",
            "dpc": "03013042601",
            "name": "ហូន លន់សីហា"
        },
        {
            "barcode": "171131236",
            "dpc": "03013042701",
            "name": "ថន ស្រីរ៊ត្ន"
        },
        {
            "barcode": "171131237",
            "dpc": "03013042801",
            "name": "អ៊ូច សំអាង"
        },
        {
            "barcode": "171131238",
            "dpc": "03013042901",
            "name": "ស្វាយ រតនា"
        },
        {
            "barcode": "171131239",
            "dpc": "03013043001",
            "name": "ផាត់ ម៉ា"
        },
        {
            "barcode": "171131240",
            "dpc": "03013043101",
            "name": "ឡុង សុខា"
        },
        {
            "barcode": "171131241",
            "dpc": "03013043201",
            "name": "ឡាំង ជន"
        },
        {
            "barcode": "171131242",
            "dpc": "03013043301",
            "name": "គឹម ឡាង"
        },
        {
            "barcode": "171131243",
            "dpc": "03013043401",
            "name": "មឿន ឈុន"
        },
        {
            "barcode": "171131244",
            "dpc": "03013043501",
            "name": "រួម ចេង"
        },
        {
            "barcode": "171131245",
            "dpc": "03013043601",
            "name": "យឿន ពៅ"
        },
        {
            "barcode": "171131246",
            "dpc": "03013043701",
            "name": "ឈៀង សាវុធ"
        },
        {
            "barcode": "171131247",
            "dpc": "03013043801",
            "name": "ម៉ី លី"
        },
        {
            "barcode": "171131248",
            "dpc": "03013043901",
            "name": "ញឹក ឈុនហាង"
        },
        {
            "barcode": "171131249",
            "dpc": "03013044001",
            "name": "ហ៊ាង អូន"
        },
        {
            "barcode": "171131250",
            "dpc": "03013044101",
            "name": "មឿន សុគន្ឋា"
        },
        {
            "barcode": "171131251",
            "dpc": "03013044201",
            "name": "ឈិត សាលឿន"
        },
        {
            "barcode": "171131252",
            "dpc": "03013044301",
            "name": "ឈិត ពៅ"
        },
        {
            "barcode": "171131253",
            "dpc": "03013044401",
            "name": "មឿន ថេត"
        },
        {
            "barcode": "171131254",
            "dpc": "03013044501",
            "name": "ឃុំ សុភី"
        },
        {
            "barcode": "171131255",
            "dpc": "03013044601",
            "name": "ឃុំ សោភ៊ណ្ឌ"
        },
        {
            "barcode": "171131256",
            "dpc": "03013044701",
            "name": "ឡុង គឹមសាន្ត"
        },
        {
            "barcode": "171131257",
            "dpc": "03013044801",
            "name": "ឃុំ អ៊ុល"
        },
        {
            "barcode": "171131258",
            "dpc": "03013044901",
            "name": "វាត សារី"
        },
        {
            "barcode": "171131259",
            "dpc": "03013045101",
            "name": "ធូក ធិរិទ្ឋ"
        },
        {
            "barcode": "171131260",
            "dpc": "03013045301",
            "name": "ជួន ស្រីមុំ"
        },
        {
            "barcode": "171131261",
            "dpc": "03013045401",
            "name": "ឡាច ភីរម្យ"
        },
        {
            "barcode": "171131262",
            "dpc": "03013045501",
            "name": "ឡាច មុន្នី"
        },
        {
            "barcode": "171131263",
            "dpc": "03013045601",
            "name": "ខ្វៃ សំបូរ"
        },
        {
            "barcode": "171131264",
            "dpc": "03013045701",
            "name": "ទូច ចាន់រ៉េត"
        },
        {
            "barcode": "171131265",
            "dpc": "03013045801",
            "name": "ទេព មិន"
        },
        {
            "barcode": "171131266",
            "dpc": "03013046001",
            "name": "គឹម ជាវី"
        },
        {
            "barcode": "171131267",
            "dpc": "03013046101",
            "name": "សរ យឿង"
        },
        {
            "barcode": "171131268",
            "dpc": "03013046301",
            "name": "សុខ សេរី"
        },
        {
            "barcode": "171131269",
            "dpc": "03013046401",
            "name": "ពិន ធានា"
        },
        {
            "barcode": "171131270",
            "dpc": "03013046501",
            "name": "សុទ្ឋ សុធា"
        },
        {
            "barcode": "171131271",
            "dpc": "03013046601",
            "name": "ស៊ុម ចន្ថា"
        },
        {
            "barcode": "171131272",
            "dpc": "03013046701",
            "name": "ម៉ី សាអ៊ឹម"
        },
        {
            "barcode": "171131273",
            "dpc": "03013046801",
            "name": "ស្រេង គីនា"
        },
        {
            "barcode": "171131274",
            "dpc": "03013046901",
            "name": "សុវណ្ណ ដារ៉ា"
        },
        {
            "barcode": "171131275",
            "dpc": "03013047001",
            "name": "ស្រី ឃីវសុខុម"
        },
        {
            "barcode": "171131276",
            "dpc": "03013047101",
            "name": "រស់ ចាន់រ៉ា"
        },
        {
            "barcode": "171131277",
            "dpc": "03013047201",
            "name": "អ៊ាប ម៉ារ៉ាឌី"
        },
        {
            "barcode": "171131278",
            "dpc": "03013047301",
            "name": "យឿង យិន"
        },
        {
            "barcode": "171131279",
            "dpc": "03013047401",
            "name": "លឿត ម៉ៅ"
        },
        {
            "barcode": "171131280",
            "dpc": "03013047501",
            "name": "ព្រិល ឆោម"
        },
        {
            "barcode": "171131281",
            "dpc": "03013047701",
            "name": "ង៉ែត ឈឿត"
        },
        {
            "barcode": "171131282",
            "dpc": "03013047801",
            "name": "និត សុភាព"
        },
        {
            "barcode": "171131283",
            "dpc": "03013047901",
            "name": "ឆន ស៊ីថា"
        },
        {
            "barcode": "171131284",
            "dpc": "03013048001",
            "name": "គឹម សាន្ត"
        }
    ];


barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
