let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171132127",
            "dpc": "03023211201",
            "name": "នួន សម្បត្តិ"
        },
        {
            "barcode": "171132128",
            "dpc": "03023206301",
            "name": "សេត សាឡែសវណ្ណា"
        },
        {
            "barcode": "171132129",
            "dpc": "03023214301",
            "name": "សើ វុទ្ធី"
        },
        {
            "barcode": "171132130",
            "dpc": "03023211301",
            "name": "ស៊ុន សុជាតិ"
        },
        {
            "barcode": "171132131",
            "dpc": "03023214401",
            "name": "ស៊ឹម សុវណ្ណ"
        },
        {
            "barcode": "171132132",
            "dpc": "03023219001",
            "name": "សូរ គន្ធា"
        },
        {
            "barcode": "171132133",
            "dpc": "03023203101",
            "name": "ឡឹក រិវឌ្ឍន៍"
        },
        {
            "barcode": "171132134",
            "dpc": "03023210901",
            "name": "ទេព តាល់"
        },
        {
            "barcode": "171132135",
            "dpc": "03023213701",
            "name": "ភីវ ផល្លី"
        },
        {
            "barcode": "171132136",
            "dpc": "03023205301",
            "name": "សុខ ចាន់ថន"
        },
        {
            "barcode": "171132137",
            "dpc": "03023205201",
            "name": "ហ៊ាន ស៊ុំ"
        },
        {
            "barcode": "171132138",
            "dpc": "03023204301",
            "name": "ហម  សំអាត"
        },
        {
            "barcode": "171132139",
            "dpc": "03023204101",
            "name": "ម៉ៅ ឡុង"
        },
        {
            "barcode": "171132140",
            "dpc": "03023204001",
            "name": "យ៉ាន់ សារឿន"
        },
        {
            "barcode": "171132141",
            "dpc": "03023204201",
            "name": "ពុធ ចំរើន"
        },
        {
            "barcode": "171132142",
            "dpc": "03023213201",
            "name": "ព្រំ ព្រឿត"
        },
        {
            "barcode": "171132143",
            "dpc": "03023213101",
            "name": "ឈឿន សាវ៉ន"
        },
        {
            "barcode": "171132144",
            "dpc": "03023213001",
            "name": "ញ៉ែម សុវណ្ណ"
        },
        {
            "barcode": "171132145",
            "dpc": "03023217301",
            "name": "រស់ វុទ្ធី"
        },
        {
            "barcode": "171132146",
            "dpc": "03023217401",
            "name": "ខុន នារី"
        },
        {
            "barcode": "171132147",
            "dpc": "03023217501",
            "name": "ឆៃ ដារ៉ា"
        },
        {
            "barcode": "171132148",
            "dpc": "03023219501",
            "name": "សេង ហ៊ួត"
        },
        {
            "barcode": "171132149",
            "dpc": "03023207701",
            "name": "សាំង ប៊ុនលី"
        },
        {
            "barcode": "171132150",
            "dpc": "03023207601",
            "name": "ឡាយ នី"
        },
        {
            "barcode": "171132151",
            "dpc": "03023220701",
            "name": "យ៉ាន់ ឌឿន"
        },
        {
            "barcode": "171132152",
            "dpc": "03023219301",
            "name": "ផេង សិទ្ធ"
        },
        {
            "barcode": "171132153",
            "dpc": "03023210601",
            "name": "ម៉ា ប៉ូ"
        },
        {
            "barcode": "171132154",
            "dpc": "03023205701",
            "name": "ស៊ិន សុផល"
        },
        {
            "barcode": "171132155",
            "dpc": "03023205601",
            "name": "ចែ វណ្ណី"
        },
        {
            "barcode": "171132156",
            "dpc": "03023205401",
            "name": "ស៊ិន សុគី"
        },
        {
            "barcode": "171132157",
            "dpc": "03023214701",
            "name": "ភួយ សុណារ័ត្ន"
        },
        {
            "barcode": "171132158",
            "dpc": "03023205501",
            "name": "យឹម សាមឿន"
        },
        {
            "barcode": "171132159",
            "dpc": "03023205801",
            "name": "សួន គួន"
        },
        {
            "barcode": "171132160",
            "dpc": "03023205901",
            "name": "ពេជ្រ វ៉ាង"
        },
        {
            "barcode": "171132161",
            "dpc": "03023202801",
            "name": "ឡាយ បូរ៉ាវី"
        },
        {
            "barcode": "171132162",
            "dpc": "03023217701",
            "name": "យឹម ឌឿន"
        },
        {
            "barcode": "171132163",
            "dpc": "03023218201",
            "name": "ហ៊ន សុខា"
        },
        {
            "barcode": "171132164",
            "dpc": "03023218401",
            "name": "សំ សៀន"
        },
        {
            "barcode": "171132165",
            "dpc": "03023218601",
            "name": "ឡុង ដារ៉ា"
        },
        {
            "barcode": "171132166",
            "dpc": "03023218701",
            "name": "ជួន សុផល"
        },
        {
            "barcode": "171132167",
            "dpc": "03023218801",
            "name": "ឈៀន ឈឹម"
        },
        {
            "barcode": "171132168",
            "dpc": "03023203001",
            "name": "សៅ ស៊ុនណារ៉ា"
        },
        {
            "barcode": "171132169",
            "dpc": "03023219101",
            "name": "តឹក ស៊ីណា"
        },
        {
            "barcode": "171132170",
            "dpc": "03023202901",
            "name": "អ៊ុយ វណ្ណៈ"
        },
        {
            "barcode": "171132171",
            "dpc": "03023210501",
            "name": "ឈ លីហ៊ាង"
        },
        {
            "barcode": "171132172",
            "dpc": "03023214001",
            "name": "សឿន សីម៉ា"
        },
        {
            "barcode": "171132173",
            "dpc": "03023214201",
            "name": "ហ៊ួត ស៊ិន"
        },
        {
            "barcode": "171132174",
            "dpc": "03023213601",
            "name": "ហ៊ួ យ៉ាង"
        },
        {
            "barcode": "171132175",
            "dpc": "03023219601",
            "name": "ជួង  សុខុម"
        },
        {
            "barcode": "171132176",
            "dpc": "03023218501",
            "name": "នី វុទ្ធី"
        },
        {
            "barcode": "171132177",
            "dpc": "03023218001",
            "name": "នូ វី"
        },
        {
            "barcode": "171132178",
            "dpc": "03023220601",
            "name": "នាម សម្បត្តិ"
        },
        {
            "barcode": "171132179",
            "dpc": "03023220501",
            "name": "អូន គន្ធា"
        },
        {
            "barcode": "171132180",
            "dpc": "03023220401",
            "name": "កែវ សុខុម"
        },
        {
            "barcode": "171132181",
            "dpc": "03023220301",
            "name": "ពេជ្រ ស្រីអូន"
        },
        {
            "barcode": "171132182",
            "dpc": "03023220201",
            "name": "ជា គី"
        },
        {
            "barcode": "171132183",
            "dpc": "03023220101",
            "name": "សាំង សៀប"
        },
        {
            "barcode": "171132184",
            "dpc": "03023220001",
            "name": "ស៊ឹម សុខចំរើន"
        },
        {
            "barcode": "171132185",
            "dpc": "03023219901",
            "name": "កែវ ស្រីទូច"
        },
        {
            "barcode": "171132186",
            "dpc": "03023219801",
            "name": "មូល ផល្លា"
        },
        {
            "barcode": "171132187",
            "dpc": "03023206101",
            "name": "ប៉េង សុខេង"
        },
        {
            "barcode": "171132188",
            "dpc": "03023200401",
            "name": "អេង សុធីរិទ្ធ"
        },
        {
            "barcode": "171132189",
            "dpc": "03023206001",
            "name": "ឆេង ឆាន់"
        },
        {
            "barcode": "171132190",
            "dpc": "03023218901",
            "name": "ហុង គឹមឡុង"
        },
        {
            "barcode": "171132191",
            "dpc": "03023201901",
            "name": "អ៊ី សាមិត្ត"
        },
        {
            "barcode": "171132192",
            "dpc": "03023202001",
            "name": "ផល សុភឿត"
        },
        {
            "barcode": "171132193",
            "dpc": "03023210201",
            "name": "ទូច វែង"
        },
        {
            "barcode": "171132194",
            "dpc": "03023210101",
            "name": "អ៊ី សាវ៉ើន"
        },
        {
            "barcode": "171132195",
            "dpc": "03023210001",
            "name": "គឹម  ទ្រី"
        },
        {
            "barcode": "171132196",
            "dpc": "03023209901",
            "name": "សុង សុខា"
        },
        {
            "barcode": "171132197",
            "dpc": "03023209701",
            "name": "ស៊ុំ ភាព"
        },
        {
            "barcode": "171132198",
            "dpc": "03023209601",
            "name": "សួន សុភ័ក្រ"
        },
        {
            "barcode": "171132199",
            "dpc": "03023205101",
            "name": "ទេព វល័ក្ខ"
        },
        {
            "barcode": "171132200",
            "dpc": "03023209101",
            "name": "សាម ឆាង"
        },
        {
            "barcode": "171132201",
            "dpc": "03023209201",
            "name": "បន៉ា  សុខ"
        },
        {
            "barcode": "171132202",
            "dpc": "03023201101",
            "name": "លី  គឹមបឿន"
        },
        {
            "barcode": "171132203",
            "dpc": "03023224501",
            "name": "អ៊ាង   អ៊ី"
        },
        {
            "barcode": "171132204",
            "dpc": "03023201401",
            "name": "ខាំ  ស្រស់"
        },
        {
            "barcode": "171132205",
            "dpc": "03023201601",
            "name": "យាយ ឡៃ"
        },
        {
            "barcode": "171132206",
            "dpc": "03023202601",
            "name": "សួន ស្រីល័ក្ខ"
        },
        {
            "barcode": "171132207",
            "dpc": "03023208501",
            "name": "ខឹម ពៅ"
        },
        {
            "barcode": "171132208",
            "dpc": "03023208401",
            "name": "ឡាច សម្ជស្ស"
        },
        {
            "barcode": "171132209",
            "dpc": "03023213401",
            "name": "សេង ណុប"
        },
        {
            "barcode": "171132210",
            "dpc": "03023209001",
            "name": "ម៉ន សុភាព"
        },
        {
            "barcode": "171132211",
            "dpc": "03023209301",
            "name": "ស៊ន សាវី"
        },
        {
            "barcode": "171132212",
            "dpc": "03023204501",
            "name": "ឈិត សុខ"
        },
        {
            "barcode": "171132213",
            "dpc": "03023211501",
            "name": "ណូត យ៉ារី"
        },
        {
            "barcode": "171132214",
            "dpc": "03023202501",
            "name": "គង់ សុផល"
        },
        {
            "barcode": "171132215",
            "dpc": "03023201201",
            "name": "ទូច យ៉ុង"
        },
        {
            "barcode": "171132216",
            "dpc": "03023201301",
            "name": "ហៀក សឿង"
        },
        {
            "barcode": "171132217",
            "dpc": "03023220901",
            "name": "អ៊ិត វុទ្ធីរិទ្ធ"
        },
        {
            "barcode": "171132218",
            "dpc": "03023201001",
            "name": "ពិន ថាវី"
        },
        {
            "barcode": "171132219",
            "dpc": "03023200801",
            "name": "សុខ សាមន្នី៥"
        },
        {
            "barcode": "171132220",
            "dpc": "03023200701",
            "name": "សុខ សាមន្នី៦"
        },
        {
            "barcode": "171132221",
            "dpc": "03023216901",
            "name": "សុច សឺត"
        },
        {
            "barcode": "171132222",
            "dpc": "03023216801",
            "name": "ស្រី នីម"
        },
        {
            "barcode": "171132223",
            "dpc": "03023216701",
            "name": "លឿង ឡេង"
        },
        {
            "barcode": "171132224",
            "dpc": "03023216601",
            "name": "សាំង ចន្ធី"
        },
        {
            "barcode": "171132225",
            "dpc": "03023216501",
            "name": "សេង តូយ"
        },
        {
            "barcode": "171132226",
            "dpc": "03023216201",
            "name": "ឌុល ជា"
        },
        {
            "barcode": "171132227",
            "dpc": "03023215901",
            "name": "ហយ មនោ"
        },
        {
            "barcode": "171132228",
            "dpc": "03023215701",
            "name": "គី​ ឆី"
        },
        {
            "barcode": "171132229",
            "dpc": "03023212301",
            "name": "តឹក លន"
        },
        {
            "barcode": "171132230",
            "dpc": "03023212201",
            "name": "គី ពេជ្រ"
        },
        {
            "barcode": "171132231",
            "dpc": "03023212101",
            "name": "ខន ខេមរិទ្ធ"
        },
        {
            "barcode": "171132232",
            "dpc": "03023216401",
            "name": "មិត្ត សុភាព"
        },
        {
            "barcode": "171132233",
            "dpc": "03023212501",
            "name": "កែវ អ៊ីម"
        },
        {
            "barcode": "171132234",
            "dpc": "03023203701",
            "name": "វ៉ាត សាវ៉ុន"
        },
        {
            "barcode": "171132235",
            "dpc": "03023212601",
            "name": "យ៉ាង កាំងស្រ៊ុន"
        },
        {
            "barcode": "171132236",
            "dpc": "03023212401",
            "name": "គឹម ភារី"
        },
        {
            "barcode": "171132237",
            "dpc": "03023203801",
            "name": "ឡុង គឹមងួន"
        },
        {
            "barcode": "171132238",
            "dpc": "03023203901",
            "name": "វេង  លីម"
        },
        {
            "barcode": "171132239",
            "dpc": "03023201801",
            "name": "គិត  ឆេងលី"
        },
        {
            "barcode": "171132240",
            "dpc": "03023200101",
            "name": "សោ ស្រីណុច"
        },
        {
            "barcode": "171132241",
            "dpc": "03023210801",
            "name": "ឆាយ សារិ"
        },
        {
            "barcode": "171132242",
            "dpc": "03023200201",
            "name": "គ្រុយ  ប៉ាមុន្នី"
        },
        {
            "barcode": "171132243",
            "dpc": "03023200301",
            "name": "ប៉ែន  ហាប់"
        },
        {
            "barcode": "171132244",
            "dpc": "03023200501",
            "name": "សំ  សុភ័ក្រ"
        },
        {
            "barcode": "171132245",
            "dpc": "03023200901",
            "name": "ប៉ែន  ថាញ់"
        },
        {
            "barcode": "171132246",
            "dpc": "03023201501",
            "name": "ហៀក  កែម"
        },
        {
            "barcode": "171132247",
            "dpc": "03023201701",
            "name": "ព្រាប  យ៉ុន"
        },
        {
            "barcode": "171132248",
            "dpc": "03023202101",
            "name": "វ៉ាន  បណ្តែត"
        },
        {
            "barcode": "171132249",
            "dpc": "03023202201",
            "name": "ឆៃ  ចិន្តា"
        },
        {
            "barcode": "171132250",
            "dpc": "03023202301",
            "name": "ខឹម  លក្ខណា"
        },
        {
            "barcode": "171132251",
            "dpc": "03023202401",
            "name": "លុក  វ៉ន"
        },
        {
            "barcode": "171132252",
            "dpc": "03023202701",
            "name": "សៅ  ភីរ៉ា"
        },
        {
            "barcode": "171132253",
            "dpc": "03023203201",
            "name": "កែវ សំបូរ"
        },
        {
            "barcode": "171132254",
            "dpc": "03023203301",
            "name": "ស្មាន  សាន់"
        },
        {
            "barcode": "171132255",
            "dpc": "03023203401",
            "name": "ណុះ  គុំម៉ារី"
        },
        {
            "barcode": "171132256",
            "dpc": "03023204401",
            "name": "ឌី  វណ្ណដេត"
        },
        {
            "barcode": "171132257",
            "dpc": "03023204701",
            "name": "សួន  ផល្លី"
        },
        {
            "barcode": "171132258",
            "dpc": "03023204801",
            "name": "លី  គីនឃុន"
        },
        {
            "barcode": "171132259",
            "dpc": "03023204901",
            "name": "វ៉ាន់  ចាន់"
        },
        {
            "barcode": "171132260",
            "dpc": "03023205001",
            "name": "ជៀម  មន្ថា"
        },
        {
            "barcode": "171132261",
            "dpc": "03023206201",
            "name": "ម៉េត  សាឡេះ"
        },
        {
            "barcode": "171132262",
            "dpc": "03023206401",
            "name": "ឆាន់  រិទ្ធី"
        },
        {
            "barcode": "171132263",
            "dpc": "03023206501",
            "name": "ប៉ែន  អឿន"
        },
        {
            "barcode": "171132264",
            "dpc": "03023206601",
            "name": "ឡាយ  លួម"
        },
        {
            "barcode": "171132265",
            "dpc": "03023206701",
            "name": "ជុំ  គីមសេង"
        },
        {
            "barcode": "171132266",
            "dpc": "03023206801",
            "name": "ខន  មុនី"
        },
        {
            "barcode": "171132267",
            "dpc": "03023206901",
            "name": "ជិន ប៊ុនធឿន"
        },
        {
            "barcode": "171132268",
            "dpc": "03023207001",
            "name": "លិៈ  ខេន"
        },
        {
            "barcode": "171132269",
            "dpc": "03023207101",
            "name": "សេង  សំអុល"
        },
        {
            "barcode": "171132270",
            "dpc": "03023207201",
            "name": "ង៉ែត  ចិត្រា"
        },
        {
            "barcode": "171132271",
            "dpc": "03023207301",
            "name": "ឡាញ់  បូរ៉ា"
        },
        {
            "barcode": "171132272",
            "dpc": "03023207401",
            "name": "ភួ  វាសនា"
        },
        {
            "barcode": "171132273",
            "dpc": "03023207501",
            "name": "វណ្ណ តូម៉ា"
        },
        {
            "barcode": "171132274",
            "dpc": "03023207801",
            "name": "ខឹម ចន្ទរដ្ឋា"
        },
        {
            "barcode": "171132275",
            "dpc": "03023208001",
            "name": "នឿន  សាវឿន"
        },
        {
            "barcode": "171132276",
            "dpc": "03023208101",
            "name": "តាំង ហេងលីី"
        },
        {
            "barcode": "171132277",
            "dpc": "03023208201",
            "name": "បនា  សាវឿត"
        },
        {
            "barcode": "171132278",
            "dpc": "03023208301",
            "name": "កែវ  សំណាង"
        },
        {
            "barcode": "171132279",
            "dpc": "03023208601",
            "name": "នុត  យឿត"
        },
        {
            "barcode": "171132280",
            "dpc": "03023208701",
            "name": "ឈិត  សំអុល"
        },
        {
            "barcode": "171132281",
            "dpc": "03023208801",
            "name": "ហ៊ុល  ឆាង"
        },
        {
            "barcode": "171132282",
            "dpc": "03023208901",
            "name": "ម៉ៅ  ចិន្តាណា"
        },
        {
            "barcode": "171132283",
            "dpc": "03023209501",
            "name": "ទូច  សំអុល"
        },
        {
            "barcode": "171132284",
            "dpc": "03023209801",
            "name": "សែម  រិន"
        },
        {
            "barcode": "171132285",
            "dpc": "03023210301",
            "name": "អឿ  ប៉ាន"
        },
        {
            "barcode": "171132286",
            "dpc": "03023210401",
            "name": "អ៊ា ចាន់នឿន"
        },
        {
            "barcode": "171132287",
            "dpc": "03023210701",
            "name": "ដែង  វិជ្ជា"
        },
        {
            "barcode": "171132288",
            "dpc": "03023211401",
            "name": "ឡាយ ប៊ុនហុង"
        },
        {
            "barcode": "171132289",
            "dpc": "03023211601",
            "name": "យ៉ើ ម៉ូហាំម៉ាតតៅ់ហ្វិច"
        },
        {
            "barcode": "171132290",
            "dpc": "03023211701",
            "name": "ចឹក ធី"
        },
        {
            "barcode": "171132291",
            "dpc": "03023211801",
            "name": "ហ្វាល់ ម៉ាលី"
        },
        {
            "barcode": "171132292",
            "dpc": "03023212001",
            "name": "ឆុល សុភ័ណ"
        },
        {
            "barcode": "171132293",
            "dpc": "03023212801",
            "name": "យ៉ាំ សុផាត"
        },
        {
            "barcode": "171132294",
            "dpc": "03023212901",
            "name": "ឈុន  អាង"
        },
        {
            "barcode": "171132295",
            "dpc": "03023213301",
            "name": "សាឡេះ  រូហ្វីី"
        },
        {
            "barcode": "171132296",
            "dpc": "03023213501",
            "name": "វ៉ាន់  ខេម៉ា"
        },
        {
            "barcode": "171132297",
            "dpc": "03023213801",
            "name": "ជុំ  សុវណ្ណរិទ្ធ"
        },
        {
            "barcode": "171132298",
            "dpc": "03023213901",
            "name": "ឡេង  សុខា"
        },
        {
            "barcode": "171132299",
            "dpc": "03023214101",
            "name": "ទិត្យ  ថាវី"
        },
        {
            "barcode": "171132300",
            "dpc": "03023214501",
            "name": "រឿន  ទីវន្ត័"
        },
        {
            "barcode": "171132301",
            "dpc": "03023214601",
            "name": "ឡាន  ចន្ធី"
        },
        {
            "barcode": "171132302",
            "dpc": "03023214801",
            "name": "ហ៊ុត  ឆៃ"
        },
        {
            "barcode": "171132303",
            "dpc": "03023214901",
            "name": "ភោគ  ចាន់លា"
        },
        {
            "barcode": "171132304",
            "dpc": "03023215001",
            "name": "សាញ់  វី"
        },
        {
            "barcode": "171132305",
            "dpc": "03023215101",
            "name": "ជៀប  សាវឿត"
        },
        {
            "barcode": "171132306",
            "dpc": "03023215201",
            "name": "ហៀក ឆឹង"
        },
        {
            "barcode": "171132307",
            "dpc": "03023215301",
            "name": "ហោ  ស៊ីណា"
        },
        {
            "barcode": "171132308",
            "dpc": "03023215401",
            "name": "ហោ  មុំ"
        },
        {
            "barcode": "171132309",
            "dpc": "03023215501",
            "name": "ហោ  ផារិទ្ធ"
        },
        {
            "barcode": "171132310",
            "dpc": "03023215601",
            "name": "ចាន់  រ៉ុង"
        },
        {
            "barcode": "171132311",
            "dpc": "03023215801",
            "name": "ទុយ  ប៊ុនរត្ន័"
        },
        {
            "barcode": "171132312",
            "dpc": "03023216001",
            "name": "សង  ចន្ថា"
        },
        {
            "barcode": "171132313",
            "dpc": "03023216101",
            "name": "ហែម  ចន្ថា"
        },
        {
            "barcode": "171132314",
            "dpc": "03023216301",
            "name": "សុទ្ធ  សុវណ្ណាវី"
        },
        {
            "barcode": "171132315",
            "dpc": "03023217001",
            "name": "រស់  ញ៉ិល"
        },
        {
            "barcode": "171132316",
            "dpc": "03023217101",
            "name": "និល  ហ៊ីង"
        },
        {
            "barcode": "171132317",
            "dpc": "03023217201",
            "name": "រ៉ែម  វីរៈ"
        },
        {
            "barcode": "171132318",
            "dpc": "03023217801",
            "name": "អ៊ុន  សម្បត្តិ"
        },
        {
            "barcode": "171132319",
            "dpc": "03023217901",
            "name": "ជុំ  រតនា"
        },
        {
            "barcode": "171132320",
            "dpc": "03023218101",
            "name": "ហ៊ាន  សុន"
        },
        {
            "barcode": "171132321",
            "dpc": "03023218301",
            "name": "ឃឿង  សាវី"
        },
        {
            "barcode": "171132322",
            "dpc": "03023219201",
            "name": "គីម  ចាន់ឡាយ"
        },
        {
            "barcode": "171132323",
            "dpc": "03023219401",
            "name": "ហេង  ហាច"
        },
        {
            "barcode": "171132324",
            "dpc": "03023219701",
            "name": "សួន  សាវ៉ាង"
        },
        {
            "barcode": "171132325",
            "dpc": "03023220801",
            "name": "អ៊ឹង   លីហេង"
        },
        {
            "barcode": "171132326",
            "dpc": "03023221001",
            "name": "ទឹម  សុធា"
        },
        {
            "barcode": "171132327",
            "dpc": "03023221101",
            "name": "សោម  នឿន"
        },
        {
            "barcode": "171132328",
            "dpc": "03023221201",
            "name": "ង៉ាក់  ធន"
        },
        {
            "barcode": "171132329",
            "dpc": "03023221301",
            "name": "ធី"
        },
        {
            "barcode": "171132330",
            "dpc": "03023221401",
            "name": "សាន  សំវី"
        },
        {
            "barcode": "171132331",
            "dpc": "03023221501",
            "name": "ឃឹម ស៊ីម"
        },
        {
            "barcode": "171132332",
            "dpc": "03023221601",
            "name": "ឃឹម  លាង"
        },
        {
            "barcode": "171132333",
            "dpc": "03023221701",
            "name": "ទ្រីវ  ធី"
        },
        {
            "barcode": "171132334",
            "dpc": "03023221801",
            "name": "ជា  ប៊ុនថា"
        },
        {
            "barcode": "171132335",
            "dpc": "03023221901",
            "name": "ពេញ  សំបូរ"
        },
        {
            "barcode": "171132336",
            "dpc": "03023222001",
            "name": "សាលាបឋមសិក្សាអណ្តូងចេញ"
        },
        {
            "barcode": "171132337",
            "dpc": "03023222101",
            "name": "ទេស  សាវុធធីយ៉ា"
        },
        {
            "barcode": "171132338",
            "dpc": "03023222201",
            "name": "ទេស រតនា"
        },
        {
            "barcode": "171132339",
            "dpc": "03023222301",
            "name": "ទេស  សុរតនី"
        },
        {
            "barcode": "171132340",
            "dpc": "03023222401",
            "name": "ឆន  សាវ៉ន"
        },
        {
            "barcode": "171132341",
            "dpc": "03023222501",
            "name": "យូ  ហា"
        },
        {
            "barcode": "171132342",
            "dpc": "03023222601",
            "name": "ប៊ុន  សច្ចរ៉ា"
        },
        {
            "barcode": "171132343",
            "dpc": "03023222701",
            "name": "ពេជ្រ សុផារី"
        },
        {
            "barcode": "171132344",
            "dpc": "03023222801",
            "name": "គង់  ស្រស់"
        },
        {
            "barcode": "171132345",
            "dpc": "03023222901",
            "name": "ឈុន  សេង"
        },
        {
            "barcode": "171132346",
            "dpc": "03023223001",
            "name": "ហេង  ប៊ុនសួរ"
        },
        {
            "barcode": "171132347",
            "dpc": "03023223101",
            "name": "ឡេង  ស៊្រុន"
        },
        {
            "barcode": "171132348",
            "dpc": "03023223201",
            "name": "ឡុច   សន្តិករ"
        },
        {
            "barcode": "171132349",
            "dpc": "03023223301",
            "name": "មួយ  គក់"
        },
        {
            "barcode": "171132350",
            "dpc": "03023223401",
            "name": "ខាវ  នៅ"
        },
        {
            "barcode": "171132351",
            "dpc": "03023223501",
            "name": "ប៉ោ  រ៉េក្រិន្ត"
        },
        {
            "barcode": "171132352",
            "dpc": "03023223901",
            "name": "កែវ  ចន្ថា"
        },
        {
            "barcode": "171132353",
            "dpc": "03023224001",
            "name": "រិន"
        },
        {
            "barcode": "171132354",
            "dpc": "03023224101",
            "name": "នៅ  ហ៊ីម"
        },
        {
            "barcode": "171132355",
            "dpc": "03023224201",
            "name": "ជ័យ  ដួងសិលា"
        },
        {
            "barcode": "171132356",
            "dpc": "03023224301",
            "name": "ជិន  សឿម"
        },
        {
            "barcode": "171132357",
            "dpc": "03023224401",
            "name": "ផុក  សុក"
        },
        {
            "barcode": "171132358",
            "dpc": "03023224601",
            "name": "តុង  ហេង"
        },
        {
            "barcode": "171132359",
            "dpc": "03023224701",
            "name": "ក្រិន  ម៉ូវ"
        },
        {
            "barcode": "171132360",
            "dpc": "03023224801",
            "name": "ងួន  សុបញ្ញា"
        },
        {
            "barcode": "171132361",
            "dpc": "03023224901",
            "name": "អ៊ុប  ភីឡាយ"
        },
        {
            "barcode": "171132362",
            "dpc": "03023225001",
            "name": "ស៊ិន  ង៉ុន"
        },
        {
            "barcode": "171132363",
            "dpc": "03023225101",
            "name": "ភួង  សេងហាន"
        },
        {
            "barcode": "171132364",
            "dpc": "03023225201",
            "name": "មុំ  ដេត"
        },
        {
            "barcode": "171132365",
            "dpc": "03023225301",
            "name": "ជា  សួរ"
        },
        {
            "barcode": "171132366",
            "dpc": "03023225401",
            "name": "ស៊ុន  សុវិជ្ជា"
        },
        {
            "barcode": "171132367",
            "dpc": "03023225501",
            "name": "ជុំ  ប៊ុនធឿន"
        },
        {
            "barcode": "171132368",
            "dpc": "03023225601",
            "name": "ផេង  កុសល់"
        },
        {
            "barcode": "171132369",
            "dpc": "03023225701",
            "name": "ហ៊ឺ  ហាន"
        },
        {
            "barcode": "171132370",
            "dpc": "03023225801",
            "name": "គង់  អៅ"
        },
        {
            "barcode": "171132371",
            "dpc": "03023225901",
            "name": "ផ្ទះ. ក. ភ.ពពាលខែ ឃ.ជ្រៃ"
        },
        {
            "barcode": "171132372",
            "dpc": "03023226001",
            "name": "ស៊ុំ  សុខុម"
        },
        {
            "barcode": "171132373",
            "dpc": "03023226101",
            "name": "ជីវ  រ៉ា"
        },
        {
            "barcode": "171132374",
            "dpc": "03023226301",
            "name": "ឃឹម  ប៊ុនហៀក"
        },
        {
            "barcode": "171132375",
            "dpc": "03023226401",
            "name": "ហុង  តូម៉ា"
        },
        {
            "barcode": "171132376",
            "dpc": "03023226501",
            "name": "យីម   យ៉ុង"
        },
        {
            "barcode": "171132377",
            "dpc": "03023226601",
            "name": "ឆេង  គីម"
        },
        {
            "barcode": "171132378",
            "dpc": "03023226701",
            "name": "ជា  ឆាយបូរណ៍"
        },
        {
            "barcode": "171132379",
            "dpc": "03023226801",
            "name": "ហុង  សុភី"
        },
        {
            "barcode": "171132380",
            "dpc": "03023226901",
            "name": "ម៉ៅ សុគន្ឌឌី"
        },
        {
            "barcode": "171132381",
            "dpc": "03023227101",
            "name": "សាយ   ស៊ីវហេង"
        },
        {
            "barcode": "171132382",
            "dpc": "03023227301",
            "name": "ស្វាយ  សែត"
        },
        {
            "barcode": "171132383",
            "dpc": "03023227401",
            "name": "ច្រុច   អ៊ូ"
        },
        {
            "barcode": "171132384",
            "dpc": "03023227501",
            "name": "រិទ្ធី  អៀមរក្ស"
        },
        {
            "barcode": "171132385",
            "dpc": "03023227601",
            "name": "ម៉ៅ ថេត"
        },
        {
            "barcode": "171132386",
            "dpc": "03023227701",
            "name": "ឈាម លីន"
        },
        {
            "barcode": "171132387",
            "dpc": "03023227801",
            "name": "ឡេង ចំរើន"
        },
        {
            "barcode": "171132388",
            "dpc": "03023227901",
            "name": "រឿន ដុងប៉ា"
        },
        {
            "barcode": "171132389",
            "dpc": "03023228001",
            "name": "ឈួម ហៀង"
        },
        {
            "barcode": "171132390",
            "dpc": "03023228201",
            "name": "ប្រាក់ ឆុំ"
        },
        {
            "barcode": "171132391",
            "dpc": "03023228301",
            "name": "ហ៊ុន គឹមសួក៍"
        },
        {
            "barcode": "171132392",
            "dpc": "03023228401",
            "name": "អេង លិញ"
        },
        {
            "barcode": "171132393",
            "dpc": "03023228501",
            "name": "សេង ពេក"
        },
        {
            "barcode": "171132394",
            "dpc": "03023228601",
            "name": "ឃឺ សុផល"
        },
        {
            "barcode": "171132395",
            "dpc": "03023228701",
            "name": "ឆម អឿម"
        },
        {
            "barcode": "171132396",
            "dpc": "03023228801",
            "name": "លឹម ឆាយងួន"
        },
        {
            "barcode": "171132397",
            "dpc": "03023228901",
            "name": "គង់ អ៊ឺន"
        },
        {
            "barcode": "171132398",
            "dpc": "03023229001",
            "name": "អឿន សុភក្តិ"
        },
        {
            "barcode": "171132399",
            "dpc": "03023229101",
            "name": "អឿន សុភាព"
        },
        {
            "barcode": "171132400",
            "dpc": "03023229201",
            "name": "ស៊ឹម សាវិត"
        },
        {
            "barcode": "171132401",
            "dpc": "03023229301",
            "name": "ភុន ចាន់ណា"
        },
        {
            "barcode": "171132402",
            "dpc": "03023229401",
            "name": "ភុន កុសល់"
        },
        {
            "barcode": "171132403",
            "dpc": "03023229501",
            "name": "អ៊ុំ ឈឿត"
        },
        {
            "barcode": "171132404",
            "dpc": "03023229601",
            "name": "អ៊ិន ស៊ីណាត"
        },
        {
            "barcode": "171132405",
            "dpc": "03023229701",
            "name": "សួស ឃឿត"
        },
        {
            "barcode": "171132406",
            "dpc": "03023229801",
            "name": "ឃី សុខុម"
        },
        {
            "barcode": "171132407",
            "dpc": "03023229901",
            "name": "ហេង សាមន្នី"
        },
        {
            "barcode": "171132408",
            "dpc": "03023230001",
            "name": "ស៊ុយ ផេង"
        },
        {
            "barcode": "171132409",
            "dpc": "03023230101",
            "name": "ហ៊ាង នី"
        },
        {
            "barcode": "171132410",
            "dpc": "03023230201",
            "name": "នី សេដ្ឋា"
        },
        {
            "barcode": "171132411",
            "dpc": "03023230301",
            "name": "ឡុន ស៊ីណាត"
        },
        {
            "barcode": "171132412",
            "dpc": "03023230401",
            "name": "ប៉ែន សំអុល"
        },
        {
            "barcode": "171132413",
            "dpc": "03023230501",
            "name": "ង៉ិន ព្រឿន"
        },
        {
            "barcode": "171132414",
            "dpc": "03023230601",
            "name": "ងួន ភីរុណ"
        },
        {
            "barcode": "171132415",
            "dpc": "03023230801",
            "name": "លឹម សុខហេង"
        },
        {
            "barcode": "171132416",
            "dpc": "03023230901",
            "name": "ឈាន រតនៈ"
        },
        {
            "barcode": "171132417",
            "dpc": "03023231001",
            "name": "ងួន ភារម្យ"
        },
        {
            "barcode": "171132418",
            "dpc": "03023231101",
            "name": "សុង ហេង១"
        },
        {
            "barcode": "171132419",
            "dpc": "03023231201",
            "name": "សុង ហេង២"
        },
        {
            "barcode": "171132420",
            "dpc": "03023231301",
            "name": "យ៉ាន់ ទី"
        },
        {
            "barcode": "171132421",
            "dpc": "03023231401",
            "name": "គង់ យ៉ុម១"
        },
        {
            "barcode": "171132422",
            "dpc": "03023231501",
            "name": "គង់ យ៉ុម២"
        },
        {
            "barcode": "171132423",
            "dpc": "03023231601",
            "name": "យ៉ាន អង"
        },
        {
            "barcode": "171132424",
            "dpc": "03023231701",
            "name": "ព្រំ សួម"
        },
        {
            "barcode": "171132425",
            "dpc": "03023231801",
            "name": "ចិន សុវណ្ណដា"
        },
        {
            "barcode": "171132426",
            "dpc": "03023231901",
            "name": "គង់ យ៉ាន"
        },
        {
            "barcode": "171132427",
            "dpc": "03023232001",
            "name": "សឿត ហូយ"
        },
        {
            "barcode": "171132428",
            "dpc": "03023232101",
            "name": "សឿត ពិសាក់"
        },
        {
            "barcode": "171132429",
            "dpc": "03023232201",
            "name": "ប្រិម ផល្លី២៦"
        },
        {
            "barcode": "171132430",
            "dpc": "03023232301",
            "name": "សឿន ពិសិទ្ធ"
        },
        {
            "barcode": "171132431",
            "dpc": "03023232401",
            "name": "ឈុន ប៊ុនរក្ស"
        },
        {
            "barcode": "171132432",
            "dpc": "03023232501",
            "name": "ជា ចន្ទ្រា"
        },
        {
            "barcode": "171132433",
            "dpc": "03023232601",
            "name": "ស៊ិន សុមេធា១"
        },
        {
            "barcode": "171132434",
            "dpc": "03023232701",
            "name": "ស៊ិន សាវុធ"
        },
        {
            "barcode": "171132435",
            "dpc": "03023232801",
            "name": "ស៊ិន សុមេធា២"
        },
        {
            "barcode": "171132436",
            "dpc": "03023232901",
            "name": "កា ប៉ូឡូ"
        },
        {
            "barcode": "171132437",
            "dpc": "03023233001",
            "name": "លី ម៉ៃ"
        },
        {
            "barcode": "171132438",
            "dpc": "03023233101",
            "name": "ស៊ុត  ពីង"
        },
        {
            "barcode": "171132439",
            "dpc": "03023233201",
            "name": "វ៉ាន់ ឡូវ"
        },
        {
            "barcode": "171132440",
            "dpc": "03023233301",
            "name": "រឿង ភីរុណ"
        },
        {
            "barcode": "171132441",
            "dpc": "03023233501",
            "name": "ស៊ូរ បូរ"
        },
        {
            "barcode": "171132442",
            "dpc": "03023233601",
            "name": "មាង យ៉ុង"
        },
        {
            "barcode": "171132443",
            "dpc": "03023233701",
            "name": "មាស ទី"
        },
        {
            "barcode": "171132444",
            "dpc": "03023233801",
            "name": "ហ៊ូ ង៉ុយ"
        },
        {
            "barcode": "171132445",
            "dpc": "03023233901",
            "name": "ស ហ៊ួន"
        },
        {
            "barcode": "171132446",
            "dpc": "03023234001",
            "name": "ឈួង សាន់"
        },
        {
            "barcode": "171132447",
            "dpc": "03023234101",
            "name": "អីវ វ៉ៅ"
        },
        {
            "barcode": "171132448",
            "dpc": "03023234301",
            "name": "សួន សុគុណ"
        },
        {
            "barcode": "171132449",
            "dpc": "03023234501",
            "name": "ឡាច ពេជ្រ"
        },
        {
            "barcode": "171132450",
            "dpc": "03023234601",
            "name": "ដាង ចាន់ណា"
        },
        {
            "barcode": "171132451",
            "dpc": "03023234701",
            "name": "ង៉ូវ ហ្គិចទៀង"
        },
        {
            "barcode": "171132452",
            "dpc": "03023234801",
            "name": "ដាន ផេង"
        },
        {
            "barcode": "171132453",
            "dpc": "03023234901",
            "name": "ចាន់ ដារ៉ា"
        },
        {
            "barcode": "171132454",
            "dpc": "03023235001",
            "name": "ផ្លុង ឆាយ៉ា"
        },
        {
            "barcode": "171132455",
            "dpc": "03023235101",
            "name": "សុខ យីម"
        },
        {
            "barcode": "171132456",
            "dpc": "03023235201",
            "name": "សាយ សំណាង"
        },
        {
            "barcode": "171132457",
            "dpc": "03023235301",
            "name": "ប៉ង ធី"
        },
        {
            "barcode": "171132458",
            "dpc": "03023235401",
            "name": "ហួន ស៊ុន"
        },
        {
            "barcode": "171132459",
            "dpc": "03023235501",
            "name": "ប៊ុត វីរិៈ"
        },
        {
            "barcode": "171132460",
            "dpc": "03023235601",
            "name": "ប៊ិន ចន្ថា"
        },
        {
            "barcode": "171132461",
            "dpc": "03023235701",
            "name": "កា ប៉ូឡុង"
        },
        {
            "barcode": "171132462",
            "dpc": "03023235801",
            "name": "មិន វី"
        },
        {
            "barcode": "171132463",
            "dpc": "03023235901",
            "name": "គឹម សោភា"
        },
        {
            "barcode": "171132464",
            "dpc": "03023236001",
            "name": "ជុន កក"
        },
        {
            "barcode": "171132465",
            "dpc": "03023236101",
            "name": "នូ ជីវ៉ា"
        },
        {
            "barcode": "171132466",
            "dpc": "03023236201",
            "name": "ជុំ គូរ៉ា"
        },
        {
            "barcode": "171132467",
            "dpc": "03023236301",
            "name": "ទៀ បាក់ស្រេ់ង"
        },
        {
            "barcode": "171132468",
            "dpc": "03023236401",
            "name": "លី វិមាន"
        },
        {
            "barcode": "171132469",
            "dpc": "03023236501",
            "name": "លី វិល័យ"
        },
        {
            "barcode": "171132470",
            "dpc": "03023236601",
            "name": "ហាច ចុង"
        },
        {
            "barcode": "171132471",
            "dpc": "03023236701",
            "name": "ង៉ុយ ហ៊រហុង"
        },
        {
            "barcode": "171132472",
            "dpc": "03023236801",
            "name": "ង៉ុយ វ៊រម៉េង"
        },
        {
            "barcode": "171132473",
            "dpc": "03023236901",
            "name": "ចៅ  ធី"
        },
        {
            "barcode": "171132474",
            "dpc": "03023237001",
            "name": "ទីវ រី"
        },
        {
            "barcode": "171132475",
            "dpc": "03023237101",
            "name": "រឿត សារុន"
        },
        {
            "barcode": "171132476",
            "dpc": "03023237201",
            "name": "ឡុច រ៉ា"
        },
        {
            "barcode": "171132477",
            "dpc": "03023237301",
            "name": "សឿ  ឃឿត"
        },
        {
            "barcode": "171132478",
            "dpc": "03023237401",
            "name": "តាន់ តុង"
        },
        {
            "barcode": "171132479",
            "dpc": "03023237501",
            "name": "រឿន សំអឿន"
        },
        {
            "barcode": "171132480",
            "dpc": "03023237601",
            "name": "អ៊ិត ប៉ូន"
        },
        {
            "barcode": "171132481",
            "dpc": "03023237701",
            "name": "តាន់  ម៉ៅ"
        },
        {
            "barcode": "171132482",
            "dpc": "03023237901",
            "name": "ហ៊ី ជា ដើមឬស្ស៊ី"
        },
        {
            "barcode": "171132483",
            "dpc": "03023238001",
            "name": "ខោ ប្រផា"
        },
        {
            "barcode": "171132484",
            "dpc": "03023238101",
            "name": "សុខ សំអាង"
        },
        {
            "barcode": "171132485",
            "dpc": "03023238201",
            "name": "ចេក ប៊ុននឿន"
        },
        {
            "barcode": "171132486",
            "dpc": "03023238301",
            "name": "ពុំ  យឿត"
        },
        {
            "barcode": "171132487",
            "dpc": "03023238401",
            "name": "ប្រុក យ៉ាន"
        },
        {
            "barcode": "171132488",
            "dpc": "03023238501",
            "name": "អឿម ស៊្រីម"
        },
        {
            "barcode": "171132489",
            "dpc": "03023238601",
            "name": "ជៀប សឿប"
        },
        {
            "barcode": "171132490",
            "dpc": "03023238701",
            "name": "ឡឹក ឡាន"
        },
        {
            "barcode": "171132491",
            "dpc": "03023238801",
            "name": "ឡឹក លាភ"
        },
        {
            "barcode": "171132492",
            "dpc": "03023238901",
            "name": "ហ៊ុល សុខន"
        },
        {
            "barcode": "171132493",
            "dpc": "03023239301",
            "name": "ស៊ុំ ឌី"
        },
        {
            "barcode": "171132494",
            "dpc": "03023239401",
            "name": "ម៉ន សាមឿត"
        },
        {
            "barcode": "171132495",
            "dpc": "03023239501",
            "name": "ឡឹក លឿត"
        },
        {
            "barcode": "171132496",
            "dpc": "03023239601",
            "name": "រឿន ភីង"
        },
        {
            "barcode": "171132497",
            "dpc": "03023239801",
            "name": "សន សំ"
        },
        {
            "barcode": "171132498",
            "dpc": "03023239901",
            "name": "ជួនូ ពេជ្រ"
        },
        {
            "barcode": "171132499",
            "dpc": "03023240001",
            "name": "ចាន់ សាវី"
        },
        {
            "barcode": "171132500",
            "dpc": "03023240101",
            "name": "លេម ធី"
        },
        {
            "barcode": "171132501",
            "dpc": "03023240501",
            "name": "ឡាក់ ម៉េងវិបុល"
        },
        {
            "barcode": "171132502",
            "dpc": "03023240601",
            "name": "លី ប៊ុនធឿន"
        },
        {
            "barcode": "171132503",
            "dpc": "03023240901",
            "name": "យ៉ន គីមអឿន"
        },
        {
            "barcode": "171132504",
            "dpc": "03023241001",
            "name": "ប៊ុន សារឿន"
        },
        {
            "barcode": "171132505",
            "dpc": "03023241101",
            "name": "ប៉ាត់ សុខែម"
        },
        {
            "barcode": "171132506",
            "dpc": "03023241201",
            "name": "សាន់  វេន"
        },
        {
            "barcode": "171132507",
            "dpc": "03023241301",
            "name": "ទឹម ដែន"
        },
        {
            "barcode": "171132508",
            "dpc": "03023241401",
            "name": "កែវ ភីរក្ស"
        },
        {
            "barcode": "171132509",
            "dpc": "03023241501",
            "name": "សៅ យន់"
        },
        {
            "barcode": "171132510",
            "dpc": "03023241601",
            "name": "ជា នង់"
        },
        {
            "barcode": "171132511",
            "dpc": "03023241701",
            "name": "ស៊ាង អឿន"
        },
        {
            "barcode": "171132512",
            "dpc": "03023241801",
            "name": "គង់ អេង"
        },
        {
            "barcode": "171132513",
            "dpc": "03023241901",
            "name": "ម៉ុង ស៊ុយ"
        },
        {
            "barcode": "171132514",
            "dpc": "03023242001",
            "name": "ពីវ ហូយ"
        },
        {
            "barcode": "171132515",
            "dpc": "03023242101",
            "name": "ស៊ឹម សាលីន"
        },
        {
            "barcode": "171132516",
            "dpc": "03023242201",
            "name": "ស៊ឹម សាឡី"
        },
        {
            "barcode": "171132517",
            "dpc": "03023242301",
            "name": "យូ សាវ៉ន"
        },
        {
            "barcode": "171132518",
            "dpc": "03023242401",
            "name": "ស៊ឹម លន់"
        },
        {
            "barcode": "171132519",
            "dpc": "03023242501",
            "name": "គង់ ឆេងលួត"
        },
        {
            "barcode": "171132520",
            "dpc": "03023242601",
            "name": "យៀង សាវ៉ុង"
        },
        {
            "barcode": "171132521",
            "dpc": "03023242701",
            "name": "សាលា ឆទាន"
        },
        {
            "barcode": "171132522",
            "dpc": "03023242801",
            "name": "យឹម យ៉ង់"
        },
        {
            "barcode": "171132523",
            "dpc": "03023242901",
            "name": "ហេង សាលី"
        },
        {
            "barcode": "171132524",
            "dpc": "03023243001",
            "name": "ប៊ូ សាលីម"
        },
        {
            "barcode": "171132525",
            "dpc": "03023243101",
            "name": "ងួន យឺន"
        },
        {
            "barcode": "171132526",
            "dpc": "03023243201",
            "name": "ឆម  ឈុន"
        },
        {
            "barcode": "171132527",
            "dpc": "03023243401",
            "name": "ប៊ុន សាវី"
        },
        {
            "barcode": "171132528",
            "dpc": "03023243501",
            "name": "សួង ចាន់សុន"
        },
        {
            "barcode": "171132529",
            "dpc": "03023243601",
            "name": "គឹម វ៉ាន់ធី"
        },
        {
            "barcode": "171132530",
            "dpc": "03023243701",
            "name": "ងួន  ស៊ាងហេង"
        },
        {
            "barcode": "171132531",
            "dpc": "03023243801",
            "name": "ងួន រឿន"
        },
        {
            "barcode": "171132532",
            "dpc": "03023243901",
            "name": "ឈា ឈាន"
        },
        {
            "barcode": "171132533",
            "dpc": "03023244001",
            "name": "ថាប់  សាវ័ន្ត"
        },
        {
            "barcode": "171132534",
            "dpc": "03023244101",
            "name": "ភូមិ មូលីកា"
        },
        {
            "barcode": "171132535",
            "dpc": "03023244201",
            "name": "ស៊ឹម ទូច"
        },
        {
            "barcode": "171132536",
            "dpc": "03023244301",
            "name": "ទី សារិទ្ធ"
        },
        {
            "barcode": "171132537",
            "dpc": "03023244401",
            "name": "ស៊ឹម ឈឿត"
        },
        {
            "barcode": "171132538",
            "dpc": "03023244601",
            "name": "គុជ ឈិន"
        },
        {
            "barcode": "171132539",
            "dpc": "03023244701",
            "name": "សុង គឹមសួរ២"
        },
        {
            "barcode": "171132540",
            "dpc": "03023244801",
            "name": "អឿន សារឿន"
        },
        {
            "barcode": "171132541",
            "dpc": "03023244901",
            "name": "សេង មុំ"
        },
        {
            "barcode": "171132542",
            "dpc": "03023245001",
            "name": "សេង ធី"
        },
        {
            "barcode": "171132543",
            "dpc": "03023245101",
            "name": "ចន ញាណ"
        },
        {
            "barcode": "171132544",
            "dpc": "03023245201",
            "name": "សួន សំណាង"
        },
        {
            "barcode": "171132545",
            "dpc": "03023245301",
            "name": "ឌុក ស្រីសក្ខ"
        },
        {
            "barcode": "171132546",
            "dpc": "03023245401",
            "name": "មាន កុសល់"
        },
        {
            "barcode": "171132547",
            "dpc": "03023245501",
            "name": "សន យ៉ាន"
        },
        {
            "barcode": "171132548",
            "dpc": "03023245601",
            "name": "ខាត់ យឿន"
        },
        {
            "barcode": "171132549",
            "dpc": "03023245701",
            "name": "ខាត់ ប៉ូយ"
        },
        {
            "barcode": "171132550",
            "dpc": "03023245801",
            "name": "នូ គឹមនាង"
        },
        {
            "barcode": "171132551",
            "dpc": "03023245901",
            "name": "លន់ រ៉ា"
        },
        {
            "barcode": "171132552",
            "dpc": "03023246001",
            "name": "ហម សារ៉ាត់"
        },
        {
            "barcode": "171132553",
            "dpc": "03023246101",
            "name": "ជា វិបុល"
        },
        {
            "barcode": "171132554",
            "dpc": "03023246201",
            "name": "អ៊ឹង គីមងួន"
        },
        {
            "barcode": "171132555",
            "dpc": "03023246501",
            "name": "ស្វាយ ឈុនលឿន"
        },
        {
            "barcode": "171132556",
            "dpc": "03023246901",
            "name": "ពាន់ អឿន"
        },
        {
            "barcode": "171132557",
            "dpc": "03023247001",
            "name": "ប៉ែន នុយ"
        },
        {
            "barcode": "171132558",
            "dpc": "03023247101",
            "name": "ផុន លីមសេង"
        },
        {
            "barcode": "171132559",
            "dpc": "03023247201",
            "name": "ទី សុភាព"
        },
        {
            "barcode": "171132560",
            "dpc": "03023247301",
            "name": "ឡាក់ ឈួម"
        },
        {
            "barcode": "171132561",
            "dpc": "03023247401",
            "name": "ខន សុផាត"
        },
        {
            "barcode": "171132562",
            "dpc": "03023247501",
            "name": "ភឿន វ៉ាន់ដា"
        },
        {
            "barcode": "171132563",
            "dpc": "03023247601",
            "name": "សៅ សឿត"
        },
        {
            "barcode": "171132564",
            "dpc": "03023247701",
            "name": "អ៊ឹម វ៉ាន់ឌី"
        },
        {
            "barcode": "171132565",
            "dpc": "03023247801",
            "name": "គឹម វ៉ាន់ថា"
        },
        {
            "barcode": "171132566",
            "dpc": "03023247901",
            "name": "ចាន់ សាមឿន"
        },
        {
            "barcode": "171132567",
            "dpc": "03023248101",
            "name": "យាយ យ៉ូគង់"
        }
    ];


barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
