let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=

    [
        {
            "barcode": "171145658",
            "dpc": "03033325801",
            "name": "លន់ សុខចំរើន"
        },
        {
            "barcode": "171145659",
            "dpc": "03033303601",
            "name": "អ៊ឹម ថា"
        },
        {
            "barcode": "171145660",
            "dpc": "03033325501",
            "name": "អែប ភិរុណ"
        },
        {
            "barcode": "171145661",
            "dpc": "03033303301",
            "name": "ឡេង សេងលាង"
        },
        {
            "barcode": "171145662",
            "dpc": "03033303201",
            "name": "លួត សំបូ"
        },
        {
            "barcode": "171145663",
            "dpc": "03033303101",
            "name": "វង្ស វិចិត្រ"
        },
        {
            "barcode": "171145664",
            "dpc": "03033302501",
            "name": "ប៉ាង មារិទ្ធ"
        },
        {
            "barcode": "171145665",
            "dpc": "03033302401",
            "name": "យ៉ត គៀវ"
        },
        {
            "barcode": "171145666",
            "dpc": "03033302301",
            "name": "ហ៊ុន ហ៊ី"
        },
        {
            "barcode": "171145667",
            "dpc": "03033302201",
            "name": "ស៊ិម ស្រី"
        },
        {
            "barcode": "171145668",
            "dpc": "03033302101",
            "name": "អ៊ុំ សុខឡាយ"
        },
        {
            "barcode": "171145669",
            "dpc": "03033302001",
            "name": "ផៃ បុប្ផា"
        },
        {
            "barcode": "171145670",
            "dpc": "03033301901",
            "name": "មាន  សាលវ័ន្ត"
        },
        {
            "barcode": "171145671",
            "dpc": "03033301801",
            "name": "សុខ  ពុធ"
        },
        {
            "barcode": "171145672",
            "dpc": "03033301701",
            "name": "រត្ន័  ចន្ធូ"
        },
        {
            "barcode": "171145673",
            "dpc": "03033301601",
            "name": "ហិញ  រដ្ឋា"
        },
        {
            "barcode": "171145674",
            "dpc": "03033301501",
            "name": "កាន់  ស៊ីចន្ទ័តូ"
        },
        {
            "barcode": "171145675",
            "dpc": "03033301401",
            "name": "ងី  វណ្ណះ"
        },
        {
            "barcode": "171145676",
            "dpc": "03033301301",
            "name": "អ៊ឹម  ផល្លា"
        },
        {
            "barcode": "171145677",
            "dpc": "03033301201",
            "name": "សុខ  សុវណ្ណ"
        },
        {
            "barcode": "171145678",
            "dpc": "03033301101",
            "name": "អ៊ឹង  ចិន្តា"
        },
        {
            "barcode": "171145679",
            "dpc": "03033301001",
            "name": "សេង  ម៉េង"
        },
        {
            "barcode": "171145680",
            "dpc": "03033300901",
            "name": "យ៉ាន  ស្រអែម"
        },
        {
            "barcode": "171145681",
            "dpc": "03033300801",
            "name": "លី  សុភាព"
        },
        {
            "barcode": "171145682",
            "dpc": "03033300701",
            "name": "ផន  វិចិត្រ"
        },
        {
            "barcode": "171145683",
            "dpc": "03033300601",
            "name": "លីម  ស៊ីចេង"
        },
        {
            "barcode": "171145684",
            "dpc": "03033300501",
            "name": "រិន រ៉ាត់"
        },
        {
            "barcode": "171145685",
            "dpc": "03033300401",
            "name": "កែ សៅ"
        },
        {
            "barcode": "171145686",
            "dpc": "03033300201",
            "name": "ឈន វៃ"
        },
        {
            "barcode": "171145687",
            "dpc": "03033300101",
            "name": "តាំង បេងគុណ"
        },
        {
            "barcode": "171145688",
            "dpc": "03033326001",
            "name": "ស្រី ទិព្វសម្បត្តិ"
        },
        {
            "barcode": "171145689",
            "dpc": "03033326101",
            "name": "ញ៉េប វ៉ន"
        },
        {
            "barcode": "171145690",
            "dpc": "03033325901",
            "name": "សុខ នី"
        },
        {
            "barcode": "171145691",
            "dpc": "03033307501",
            "name": "ជ  គាង"
        },
        {
            "barcode": "171145692",
            "dpc": "03033303501",
            "name": "ប៉ោ ស៊ីនួន"
        },
        {
            "barcode": "171145693",
            "dpc": "03033303401",
            "name": "គឹម ឡៃ"
        },
        {
            "barcode": "171145694",
            "dpc": "03033326201",
            "name": "រិន សារី"
        },
        {
            "barcode": "171145695",
            "dpc": "03033307101",
            "name": "ឡោ វ៉ាន់សាយ"
        },
        {
            "barcode": "171145696",
            "dpc": "03033303801",
            "name": "ម៉ី ផល្លា"
        },
        {
            "barcode": "171145697",
            "dpc": "03033326301",
            "name": "យិន  ចិត្រា ១"
        },
        {
            "barcode": "171145698",
            "dpc": "03033326401",
            "name": "ជួន សុខហេង"
        },
        {
            "barcode": "171145699",
            "dpc": "03033326501",
            "name": "យូ សាន"
        },
        {
            "barcode": "171145700",
            "dpc": "03033326601",
            "name": "មាស សារុន"
        },
        {
            "barcode": "171145701",
            "dpc": "03033307801",
            "name": "ហុង កុសល"
        },
        {
            "barcode": "171145702",
            "dpc": "03033307901",
            "name": "ឈាងអៀង"
        },
        {
            "barcode": "171145703",
            "dpc": "03033308001",
            "name": "ជា សិទ្ធ"
        },
        {
            "barcode": "171145704",
            "dpc": "03033308101",
            "name": "ខេង សៀកហួត"
        },
        {
            "barcode": "171145705",
            "dpc": "03033326701",
            "name": "តោ សាលីន"
        },
        {
            "barcode": "171145706",
            "dpc": "03033307001",
            "name": "ជឺ ពុំ"
        },
        {
            "barcode": "171145707",
            "dpc": "03033306901",
            "name": "លឹម ម៉ី"
        },
        {
            "barcode": "171145708",
            "dpc": "03033306801",
            "name": "អៀម ម៉េងគង់"
        },
        {
            "barcode": "171145709",
            "dpc": "03033308301",
            "name": "នូវ គឹមណៃ"
        },
        {
            "barcode": "171145710",
            "dpc": "03033302601",
            "name": "ញ៉េប  ចាន់នី"
        },
        {
            "barcode": "171145711",
            "dpc": "03033302701",
            "name": "នី  យ៉ារី"
        },
        {
            "barcode": "171145712",
            "dpc": "03033302801",
            "name": "គុណ  យឿន"
        },
        {
            "barcode": "171145713",
            "dpc": "03033302901",
            "name": "ប៊ុន   វន្នី"
        },
        {
            "barcode": "171145714",
            "dpc": "03033303001",
            "name": "ចៅ  ចេកអាំង"
        },
        {
            "barcode": "171145715",
            "dpc": "03033303701",
            "name": "មាស  ធន"
        },
        {
            "barcode": "171145716",
            "dpc": "03033303901",
            "name": "ចាន់  សាវ៉ៃ"
        },
        {
            "barcode": "171145717",
            "dpc": "03033304001",
            "name": "ជុំ  ចាន់ថន"
        },
        {
            "barcode": "171145718",
            "dpc": "03033304101",
            "name": "ឆន  សុភ័ស្ត"
        },
        {
            "barcode": "171145719",
            "dpc": "03033304201",
            "name": "លី  ស៊ុក"
        },
        {
            "barcode": "171145720",
            "dpc": "03033304301",
            "name": "ប៉ែ  សារៀម"
        },
        {
            "barcode": "171145721",
            "dpc": "03033304401",
            "name": "ឡុក  ចាន់ធី"
        },
        {
            "barcode": "171145722",
            "dpc": "03033304501",
            "name": "ខៀវ  ឈឿត"
        },
        {
            "barcode": "171145723",
            "dpc": "03033304601",
            "name": "សុង   កង"
        },
        {
            "barcode": "171145724",
            "dpc": "03033304701",
            "name": "យក់  លីវ"
        },
        {
            "barcode": "171145725",
            "dpc": "03033304801",
            "name": "ស៊ឹម ស៊ីថា"
        },
        {
            "barcode": "171145726",
            "dpc": "03033304901",
            "name": "សុខ  ផាន់"
        },
        {
            "barcode": "171145727",
            "dpc": "03033305001",
            "name": "អ៊ុក អ៊ូច"
        },
        {
            "barcode": "171145728",
            "dpc": "03033305101",
            "name": "កុល  ប្រពៃ"
        },
        {
            "barcode": "171145729",
            "dpc": "03033305201",
            "name": "អ៊ឹម  ផល្លា"
        },
        {
            "barcode": "171145730",
            "dpc": "03033305301",
            "name": "រស់  សាបឿន"
        },
        {
            "barcode": "171145731",
            "dpc": "03033305401",
            "name": "រស់  ទីណាល់"
        },
        {
            "barcode": "171145732",
            "dpc": "03033305501",
            "name": "សេង  សុថុន"
        },
        {
            "barcode": "171145733",
            "dpc": "03033305601",
            "name": "មាឃ  រចនា"
        },
        {
            "barcode": "171145734",
            "dpc": "03033305701",
            "name": "សៅ  ឆុន"
        },
        {
            "barcode": "171145735",
            "dpc": "03033305801",
            "name": "កែវ  ធី"
        },
        {
            "barcode": "171145736",
            "dpc": "03033305901",
            "name": "សំ  សាវន"
        },
        {
            "barcode": "171145737",
            "dpc": "03033306001",
            "name": "ស៊ីន   យ៉ែម"
        },
        {
            "barcode": "171145738",
            "dpc": "03033306101",
            "name": "អ៊ុំ  សុធីតា"
        },
        {
            "barcode": "171145739",
            "dpc": "03033306201",
            "name": "សន  សុផល"
        },
        {
            "barcode": "171145740",
            "dpc": "03033306301",
            "name": "ចាន់  ក្រេប"
        },
        {
            "barcode": "171145741",
            "dpc": "03033306401",
            "name": "លន់  ចាន់អុង"
        },
        {
            "barcode": "171145742",
            "dpc": "03033306501",
            "name": "ធួន  វណ្ណី"
        },
        {
            "barcode": "171145743",
            "dpc": "03033306601",
            "name": "ផាន់   ស៊ុនបុប្ជា"
        },
        {
            "barcode": "171145744",
            "dpc": "03033306701",
            "name": "គីវ  វ៉ាន់នី"
        },
        {
            "barcode": "171145745",
            "dpc": "03033307201",
            "name": "ចាន់  ទូច"
        },
        {
            "barcode": "171145746",
            "dpc": "03033307401",
            "name": "ប៉ុល  ឃួន"
        },
        {
            "barcode": "171145747",
            "dpc": "03033307701",
            "name": "បេង ស៊ីណាត ២"
        },
        {
            "barcode": "171145748",
            "dpc": "03033308601",
            "name": "បាន  ហួត"
        },
        {
            "barcode": "171145749",
            "dpc": "03033308701",
            "name": "ឃួន ម៉ាឡា"
        },
        {
            "barcode": "171145750",
            "dpc": "03033308801",
            "name": "ហង្ស សីណា"
        },
        {
            "barcode": "171145751",
            "dpc": "03033308901",
            "name": "ម៉ៅ  សាវុន"
        },
        {
            "barcode": "171145752",
            "dpc": "03033309001",
            "name": "ចាន់  ណារី"
        },
        {
            "barcode": "171145753",
            "dpc": "03033309101",
            "name": "ចាន់  រដ្ឋា"
        },
        {
            "barcode": "171145754",
            "dpc": "03033309201",
            "name": "លី   ហុង"
        },
        {
            "barcode": "171145755",
            "dpc": "03033309301",
            "name": "សុខ  ណារ៉ា"
        },
        {
            "barcode": "171145756",
            "dpc": "03033309401",
            "name": "សេង  សុខឃាង"
        },
        {
            "barcode": "171145757",
            "dpc": "03033309501",
            "name": "សួស  ភីរុន"
        },
        {
            "barcode": "171145758",
            "dpc": "03033309601",
            "name": "មណ្ឌលសុខភាពជ្រៃ"
        },
        {
            "barcode": "171145759",
            "dpc": "03033309701",
            "name": "ហ៊ន  សាមិត"
        },
        {
            "barcode": "171145760",
            "dpc": "03033309901",
            "name": "ឆយ  ចាន់ណា"
        },
        {
            "barcode": "171145761",
            "dpc": "03033310001",
            "name": "លី  ឆាយ"
        },
        {
            "barcode": "171145762",
            "dpc": "03033310101",
            "name": "ជ្រិន  សុភស្ត័"
        },
        {
            "barcode": "171145763",
            "dpc": "03033310201",
            "name": "សៀង  វីរៈ"
        },
        {
            "barcode": "171145764",
            "dpc": "03033310301",
            "name": "រ៉េត  រិន"
        },
        {
            "barcode": "171145765",
            "dpc": "03033310401",
            "name": "ខាត់  គីមលាង"
        },
        {
            "barcode": "171145766",
            "dpc": "03033310501",
            "name": "ហ៊ូ  ឡាយឡូវ"
        },
        {
            "barcode": "171145767",
            "dpc": "03033310601",
            "name": "ងួន  រ៉ាឌី"
        },
        {
            "barcode": "171145768",
            "dpc": "03033310701",
            "name": "ហាស់  ស៊ីណេម"
        },
        {
            "barcode": "171145769",
            "dpc": "03033310801",
            "name": "គឹម  សំអុល"
        },
        {
            "barcode": "171145770",
            "dpc": "03033310901",
            "name": "សុត  សុខុម"
        },
        {
            "barcode": "171145771",
            "dpc": "03033311001",
            "name": "វ៉ាត  សុភាព"
        },
        {
            "barcode": "171145772",
            "dpc": "03033311101",
            "name": "ពិន  ចាន់ធី"
        },
        {
            "barcode": "171145773",
            "dpc": "03033311201",
            "name": "ច័ន្ទ  សុថុន"
        },
        {
            "barcode": "171145774",
            "dpc": "03033311301",
            "name": "ត្រាន់  ធីហឿង"
        },
        {
            "barcode": "171145775",
            "dpc": "03033311401",
            "name": "ឃុន  សារឿន"
        },
        {
            "barcode": "171145776",
            "dpc": "03033311501",
            "name": "តាន់  ធុច"
        },
        {
            "barcode": "171145777",
            "dpc": "03033311601",
            "name": "ហ៊ន  សាមិត"
        },
        {
            "barcode": "171145778",
            "dpc": "03033311701",
            "name": "ស៊ុន  ឈុន"
        },
        {
            "barcode": "171145779",
            "dpc": "03033311801",
            "name": "យុង  សម្បត្តិ"
        },
        {
            "barcode": "171145780",
            "dpc": "03033311901",
            "name": "ហួ  កុយ"
        },
        {
            "barcode": "171145781",
            "dpc": "03033312001",
            "name": "រិទ្ធ  វុទ្ធី"
        },
        {
            "barcode": "171145782",
            "dpc": "03033312201",
            "name": "ហឿង  ពៅ"
        },
        {
            "barcode": "171145783",
            "dpc": "03033312301",
            "name": "ចាន់  បញ្ញា"
        },
        {
            "barcode": "171145784",
            "dpc": "03033312401",
            "name": "ស្រី  ពេញ"
        },
        {
            "barcode": "171145785",
            "dpc": "03033312501",
            "name": "វ៉ាន់  ធី"
        },
        {
            "barcode": "171145786",
            "dpc": "03033312601",
            "name": "មាឃ  ឆាយ"
        },
        {
            "barcode": "171145787",
            "dpc": "03033312701",
            "name": "យ៉ា  គឹ់មលី"
        },
        {
            "barcode": "171145788",
            "dpc": "03033312801",
            "name": "ផាន់  សារិ"
        },
        {
            "barcode": "171145789",
            "dpc": "03033312901",
            "name": "សៅ  សំណាង"
        },
        {
            "barcode": "171145790",
            "dpc": "03033313001",
            "name": "ទេស  សុន"
        },
        {
            "barcode": "171145791",
            "dpc": "03033313101",
            "name": "វ័រ  វឌ្ឍនះ"
        },
        {
            "barcode": "171145792",
            "dpc": "03033313201",
            "name": "នួន  ឡាំ"
        },
        {
            "barcode": "171145793",
            "dpc": "03033313301",
            "name": "ម៉ៃ  យីមហ៊ាង"
        },
        {
            "barcode": "171145794",
            "dpc": "03033313401",
            "name": "ហោ  ឌីម៉ង់"
        },
        {
            "barcode": "171145795",
            "dpc": "03033313501",
            "name": "ត្រេស  សាវឿង"
        },
        {
            "barcode": "171145796",
            "dpc": "03033313601",
            "name": "ម៉ៃ  អ៊ាន"
        },
        {
            "barcode": "171145797",
            "dpc": "03033313701",
            "name": "ឆឹង  វ៉ន"
        },
        {
            "barcode": "171145798",
            "dpc": "03033313801",
            "name": "ម៉ុក  សាលៀម"
        },
        {
            "barcode": "171145799",
            "dpc": "03033313901",
            "name": "រឿង ឌេតតេជពល"
        },
        {
            "barcode": "171145800",
            "dpc": "03033314001",
            "name": "ហេង  សូវៀត"
        },
        {
            "barcode": "171145801",
            "dpc": "03033314101",
            "name": "ហាន  សំអាត"
        },
        {
            "barcode": "171145802",
            "dpc": "03033314201",
            "name": "ប៊ុន  លីម"
        },
        {
            "barcode": "171145803",
            "dpc": "03033314301",
            "name": "តាន់  ឃឿន"
        },
        {
            "barcode": "171145804",
            "dpc": "03033314401",
            "name": "រត្ន័  សាវី"
        },
        {
            "barcode": "171145805",
            "dpc": "03033314501",
            "name": "អឿន  គីណាល់"
        },
        {
            "barcode": "171145806",
            "dpc": "03033314601",
            "name": "រើន  ភាព"
        },
        {
            "barcode": "171145807",
            "dpc": "03033314701",
            "name": "ម៉ៅ  សារុន"
        },
        {
            "barcode": "171145808",
            "dpc": "03033314801",
            "name": "ស៊ីវ  ទ្រី"
        },
        {
            "barcode": "171145809",
            "dpc": "03033314901",
            "name": "ស៊ិន  សារ៉ែន"
        },
        {
            "barcode": "171145810",
            "dpc": "03033315001",
            "name": "ស៊ិន  សារ៉ន"
        },
        {
            "barcode": "171145811",
            "dpc": "03033315101",
            "name": "ស៊ិន  សារិ"
        },
        {
            "barcode": "171145812",
            "dpc": "03033315301",
            "name": "ណៃ   សុខន"
        },
        {
            "barcode": "171145813",
            "dpc": "03033315401",
            "name": "េឃ្លាក  មុន្នី"
        },
        {
            "barcode": "171145814",
            "dpc": "03033315501",
            "name": "ព្រិល  វាសនា"
        },
        {
            "barcode": "171145815",
            "dpc": "03033315601",
            "name": "កែន  ប៊ុនយ៉េង"
        },
        {
            "barcode": "171145816",
            "dpc": "03033315701",
            "name": "ចៀម  វណ្ណា"
        },
        {
            "barcode": "171145817",
            "dpc": "03033315801",
            "name": "អេង  លិញ"
        },
        {
            "barcode": "171145818",
            "dpc": "03033315901",
            "name": "ភួង  សម្ឆស្ស"
        },
        {
            "barcode": "171145819",
            "dpc": "03033316001",
            "name": "សេង  ពិសិដ្ឋ"
        },
        {
            "barcode": "171145820",
            "dpc": "03033316201",
            "name": "ឆឹង  វ៉ាត"
        },
        {
            "barcode": "171145821",
            "dpc": "03033316301",
            "name": "ងួន  សារឿប"
        },
        {
            "barcode": "171145822",
            "dpc": "03033316401",
            "name": "ណាក់  សាវុធ"
        },
        {
            "barcode": "171145823",
            "dpc": "03033316501",
            "name": "ងិន  សំអាត"
        },
        {
            "barcode": "171145824",
            "dpc": "03033316601",
            "name": "សេង  ពិសិដ្ធ"
        },
        {
            "barcode": "171145825",
            "dpc": "03033316701",
            "name": "នន  នាង"
        },
        {
            "barcode": "171145826",
            "dpc": "03033316801",
            "name": "វ៉ា  ចន្ទ័ពិសិដ្ឋ"
        },
        {
            "barcode": "171145827",
            "dpc": "03033316901",
            "name": "វ៉ាន់ វ៉ាត"
        },
        {
            "barcode": "171145828",
            "dpc": "03033317001",
            "name": "សាន់  សាន"
        },
        {
            "barcode": "171145829",
            "dpc": "03033317101",
            "name": "ឆាយ  ជឿន"
        },
        {
            "barcode": "171145830",
            "dpc": "03033317201",
            "name": "ឆាយ  សែ"
        },
        {
            "barcode": "171145831",
            "dpc": "03033317501",
            "name": "វ៉ែន  ស៊ីន"
        },
        {
            "barcode": "171145832",
            "dpc": "03033317601",
            "name": "ផាន់  ស្រីផុន"
        },
        {
            "barcode": "171145833",
            "dpc": "03033317701",
            "name": "វ៉ើត  ហ៊ួយ"
        },
        {
            "barcode": "171145834",
            "dpc": "03033317801",
            "name": "ប្រាក់  សម្បត្តិ"
        },
        {
            "barcode": "171145835",
            "dpc": "03033317901",
            "name": "ឡាត  សាលី"
        },
        {
            "barcode": "171145836",
            "dpc": "03033318101",
            "name": "សាន  យ៉ន"
        },
        {
            "barcode": "171145837",
            "dpc": "03033318201",
            "name": "ផ្ទះ. ក. ភ.អណ្តូងចេញ"
        },
        {
            "barcode": "171145838",
            "dpc": "03033318301",
            "name": "សឿន  ចាន់ណា"
        },
        {
            "barcode": "171145839",
            "dpc": "03033318401",
            "name": "អ៊ុក  ហឿន"
        },
        {
            "barcode": "171145840",
            "dpc": "03033318501",
            "name": "ទេព  ជួន"
        },
        {
            "barcode": "171145841",
            "dpc": "03033318601",
            "name": "ឡេង  ហេង"
        },
        {
            "barcode": "171145842",
            "dpc": "03033318701",
            "name": "សន  សុខរ៉ា"
        },
        {
            "barcode": "171145843",
            "dpc": "03033318901",
            "name": "មឹក  ប៊ែ"
        },
        {
            "barcode": "171145844",
            "dpc": "03033319001",
            "name": "កែវ  យ៉ាត"
        },
        {
            "barcode": "171145845",
            "dpc": "03033319101",
            "name": "គឹម  ឃន"
        },
        {
            "barcode": "171145846",
            "dpc": "03033319201",
            "name": "ឡុង  ចាន់ថា"
        },
        {
            "barcode": "171145847",
            "dpc": "03033319301",
            "name": "យិន  សង់"
        },
        {
            "barcode": "171145848",
            "dpc": "03033319401",
            "name": "ពេជ្រ  សារី"
        },
        {
            "barcode": "171145849",
            "dpc": "03033319501",
            "name": "ចៅ  ធន់"
        },
        {
            "barcode": "171145850",
            "dpc": "03033319701",
            "name": "គឹម   ស៊ាន"
        },
        {
            "barcode": "171145851",
            "dpc": "03033319801",
            "name": "មិត  យ៉ុន"
        },
        {
            "barcode": "171145852",
            "dpc": "03033319901",
            "name": "សេង  ភូមិន្ទ"
        },
        {
            "barcode": "171145853",
            "dpc": "03033320001",
            "name": "ទូច សុខហេង"
        },
        {
            "barcode": "171145854",
            "dpc": "03033320101",
            "name": "ម៉ៅ  ឌីណេត"
        },
        {
            "barcode": "171145855",
            "dpc": "03033320201",
            "name": "ប៊ាន  សំណាង"
        },
        {
            "barcode": "171145856",
            "dpc": "03033320301",
            "name": "គង់  ចិន្តា"
        },
        {
            "barcode": "171145857",
            "dpc": "03033320401",
            "name": "ស៊ុន  ពិសិដ្ឋ"
        },
        {
            "barcode": "171145858",
            "dpc": "03033320501",
            "name": "យ៉ាត  ឈួម"
        },
        {
            "barcode": "171145859",
            "dpc": "03033320601",
            "name": "ភួន  ម៉ៅ"
        },
        {
            "barcode": "171145860",
            "dpc": "03033320701",
            "name": "ថោង  ធី"
        },
        {
            "barcode": "171145861",
            "dpc": "03033320801",
            "name": "អ៊ួន  ចំរើន"
        },
        {
            "barcode": "171145862",
            "dpc": "03033320901",
            "name": "គង់  សាវី"
        },
        {
            "barcode": "171145863",
            "dpc": "03033321001",
            "name": "កុយ  កញ្ចនា"
        },
        {
            "barcode": "171145864",
            "dpc": "03033321101",
            "name": "សាយ រីយ៉ា"
        },
        {
            "barcode": "171145865",
            "dpc": "03033321201",
            "name": "តឹង  ចៃ"
        },
        {
            "barcode": "171145866",
            "dpc": "03033321301",
            "name": "វុធ  ធាន"
        },
        {
            "barcode": "171145867",
            "dpc": "03033321401",
            "name": "ហៃម  សឺន"
        },
        {
            "barcode": "171145868",
            "dpc": "03033321501",
            "name": "សេស  សាវ៉ាត"
        },
        {
            "barcode": "171145869",
            "dpc": "03033321601",
            "name": "ចេង  ចំរើន"
        },
        {
            "barcode": "171145870",
            "dpc": "03033321701",
            "name": "អេង សារឿន"
        },
        {
            "barcode": "171145871",
            "dpc": "03033321801",
            "name": "កែវ  ស្រី"
        },
        {
            "barcode": "171145872",
            "dpc": "03033321901",
            "name": "លុយ  ឡី"
        },
        {
            "barcode": "171145873",
            "dpc": "03033322001",
            "name": "លី  ប៊ុនយីន"
        },
        {
            "barcode": "171145874",
            "dpc": "03033322101",
            "name": "ហ៊ុន  យ៉ាន"
        },
        {
            "barcode": "171145875",
            "dpc": "03033322201",
            "name": "យុន  សាវឿន"
        },
        {
            "barcode": "171145876",
            "dpc": "03033322301",
            "name": "សែម  ប៊ុនធឿន"
        },
        {
            "barcode": "171145877",
            "dpc": "03033322401",
            "name": "រស់  វណ្ណរដ្ឋ"
        },
        {
            "barcode": "171145878",
            "dpc": "03033322501",
            "name": "ហ៊ួ  ចណ្ណា"
        },
        {
            "barcode": "171145879",
            "dpc": "03033322601",
            "name": "អ៊ិន  តន"
        },
        {
            "barcode": "171145880",
            "dpc": "03033322701",
            "name": "ហែម  សំអាត"
        },
        {
            "barcode": "171145881",
            "dpc": "03033322801",
            "name": "ស៊ុន  រិទ្ធ"
        },
        {
            "barcode": "171145882",
            "dpc": "03033322901",
            "name": "ឡុង  ប៊ុនថន"
        },
        {
            "barcode": "171145883",
            "dpc": "03033323101",
            "name": "ហៀង  គីមងិន"
        },
        {
            "barcode": "171145884",
            "dpc": "03033323201",
            "name": "តែ  លីដា"
        },
        {
            "barcode": "171145885",
            "dpc": "03033323301",
            "name": "វ៉ង លីហ៊ាង"
        },
        {
            "barcode": "171145886",
            "dpc": "03033323401",
            "name": "ហ៊ាន  មេត្រី"
        },
        {
            "barcode": "171145887",
            "dpc": "03033323501",
            "name": "ជុំ  សុខខេង"
        },
        {
            "barcode": "171145888",
            "dpc": "03033323601",
            "name": "សាន  សារ៉ន"
        },
        {
            "barcode": "171145889",
            "dpc": "03033323701",
            "name": "ទេស  ចំរើន"
        },
        {
            "barcode": "171145890",
            "dpc": "03033323801",
            "name": "លឹម  ដុល្លា"
        },
        {
            "barcode": "171145891",
            "dpc": "03033323901",
            "name": "សុខ  ធី"
        },
        {
            "barcode": "171145892",
            "dpc": "03033324001",
            "name": "ញ៉ែម  ពង់"
        },
        {
            "barcode": "171145893",
            "dpc": "03033324101",
            "name": "ម៉ៅ  រ៉េត"
        },
        {
            "barcode": "171145894",
            "dpc": "03033324201",
            "name": "ងនិ  សារ៉េត"
        },
        {
            "barcode": "171145895",
            "dpc": "03033324301",
            "name": "ឆន  កាក់"
        },
        {
            "barcode": "171145896",
            "dpc": "03033324401",
            "name": "សារ៉េត  វាសនា"
        },
        {
            "barcode": "171145897",
            "dpc": "03033324501",
            "name": "ហួត  ចិន្តា"
        },
        {
            "barcode": "171145898",
            "dpc": "03033324601",
            "name": "តុប  ឌឿន"
        },
        {
            "barcode": "171145899",
            "dpc": "03033324701",
            "name": "វី  សុខចំរើន"
        },
        {
            "barcode": "171145900",
            "dpc": "03033324801",
            "name": "ជៀម  ផែ"
        },
        {
            "barcode": "171145901",
            "dpc": "03033324901",
            "name": "អ៊ុយ  សារ៉ម"
        },
        {
            "barcode": "171145902",
            "dpc": "03033325001",
            "name": "លុយ  ចន្ថា"
        },
        {
            "barcode": "171145903",
            "dpc": "03033325101",
            "name": "ពេជ្រ  វណ្ណះ"
        },
        {
            "barcode": "171145904",
            "dpc": "03033325201",
            "name": "ធូ  សច្ចនា"
        },
        {
            "barcode": "171145905",
            "dpc": "03033325301",
            "name": "ឆេង  លុយ"
        },
        {
            "barcode": "171145906",
            "dpc": "03033325401",
            "name": "ជា  ពៅ"
        },
        {
            "barcode": "171145907",
            "dpc": "03033325601",
            "name": "ទូច  ឆេង"
        },
        {
            "barcode": "171145908",
            "dpc": "03033325701",
            "name": "វី  នាង"
        },
        {
            "barcode": "171145909",
            "dpc": "03033326801",
            "name": "ម៉ន  ឌឿន"
        },
        {
            "barcode": "171145910",
            "dpc": "03033326901",
            "name": "ហេង  រ៉ិត"
        },
        {
            "barcode": "171145911",
            "dpc": "03033327001",
            "name": "ជោតិ ច័ន្ទចរិយា"
        },
        {
            "barcode": "171145912",
            "dpc": "03033327101",
            "name": "អ៊ីង ចាន់ថាច"
        },
        {
            "barcode": "171145913",
            "dpc": "03033327201",
            "name": "ស ស៊ុយ"
        },
        {
            "barcode": "171145914",
            "dpc": "03033327301",
            "name": "ម៉ម សុខែមរិ"
        },
        {
            "barcode": "171145915",
            "dpc": "03033327401",
            "name": "កែវ គឹមអាយ"
        },
        {
            "barcode": "171145916",
            "dpc": "03033327501",
            "name": "គ្រួច សារើយ"
        },
        {
            "barcode": "171145917",
            "dpc": "03033327601",
            "name": "ពុធ សានី"
        },
        {
            "barcode": "171145918",
            "dpc": "03033327701",
            "name": "ឯម សាម៉េត"
        },
        {
            "barcode": "171145919",
            "dpc": "03033327801",
            "name": "សែម ដា"
        },
        {
            "barcode": "171145920",
            "dpc": "03033327901",
            "name": "កង សុផានី"
        },
        {
            "barcode": "171145921",
            "dpc": "03033328001",
            "name": "ទូច ណារី"
        },
        {
            "barcode": "171145922",
            "dpc": "03033328101",
            "name": "ឡេង សានឿត"
        },
        {
            "barcode": "171145923",
            "dpc": "03033328201",
            "name": "ពេជ្រ វាន់ឌី"
        },
        {
            "barcode": "171145924",
            "dpc": "03033328301",
            "name": "ឃឹម សុជាតិ"
        },
        {
            "barcode": "171145925",
            "dpc": "03033328401",
            "name": "ឃួន ខូឌីន"
        },
        {
            "barcode": "171145926",
            "dpc": "03033328501",
            "name": "វង្ស សុវណ្ណា"
        },
        {
            "barcode": "171145927",
            "dpc": "03033328601",
            "name": "ឃួន ឆិកា"
        },
        {
            "barcode": "171145928",
            "dpc": "03033328701",
            "name": "ឃួន ថុនា"
        },
        {
            "barcode": "171145929",
            "dpc": "03033328801",
            "name": "សែម កៅ"
        },
        {
            "barcode": "171145930",
            "dpc": "03033328901",
            "name": "ហែម ចំរើន"
        },
        {
            "barcode": "171145931",
            "dpc": "03033329001",
            "name": "ឯក កាន"
        },
        {
            "barcode": "171145932",
            "dpc": "03033329201",
            "name": "ឡុង ចិន្តា"
        },
        {
            "barcode": "171145933",
            "dpc": "03033329301",
            "name": "លី ណាវី"
        },
        {
            "barcode": "171145934",
            "dpc": "03033329401",
            "name": "ពង្ស រតន:"
        },
        {
            "barcode": "171145935",
            "dpc": "03033329501",
            "name": "ប៊ិត សារួម"
        },
        {
            "barcode": "171145936",
            "dpc": "03033329601",
            "name": "មុំ ទូច"
        },
        {
            "barcode": "171145937",
            "dpc": "03033329701",
            "name": "កា ចន្ទ័វុទ្ធី"
        },
        {
            "barcode": "171145938",
            "dpc": "03033329801",
            "name": "កា ហុន"
        },
        {
            "barcode": "171145939",
            "dpc": "03033329901",
            "name": "ឡេង ផេង"
        },
        {
            "barcode": "171145940",
            "dpc": "03033330001",
            "name": "គឹម សុប"
        },
        {
            "barcode": "171145941",
            "dpc": "03033330101",
            "name": "អុំ ព្រឿង"
        },
        {
            "barcode": "171145942",
            "dpc": "03033330201",
            "name": "អុំ សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171145943",
            "dpc": "03033330301",
            "name": "សែន ណារ៉ុង"
        },
        {
            "barcode": "171145944",
            "dpc": "03033330401",
            "name": "ងិន សុខុន"
        },
        {
            "barcode": "171145945",
            "dpc": "03033330501",
            "name": "ប៉ិល ចាន់ណារ៉ា"
        },
        {
            "barcode": "171145946",
            "dpc": "03033330601",
            "name": "ឈូក ឆាយា"
        },
        {
            "barcode": "171145947",
            "dpc": "03033330701",
            "name": "លាង ចន្ធូ"
        },
        {
            "barcode": "171145948",
            "dpc": "03033330801",
            "name": "កែវ មុន្នី"
        },
        {
            "barcode": "171145949",
            "dpc": "03033330901",
            "name": "យិន សុផាន"
        },
        {
            "barcode": "171145950",
            "dpc": "03033331001",
            "name": "រ៉ុង ពន្លក"
        },
        {
            "barcode": "171145951",
            "dpc": "03033331101",
            "name": "ហួន ហាន"
        },
        {
            "barcode": "171145952",
            "dpc": "03033331201",
            "name": "គី ប៊ុណ្ណារ៉ា"
        },
        {
            "barcode": "171145953",
            "dpc": "03033331301",
            "name": "ចិត្រ សុវណ្ណនី"
        },
        {
            "barcode": "171145954",
            "dpc": "03033331401",
            "name": "អ៊ូ មីនា"
        },
        {
            "barcode": "171145955",
            "dpc": "03033331501",
            "name": "ហាច យ៉ា"
        },
        {
            "barcode": "171145956",
            "dpc": "03033331601",
            "name": "ស៊ីន ឃីម"
        },
        {
            "barcode": "171145957",
            "dpc": "03033331701",
            "name": "ម៉ក់ សាវុធ"
        },
        {
            "barcode": "171145958",
            "dpc": "03033331801",
            "name": "ឃីវ សុវត្តិ"
        },
        {
            "barcode": "171145959",
            "dpc": "03033331901",
            "name": "ភាជ ឆុន"
        },
        {
            "barcode": "171145960",
            "dpc": "03033332001",
            "name": "ពិន ឌី"
        },
        {
            "barcode": "171145961",
            "dpc": "03033332101",
            "name": "ជាង មនីលីដា"
        },
        {
            "barcode": "171145962",
            "dpc": "03033332201",
            "name": "នួន លៀង"
        },
        {
            "barcode": "171145963",
            "dpc": "03033332301",
            "name": "តឿម ឃ៉ឺត"
        },
        {
            "barcode": "171145964",
            "dpc": "03033332401",
            "name": "យស់ សុផល"
        },
        {
            "barcode": "171145965",
            "dpc": "03033332501",
            "name": "ភួន ឃឿន"
        },
        {
            "barcode": "171145966",
            "dpc": "03033332601",
            "name": "គុយ ធារិន"
        },
        {
            "barcode": "171145967",
            "dpc": "03033332701",
            "name": "សោ វិចិត្រ"
        },
        {
            "barcode": "171145968",
            "dpc": "03033332801",
            "name": "ជា ថូន"
        },
        {
            "barcode": "171145969",
            "dpc": "03033332901",
            "name": "ឈិន ភារុន"
        },
        {
            "barcode": "171145970",
            "dpc": "03033333001",
            "name": "សុខ ឆវី"
        },
        {
            "barcode": "171145971",
            "dpc": "03033333201",
            "name": "ជា វិដេ"
        },
        {
            "barcode": "171145972",
            "dpc": "03033333301",
            "name": "លាង ហាវ"
        },
        {
            "barcode": "171145973",
            "dpc": "03033333501",
            "name": "គុំ សារួន ២"
        },
        {
            "barcode": "171145974",
            "dpc": "03033333601",
            "name": "ព្រហ្ម សុផល"
        },
        {
            "barcode": "171145975",
            "dpc": "03033333701",
            "name": "ឡុង ស៊ីរ៉ាវុធ"
        },
        {
            "barcode": "171145976",
            "dpc": "03033333901",
            "name": "ហុក កុសល"
        },
        {
            "barcode": "171145977",
            "dpc": "03033334101",
            "name": "ភិន សារុន"
        },
        {
            "barcode": "171145978",
            "dpc": "03033334201",
            "name": "ចៅ សុខកឿន"
        },
        {
            "barcode": "171145979",
            "dpc": "03033334301",
            "name": "កែវ សម្បត"
        },
        {
            "barcode": "171145980",
            "dpc": "03033334401",
            "name": "ស៊ុន សុផា ៤"
        },
        {
            "barcode": "171145981",
            "dpc": "03033334701",
            "name": "សោម សាវ៉ុង"
        },
        {
            "barcode": "171145982",
            "dpc": "03033334801",
            "name": "ខឹម ចៅសែន"
        },
        {
            "barcode": "171145983",
            "dpc": "03033334901",
            "name": "យឿម ចាន់ធី"
        },
        {
            "barcode": "171145984",
            "dpc": "03033335001",
            "name": "យិប វ៉ាន់"
        },
        {
            "barcode": "171145985",
            "dpc": "03033335101",
            "name": "ណាយ នឿន"
        },
        {
            "barcode": "171145986",
            "dpc": "03033335201",
            "name": "ហៀង លីណា"
        },
        {
            "barcode": "171145987",
            "dpc": "03033335301",
            "name": "ឈឿង គឹមសេង"
        },
        {
            "barcode": "171145988",
            "dpc": "03033335501",
            "name": "ប៉ិច រីដា"
        },
        {
            "barcode": "171145989",
            "dpc": "03033335601",
            "name": "សុខ ចន្នី"
        },
        {
            "barcode": "171145990",
            "dpc": "03033335701",
            "name": "សាយ ចន្ធូ"
        },
        {
            "barcode": "171145991",
            "dpc": "03033335801",
            "name": "ហែម សុទ"
        },
        {
            "barcode": "171145992",
            "dpc": "03033335901",
            "name": "គិត សុចន្ទ័ដាវី"
        },
        {
            "barcode": "171145993",
            "dpc": "03033336001",
            "name": "ណម សឿន"
        },
        {
            "barcode": "171145994",
            "dpc": "03033336101",
            "name": "ឆែម សាវន"
        },
        {
            "barcode": "171145995",
            "dpc": "03033336201",
            "name": "ញ៉ែម សុគន្ធា"
        },
        {
            "barcode": "171145996",
            "dpc": "03033336301",
            "name": "មឿន សារ៉ន់"
        },
        {
            "barcode": "171145997",
            "dpc": "03033336401",
            "name": "ផាន់ ចន្រ្ដា"
        },
        {
            "barcode": "171145998",
            "dpc": "03033336501",
            "name": "ឆាន់ រឿន"
        },
        {
            "barcode": "171145999",
            "dpc": "03033336601",
            "name": "ប៉ែន ធិតា"
        },
        {
            "barcode": "171146000",
            "dpc": "03033336701",
            "name": "នូ ចំណុច"
        },
        {
            "barcode": "171146001",
            "dpc": "03033336801",
            "name": "ជា សារ៉ុន"
        },
        {
            "barcode": "171146002",
            "dpc": "03033337001",
            "name": "យ៉ាន បូផៃ"
        },
        {
            "barcode": "171146003",
            "dpc": "03033337101",
            "name": "រិន រ៉ា"
        },
        {
            "barcode": "171146004",
            "dpc": "03033337201",
            "name": "រិទ្ធ សារវន"
        },
        {
            "barcode": "171146005",
            "dpc": "03033337301",
            "name": "ចែត យ៉ុម"
        },
        {
            "barcode": "171146006",
            "dpc": "03033337401",
            "name": "ពៅ ចរិយា"
        },
        {
            "barcode": "171146007",
            "dpc": "03033337501",
            "name": "ណន វណ្ណនឿន"
        },
        {
            "barcode": "171146008",
            "dpc": "03033337601",
            "name": "ឈឹម សុតា"
        },
        {
            "barcode": "171146009",
            "dpc": "03033337701",
            "name": "ភោគ សុខាត់"
        },
        {
            "barcode": "171146010",
            "dpc": "03033337801",
            "name": "សោម ប្រុស"
        },
        {
            "barcode": "171146011",
            "dpc": "03033337901",
            "name": "ឈិន ណារិទ"
        },
        {
            "barcode": "171146012",
            "dpc": "03033338001",
            "name": "គឹម ភិន"
        },
        {
            "barcode": "171146013",
            "dpc": "03033338101",
            "name": "សាក់ ស"
        },
        {
            "barcode": "171146014",
            "dpc": "03033338201",
            "name": "ទាវ សុផាត"
        },
        {
            "barcode": "171146015",
            "dpc": "03033338301",
            "name": "លី វ៉ានថេត"
        },
        {
            "barcode": "171146016",
            "dpc": "03033338401",
            "name": "រស់ ទីណាល"
        },
        {
            "barcode": "171146017",
            "dpc": "03033338501",
            "name": "យ៉ុង ចិន"
        },
        {
            "barcode": "171146018",
            "dpc": "03033338601",
            "name": "យ៉ា ម៉ៅ"
        },
        {
            "barcode": "171146019",
            "dpc": "03033338701",
            "name": "លឹម ចន្ធី"
        },
        {
            "barcode": "171146020",
            "dpc": "03033338801",
            "name": "ទិត រដ្ឋា"
        },
        {
            "barcode": "171146021",
            "dpc": "03033338901",
            "name": "វ៉ាន់ វ៉ន"
        },
        {
            "barcode": "171146022",
            "dpc": "03033339001",
            "name": "ហុង សៅលន់"
        },
        {
            "barcode": "171146023",
            "dpc": "03033339101",
            "name": "សួន ជៀប"
        },
        {
            "barcode": "171146024",
            "dpc": "03033339201",
            "name": "ទុំ សោផង់"
        },
        {
            "barcode": "171146025",
            "dpc": "03033339301",
            "name": "ស្រៀង គឹមទី"
        },
        {
            "barcode": "171146026",
            "dpc": "03033339401",
            "name": "សូ សារ៉េន"
        },
        {
            "barcode": "171146027",
            "dpc": "03033339501",
            "name": "សៅ ប៊ុនឡា"
        },
        {
            "barcode": "171146028",
            "dpc": "03033339601",
            "name": "ង៉ែត ចន្ធី"
        },
        {
            "barcode": "171146029",
            "dpc": "03033339701",
            "name": "ប៉ុក រុន"
        },
        {
            "barcode": "171146030",
            "dpc": "03033339801",
            "name": "សឿ សារី"
        },
        {
            "barcode": "171146031",
            "dpc": "03033339901",
            "name": "ឡាក់ ម៉ានី"
        },
        {
            "barcode": "171146032",
            "dpc": "03033340101",
            "name": "សន វ៉ាន់"
        },
        {
            "barcode": "171146033",
            "dpc": "03033340301",
            "name": "អ៊ឹង អ៊ិត១"
        },
        {
            "barcode": "171146034",
            "dpc": "03033340501",
            "name": "ជឺ ពុំ"
        },
        {
            "barcode": "171146035",
            "dpc": "03033340601",
            "name": "ហៃ សាខន"
        },
        {
            "barcode": "171146036",
            "dpc": "03033340701",
            "name": "បៀច សុផល"
        },
        {
            "barcode": "171146037",
            "dpc": "03033340801",
            "name": "ធូ រើន"
        },
        {
            "barcode": "171146038",
            "dpc": "03033340901",
            "name": "គីម យឿប"
        },
        {
            "barcode": "171146039",
            "dpc": "03033341001",
            "name": "សំ ឡុង"
        },
        {
            "barcode": "171146040",
            "dpc": "03033341101",
            "name": "ត្រាំង ចាន់ទួង"
        },
        {
            "barcode": "171146041",
            "dpc": "03033341201",
            "name": "ពុធ វ៉ាន់មុន្នី"
        },
        {
            "barcode": "171146042",
            "dpc": "03033341301",
            "name": "ជីង ហ៊ុយគួង"
        },
        {
            "barcode": "171146043",
            "dpc": "03033341401",
            "name": "យី គក់"
        },
        {
            "barcode": "171146044",
            "dpc": "03033341501",
            "name": "សុខ គង់"
        },
        {
            "barcode": "171146045",
            "dpc": "03033341801",
            "name": "ចាយ ធានី"
        },
        {
            "barcode": "171146046",
            "dpc": "03033341901",
            "name": "វី សាវេន"
        },
        {
            "barcode": "171146047",
            "dpc": "03033342101",
            "name": "ស៊ុត អ៊ួច"
        },
        {
            "barcode": "171146048",
            "dpc": "03033342301",
            "name": "ទី  ឈឿត"
        },
        {
            "barcode": "171146049",
            "dpc": "03033342401",
            "name": "យិន ម៉ាច"
        },
        {
            "barcode": "171146050",
            "dpc": "03033342501",
            "name": "ឈឹម ម៉ារឌី"
        },
        {
            "barcode": "171146051",
            "dpc": "03033342601",
            "name": "ប៉ែន  ម៉ាន"
        },
        {
            "barcode": "171146052",
            "dpc": "03033342701",
            "name": "គឹម ឆវី"
        },
        {
            "barcode": "171146053",
            "dpc": "03033342801",
            "name": "សាំង សុគន្ធា"
        },
        {
            "barcode": "171146054",
            "dpc": "03033342901",
            "name": "សយ មៅ"
        },
        {
            "barcode": "171146055",
            "dpc": "03033343001",
            "name": "ផន ខេម"
        },
        {
            "barcode": "171146056",
            "dpc": "03033343101",
            "name": "រឿន សុធារ៉ា"
        },
        {
            "barcode": "171146057",
            "dpc": "03033343201",
            "name": "សៀង ចន្ធី"
        },
        {
            "barcode": "171146058",
            "dpc": "03033343301",
            "name": "អេ ផល្លា"
        },
        {
            "barcode": "171146059",
            "dpc": "03033343401",
            "name": "តា លិន"
        },
        {
            "barcode": "171146060",
            "dpc": "03033343501",
            "name": "ព្រឿង ចិន្តា"
        },
        {
            "barcode": "171146061",
            "dpc": "03033343601",
            "name": "វ៉ាន់ ចាន់ណូ"
        },
        {
            "barcode": "171146062",
            "dpc": "03033343801",
            "name": "អ៊ុំ ពន្លឺ"
        },
        {
            "barcode": "171146063",
            "dpc": "03033343901",
            "name": "ឡឹង បុប្ជា"
        },
        {
            "barcode": "171146064",
            "dpc": "03033344001",
            "name": "ឈឿង ជុំ"
        },
        {
            "barcode": "171146065",
            "dpc": "03033344101",
            "name": "ឈឿត សារួន"
        },
        {
            "barcode": "171146066",
            "dpc": "03033344201",
            "name": "ភន ភាព"
        },
        {
            "barcode": "171146067",
            "dpc": "03033344301",
            "name": "សៀម វុន"
        },
        {
            "barcode": "171146068",
            "dpc": "03033344401",
            "name": "ហូន វ៉ានឌឿន"
        },
        {
            "barcode": "171146069",
            "dpc": "03033344501",
            "name": "ជា កក្តដា"
        },
        {
            "barcode": "171146070",
            "dpc": "03033344601",
            "name": "មាន អក្ខរា"
        },
        {
            "barcode": "171146071",
            "dpc": "03033344701",
            "name": "អ៊ុច រដ្ឋា"
        },
        {
            "barcode": "171146072",
            "dpc": "03033344801",
            "name": "ប៊ុន ទូច"
        },
        {
            "barcode": "171146073",
            "dpc": "03033344901",
            "name": "សួ វណ្ណថន"
        },
        {
            "barcode": "171146074",
            "dpc": "03033345001",
            "name": "ង៉ុយ សុងហ៉ុយ"
        },
        {
            "barcode": "171146075",
            "dpc": "03033345101",
            "name": "ក្រៀល សុភាព"
        },
        {
            "barcode": "171146076",
            "dpc": "03033345201",
            "name": "ខាត់ ថង"
        },
        {
            "barcode": "171146077",
            "dpc": "03033345301",
            "name": "ញ៉ក់ ពីវ"
        },
        {
            "barcode": "171146078",
            "dpc": "03033345401",
            "name": "ស៊ិន យ៉ែម"
        },
        {
            "barcode": "171146079",
            "dpc": "03033345501",
            "name": "អ៊ុំ សុឃឿន"
        },
        {
            "barcode": "171146080",
            "dpc": "03033345601",
            "name": "លី សុធី"
        },
        {
            "barcode": "171146081",
            "dpc": "03033345701",
            "name": "អ៊ុំ ប៊ុនណយ"
        },
        {
            "barcode": "171146082",
            "dpc": "03033345801",
            "name": "ជា ពៅ"
        },
        {
            "barcode": "171146083",
            "dpc": "03033345901",
            "name": "មុំ ឆិល"
        },
        {
            "barcode": "171146084",
            "dpc": "03033346001",
            "name": "ហង្ថ វណ្ណា"
        },
        {
            "barcode": "171146085",
            "dpc": "03033346101",
            "name": "កែវ ខន"
        },
        {
            "barcode": "171146086",
            "dpc": "03033346201",
            "name": "ក្រុមហ៊ុនមិសុតា"
        },
        {
            "barcode": "171146087",
            "dpc": "03033346301",
            "name": "អ៊ុន សុជាតិ"
        },
        {
            "barcode": "171146088",
            "dpc": "03033346401",
            "name": "លី វ៉ាននី"
        },
        {
            "barcode": "171146089",
            "dpc": "03033346501",
            "name": "ប៊ី ចាន់ថា"
        },
        {
            "barcode": "171146090",
            "dpc": "03033346601",
            "name": "យ៉ាង ស៊ត"
        },
        {
            "barcode": "171146091",
            "dpc": "03033346701",
            "name": "នុត ហឿម"
        },
        {
            "barcode": "171146092",
            "dpc": "03033346801",
            "name": "គឹម ផល"
        },
        {
            "barcode": "171146093",
            "dpc": "03033346901",
            "name": "ថាច់ ចិន្តា"
        },
        {
            "barcode": "171146094",
            "dpc": "03033347001",
            "name": "អ៊ុង មិនា"
        },
        {
            "barcode": "171146095",
            "dpc": "03033347101",
            "name": "សែមដា"
        },
        {
            "barcode": "171146096",
            "dpc": "03033347201",
            "name": "លាង ធារី"
        },
        {
            "barcode": "171146097",
            "dpc": "03033347301",
            "name": "ជា ផែន"
        },
        {
            "barcode": "171146098",
            "dpc": "03033347401",
            "name": "ពា ចាន់បូរី"
        },
        {
            "barcode": "171146099",
            "dpc": "03033347501",
            "name": "ស៊ន ចំណាន"
        },
        {
            "barcode": "171146100",
            "dpc": "03033347601",
            "name": "ពា សុផាន"
        },
        {
            "barcode": "171146101",
            "dpc": "03033347701",
            "name": "ប្រុស សារឿន"
        },
        {
            "barcode": "171146102",
            "dpc": "03033347801",
            "name": "បេ ផល"
        },
        {
            "barcode": "171146103",
            "dpc": "03033347901",
            "name": "នួន ចន្ធូ"
        },
        {
            "barcode": "171146104",
            "dpc": "03033348001",
            "name": "ស៊ិន សទ្ធី"
        }
    ]

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
