let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=

    [
        {
            "barcode": "171147518",
            "dpc": "03043600101",
            "name": "ព្រាប ជាដា"
        },
        {
            "barcode": "171147519",
            "dpc": "03043600301",
            "name": "ធួន រ៉ាវុធ"
        },
        {
            "barcode": "171147520",
            "dpc": "03043600501",
            "name": "ឆៃ សាវ៉ាត"
        },
        {
            "barcode": "171147521",
            "dpc": "03043600601",
            "name": "ចៅ ម៉េងសេង"
        },
        {
            "barcode": "171147522",
            "dpc": "03043600701",
            "name": "ហឿន សំរិទ្ធ"
        },
        {
            "barcode": "171147523",
            "dpc": "03043600801",
            "name": "អ៊ឹង សុខុម"
        },
        {
            "barcode": "171147524",
            "dpc": "03043600901",
            "name": "អ៊ី សីហា"
        },
        {
            "barcode": "171147525",
            "dpc": "03043601001",
            "name": "ទាវ លក្ខីណា"
        },
        {
            "barcode": "171147526",
            "dpc": "03043601101",
            "name": "ទ៉ុត សារ៉ាន់"
        },
        {
            "barcode": "171147527",
            "dpc": "03043601201",
            "name": "ឃុត ពៅ"
        },
        {
            "barcode": "171147528",
            "dpc": "03043601301",
            "name": "ទូច ហេង"
        },
        {
            "barcode": "171147529",
            "dpc": "03043601401",
            "name": "សាលាបឋមសិក្សា វត្តគរ"
        },
        {
            "barcode": "171147530",
            "dpc": "03043601501",
            "name": "ម៉ុក យ៉ុន"
        },
        {
            "barcode": "171147531",
            "dpc": "03043601601",
            "name": "ភោគ វង្ស"
        },
        {
            "barcode": "171147532",
            "dpc": "03043601701",
            "name": "ឈន ចិត្រា"
        },
        {
            "barcode": "171147533",
            "dpc": "03043601801",
            "name": "សៅ សុចិត្រ"
        },
        {
            "barcode": "171147534",
            "dpc": "03043602101",
            "name": "ភួង សា"
        },
        {
            "barcode": "171147535",
            "dpc": "03043602201",
            "name": "ផាន់ ពន្លឺ"
        },
        {
            "barcode": "171147536",
            "dpc": "03043602301",
            "name": "ម៉ុល ឌន"
        },
        {
            "barcode": "171147537",
            "dpc": "03043602401",
            "name": "ហុង ឈឿន"
        },
        {
            "barcode": "171147538",
            "dpc": "03043602501",
            "name": "ឆៃ ង៉ា"
        },
        {
            "barcode": "171147539",
            "dpc": "03043602601",
            "name": "អោ សំង៉ា"
        },
        {
            "barcode": "171147540",
            "dpc": "03043602701",
            "name": "មឿន ស៊ីថា"
        },
        {
            "barcode": "171147541",
            "dpc": "03043602801",
            "name": "រស់ សុនាថ"
        },
        {
            "barcode": "171147542",
            "dpc": "03043602901",
            "name": "នូ ចិន្តា"
        },
        {
            "barcode": "171147543",
            "dpc": "03043603001",
            "name": "កែវ ធានី"
        },
        {
            "barcode": "171147544",
            "dpc": "03043603101",
            "name": "រ៉ុង សុភ័ក្រ"
        },
        {
            "barcode": "171147545",
            "dpc": "03043603201",
            "name": "លាង តុលា"
        },
        {
            "barcode": "171147546",
            "dpc": "03043603301",
            "name": "លាង សុខហៃ"
        },
        {
            "barcode": "171147547",
            "dpc": "03043603401",
            "name": "សារ៉ាឌី"
        },
        {
            "barcode": "171147548",
            "dpc": "03043603501",
            "name": "ឌិម សារិន"
        },
        {
            "barcode": "171147549",
            "dpc": "03043603601",
            "name": "លី វ៉ាន់ណូ"
        },
        {
            "barcode": "171147550",
            "dpc": "03043603701",
            "name": "ប៊ុន ចានមុន្មី"
        },
        {
            "barcode": "171147551",
            "dpc": "03043603801",
            "name": "អ៊ុត នាង"
        },
        {
            "barcode": "171147552",
            "dpc": "03043603901",
            "name": "យិន សុខុម"
        },
        {
            "barcode": "171147553",
            "dpc": "03043604001",
            "name": "សំអុន ធារិទ្ធ"
        },
        {
            "barcode": "171147554",
            "dpc": "03043604101",
            "name": "ធូ ចន្ថា"
        },
        {
            "barcode": "171147555",
            "dpc": "03043604201",
            "name": "ង៉ែត វ៉ែន"
        },
        {
            "barcode": "171147556",
            "dpc": "03043604301",
            "name": "ជៀម សាវឿន"
        },
        {
            "barcode": "171147557",
            "dpc": "03043604401",
            "name": "ប្រុក រី"
        },
        {
            "barcode": "171147558",
            "dpc": "03043604501",
            "name": "ធ្យូង ទូច"
        },
        {
            "barcode": "171147559",
            "dpc": "03043604601",
            "name": "ឡេង សុផល្លី"
        },
        {
            "barcode": "171147560",
            "dpc": "03043604701",
            "name": "ចិន ឆន"
        },
        {
            "barcode": "171147561",
            "dpc": "03043604901",
            "name": "ថេង សុធៀន"
        },
        {
            "barcode": "171147562",
            "dpc": "03043605001",
            "name": "ចេង ម៉ៅ"
        },
        {
            "barcode": "171147563",
            "dpc": "03043605201",
            "name": "វ៉ាន់ ថន"
        },
        {
            "barcode": "171147564",
            "dpc": "03043605301",
            "name": "វណ្ណ ឌី"
        },
        {
            "barcode": "171147565",
            "dpc": "03043605401",
            "name": "គីម ស៊ីវ៉ុង"
        },
        {
            "barcode": "171147566",
            "dpc": "03043605501",
            "name": "នៅ សុវណ្ណីមុនី"
        },
        {
            "barcode": "171147567",
            "dpc": "03043605601",
            "name": "ស៊ីវ ថាច"
        },
        {
            "barcode": "171147568",
            "dpc": "03043605701",
            "name": "ញ៉ែម កេត"
        },
        {
            "barcode": "171147569",
            "dpc": "03043605901",
            "name": "សៅ ដេន"
        },
        {
            "barcode": "171147570",
            "dpc": "03043606001",
            "name": "គីម កុសល់"
        },
        {
            "barcode": "171147571",
            "dpc": "03043606101",
            "name": "លី អ៊ន"
        },
        {
            "barcode": "171147572",
            "dpc": "03043606301",
            "name": "យិន ទី"
        },
        {
            "barcode": "171147573",
            "dpc": "03043606501",
            "name": "លឹម ប៊ុនឈៀង"
        },
        {
            "barcode": "171147574",
            "dpc": "03043606601",
            "name": "ប៉ុល សាវុធ"
        },
        {
            "barcode": "171147575",
            "dpc": "03043606701",
            "name": "ជា លក្ខិណា"
        },
        {
            "barcode": "171147576",
            "dpc": "03043606801",
            "name": "ស្រី សម្បត្តិ"
        },
        {
            "barcode": "171147577",
            "dpc": "03043606901",
            "name": "ប៉ែន ធុច"
        },
        {
            "barcode": "171147578",
            "dpc": "03043607001",
            "name": "វ៉ា គន្ធា"
        },
        {
            "barcode": "171147579",
            "dpc": "03043607101",
            "name": "ហៀង ដារ៉ាវុទ្ធ"
        },
        {
            "barcode": "171147580",
            "dpc": "03043607201",
            "name": "សែម ផល្លី"
        },
        {
            "barcode": "171147581",
            "dpc": "03043607301",
            "name": "សេង លី"
        },
        {
            "barcode": "171147582",
            "dpc": "03043607401",
            "name": "ប្រម រដ្ឋា"
        },
        {
            "barcode": "171147583",
            "dpc": "03043607501",
            "name": "អ៊ឹង ឈុនទ្រី"
        },
        {
            "barcode": "171147584",
            "dpc": "03043607701",
            "name": "សុខ សេរីឃីម ២"
        },
        {
            "barcode": "171147585",
            "dpc": "03043607801",
            "name": "ប៉ាវ សៀ"
        },
        {
            "barcode": "171147586",
            "dpc": "03043607901",
            "name": "ឈឹម សារេត"
        },
        {
            "barcode": "171147587",
            "dpc": "03043608001",
            "name": "ឈឿម ឈិន"
        },
        {
            "barcode": "171147588",
            "dpc": "03043608101",
            "name": "ឈឿម ឈាលី"
        },
        {
            "barcode": "171147589",
            "dpc": "03043608201",
            "name": "ម៉ៅ វ៉ាន់"
        },
        {
            "barcode": "171147590",
            "dpc": "03043608301",
            "name": "ភោគ សំអ៊ុន"
        },
        {
            "barcode": "171147591",
            "dpc": "03043608401",
            "name": "ផន ផៃ"
        },
        {
            "barcode": "171147592",
            "dpc": "03043608501",
            "name": "តាំង ចាន់ធី"
        },
        {
            "barcode": "171147593",
            "dpc": "03043608601",
            "name": "លឿម ម៉ៃ"
        },
        {
            "barcode": "171147594",
            "dpc": "03043608701",
            "name": "ចន រចនា"
        },
        {
            "barcode": "171147595",
            "dpc": "03043608801",
            "name": "ឆាត ង៉ា"
        },
        {
            "barcode": "171147596",
            "dpc": "03043608901",
            "name": "ភុំ ភៀង"
        },
        {
            "barcode": "171147597",
            "dpc": "03043609001",
            "name": "ប៉ិច ឆាត"
        },
        {
            "barcode": "171147598",
            "dpc": "03043609101",
            "name": "ឈិន សាមឿន"
        },
        {
            "barcode": "171147599",
            "dpc": "03043609201",
            "name": "ញិប វុទ្ធី"
        },
        {
            "barcode": "171147600",
            "dpc": "03043609401",
            "name": "ភី ណារី"
        },
        {
            "barcode": "171147601",
            "dpc": "03043609501",
            "name": "ភុំ លាភ"
        },
        {
            "barcode": "171147602",
            "dpc": "03043609601",
            "name": "ហ៊ូ ហេង"
        },
        {
            "barcode": "171147603",
            "dpc": "03043609701",
            "name": "ចាប សៀន"
        },
        {
            "barcode": "171147604",
            "dpc": "03043609801",
            "name": "រស់ ស្រីមុំ"
        },
        {
            "barcode": "171147605",
            "dpc": "03043609901",
            "name": "ផេង សុវណ្ណា"
        },
        {
            "barcode": "171147606",
            "dpc": "03043610001",
            "name": "សែម រុន"
        },
        {
            "barcode": "171147607",
            "dpc": "03043610101",
            "name": "រស់ ហ៊ីម"
        },
        {
            "barcode": "171147608",
            "dpc": "03043610201",
            "name": "ប៉ិ ឆួត"
        },
        {
            "barcode": "171147609",
            "dpc": "03043610301",
            "name": "សុខ រើន"
        },
        {
            "barcode": "171147610",
            "dpc": "03043610401",
            "name": "សឿន ហ៊ីង"
        },
        {
            "barcode": "171147611",
            "dpc": "03043610501",
            "name": "តេង ឆាវស៊ិញ"
        },
        {
            "barcode": "171147612",
            "dpc": "03043610601",
            "name": "លឿង លឿប"
        },
        {
            "barcode": "171147613",
            "dpc": "03043610701",
            "name": "លឿង ពៅ"
        },
        {
            "barcode": "171147614",
            "dpc": "03043610801",
            "name": "ពុន ស៊ីឡុង"
        },
        {
            "barcode": "171147615",
            "dpc": "03043610901",
            "name": "ឈៀង ចំរើន"
        },
        {
            "barcode": "171147616",
            "dpc": "03043611001",
            "name": "ម៉ៅ គន្ធា"
        },
        {
            "barcode": "171147617",
            "dpc": "03043611101",
            "name": "អ៊ូច សារៀង"
        },
        {
            "barcode": "171147618",
            "dpc": "03043611201",
            "name": "លឿម ប៉ក់"
        },
        {
            "barcode": "171147619",
            "dpc": "03043611301",
            "name": "យោគ ធី"
        },
        {
            "barcode": "171147620",
            "dpc": "03043611401",
            "name": "ទូច សាវឿត"
        },
        {
            "barcode": "171147621",
            "dpc": "03043611501",
            "name": "ទូច កែវ"
        },
        {
            "barcode": "171147622",
            "dpc": "03043611601",
            "name": "សុខ សាន្ត"
        },
        {
            "barcode": "171147623",
            "dpc": "03043611701",
            "name": "ឈួន ខឿន"
        },
        {
            "barcode": "171147624",
            "dpc": "03043611801",
            "name": "ប៉ែន ខឿង១"
        },
        {
            "barcode": "171147625",
            "dpc": "03043611901",
            "name": "ប៉ែន ខឿង២"
        },
        {
            "barcode": "171147626",
            "dpc": "03043612001",
            "name": "លី ចាន់ថន"
        },
        {
            "barcode": "171147627",
            "dpc": "03043612101",
            "name": "លឿង សល់"
        },
        {
            "barcode": "171147628",
            "dpc": "03043612301",
            "name": "សោ សារិន"
        },
        {
            "barcode": "171147629",
            "dpc": "03043612501",
            "name": "ផន ភឿត២"
        },
        {
            "barcode": "171147630",
            "dpc": "03043612701",
            "name": "ឈីវ ស្រេង"
        },
        {
            "barcode": "171147631",
            "dpc": "03043612801",
            "name": "គីន ចំរ៉ុង"
        },
        {
            "barcode": "171147632",
            "dpc": "03043612901",
            "name": "ឆាំ សារឿត"
        },
        {
            "barcode": "171147633",
            "dpc": "03043613001",
            "name": "ណុប មករា"
        },
        {
            "barcode": "171147634",
            "dpc": "03043613101",
            "name": "ម៉ៅ សារ៉ាត់"
        },
        {
            "barcode": "171147635",
            "dpc": "03043613201",
            "name": "សេង សុខឡាង"
        },
        {
            "barcode": "171147636",
            "dpc": "03043613301",
            "name": "ឌឹម សំណាង"
        },
        {
            "barcode": "171147637",
            "dpc": "03043613401",
            "name": "សយ សារ៉ា"
        },
        {
            "barcode": "171147638",
            "dpc": "03043613501",
            "name": "យាន គន្ធា"
        },
        {
            "barcode": "171147639",
            "dpc": "03043613601",
            "name": "តុល ផន"
        },
        {
            "barcode": "171147640",
            "dpc": "03043613701",
            "name": "យាន ធី"
        },
        {
            "barcode": "171147641",
            "dpc": "03043613801",
            "name": "ភេត សុផុន"
        },
        {
            "barcode": "171147642",
            "dpc": "03043613901",
            "name": "គីម​ អ៊ី"
        },
        {
            "barcode": "171147643",
            "dpc": "03043614001",
            "name": "ពាង ឆលៀត"
        },
        {
            "barcode": "171147644",
            "dpc": "03043614101",
            "name": "តឿ តាឡាប់"
        },
        {
            "barcode": "171147645",
            "dpc": "03043614201",
            "name": "ងិន ពេញ"
        },
        {
            "barcode": "171147646",
            "dpc": "03043614301",
            "name": "សំ សុខហួន"
        },
        {
            "barcode": "171147647",
            "dpc": "03043614401",
            "name": "សិត ងួនហាក់"
        },
        {
            "barcode": "171147648",
            "dpc": "03043614501",
            "name": "យូ គីមហួន"
        },
        {
            "barcode": "171147649",
            "dpc": "03043614601",
            "name": "ម៉ា សុខអេង"
        },
        {
            "barcode": "171147650",
            "dpc": "03043614701",
            "name": "ឃិត ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171147651",
            "dpc": "03043614801",
            "name": "វង់ រដ្ខា"
        },
        {
            "barcode": "171147652",
            "dpc": "03043614901",
            "name": "រិនវណ្ណា"
        },
        {
            "barcode": "171147653",
            "dpc": "03043615001",
            "name": "ឡៅ កង"
        },
        {
            "barcode": "171147654",
            "dpc": "03043615101",
            "name": "កង ចាន់ធី"
        },
        {
            "barcode": "171147655",
            "dpc": "03043615301",
            "name": "សាន សិន"
        },
        {
            "barcode": "171147656",
            "dpc": "03043615401",
            "name": "ឡាំ វិញ"
        },
        {
            "barcode": "171147657",
            "dpc": "03043615501",
            "name": "ព្រំ វិបុល"
        },
        {
            "barcode": "171147658",
            "dpc": "03043615601",
            "name": "វណ្ណា"
        },
        {
            "barcode": "171147659",
            "dpc": "03043615801",
            "name": "ផែន សុធា"
        },
        {
            "barcode": "171147660",
            "dpc": "03043616001",
            "name": "ជា សុវណ្ណ"
        },
        {
            "barcode": "171147661",
            "dpc": "03043616101",
            "name": "ជា សេតថារី"
        },
        {
            "barcode": "171147662",
            "dpc": "03043616201",
            "name": "នួន បំរ៉ុង"
        },
        {
            "barcode": "171147663",
            "dpc": "03043616301",
            "name": "ឡុង ណាត"
        },
        {
            "barcode": "171147664",
            "dpc": "03043616401",
            "name": "នួន គីមស៊ត"
        },
        {
            "barcode": "171147665",
            "dpc": "03043616501",
            "name": "ហៃ តាវ"
        },
        {
            "barcode": "171147666",
            "dpc": "03043616601",
            "name": "នាល ភី"
        },
        {
            "barcode": "171147667",
            "dpc": "03043616701",
            "name": "សិន គន្ធា"
        },
        {
            "barcode": "171147668",
            "dpc": "03043616801",
            "name": "ម៉ៃ ចន្ថា"
        },
        {
            "barcode": "171147669",
            "dpc": "03043616901",
            "name": "ម៉ម ម៉ុត"
        },
        {
            "barcode": "171147670",
            "dpc": "03043617101",
            "name": "រស់ សុខឿន"
        },
        {
            "barcode": "171147671",
            "dpc": "03043617201",
            "name": "ភាព រតនា"
        },
        {
            "barcode": "171147672",
            "dpc": "03043617301",
            "name": "សឿ សាវ៉ុង"
        },
        {
            "barcode": "171147673",
            "dpc": "03043617401",
            "name": "ឃុត សាឡន"
        },
        {
            "barcode": "171147674",
            "dpc": "03043617501",
            "name": "ឡាច ឡុង"
        },
        {
            "barcode": "171147675",
            "dpc": "03043617601",
            "name": "នៅ នឿត"
        },
        {
            "barcode": "171147676",
            "dpc": "03043617701",
            "name": "ជឹង សុគន្ធ"
        },
        {
            "barcode": "171147677",
            "dpc": "03043617801",
            "name": "ពៅ ណាសៀ"
        },
        {
            "barcode": "171147678",
            "dpc": "03043617901",
            "name": "ចាន់ ម៉េង"
        },
        {
            "barcode": "171147679",
            "dpc": "03043618001",
            "name": "ជូ មុនី"
        },
        {
            "barcode": "171147680",
            "dpc": "03043618101",
            "name": "អៀប សាវ៊ើន"
        },
        {
            "barcode": "171147681",
            "dpc": "03043618201",
            "name": "អៀប សារ៉ាន់"
        },
        {
            "barcode": "171147682",
            "dpc": "03043618401",
            "name": "ឯក វណ្ណថុន"
        },
        {
            "barcode": "171147683",
            "dpc": "03043618501",
            "name": "វិន សាវឹង"
        },
        {
            "barcode": "171147684",
            "dpc": "03043618601",
            "name": "ម្លិះ គឹមបេង"
        },
        {
            "barcode": "171147685",
            "dpc": "03043618701",
            "name": "ហ៊ុន ហុក"
        },
        {
            "barcode": "171147686",
            "dpc": "03043618801",
            "name": "កែវ ប៊ុនធៀន"
        },
        {
            "barcode": "171147687",
            "dpc": "03043618901",
            "name": "សាំង ចន្ថា"
        },
        {
            "barcode": "171147688",
            "dpc": "03043619001",
            "name": "នង សារិទ្ធ"
        },
        {
            "barcode": "171147689",
            "dpc": "03043619101",
            "name": "វ៉ាត សុវណ្ណ"
        },
        {
            "barcode": "171147690",
            "dpc": "03043619201",
            "name": "ហាន ឆឺត"
        },
        {
            "barcode": "171147691",
            "dpc": "03043619301",
            "name": "ញណ ឈឿត"
        },
        {
            "barcode": "171147692",
            "dpc": "03043619401",
            "name": "ឡុង សាវី"
        },
        {
            "barcode": "171147693",
            "dpc": "03043619501",
            "name": "អូច សុខន"
        },
        {
            "barcode": "171147694",
            "dpc": "03043619601",
            "name": "ជុំ បណ្តូរ"
        },
        {
            "barcode": "171147695",
            "dpc": "03043619701",
            "name": "នូវ ឆេន"
        },
        {
            "barcode": "171147696",
            "dpc": "03043619901",
            "name": "បាន សល់"
        },
        {
            "barcode": "171147697",
            "dpc": "03043620001",
            "name": "ខ្វា សាយ"
        },
        {
            "barcode": "171147698",
            "dpc": "03043620101",
            "name": "សេន អេសអារី"
        },
        {
            "barcode": "171147699",
            "dpc": "03043620201",
            "name": "ប្រក ណារេត"
        },
        {
            "barcode": "171147700",
            "dpc": "03043620301",
            "name": "ហូត សម្ជស្ស"
        },
        {
            "barcode": "171147701",
            "dpc": "03043620401",
            "name": "ធី សារ៉េន"
        },
        {
            "barcode": "171147702",
            "dpc": "03043620501",
            "name": "ធាន កុយ"
        },
        {
            "barcode": "171147703",
            "dpc": "03043620601",
            "name": "សួ ខេង"
        },
        {
            "barcode": "171147704",
            "dpc": "03043620701",
            "name": "ប្រាក់ ម៉ាល័យ"
        },
        {
            "barcode": "171147705",
            "dpc": "03043620801",
            "name": "ជុំ ចាន់ហ៊ន"
        },
        {
            "barcode": "171147706",
            "dpc": "03043620901",
            "name": "ចាន់ សុភាព"
        },
        {
            "barcode": "171147707",
            "dpc": "03043621001",
            "name": "តាន់ សឺឡាង"
        },
        {
            "barcode": "171147708",
            "dpc": "03043621101",
            "name": "ចាន់ ឈឹមសុវណ្ណរិទ្ធ"
        },
        {
            "barcode": "171147709",
            "dpc": "03043621201",
            "name": "ស៊ុត រ៉ូន"
        },
        {
            "barcode": "171147710",
            "dpc": "03043621301",
            "name": "សែម ខុំ"
        },
        {
            "barcode": "171147711",
            "dpc": "03043621401",
            "name": "សួន ចិន្តា"
        },
        {
            "barcode": "171147712",
            "dpc": "03043621501",
            "name": "ហួត គឿន"
        },
        {
            "barcode": "171147713",
            "dpc": "03043621601",
            "name": "រ៉ុង ដារ៉ា"
        },
        {
            "barcode": "171147714",
            "dpc": "03043621701",
            "name": "ឈឿន ឈៀត"
        },
        {
            "barcode": "171147715",
            "dpc": "03043621801",
            "name": "ឈឹម សុធា"
        },
        {
            "barcode": "171147716",
            "dpc": "03043621901",
            "name": "ឈឹម សុភា"
        },
        {
            "barcode": "171147717",
            "dpc": "03043622001",
            "name": "សារួន"
        },
        {
            "barcode": "171147718",
            "dpc": "03043622101",
            "name": "កែន សារ៉ុន"
        },
        {
            "barcode": "171147719",
            "dpc": "03043622201",
            "name": "មិត្ត សាខន"
        },
        {
            "barcode": "171147720",
            "dpc": "03043622301",
            "name": "វិន រស់"
        },
        {
            "barcode": "171147721",
            "dpc": "03043622401",
            "name": "អ៊ី សុផល"
        },
        {
            "barcode": "171147722",
            "dpc": "03043622601",
            "name": "ធៀន សុធា"
        },
        {
            "barcode": "171147723",
            "dpc": "03043622701",
            "name": "ហ្វារ៉ុម មីយ៉ាន"
        },
        {
            "barcode": "171147724",
            "dpc": "03043622801",
            "name": "ឡោះ ហ៊ឺ"
        },
        {
            "barcode": "171147725",
            "dpc": "03043622901",
            "name": "ឡោះ យ៉ាន"
        },
        {
            "barcode": "171147726",
            "dpc": "03043623001",
            "name": "ដារី"
        },
        {
            "barcode": "171147727",
            "dpc": "03043623101",
            "name": "ម៉ាន សារី"
        },
        {
            "barcode": "171147728",
            "dpc": "03043623201",
            "name": "ឯល សារីវាន់ហ៊្សេន"
        },
        {
            "barcode": "171147729",
            "dpc": "03043623301",
            "name": "ផែ សុគុម"
        },
        {
            "barcode": "171147730",
            "dpc": "03043623401",
            "name": "សិម សារីយ៉ាស់"
        },
        {
            "barcode": "171147731",
            "dpc": "03043623501",
            "name": "យ៉ាន់ ណូ"
        },
        {
            "barcode": "171147732",
            "dpc": "03043623601",
            "name": "កាន់ ផារិ"
        },
        {
            "barcode": "171147733",
            "dpc": "03043623701",
            "name": "ញ៉ុក សុខា"
        },
        {
            "barcode": "171147734",
            "dpc": "03043623801",
            "name": "សាលាឃុំ នរា"
        },
        {
            "barcode": "171147735",
            "dpc": "03043623901",
            "name": "រុន សារី"
        },
        {
            "barcode": "171147736",
            "dpc": "03043624001",
            "name": "ហុង ស្រេង"
        },
        {
            "barcode": "171147737",
            "dpc": "03043624101",
            "name": "រេន សុខារ៉ា"
        },
        {
            "barcode": "171147738",
            "dpc": "03043624201",
            "name": "ស៊ុម សុគន្ធ"
        },
        {
            "barcode": "171147739",
            "dpc": "03043624301",
            "name": "ឡុច រស្មី"
        },
        {
            "barcode": "171147740",
            "dpc": "03043624401",
            "name": "ឡាច រដ្ឋ"
        },
        {
            "barcode": "171147741",
            "dpc": "03043624501",
            "name": "លី ម៉ាន់"
        },
        {
            "barcode": "171147742",
            "dpc": "03043624601",
            "name": "អ៊ិត ធីតា"
        },
        {
            "barcode": "171147743",
            "dpc": "03043624701",
            "name": "ទែន រស្មី"
        },
        {
            "barcode": "171147744",
            "dpc": "03043624801",
            "name": "សៅរ សម្បូណ៍"
        },
        {
            "barcode": "171147745",
            "dpc": "03043624901",
            "name": "ប៉ិល ថនស៊ី"
        },
        {
            "barcode": "171147746",
            "dpc": "03043625001",
            "name": "កង សុខា"
        },
        {
            "barcode": "171147747",
            "dpc": "03043625101",
            "name": "កង សុធា"
        },
        {
            "barcode": "171147748",
            "dpc": "03043625201",
            "name": "រិទ្ធ សួម"
        },
        {
            "barcode": "171147749",
            "dpc": "03043625301",
            "name": "ហេង ប៉ិច"
        },
        {
            "barcode": "171147750",
            "dpc": "03043625401",
            "name": "រី រ៉ូន"
        },
        {
            "barcode": "171147751",
            "dpc": "03043625501",
            "name": "អេ ភាព"
        },
        {
            "barcode": "171147752",
            "dpc": "03043625601",
            "name": "ពត ភាព"
        },
        {
            "barcode": "171147753",
            "dpc": "03043625701",
            "name": "ហែម ភីរម្យ"
        },
        {
            "barcode": "171147754",
            "dpc": "03043625801",
            "name": "អឿន រី"
        },
        {
            "barcode": "171147755",
            "dpc": "03043625901",
            "name": "ញាំ សាវេត"
        },
        {
            "barcode": "171147756",
            "dpc": "03043626001",
            "name": "ថាំង សុផា"
        },
        {
            "barcode": "171147757",
            "dpc": "03043626101",
            "name": "ជន គ្រី"
        },
        {
            "barcode": "171147758",
            "dpc": "03043626201",
            "name": "ជន សារ៉េត"
        },
        {
            "barcode": "171147759",
            "dpc": "03043626301",
            "name": "ជន សារេន"
        },
        {
            "barcode": "171147760",
            "dpc": "03043626401",
            "name": "ផាន សំអុល"
        },
        {
            "barcode": "171147761",
            "dpc": "03043626501",
            "name": "ឌុក វន"
        },
        {
            "barcode": "171147762",
            "dpc": "03043626701",
            "name": "សួន ពៅ"
        },
        {
            "barcode": "171147763",
            "dpc": "03043626801",
            "name": "កុប តុលា"
        },
        {
            "barcode": "171147764",
            "dpc": "03043626901",
            "name": "ឈិន ចន្ថា"
        },
        {
            "barcode": "171147765",
            "dpc": "03043627001",
            "name": "សុខ ប៊ុនដារ៉ា"
        },
        {
            "barcode": "171147766",
            "dpc": "03043627101",
            "name": "រឿម សាវៃ"
        },
        {
            "barcode": "171147767",
            "dpc": "03043627301",
            "name": "អ៊ុយ ហួន"
        },
        {
            "barcode": "171147768",
            "dpc": "03043627401",
            "name": "នីន សោភ័ណ្ឌ"
        },
        {
            "barcode": "171147769",
            "dpc": "03043627501",
            "name": "វិន វន"
        },
        {
            "barcode": "171147770",
            "dpc": "03043627601",
            "name": "សូ ជា"
        },
        {
            "barcode": "171147771",
            "dpc": "03043627701",
            "name": "រិទ្ធ បុណ្ណា"
        },
        {
            "barcode": "171147772",
            "dpc": "03043627801",
            "name": "ជា សុផល"
        },
        {
            "barcode": "171147773",
            "dpc": "03043627901",
            "name": "វ៉ាន់ សម្បត្តិ"
        },
        {
            "barcode": "171147774",
            "dpc": "03043628001",
            "name": "ឡី តង"
        },
        {
            "barcode": "171147775",
            "dpc": "03043628101",
            "name": "គីម សេង"
        },
        {
            "barcode": "171147776",
            "dpc": "03043628201",
            "name": "អែម សុខា"
        },
        {
            "barcode": "171147777",
            "dpc": "03043628401",
            "name": "រេត រឿម"
        },
        {
            "barcode": "171147778",
            "dpc": "03043628501",
            "name": "លុយ សុវណ្ណ"
        },
        {
            "barcode": "171147779",
            "dpc": "03043628601",
            "name": "សរ ណាវី"
        },
        {
            "barcode": "171147780",
            "dpc": "03043628701",
            "name": "រស់ សេងហុង"
        },
        {
            "barcode": "171147781",
            "dpc": "03043628801",
            "name": "តេង វឿត"
        },
        {
            "barcode": "171147782",
            "dpc": "03043628901",
            "name": "អ៊ុត ឡាវ"
        },
        {
            "barcode": "171147783",
            "dpc": "03043629001",
            "name": "ផាន ម៉ាលី"
        },
        {
            "barcode": "171147784",
            "dpc": "03043629101",
            "name": "ទេព ស៊ឹម"
        },
        {
            "barcode": "171147785",
            "dpc": "03043629301",
            "name": "មៀច ចំរើន"
        },
        {
            "barcode": "171147786",
            "dpc": "03043629401",
            "name": "កែវ ឡឹក"
        },
        {
            "barcode": "171147787",
            "dpc": "03043629501",
            "name": "អ៊ឹង ផល្គុន"
        },
        {
            "barcode": "171147788",
            "dpc": "03043629601",
            "name": "ហុក វុទ្ធី"
        },
        {
            "barcode": "171147789",
            "dpc": "03043629701",
            "name": "ស៊ីវន ខេមរុន"
        },
        {
            "barcode": "171147790",
            "dpc": "03043629801",
            "name": "ជូន សុភាព"
        },
        {
            "barcode": "171147791",
            "dpc": "03043629901",
            "name": "ឡម គង់"
        },
        {
            "barcode": "171147792",
            "dpc": "03043630001",
            "name": "យឿម ដារ៉ា"
        },
        {
            "barcode": "171147793",
            "dpc": "03043630101",
            "name": "បឿន ភាព"
        },
        {
            "barcode": "171147794",
            "dpc": "03043630201",
            "name": "ស៊ន​ លី"
        },
        {
            "barcode": "171147795",
            "dpc": "03043630301",
            "name": "ឯល ដា"
        },
        {
            "barcode": "171147796",
            "dpc": "03043630401",
            "name": "រៀប សារៀង"
        },
        {
            "barcode": "171147797",
            "dpc": "03043630501",
            "name": "លួម ណារី"
        },
        {
            "barcode": "171147798",
            "dpc": "03043630601",
            "name": "នឿន រិទ្ជ"
        },
        {
            "barcode": "171147799",
            "dpc": "03043630701",
            "name": "យឺន បុប្ឋា"
        },
        {
            "barcode": "171147800",
            "dpc": "03043631001",
            "name": "ឃីន សឿន"
        },
        {
            "barcode": "171147801",
            "dpc": "03043631201",
            "name": "ប៉ាល សុភឿត"
        },
        {
            "barcode": "171147802",
            "dpc": "03043631301",
            "name": "អិន វីរ៉ា"
        },
        {
            "barcode": "171147803",
            "dpc": "03043631401",
            "name": "យើ មាន"
        },
        {
            "barcode": "171147804",
            "dpc": "03043631501",
            "name": "ហែម សារ៉ន"
        },
        {
            "barcode": "171147805",
            "dpc": "03043631601",
            "name": "វ៉ាន់ នៅ"
        },
        {
            "barcode": "171147806",
            "dpc": "03043631801",
            "name": "នេត វណ្ណៈ"
        },
        {
            "barcode": "171147807",
            "dpc": "03043631901",
            "name": "ង៉ោល សឿង"
        },
        {
            "barcode": "171147808",
            "dpc": "03043632001",
            "name": "អីវ ឡុញ"
        },
        {
            "barcode": "171147809",
            "dpc": "03043632101",
            "name": "ចេក លួង"
        },
        {
            "barcode": "171147810",
            "dpc": "03043632201",
            "name": "សុខ ឡេង"
        },
        {
            "barcode": "171147811",
            "dpc": "03043632301",
            "name": "សេង បូទុំ"
        },
        {
            "barcode": "171147812",
            "dpc": "03043632401",
            "name": "មេត សុធី"
        },
        {
            "barcode": "171147813",
            "dpc": "03043632501",
            "name": "យី ជាល"
        },
        {
            "barcode": "171147814",
            "dpc": "03043632601",
            "name": "នន់ ណង់"
        },
        {
            "barcode": "171147815",
            "dpc": "03043632701",
            "name": "ឡង សារិទ្ធ"
        },
        {
            "barcode": "171147816",
            "dpc": "03043632801",
            "name": "ភិន ភេន"
        },
        {
            "barcode": "171147817",
            "dpc": "03043632901",
            "name": "មិត្ត តាំ"
        },
        {
            "barcode": "171147818",
            "dpc": "03043633001",
            "name": "ចែម ស៊ីនួន"
        },
        {
            "barcode": "171147819",
            "dpc": "03043633101",
            "name": "សុង សាយ"
        },
        {
            "barcode": "171147820",
            "dpc": "03043633201",
            "name": "ប៉ុល សុភា"
        },
        {
            "barcode": "171147821",
            "dpc": "03043633301",
            "name": "សែម សាវ៉ាត"
        },
        {
            "barcode": "171147822",
            "dpc": "03043633401",
            "name": "លឿង សុឃីម"
        },
        {
            "barcode": "171147823",
            "dpc": "03043633601",
            "name": "លិវ សារ៉ូ"
        },
        {
            "barcode": "171147824",
            "dpc": "03043633701",
            "name": "ម៉ៃ ភុ"
        },
        {
            "barcode": "171147825",
            "dpc": "03043633801",
            "name": "សិន ផល្លី"
        },
        {
            "barcode": "171147826",
            "dpc": "03043633901",
            "name": "អុំ ណាវុធ"
        },
        {
            "barcode": "171147827",
            "dpc": "03043634001",
            "name": "សឹង មុំ"
        },
        {
            "barcode": "171147828",
            "dpc": "03043634101",
            "name": "ចាយ​ ពៅ"
        },
        {
            "barcode": "171147829",
            "dpc": "03043634201",
            "name": "ចាន់ សុភី"
        },
        {
            "barcode": "171147830",
            "dpc": "03043634301",
            "name": "ធី ចាន់ភា"
        },
        {
            "barcode": "171147831",
            "dpc": "03043634401",
            "name": "សុគន្ធ ណារី"
        },
        {
            "barcode": "171147832",
            "dpc": "03043634601",
            "name": "ជា ផល្លី"
        },
        {
            "barcode": "171147833",
            "dpc": "03043634701",
            "name": "ឌិប រ៉ាវុធ"
        },
        {
            "barcode": "171147834",
            "dpc": "03043634801",
            "name": "ឌិប សាតុន"
        },
        {
            "barcode": "171147835",
            "dpc": "03043634901",
            "name": "សួស ផល្លី"
        },
        {
            "barcode": "171147836",
            "dpc": "03043635001",
            "name": "សាំង សំអ៊ុល"
        },
        {
            "barcode": "171147837",
            "dpc": "03043635101",
            "name": "ស្រី ម៉ៅ"
        },
        {
            "barcode": "171147838",
            "dpc": "03043635301",
            "name": "ហែម នីម"
        },
        {
            "barcode": "171147839",
            "dpc": "03043635401",
            "name": "ឈុន ប៊ុនសុវណ្ណ"
        },
        {
            "barcode": "171147840",
            "dpc": "03043635501",
            "name": "ណែត"
        },
        {
            "barcode": "171147841",
            "dpc": "03043635601",
            "name": "តាម វៃ២"
        },
        {
            "barcode": "171147842",
            "dpc": "03043635701",
            "name": "ម៉ុត សួន"
        },
        {
            "barcode": "171147843",
            "dpc": "03043635801",
            "name": "មាស ផល្លា"
        },
        {
            "barcode": "171147844",
            "dpc": "03043636001",
            "name": "អ៊ុយ យូន"
        },
        {
            "barcode": "171147845",
            "dpc": "03043636101",
            "name": "ស្រី ចន្ធូ"
        },
        {
            "barcode": "171147846",
            "dpc": "03043636201",
            "name": "ស្រី ចិន្តា"
        },
        {
            "barcode": "171147847",
            "dpc": "03043636301",
            "name": "ថោង ចន្ថា"
        },
        {
            "barcode": "171147848",
            "dpc": "03043636401",
            "name": "អ៊ុក បួន"
        },
        {
            "barcode": "171147849",
            "dpc": "03043636501",
            "name": "កូវ សាវ៉ន"
        },
        {
            "barcode": "171147850",
            "dpc": "03043636601",
            "name": "មួន សរិទ្ធ"
        },
        {
            "barcode": "171147851",
            "dpc": "03043636701",
            "name": "ហង្ស ហេង"
        },
        {
            "barcode": "171147852",
            "dpc": "03043636801",
            "name": "ភួង ស៊ីយ៉ុន"
        },
        {
            "barcode": "171147853",
            "dpc": "03043636901",
            "name": "ជិន យឿន"
        },
        {
            "barcode": "171147854",
            "dpc": "03043637001",
            "name": "អុំ លន់អេង"
        },
        {
            "barcode": "171147855",
            "dpc": "03043637101",
            "name": "អុំ រ៉ា"
        },
        {
            "barcode": "171147856",
            "dpc": "03043637201",
            "name": "ម៉ម សំណាង"
        },
        {
            "barcode": "171147857",
            "dpc": "03043637301",
            "name": "នៅ សុធា"
        },
        {
            "barcode": "171147858",
            "dpc": "03043637501",
            "name": "ណុប សាមិ"
        },
        {
            "barcode": "171147859",
            "dpc": "03043637601",
            "name": "គង់ ឡេង"
        },
        {
            "barcode": "171147860",
            "dpc": "03043637701",
            "name": "ម៉ារិន ឧត្តមឆៃ"
        },
        {
            "barcode": "171147861",
            "dpc": "03043637801",
            "name": "សុះ មីន"
        },
        {
            "barcode": "171147862",
            "dpc": "03043637901",
            "name": "ស្រី សោភណ័្ឌ"
        },
        {
            "barcode": "171147863",
            "dpc": "03043638001",
            "name": "ជិន ឆន"
        },
        {
            "barcode": "171147864",
            "dpc": "03043638101",
            "name": "ថោ ចាន់ណា"
        },
        {
            "barcode": "171147865",
            "dpc": "03043638201",
            "name": "ស៊ុន ទូច"
        },
        {
            "barcode": "171147866",
            "dpc": "03043638301",
            "name": "ម៉ី ឡុញ"
        },
        {
            "barcode": "171147867",
            "dpc": "03043638401",
            "name": "កាន់ ទ្រី"
        },
        {
            "barcode": "171147868",
            "dpc": "03043638501",
            "name": "គីម វ៉ាន់"
        },
        {
            "barcode": "171147869",
            "dpc": "03043638701",
            "name": "កែវ ចន្ថា"
        },
        {
            "barcode": "171147870",
            "dpc": "03043638801",
            "name": "កែវ នេត"
        },
        {
            "barcode": "171147871",
            "dpc": "03043638901",
            "name": "ជា សុមាលី"
        },
        {
            "barcode": "171147872",
            "dpc": "03043639001",
            "name": "អែម ពុធថា"
        },
        {
            "barcode": "171147873",
            "dpc": "03043639101",
            "name": "ខុន សុខេន"
        },
        {
            "barcode": "171147874",
            "dpc": "03043639201",
            "name": "ចាន់ សុមាលី"
        },
        {
            "barcode": "171147875",
            "dpc": "03043639301",
            "name": "ម៉ុន ម៉ុត"
        },
        {
            "barcode": "171147876",
            "dpc": "03043639401",
            "name": "ថោង រី"
        },
        {
            "barcode": "171147877",
            "dpc": "03043639501",
            "name": "ពុំ វណ្ណរ័ត្ន"
        },
        {
            "barcode": "171147878",
            "dpc": "03043639601",
            "name": "រិន រចនា"
        },
        {
            "barcode": "171147879",
            "dpc": "03043639701",
            "name": "ផាត់ ផារិម"
        },
        {
            "barcode": "171147880",
            "dpc": "03043639801",
            "name": "សៀង អូន"
        },
        {
            "barcode": "171147881",
            "dpc": "03043639901",
            "name": "ងិន ភន"
        },
        {
            "barcode": "171147882",
            "dpc": "03043640001",
            "name": "ទុំ ផាន់ណា"
        },
        {
            "barcode": "171147883",
            "dpc": "03043640101",
            "name": "ពឿន ធី"
        },
        {
            "barcode": "171147884",
            "dpc": "03043640201",
            "name": "ប្រឹង បី"
        },
        {
            "barcode": "171147885",
            "dpc": "03043640301",
            "name": "លន់ សុខុន"
        },
        {
            "barcode": "171147886",
            "dpc": "03043640401",
            "name": "ហ៊ីង សារឿន"
        },
        {
            "barcode": "171147887",
            "dpc": "03043640501",
            "name": "ក្រិច ឡុង"
        },
        {
            "barcode": "171147888",
            "dpc": "03043640601",
            "name": "ប្រាក់ ដារីន"
        },
        {
            "barcode": "171147889",
            "dpc": "03043640701",
            "name": "ផាន់ ផារី"
        },
        {
            "barcode": "171147890",
            "dpc": "03043640801",
            "name": "ចក់ យូវ"
        },
        {
            "barcode": "171147891",
            "dpc": "03043640901",
            "name": "រាជ យន់"
        },
        {
            "barcode": "171147892",
            "dpc": "03043641001",
            "name": "អ៊ួ សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171147893",
            "dpc": "03043641101",
            "name": "លន់ វ៉ា"
        },
        {
            "barcode": "171147894",
            "dpc": "03043641201",
            "name": "សៅ សុធា"
        },
        {
            "barcode": "171147895",
            "dpc": "03043641301",
            "name": "ប៉ិល សារិម"
        },
        {
            "barcode": "171147896",
            "dpc": "03043641401",
            "name": "ធុយ ធី"
        },
        {
            "barcode": "171147897",
            "dpc": "03043641501",
            "name": "លន់ សំណាង"
        },
        {
            "barcode": "171147898",
            "dpc": "03043641901",
            "name": "ម៉ាត់ ប៉ាកៀត"
        },
        {
            "barcode": "171147899",
            "dpc": "03043642001",
            "name": "ឡប សារ៉ាត់"
        },
        {
            "barcode": "171147900",
            "dpc": "03043642101",
            "name": "ប៊ុត ហុល"
        },
        {
            "barcode": "171147901",
            "dpc": "03043642201",
            "name": "តាត តឿម"
        },
        {
            "barcode": "171147902",
            "dpc": "03043642301",
            "name": "ឌុច ឌឿន"
        },
        {
            "barcode": "171147903",
            "dpc": "03043642401",
            "name": "ជីម សារ៉ាយ"
        },
        {
            "barcode": "171147904",
            "dpc": "03043642501",
            "name": "រិទ្ធ សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171147905",
            "dpc": "03043642601",
            "name": "អ៊ុក ធា"
        },
        {
            "barcode": "171147906",
            "dpc": "03043642701",
            "name": "ឡុច វ៉ាន"
        },
        {
            "barcode": "171147907",
            "dpc": "03043642801",
            "name": "ទេស ប៉ិច"
        },
        {
            "barcode": "171147908",
            "dpc": "03043642901",
            "name": "ហៃ គឹមហ៊ូ"
        },
        {
            "barcode": "171147909",
            "dpc": "03043643001",
            "name": "ទេស ពៅ"
        },
        {
            "barcode": "171147910",
            "dpc": "03043643101",
            "name": "ម៉ក់ ហឿម"
        },
        {
            "barcode": "171147911",
            "dpc": "03043643201",
            "name": "ការទ័រហ្វាស៊ី"
        },
        {
            "barcode": "171147912",
            "dpc": "03043643301",
            "name": "ម៉ាន ហាលី"
        },
        {
            "barcode": "171147913",
            "dpc": "03043643401",
            "name": "ស្មាន ហ្សារី"
        },
        {
            "barcode": "171147914",
            "dpc": "03043643501",
            "name": "លី ស៊ូគី"
        },
        {
            "barcode": "171147915",
            "dpc": "03043643601",
            "name": "កែវ យើ"
        },
        {
            "barcode": "171147916",
            "dpc": "03043643701",
            "name": "យួប ហាប់ស្រស់"
        },
        {
            "barcode": "171147917",
            "dpc": "03043643801",
            "name": "មីន ទីកាស់"
        },
        {
            "barcode": "171147918",
            "dpc": "03043643901",
            "name": "ឡឹប ខឡេស"
        },
        {
            "barcode": "171147919",
            "dpc": "03043644001",
            "name": "ម៉ាត់ សារីហាស់"
        },
        {
            "barcode": "171147920",
            "dpc": "03043644101",
            "name": "នី អាស់ម៉ាត់"
        },
        {
            "barcode": "171147921",
            "dpc": "03043644201",
            "name": "រស់ ម៉ារី"
        },
        {
            "barcode": "171147922",
            "dpc": "03043644301",
            "name": "ម៉ី ពោ"
        },
        {
            "barcode": "171147923",
            "dpc": "03043644401",
            "name": "ឡោះ ហាំ"
        },
        {
            "barcode": "171147924",
            "dpc": "03043644501",
            "name": "ម៉ាន សុខា"
        },
        {
            "barcode": "171147925",
            "dpc": "03043644601",
            "name": "រ៉ិត រ៉ូសេត"
        },
        {
            "barcode": "171147926",
            "dpc": "03043644701",
            "name": "នាក់ រ៉ូសេត"
        },
        {
            "barcode": "171147927",
            "dpc": "03043644801",
            "name": "សេន ស៊ូហ្វីយ៉ាន"
        },
        {
            "barcode": "171147928",
            "dpc": "03043644901",
            "name": "សេន ស្មារី"
        },
        {
            "barcode": "171147929",
            "dpc": "03043645001",
            "name": "តូន ហ្វាឌីឡាស់"
        },
        {
            "barcode": "171147930",
            "dpc": "03043645201",
            "name": "ម៉ិល ខុម"
        },
        {
            "barcode": "171147931",
            "dpc": "03043645301",
            "name": "សោះ អាពីឌះ"
        },
        {
            "barcode": "171147932",
            "dpc": "03043645401",
            "name": "យុន យីម"
        },
        {
            "barcode": "171147933",
            "dpc": "03043645501",
            "name": "កើ ម៉ាត់សេត"
        },
        {
            "barcode": "171147934",
            "dpc": "03043645601",
            "name": "ឃុត សុខុន"
        },
        {
            "barcode": "171147935",
            "dpc": "03043645701",
            "name": "សានិត វិសាល"
        },
        {
            "barcode": "171147936",
            "dpc": "03043645801",
            "name": "កែវ ហួយ"
        },
        {
            "barcode": "171147937",
            "dpc": "03043646001",
            "name": "រដ្ឋ ធានី"
        },
        {
            "barcode": "171147938",
            "dpc": "03043646101",
            "name": "គឹម ហ៊ួ"
        },
        {
            "barcode": "171147939",
            "dpc": "03043646201",
            "name": "ហ្ស៊ី ហ្គេ"
        },
        {
            "barcode": "171147940",
            "dpc": "03043646301",
            "name": "យ៉ម ពៅ"
        },
        {
            "barcode": "171147941",
            "dpc": "03043646401",
            "name": "យន់ គឹមយ៉ុន"
        },
        {
            "barcode": "171147942",
            "dpc": "03043646501",
            "name": "អ៊ឺង គឹមស៊ន"
        },
        {
            "barcode": "171147943",
            "dpc": "03043646601",
            "name": "រស់ ពៅ"
        },
        {
            "barcode": "171147944",
            "dpc": "03043646801",
            "name": "ចាន់ តុន"
        },
        {
            "barcode": "171147945",
            "dpc": "03043647101",
            "name": "ជា ប៊ុនលី"
        },
        {
            "barcode": "171147946",
            "dpc": "03043647201",
            "name": "យ៉ង សំនៀង"
        },
        {
            "barcode": "171147947",
            "dpc": "03043647301",
            "name": "យ៉ម សារិន"
        },
        {
            "barcode": "171147948",
            "dpc": "03043647401",
            "name": "ដាំ ឈឿយ"
        },
        {
            "barcode": "171147949",
            "dpc": "03043647501",
            "name": "វ៉ាន់ សុខា"
        },
        {
            "barcode": "171147950",
            "dpc": "03043647601",
            "name": "សោ ចំរើន"
        },
        {
            "barcode": "171147951",
            "dpc": "03043647701",
            "name": "ហូ សុខហេង"
        },
        {
            "barcode": "171147952",
            "dpc": "03043647901",
            "name": "សុខ លីន"
        },
        {
            "barcode": "171147953",
            "dpc": "03043648001",
            "name": "សម្បត្តិ រ៉ា"
        },
        {
            "barcode": "171147954",
            "dpc": "03043648101",
            "name": "គង់ សម្បត្តិ"
        },
        {
            "barcode": "171147955",
            "dpc": "03043648201",
            "name": "ហឹម ភឿត"
        },
        {
            "barcode": "171147956",
            "dpc": "03043648301",
            "name": "គង់ ចាន់ធី"
        },
        {
            "barcode": "171147957",
            "dpc": "03043648401",
            "name": "គង់ រ៉ាត់"
        },
        {
            "barcode": "171147958",
            "dpc": "03043648501",
            "name": "គង់ ចាន់ទី"
        },
        {
            "barcode": "171147959",
            "dpc": "03043648601",
            "name": "ខៀវ សុផាន"
        },
        {
            "barcode": "171147960",
            "dpc": "03043648701",
            "name": "ជូន ញឹប"
        },
        {
            "barcode": "171147961",
            "dpc": "03043648801",
            "name": "ពិន រឿត"
        },
        {
            "barcode": "171147962",
            "dpc": "03043648901",
            "name": "ពិន ព្រែក"
        },
        {
            "barcode": "171147963",
            "dpc": "03043649001",
            "name": "ស៊ិន រាត់"
        },
        {
            "barcode": "171147964",
            "dpc": "03043649201",
            "name": "ពិន វុធ"
        },
        {
            "barcode": "171147965",
            "dpc": "03043649301",
            "name": "ពិន ទួច"
        },
        {
            "barcode": "171147966",
            "dpc": "03043649401",
            "name": "យ៉ន សៅលី"
        },
        {
            "barcode": "171147967",
            "dpc": "03043649501",
            "name": "ខេម រៈ"
        },
        {
            "barcode": "171147968",
            "dpc": "03043649601",
            "name": "ពិន សាម៉ន"
        },
        {
            "barcode": "171147969",
            "dpc": "03043649801",
            "name": "ពិន ចាន់រី"
        },
        {
            "barcode": "171147970",
            "dpc": "03043650001",
            "name": "ណាវ អមរិណ"
        },
        {
            "barcode": "171147971",
            "dpc": "03043650101",
            "name": "ស៊ិន មុំ"
        },
        {
            "barcode": "171147972",
            "dpc": "03043650201",
            "name": "ចាន់ សាវី"
        },
        {
            "barcode": "171147973",
            "dpc": "03043650301",
            "name": "ឈុំ ភាន់"
        },
        {
            "barcode": "171147974",
            "dpc": "03043650401",
            "name": "សំ ចន្តិា"
        },
        {
            "barcode": "171147975",
            "dpc": "03043650501",
            "name": "ចាន់ នី"
        },
        {
            "barcode": "171147976",
            "dpc": "03043650601",
            "name": "នក់ សុភាន់"
        },
        {
            "barcode": "171147977",
            "dpc": "03043650701",
            "name": "រ៉ាយ ចិន្តា"
        },
        {
            "barcode": "171147978",
            "dpc": "03043650801",
            "name": "ប៉ា សុហេង"
        },
        {
            "barcode": "171147979",
            "dpc": "03043650901",
            "name": "សយ សារេម"
        },
        {
            "barcode": "171147980",
            "dpc": "03043651001",
            "name": "ប៉ន វិចិត្រ"
        },
        {
            "barcode": "171147981",
            "dpc": "03043651101",
            "name": "ប៉ន ស្រីឡុច"
        },
        {
            "barcode": "171147982",
            "dpc": "03043651201",
            "name": "ប៉ន សាវុន"
        },
        {
            "barcode": "171147983",
            "dpc": "03043651301",
            "name": "ងួន សុជាតា"
        },
        {
            "barcode": "171147984",
            "dpc": "03043651401",
            "name": "ប៉ន សុផានី"
        },
        {
            "barcode": "171147985",
            "dpc": "03043651501",
            "name": "ស្រូច ចាន់នី"
        },
        {
            "barcode": "171147986",
            "dpc": "03043651601",
            "name": "ស្រូច ចាន់ណា"
        },
        {
            "barcode": "171147987",
            "dpc": "03043651701",
            "name": "អុំ ធីម"
        },
        {
            "barcode": "171147988",
            "dpc": "03043651801",
            "name": "ឈឿម ម៉ារី"
        },
        {
            "barcode": "171147989",
            "dpc": "03043651901",
            "name": "ចាន់ រឿន"
        },
        {
            "barcode": "171147990",
            "dpc": "03043652001",
            "name": "ចាន់ សំណាង"
        },
        {
            "barcode": "171147991",
            "dpc": "03043652101",
            "name": "មុត ស៊ីណា"
        },
        {
            "barcode": "171147992",
            "dpc": "03043652201",
            "name": "កែវ សារៀន"
        },
        {
            "barcode": "171147993",
            "dpc": "03043652301",
            "name": "ង៉ា រៀង"
        },
        {
            "barcode": "171147994",
            "dpc": "03043652401",
            "name": "ញ៉ន គង្គា"
        },
        {
            "barcode": "171147995",
            "dpc": "03043652501",
            "name": "វុន វុទ្ធី"
        },
        {
            "barcode": "171147996",
            "dpc": "03043652601",
            "name": "ចាន់ រ៉ាត់"
        },
        {
            "barcode": "171147997",
            "dpc": "03043652701",
            "name": "ឈឿ សភាសិត"
        },
        {
            "barcode": "171147998",
            "dpc": "03043652901",
            "name": "ហេង ទ្រី"
        },
        {
            "barcode": "171147999",
            "dpc": "03043653001",
            "name": "យិន ប៉ុន"
        },
        {
            "barcode": "171148000",
            "dpc": "03043653101",
            "name": "ឆោម ឆន"
        },
        {
            "barcode": "171148001",
            "dpc": "03043653201",
            "name": "ហម ថង"
        },
        {
            "barcode": "171148002",
            "dpc": "03043653301",
            "name": "ភាជ ភឿត"
        },
        {
            "barcode": "171148003",
            "dpc": "03043653401",
            "name": "អៀង ណារិន"
        },
        {
            "barcode": "171148004",
            "dpc": "03043653501",
            "name": "សួង តារ៉ា"
        },
        {
            "barcode": "171148005",
            "dpc": "03043653601",
            "name": "ផិត ផាន់ណា"
        },
        {
            "barcode": "171148006",
            "dpc": "03043653701",
            "name": "ភាជ សំបូរ"
        },
        {
            "barcode": "171148007",
            "dpc": "03043653801",
            "name": "យឹម ស៊ាប"
        },
        {
            "barcode": "171148008",
            "dpc": "03043653901",
            "name": "យ៉ែម សាវី"
        },
        {
            "barcode": "171148009",
            "dpc": "03043654101",
            "name": "ណយ សុភី"
        },
        {
            "barcode": "171148010",
            "dpc": "03043654001",
            "name": "ណយ សាន់"
        },
        {
            "barcode": "171148011",
            "dpc": "03043654201",
            "name": "ញឹក សាវេត"
        },
        {
            "barcode": "171148012",
            "dpc": "03043654301",
            "name": "ហេង ចាន់រស់"
        },
        {
            "barcode": "171148013",
            "dpc": "03043654401",
            "name": "វ៉ាត ឆាត"
        },
        {
            "barcode": "171148014",
            "dpc": "03043654501",
            "name": "ស្រី សំអឿន"
        },
        {
            "barcode": "171148015",
            "dpc": "03043654601",
            "name": "ហ៊ឹម ហ៊ីង"
        },
        {
            "barcode": "171148016",
            "dpc": "03043654701",
            "name": "កោ សេរីវឌ្ឍន៍"
        },
        {
            "barcode": "171148017",
            "dpc": "03043654801",
            "name": "ឌិត ណូក"
        },
        {
            "barcode": "171148018",
            "dpc": "03043654901",
            "name": "ណ ណាល់"
        },
        {
            "barcode": "171148019",
            "dpc": "03043655001",
            "name": "មាស់ សឿត"
        },
        {
            "barcode": "171148020",
            "dpc": "03043655101",
            "name": "អ៊ិត សុផានី"
        },
        {
            "barcode": "171148021",
            "dpc": "03043655201",
            "name": "សោម សិលា"
        },
        {
            "barcode": "171148022",
            "dpc": "03043655301",
            "name": "អង វើន"
        },
        {
            "barcode": "171148023",
            "dpc": "03043655401",
            "name": "សេង សំអុល"
        },
        {
            "barcode": "171148024",
            "dpc": "03043655501",
            "name": "ផាន់ ពីសី"
        },
        {
            "barcode": "171148025",
            "dpc": "03043655601",
            "name": "ជិន រៀប"
        },
        {
            "barcode": "171148026",
            "dpc": "03043655701",
            "name": "ណ ណាវ"
        },
        {
            "barcode": "171148027",
            "dpc": "03043655801",
            "name": "ជិត រិន"
        },
        {
            "barcode": "171148028",
            "dpc": "03043655901",
            "name": "លន់ ម៉ាប់"
        },
        {
            "barcode": "171148029",
            "dpc": "03043656001",
            "name": "សុង ចាន់"
        },
        {
            "barcode": "171148030",
            "dpc": "03043656101",
            "name": "ជាតិ"
        },
        {
            "barcode": "171148031",
            "dpc": "03043656201",
            "name": "គង់ លក្ខិណា"
        },
        {
            "barcode": "171148032",
            "dpc": "03043656301",
            "name": "សេង ងយ"
        },
        {
            "barcode": "171148033",
            "dpc": "03043656501",
            "name": "គង់ ហេងងួន"
        },
        {
            "barcode": "171148034",
            "dpc": "03043656601",
            "name": "ឈឿម សភាព"
        },
        {
            "barcode": "171148035",
            "dpc": "03043656701",
            "name": "ឈិត ចាន់ថន"
        },
        {
            "barcode": "171148036",
            "dpc": "03043656801",
            "name": "រ៉ាវុធ អូលិវីយ៉េ"
        },
        {
            "barcode": "171148037",
            "dpc": "03043656901",
            "name": "រើន វុឌ្ឃី"
        },
        {
            "barcode": "171148038",
            "dpc": "03043657001",
            "name": "ពេទ្យ សាវិន"
        },
        {
            "barcode": "171148039",
            "dpc": "03043657101",
            "name": "ឆាយ សាវន"
        },
        {
            "barcode": "171148040",
            "dpc": "03043657201",
            "name": "ជួប វុតថា"
        },
        {
            "barcode": "171148041",
            "dpc": "03043657301",
            "name": "ឆូត ឆុង"
        },
        {
            "barcode": "171148042",
            "dpc": "03043657401",
            "name": "យី វិរៈ"
        },
        {
            "barcode": "171148043",
            "dpc": "03043657501",
            "name": "រិន គឹមលី"
        },
        {
            "barcode": "171148044",
            "dpc": "03043657601",
            "name": "រ៉ែម រ៉ាន់"
        },
        {
            "barcode": "171148045",
            "dpc": "03043657701",
            "name": "ឡាយ វន"
        },
        {
            "barcode": "171148046",
            "dpc": "03043657801",
            "name": "ទុយ ជា"
        },
        {
            "barcode": "171148047",
            "dpc": "03043657901",
            "name": "សំ ផាណន"
        },
        {
            "barcode": "171148048",
            "dpc": "03043658001",
            "name": "ជន សុភក្រ័"
        },
        {
            "barcode": "171148049",
            "dpc": "03043658101",
            "name": "ស្រឿ គឹមស៊ា"
        },
        {
            "barcode": "171148050",
            "dpc": "03043658201",
            "name": "ស្រឿ គឹមជួរ"
        },
        {
            "barcode": "171148051",
            "dpc": "03043658301",
            "name": "សន ស៊ីផាត"
        },
        {
            "barcode": "171148052",
            "dpc": "03043658501",
            "name": "ស៊ីន សុភ័ក្រ្ត"
        },
        {
            "barcode": "171148053",
            "dpc": "03043658601",
            "name": "ព្រឿង សារ៉ាន"
        },
        {
            "barcode": "171148054",
            "dpc": "03043658701",
            "name": "រ៉ាន់ រ៉ឿត"
        },
        {
            "barcode": "171148055",
            "dpc": "03043658801",
            "name": "គង់ ទូច"
        },
        {
            "barcode": "171148056",
            "dpc": "03043658901",
            "name": "គង់ ដាវីម៉ូណ៉ែត"
        },
        {
            "barcode": "171148057",
            "dpc": "03043659001",
            "name": "អ៊ឹង ឡេងហ៊ាង"
        },
        {
            "barcode": "171148058",
            "dpc": "03043659101",
            "name": "គង់ រតនៈសម្បត្តិ"
        },
        {
            "barcode": "171148059",
            "dpc": "03043659201",
            "name": "ប៊ុន សំនៀង"
        },
        {
            "barcode": "171148060",
            "dpc": "03043659301",
            "name": "គង់ សំណាង"
        },
        {
            "barcode": "171148061",
            "dpc": "03043659501",
            "name": "ជី តុងងួន"
        },
        {
            "barcode": "171148062",
            "dpc": "03043659701",
            "name": "ស្រ៊ីង រតនា"
        },
        {
            "barcode": "171148063",
            "dpc": "03043659801",
            "name": "គឹម ភឿន"
        },
        {
            "barcode": "171148064",
            "dpc": "03043659901",
            "name": "សួស សារឿន"
        },
        {
            "barcode": "171148065",
            "dpc": "03043660001",
            "name": "ហួយ ចិត្រា"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
