let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171134469",
            "dpc": "03023800101",
            "name": "ហ៊ឹម ម៉ានី"
        },
        {
            "barcode": "171134470",
            "dpc": "03023800201",
            "name": "សាន លី"
        },
        {
            "barcode": "171134471",
            "dpc": "03023800301",
            "name": "ម៉ក់ ម៉េងហុង"
        },
        {
            "barcode": "171134472",
            "dpc": "03023800401",
            "name": "ប៊ុត ចន្ធី"
        },
        {
            "barcode": "171134473",
            "dpc": "03023800601",
            "name": "ផាត់ ម៉ៅ"
        },
        {
            "barcode": "171134474",
            "dpc": "03023800701",
            "name": "ផាត រឿន"
        },
        {
            "barcode": "171134475",
            "dpc": "03023800801",
            "name": "អ៊ឹង ចាន់សុខា"
        },
        {
            "barcode": "171134476",
            "dpc": "03023800901",
            "name": "អ៊ាត ណារ៉ែន"
        },
        {
            "barcode": "171134477",
            "dpc": "03023801001",
            "name": "ហ៊ឹម ប៉េងគា"
        },
        {
            "barcode": "171134478",
            "dpc": "03023801101",
            "name": "ហុង ចានរី"
        },
        {
            "barcode": "171134479",
            "dpc": "03023801301",
            "name": "អ៊ឹម ឈត"
        },
        {
            "barcode": "171134480",
            "dpc": "03023801501",
            "name": "អន បូណា"
        },
        {
            "barcode": "171134481",
            "dpc": "03023801601",
            "name": "ហម រដ្ឋ"
        },
        {
            "barcode": "171134482",
            "dpc": "03023801701",
            "name": "ឡុញ សុវណ្ណ"
        },
        {
            "barcode": "171134483",
            "dpc": "03023801801",
            "name": "ហម លាង"
        },
        {
            "barcode": "171134484",
            "dpc": "03023801901",
            "name": "ហម សមរំ"
        },
        {
            "barcode": "171134485",
            "dpc": "03023802001",
            "name": "រើន សាវុធ"
        },
        {
            "barcode": "171134486",
            "dpc": "03023802101",
            "name": "រឿង មិត្ត"
        },
        {
            "barcode": "171134487",
            "dpc": "03023802201",
            "name": "កែវ លឿត"
        },
        {
            "barcode": "171134488",
            "dpc": "03023802401",
            "name": "សាំង ខាន់"
        },
        {
            "barcode": "171134489",
            "dpc": "03023802501",
            "name": "មី មៀច"
        },
        {
            "barcode": "171134490",
            "dpc": "03023802601",
            "name": "មៀច ប៊ុនរៀម"
        },
        {
            "barcode": "171134491",
            "dpc": "03023802701",
            "name": "ស៊ីម សាខន"
        },
        {
            "barcode": "171134492",
            "dpc": "03023802801",
            "name": "ផេង សុខហេង"
        },
        {
            "barcode": "171134493",
            "dpc": "03023802901",
            "name": "លី គឹមលីន"
        },
        {
            "barcode": "171134494",
            "dpc": "03023803001",
            "name": "ភឹម ថង"
        },
        {
            "barcode": "171134495",
            "dpc": "03023803301",
            "name": "ផុង ឆឹង"
        },
        {
            "barcode": "171134496",
            "dpc": "03023803501",
            "name": "អ៊ុក មន្ថា"
        },
        {
            "barcode": "171134497",
            "dpc": "03023803601",
            "name": "សាយ អួម"
        },
        {
            "barcode": "171134498",
            "dpc": "03023803701",
            "name": "លឹម នាង"
        },
        {
            "barcode": "171134499",
            "dpc": "03023803801",
            "name": "ហួត រី"
        },
        {
            "barcode": "171134500",
            "dpc": "03023803901",
            "name": "ស្រី សមសិទ្ធ"
        },
        {
            "barcode": "171134501",
            "dpc": "03023804201",
            "name": "ហាក់ លី"
        },
        {
            "barcode": "171134502",
            "dpc": "03023804301",
            "name": "សេង ថា"
        },
        {
            "barcode": "171134503",
            "dpc": "03023804401",
            "name": "យ៉ន ពៅ"
        },
        {
            "barcode": "171134504",
            "dpc": "03023804501",
            "name": "កូយ វិបុល"
        },
        {
            "barcode": "171134505",
            "dpc": "03023804601",
            "name": "លី វណ្ណា"
        },
        {
            "barcode": "171134506",
            "dpc": "03023804701",
            "name": "ឈិញ លយ"
        },
        {
            "barcode": "171134507",
            "dpc": "03023804801",
            "name": "រិន ភួង"
        },
        {
            "barcode": "171134508",
            "dpc": "03023805001",
            "name": "តិច សារ៉ាវុធ"
        },
        {
            "barcode": "171134509",
            "dpc": "03023805101",
            "name": "យ៉ន វុទ្ធី"
        },
        {
            "barcode": "171134510",
            "dpc": "03023805201",
            "name": "ស៊ិន សាយ"
        },
        {
            "barcode": "171134511",
            "dpc": "03023805301",
            "name": "អ៊ុង កាចរ"
        },
        {
            "barcode": "171134512",
            "dpc": "03023805501",
            "name": "ណម លីន"
        },
        {
            "barcode": "171134513",
            "dpc": "03023805601",
            "name": "ចេង អូន"
        },
        {
            "barcode": "171134514",
            "dpc": "03023805701",
            "name": "មុត សោភ័ណ្ឌ"
        },
        {
            "barcode": "171134515",
            "dpc": "03023805801",
            "name": "នួ បូរី"
        },
        {
            "barcode": "171134516",
            "dpc": "03023805901",
            "name": "ឡុញ សុវណ្ណ"
        },
        {
            "barcode": "171134517",
            "dpc": "03023806001",
            "name": "យឹម ប៊ុនឈឿន"
        },
        {
            "barcode": "171134518",
            "dpc": "03023806101",
            "name": "វុន ហ៊ូវ"
        },
        {
            "barcode": "171134519",
            "dpc": "03023806201",
            "name": "ស៊ុន សម្ឋស្ស"
        },
        {
            "barcode": "171134520",
            "dpc": "03023806301",
            "name": "ឈឹម គីមស្រីម"
        },
        {
            "barcode": "171134521",
            "dpc": "03023806501",
            "name": "ភិន ចាន់សេដា"
        },
        {
            "barcode": "171134522",
            "dpc": "03023806601",
            "name": "នួន វៃ"
        },
        {
            "barcode": "171134523",
            "dpc": "03023806801",
            "name": "ឈុត សេ"
        },
        {
            "barcode": "171134524",
            "dpc": "03023806901",
            "name": "គង់ ហេង"
        },
        {
            "barcode": "171134525",
            "dpc": "03023807001",
            "name": "រិន វ៉ានធឿន"
        },
        {
            "barcode": "171134526",
            "dpc": "03023807101",
            "name": "រិន វ៉ាន់ថា"
        },
        {
            "barcode": "171134527",
            "dpc": "03023807201",
            "name": "អ៊ុង ចាន់ផល"
        },
        {
            "barcode": "171134528",
            "dpc": "03023807301",
            "name": "សយ សុគន្ធា"
        },
        {
            "barcode": "171134529",
            "dpc": "03023807401",
            "name": "យី ហេង"
        },
        {
            "barcode": "171134530",
            "dpc": "03023807501",
            "name": "ផាត សុផល"
        },
        {
            "barcode": "171134531",
            "dpc": "03023807601",
            "name": "ផន សុភា"
        },
        {
            "barcode": "171134532",
            "dpc": "03023807701",
            "name": "ផន ផា"
        },
        {
            "barcode": "171134533",
            "dpc": "03023807801",
            "name": "បូរ សក្កិវណ្ណា"
        },
        {
            "barcode": "171134534",
            "dpc": "03023807901",
            "name": "ថុក ប៊ុនរីវ"
        },
        {
            "barcode": "171134535",
            "dpc": "03023808001",
            "name": "អ៊ុំ ប៊ុនធឿន"
        },
        {
            "barcode": "171134536",
            "dpc": "03023808101",
            "name": "យី អ៊ី"
        },
        {
            "barcode": "171134537",
            "dpc": "03023808201",
            "name": "ម៉ៅ មឿន"
        },
        {
            "barcode": "171134538",
            "dpc": "03023808301",
            "name": "អ៊ុយ សុវណ្ណ"
        },
        {
            "barcode": "171134539",
            "dpc": "03023808401",
            "name": "ព្រហ្ម វិចិត្រ"
        },
        {
            "barcode": "171134540",
            "dpc": "03023808501",
            "name": "ទីវ វុទ្ធី"
        },
        {
            "barcode": "171134541",
            "dpc": "03023808601",
            "name": "លី ប៊ុនឡេង"
        },
        {
            "barcode": "171134542",
            "dpc": "03023808701",
            "name": "សុត លាប"
        },
        {
            "barcode": "171134543",
            "dpc": "03023808801",
            "name": "ប្រាក់ ស្រ៊ូ"
        },
        {
            "barcode": "171134544",
            "dpc": "03023809101",
            "name": "ចាន់ សុវណ្ណ"
        },
        {
            "barcode": "171134545",
            "dpc": "03023809201",
            "name": "ឡុច រ៉ា"
        },
        {
            "barcode": "171134546",
            "dpc": "03023809301",
            "name": "សាប់ សុត"
        },
        {
            "barcode": "171134547",
            "dpc": "03023809401",
            "name": "យិប ចំរើន"
        },
        {
            "barcode": "171134548",
            "dpc": "03023809501",
            "name": "យិប ដាវី"
        },
        {
            "barcode": "171134549",
            "dpc": "03023809601",
            "name": "គង់ គន្ធា"
        },
        {
            "barcode": "171134550",
            "dpc": "03023809701",
            "name": "ប្រម សឺន"
        },
        {
            "barcode": "171134551",
            "dpc": "03023809801",
            "name": "ស៊ឹម ចន្ធី"
        },
        {
            "barcode": "171134552",
            "dpc": "03023809901",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "171134553",
            "dpc": "03023810001",
            "name": "សេង ហ៊ូវ"
        },
        {
            "barcode": "171134554",
            "dpc": "03023810101",
            "name": "អ៊ន ឌី"
        },
        {
            "barcode": "171134555",
            "dpc": "03023810201",
            "name": "អៀង សាខន"
        },
        {
            "barcode": "171134556",
            "dpc": "03023810401",
            "name": "លី ថារ៉ា"
        },
        {
            "barcode": "171134557",
            "dpc": "03023810501",
            "name": "រី រ៉ា"
        },
        {
            "barcode": "171134558",
            "dpc": "03023810601",
            "name": "ថៃ សាវី"
        },
        {
            "barcode": "171134559",
            "dpc": "03023810801",
            "name": "ឡុង សារុន"
        },
        {
            "barcode": "171134560",
            "dpc": "03023810901",
            "name": "យ៉ាន រ៉ហ្វាន់"
        },
        {
            "barcode": "171134561",
            "dpc": "03023811001",
            "name": "សើរ និល"
        },
        {
            "barcode": "171134562",
            "dpc": "03023811101",
            "name": "ស៊ត ម៉ាត់ឃីត"
        },
        {
            "barcode": "171134563",
            "dpc": "03023811201",
            "name": "សើរ មីន"
        },
        {
            "barcode": "171134564",
            "dpc": "03023811301",
            "name": "សេន ហាន"
        },
        {
            "barcode": "171134565",
            "dpc": "03023811401",
            "name": "ណុស ជា"
        },
        {
            "barcode": "171134566",
            "dpc": "03023811501",
            "name": "រ៉ូន ម៉ៅ"
        },
        {
            "barcode": "171134567",
            "dpc": "03023811601",
            "name": "ខឹម ភាព"
        },
        {
            "barcode": "171134568",
            "dpc": "03023811701",
            "name": "ឡុង ស៊ុនថារ៉ា"
        },
        {
            "barcode": "171134569",
            "dpc": "03023811901",
            "name": "យី ម៉ាតស៊ត"
        },
        {
            "barcode": "171134570",
            "dpc": "03023812001",
            "name": "ឡោះ រី"
        },
        {
            "barcode": "171134571",
            "dpc": "03023812101",
            "name": "ហា សាន់"
        },
        {
            "barcode": "171134572",
            "dpc": "03023812201",
            "name": "ហឿង សុឃាង"
        },
        {
            "barcode": "171134573",
            "dpc": "03023812301",
            "name": "ម៉ាត់ ស្មានឯល"
        },
        {
            "barcode": "171134574",
            "dpc": "03023812401",
            "name": "វឿត ដារ៉ា"
        },
        {
            "barcode": "171134575",
            "dpc": "03023812501",
            "name": "វឿត ណាសៀត"
        },
        {
            "barcode": "171134576",
            "dpc": "03023812601",
            "name": "អ៊ុច វណ្ណះ"
        },
        {
            "barcode": "171134577",
            "dpc": "03023812701",
            "name": "ម៉ើ ប៉ែល"
        },
        {
            "barcode": "171134578",
            "dpc": "03023812801",
            "name": "ចៅ សម្បត្តិ"
        },
        {
            "barcode": "171134579",
            "dpc": "03023812901",
            "name": "សន រិត"
        },
        {
            "barcode": "171134580",
            "dpc": "03023813001",
            "name": "សើ គុជ"
        },
        {
            "barcode": "171134581",
            "dpc": "03023813401",
            "name": "ទ្រី ប៊ុនតុង"
        },
        {
            "barcode": "171134582",
            "dpc": "03023813501",
            "name": "វណ្ណ សំអាត"
        },
        {
            "barcode": "171134583",
            "dpc": "03023813601",
            "name": "រិទ្ធិ សម្ភា"
        },
        {
            "barcode": "171134584",
            "dpc": "03023813701",
            "name": "ណាង លីណា"
        },
        {
            "barcode": "171134585",
            "dpc": "03023813801",
            "name": "វុធ វណ្ណា"
        },
        {
            "barcode": "171134586",
            "dpc": "03023814001",
            "name": "ញ៉ែម ម៉េងគា១"
        },
        {
            "barcode": "171134587",
            "dpc": "03023814101",
            "name": "ធិន ទី"
        },
        {
            "barcode": "171134588",
            "dpc": "03023814301",
            "name": "ភាជ សឿត"
        },
        {
            "barcode": "171134589",
            "dpc": "03023814401",
            "name": "ផ្លុង ចំរើន១"
        },
        {
            "barcode": "171134590",
            "dpc": "03023814501",
            "name": "ព្រំ មន្និរិទ្ធ"
        },
        {
            "barcode": "171134591",
            "dpc": "03023814601",
            "name": "ផ្លុង សារឿប"
        },
        {
            "barcode": "171134592",
            "dpc": "03023814701",
            "name": "ជ័យ សេងហាប់"
        },
        {
            "barcode": "171134593",
            "dpc": "03023814801",
            "name": "ហួន បណ្ឌិត"
        },
        {
            "barcode": "171134594",
            "dpc": "03023814901",
            "name": "តាន់ គឹមទៀង"
        },
        {
            "barcode": "171134595",
            "dpc": "03023815001",
            "name": "កៀន យឿង"
        },
        {
            "barcode": "171134596",
            "dpc": "03023815101",
            "name": "ម៉ក់ សុវណ្ណ"
        },
        {
            "barcode": "171134597",
            "dpc": "03023815201",
            "name": "ជីង ម៉ូលីរតន៏"
        },
        {
            "barcode": "171134598",
            "dpc": "03023815301",
            "name": "នៅ ចិនរ៉ាត់"
        },
        {
            "barcode": "171134599",
            "dpc": "03023815501",
            "name": "សឿន សុរិទ្ធ"
        },
        {
            "barcode": "171134600",
            "dpc": "03023815601",
            "name": "ប៊ូ ស៊ិនដា"
        },
        {
            "barcode": "171134601",
            "dpc": "03023815801",
            "name": "ឈូក ចំរើនរត័្ន"
        },
        {
            "barcode": "171134602",
            "dpc": "03023815901",
            "name": "ព្រេង ចិន្តា"
        },
        {
            "barcode": "171134603",
            "dpc": "03023816001",
            "name": "ប្រេង ប្រសិទ្ធ"
        },
        {
            "barcode": "171134604",
            "dpc": "03023816101",
            "name": "ចាប សាមឿន"
        },
        {
            "barcode": "171134605",
            "dpc": "03023816201",
            "name": "សុខ វុទ្ធី"
        },
        {
            "barcode": "171134606",
            "dpc": "03023816301",
            "name": "សៀង វន្នី"
        },
        {
            "barcode": "171134607",
            "dpc": "03023816401",
            "name": "ញ៉ែម មេងគាង២"
        },
        {
            "barcode": "171134608",
            "dpc": "03023816601",
            "name": "ឌឿន សារី"
        },
        {
            "barcode": "171134609",
            "dpc": "03023816801",
            "name": "តោ សាវ៉ាត់"
        },
        {
            "barcode": "171134610",
            "dpc": "03023816901",
            "name": "អុំ សារ៉ឹម"
        },
        {
            "barcode": "171134611",
            "dpc": "03023817001",
            "name": "អ៊ុំ ជីម"
        },
        {
            "barcode": "171134612",
            "dpc": "03023817101",
            "name": "រស់ គឹមឡេង"
        },
        {
            "barcode": "171134613",
            "dpc": "03023817201",
            "name": "ឆៃ សុផាត"
        },
        {
            "barcode": "171134614",
            "dpc": "03023817401",
            "name": "នង ចិន្តា"
        },
        {
            "barcode": "171134615",
            "dpc": "03023817501",
            "name": "ណុប សុខុនណី"
        },
        {
            "barcode": "171134616",
            "dpc": "03023817601",
            "name": "ណុប សុខុន"
        },
        {
            "barcode": "171134617",
            "dpc": "03023817701",
            "name": "នង ហូវ"
        },
        {
            "barcode": "171134618",
            "dpc": "03023817801",
            "name": "ជឿន ហេង"
        },
        {
            "barcode": "171134619",
            "dpc": "03023818001",
            "name": "ហម សុវណ្ណ"
        },
        {
            "barcode": "171134620",
            "dpc": "03023818401",
            "name": "ឈួម សារី"
        },
        {
            "barcode": "171134621",
            "dpc": "03023818501",
            "name": "ឡាក សុភី"
        },
        {
            "barcode": "171134622",
            "dpc": "03023818601",
            "name": "អ៊ឹង ម៉ាលី"
        },
        {
            "barcode": "171134623",
            "dpc": "03023818701",
            "name": "ឌុក បូរ៉ុម"
        },
        {
            "barcode": "171134624",
            "dpc": "03023818801",
            "name": "សុខ ភូសិត"
        },
        {
            "barcode": "171134625",
            "dpc": "03023818901",
            "name": "ផេង ចំរិត"
        },
        {
            "barcode": "171134626",
            "dpc": "03023819201",
            "name": "មឿន រូម"
        },
        {
            "barcode": "171134627",
            "dpc": "03023819301",
            "name": "សួន សារិន"
        },
        {
            "barcode": "171134628",
            "dpc": "03023819401",
            "name": "ហៀន ណារី"
        },
        {
            "barcode": "171134629",
            "dpc": "03023819501",
            "name": "ហៀន ណារ៉ាត"
        },
        {
            "barcode": "171134630",
            "dpc": "03023819701",
            "name": "សេត សុខ"
        },
        {
            "barcode": "171134631",
            "dpc": "03023819801",
            "name": "រឿត សាវ៉ើន"
        },
        {
            "barcode": "171134632",
            "dpc": "03023819901",
            "name": "ពេជ្រ ចន្ធី"
        },
        {
            "barcode": "171134633",
            "dpc": "03023820001",
            "name": "វែង សុភ័ណ"
        },
        {
            "barcode": "171134634",
            "dpc": "03023820201",
            "name": "ខ្លូត ចន្ថា"
        },
        {
            "barcode": "171134635",
            "dpc": "03023820701",
            "name": "ធិប ច្រិប"
        },
        {
            "barcode": "171134636",
            "dpc": "03023820801",
            "name": "ឌី រិត"
        },
        {
            "barcode": "171134637",
            "dpc": "03023820901",
            "name": "ម៉ូ ចាន់ថង"
        },
        {
            "barcode": "171134638",
            "dpc": "03023821201",
            "name": "ផា ចំរើន"
        },
        {
            "barcode": "171134639",
            "dpc": "03023821301",
            "name": "ផ្លុង សុខ"
        },
        {
            "barcode": "171134640",
            "dpc": "03023821601",
            "name": "ទូច ប៊ុនអឿត"
        },
        {
            "barcode": "171134641",
            "dpc": "03023821801",
            "name": "នៅ សារឿង"
        },
        {
            "barcode": "171134642",
            "dpc": "03023821901",
            "name": "ជា សារ៉ាត់"
        },
        {
            "barcode": "171134643",
            "dpc": "03023822101",
            "name": "វ៉ាន់ សុភា"
        },
        {
            "barcode": "171134644",
            "dpc": "03023822201",
            "name": "ប៉ិច សាលឿន"
        },
        {
            "barcode": "171134645",
            "dpc": "03023822301",
            "name": "យ៉ាន់ លង"
        },
        {
            "barcode": "171134646",
            "dpc": "03023822401",
            "name": "យ៉ាន់ ជីម៉ុយ"
        },
        {
            "barcode": "171134647",
            "dpc": "03023822501",
            "name": "មុត សំណាង"
        },
        {
            "barcode": "171134648",
            "dpc": "03023822701",
            "name": "ធា ភីរម្យ"
        },
        {
            "barcode": "171134649",
            "dpc": "03023823001",
            "name": "ម៉ាង ទ័រ"
        },
        {
            "barcode": "171134650",
            "dpc": "03023823101",
            "name": "អ៊ុន សឿង"
        },
        {
            "barcode": "171134651",
            "dpc": "03023823201",
            "name": "សុខ ភឿន"
        },
        {
            "barcode": "171134652",
            "dpc": "03023823401",
            "name": "ឡាន់ ចាន់ឌីធារ៉ា"
        },
        {
            "barcode": "171134653",
            "dpc": "03023823501",
            "name": "សំ ចាន់រិទ្ធ"
        },
        {
            "barcode": "171134654",
            "dpc": "03023823601",
            "name": "សែម ប៊ុនសេង"
        },
        {
            "barcode": "171134655",
            "dpc": "03023823701",
            "name": "យឿន ជឿង"
        },
        {
            "barcode": "171134656",
            "dpc": "03023823801",
            "name": "ហ៊ាង ម៉ាលីន"
        },
        {
            "barcode": "171134657",
            "dpc": "03023823901",
            "name": "ជា សវី"
        },
        {
            "barcode": "171134658",
            "dpc": "03023824001",
            "name": "ហេង ដាលីស"
        },
        {
            "barcode": "171134659",
            "dpc": "03023824101",
            "name": "មឿន បូរី"
        },
        {
            "barcode": "171134660",
            "dpc": "03023824201",
            "name": "ខ្លូត ប៉ាន"
        },
        {
            "barcode": "171134661",
            "dpc": "03023824301",
            "name": "ប៊ុន គន្ធា"
        },
        {
            "barcode": "171134662",
            "dpc": "03023824401",
            "name": "ប៉ិច ឃន"
        },
        {
            "barcode": "171134663",
            "dpc": "03023824501",
            "name": "ពុធ ទ្រី"
        },
        {
            "barcode": "171134664",
            "dpc": "03023824601",
            "name": "អ៊ុំ សាវែន"
        },
        {
            "barcode": "171134665",
            "dpc": "03023824701",
            "name": "ខ្លួត ផាន់ណា"
        },
        {
            "barcode": "171134666",
            "dpc": "03023824901",
            "name": "ប៉ិ រុន"
        },
        {
            "barcode": "171134667",
            "dpc": "03023825301",
            "name": "លាង​ ហេង"
        },
        {
            "barcode": "171134668",
            "dpc": "03023825601",
            "name": "មឿន ឡា"
        },
        {
            "barcode": "171134669",
            "dpc": "03023825701",
            "name": "មឿន លឿត"
        },
        {
            "barcode": "171134670",
            "dpc": "03023825801",
            "name": "វ៉ន ឈ្នាង"
        },
        {
            "barcode": "171134671",
            "dpc": "03023825901",
            "name": "រ៉ា ធីណា"
        },
        {
            "barcode": "171134672",
            "dpc": "03023826001",
            "name": "នូ សុខុម"
        },
        {
            "barcode": "171134673",
            "dpc": "03023826101",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "171134674",
            "dpc": "03023826301",
            "name": "ព្រេង ដារ៉ា"
        },
        {
            "barcode": "171134675",
            "dpc": "03023826401",
            "name": "រស់ អឿន"
        },
        {
            "barcode": "171134676",
            "dpc": "03023826501",
            "name": "កុយ ចំរើន"
        },
        {
            "barcode": "171134677",
            "dpc": "03023826601",
            "name": "គឹម ផល្លា"
        },
        {
            "barcode": "171134678",
            "dpc": "03023826701",
            "name": "កុយ សាន"
        },
        {
            "barcode": "171134679",
            "dpc": "03023826801",
            "name": "ព្រំ វី"
        },
        {
            "barcode": "171134680",
            "dpc": "03023826901",
            "name": "ឌី ស៊ីណា"
        },
        {
            "barcode": "171134681",
            "dpc": "03023827001",
            "name": "ប៉ិច ទូច"
        },
        {
            "barcode": "171134682",
            "dpc": "03023827101",
            "name": "ឃឿម សុខុម"
        },
        {
            "barcode": "171134683",
            "dpc": "03023827201",
            "name": "អ៊ុច ពៅ"
        },
        {
            "barcode": "171134684",
            "dpc": "03023827301",
            "name": "ជា សុគន្ធា"
        },
        {
            "barcode": "171134685",
            "dpc": "03023827401",
            "name": "ប៉ិច សុខុម"
        },
        {
            "barcode": "171134686",
            "dpc": "03023827501",
            "name": "រឿន កែប"
        },
        {
            "barcode": "171134687",
            "dpc": "03023827601",
            "name": "យស អុន"
        },
        {
            "barcode": "171134688",
            "dpc": "03023827701",
            "name": "លាង ផាងហេង"
        },
        {
            "barcode": "171134689",
            "dpc": "03023827801",
            "name": "ដៅ សាំងអ៊ាត"
        },
        {
            "barcode": "171134690",
            "dpc": "03023827901",
            "name": "អាន សំអឿន"
        },
        {
            "barcode": "171134691",
            "dpc": "03023828201",
            "name": "ព្រាប សឿម"
        },
        {
            "barcode": "171134692",
            "dpc": "03023828301",
            "name": "វ៉ឹង សុផុស"
        },
        {
            "barcode": "171134693",
            "dpc": "03023828401",
            "name": "វ៉ឹង សាន"
        },
        {
            "barcode": "171134694",
            "dpc": "03023828501",
            "name": "វ៉ឹង វ៉ាន់ស៊ីន"
        },
        {
            "barcode": "171134695",
            "dpc": "03023828801",
            "name": "ថុក វុទ្ធា"
        },
        {
            "barcode": "171134696",
            "dpc": "03023828901",
            "name": "ផៃ មិថុនា"
        },
        {
            "barcode": "171134697",
            "dpc": "03023829001",
            "name": "ហ៊ួរ នេត"
        },
        {
            "barcode": "171134698",
            "dpc": "03023829101",
            "name": "ហេ​ វ៉ា"
        },
        {
            "barcode": "171134699",
            "dpc": "03023829201",
            "name": "ភិន សរ៉េត"
        },
        {
            "barcode": "171134700",
            "dpc": "03023829301",
            "name": "លោត ស្រួន"
        },
        {
            "barcode": "171134701",
            "dpc": "03023829801",
            "name": "តឹង សុវណ្ណ"
        },
        {
            "barcode": "171134702",
            "dpc": "03023829901",
            "name": "សា ចន្ថា"
        },
        {
            "barcode": "171134703",
            "dpc": "03023830001",
            "name": "យូ ស៊ីភឿន"
        },
        {
            "barcode": "171134704",
            "dpc": "03023830101",
            "name": "អ៊ុន ណារ៉ុង"
        },
        {
            "barcode": "171134705",
            "dpc": "03023830201",
            "name": "សុំ ចាន់សេរី"
        },
        {
            "barcode": "171134706",
            "dpc": "03023830301",
            "name": "ភាជ ចំរើន"
        },
        {
            "barcode": "171134707",
            "dpc": "03023830501",
            "name": "ភាជ ម៉ិ"
        },
        {
            "barcode": "171134708",
            "dpc": "03023830601",
            "name": "សេង មឿន"
        },
        {
            "barcode": "171134709",
            "dpc": "03023830701",
            "name": "លី វណ្ណី"
        },
        {
            "barcode": "171134710",
            "dpc": "03023831001",
            "name": "យ៉ា ប៊ុនរឿន"
        },
        {
            "barcode": "171134711",
            "dpc": "03023831101",
            "name": "ខ្លូត នី"
        },
        {
            "barcode": "171134712",
            "dpc": "03023831401",
            "name": "មឿន លក"
        },
        {
            "barcode": "171134713",
            "dpc": "03023831501",
            "name": "យ៉ាត វ័យ"
        },
        {
            "barcode": "171134714",
            "dpc": "03023831701",
            "name": "សឿម គឹមអេង"
        },
        {
            "barcode": "171134715",
            "dpc": "03023831801",
            "name": "ឡុច សារ៉េត"
        },
        {
            "barcode": "171134716",
            "dpc": "03023831901",
            "name": "ផ្លុង សាមិន"
        },
        {
            "barcode": "171134717",
            "dpc": "03023832101",
            "name": "ឡាំង ឃន"
        },
        {
            "barcode": "171134718",
            "dpc": "03023832201",
            "name": "ផ្លុង ចំរើន២"
        },
        {
            "barcode": "171134719",
            "dpc": "03023832301",
            "name": "ឆន រ៉េត"
        },
        {
            "barcode": "171134720",
            "dpc": "03023832401",
            "name": "វ៉ាន់ ពន្លីរិទ្ធ"
        },
        {
            "barcode": "171134721",
            "dpc": "03023832601",
            "name": "គង់ វ៉ាន់ឌី"
        },
        {
            "barcode": "171134722",
            "dpc": "03023832701",
            "name": "ទុយ ឆៃយ៉ា"
        },
        {
            "barcode": "171134723",
            "dpc": "03023832801",
            "name": "ស៊ាន សាវឿត"
        },
        {
            "barcode": "171134724",
            "dpc": "03023832901",
            "name": "ដាំ ចំរើន"
        },
        {
            "barcode": "171134725",
            "dpc": "03023833101",
            "name": "នៅ សំណាង"
        },
        {
            "barcode": "171134726",
            "dpc": "03023833201",
            "name": "ផាត់ សុភាព"
        },
        {
            "barcode": "171134727",
            "dpc": "03023833301",
            "name": "ហែម សិលា"
        },
        {
            "barcode": "171134728",
            "dpc": "03023833401",
            "name": "សៅ សឺន"
        },
        {
            "barcode": "171134729",
            "dpc": "03023833601",
            "name": "ទៀង សុផាន់ណា"
        },
        {
            "barcode": "171134730",
            "dpc": "03023833701",
            "name": "ខូវ ស៊ាងវី"
        },
        {
            "barcode": "171134731",
            "dpc": "03023833801",
            "name": "ស៊ន កុក"
        },
        {
            "barcode": "171134732",
            "dpc": "03023833901",
            "name": "ហ៊ វ៉ា"
        },
        {
            "barcode": "171134733",
            "dpc": "03023834001",
            "name": "លី អាន"
        },
        {
            "barcode": "171134734",
            "dpc": "03023834101",
            "name": "ឆាយ សំណាង"
        },
        {
            "barcode": "171134735",
            "dpc": "03023834201",
            "name": "ញ៉េប អៀក"
        },
        {
            "barcode": "171134736",
            "dpc": "03023834401",
            "name": "ទូច សំអឿន"
        },
        {
            "barcode": "171134737",
            "dpc": "03023834501",
            "name": "ទូច អឿម"
        },
        {
            "barcode": "171134738",
            "dpc": "03023834601",
            "name": "ហួន កក្កដា"
        },
        {
            "barcode": "171134739",
            "dpc": "03023834701",
            "name": "សៀង ថូ"
        },
        {
            "barcode": "171134740",
            "dpc": "03023834901",
            "name": "សុច សាង"
        },
        {
            "barcode": "171134741",
            "dpc": "03023835001",
            "name": "ប្រិម ហួន"
        },
        {
            "barcode": "171134742",
            "dpc": "03023835101",
            "name": "ក្រាន់ ដូប"
        },
        {
            "barcode": "171134743",
            "dpc": "03023835301",
            "name": "ប្រិម ភឿត"
        },
        {
            "barcode": "171134744",
            "dpc": "03023835401",
            "name": "ប្រិម សារិន"
        },
        {
            "barcode": "171134745",
            "dpc": "03023835501",
            "name": "ប្រិម លេង"
        },
        {
            "barcode": "171134746",
            "dpc": "03023835601",
            "name": "ដុំ រុំ"
        },
        {
            "barcode": "171134747",
            "dpc": "03023835701",
            "name": "ឈន ផល្លី"
        },
        {
            "barcode": "171134748",
            "dpc": "03023835801",
            "name": "យ៉ាន់ ទូច"
        },
        {
            "barcode": "171134749",
            "dpc": "03023835901",
            "name": "ស៊ុយ ជិត"
        },
        {
            "barcode": "171134750",
            "dpc": "03023836001",
            "name": "អ៊ុច យឿត"
        },
        {
            "barcode": "171134751",
            "dpc": "03023836101",
            "name": "ផាត់ វណ្ណា"
        },
        {
            "barcode": "171134752",
            "dpc": "03023836301",
            "name": "សយ ភឿន"
        },
        {
            "barcode": "171134753",
            "dpc": "03023836401",
            "name": "មាស សាវុធ"
        },
        {
            "barcode": "171134754",
            "dpc": "03023836701",
            "name": "ឈឿន លឿត"
        },
        {
            "barcode": "171134755",
            "dpc": "03023836901",
            "name": "ប៉ែន នាង"
        },
        {
            "barcode": "171134756",
            "dpc": "03023837001",
            "name": "លៀង សំអុល"
        },
        {
            "barcode": "171134757",
            "dpc": "03023837101",
            "name": "សឿន សួម"
        },
        {
            "barcode": "171134758",
            "dpc": "03023837201",
            "name": "សាលាបឋមសិក្សា តាព្រួច"
        },
        {
            "barcode": "171134759",
            "dpc": "03023837301",
            "name": "និត ចាន់រ៉ា"
        },
        {
            "barcode": "171134760",
            "dpc": "03023837401",
            "name": "នេតា លៀង"
        },
        {
            "barcode": "171134761",
            "dpc": "03023837601",
            "name": "ភាព សុភ័ក្រ"
        },
        {
            "barcode": "171134762",
            "dpc": "03023837701",
            "name": "ជឹម សាវេត"
        },
        {
            "barcode": "171134763",
            "dpc": "03023838001",
            "name": "ឆន យ៉េត"
        },
        {
            "barcode": "171134764",
            "dpc": "03023838101",
            "name": "ធឿង ឈឿត"
        },
        {
            "barcode": "171134765",
            "dpc": "03023838201",
            "name": "លៀប ជឿត"
        },
        {
            "barcode": "171134766",
            "dpc": "03023838301",
            "name": "ហេង យ៉ាន់"
        },
        {
            "barcode": "171134767",
            "dpc": "03023838601",
            "name": "វិន រៀម"
        },
        {
            "barcode": "171134768",
            "dpc": "03023838801",
            "name": "ឌី ស្រីរិទ្ធ"
        },
        {
            "barcode": "171134769",
            "dpc": "03023838901",
            "name": "គឹម គឹមជឿន"
        },
        {
            "barcode": "171134770",
            "dpc": "03023839001",
            "name": "ទូច មឿន"
        },
        {
            "barcode": "171134771",
            "dpc": "03023839101",
            "name": "ប៊ិច ឡូញ"
        },
        {
            "barcode": "171134772",
            "dpc": "03023839201",
            "name": "ម៉ុត វុន"
        },
        {
            "barcode": "171134773",
            "dpc": "03023839301",
            "name": "ម៉ុត សំណាង"
        },
        {
            "barcode": "171134774",
            "dpc": "03023839401",
            "name": "បេង ហឿត"
        },
        {
            "barcode": "171134775",
            "dpc": "03023839601",
            "name": "ស៊ីវ សារឿង"
        },
        {
            "barcode": "171134776",
            "dpc": "03023839701",
            "name": "លៃ សិលា"
        },
        {
            "barcode": "171134777",
            "dpc": "03023839801",
            "name": "ខុម ធឿន"
        },
        {
            "barcode": "171134778",
            "dpc": "03023839901",
            "name": "រីម ម៉ាត"
        },
        {
            "barcode": "171134779",
            "dpc": "03023840001",
            "name": "សោម ឡុងឌី"
        },
        {
            "barcode": "171134780",
            "dpc": "03023840101",
            "name": "ផេង សិទ្ធី"
        },
        {
            "barcode": "171134781",
            "dpc": "03023840301",
            "name": "មឿន សាវន"
        },
        {
            "barcode": "171134782",
            "dpc": "03023840401",
            "name": "យឹម ហ៊ីង"
        },
        {
            "barcode": "171134783",
            "dpc": "03023840501",
            "name": "លីណា"
        },
        {
            "barcode": "171134784",
            "dpc": "03023840701",
            "name": "រិន ដារិត"
        },
        {
            "barcode": "171134785",
            "dpc": "03023840801",
            "name": "ឃុត ប៊ុនឈឿប"
        },
        {
            "barcode": "171134786",
            "dpc": "03023841001",
            "name": "សាន ស៊ា"
        },
        {
            "barcode": "171134787",
            "dpc": "03023841201",
            "name": "ឡុង ស៊ីណារ៉េត"
        },
        {
            "barcode": "171134788",
            "dpc": "03023841301",
            "name": "គូ សាឡន"
        },
        {
            "barcode": "171134789",
            "dpc": "03023841601",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "171134790",
            "dpc": "03023841701",
            "name": "ណង ចំណាន"
        },
        {
            "barcode": "171134791",
            "dpc": "03023842101",
            "name": "ឆេង លឿត"
        },
        {
            "barcode": "171134792",
            "dpc": "03023842201",
            "name": "មុត វាសនា"
        },
        {
            "barcode": "171134793",
            "dpc": "03023842301",
            "name": "ស៊ឹម សុខលាង"
        },
        {
            "barcode": "171134794",
            "dpc": "03023842401",
            "name": "វួច លីម"
        },
        {
            "barcode": "171134795",
            "dpc": "03023842501",
            "name": "ហួង សំណាង"
        },
        {
            "barcode": "171134796",
            "dpc": "03023842601",
            "name": "ឃឹម យឿប"
        },
        {
            "barcode": "171134797",
            "dpc": "03023842701",
            "name": "ឡុង លឿង"
        },
        {
            "barcode": "171134798",
            "dpc": "03023842801",
            "name": "ហួន ហ៊ត"
        },
        {
            "barcode": "171134799",
            "dpc": "03023843001",
            "name": "រឿម ស៊ន"
        },
        {
            "barcode": "171134800",
            "dpc": "03023843101",
            "name": "យ៉ាន់ សេរីរត្ន័"
        },
        {
            "barcode": "171134801",
            "dpc": "03023843201",
            "name": "ផ្លុង រ៉ាត់"
        },
        {
            "barcode": "171134802",
            "dpc": "03023843301",
            "name": "តុល អួន"
        },
        {
            "barcode": "171134803",
            "dpc": "03023843401",
            "name": "ជា លាប"
        },
        {
            "barcode": "171134804",
            "dpc": "03023843501",
            "name": "អ៊ឹង សឿត"
        },
        {
            "barcode": "171134805",
            "dpc": "03023843601",
            "name": "ចាន់ សារ៉េន"
        },
        {
            "barcode": "171134806",
            "dpc": "03023843701",
            "name": "ជី សៀន"
        },
        {
            "barcode": "171134807",
            "dpc": "03023843901",
            "name": "ឆាត គាន"
        },
        {
            "barcode": "171134808",
            "dpc": "03023844001",
            "name": "វុន សាវើន"
        },
        {
            "barcode": "171134809",
            "dpc": "03023844101",
            "name": "ផាត អាន"
        },
        {
            "barcode": "171134810",
            "dpc": "03023844201",
            "name": "លឹម សុខយ៉ែម"
        },
        {
            "barcode": "171134811",
            "dpc": "03023845201",
            "name": "យួម វ៉ាគី"
        },
        {
            "barcode": "171134812",
            "dpc": "03023845301",
            "name": "សែម ជន"
        },
        {
            "barcode": "171134813",
            "dpc": "03023845401",
            "name": "ណែម រិទ្ទ"
        },
        {
            "barcode": "171134814",
            "dpc": "03023845501",
            "name": "យ៉ែម ឈឿប"
        },
        {
            "barcode": "171134815",
            "dpc": "03023845601",
            "name": "តាន់ យូរ៉ា"
        },
        {
            "barcode": "171134816",
            "dpc": "03023845801",
            "name": "ឈាន គឹមម្លិះ"
        },
        {
            "barcode": "171134817",
            "dpc": "03023847001",
            "name": "ទួច សារឿត"
        },
        {
            "barcode": "171134818",
            "dpc": "03023847301",
            "name": "ស្រែ ទិន"
        },
        {
            "barcode": "171134819",
            "dpc": "03023847501",
            "name": "ឈឿន ហឿប"
        },
        {
            "barcode": "171134820",
            "dpc": "03023847801",
            "name": "សុង ម៉ុន"
        },
        {
            "barcode": "171134821",
            "dpc": "03023847901",
            "name": "សំ វណ្ណះ"
        },
        {
            "barcode": "171134822",
            "dpc": "03023848001",
            "name": "ឈឿង សុធីម"
        }
    ];


barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
