let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171134823",
            "dpc": "03023909301",
            "name": "សេក សារ៉ុម"
        },
        {
            "barcode": "171134824",
            "dpc": "03023900201",
            "name": "សាគុណ ប្រាកដ"
        },
        {
            "barcode": "171134825",
            "dpc": "03023900301",
            "name": "ចក់ ចន្ថា"
        },
        {
            "barcode": "171134826",
            "dpc": "03023900401",
            "name": "ថោង សេរីវត្ស"
        },
        {
            "barcode": "171134827",
            "dpc": "03023900601",
            "name": "ចក់ ចន្ថា"
        },
        {
            "barcode": "171134828",
            "dpc": "03023900701",
            "name": "ហេង លាង"
        },
        {
            "barcode": "171134829",
            "dpc": "03023900801",
            "name": "ហួម ហាប់"
        },
        {
            "barcode": "171134830",
            "dpc": "03023901201",
            "name": "ឆឹម សម្បត្តិ"
        },
        {
            "barcode": "171134831",
            "dpc": "03023901301",
            "name": "សាង លាងគីម"
        },
        {
            "barcode": "171134832",
            "dpc": "03023901601",
            "name": "គឹម សុឃី"
        },
        {
            "barcode": "171134833",
            "dpc": "03023902001",
            "name": "សួស មករា"
        },
        {
            "barcode": "171134834",
            "dpc": "03023902301",
            "name": "ឆេង ប៊ុនសួ"
        },
        {
            "barcode": "171134835",
            "dpc": "03023902401",
            "name": "ឈឿន សារួត"
        },
        {
            "barcode": "171134836",
            "dpc": "03023902501",
            "name": "អ៊ន ឈឿន"
        },
        {
            "barcode": "171134837",
            "dpc": "03023902601",
            "name": "សាត ស្វាង"
        },
        {
            "barcode": "171134838",
            "dpc": "03023902701",
            "name": "ដាំ ភាព"
        },
        {
            "barcode": "171134839",
            "dpc": "03023902801",
            "name": "សេង សុន"
        },
        {
            "barcode": "171134840",
            "dpc": "03023902901",
            "name": "ម៉ៅ សារឿត"
        },
        {
            "barcode": "171134841",
            "dpc": "03023903101",
            "name": "ឈៀង ឈាន"
        },
        {
            "barcode": "171134842",
            "dpc": "03023903201",
            "name": "ជ័យ ម៉ារឌី"
        },
        {
            "barcode": "171134843",
            "dpc": "03023903401",
            "name": "ណាង ថង"
        },
        {
            "barcode": "171134844",
            "dpc": "03023903901",
            "name": "ឌិត ភាព"
        },
        {
            "barcode": "171134845",
            "dpc": "03023904001",
            "name": "បួន ពៅ"
        },
        {
            "barcode": "171134846",
            "dpc": "03023904101",
            "name": "វេត ចំណាន"
        },
        {
            "barcode": "171134847",
            "dpc": "03023904201",
            "name": "ហ៊ន ហូ"
        },
        {
            "barcode": "171134848",
            "dpc": "03023904301",
            "name": "ស៊ីម ប៉ន"
        },
        {
            "barcode": "171134849",
            "dpc": "03023904401",
            "name": "ផាន សុខ"
        },
        {
            "barcode": "171134850",
            "dpc": "03023904501",
            "name": "ធឿន សារិន"
        },
        {
            "barcode": "171134851",
            "dpc": "03023904601",
            "name": "សុខ ទេនពិសិដ្ឋ"
        },
        {
            "barcode": "171134852",
            "dpc": "03023904701",
            "name": "សុខ សុផល"
        },
        {
            "barcode": "171134853",
            "dpc": "03023904801",
            "name": "ស៊ូ សុភី"
        },
        {
            "barcode": "171134854",
            "dpc": "03023904901",
            "name": "ឡុង ម៉ាលី"
        },
        {
            "barcode": "171134855",
            "dpc": "03023905001",
            "name": "ជួន ឆុំ"
        },
        {
            "barcode": "171134856",
            "dpc": "03023905101",
            "name": "នៅ ចន្ថា"
        },
        {
            "barcode": "171134857",
            "dpc": "03023905201",
            "name": "វ៉ាន់ ណយ"
        },
        {
            "barcode": "171134858",
            "dpc": "03023905301",
            "name": "ឆន សុផល"
        },
        {
            "barcode": "171134859",
            "dpc": "03023905401",
            "name": "ផ្លុង វុឌ្ឍី"
        },
        {
            "barcode": "171134860",
            "dpc": "03023905501",
            "name": "ទូច សានិត"
        },
        {
            "barcode": "171134861",
            "dpc": "03023905601",
            "name": "យ៉ាត ម៉ៅ"
        },
        {
            "barcode": "171134862",
            "dpc": "03023905701",
            "name": "ថាប់ ឆម"
        },
        {
            "barcode": "171134863",
            "dpc": "03023905801",
            "name": "ទេព ហ៊ីំម"
        },
        {
            "barcode": "171134864",
            "dpc": "03023905901",
            "name": "ម៉ក់ ឈួន"
        },
        {
            "barcode": "171134865",
            "dpc": "03023906001",
            "name": "ឆឿន រដ្ឋា"
        },
        {
            "barcode": "171134866",
            "dpc": "03023906101",
            "name": "សយ សត្យា"
        },
        {
            "barcode": "171134867",
            "dpc": "03023906201",
            "name": "ថុល ចាន់ណា"
        },
        {
            "barcode": "171134868",
            "dpc": "03023906301",
            "name": "សឿន អឿន"
        },
        {
            "barcode": "171134869",
            "dpc": "03023906401",
            "name": "សំ សុខ"
        },
        {
            "barcode": "171134870",
            "dpc": "03023906501",
            "name": "សៀង សំ"
        },
        {
            "barcode": "171134871",
            "dpc": "03023906601",
            "name": "គឹម សុភារម្យ"
        },
        {
            "barcode": "171134872",
            "dpc": "03023906701",
            "name": "ចេង សុផល"
        },
        {
            "barcode": "171134873",
            "dpc": "03023906801",
            "name": "ប៉ោ គឹមសុង"
        },
        {
            "barcode": "171134874",
            "dpc": "03023906901",
            "name": "លក ចេក"
        },
        {
            "barcode": "171134875",
            "dpc": "03023907001",
            "name": "ប៉ុន សំអាត"
        },
        {
            "barcode": "171134876",
            "dpc": "03023907101",
            "name": "គង់ សុខា"
        },
        {
            "barcode": "171134877",
            "dpc": "03023907201",
            "name": "សាយ វណ្ណះ"
        },
        {
            "barcode": "171134878",
            "dpc": "03023907301",
            "name": "ហម ឆា"
        },
        {
            "barcode": "171134879",
            "dpc": "03023907401",
            "name": "ទុយ កុសល់"
        },
        {
            "barcode": "171134880",
            "dpc": "03023907501",
            "name": "ខៀវ ម៉ាលី"
        },
        {
            "barcode": "171134881",
            "dpc": "03023907601",
            "name": "ឆួត ហ៊ាប"
        },
        {
            "barcode": "171134882",
            "dpc": "03023907701",
            "name": "បេង សុគន្ធា"
        },
        {
            "barcode": "171134883",
            "dpc": "03023907801",
            "name": "ចាន់ វណ្ណា"
        },
        {
            "barcode": "171134884",
            "dpc": "03023907901",
            "name": "ហ៊ួ ផុនវិចិត្រ"
        },
        {
            "barcode": "171134885",
            "dpc": "03023908001",
            "name": "ហេង ស្រីរ័ត្ន"
        },
        {
            "barcode": "171134886",
            "dpc": "03023908101",
            "name": "សោម រិទ្ធ"
        },
        {
            "barcode": "171134887",
            "dpc": "03023908201",
            "name": "សំ វណ្ណាក់"
        },
        {
            "barcode": "171134888",
            "dpc": "03023908301",
            "name": "ខេង បញ្ញា"
        },
        {
            "barcode": "171134889",
            "dpc": "03023908501",
            "name": "ជួន សុខហេង"
        },
        {
            "barcode": "171134890",
            "dpc": "03023908601",
            "name": "ផាត់ ទៀង"
        },
        {
            "barcode": "171134891",
            "dpc": "03023908801",
            "name": "អឿន ចាន់នី"
        },
        {
            "barcode": "171134892",
            "dpc": "03023908901",
            "name": "ប៊ន ខន"
        },
        {
            "barcode": "171134893",
            "dpc": "03023909101",
            "name": "កុល សំណាង"
        },
        {
            "barcode": "171134894",
            "dpc": "03023909201",
            "name": "ភឿក វីរៈ"
        },
        {
            "barcode": "171134895",
            "dpc": "03023909401",
            "name": "ហ៊ីម ហ្វារីត"
        },
        {
            "barcode": "171134896",
            "dpc": "03023909501",
            "name": "ទត ហ្វា"
        },
        {
            "barcode": "171134897",
            "dpc": "03023909601",
            "name": "ស៊ុន ធី"
        },
        {
            "barcode": "171134898",
            "dpc": "03023909701",
            "name": "បូ វឿត"
        },
        {
            "barcode": "171134899",
            "dpc": "03023909801",
            "name": "ស៊ិន សុភាព"
        },
        {
            "barcode": "171134900",
            "dpc": "03023909901",
            "name": "បេង សុខ ណា"
        },
        {
            "barcode": "171134901",
            "dpc": "03023910001",
            "name": "ម៉ម វណ្ណា"
        },
        {
            "barcode": "171134902",
            "dpc": "03023910101",
            "name": "ម៉ៅ លន់"
        },
        {
            "barcode": "171134903",
            "dpc": "03023910201",
            "name": "ឡឹប សាមឿន"
        },
        {
            "barcode": "171134904",
            "dpc": "03023910301",
            "name": "ហុក គឹមហួង"
        },
        {
            "barcode": "171134905",
            "dpc": "03023910401",
            "name": "ឈឹម រ៉ៃម៉ុង"
        },
        {
            "barcode": "171134906",
            "dpc": "03023910501",
            "name": "ខាត់ វ៉ិត"
        },
        {
            "barcode": "171134907",
            "dpc": "03023910601",
            "name": "អុំ កៅ"
        },
        {
            "barcode": "171134908",
            "dpc": "03023910701",
            "name": "គ្រួច សុវណ្ណ"
        },
        {
            "barcode": "171134909",
            "dpc": "03023910801",
            "name": "សេង ថេង"
        },
        {
            "barcode": "171134910",
            "dpc": "03023910901",
            "name": "គុយ គា"
        },
        {
            "barcode": "171134911",
            "dpc": "03023911001",
            "name": "ម៉ម ស៊ីម៉ុន"
        },
        {
            "barcode": "171134912",
            "dpc": "03023911101",
            "name": "ទេស សុភាព"
        },
        {
            "barcode": "171134913",
            "dpc": "03023911201",
            "name": "ហេង សុដាលីន"
        },
        {
            "barcode": "171134914",
            "dpc": "03023911301",
            "name": "ជួប រិទ្ធី"
        },
        {
            "barcode": "171134915",
            "dpc": "03023911401",
            "name": "ម៉ា សល់"
        },
        {
            "barcode": "171134916",
            "dpc": "03023911501",
            "name": "អៀង ខាន់យ៉ា"
        },
        {
            "barcode": "171134917",
            "dpc": "03023911601",
            "name": "មាស សុខុម"
        },
        {
            "barcode": "171134918",
            "dpc": "03023911701",
            "name": "ទី សុផល"
        },
        {
            "barcode": "171134919",
            "dpc": "03023911801",
            "name": "ម៉ៅ ដាលី"
        },
        {
            "barcode": "171134920",
            "dpc": "03023911901",
            "name": "រដ្ឋ រឿន"
        },
        {
            "barcode": "171134921",
            "dpc": "03023912001",
            "name": "ហេង រ៉ា"
        },
        {
            "barcode": "171134922",
            "dpc": "03023912101",
            "name": "ដួង ចាន់ថន"
        },
        {
            "barcode": "171134923",
            "dpc": "03023912201",
            "name": "អ៊ឹម រិន"
        },
        {
            "barcode": "171134924",
            "dpc": "03023912301",
            "name": "វីរះ សុណ្ណារ៉ុង"
        },
        {
            "barcode": "171134925",
            "dpc": "03023912401",
            "name": "ប្រាក់ សាមឿន"
        },
        {
            "barcode": "171134926",
            "dpc": "03023912501",
            "name": "អ៊ួង ម៉ានី"
        },
        {
            "barcode": "171134927",
            "dpc": "03023912601",
            "name": "ឡុង វី"
        },
        {
            "barcode": "171134928",
            "dpc": "03023912701",
            "name": "រត័្ន សាវី"
        },
        {
            "barcode": "171134929",
            "dpc": "03023912801",
            "name": "អុន រ៉ាណ"
        },
        {
            "barcode": "171134930",
            "dpc": "03023912901",
            "name": "រៀម យន"
        },
        {
            "barcode": "171134931",
            "dpc": "03023913001",
            "name": "មាស វ៉ុន"
        },
        {
            "barcode": "171134932",
            "dpc": "03023913101",
            "name": "ព្រំ ភូរ៉ាត់"
        },
        {
            "barcode": "171134933",
            "dpc": "03023913201",
            "name": "យិន ប៊ុនតេន"
        },
        {
            "barcode": "171134934",
            "dpc": "03023913301",
            "name": "ឡាម សារ៉ុម"
        },
        {
            "barcode": "171134935",
            "dpc": "03023913501",
            "name": "រស់ រីម"
        },
        {
            "barcode": "171134936",
            "dpc": "03023913601",
            "name": "គីម សម្បត្តិ"
        },
        {
            "barcode": "171134937",
            "dpc": "03023913701",
            "name": "ស៊ិន ឈុនលី"
        },
        {
            "barcode": "171134938",
            "dpc": "03023913801",
            "name": "គូរ ខ្លា"
        },
        {
            "barcode": "171134939",
            "dpc": "03023913901",
            "name": "ស៊ុន ចិន្តា"
        },
        {
            "barcode": "171134940",
            "dpc": "03023914001",
            "name": "អ៊ូ យ៉ាន"
        },
        {
            "barcode": "171134941",
            "dpc": "03023914101",
            "name": "តី ដានី"
        },
        {
            "barcode": "171134942",
            "dpc": "03023914301",
            "name": "ឈុន លី"
        },
        {
            "barcode": "171134943",
            "dpc": "03023914401",
            "name": "សី សារី"
        },
        {
            "barcode": "171134944",
            "dpc": "03023914601",
            "name": "លី ប៊ិត"
        },
        {
            "barcode": "171134945",
            "dpc": "03023914701",
            "name": "ពេជ្រ សាខន"
        },
        {
            "barcode": "171134946",
            "dpc": "03023914801",
            "name": "លឹម ចន័្ទ"
        },
        {
            "barcode": "171134947",
            "dpc": "03023914901",
            "name": "ហម ភឿន"
        },
        {
            "barcode": "171134948",
            "dpc": "03023915001",
            "name": "ឈន កំសត់"
        },
        {
            "barcode": "171134949",
            "dpc": "03023915101",
            "name": "ប៉ិច ញ៉ាក់"
        },
        {
            "barcode": "171134950",
            "dpc": "03023915201",
            "name": "សី រិទ្ធី"
        },
        {
            "barcode": "171134951",
            "dpc": "03023915301",
            "name": "ប៉ែន កិ"
        },
        {
            "barcode": "171134952",
            "dpc": "03023915501",
            "name": "សួស សុផល"
        },
        {
            "barcode": "171134953",
            "dpc": "03023915601",
            "name": "សៅ សុភឿន"
        },
        {
            "barcode": "171134954",
            "dpc": "03023915701",
            "name": "មូល សុវត្តិ"
        },
        {
            "barcode": "171134955",
            "dpc": "03023915801",
            "name": "គង់ សុឃន"
        },
        {
            "barcode": "171134956",
            "dpc": "03023915901",
            "name": "ម៉ាង គា"
        },
        {
            "barcode": "171134957",
            "dpc": "03023916001",
            "name": "ប៉ុក ស៊ិប"
        },
        {
            "barcode": "171134958",
            "dpc": "03023916101",
            "name": "ណុប ចាន់បូរ៉ា"
        },
        {
            "barcode": "171134959",
            "dpc": "03023916201",
            "name": "ធួន រ៉ាវុធ"
        },
        {
            "barcode": "171134960",
            "dpc": "03023916301",
            "name": "ណុប ណារ៉ា១"
        },
        {
            "barcode": "171134961",
            "dpc": "03023916401",
            "name": "ណុប ណារ៉ា២"
        },
        {
            "barcode": "171134962",
            "dpc": "03023916501",
            "name": "ណុប ណារ៉ា៣"
        },
        {
            "barcode": "171134963",
            "dpc": "03023916601",
            "name": "ណុប ណារ៉ា២៤"
        },
        {
            "barcode": "171134964",
            "dpc": "03023916701",
            "name": "សួង យ៉ាន់"
        },
        {
            "barcode": "171134965",
            "dpc": "03023916801",
            "name": "តាំង ស៊ូគៀវ"
        },
        {
            "barcode": "171134966",
            "dpc": "03023916901",
            "name": "ញ៉ែម ឡា"
        },
        {
            "barcode": "171134967",
            "dpc": "03023917001",
            "name": "ឈិន ឃឿន"
        },
        {
            "barcode": "171134968",
            "dpc": "03023917101",
            "name": "នៅ ចាន់ណា"
        },
        {
            "barcode": "171134969",
            "dpc": "03023917201",
            "name": "ឈឿន សុភឿត"
        },
        {
            "barcode": "171134970",
            "dpc": "03023917301",
            "name": "កង់ នី"
        },
        {
            "barcode": "171134971",
            "dpc": "03023917401",
            "name": "យិន លាងឆេង"
        },
        {
            "barcode": "171134972",
            "dpc": "03023917501",
            "name": "សម្ព័នយុវជនម៉ូស្លីម"
        },
        {
            "barcode": "171134973",
            "dpc": "03023917601",
            "name": "ឡៅ ប៉ោជូ"
        },
        {
            "barcode": "171134974",
            "dpc": "03023917701",
            "name": "ពៅ សុខជា"
        },
        {
            "barcode": "171134975",
            "dpc": "03023917801",
            "name": "សំ សំណាង"
        },
        {
            "barcode": "171134976",
            "dpc": "03023917901",
            "name": "ស្លេះ ម៉ារីយ៉ាន"
        },
        {
            "barcode": "171134977",
            "dpc": "03023918001",
            "name": "ណៃ ណាម"
        },
        {
            "barcode": "171134978",
            "dpc": "03023918101",
            "name": "ព្រឿង ផារ៉ាត់"
        },
        {
            "barcode": "171134979",
            "dpc": "03023918201",
            "name": "ហេង តេង"
        },
        {
            "barcode": "171134980",
            "dpc": "03023918301",
            "name": "ភុន ហ៊ួង"
        },
        {
            "barcode": "171134981",
            "dpc": "03023918401",
            "name": "វឹង វុទ្ធី១"
        },
        {
            "barcode": "171134982",
            "dpc": "03023918501",
            "name": "គង់ រដ្ឋា"
        },
        {
            "barcode": "171134983",
            "dpc": "03023918601",
            "name": "ងួន ហួត"
        },
        {
            "barcode": "171134984",
            "dpc": "03023918701",
            "name": "ជ័យ ចក់២"
        },
        {
            "barcode": "171134985",
            "dpc": "03023918801",
            "name": "ឈុន អូន"
        },
        {
            "barcode": "171134986",
            "dpc": "03023918901",
            "name": "ឃិន អឿន"
        },
        {
            "barcode": "171134987",
            "dpc": "03023919001",
            "name": "វឹង វុទ្ធី១"
        },
        {
            "barcode": "171134988",
            "dpc": "03023919101",
            "name": "ឃឹម ម៉ន"
        },
        {
            "barcode": "171134989",
            "dpc": "03023919201",
            "name": "ញឹម គន្ធា"
        },
        {
            "barcode": "171134990",
            "dpc": "03023919401",
            "name": "ឯក ជីវ័ន"
        },
        {
            "barcode": "171134991",
            "dpc": "03023919501",
            "name": "សាន់ ម៉ាត់លី"
        },
        {
            "barcode": "171134992",
            "dpc": "03023919601",
            "name": "យើ នូរី"
        },
        {
            "barcode": "171134993",
            "dpc": "03023919701",
            "name": "នូ សំណាង"
        },
        {
            "barcode": "171134994",
            "dpc": "03023919801",
            "name": "ណា រ៉ាមនោរិទ្ទ"
        },
        {
            "barcode": "171134995",
            "dpc": "03023919901",
            "name": "ស៊ុប ហ្វារីត"
        },
        {
            "barcode": "171134996",
            "dpc": "03023920001",
            "name": "គុណ សុវណ្ណដា"
        },
        {
            "barcode": "171134997",
            "dpc": "03023920101",
            "name": "សុន ចាន់ធា"
        },
        {
            "barcode": "171134998",
            "dpc": "03023920201",
            "name": "តឿង តុន"
        },
        {
            "barcode": "171134999",
            "dpc": "03023920401",
            "name": "ណាស់ ឡោះ"
        },
        {
            "barcode": "171135000",
            "dpc": "03023920501",
            "name": "ឡស់ លីម"
        },
        {
            "barcode": "171135001",
            "dpc": "03023920601",
            "name": "ប្រាក់ ស៊ុន"
        },
        {
            "barcode": "171135002",
            "dpc": "03023920701",
            "name": "សុខ រឿត"
        },
        {
            "barcode": "171135003",
            "dpc": "03023920801",
            "name": "ស៊ុន ណង"
        },
        {
            "barcode": "171135004",
            "dpc": "03023920901",
            "name": "ស៊ុន សំបូរ"
        },
        {
            "barcode": "171135005",
            "dpc": "03023921001",
            "name": "សុខ ពូក"
        },
        {
            "barcode": "171135006",
            "dpc": "03023921101",
            "name": "ឯល យើ"
        },
        {
            "barcode": "171135007",
            "dpc": "03023921201",
            "name": "សូ ពេជ្រ"
        },
        {
            "barcode": "171135008",
            "dpc": "03023921301",
            "name": "វិន វីឆៃ"
        },
        {
            "barcode": "171135009",
            "dpc": "03023921401",
            "name": "ភឿន សម្ជស្ស"
        },
        {
            "barcode": "171135010",
            "dpc": "03023921501",
            "name": "ផេង សេរី"
        },
        {
            "barcode": "171135011",
            "dpc": "03023921601",
            "name": "អ៊ិន នៅ"
        },
        {
            "barcode": "171135012",
            "dpc": "03023921701",
            "name": "សួស រ៉ន"
        },
        {
            "barcode": "171135013",
            "dpc": "03023921801",
            "name": "អឿន សម្បត្តិ"
        },
        {
            "barcode": "171135014",
            "dpc": "03023921901",
            "name": "ខឹម សេង"
        },
        {
            "barcode": "171135015",
            "dpc": "03023922101",
            "name": "ហ៊ីម ណារិទ្ធ"
        },
        {
            "barcode": "171135016",
            "dpc": "03023922201",
            "name": "វណ្ណ យន"
        },
        {
            "barcode": "171135017",
            "dpc": "03023922301",
            "name": "លឹម វ៉េងគៀង"
        },
        {
            "barcode": "171135018",
            "dpc": "03023922401",
            "name": "ផ្លុង ដារ៉ា"
        },
        {
            "barcode": "171135019",
            "dpc": "03023922501",
            "name": "វ៉ាន់ ស្រីទូច"
        },
        {
            "barcode": "171135020",
            "dpc": "03023922601",
            "name": "ចែម ដាណា"
        },
        {
            "barcode": "171135021",
            "dpc": "03023922701",
            "name": "ហ៊ុត ផារិទ្ធ"
        },
        {
            "barcode": "171135022",
            "dpc": "03023922801",
            "name": "ស៊ី សំប៊ុន"
        },
        {
            "barcode": "171135023",
            "dpc": "03023922901",
            "name": "សុខ សុគុណ"
        },
        {
            "barcode": "171135024",
            "dpc": "03023923001",
            "name": "អ៊ុន វណ្ណះ"
        },
        {
            "barcode": "171135025",
            "dpc": "03023923101",
            "name": "លក ឆាយលី"
        },
        {
            "barcode": "171135026",
            "dpc": "03023923201",
            "name": "ឈ ហ៊ូ"
        },
        {
            "barcode": "171135027",
            "dpc": "03023923301",
            "name": "អ៊ុក សុភានាថ"
        },
        {
            "barcode": "171135028",
            "dpc": "03023923401",
            "name": "ជិន សម័យ"
        },
        {
            "barcode": "171135029",
            "dpc": "03023923501",
            "name": "មឿន សុទ្ធ"
        },
        {
            "barcode": "171135030",
            "dpc": "03023923601",
            "name": "ហេង កន្និកា"
        },
        {
            "barcode": "171135031",
            "dpc": "03023923801",
            "name": "ណូត ស៊ីនួន"
        },
        {
            "barcode": "171135032",
            "dpc": "03023923901",
            "name": "ជា សំអូន"
        },
        {
            "barcode": "171135033",
            "dpc": "03023924001",
            "name": "បុង រិទ្ធីរ៉េន"
        },
        {
            "barcode": "171135034",
            "dpc": "03023924101",
            "name": "ប្រាក់ ចាន់ឌី"
        },
        {
            "barcode": "171135035",
            "dpc": "03023924201",
            "name": "សឹង ចំរើន"
        },
        {
            "barcode": "171135036",
            "dpc": "03023924401",
            "name": "ចន្ទ សុភាព"
        },
        {
            "barcode": "171135037",
            "dpc": "03023924601",
            "name": "គូ ចន្ទ្រា"
        },
        {
            "barcode": "171135038",
            "dpc": "03023924701",
            "name": "ជី គីមីសៀង"
        },
        {
            "barcode": "171135039",
            "dpc": "03023924801",
            "name": "ហួត ឈុន"
        },
        {
            "barcode": "171135040",
            "dpc": "03023924901",
            "name": "ស៊ុត លីម"
        },
        {
            "barcode": "171135041",
            "dpc": "03023925001",
            "name": "ឌឿន រ៉េត"
        },
        {
            "barcode": "171135042",
            "dpc": "03023925101",
            "name": "ស៊ិន សាវុធ"
        },
        {
            "barcode": "171135043",
            "dpc": "03023925201",
            "name": "ប៊ុន ឆឿន"
        },
        {
            "barcode": "171135044",
            "dpc": "03023925401",
            "name": "ឯម សុវណ្ណារី"
        },
        {
            "barcode": "171135045",
            "dpc": "03023925501",
            "name": "អ៊ឹង ហេងគ្រុប២"
        },
        {
            "barcode": "171135046",
            "dpc": "03023925601",
            "name": "យ៉េង កុសល់"
        },
        {
            "barcode": "171135047",
            "dpc": "03023925701",
            "name": "ព្រំ​ ផន"
        },
        {
            "barcode": "171135048",
            "dpc": "03023925801",
            "name": "យ៉ែម ទូច"
        },
        {
            "barcode": "171135049",
            "dpc": "03023925901",
            "name": "អឿន សុវណ្ណរ៉ា"
        },
        {
            "barcode": "171135050",
            "dpc": "03023926101",
            "name": "លី ឃុនរ៉ាត់"
        },
        {
            "barcode": "171135051",
            "dpc": "03023926201",
            "name": "ផាន ចាន់ថន"
        },
        {
            "barcode": "171135052",
            "dpc": "03023926301",
            "name": "រស់ មឿត"
        },
        {
            "barcode": "171135053",
            "dpc": "03023926401",
            "name": "កូន ហ៊ិម"
        },
        {
            "barcode": "171135054",
            "dpc": "03023926501",
            "name": "សេង ធឿក"
        },
        {
            "barcode": "171135055",
            "dpc": "03023926701",
            "name": "អិន កេត"
        },
        {
            "barcode": "171135056",
            "dpc": "03023926801",
            "name": "សួស ផល្លា"
        },
        {
            "barcode": "171135057",
            "dpc": "03023926901",
            "name": "នូវ សំណាង"
        },
        {
            "barcode": "171135058",
            "dpc": "03023927001",
            "name": "មៃ ខេម"
        },
        {
            "barcode": "171135059",
            "dpc": "03023927101",
            "name": "ជា សូរិយា"
        },
        {
            "barcode": "171135060",
            "dpc": "03023927201",
            "name": "វ៉ាន់ ថា"
        },
        {
            "barcode": "171135061",
            "dpc": "03023927301",
            "name": "ហេង សិរីវឌ្ឍនះ"
        },
        {
            "barcode": "171135062",
            "dpc": "03023927401",
            "name": "តាំង ប៊ុនណាន"
        },
        {
            "barcode": "171135063",
            "dpc": "03023927601",
            "name": "កា សាលី"
        },
        {
            "barcode": "171135064",
            "dpc": "03023927701",
            "name": "អែល រ៉ូស្សា"
        },
        {
            "barcode": "171135065",
            "dpc": "03023927801",
            "name": "លឹម កេស្មី"
        },
        {
            "barcode": "171135066",
            "dpc": "03023927901",
            "name": "ម៉ាន់ ព្រីត"
        },
        {
            "barcode": "171135067",
            "dpc": "03023928001",
            "name": "សុះ ម៉ៅ"
        },
        {
            "barcode": "171135068",
            "dpc": "03023928101",
            "name": "តាំង ស៊ីវជីន"
        },
        {
            "barcode": "171135069",
            "dpc": "03023928201",
            "name": "ម៉ាន លី"
        },
        {
            "barcode": "171135070",
            "dpc": "03023928301",
            "name": "ឡោះ ម៉ាត់"
        },
        {
            "barcode": "171135071",
            "dpc": "03023928401",
            "name": "ម៉ុន សុខុម"
        },
        {
            "barcode": "171135072",
            "dpc": "03023928501",
            "name": "បឋមសិក្សាក្តុល"
        },
        {
            "barcode": "171135073",
            "dpc": "03023928601",
            "name": "ឃ្លោក ម៉ក់"
        },
        {
            "barcode": "171135074",
            "dpc": "03023928701",
            "name": "ប៉ា ប៉ូ"
        },
        {
            "barcode": "171135075",
            "dpc": "03023928801",
            "name": "លី សារី"
        },
        {
            "barcode": "171135076",
            "dpc": "03023928901",
            "name": "ហ៊ាង រស្មី"
        },
        {
            "barcode": "171135077",
            "dpc": "03023929001",
            "name": "ពិន យ៉ា"
        },
        {
            "barcode": "171135078",
            "dpc": "03023929101",
            "name": "ឃូ លីមជីវ"
        },
        {
            "barcode": "171135079",
            "dpc": "03023929201",
            "name": "ប៉ិច សុផល"
        },
        {
            "barcode": "171135080",
            "dpc": "03023929301",
            "name": "សួង សាវ៉េត"
        },
        {
            "barcode": "171135081",
            "dpc": "03023929401",
            "name": "តែម ធានី"
        },
        {
            "barcode": "171135082",
            "dpc": "03023929501",
            "name": "អោម ពន្លក"
        },
        {
            "barcode": "171135083",
            "dpc": "03023929601",
            "name": "សួង គាន"
        },
        {
            "barcode": "171135084",
            "dpc": "03023929801",
            "name": "ស៊ុន ធឿន"
        },
        {
            "barcode": "171135085",
            "dpc": "03023929901",
            "name": "ឃ្ងិន សុម៉ាលី"
        },
        {
            "barcode": "171135086",
            "dpc": "03023930001",
            "name": "សឹម សុខ"
        },
        {
            "barcode": "171135087",
            "dpc": "03023930101",
            "name": "ជា អាន"
        },
        {
            "barcode": "171135088",
            "dpc": "03023930201",
            "name": "ឡោក ហឿម"
        },
        {
            "barcode": "171135089",
            "dpc": "03023930301",
            "name": "ហ៊ួត គឹមលាង"
        },
        {
            "barcode": "171135090",
            "dpc": "03023930401",
            "name": "ឌិន វណ្ណា"
        },
        {
            "barcode": "171135091",
            "dpc": "03023930501",
            "name": "ឌិន វ៉ាន់ឌី"
        },
        {
            "barcode": "171135092",
            "dpc": "03023930601",
            "name": "ជួប សុខុម"
        },
        {
            "barcode": "171135093",
            "dpc": "03023930701",
            "name": "ឌិន វ៉ាន់ដា"
        },
        {
            "barcode": "171135094",
            "dpc": "03023930801",
            "name": "សាន មករា"
        },
        {
            "barcode": "171135095",
            "dpc": "03023930901",
            "name": "ឃ្លិន និវឌ្ឍន៍"
        },
        {
            "barcode": "171135096",
            "dpc": "03023931001",
            "name": "ហ៊ួត ពេញ"
        },
        {
            "barcode": "171135097",
            "dpc": "03023931101",
            "name": "ហ៊ួត សំបូរ"
        },
        {
            "barcode": "171135098",
            "dpc": "03023931301",
            "name": "ហួត ចន្ថា"
        },
        {
            "barcode": "171135099",
            "dpc": "03023931401",
            "name": "ហ៊ួត ចាន់ឌី"
        },
        {
            "barcode": "171135100",
            "dpc": "03023931501",
            "name": "ហ៊ួត ចាន់ដេត"
        },
        {
            "barcode": "171135101",
            "dpc": "03023931601",
            "name": "ហ៊ុន ចៅសម្បត្តិ"
        },
        {
            "barcode": "171135102",
            "dpc": "03023931701",
            "name": "ព ពៅ"
        },
        {
            "barcode": "171135103",
            "dpc": "03023931801",
            "name": "អ៊ូ អ៊ុន"
        },
        {
            "barcode": "171135104",
            "dpc": "03023931901",
            "name": "រុន ចាន់និត"
        },
        {
            "barcode": "171135105",
            "dpc": "03023932001",
            "name": "ហ៊ិន វ៉ាន់នាងសូលីដា"
        },
        {
            "barcode": "171135106",
            "dpc": "03023932101",
            "name": "ឃឿន ខឿត"
        },
        {
            "barcode": "171135107",
            "dpc": "03023932201",
            "name": "ហ៊ួត សុផល"
        },
        {
            "barcode": "171135108",
            "dpc": "03023932301",
            "name": "គង់ គូររុន"
        },
        {
            "barcode": "171135109",
            "dpc": "03023932401",
            "name": "មល់ សុដានី"
        },
        {
            "barcode": "171135110",
            "dpc": "03023932501",
            "name": "ឡោក ហឿត"
        },
        {
            "barcode": "171135111",
            "dpc": "03023932601",
            "name": "ហ៊ន ឈុនលី"
        },
        {
            "barcode": "171135112",
            "dpc": "03023932701",
            "name": "ចែត្រ ឌឿន"
        },
        {
            "barcode": "171135113",
            "dpc": "03023932801",
            "name": "ប៊ុន សុខេង"
        },
        {
            "barcode": "171135114",
            "dpc": "03023932901",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "171135115",
            "dpc": "03023933001",
            "name": "ពេជ្រ សាវរ៉ា"
        },
        {
            "barcode": "171135116",
            "dpc": "03023933101",
            "name": "ពេជ្រ សារួន"
        },
        {
            "barcode": "171135117",
            "dpc": "03023933201",
            "name": "វ៉ាន់ ថន"
        },
        {
            "barcode": "171135118",
            "dpc": "03023933301",
            "name": "ឯម សោភ័ណ្ឌ"
        },
        {
            "barcode": "171135119",
            "dpc": "03023933401",
            "name": "ឈូក សុភាព"
        },
        {
            "barcode": "171135120",
            "dpc": "03023933501",
            "name": "រស់ សានិត"
        },
        {
            "barcode": "171135121",
            "dpc": "03023933601",
            "name": "ធឿន សំណាង"
        },
        {
            "barcode": "171135122",
            "dpc": "03023933701",
            "name": "អិត ធឿន"
        },
        {
            "barcode": "171135123",
            "dpc": "03023933801",
            "name": "កង សុខា"
        },
        {
            "barcode": "171135124",
            "dpc": "03023933901",
            "name": "ពិន ចាន់ឡា"
        },
        {
            "barcode": "171135125",
            "dpc": "03023934001",
            "name": "ពិន ថាវរិន"
        },
        {
            "barcode": "171135126",
            "dpc": "03023934101",
            "name": "បូ មុំ"
        },
        {
            "barcode": "171135127",
            "dpc": "03023934201",
            "name": "បូ សុខខូ"
        },
        {
            "barcode": "171135128",
            "dpc": "03023934301",
            "name": "កង រំ"
        },
        {
            "barcode": "171135129",
            "dpc": "03023934401",
            "name": "សំ រិន"
        },
        {
            "barcode": "171135130",
            "dpc": "03023934501",
            "name": "ខេង សំនៀង"
        },
        {
            "barcode": "171135131",
            "dpc": "03023934601",
            "name": "ជា ឆុន"
        },
        {
            "barcode": "171135132",
            "dpc": "03023934701",
            "name": "ថោង សារឿន"
        },
        {
            "barcode": "171135133",
            "dpc": "03023934801",
            "name": "ស្រី​ សុភី"
        },
        {
            "barcode": "171135134",
            "dpc": "03023934901",
            "name": "សាត គឿន"
        },
        {
            "barcode": "171135135",
            "dpc": "03023935001",
            "name": "ចាន់ អៃ"
        },
        {
            "barcode": "171135136",
            "dpc": "03023935101",
            "name": "គង់ កង"
        },
        {
            "barcode": "171135137",
            "dpc": "03023935201",
            "name": "គង់ សុភា"
        },
        {
            "barcode": "171135138",
            "dpc": "03023935301",
            "name": "អុល អឿន"
        },
        {
            "barcode": "171135139",
            "dpc": "03023935401",
            "name": "សំ ណារិទ្ថ"
        },
        {
            "barcode": "171135140",
            "dpc": "03023935501",
            "name": "សឿន សុខា"
        },
        {
            "barcode": "171135141",
            "dpc": "03023935601",
            "name": "ផន រឿម"
        },
        {
            "barcode": "171135142",
            "dpc": "03023935701",
            "name": "ម៉ន សារ៉ង"
        },
        {
            "barcode": "171135143",
            "dpc": "03023935801",
            "name": "ស ច្រិប"
        },
        {
            "barcode": "171135144",
            "dpc": "03023935901",
            "name": "ប៉ាន យឿត"
        },
        {
            "barcode": "171135145",
            "dpc": "03023936001",
            "name": "មល់ សក្ត័"
        },
        {
            "barcode": "171135146",
            "dpc": "03023936101",
            "name": "ទី កី"
        },
        {
            "barcode": "171135147",
            "dpc": "03023936201",
            "name": "ថ្លាង សឹម"
        },
        {
            "barcode": "171135148",
            "dpc": "03023936301",
            "name": "ហុក វណ្ណី"
        },
        {
            "barcode": "171135149",
            "dpc": "03023936501",
            "name": "ប៉ែន វុទ្ធី"
        },
        {
            "barcode": "171135150",
            "dpc": "03023936601",
            "name": "ញ៉ក ភាន"
        },
        {
            "barcode": "171135151",
            "dpc": "03023936701",
            "name": "ហម មឿន"
        },
        {
            "barcode": "171135152",
            "dpc": "03023936801",
            "name": "ឈឿន ឈឿត"
        },
        {
            "barcode": "171135153",
            "dpc": "03023936901",
            "name": "រឿន ហុក"
        },
        {
            "barcode": "171135154",
            "dpc": "03023937001",
            "name": "ឡឹក សារ៉ាត់"
        },
        {
            "barcode": "171135155",
            "dpc": "03023937101",
            "name": "រ៉ែម មុំ"
        },
        {
            "barcode": "171135156",
            "dpc": "03023937201",
            "name": "រ៉ែម រ៉ាន់"
        },
        {
            "barcode": "171135157",
            "dpc": "03023937301",
            "name": "ផន ប៊ុនថន"
        },
        {
            "barcode": "171135158",
            "dpc": "03023937401",
            "name": "គីម សុខវណ្ណា"
        },
        {
            "barcode": "171135159",
            "dpc": "03023937501",
            "name": "ហ៊រ យ៉ៃ"
        },
        {
            "barcode": "171135160",
            "dpc": "03023937601",
            "name": "ហ៊រ ជួប"
        },
        {
            "barcode": "171135161",
            "dpc": "03023937701",
            "name": "ញ៉ែម សារ៉េត"
        },
        {
            "barcode": "171135162",
            "dpc": "03023937801",
            "name": "ជេស គឹមសល់"
        },
        {
            "barcode": "171135163",
            "dpc": "03023937901",
            "name": "ខ្លូត សៀក"
        },
        {
            "barcode": "171135164",
            "dpc": "03023938001",
            "name": "ម៉ែន ស្រស់"
        },
        {
            "barcode": "171135165",
            "dpc": "03023938101",
            "name": "ម៉ែន វី"
        },
        {
            "barcode": "171135166",
            "dpc": "03023938201",
            "name": "ផឹក ផាន់នេ"
        },
        {
            "barcode": "171135167",
            "dpc": "03023938301",
            "name": "ស្វាយ រចនា"
        },
        {
            "barcode": "171135168",
            "dpc": "03023938401",
            "name": "រ័ត្ន វាន់យ៉ា"
        },
        {
            "barcode": "171135169",
            "dpc": "03023938501",
            "name": "គង់ ផ្លសា"
        },
        {
            "barcode": "171135170",
            "dpc": "03023938601",
            "name": "វ៉ាត់ សឺត"
        },
        {
            "barcode": "171135171",
            "dpc": "03023938701",
            "name": "វុន សំណាង"
        },
        {
            "barcode": "171135172",
            "dpc": "03023938801",
            "name": "ភី ចាន់ដារ៉ា"
        },
        {
            "barcode": "171135173",
            "dpc": "03023938901",
            "name": "ខាវ វីរ៉ា"
        },
        {
            "barcode": "171135174",
            "dpc": "03023939001",
            "name": "រ៉េត ច្រិប"
        },
        {
            "barcode": "171135175",
            "dpc": "03023939101",
            "name": "សេង ប៊ុនសុង"
        },
        {
            "barcode": "171135176",
            "dpc": "03023939201",
            "name": "ប៊ុន ហុង"
        },
        {
            "barcode": "171135177",
            "dpc": "03023939301",
            "name": "ប៉ិច យូហាក់"
        },
        {
            "barcode": "171135178",
            "dpc": "03023939401",
            "name": "ឡោះ តាំ"
        },
        {
            "barcode": "171135179",
            "dpc": "03023939501",
            "name": "រិន សារ៉ន"
        },
        {
            "barcode": "171135180",
            "dpc": "03023939601",
            "name": "ផាន់ សច្ចា"
        },
        {
            "barcode": "171135181",
            "dpc": "03023939701",
            "name": "លី ចាន់ថា"
        },
        {
            "barcode": "171135182",
            "dpc": "03023939801",
            "name": "ស្រស់ មៃសុំ"
        },
        {
            "barcode": "171135183",
            "dpc": "03023939901",
            "name": "ម៉ាត់ ម៉ាស់"
        },
        {
            "barcode": "171135184",
            "dpc": "03023940001",
            "name": "អ៊ុង វត្ថា"
        },
        {
            "barcode": "171135185",
            "dpc": "03023940101",
            "name": "ប៉ាក់ ហ៊ូរ"
        },
        {
            "barcode": "171135186",
            "dpc": "03023940201",
            "name": "លី ឆេង"
        },
        {
            "barcode": "171135187",
            "dpc": "03023940301",
            "name": "អ៊ិត ឆា"
        },
        {
            "barcode": "171135188",
            "dpc": "03023940401",
            "name": "ឈុន សារ៉ន"
        },
        {
            "barcode": "171135189",
            "dpc": "03023940501",
            "name": "ហឿត សុដារី"
        },
        {
            "barcode": "171135190",
            "dpc": "03023940601",
            "name": "យុន ខ្ចៅ"
        },
        {
            "barcode": "171135191",
            "dpc": "03023940701",
            "name": "ជៀម ថោង"
        },
        {
            "barcode": "171135192",
            "dpc": "03023940801",
            "name": "ឡោក សាវុធ"
        },
        {
            "barcode": "171135193",
            "dpc": "03023940901",
            "name": "អ៊ុត ភក្តី"
        },
        {
            "barcode": "171135194",
            "dpc": "03023941001",
            "name": "សុង សុភាព"
        },
        {
            "barcode": "171135195",
            "dpc": "03023941101",
            "name": "កៅ កង"
        },
        {
            "barcode": "171135196",
            "dpc": "03023941201",
            "name": "សួង សាវុទ្ទ"
        },
        {
            "barcode": "171135197",
            "dpc": "03023941301",
            "name": "សារិន ឃីម"
        },
        {
            "barcode": "171135198",
            "dpc": "03023941401",
            "name": "មេត ដារី"
        },
        {
            "barcode": "171135199",
            "dpc": "03023941601",
            "name": "កឹម រ៉េត"
        },
        {
            "barcode": "171135200",
            "dpc": "03023941701",
            "name": "តឹក ពា"
        },
        {
            "barcode": "171135201",
            "dpc": "03023941801",
            "name": "សាលាបាយវត្តពោធិវង្ស"
        },
        {
            "barcode": "171135202",
            "dpc": "03023941901",
            "name": "សុខ សុភី"
        },
        {
            "barcode": "171135203",
            "dpc": "03023942001",
            "name": "សឹម ចន្នី"
        },
        {
            "barcode": "171135204",
            "dpc": "03023942101",
            "name": "សៅ សុធា"
        },
        {
            "barcode": "171135205",
            "dpc": "03023942201",
            "name": "សយ ផាត"
        },
        {
            "barcode": "171135206",
            "dpc": "03023942301",
            "name": "មួង សុខវាសនា"
        },
        {
            "barcode": "171135207",
            "dpc": "03023942401",
            "name": "ហេង លាង"
        },
        {
            "barcode": "171135208",
            "dpc": "03023942501",
            "name": "សេង សឿម"
        },
        {
            "barcode": "171135209",
            "dpc": "03023942601",
            "name": "សុង សំឡី"
        },
        {
            "barcode": "171135210",
            "dpc": "03023942701",
            "name": "សុច សាវឿង"
        },
        {
            "barcode": "171135211",
            "dpc": "03023942801",
            "name": "រឿត បូរ"
        },
        {
            "barcode": "171135212",
            "dpc": "03023942901",
            "name": "ង៉ុយ រឿត"
        },
        {
            "barcode": "171135213",
            "dpc": "03023943001",
            "name": "ឌួង សាវុធ"
        },
        {
            "barcode": "171135214",
            "dpc": "03023943101",
            "name": "រឿត បូរ២"
        },
        {
            "barcode": "171135215",
            "dpc": "03023943201",
            "name": "កៀត សុជាតិ"
        },
        {
            "barcode": "171135216",
            "dpc": "03023943301",
            "name": "រ៉ាន សំអឿន"
        },
        {
            "barcode": "171135217",
            "dpc": "03023943401",
            "name": "លាយ រៀម"
        },
        {
            "barcode": "171135218",
            "dpc": "03023943501",
            "name": "អ៊ីត ម៉ុន"
        },
        {
            "barcode": "171135219",
            "dpc": "03023943601",
            "name": "វ៉ាន់ សុផាត"
        },
        {
            "barcode": "171135220",
            "dpc": "03023943701",
            "name": "ឡុង ស៊ីថា"
        },
        {
            "barcode": "171135221",
            "dpc": "03023943801",
            "name": "អាន់ មុំ"
        },
        {
            "barcode": "171135222",
            "dpc": "03023943901",
            "name": "ស៊ត ឡុង"
        },
        {
            "barcode": "171135223",
            "dpc": "03023944001",
            "name": "ខន ត្រប់"
        },
        {
            "barcode": "171135224",
            "dpc": "03023944101",
            "name": "សៀ សៅលីន"
        },
        {
            "barcode": "171135225",
            "dpc": "03023944201",
            "name": "វិន វ៉ិត"
        },
        {
            "barcode": "171135226",
            "dpc": "03023944301",
            "name": "ទូច សុភាព"
        },
        {
            "barcode": "171135227",
            "dpc": "03023944401",
            "name": "រួន រិត"
        },
        {
            "barcode": "171135228",
            "dpc": "03023944501",
            "name": "មាជ មាន"
        },
        {
            "barcode": "171135229",
            "dpc": "03023944601",
            "name": "ណក់ សារួង"
        },
        {
            "barcode": "171135230",
            "dpc": "03023944701",
            "name": "គីវ ពុជ"
        },
        {
            "barcode": "171135231",
            "dpc": "03023944801",
            "name": "សន កំសត់"
        },
        {
            "barcode": "171135232",
            "dpc": "03023944901",
            "name": "វ៉ន អូន"
        },
        {
            "barcode": "171135233",
            "dpc": "03023945101",
            "name": "យឿន យ៉ិត"
        },
        {
            "barcode": "171135234",
            "dpc": "03023945301",
            "name": "ឡុង សាលីំម"
        },
        {
            "barcode": "171135235",
            "dpc": "03023945401",
            "name": "សេង សុសាង"
        },
        {
            "barcode": "171135236",
            "dpc": "03023945501",
            "name": "ផែង ចំរើន"
        },
        {
            "barcode": "171135237",
            "dpc": "03023945601",
            "name": "ហឿន ធា"
        },
        {
            "barcode": "171135238",
            "dpc": "03023945701",
            "name": "កែម កាក់"
        },
        {
            "barcode": "171135239",
            "dpc": "03023945801",
            "name": "ឆាយ សំណាង"
        },
        {
            "barcode": "171135240",
            "dpc": "03023946001",
            "name": "រ៉ាត់ រ៉ូ"
        },
        {
            "barcode": "171135241",
            "dpc": "03023946101",
            "name": "សោម មករា"
        },
        {
            "barcode": "171135242",
            "dpc": "03023946201",
            "name": "រ៉ុម គុំ"
        },
        {
            "barcode": "171135243",
            "dpc": "03023946301",
            "name": "ឡុង សារឿន"
        },
        {
            "barcode": "171135244",
            "dpc": "03023946401",
            "name": "ប៉េង ប៊ាន"
        },
        {
            "barcode": "171135245",
            "dpc": "03023946501",
            "name": "ខន សារឿន"
        },
        {
            "barcode": "171135246",
            "dpc": "03023946601",
            "name": "ខន មករា"
        },
        {
            "barcode": "171135247",
            "dpc": "03023946701",
            "name": "តុប សុផល"
        },
        {
            "barcode": "171135248",
            "dpc": "03023946801",
            "name": "សេង សារិន"
        },
        {
            "barcode": "171135249",
            "dpc": "03023946901",
            "name": "ម៉ៅ រួប"
        },
        {
            "barcode": "171135250",
            "dpc": "03023947001",
            "name": "ស្មី"
        },
        {
            "barcode": "171135251",
            "dpc": "03023947101",
            "name": "ផា ឆឿប"
        },
        {
            "barcode": "171135252",
            "dpc": "03023947301",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "171135253",
            "dpc": "03023947701",
            "name": "សែន សារីទ្ធ"
        },
        {
            "barcode": "171135254",
            "dpc": "03023947901",
            "name": "ប៊ុន តុងបូរ៉ារិទ្ធ"
        },
        {
            "barcode": "171135255",
            "dpc": "03023948001",
            "name": "ឃឹម សាវ៉ឺន"
        }
    ];


barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
