let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171131285",
            "dpc": "03034000101",
            "name": "ជិន សុខុន"
        },
        {
            "barcode": "171131286",
            "dpc": "03034000201",
            "name": "ញ៉ាន វឿត"
        },
        {
            "barcode": "171131287",
            "dpc": "03034000301",
            "name": "សេក ចាន់ដារ៉ា"
        },
        {
            "barcode": "171131288",
            "dpc": "03034000401",
            "name": "ស៊ិន សុផល"
        },
        {
            "barcode": "171131289",
            "dpc": "03034000501",
            "name": "ស៊ាន សេត"
        },
        {
            "barcode": "171131290",
            "dpc": "03034000601",
            "name": "រួម ផន"
        },
        {
            "barcode": "171131291",
            "dpc": "03034000701",
            "name": "ជិន ពៅ"
        },
        {
            "barcode": "171131292",
            "dpc": "03034000801",
            "name": "ឆឹង មិន"
        },
        {
            "barcode": "171131293",
            "dpc": "03034000901",
            "name": "ថង ឡុង"
        },
        {
            "barcode": "171131294",
            "dpc": "03034001001",
            "name": "ង៉ែត ងិន"
        },
        {
            "barcode": "171131295",
            "dpc": "03034001201",
            "name": "ធន ថារី"
        },
        {
            "barcode": "171131296",
            "dpc": "03034001301",
            "name": "ងិន សំបូរ"
        },
        {
            "barcode": "171131297",
            "dpc": "03034001401",
            "name": "សុខ វ៉ាត់ធី"
        },
        {
            "barcode": "171131298",
            "dpc": "03034001501",
            "name": "ហួន ចិន្តា"
        },
        {
            "barcode": "171131299",
            "dpc": "03034001601",
            "name": "ឆាយ ចំណង់"
        },
        {
            "barcode": "171131300",
            "dpc": "03034001701",
            "name": "នឹង សុភាព"
        },
        {
            "barcode": "171131301",
            "dpc": "03034001801",
            "name": "ហុក វាសនា"
        },
        {
            "barcode": "171131302",
            "dpc": "03034001901",
            "name": "ប៊ិន វ៉ាន់នី"
        },
        {
            "barcode": "171131303",
            "dpc": "03034002001",
            "name": "យ៉ង់ វ៉ុន"
        },
        {
            "barcode": "171131304",
            "dpc": "03034002101",
            "name": "ចាប ស៊ីថា"
        },
        {
            "barcode": "171131305",
            "dpc": "03034002201",
            "name": "ហង្ស សីហា"
        },
        {
            "barcode": "171131306",
            "dpc": "03034002301",
            "name": "សុខ សំណាង"
        },
        {
            "barcode": "171131307",
            "dpc": "03034002401",
            "name": "កាន់ វិសេដ្ឋ"
        },
        {
            "barcode": "171131308",
            "dpc": "03034002501",
            "name": "ស៊ុន សុខុន"
        },
        {
            "barcode": "171131309",
            "dpc": "03034002601",
            "name": "ឈឿ រុក្ខា"
        },
        {
            "barcode": "171131310",
            "dpc": "03034002701",
            "name": "ឈឿត វុទ្ធី"
        },
        {
            "barcode": "171131311",
            "dpc": "03034002801",
            "name": "ឡេង គឹមទៀង"
        },
        {
            "barcode": "171131312",
            "dpc": "03034002901",
            "name": "ឃឿម សាវិញ"
        },
        {
            "barcode": "171131313",
            "dpc": "03034003001",
            "name": "កង ចាន់លី"
        },
        {
            "barcode": "171131314",
            "dpc": "03034003101",
            "name": "ជួន សុផុន"
        },
        {
            "barcode": "171131315",
            "dpc": "03034003201",
            "name": "ជួប ជឿប"
        },
        {
            "barcode": "171131316",
            "dpc": "03034003301",
            "name": "ភុំ សុជាតិ"
        },
        {
            "barcode": "171131317",
            "dpc": "03034003401",
            "name": "ប៊ី ឌឿន"
        },
        {
            "barcode": "171131318",
            "dpc": "03034003501",
            "name": "ជួប សុខណាំ"
        },
        {
            "barcode": "171131319",
            "dpc": "03034003601",
            "name": "ម៉េង ហុង"
        },
        {
            "barcode": "171131320",
            "dpc": "03034003701",
            "name": "វ៉ន សាវ័ន្ត"
        },
        {
            "barcode": "171131321",
            "dpc": "03034003801",
            "name": "ភុន ភៀង"
        },
        {
            "barcode": "171131322",
            "dpc": "03034003901",
            "name": "សេង សុខនី"
        },
        {
            "barcode": "171131323",
            "dpc": "03034004001",
            "name": "អុប វណ្ណី"
        },
        {
            "barcode": "171131324",
            "dpc": "03034004101",
            "name": "អុប យឿត"
        },
        {
            "barcode": "171131325",
            "dpc": "03034004201",
            "name": "ស៊ីម សឿន"
        },
        {
            "barcode": "171131326",
            "dpc": "03034004301",
            "name": "ឆម រដ្ឋា"
        },
        {
            "barcode": "171131327",
            "dpc": "03034004401",
            "name": "សឿត វ៉ាត"
        },
        {
            "barcode": "171131328",
            "dpc": "03034004501",
            "name": "យឿម សុភា"
        },
        {
            "barcode": "171131329",
            "dpc": "03034004601",
            "name": "បណ្ណាគារសន្តិភាព"
        },
        {
            "barcode": "171131330",
            "dpc": "03034004701",
            "name": "ងិន ម៉ាប់"
        },
        {
            "barcode": "171131331",
            "dpc": "03034004801",
            "name": "ហម សាវេត"
        },
        {
            "barcode": "171131332",
            "dpc": "03034004901",
            "name": "យឿន រ៉ម"
        },
        {
            "barcode": "171131333",
            "dpc": "03034005001",
            "name": "យឹម សោម"
        },
        {
            "barcode": "171131334",
            "dpc": "03034005101",
            "name": "សោម ភក្តី"
        },
        {
            "barcode": "171131335",
            "dpc": "03034005201",
            "name": "រ៉ុត សារ៉ូ"
        },
        {
            "barcode": "171131336",
            "dpc": "03034005301",
            "name": "ជួន ឆុត"
        },
        {
            "barcode": "171131337",
            "dpc": "03034005501",
            "name": "ឆុន ព្រុំ"
        },
        {
            "barcode": "171131338",
            "dpc": "03034005601",
            "name": "ខូវ វួតហៀង"
        },
        {
            "barcode": "171131339",
            "dpc": "03034005701",
            "name": "ហួ រដ្ឋា"
        },
        {
            "barcode": "171131340",
            "dpc": "03034005801",
            "name": "ជា ដារ៉ា"
        },
        {
            "barcode": "171131341",
            "dpc": "03034005901",
            "name": "នួន សិលា"
        },
        {
            "barcode": "171131342",
            "dpc": "03034006001",
            "name": "យុន ខេន"
        },
        {
            "barcode": "171131343",
            "dpc": "03034006101",
            "name": "សៀង សុគ្គន្ធ"
        },
        {
            "barcode": "171131344",
            "dpc": "03034006201",
            "name": "ណម សយ"
        },
        {
            "barcode": "171131345",
            "dpc": "03034006301",
            "name": "នុង ឡឹង"
        },
        {
            "barcode": "171131346",
            "dpc": "03034006401",
            "name": "ហៃ សារត្ន័"
        },
        {
            "barcode": "171131347",
            "dpc": "03034006501",
            "name": "គីម ចំរើន"
        },
        {
            "barcode": "171131348",
            "dpc": "03034006601",
            "name": "ខេង ទី"
        },
        {
            "barcode": "171131349",
            "dpc": "03034006701",
            "name": "ជិន សុដានី"
        },
        {
            "barcode": "171131350",
            "dpc": "03034006801",
            "name": "សឿង សុភ័ក្រ្ត"
        },
        {
            "barcode": "171131351",
            "dpc": "03034006901",
            "name": "ហេង ពៅ"
        },
        {
            "barcode": "171131352",
            "dpc": "03034007001",
            "name": "អ៊ឹម សុទ្ធ"
        },
        {
            "barcode": "171131353",
            "dpc": "03034007101",
            "name": "ឡុង ពិសី"
        },
        {
            "barcode": "171131354",
            "dpc": "03034007201",
            "name": "ហាយ ប៉ូឡូ"
        },
        {
            "barcode": "171131355",
            "dpc": "03034007301",
            "name": "ប៉ាញ ហឿន"
        },
        {
            "barcode": "171131356",
            "dpc": "03034007401",
            "name": "ជុំ គង"
        },
        {
            "barcode": "171131357",
            "dpc": "03034007501",
            "name": "ហួន វិជ័យ"
        },
        {
            "barcode": "171131358",
            "dpc": "03034007601",
            "name": "ជា អេង"
        },
        {
            "barcode": "171131359",
            "dpc": "03034008001",
            "name": "ម៉ា​ លីយ៉ា"
        },
        {
            "barcode": "171131360",
            "dpc": "03034008201",
            "name": "ឆាត់ សុធា"
        },
        {
            "barcode": "171131361",
            "dpc": "03034009601",
            "name": "សុង ឡេង"
        },
        {
            "barcode": "171131362",
            "dpc": "03034010001",
            "name": "ឈិន ណាតុង"
        },
        {
            "barcode": "171131363",
            "dpc": "03034010101",
            "name": "អឿន សេរីរត្ន"
        },
        {
            "barcode": "171131364",
            "dpc": "03034010201",
            "name": "ជាន ណូរ៉ា"
        },
        {
            "barcode": "171131365",
            "dpc": "03034010301",
            "name": "រឿន សារុំ"
        },
        {
            "barcode": "171131366",
            "dpc": "03034010401",
            "name": "ផន ចាន់ថារិទ្ធ"
        },
        {
            "barcode": "171131367",
            "dpc": "03034010501",
            "name": "អ៊ឹម សាញ"
        },
        {
            "barcode": "171131368",
            "dpc": "03034010601",
            "name": "ហេង សុខឡេង"
        },
        {
            "barcode": "171131369",
            "dpc": "03034010701",
            "name": "សោម សុផល"
        },
        {
            "barcode": "171131370",
            "dpc": "03034010801",
            "name": "លឹម ចេង"
        },
        {
            "barcode": "171131371",
            "dpc": "03034022701",
            "name": "រ៉ាត់ ស្រីយ៉ា"
        },
        {
            "barcode": "171131372",
            "dpc": "03034010901",
            "name": "កំ ហ៊ីង"
        },
        {
            "barcode": "171131373",
            "dpc": "03034011001",
            "name": "ប៉ក់ រស់"
        },
        {
            "barcode": "171131374",
            "dpc": "03034011101",
            "name": "ឈិន សាលី"
        },
        {
            "barcode": "171131375",
            "dpc": "03034011201",
            "name": "ស៊ុម នឿន"
        },
        {
            "barcode": "171131376",
            "dpc": "03034011301",
            "name": "កំ ស៊ត"
        },
        {
            "barcode": "171131377",
            "dpc": "03034011401",
            "name": "សេង ហួរ"
        },
        {
            "barcode": "171131378",
            "dpc": "03034011501",
            "name": "សុខ ហេន"
        },
        {
            "barcode": "171131379",
            "dpc": "03034011601",
            "name": "ហួយ សុខរឿន"
        },
        {
            "barcode": "171131380",
            "dpc": "03034011701",
            "name": "ស៊ឹម រួម"
        },
        {
            "barcode": "171131381",
            "dpc": "03034011801",
            "name": "ទិត្យ តែម"
        },
        {
            "barcode": "171131382",
            "dpc": "03034011901",
            "name": "ប្រិម សារិន"
        },
        {
            "barcode": "171131383",
            "dpc": "03034022801",
            "name": "ញឹម ប៉ុន"
        },
        {
            "barcode": "171131384",
            "dpc": "03034012001",
            "name": "ថន ប៊ុនធឿន"
        },
        {
            "barcode": "171131385",
            "dpc": "03034012101",
            "name": "បេន លាង"
        },
        {
            "barcode": "171131386",
            "dpc": "03034012201",
            "name": "សេក សារវឿន"
        },
        {
            "barcode": "171131387",
            "dpc": "03034012301",
            "name": "ឆុន ចាន់ថុល"
        },
        {
            "barcode": "171131388",
            "dpc": "03034012501",
            "name": "អោម ពីសី"
        },
        {
            "barcode": "171131389",
            "dpc": "03034012601",
            "name": "សួន សំណាង"
        },
        {
            "barcode": "171131390",
            "dpc": "03034012701",
            "name": "ហ៊ន សុខឃួន"
        },
        {
            "barcode": "171131391",
            "dpc": "03034012801",
            "name": "សាឯម សេដ្ឋា"
        },
        {
            "barcode": "171131392",
            "dpc": "03034012901",
            "name": "ច្រែង រិទ្ធ"
        },
        {
            "barcode": "171131393",
            "dpc": "03034013001",
            "name": "តិ មាស"
        },
        {
            "barcode": "171131394",
            "dpc": "03034013101",
            "name": "រឿន ចំរើន"
        },
        {
            "barcode": "171131395",
            "dpc": "03034013201",
            "name": "ម៉ក់ សាវុធ"
        },
        {
            "barcode": "171131396",
            "dpc": "03034013401",
            "name": "ថៃ ប៊ុនណៃ"
        },
        {
            "barcode": "171131397",
            "dpc": "03034013501",
            "name": "អេង គន្ធា"
        },
        {
            "barcode": "171131398",
            "dpc": "03034013601",
            "name": "ខាត់ ថេត"
        },
        {
            "barcode": "171131399",
            "dpc": "03034013701",
            "name": "ទី ចាន់ដារ៉ា"
        },
        {
            "barcode": "171131400",
            "dpc": "03034013901",
            "name": "ឈឹម សុភ័ណ្ណា"
        },
        {
            "barcode": "171131401",
            "dpc": "03034013801",
            "name": "ប្រាក់ បូរាណ"
        },
        {
            "barcode": "171131402",
            "dpc": "03034014001",
            "name": "ឃី សុផា"
        },
        {
            "barcode": "171131403",
            "dpc": "03034014101",
            "name": "ឃី សុផល"
        },
        {
            "barcode": "171131404",
            "dpc": "03034014501",
            "name": "នូ អេងសំរិទ្ធ"
        },
        {
            "barcode": "171131405",
            "dpc": "03034014601",
            "name": "សុខ អ៊ីម"
        },
        {
            "barcode": "171131406",
            "dpc": "03034014801",
            "name": "ស៊ីម គឹមណា"
        },
        {
            "barcode": "171131407",
            "dpc": "03034014901",
            "name": "វង់ នីកា"
        },
        {
            "barcode": "171131408",
            "dpc": "03034015001",
            "name": "សុខ ធីតា"
        },
        {
            "barcode": "171131409",
            "dpc": "03034015701",
            "name": "ហង់ លីលី"
        },
        {
            "barcode": "171131410",
            "dpc": "03034015801",
            "name": "ឯក ពៅ"
        },
        {
            "barcode": "171131411",
            "dpc": "03034015901",
            "name": "សម្បត្តិ សោភ័ណ្ខ"
        },
        {
            "barcode": "171131412",
            "dpc": "03034016001",
            "name": "ហ៊ុន គា"
        },
        {
            "barcode": "171131413",
            "dpc": "03034016101",
            "name": "ម៉េង លី"
        },
        {
            "barcode": "171131414",
            "dpc": "03034016201",
            "name": "ងិន ម៉ៅ"
        },
        {
            "barcode": "171131415",
            "dpc": "03034016301",
            "name": "ផុស សុគា"
        },
        {
            "barcode": "171131416",
            "dpc": "03034016401",
            "name": "រាជ សុវណ្ណារិទ្ធ"
        },
        {
            "barcode": "171131417",
            "dpc": "03034016501",
            "name": "តាំង ឡាយហ៊ាង"
        },
        {
            "barcode": "171131418",
            "dpc": "03034016601",
            "name": "ប៉ែន កុលវុធ"
        },
        {
            "barcode": "171131419",
            "dpc": "03034016701",
            "name": "ឡុង ធារី"
        },
        {
            "barcode": "171131420",
            "dpc": "03034016801",
            "name": "ជៀវ វុធន"
        },
        {
            "barcode": "171131421",
            "dpc": "03034016901",
            "name": "ប៊ាន ហុកតេ"
        },
        {
            "barcode": "171131422",
            "dpc": "03034017001",
            "name": "ខន សោភា"
        },
        {
            "barcode": "171131423",
            "dpc": "03034017101",
            "name": "សៅ ប៊ុនធឿន"
        },
        {
            "barcode": "171131424",
            "dpc": "03034017301",
            "name": "សេង វណ្ណី"
        },
        {
            "barcode": "171131425",
            "dpc": "03034017501",
            "name": "ប៊ិន សុផាត"
        },
        {
            "barcode": "171131426",
            "dpc": "03034017601",
            "name": "សុខ ជា"
        },
        {
            "barcode": "171131427",
            "dpc": "03034017701",
            "name": "ផែន វេត"
        },
        {
            "barcode": "171131428",
            "dpc": "03034017801",
            "name": "គី ជុនអេង"
        },
        {
            "barcode": "171131429",
            "dpc": "03034017901",
            "name": "គឹម សុវឌ្ឍនា"
        },
        {
            "barcode": "171131430",
            "dpc": "03034018001",
            "name": "ឆាយ បូរ៉ា"
        },
        {
            "barcode": "171131431",
            "dpc": "03034018101",
            "name": "ឆាន់ ពៅ"
        },
        {
            "barcode": "171131432",
            "dpc": "03034018201",
            "name": "ឃុន ហេង"
        },
        {
            "barcode": "171131433",
            "dpc": "03034018301",
            "name": "គក គីម"
        },
        {
            "barcode": "171131434",
            "dpc": "03034018401",
            "name": "ហុក ចាន់កញ្ញា"
        },
        {
            "barcode": "171131435",
            "dpc": "03034018501",
            "name": "ឆ អ៊ីង"
        },
        {
            "barcode": "171131436",
            "dpc": "03034018601",
            "name": "ជា សុជាតិ"
        },
        {
            "barcode": "171131437",
            "dpc": "03034018701",
            "name": "ញ៉ែម ចាន់ថន"
        },
        {
            "barcode": "171131438",
            "dpc": "03034018801",
            "name": "វ៉ុង សារ៉ាត់"
        },
        {
            "barcode": "171131439",
            "dpc": "03034018901",
            "name": "សុខ ងិ"
        },
        {
            "barcode": "171131440",
            "dpc": "03034019001",
            "name": "ស៊ន ហួត"
        },
        {
            "barcode": "171131441",
            "dpc": "03034019101",
            "name": "អឿន ព្រំ"
        },
        {
            "barcode": "171131442",
            "dpc": "03034019201",
            "name": "ចិន សន"
        },
        {
            "barcode": "171131443",
            "dpc": "03034019301",
            "name": "ឆូ គង់ម៉េង"
        },
        {
            "barcode": "171131444",
            "dpc": "03034019401",
            "name": "ហេង យាន"
        },
        {
            "barcode": "171131445",
            "dpc": "03034019501",
            "name": "កៅ សាវិន"
        },
        {
            "barcode": "171131446",
            "dpc": "03034019601",
            "name": "នួន សុភា"
        },
        {
            "barcode": "171131447",
            "dpc": "03034019701",
            "name": "ឃុំ សួម"
        },
        {
            "barcode": "171131448",
            "dpc": "03034019801",
            "name": "ណែម សុខសាន"
        },
        {
            "barcode": "171131449",
            "dpc": "03034019901",
            "name": "ស៊ុំ សុវណ្ណា"
        },
        {
            "barcode": "171131450",
            "dpc": "03034020001",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "171131451",
            "dpc": "03034020101",
            "name": "សឿម សារិទ្ធ"
        },
        {
            "barcode": "171131452",
            "dpc": "03034020201",
            "name": "ព្រឿង សាវុន"
        },
        {
            "barcode": "171131453",
            "dpc": "03034020301",
            "name": "មាឃ ស្រូយ"
        },
        {
            "barcode": "171131454",
            "dpc": "03034020401",
            "name": "សាន សាហ៊ុន"
        },
        {
            "barcode": "171131455",
            "dpc": "03034020501",
            "name": "ផា ស៊ីណា"
        },
        {
            "barcode": "171131456",
            "dpc": "03034020601",
            "name": "កេត ផាន"
        },
        {
            "barcode": "171131457",
            "dpc": "03034020701",
            "name": "មាស នីតា"
        },
        {
            "barcode": "171131458",
            "dpc": "03034020801",
            "name": "ស្រឹង ប៊ុនសឿន"
        },
        {
            "barcode": "171131459",
            "dpc": "03034020901",
            "name": "ជុំ ចំណាន"
        },
        {
            "barcode": "171131460",
            "dpc": "03034021001",
            "name": "រ៉េន ផល្លា"
        },
        {
            "barcode": "171131461",
            "dpc": "03034021101",
            "name": "ជុន និមល៏"
        },
        {
            "barcode": "171131462",
            "dpc": "03034021201",
            "name": "សួ ចំរើន"
        },
        {
            "barcode": "171131463",
            "dpc": "03034021301",
            "name": "លាង​​​ មុំ"
        },
        {
            "barcode": "171131464",
            "dpc": "03034021401",
            "name": "អៀង សេងលី"
        },
        {
            "barcode": "171131465",
            "dpc": "03034021501",
            "name": "ហេង ស៊ុនវេង"
        },
        {
            "barcode": "171131466",
            "dpc": "03034021601",
            "name": "សំ សុខ"
        },
        {
            "barcode": "171131467",
            "dpc": "03034021701",
            "name": "ញឹម ញ៉ុន"
        },
        {
            "barcode": "171131468",
            "dpc": "03034021801",
            "name": "ហោ សុខលន់"
        },
        {
            "barcode": "171131469",
            "dpc": "03034021901",
            "name": "អា ស្រី"
        },
        {
            "barcode": "171131470",
            "dpc": "03034022001",
            "name": "លី ស៊ីវហួយ"
        },
        {
            "barcode": "171131471",
            "dpc": "03034022101",
            "name": "ម៉ៅ សំកុល"
        },
        {
            "barcode": "171131472",
            "dpc": "03034022301",
            "name": "ចាន់ យាត្រា"
        },
        {
            "barcode": "171131473",
            "dpc": "03034022401",
            "name": "អ៊ុក យឹម"
        },
        {
            "barcode": "171131474",
            "dpc": "03034022501",
            "name": "កែវ កុសល"
        },
        {
            "barcode": "171131475",
            "dpc": "03034022601",
            "name": "សេក សាន្ត"
        },
        {
            "barcode": "171131476",
            "dpc": "03034022901",
            "name": "គង់ លី"
        },
        {
            "barcode": "171131477",
            "dpc": "03034023001",
            "name": "ប៉ុក ពណ្ណរាយ"
        },
        {
            "barcode": "171131478",
            "dpc": "03034023201",
            "name": "សៅ កុសល"
        },
        {
            "barcode": "171131479",
            "dpc": "03034023101",
            "name": "គា សុគន្ធី"
        },
        {
            "barcode": "171131480",
            "dpc": "03034023301",
            "name": "ផាន់ វ៉ាត់"
        },
        {
            "barcode": "171131481",
            "dpc": "03034023401",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "171131482",
            "dpc": "03034023501",
            "name": "ឯម សុផល"
        },
        {
            "barcode": "171131483",
            "dpc": "03034023601",
            "name": "ជួន កក្តដា"
        },
        {
            "barcode": "171131484",
            "dpc": "03034023701",
            "name": "ជួន រីន"
        },
        {
            "barcode": "171131485",
            "dpc": "03034023801",
            "name": "ជួន វណ្ណា"
        },
        {
            "barcode": "171131486",
            "dpc": "03034023901",
            "name": "ហ៊ី គឹមលាង"
        },
        {
            "barcode": "171131487",
            "dpc": "03034024001",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "171131488",
            "dpc": "03034024101",
            "name": "សួន សុទ្ទស្រីតា"
        },
        {
            "barcode": "171131489",
            "dpc": "03034024201",
            "name": "ពៅ ថាវតី"
        },
        {
            "barcode": "171131490",
            "dpc": "03034024301",
            "name": "ចាន់ មករា"
        },
        {
            "barcode": "171131491",
            "dpc": "03034024401",
            "name": "ចាន់ សុវណ្ណរ័ត្ន"
        },
        {
            "barcode": "171131492",
            "dpc": "03034024501",
            "name": "លឹម យ៉ុង"
        },
        {
            "barcode": "171131493",
            "dpc": "03034024601",
            "name": "លាង ដាឡាត់"
        },
        {
            "barcode": "171131494",
            "dpc": "03034024701",
            "name": "ឈៀង សុផល"
        },
        {
            "barcode": "171131495",
            "dpc": "03034024801",
            "name": "សាមុត ប៉ិច"
        },
        {
            "barcode": "171131496",
            "dpc": "03034024901",
            "name": "អ៊ុក ចិន្តា"
        },
        {
            "barcode": "171131497",
            "dpc": "03034025001",
            "name": "ហែម សំណាង"
        },
        {
            "barcode": "171131498",
            "dpc": "03034025101",
            "name": "នួន សីលា"
        },
        {
            "barcode": "171131499",
            "dpc": "03034025201",
            "name": "ហួត ម៉ាន់"
        },
        {
            "barcode": "171131500",
            "dpc": "03034025301",
            "name": "ម៉ៅ ឈឿន"
        },
        {
            "barcode": "171131501",
            "dpc": "03034025401",
            "name": "ញឹក សុភ័ណ្ឌ"
        },
        {
            "barcode": "171131502",
            "dpc": "03034025501",
            "name": "ឡាយ សុខន"
        },
        {
            "barcode": "171131503",
            "dpc": "03034025601",
            "name": "ឡុង ស៊ីណា"
        },
        {
            "barcode": "171131504",
            "dpc": "03034025701",
            "name": "ជន ចាន់ស្រី"
        },
        {
            "barcode": "171131505",
            "dpc": "03034025801",
            "name": "លី សូរិយា"
        },
        {
            "barcode": "171131506",
            "dpc": "03034025901",
            "name": "ហេង ឆាយលី"
        },
        {
            "barcode": "171131507",
            "dpc": "03034026001",
            "name": "វត្តដំរីសកុដិលេខ១០"
        },
        {
            "barcode": "171131508",
            "dpc": "03034026101",
            "name": "ឌុក ឆវុត"
        },
        {
            "barcode": "171131509",
            "dpc": "03034026201",
            "name": "ញ៉ែម ហឿន"
        },
        {
            "barcode": "171131510",
            "dpc": "03034007901",
            "name": "ណា សំបូរ"
        },
        {
            "barcode": "171131511",
            "dpc": "03034026301",
            "name": "សុំ សម្បត្តិ"
        },
        {
            "barcode": "171131512",
            "dpc": "03034026401",
            "name": "ផល ភោគចំរើន"
        },
        {
            "barcode": "171131513",
            "dpc": "03034026501",
            "name": "ហ៊ន ណូក"
        },
        {
            "barcode": "171131514",
            "dpc": "03034026601",
            "name": "វង្ស យកហូ"
        },
        {
            "barcode": "171131515",
            "dpc": "03034026701",
            "name": "អ៊ុក ខន"
        },
        {
            "barcode": "171131516",
            "dpc": "03034026801",
            "name": "វែង សារ៉ន"
        },
        {
            "barcode": "171131517",
            "dpc": "03034026901",
            "name": "ម៉ៅ រតនះ"
        },
        {
            "barcode": "171131518",
            "dpc": "03034027001",
            "name": "ថេង សំអាត"
        },
        {
            "barcode": "171131519",
            "dpc": "03034027101",
            "name": "ជា វិសេត"
        },
        {
            "barcode": "171131520",
            "dpc": "03034027201",
            "name": "ហុក ស្រេច"
        },
        {
            "barcode": "171131521",
            "dpc": "03034027301",
            "name": "ព្រុំ សារឿត"
        },
        {
            "barcode": "171131522",
            "dpc": "03034027501",
            "name": "ឈិន ម៉ាលីល"
        },
        {
            "barcode": "171131523",
            "dpc": "03034027401",
            "name": "អ៊ុក ម៉ាលី"
        },
        {
            "barcode": "171131524",
            "dpc": "03034027601",
            "name": "យ៉ត សឹម"
        },
        {
            "barcode": "171131525",
            "dpc": "03034028001",
            "name": "ស៊ាន ថារិន"
        },
        {
            "barcode": "171131526",
            "dpc": "03034028101",
            "name": "មួង សុភ័ណ្ខ"
        },
        {
            "barcode": "171131527",
            "dpc": "03034028801",
            "name": "ង៉ែត ងឿន"
        },
        {
            "barcode": "171148519",
            "dpc": "03034006801",
            "name": "សឿង សុភ័ក្រ្ត"
        },
        {
            "barcode": "171148520",
            "dpc": "03034006901",
            "name": "ហេង ពៅ"
        },
        {
            "barcode": "171148521",
            "dpc": "03034007001",
            "name": "អ៊ឹម សុទ្ធ"
        }
    ];


barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
