let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=

    [
        {
            "barcode": "171132568",
            "dpc": "03044100101",
            "name": "ផុន ផល្លី"
        },
        {
            "barcode": "171132569",
            "dpc": "03044100201",
            "name": "តេង ឆាវយិន"
        },
        {
            "barcode": "171132570",
            "dpc": "03044100301",
            "name": "ពេជ្រ វណ្ណី"
        },
        {
            "barcode": "171132571",
            "dpc": "03044100401",
            "name": "ឡាយ គីមឡុង"
        },
        {
            "barcode": "171132572",
            "dpc": "03044100501",
            "name": "ទេព​ ចាន់និច"
        },
        {
            "barcode": "171132573",
            "dpc": "03044100601",
            "name": "តែ វិញរ៉យជ័រ"
        },
        {
            "barcode": "171132574",
            "dpc": "03044100701",
            "name": "ប៉ោ វណ្ណះ"
        },
        {
            "barcode": "171132575",
            "dpc": "03044100801",
            "name": "យ៉ាត សីហា"
        },
        {
            "barcode": "171132576",
            "dpc": "03044100901",
            "name": "ញាណ ជី"
        },
        {
            "barcode": "171132577",
            "dpc": "03044101001",
            "name": "ប៊ូ ពៅ"
        },
        {
            "barcode": "171132578",
            "dpc": "03044101101",
            "name": "អឿ ហាន"
        },
        {
            "barcode": "171132579",
            "dpc": "03044101201",
            "name": "ម៉េ ស៊ីហាស"
        },
        {
            "barcode": "171132580",
            "dpc": "03044101301",
            "name": "យីត រ៉ហ្វីឡះ"
        },
        {
            "barcode": "171132581",
            "dpc": "03044101501",
            "name": "ឡាង  សៀក"
        },
        {
            "barcode": "171132582",
            "dpc": "03044101601",
            "name": "ហ៊ី ហៃ"
        },
        {
            "barcode": "171132583",
            "dpc": "03044101701",
            "name": "ជា បុប្ផា"
        },
        {
            "barcode": "171132584",
            "dpc": "03044101801",
            "name": "ជិម រៀន"
        },
        {
            "barcode": "171132585",
            "dpc": "03044101901",
            "name": "តន់ សារ៉ត"
        },
        {
            "barcode": "171132586",
            "dpc": "03044102001",
            "name": "តាត ព្រៀន"
        },
        {
            "barcode": "171132587",
            "dpc": "03044102101",
            "name": "សារី សេត"
        },
        {
            "barcode": "171132588",
            "dpc": "03044102201",
            "name": "ឡាន ប៊ូន២"
        },
        {
            "barcode": "171132589",
            "dpc": "03044102301",
            "name": "ឆៀម បារាំង"
        },
        {
            "barcode": "171132590",
            "dpc": "03044102401",
            "name": "ឡាន ប៊ុនសឹន"
        },
        {
            "barcode": "171132591",
            "dpc": "03044102501",
            "name": "ឡុក ចិត្ត"
        },
        {
            "barcode": "171132592",
            "dpc": "03044102601",
            "name": "វ៉ាន់ ឌី"
        },
        {
            "barcode": "171132593",
            "dpc": "03044102701",
            "name": "អឿន អ៊ាច"
        },
        {
            "barcode": "171132594",
            "dpc": "03044102801",
            "name": "ញឹក ធា"
        },
        {
            "barcode": "171132595",
            "dpc": "03044103001",
            "name": "យិន យ៉ុន"
        },
        {
            "barcode": "171132596",
            "dpc": "03044103101",
            "name": "ហ៊ីម ស៊ីថុន"
        },
        {
            "barcode": "171132597",
            "dpc": "03044103201",
            "name": "កូប សារី"
        },
        {
            "barcode": "171132598",
            "dpc": "03044103301",
            "name": "ម៉ាន ម៉ាត់ស៊ូណៃ"
        },
        {
            "barcode": "171132599",
            "dpc": "03044103401",
            "name": "វិន ណុះ"
        },
        {
            "barcode": "171132600",
            "dpc": "03044103501",
            "name": "អ៊ុន សុជាតិ"
        },
        {
            "barcode": "171132601",
            "dpc": "03044103601",
            "name": "យេត ស៊ុនគីហ្ចាលី"
        },
        {
            "barcode": "171132602",
            "dpc": "03044103701",
            "name": "ទិន ស្ម័នអ័ល"
        },
        {
            "barcode": "171132603",
            "dpc": "03044103801",
            "name": "រួន សាន"
        },
        {
            "barcode": "171132604",
            "dpc": "03044103901",
            "name": "ឡាន់ យូសុះ"
        },
        {
            "barcode": "171132605",
            "dpc": "03044104001",
            "name": "សាលាបឋមសិក្សាបាឡាត់"
        },
        {
            "barcode": "171132606",
            "dpc": "03044104101",
            "name": "សិទ្ធ វាសនា"
        },
        {
            "barcode": "171132607",
            "dpc": "03044104201",
            "name": "ទុយ ប៊ុនហៀង"
        },
        {
            "barcode": "171132608",
            "dpc": "03044104301",
            "name": "គិត ដាវិត"
        },
        {
            "barcode": "171132609",
            "dpc": "03044104401",
            "name": "ពៅ ដាលីយ៉ា"
        },
        {
            "barcode": "171132610",
            "dpc": "03044104501",
            "name": "នី វណ្ណៈ"
        },
        {
            "barcode": "171132611",
            "dpc": "03044104601",
            "name": "គុំ សុខុម ១"
        },
        {
            "barcode": "171132612",
            "dpc": "03044104701",
            "name": "គុំ សុខុម ២"
        },
        {
            "barcode": "171132613",
            "dpc": "03044104901",
            "name": "ម៉ា ឌិម"
        },
        {
            "barcode": "171132614",
            "dpc": "03044105001",
            "name": "ស៊យ សាក់ឡូ"
        },
        {
            "barcode": "171132615",
            "dpc": "03044105101",
            "name": "គុជ នាង"
        },
        {
            "barcode": "171132616",
            "dpc": "03044105201",
            "name": "កេតុ ម៉ានី"
        },
        {
            "barcode": "171132617",
            "dpc": "03044105301",
            "name": "ពិន សិរីវិន"
        },
        {
            "barcode": "171132618",
            "dpc": "03044105401",
            "name": "លឹម ស៊ុយសុវត្ថិ"
        },
        {
            "barcode": "171132619",
            "dpc": "03044105501",
            "name": "ហេង ចន្ថា"
        },
        {
            "barcode": "171132620",
            "dpc": "03044105601",
            "name": "យ៉ាន ហ៊ម"
        },
        {
            "barcode": "171132621",
            "dpc": "03044105701",
            "name": "ញាញ ប៊ុនឆប"
        },
        {
            "barcode": "171132622",
            "dpc": "03044105801",
            "name": "សុទ្ធ ថា"
        },
        {
            "barcode": "171132623",
            "dpc": "03044105901",
            "name": "ឡិប អារ៉ាហ្សាត"
        },
        {
            "barcode": "171132624",
            "dpc": "03044106001",
            "name": "ដឹក អាត"
        },
        {
            "barcode": "171132625",
            "dpc": "03044106101",
            "name": "សែន តារ៉ា"
        },
        {
            "barcode": "171132626",
            "dpc": "03044106201",
            "name": "សុះ ហាស់លី"
        },
        {
            "barcode": "171132627",
            "dpc": "03044106301",
            "name": "សូ សុះរ៉ាសេត"
        },
        {
            "barcode": "171132628",
            "dpc": "03044106401",
            "name": "កង ភាព"
        },
        {
            "barcode": "171132629",
            "dpc": "03044106501",
            "name": "បួន ស៊ីណាត"
        },
        {
            "barcode": "171132630",
            "dpc": "03044106601",
            "name": "ម៉ាត់ ហ៊ុលគីភ្លី"
        },
        {
            "barcode": "171132631",
            "dpc": "03044106801",
            "name": "វ៉ន ជឿម"
        },
        {
            "barcode": "171132632",
            "dpc": "03044106901",
            "name": "ដេន ណាត"
        },
        {
            "barcode": "171132633",
            "dpc": "03044107001",
            "name": "រិទ្ធ រ៉ានី"
        },
        {
            "barcode": "171132634",
            "dpc": "03044107201",
            "name": "ប៉ង់ សុវណ្ណដានី"
        },
        {
            "barcode": "171132635",
            "dpc": "03044107301",
            "name": "ផាត់ សិលា"
        },
        {
            "barcode": "171132636",
            "dpc": "03044107401",
            "name": "ប្រង់ វល័ក្ខ"
        },
        {
            "barcode": "171132637",
            "dpc": "03044107501",
            "name": "វង្ស ស៊ីណុល"
        },
        {
            "barcode": "171132638",
            "dpc": "03044107601",
            "name": "សាន ហ៊ិន"
        },
        {
            "barcode": "171132639",
            "dpc": "03044107701",
            "name": "អ៊ុក ឆវ័ន្ត"
        },
        {
            "barcode": "171132640",
            "dpc": "03044107801",
            "name": "ហុក ចំរើន"
        },
        {
            "barcode": "171132641",
            "dpc": "03044107901",
            "name": "សែម ពឿន"
        },
        {
            "barcode": "171132642",
            "dpc": "03044108001",
            "name": "គឹម ឡេង"
        },
        {
            "barcode": "171132643",
            "dpc": "03044108101",
            "name": "ជួង ណារ៉ែន"
        },
        {
            "barcode": "171132644",
            "dpc": "03044108201",
            "name": "ជៀម ដា"
        },
        {
            "barcode": "171132645",
            "dpc": "03044108401",
            "name": "ស៊ិម សារឿន"
        },
        {
            "barcode": "171132646",
            "dpc": "03044108501",
            "name": "ធឿត សាលឿន"
        },
        {
            "barcode": "171132647",
            "dpc": "03044108601",
            "name": "ម៉ៅ ភារម្យ"
        },
        {
            "barcode": "171132648",
            "dpc": "03044108701",
            "name": "សាំង សុផាត"
        },
        {
            "barcode": "171132649",
            "dpc": "03044108801",
            "name": "សុខ ប៊ុនុយឹម"
        },
        {
            "barcode": "171132650",
            "dpc": "03044109001",
            "name": "សន សៅ"
        },
        {
            "barcode": "171132651",
            "dpc": "03044109101",
            "name": "ច័ន្ទ ហ៊ាញ"
        },
        {
            "barcode": "171132652",
            "dpc": "03044109201",
            "name": "បាន ឃន"
        },
        {
            "barcode": "171132653",
            "dpc": "03044109301",
            "name": "ប៊ូ បូ"
        },
        {
            "barcode": "171132654",
            "dpc": "03044109401",
            "name": "ប៊ូ ភាន"
        },
        {
            "barcode": "171132655",
            "dpc": "03044109501",
            "name": "នី លីដា"
        },
        {
            "barcode": "171132656",
            "dpc": "03044109601",
            "name": "កែវ រ៉ិច"
        },
        {
            "barcode": "171132657",
            "dpc": "03044109701",
            "name": "អៀង អិដ្ឋ"
        },
        {
            "barcode": "171132658",
            "dpc": "03044109901",
            "name": "លឹម គឹមស៊ីម"
        },
        {
            "barcode": "171132659",
            "dpc": "03044110001",
            "name": "លឹម សុលីនដា"
        },
        {
            "barcode": "171132660",
            "dpc": "03044110101",
            "name": "ហម វាសនា"
        },
        {
            "barcode": "171132661",
            "dpc": "03044110301",
            "name": "ហ៊ាង លីណា"
        },
        {
            "barcode": "171132662",
            "dpc": "03044110401",
            "name": "សឿ ណន"
        },
        {
            "barcode": "171132663",
            "dpc": "03044110501",
            "name": "គង់ ម៉េង"
        },
        {
            "barcode": "171132664",
            "dpc": "03044110701",
            "name": "ជា ប៉ូច"
        },
        {
            "barcode": "171132665",
            "dpc": "03044110801",
            "name": "ហ៊ុល ស៊ីម"
        },
        {
            "barcode": "171132666",
            "dpc": "03044110901",
            "name": "ប៊ួ សៅ"
        },
        {
            "barcode": "171132667",
            "dpc": "03044111001",
            "name": "ប៊ួ តឿ"
        },
        {
            "barcode": "171132668",
            "dpc": "03044111101",
            "name": "សៅ រ៉េន"
        },
        {
            "barcode": "171132669",
            "dpc": "03044111201",
            "name": "បួ វ៉ើន"
        },
        {
            "barcode": "171132670",
            "dpc": "03044111301",
            "name": "កែវ យី"
        },
        {
            "barcode": "171132671",
            "dpc": "03044111401",
            "name": "ឈឿប ប៉ុច"
        },
        {
            "barcode": "171132672",
            "dpc": "03044111501",
            "name": "ធុច បូណា"
        },
        {
            "barcode": "171132673",
            "dpc": "03044111601",
            "name": "ប្រាក់ ចំរឿន"
        },
        {
            "barcode": "171132674",
            "dpc": "03044111801",
            "name": "ប៉ិច ផាត"
        },
        {
            "barcode": "171132675",
            "dpc": "03044111901",
            "name": "ប៉ិច ឈឿត"
        },
        {
            "barcode": "171132676",
            "dpc": "03044112001",
            "name": "សុខ សារ៉ន"
        },
        {
            "barcode": "171132677",
            "dpc": "03044112101",
            "name": "ចាន់ សុគុណ"
        },
        {
            "barcode": "171132678",
            "dpc": "03044112401",
            "name": "មុំ អ៊ួន"
        },
        {
            "barcode": "171132679",
            "dpc": "03044112501",
            "name": "ហ៊ុល សុខហេង"
        },
        {
            "barcode": "171132680",
            "dpc": "03044112601",
            "name": "ប៊ុត ប៊ុនថា"
        },
        {
            "barcode": "171132681",
            "dpc": "03044112801",
            "name": "ទង់ ស៊ីម"
        },
        {
            "barcode": "171132682",
            "dpc": "03044112901",
            "name": "ទេព មិន"
        },
        {
            "barcode": "171132683",
            "dpc": "03044113001",
            "name": "ភិន សោភ័ណ្ឌ"
        },
        {
            "barcode": "171132684",
            "dpc": "03044113101",
            "name": "លាង ស៊ីថារ៉ាត់"
        },
        {
            "barcode": "171132685",
            "dpc": "03044113201",
            "name": "ម៉ុត ម៉ាន់"
        },
        {
            "barcode": "171132686",
            "dpc": "03044113301",
            "name": "ហាក់ សុផល"
        },
        {
            "barcode": "171132687",
            "dpc": "03044113401",
            "name": "នួន ភារម្យ"
        },
        {
            "barcode": "171132688",
            "dpc": "03044113501",
            "name": "សាត សាមិន"
        },
        {
            "barcode": "171132689",
            "dpc": "03044113601",
            "name": "ណោ សុខុម"
        },
        {
            "barcode": "171132690",
            "dpc": "03044113801",
            "name": "ឆេង វិធា"
        },
        {
            "barcode": "171132691",
            "dpc": "03044113901",
            "name": "វង្ស ឆេង"
        },
        {
            "barcode": "171132692",
            "dpc": "03044114001",
            "name": "ណោ សុំអ៊ុន"
        },
        {
            "barcode": "171132693",
            "dpc": "03044114101",
            "name": "យៀង ចាន់វិរៈ"
        },
        {
            "barcode": "171132694",
            "dpc": "03044114201",
            "name": "ឃិប ឌី"
        },
        {
            "barcode": "171132695",
            "dpc": "03044114301",
            "name": "អ៊ុន ណារ៉េត"
        },
        {
            "barcode": "171132696",
            "dpc": "03044114401",
            "name": "ជួត សឿន"
        },
        {
            "barcode": "171132697",
            "dpc": "03044114501",
            "name": "ស៊ូ បិន"
        },
        {
            "barcode": "171132698",
            "dpc": "03044114601",
            "name": "អ៊ី រិន"
        },
        {
            "barcode": "171132699",
            "dpc": "03044114701",
            "name": "សុខ គឹមសួរ"
        },
        {
            "barcode": "171132700",
            "dpc": "03044114801",
            "name": "អ៊ុយ ចាន់ថន"
        },
        {
            "barcode": "171132701",
            "dpc": "03044114901",
            "name": "ទឺ ទាវី"
        },
        {
            "barcode": "171132702",
            "dpc": "03044115001",
            "name": "សួន ណារិន"
        },
        {
            "barcode": "171132703",
            "dpc": "03044115101",
            "name": "កែវ ពិន"
        },
        {
            "barcode": "171132704",
            "dpc": "03044115201",
            "name": "ព្រឹម សាលី"
        },
        {
            "barcode": "171132705",
            "dpc": "03044115301",
            "name": "ង៉ាម នងរដ្ឋា"
        },
        {
            "barcode": "171132706",
            "dpc": "03044115501",
            "name": "ថាប់ ប៊ុនលឿ"
        },
        {
            "barcode": "171132707",
            "dpc": "03044115601",
            "name": "ម៉ាត់ ចំរើន"
        },
        {
            "barcode": "171132708",
            "dpc": "03044115701",
            "name": "សិម សេន"
        },
        {
            "barcode": "171132709",
            "dpc": "03044115801",
            "name": "វ៉ន ស្លាម៉ាស់"
        },
        {
            "barcode": "171132710",
            "dpc": "03044115901",
            "name": "ទិន វ៉ាន់នី់"
        },
        {
            "barcode": "171132711",
            "dpc": "03044116001",
            "name": "ឃួន ប៊ុនធឿន"
        },
        {
            "barcode": "171132712",
            "dpc": "03044116101",
            "name": "កែ មឿន"
        },
        {
            "barcode": "171132713",
            "dpc": "03044116201",
            "name": "សឿង សាវី"
        },
        {
            "barcode": "171132714",
            "dpc": "03044116301",
            "name": "វត្តកំពង់សីម៉ា"
        },
        {
            "barcode": "171132715",
            "dpc": "03044116401",
            "name": "ជី វុត"
        },
        {
            "barcode": "171132716",
            "dpc": "03044116501",
            "name": "ឡឥដ្ឋអង់"
        },
        {
            "barcode": "171132717",
            "dpc": "03044116601",
            "name": "បែន ផាត"
        },
        {
            "barcode": "171132718",
            "dpc": "03044116701",
            "name": "កូវ សុឃឿន"
        },
        {
            "barcode": "171132719",
            "dpc": "03044116801",
            "name": "អ៊ែម សុភ័ក្ត្រ"
        },
        {
            "barcode": "171132720",
            "dpc": "03044116901",
            "name": "ម៉ាត់ កើ"
        },
        {
            "barcode": "171132721",
            "dpc": "03044117001",
            "name": "ទីន ផល"
        },
        {
            "barcode": "171132722",
            "dpc": "03044117101",
            "name": "ម៉ាត់ លី"
        },
        {
            "barcode": "171132723",
            "dpc": "03044117201",
            "name": "រេះ សៀត"
        },
        {
            "barcode": "171132724",
            "dpc": "03044117301",
            "name": "លុន អ៊ាន"
        },
        {
            "barcode": "171132725",
            "dpc": "03044117401",
            "name": "វង្ស រីឆាត"
        },
        {
            "barcode": "171132726",
            "dpc": "03044117501",
            "name": "ឡាត់ រស្មី"
        },
        {
            "barcode": "171132727",
            "dpc": "03044117601",
            "name": "អិត សំបូ២"
        },
        {
            "barcode": "171132728",
            "dpc": "03044117701",
            "name": "រស់ គឹមសុខា"
        },
        {
            "barcode": "171132729",
            "dpc": "03044117801",
            "name": "អ៊ុល ចំរើន"
        },
        {
            "barcode": "171132730",
            "dpc": "03044117901",
            "name": "ប៉ាន់ សុភ័ក្ត្រ"
        },
        {
            "barcode": "171132731",
            "dpc": "03044118001",
            "name": "លន់ វីរះ"
        },
        {
            "barcode": "171132732",
            "dpc": "03044118101",
            "name": "ទី រិឌ្ឍី"
        },
        {
            "barcode": "171132733",
            "dpc": "03044118201",
            "name": "អ៊ូច សុភាន"
        },
        {
            "barcode": "171132734",
            "dpc": "03044118301",
            "name": "ម៉ៅ សុខឡៃ"
        },
        {
            "barcode": "171132735",
            "dpc": "03044118401",
            "name": "ផាត ស្រីរដ្ឋ"
        },
        {
            "barcode": "171132736",
            "dpc": "03044118601",
            "name": "តែ សុវណ្ណរ៊ត្ន"
        },
        {
            "barcode": "171132737",
            "dpc": "03044118701",
            "name": "ទុំ សុខាន"
        },
        {
            "barcode": "171132738",
            "dpc": "03044118801",
            "name": "កាង វណ្ណៈ"
        },
        {
            "barcode": "171132739",
            "dpc": "03044118901",
            "name": "លួម ផាន"
        },
        {
            "barcode": "171132740",
            "dpc": "03044119001",
            "name": "លួម សុជាតិ"
        },
        {
            "barcode": "171132741",
            "dpc": "03044119101",
            "name": "រ៉េះ ហាយឹត"
        },
        {
            "barcode": "171132742",
            "dpc": "03044119201",
            "name": "លី ម៉ា"
        },
        {
            "barcode": "171132743",
            "dpc": "03044119301",
            "name": "ពៅ ម៉ាលី"
        },
        {
            "barcode": "171132744",
            "dpc": "03044119401",
            "name": "យ៉ាត យឿត"
        },
        {
            "barcode": "171132745",
            "dpc": "03044119501",
            "name": "រ៉ាត់ ចំរើន"
        },
        {
            "barcode": "171132746",
            "dpc": "03044119701",
            "name": "ថូ ប៊ុនរ៉េត"
        },
        {
            "barcode": "171132747",
            "dpc": "03044119801",
            "name": "ផា សំផេន១"
        },
        {
            "barcode": "171132748",
            "dpc": "03044119901",
            "name": "ផា សំផេន២"
        },
        {
            "barcode": "171132749",
            "dpc": "03044120001",
            "name": "ផា សំផេន៣"
        },
        {
            "barcode": "171132750",
            "dpc": "03044120101",
            "name": "គ្រី ប្រានី"
        },
        {
            "barcode": "171132751",
            "dpc": "03044120201",
            "name": "ហួន សុផល្លា"
        },
        {
            "barcode": "171132752",
            "dpc": "03044120301",
            "name": "ឈីវ វាន់នី"
        },
        {
            "barcode": "171132753",
            "dpc": "03044120401",
            "name": "ហាស់ សុខគ្រី"
        },
        {
            "barcode": "171132754",
            "dpc": "03044120601",
            "name": "ថាប់ ឡាំង"
        },
        {
            "barcode": "171132755",
            "dpc": "03044120701",
            "name": "ឯល នាង"
        },
        {
            "barcode": "171132756",
            "dpc": "03044120801",
            "name": "នី ណុះ"
        },
        {
            "barcode": "171132757",
            "dpc": "03044120901",
            "name": "ជាង សុភា"
        },
        {
            "barcode": "171132758",
            "dpc": "03044121001",
            "name": "សាំង ប៊ុនថេន"
        },
        {
            "barcode": "171132759",
            "dpc": "03044121101",
            "name": "បេ សុគន្ឋារី"
        },
        {
            "barcode": "171132760",
            "dpc": "03044121201",
            "name": "ហុង តូមា"
        },
        {
            "barcode": "171132761",
            "dpc": "03044121301",
            "name": "សួស រ៉ាម៉ូ"
        },
        {
            "barcode": "171132762",
            "dpc": "03044121401",
            "name": "នួន គឹមសេង"
        },
        {
            "barcode": "171132763",
            "dpc": "03044121501",
            "name": "ចិត តុង"
        },
        {
            "barcode": "171132764",
            "dpc": "03044121601",
            "name": "មណ្ឌលសុខភាព"
        },
        {
            "barcode": "171132765",
            "dpc": "03044121701",
            "name": "កុយ សុម៉ាលី"
        },
        {
            "barcode": "171132766",
            "dpc": "03044121801",
            "name": "សាលារៀនកំពង់សីម៉ា"
        },
        {
            "barcode": "171132767",
            "dpc": "03044121901",
            "name": "ជ៊យ និរោធ"
        },
        {
            "barcode": "171132768",
            "dpc": "03044122001",
            "name": "ទូច សុខុម"
        },
        {
            "barcode": "171132769",
            "dpc": "03044122101",
            "name": "ផែ ណាំជិវ"
        },
        {
            "barcode": "171132770",
            "dpc": "03044122201",
            "name": "អ្នកគ្រូណារី"
        },
        {
            "barcode": "171132771",
            "dpc": "03044122301",
            "name": "មាស សុផល"
        },
        {
            "barcode": "171132772",
            "dpc": "03044122401",
            "name": "ញូង ស្រស់"
        },
        {
            "barcode": "171132773",
            "dpc": "03044122501",
            "name": "ស៊ិន កុសល"
        },
        {
            "barcode": "171132774",
            "dpc": "03044122601",
            "name": "ទៀង បូរ៉ា"
        },
        {
            "barcode": "171132775",
            "dpc": "03044122701",
            "name": "ឡោះ ថា"
        },
        {
            "barcode": "171132776",
            "dpc": "03044122801",
            "name": "យួម ទូច"
        },
        {
            "barcode": "171132777",
            "dpc": "03044122901",
            "name": "អ៊ុយ សុផាន"
        },
        {
            "barcode": "171132778",
            "dpc": "03044123001",
            "name": "ប៊ុន គង់"
        },
        {
            "barcode": "171132779",
            "dpc": "03044123101",
            "name": "ស៊ត គឹមប្រុស"
        },
        {
            "barcode": "171132780",
            "dpc": "03044123201",
            "name": "ឡាស៊ី អ៊ុំ"
        },
        {
            "barcode": "171132781",
            "dpc": "03044123301",
            "name": "ផៃ សុផាត"
        },
        {
            "barcode": "171132782",
            "dpc": "03044123401",
            "name": "មាស សារួន"
        },
        {
            "barcode": "171132783",
            "dpc": "03044123501",
            "name": "គង់ សិលា"
        },
        {
            "barcode": "171132784",
            "dpc": "03044123601",
            "name": "អឿន ឈឹន"
        },
        {
            "barcode": "171132785",
            "dpc": "03044123701",
            "name": "លេង មែន"
        },
        {
            "barcode": "171132786",
            "dpc": "03044123901",
            "name": "នួន សុវណ្ណ"
        },
        {
            "barcode": "171132787",
            "dpc": "03044124001",
            "name": "ប៉ក សុផល"
        },
        {
            "barcode": "171132788",
            "dpc": "03044124101",
            "name": "ផាត ភឿត"
        },
        {
            "barcode": "171132789",
            "dpc": "03044124201",
            "name": "ផុន សានឿត"
        },
        {
            "barcode": "171132790",
            "dpc": "03044124301",
            "name": "ផុន សំភឿត"
        },
        {
            "barcode": "171132791",
            "dpc": "03044124401",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "171132792",
            "dpc": "03044124601",
            "name": "រិទ្ឋ សុផល"
        },
        {
            "barcode": "171132793",
            "dpc": "03044124701",
            "name": "ស្រែ កុសល់"
        },
        {
            "barcode": "171132794",
            "dpc": "03044124901",
            "name": "ប្រាក់ សុខេន"
        },
        {
            "barcode": "171132795",
            "dpc": "03044125001",
            "name": "ឆុយ ធឿន"
        },
        {
            "barcode": "171132796",
            "dpc": "03044125101",
            "name": "សរ សារិទ្ឋ"
        },
        {
            "barcode": "171132797",
            "dpc": "03044125201",
            "name": "សោម សុវណ្ណ"
        },
        {
            "barcode": "171132798",
            "dpc": "03044125301",
            "name": "ឈិន ឆឹន"
        },
        {
            "barcode": "171132799",
            "dpc": "03044125401",
            "name": "ឆាយ ឆុំ"
        },
        {
            "barcode": "171132800",
            "dpc": "03044125501",
            "name": "កី ឆាយសេង"
        },
        {
            "barcode": "171132801",
            "dpc": "03044125601",
            "name": "អ៊ុន សាវី"
        },
        {
            "barcode": "171132802",
            "dpc": "03044125701",
            "name": "វិទ្យាស្ថានវិជ្ជាជីវៈ"
        },
        {
            "barcode": "171132803",
            "dpc": "03044125801",
            "name": "សំ ប៉ាន់ ឌីណា"
        },
        {
            "barcode": "171132804",
            "dpc": "03044125901",
            "name": "លន ហ្សីឌី"
        },
        {
            "barcode": "171132805",
            "dpc": "03044126001",
            "name": "ជួន ហ៊ី"
        },
        {
            "barcode": "171132806",
            "dpc": "03044126201",
            "name": "កា គឺមឡែន"
        },
        {
            "barcode": "171132807",
            "dpc": "03044126301",
            "name": "កា ឃីន"
        },
        {
            "barcode": "171132808",
            "dpc": "03044126401",
            "name": "កា ចាន់ធី"
        },
        {
            "barcode": "171132809",
            "dpc": "03044126501",
            "name": "កឹម ឆែម"
        },
        {
            "barcode": "171132810",
            "dpc": "03044126601",
            "name": "ជា ច័ន្ទស្ធារ៉ាត់"
        },
        {
            "barcode": "171132811",
            "dpc": "03044126701",
            "name": "ហេង វិច្ឆ័យ"
        },
        {
            "barcode": "171132812",
            "dpc": "03044126801",
            "name": "សន សោម"
        },
        {
            "barcode": "171132813",
            "dpc": "03044126901",
            "name": "សួន ណារ៉ុង"
        },
        {
            "barcode": "171132814",
            "dpc": "03044127001",
            "name": "សឿន ចន្ថា"
        },
        {
            "barcode": "171132815",
            "dpc": "03044127101",
            "name": "គូយ កឿន"
        },
        {
            "barcode": "171132816",
            "dpc": "03044127301",
            "name": "មឿត គន្ឋា"
        },
        {
            "barcode": "171132817",
            "dpc": "03044127401",
            "name": "ភិន ផុន"
        },
        {
            "barcode": "171132818",
            "dpc": "03044127501",
            "name": "មេត ប៊ុនថន"
        },
        {
            "barcode": "171132819",
            "dpc": "03044127601",
            "name": "មេត កុសល់"
        },
        {
            "barcode": "171132820",
            "dpc": "03044127701",
            "name": "ណុប សុង"
        },
        {
            "barcode": "171132821",
            "dpc": "03044127801",
            "name": "ថោង សុឃឿត"
        },
        {
            "barcode": "171132822",
            "dpc": "03044127901",
            "name": "មឿន មឿត"
        },
        {
            "barcode": "171132823",
            "dpc": "03044128001",
            "name": "ហម ប៊ុនឃឿត"
        },
        {
            "barcode": "171132824",
            "dpc": "03044128101",
            "name": "កា សំបុក"
        },
        {
            "barcode": "171132825",
            "dpc": "03044128201",
            "name": "សូ មៀង"
        },
        {
            "barcode": "171132826",
            "dpc": "03044128301",
            "name": "ស្រុន សុវណ្ណា"
        },
        {
            "barcode": "171132827",
            "dpc": "03044128401",
            "name": "សួង ចាន់នី"
        },
        {
            "barcode": "171132828",
            "dpc": "03044128501",
            "name": "អ៊ុយ វណ្ណរី"
        },
        {
            "barcode": "171132829",
            "dpc": "03044128601",
            "name": "ពិន ឆែម"
        },
        {
            "barcode": "171132830",
            "dpc": "03044128701",
            "name": "ហិន យុន"
        },
        {
            "barcode": "171132831",
            "dpc": "03044128801",
            "name": "ជួង សារិន"
        },
        {
            "barcode": "171132832",
            "dpc": "03044128901",
            "name": "ឈុន សំណាង"
        },
        {
            "barcode": "171132833",
            "dpc": "03044129001",
            "name": "វេង សុង"
        },
        {
            "barcode": "171132834",
            "dpc": "03044129101",
            "name": "ឆាំ សុង"
        },
        {
            "barcode": "171132835",
            "dpc": "03044129201",
            "name": "ភិម សុផា"
        },
        {
            "barcode": "171132836",
            "dpc": "03044129301",
            "name": "ឈុំ ថន"
        },
        {
            "barcode": "171132837",
            "dpc": "03044129401",
            "name": "ស៊ ចាន់នី"
        },
        {
            "barcode": "171132838",
            "dpc": "03044129501",
            "name": "រ៉ិត ឈៀត"
        },
        {
            "barcode": "171132839",
            "dpc": "03044129601",
            "name": "រួត ញង"
        },
        {
            "barcode": "171132840",
            "dpc": "03044129701",
            "name": "តឿ លីន"
        },
        {
            "barcode": "171132841",
            "dpc": "03044129801",
            "name": "ហ៊ន ហុន"
        },
        {
            "barcode": "171132842",
            "dpc": "03044129901",
            "name": "រួម ភឿត"
        },
        {
            "barcode": "171132843",
            "dpc": "03044130001",
            "name": "សន រួន"
        },
        {
            "barcode": "171132844",
            "dpc": "03044130101",
            "name": "រឿន សារេត"
        },
        {
            "barcode": "171132845",
            "dpc": "03044130201",
            "name": "ម៉ប់ សាមេត"
        },
        {
            "barcode": "171132846",
            "dpc": "03044130301",
            "name": "ហួ ចាន់យ៉ា"
        },
        {
            "barcode": "171132847",
            "dpc": "03044130401",
            "name": "ឆឹង សុវិន"
        },
        {
            "barcode": "171132848",
            "dpc": "03044130501",
            "name": "ឆឹង ចិន្តា"
        },
        {
            "barcode": "171132849",
            "dpc": "03044130601",
            "name": "ង៉ាម សុន"
        },
        {
            "barcode": "171132850",
            "dpc": "03044130701",
            "name": "សឿន វណ្ណី"
        },
        {
            "barcode": "171132851",
            "dpc": "03044130801",
            "name": "សោ ទី"
        },
        {
            "barcode": "171132852",
            "dpc": "03044130901",
            "name": "លុយ សាលី"
        },
        {
            "barcode": "171132853",
            "dpc": "03044131001",
            "name": "ឆឹង ម៉ារ៉ាឌី"
        },
        {
            "barcode": "171132854",
            "dpc": "03044131101",
            "name": "លុយ អ៊ិន"
        },
        {
            "barcode": "171132855",
            "dpc": "03044131201",
            "name": "ឬទ្ឋី"
        },
        {
            "barcode": "171132856",
            "dpc": "03044131301",
            "name": "អឿន រឿប"
        },
        {
            "barcode": "171132857",
            "dpc": "03044131401",
            "name": "ថូ ប៉ាវ"
        },
        {
            "barcode": "171132858",
            "dpc": "03044131501",
            "name": "កែវ សំអូន"
        },
        {
            "barcode": "171132859",
            "dpc": "03044131601",
            "name": "គង់ ថន"
        },
        {
            "barcode": "171132860",
            "dpc": "03044131701",
            "name": "សំ ចិត្រា"
        },
        {
            "barcode": "171132861",
            "dpc": "03044131801",
            "name": "យូ គាវ"
        },
        {
            "barcode": "171132862",
            "dpc": "03044131901",
            "name": "ហ៊ុន ភេត្រា"
        },
        {
            "barcode": "171132863",
            "dpc": "03044132001",
            "name": "វឿង សាវេត"
        },
        {
            "barcode": "171132864",
            "dpc": "03044132101",
            "name": "តេង ថុល"
        },
        {
            "barcode": "171132865",
            "dpc": "03044132201",
            "name": "គង់ សម្បត្តិ"
        },
        {
            "barcode": "171132866",
            "dpc": "03044132301",
            "name": "អ៊ុក ណន"
        },
        {
            "barcode": "171132867",
            "dpc": "03044132401",
            "name": "ប៉េង ឡុង"
        },
        {
            "barcode": "171132868",
            "dpc": "03044132501",
            "name": "អៀង យ៉ាត់"
        },
        {
            "barcode": "171132869",
            "dpc": "03044132601",
            "name": "អាន ប៊ុនធៀង"
        },
        {
            "barcode": "171132870",
            "dpc": "03044132701",
            "name": "ជិន សុផានី"
        },
        {
            "barcode": "171132871",
            "dpc": "03044132801",
            "name": "យៀត យ៉ា"
        },
        {
            "barcode": "171132872",
            "dpc": "03044132901",
            "name": "លន់ ចាន់រី"
        },
        {
            "barcode": "171132873",
            "dpc": "03044133001",
            "name": "ហួត គឺមណារី"
        },
        {
            "barcode": "171132874",
            "dpc": "03044133101",
            "name": "តោ វ៉ាន់ហ៊ត"
        },
        {
            "barcode": "171132875",
            "dpc": "03044133301",
            "name": "ងឿន សាវឿត"
        },
        {
            "barcode": "171132876",
            "dpc": "03044133401",
            "name": "ព្រៀន លួន"
        },
        {
            "barcode": "171132877",
            "dpc": "03044133501",
            "name": "ទុយ អឿត"
        },
        {
            "barcode": "171132878",
            "dpc": "03044133701",
            "name": "ហាង ផារ័ត្ន"
        },
        {
            "barcode": "171132879",
            "dpc": "03044133801",
            "name": "យី សុភាវី"
        },
        {
            "barcode": "171132880",
            "dpc": "03044133901",
            "name": "វែន សាវឿយ"
        },
        {
            "barcode": "171132881",
            "dpc": "03044134001",
            "name": "ឈួន វិច្ឆិកា"
        },
        {
            "barcode": "171132882",
            "dpc": "03044134101",
            "name": "ឈន រឿត"
        },
        {
            "barcode": "171132883",
            "dpc": "03044134201",
            "name": "ស៊ិម ឃឿន"
        },
        {
            "barcode": "171132884",
            "dpc": "03044134301",
            "name": "ឆន ភី"
        },
        {
            "barcode": "171132885",
            "dpc": "03044134401",
            "name": "គឿន សំរើប"
        },
        {
            "barcode": "171132886",
            "dpc": "03044134501",
            "name": "លន សូភ័ក្រត្រា"
        },
        {
            "barcode": "171132887",
            "dpc": "03044134601",
            "name": "ប៊ុន បំណង"
        },
        {
            "barcode": "171132888",
            "dpc": "03044134701",
            "name": "វ៉ា កង"
        },
        {
            "barcode": "171132889",
            "dpc": "03044134801",
            "name": "អោក បូទុំ"
        },
        {
            "barcode": "171132890",
            "dpc": "03044134901",
            "name": "យ៉ា សុខុម"
        },
        {
            "barcode": "171132891",
            "dpc": "03044135001",
            "name": "យ៉ាត កី"
        },
        {
            "barcode": "171132892",
            "dpc": "03044135101",
            "name": "ប៉ម ធី"
        },
        {
            "barcode": "171132893",
            "dpc": "03044135201",
            "name": "សុខ នី"
        },
        {
            "barcode": "171132894",
            "dpc": "03044135301",
            "name": "អ៊ិន សារី"
        },
        {
            "barcode": "171132895",
            "dpc": "03044135401",
            "name": "ប៉ិច សារិទ្ឋ"
        },
        {
            "barcode": "171132896",
            "dpc": "03044135501",
            "name": "ឡាប លឿម"
        },
        {
            "barcode": "171132897",
            "dpc": "03044135601",
            "name": "ស៊ន សុំ"
        },
        {
            "barcode": "171132898",
            "dpc": "03044135701",
            "name": "អ៊ុយ រើន"
        },
        {
            "barcode": "171132899",
            "dpc": "03044135801",
            "name": "ស៊ន ពីង"
        },
        {
            "barcode": "171132900",
            "dpc": "03044135901",
            "name": "រី ង៉ែត"
        },
        {
            "barcode": "171132901",
            "dpc": "03044136001",
            "name": "ម៉ានី ឈុនណៃ"
        },
        {
            "barcode": "171132902",
            "dpc": "03044136101",
            "name": "យឹម គា"
        },
        {
            "barcode": "171132903",
            "dpc": "03044136201",
            "name": "ជឿម សុខារី"
        },
        {
            "barcode": "171132904",
            "dpc": "03044136301",
            "name": "ជា សារ៉ីម"
        },
        {
            "barcode": "171132905",
            "dpc": "03044136401",
            "name": "ជឿម ចន្ថូ"
        },
        {
            "barcode": "171132906",
            "dpc": "03044136501",
            "name": "ផន សុជាតិ"
        },
        {
            "barcode": "171132907",
            "dpc": "03044136601",
            "name": "លួង រេម"
        },
        {
            "barcode": "171132908",
            "dpc": "03044136701",
            "name": "ខាន់ មករា"
        },
        {
            "barcode": "171132909",
            "dpc": "03044136801",
            "name": "យ៉ាន់ វិជ្ជា"
        },
        {
            "barcode": "171132910",
            "dpc": "03044136901",
            "name": "សេង ងយ"
        },
        {
            "barcode": "171132911",
            "dpc": "03044137001",
            "name": "យ៉ុន ចាន់ថា"
        },
        {
            "barcode": "171132912",
            "dpc": "03044137101",
            "name": "មិត្ត ម៉ន"
        },
        {
            "barcode": "171132913",
            "dpc": "03044137201",
            "name": "សាន់ អ៊ិតប្រហ៊ីម"
        },
        {
            "barcode": "171132914",
            "dpc": "03044137301",
            "name": "ឈើយ ចយ"
        },
        {
            "barcode": "171132915",
            "dpc": "03044137401",
            "name": "មាស់ ភាព"
        },
        {
            "barcode": "171132916",
            "dpc": "03044137501",
            "name": "អ៊ោ ប៊ុនឡាយ"
        },
        {
            "barcode": "171132917",
            "dpc": "03044137601",
            "name": "រៀង ប៊ុនធាម"
        },
        {
            "barcode": "171132918",
            "dpc": "03044137701",
            "name": "ឪ ប៊ុនលីន"
        },
        {
            "barcode": "171132919",
            "dpc": "03044137801",
            "name": "ឪ ចាន់រ៉ុង"
        },
        {
            "barcode": "171132920",
            "dpc": "03044137901",
            "name": "ឆាយ គឹមយឿន"
        },
        {
            "barcode": "171132921",
            "dpc": "03044138001",
            "name": "ឈឿត ចន្ថា"
        },
        {
            "barcode": "171132922",
            "dpc": "03044138101",
            "name": "ឆាយ សុគន្ឋា"
        },
        {
            "barcode": "171132923",
            "dpc": "03044138201",
            "name": "ឆាយ ប៊ុនរី"
        },
        {
            "barcode": "171132924",
            "dpc": "03044138301",
            "name": "ឆាយ ផេង"
        },
        {
            "barcode": "171132925",
            "dpc": "03044138401",
            "name": "ផុន សារិទ្ឋ"
        },
        {
            "barcode": "171132926",
            "dpc": "03044138501",
            "name": "វិន សុឃីម"
        },
        {
            "barcode": "171132927",
            "dpc": "03044138601",
            "name": "ហាង គឺមឹសាន"
        },
        {
            "barcode": "171132928",
            "dpc": "03044138701",
            "name": "ឈាត សុភើយ"
        },
        {
            "barcode": "171132929",
            "dpc": "03044138801",
            "name": "ផា សំបូរ"
        },
        {
            "barcode": "171132930",
            "dpc": "03044138901",
            "name": "អ៊ុក ស៊ីថា"
        },
        {
            "barcode": "171132931",
            "dpc": "03044139001",
            "name": "ខុំ ភឿយ"
        },
        {
            "barcode": "171132932",
            "dpc": "03044139101",
            "name": "វ៉ាន់ សុវណ្ណា"
        },
        {
            "barcode": "171132933",
            "dpc": "03044139201",
            "name": "ពិន ហម"
        },
        {
            "barcode": "171132934",
            "dpc": "03044139301",
            "name": "មុំ សុឃឿន"
        },
        {
            "barcode": "171132935",
            "dpc": "03044139401",
            "name": "ស៊ុន មឿន"
        },
        {
            "barcode": "171132936",
            "dpc": "03044139501",
            "name": "ស៊ុន សារេត"
        },
        {
            "barcode": "171132937",
            "dpc": "03044139601",
            "name": "មឿន និត"
        },
        {
            "barcode": "171132938",
            "dpc": "03044139701",
            "name": "មឿន សាម៉ុន"
        },
        {
            "barcode": "171132939",
            "dpc": "03044139801",
            "name": "សោ ប៊ុនហូ"
        },
        {
            "barcode": "171132940",
            "dpc": "03044139901",
            "name": "សឿប រដ្ឋា"
        },
        {
            "barcode": "171132941",
            "dpc": "03044140001",
            "name": "ដៀង វ៉ាន់ធៀង"
        },
        {
            "barcode": "171132942",
            "dpc": "03044140101",
            "name": "យ៉ាន់ វីរៈ"
        },
        {
            "barcode": "171132943",
            "dpc": "03044140201",
            "name": "សុន រុម"
        },
        {
            "barcode": "171132944",
            "dpc": "03044140301",
            "name": "រុំ សារ៉ុម"
        },
        {
            "barcode": "171132945",
            "dpc": "03044140401",
            "name": "រុំ សារួម"
        },
        {
            "barcode": "171132946",
            "dpc": "03044140501",
            "name": "សោម នឿន"
        },
        {
            "barcode": "171132947",
            "dpc": "03044140601",
            "name": "គឹម សេន"
        },
        {
            "barcode": "171132948",
            "dpc": "03044140701",
            "name": "យឿន អ៊ិត"
        },
        {
            "barcode": "171132949",
            "dpc": "03044140801",
            "name": "មិន ផាន"
        },
        {
            "barcode": "171132950",
            "dpc": "03044140901",
            "name": "មាស់ ឆវ័ន"
        },
        {
            "barcode": "171132951",
            "dpc": "03044141001",
            "name": "ហួត សុខា"
        },
        {
            "barcode": "171132952",
            "dpc": "03044141201",
            "name": "យ៉ាន សំភេទ"
        },
        {
            "barcode": "171132953",
            "dpc": "03044141301",
            "name": "យ៉ាន ចាន់ថាវ"
        },
        {
            "barcode": "171132954",
            "dpc": "03044141401",
            "name": "ហ៊ឹម ដាវី"
        },
        {
            "barcode": "171132955",
            "dpc": "03044141501",
            "name": "យឿន យឺត"
        },
        {
            "barcode": "171132956",
            "dpc": "03044141601",
            "name": "សូ ម៉ន"
        },
        {
            "barcode": "171132957",
            "dpc": "03044141801",
            "name": "វឿន សំអឿន"
        },
        {
            "barcode": "171132958",
            "dpc": "03044141901",
            "name": "សួស ប៉ាវ"
        },
        {
            "barcode": "171132959",
            "dpc": "03044142001",
            "name": "ឆេង រេត"
        },
        {
            "barcode": "171132960",
            "dpc": "03044142101",
            "name": "អៀង ឌឿន"
        },
        {
            "barcode": "171132961",
            "dpc": "03044142201",
            "name": "ហ៊ុន ហាន់ថា"
        },
        {
            "barcode": "171132962",
            "dpc": "03044142301",
            "name": "អ៊ី អ៊ីម"
        },
        {
            "barcode": "171132963",
            "dpc": "03044142401",
            "name": "ហឿង ហាល់"
        },
        {
            "barcode": "171132964",
            "dpc": "03044142501",
            "name": "វ័ន ហឿន"
        },
        {
            "barcode": "171132965",
            "dpc": "03044142601",
            "name": "អ៊ុក វណ្ណារ៉ា"
        },
        {
            "barcode": "171132966",
            "dpc": "03044142701",
            "name": "ឆោម ចន្នាវ"
        },
        {
            "barcode": "171132967",
            "dpc": "03044142901",
            "name": "ទិត្យ សុភាព"
        },
        {
            "barcode": "171132968",
            "dpc": "03044143001",
            "name": "ផេង ភឿត"
        },
        {
            "barcode": "171132969",
            "dpc": "03044143101",
            "name": "ប៊ុយ សុខលី"
        },
        {
            "barcode": "171132970",
            "dpc": "03044143201",
            "name": "ចោប វណ្ណី"
        },
        {
            "barcode": "171132971",
            "dpc": "03044143301",
            "name": "សាន សុឌីណា"
        },
        {
            "barcode": "171132972",
            "dpc": "03044143401",
            "name": "តិប សាមុត"
        },
        {
            "barcode": "171132973",
            "dpc": "03044143501",
            "name": "កៅ ខា"
        },
        {
            "barcode": "171132974",
            "dpc": "03044143601",
            "name": "ទិត្យ ភារិន"
        },
        {
            "barcode": "171132975",
            "dpc": "03044143701",
            "name": "ប៉ុន ជេដ្ឋា"
        },
        {
            "barcode": "171132976",
            "dpc": "03044143801",
            "name": "រ៉ុង ប៉ុក"
        },
        {
            "barcode": "171132977",
            "dpc": "03044143901",
            "name": "ហេង ពិសិទ្ធ"
        },
        {
            "barcode": "171132978",
            "dpc": "03044144001",
            "name": "យ៉ា រ៉ុមមាលី"
        },
        {
            "barcode": "171132979",
            "dpc": "03044144101",
            "name": "ជា លក"
        },
        {
            "barcode": "171132980",
            "dpc": "03044144201",
            "name": "អេង វុន"
        },
        {
            "barcode": "171132981",
            "dpc": "03044144301",
            "name": "ស៊ិន សុភា"
        },
        {
            "barcode": "171132982",
            "dpc": "03044144401",
            "name": "វ៉ាន ភាន"
        },
        {
            "barcode": "171132983",
            "dpc": "03044144501",
            "name": "គា ចានី"
        },
        {
            "barcode": "171132984",
            "dpc": "03044144601",
            "name": "ម៉ន យួម"
        },
        {
            "barcode": "171132985",
            "dpc": "03044144701",
            "name": "ជិន សុខុម"
        },
        {
            "barcode": "171132986",
            "dpc": "03044144801",
            "name": "សួស ផារ័ត្ន"
        },
        {
            "barcode": "171132987",
            "dpc": "03044144901",
            "name": "ធាអ៊ី ធៀន"
        },
        {
            "barcode": "171132988",
            "dpc": "03044145001",
            "name": "មឿន ណាំមី"
        },
        {
            "barcode": "171132989",
            "dpc": "03044145101",
            "name": "ជឿន ធី"
        },
        {
            "barcode": "171132990",
            "dpc": "03044145201",
            "name": "មឿន សែប"
        },
        {
            "barcode": "171132991",
            "dpc": "03044145301",
            "name": "សាន់ សម្ផស្ស"
        },
        {
            "barcode": "171132992",
            "dpc": "03044145401",
            "name": "ឆាន ឈឿត"
        },
        {
            "barcode": "171132993",
            "dpc": "03044145501",
            "name": "លី លួម"
        },
        {
            "barcode": "171132994",
            "dpc": "03044145601",
            "name": "ស្រី លីស"
        },
        {
            "barcode": "171132995",
            "dpc": "03044145701",
            "name": "ហ៊ុន រ៉ូសាលី"
        },
        {
            "barcode": "171132996",
            "dpc": "03044145801",
            "name": "យ៉ក ថា"
        },
        {
            "barcode": "171132997",
            "dpc": "03044145901",
            "name": "ស្រឺង ណាលី"
        },
        {
            "barcode": "171132998",
            "dpc": "03044146001",
            "name": "វឿង សៅយ៉េត"
        },
        {
            "barcode": "171132999",
            "dpc": "03044146101",
            "name": "គ្រៀន សារី"
        },
        {
            "barcode": "171133000",
            "dpc": "03044146201",
            "name": "ម៉ៅ សុខា"
        },
        {
            "barcode": "171133001",
            "dpc": "03044146301",
            "name": "ហេង សេងហុង"
        },
        {
            "barcode": "171133002",
            "dpc": "03044146401",
            "name": "សេង សាវឿន"
        },
        {
            "barcode": "171133003",
            "dpc": "03044146501",
            "name": "សៅ ឆុង"
        },
        {
            "barcode": "171133004",
            "dpc": "03044146601",
            "name": "ម៉ី វ៉ាន់ទូច"
        },
        {
            "barcode": "171133005",
            "dpc": "03044146801",
            "name": "សោម វ៉ាន់ធូ"
        },
        {
            "barcode": "171133006",
            "dpc": "03044146901",
            "name": "សាវី ម៉ារី"
        },
        {
            "barcode": "171133007",
            "dpc": "03044147001",
            "name": "ប៊ូ សុថានី"
        },
        {
            "barcode": "171133008",
            "dpc": "03044147101",
            "name": "យិន ខេមរៈ"
        },
        {
            "barcode": "171133009",
            "dpc": "03044147201",
            "name": "ហឿន ហឿម"
        },
        {
            "barcode": "171133010",
            "dpc": "03044147301",
            "name": "ចេវ ជឿន"
        },
        {
            "barcode": "171133011",
            "dpc": "03044147501",
            "name": "សេង សុផាន់នី"
        },
        {
            "barcode": "171133012",
            "dpc": "03044147601",
            "name": "ចាន់ សុផល"
        },
        {
            "barcode": "171133013",
            "dpc": "03044147801",
            "name": "ស៊ូ ណាសែ"
        },
        {
            "barcode": "171133014",
            "dpc": "03044147901",
            "name": "ឌួង លី III"
        },
        {
            "barcode": "171133015",
            "dpc": "03044148001",
            "name": "លួម ជ័យ"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
