let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=

    [
        {
            "barcode": "171135256",
            "dpc": "03014200101",
            "name": "លាង ស៊ាងហេង"
        },
        {
            "barcode": "171135257",
            "dpc": "03014200201",
            "name": "នី រ៉ាត់"
        },
        {
            "barcode": "171135258",
            "dpc": "03014200301",
            "name": "ង៉ូវ ប៉ែត"
        },
        {
            "barcode": "171135259",
            "dpc": "03014200401",
            "name": "ថៃ ស្រីពៅ"
        },
        {
            "barcode": "171135260",
            "dpc": "03014200601",
            "name": "ប៊ូ វត្តា"
        },
        {
            "barcode": "171135261",
            "dpc": "03014200701",
            "name": "គង់ រ៉ាវី"
        },
        {
            "barcode": "171135262",
            "dpc": "03014200901",
            "name": "គឹម សឿត"
        },
        {
            "barcode": "171135263",
            "dpc": "03014201001",
            "name": "ហេង ឈុនលី"
        },
        {
            "barcode": "171135264",
            "dpc": "03014201101",
            "name": "ម៉េង រ៉ា"
        },
        {
            "barcode": "171135265",
            "dpc": "03014201301",
            "name": "កែវ សុខលាង"
        },
        {
            "barcode": "171135266",
            "dpc": "03014201401",
            "name": "ស៊ីន ស៊ីធួន"
        },
        {
            "barcode": "171135267",
            "dpc": "03014201501",
            "name": "មូល ជីវ័ន្ត"
        },
        {
            "barcode": "171135268",
            "dpc": "03014201601",
            "name": "ស៊ា ចាន់"
        },
        {
            "barcode": "171135269",
            "dpc": "03014201701",
            "name": "ខៀវ សុផាន់ណា"
        },
        {
            "barcode": "171135270",
            "dpc": "03014201801",
            "name": "សឿន សោម"
        },
        {
            "barcode": "171135271",
            "dpc": "03014201901",
            "name": "ទូច សាវី"
        },
        {
            "barcode": "171135272",
            "dpc": "03014202001",
            "name": "ប៉ិច ធី"
        },
        {
            "barcode": "171135273",
            "dpc": "03014202101",
            "name": "មី សំ"
        },
        {
            "barcode": "171135274",
            "dpc": "03014202301",
            "name": "អ៊ឹម វាចា"
        },
        {
            "barcode": "171135275",
            "dpc": "03014202401",
            "name": "ជា ម៉ូណូ"
        },
        {
            "barcode": "171135276",
            "dpc": "03014202501",
            "name": "ទូច ស្រីយ៉ា"
        },
        {
            "barcode": "171135277",
            "dpc": "03014202601",
            "name": "ប៉ុល ស៊ីនួន"
        },
        {
            "barcode": "171135278",
            "dpc": "03014202701",
            "name": "ប៉ុល ស៊ីនួន២"
        },
        {
            "barcode": "171135279",
            "dpc": "03014202801",
            "name": "សាយ ស៊ឺនប៉ិច"
        },
        {
            "barcode": "171135280",
            "dpc": "03014202901",
            "name": "យ៉ន ស៊ីនួន"
        },
        {
            "barcode": "171135281",
            "dpc": "03014203101",
            "name": "វ៉ាន់ ចាន់រិទ្ធ"
        },
        {
            "barcode": "171135282",
            "dpc": "03014203301",
            "name": "អាន សុខថៃ"
        },
        {
            "barcode": "171135283",
            "dpc": "03014203401",
            "name": "វ៉ាន វុធ"
        },
        {
            "barcode": "171135284",
            "dpc": "03014203501",
            "name": "ប៉ាល គីណាត"
        },
        {
            "barcode": "171135285",
            "dpc": "03014203601",
            "name": "ហួត ចំរើន"
        },
        {
            "barcode": "171135286",
            "dpc": "03014203701",
            "name": "និន គឹមលីន"
        },
        {
            "barcode": "171135287",
            "dpc": "03014203801",
            "name": "អយ សុភាព"
        },
        {
            "barcode": "171135288",
            "dpc": "03014203901",
            "name": "ឡុច សុងហេង"
        },
        {
            "barcode": "171135289",
            "dpc": "03014204101",
            "name": "ហ៊ុន សុភាព"
        },
        {
            "barcode": "171135290",
            "dpc": "03014204201",
            "name": "ប៊ូន សំអុល"
        },
        {
            "barcode": "171135291",
            "dpc": "03014204301",
            "name": "ទីំម ឆេងអាន"
        },
        {
            "barcode": "171135292",
            "dpc": "03014204401",
            "name": "អឹម អូន"
        },
        {
            "barcode": "171135293",
            "dpc": "03014204501",
            "name": "សឿម ឌីណា"
        },
        {
            "barcode": "171135294",
            "dpc": "03014204601",
            "name": "ហេង ប៊ុនថៃ"
        },
        {
            "barcode": "171135295",
            "dpc": "03014204801",
            "name": "ភឿក រៀត"
        },
        {
            "barcode": "171135296",
            "dpc": "03014204901",
            "name": "សែម ចាន់លាភា"
        },
        {
            "barcode": "171135297",
            "dpc": "03014205001",
            "name": "ឆាង បាន"
        },
        {
            "barcode": "171135298",
            "dpc": "03014205101",
            "name": "យ៉ត ធឿន"
        },
        {
            "barcode": "171135299",
            "dpc": "03014205201",
            "name": "យូ ចាន់"
        },
        {
            "barcode": "171135300",
            "dpc": "03014205301",
            "name": "កែវ នាង"
        },
        {
            "barcode": "171135301",
            "dpc": "03014205401",
            "name": "រួម រ៉ាត់"
        },
        {
            "barcode": "171135302",
            "dpc": "03014205601",
            "name": "ទុយ ឆេង"
        },
        {
            "barcode": "171135303",
            "dpc": "03014205701",
            "name": "អែម ធី"
        },
        {
            "barcode": "171135304",
            "dpc": "03014205801",
            "name": "ហោ លុច"
        },
        {
            "barcode": "171135305",
            "dpc": "03014206001",
            "name": "ចាន់ ផល្លី"
        },
        {
            "barcode": "171135306",
            "dpc": "03014206101",
            "name": "ហូវ សុខុម"
        },
        {
            "barcode": "171135307",
            "dpc": "03014206201",
            "name": "ចេម វាំង"
        },
        {
            "barcode": "171135308",
            "dpc": "03014206301",
            "name": "សុខ ម៉ៅ"
        },
        {
            "barcode": "171135309",
            "dpc": "03014206401",
            "name": "ភូ អេង"
        },
        {
            "barcode": "171135310",
            "dpc": "03014206501",
            "name": "ម៉េង ដារ៉ា"
        },
        {
            "barcode": "171135311",
            "dpc": "03014206601",
            "name": "អែម អៀង"
        },
        {
            "barcode": "171135312",
            "dpc": "03014206701",
            "name": "ទូច សាវេត"
        },
        {
            "barcode": "171135313",
            "dpc": "03014206801",
            "name": "អ៊ុំ ថា"
        },
        {
            "barcode": "171135314",
            "dpc": "03014206901",
            "name": "ញឹម សុខ"
        },
        {
            "barcode": "171135315",
            "dpc": "03014207001",
            "name": "អឿន វឿទ"
        },
        {
            "barcode": "171135316",
            "dpc": "03014207101",
            "name": "ទួម ជាតិ"
        },
        {
            "barcode": "171135317",
            "dpc": "03014207201",
            "name": "ម៉ាច វណ្ណះ"
        },
        {
            "barcode": "171135318",
            "dpc": "03014207301",
            "name": "ចៅ ជឿង"
        },
        {
            "barcode": "171135319",
            "dpc": "03014207401",
            "name": "សេត សាវុធ"
        },
        {
            "barcode": "171135320",
            "dpc": "03014207501",
            "name": "យុត តុងហាន់"
        },
        {
            "barcode": "171135321",
            "dpc": "03014207601",
            "name": "យឿន ធីតា"
        },
        {
            "barcode": "171135322",
            "dpc": "03014207701",
            "name": "ថង ថានី"
        },
        {
            "barcode": "171135323",
            "dpc": "03014207801",
            "name": "ម៉ាត សាលីន"
        },
        {
            "barcode": "171135324",
            "dpc": "03014207901",
            "name": "ម៉ាត កូប"
        },
        {
            "barcode": "171135325",
            "dpc": "03014208001",
            "name": "កើត មុំ"
        },
        {
            "barcode": "171135326",
            "dpc": "03014208101",
            "name": "សេន អាស់ម៉ាតប៉ះទ្រី"
        },
        {
            "barcode": "171135327",
            "dpc": "03014208201",
            "name": "ឯល សាឡឹម"
        },
        {
            "barcode": "171135328",
            "dpc": "03014208301",
            "name": "សេន នាង"
        },
        {
            "barcode": "171135329",
            "dpc": "03014208401",
            "name": "វង់ រ៉េន"
        },
        {
            "barcode": "171135330",
            "dpc": "03014208501",
            "name": "អោក សុផាត"
        },
        {
            "barcode": "171135331",
            "dpc": "03014208601",
            "name": "ឌឿក សារួន"
        },
        {
            "barcode": "171135332",
            "dpc": "03014208701",
            "name": "ងើយ សាមិត"
        },
        {
            "barcode": "171135333",
            "dpc": "03014208901",
            "name": "សេន សោភា"
        },
        {
            "barcode": "171135334",
            "dpc": "03014209001",
            "name": "អ៊ុំ ស៊ុនឌី"
        },
        {
            "barcode": "171135335",
            "dpc": "03014209101",
            "name": "ផុន វុធ"
        },
        {
            "barcode": "171135336",
            "dpc": "03014209201",
            "name": "ឈួក សាម៉ន"
        },
        {
            "barcode": "171135337",
            "dpc": "03014209401",
            "name": "ឯក សារ៉ូ"
        },
        {
            "barcode": "171135338",
            "dpc": "03014209501",
            "name": "គ្រូ ប៉ុច"
        },
        {
            "barcode": "171135339",
            "dpc": "03014209601",
            "name": "ហេង បាន"
        },
        {
            "barcode": "171135340",
            "dpc": "03014209701",
            "name": "ប៉ា សារ៉ុម"
        },
        {
            "barcode": "171135341",
            "dpc": "03014209801",
            "name": "លាង ឆ្លាត"
        },
        {
            "barcode": "171135342",
            "dpc": "03014209901",
            "name": "កើត វិរះ"
        },
        {
            "barcode": "171135343",
            "dpc": "03014210101",
            "name": "ហម ជុំ"
        },
        {
            "barcode": "171135344",
            "dpc": "03014210201",
            "name": "សួ ឃាង"
        },
        {
            "barcode": "171135345",
            "dpc": "03014210301",
            "name": "ហួរ សុវឌ្ឍនៈ"
        },
        {
            "barcode": "171135346",
            "dpc": "03014210401",
            "name": "វី វិចិត្រ"
        },
        {
            "barcode": "171135347",
            "dpc": "03014210601",
            "name": "ថេន រាសី"
        },
        {
            "barcode": "171135348",
            "dpc": "03014210701",
            "name": "គី លាងជួ ១"
        },
        {
            "barcode": "171135349",
            "dpc": "03014210801",
            "name": "គី លាងជួ ២"
        },
        {
            "barcode": "171135350",
            "dpc": "03014211001",
            "name": "សេង ផល្លា"
        },
        {
            "barcode": "171135351",
            "dpc": "03014211101",
            "name": "សួន រ៉ុន"
        },
        {
            "barcode": "171135352",
            "dpc": "03014211301",
            "name": "ផាត់ សុភី"
        },
        {
            "barcode": "171135353",
            "dpc": "03014211401",
            "name": "ឡាញ់ ឈឿប"
        },
        {
            "barcode": "171135354",
            "dpc": "03014211501",
            "name": "ឃុន យោន"
        },
        {
            "barcode": "171135355",
            "dpc": "03014211601",
            "name": "ម៉ក់ កុសល"
        },
        {
            "barcode": "171135356",
            "dpc": "03014211701",
            "name": "ហ៊ុន ពុត្រា"
        },
        {
            "barcode": "171135357",
            "dpc": "03014211801",
            "name": "ហ៊ុន សុភក្រ័"
        },
        {
            "barcode": "171135358",
            "dpc": "03014211901",
            "name": "ទិត្យ បូភី"
        },
        {
            "barcode": "171135359",
            "dpc": "03014212001",
            "name": "សែ សំអឿន"
        },
        {
            "barcode": "171135360",
            "dpc": "03014212101",
            "name": "ដូត យន់"
        },
        {
            "barcode": "171135361",
            "dpc": "03014212201",
            "name": "ឆាន់ ឈួន"
        },
        {
            "barcode": "171135362",
            "dpc": "03014212401",
            "name": "ធួត រឿម"
        },
        {
            "barcode": "171135363",
            "dpc": "03014212601",
            "name": "ឆូត រ៉ម"
        },
        {
            "barcode": "171135364",
            "dpc": "03014212701",
            "name": "ញឹក ធៀង"
        },
        {
            "barcode": "171135365",
            "dpc": "03014212901",
            "name": "យឹម រស់"
        },
        {
            "barcode": "171135366",
            "dpc": "03014213001",
            "name": "ឌី វណ្ណៈ"
        },
        {
            "barcode": "171135367",
            "dpc": "03014213101",
            "name": "គឹម ម៉ាណែត"
        },
        {
            "barcode": "171135368",
            "dpc": "03014213201",
            "name": "ឆាន សុភី"
        },
        {
            "barcode": "171135369",
            "dpc": "03014213301",
            "name": "ប៊ូ ហេង"
        },
        {
            "barcode": "171135370",
            "dpc": "03014213401",
            "name": "វេង ស៊្រុន"
        },
        {
            "barcode": "171135371",
            "dpc": "03014213501",
            "name": "ជុំ សុវណ្ណ"
        },
        {
            "barcode": "171135372",
            "dpc": "03014213601",
            "name": "សុខ វណ្ណា"
        },
        {
            "barcode": "171135373",
            "dpc": "03014213701",
            "name": "សួន សាមឌី"
        },
        {
            "barcode": "171135374",
            "dpc": "03014213801",
            "name": "ឌុក ចរិយា"
        },
        {
            "barcode": "171135375",
            "dpc": "03014214001",
            "name": "ដួង បញ្ញា"
        },
        {
            "barcode": "171135376",
            "dpc": "03014214101",
            "name": "សេង វុទ្ធី"
        },
        {
            "barcode": "171135377",
            "dpc": "03014214201",
            "name": "តាន់ នីរ័ត្ន"
        },
        {
            "barcode": "171135378",
            "dpc": "03014214301",
            "name": "សូ វ៉ាឌីណា"
        },
        {
            "barcode": "171135379",
            "dpc": "03014214401",
            "name": "យឹម ពៅ"
        },
        {
            "barcode": "171135380",
            "dpc": "03014214501",
            "name": "ពេជ្រ សុជា"
        },
        {
            "barcode": "171135381",
            "dpc": "03014214601",
            "name": "វាន់ នាង"
        },
        {
            "barcode": "171135382",
            "dpc": "03014214701",
            "name": "ឆៃ កាវ៉ាត"
        },
        {
            "barcode": "171135383",
            "dpc": "03014214801",
            "name": "គឹម ស៊ុង"
        },
        {
            "barcode": "171135384",
            "dpc": "03014214901",
            "name": "អាត ស៊ីថា"
        },
        {
            "barcode": "171135385",
            "dpc": "03014215001",
            "name": "ឈឹម សុពូន"
        },
        {
            "barcode": "171135386",
            "dpc": "03014215101",
            "name": "សំ សារ៉ុម"
        },
        {
            "barcode": "171135387",
            "dpc": "03014215201",
            "name": "អ៊ សំអាន"
        },
        {
            "barcode": "171135388",
            "dpc": "03014215301",
            "name": "ដាញ់ បុប្ជា"
        },
        {
            "barcode": "171135389",
            "dpc": "03014215401",
            "name": "ហេង ហឿម"
        },
        {
            "barcode": "171135390",
            "dpc": "03014215501",
            "name": "សុខ បូ"
        },
        {
            "barcode": "171135391",
            "dpc": "03014215601",
            "name": "យៀង វាសនា"
        },
        {
            "barcode": "171135392",
            "dpc": "03014215701",
            "name": "អោម សាវិន"
        },
        {
            "barcode": "171135393",
            "dpc": "03014215801",
            "name": "ឡាយ ឃុនឌី"
        },
        {
            "barcode": "171135394",
            "dpc": "03014215901",
            "name": "សុខ មុត"
        },
        {
            "barcode": "171135395",
            "dpc": "03014216301",
            "name": "យឹង សេរីរត្ន័"
        },
        {
            "barcode": "171135396",
            "dpc": "03014216401",
            "name": "អ៊ូរ ម៉ាល័យ"
        },
        {
            "barcode": "171135397",
            "dpc": "03014216501",
            "name": "ឯម សុវណ្ណ"
        },
        {
            "barcode": "171135398",
            "dpc": "03014216601",
            "name": "រុន រតនា"
        },
        {
            "barcode": "171135399",
            "dpc": "03014216701",
            "name": "សំ ជ័យវិបុល"
        },
        {
            "barcode": "171135400",
            "dpc": "03014216801",
            "name": "ទេព ម៉ារិទ្ធិ"
        },
        {
            "barcode": "171135401",
            "dpc": "03014216901",
            "name": "គឹម ចាន់ស៊ីថុន"
        },
        {
            "barcode": "171135402",
            "dpc": "03014217001",
            "name": "ប៊ុត តៃហេង"
        },
        {
            "barcode": "171135403",
            "dpc": "03014217101",
            "name": "គី គឹមលាង"
        },
        {
            "barcode": "171135404",
            "dpc": "03014217201",
            "name": "គី លាងជូ"
        },
        {
            "barcode": "171135405",
            "dpc": "03014217301",
            "name": "ហ៊ួត ម៉ាឡា"
        },
        {
            "barcode": "171135406",
            "dpc": "03014217401",
            "name": "ប៉ូច វឌ្ឍនា"
        },
        {
            "barcode": "171135407",
            "dpc": "03014217601",
            "name": "រស់ គង់"
        },
        {
            "barcode": "171135408",
            "dpc": "03014217701",
            "name": "ឡោ រុណ"
        },
        {
            "barcode": "171135409",
            "dpc": "03014217801",
            "name": "អេង សេស"
        },
        {
            "barcode": "171135410",
            "dpc": "03014217901",
            "name": "ម៉ិត សាមុត"
        },
        {
            "barcode": "171135411",
            "dpc": "03014218001",
            "name": "ឈឹម កុសល"
        },
        {
            "barcode": "171135412",
            "dpc": "03014218101",
            "name": "ងឿន ប៊ុនថន"
        },
        {
            "barcode": "171135413",
            "dpc": "03014218201",
            "name": "ដេត សារ៉េត"
        },
        {
            "barcode": "171135414",
            "dpc": "03014218301",
            "name": "តាំង សេក"
        },
        {
            "barcode": "171135415",
            "dpc": "03014218401",
            "name": "ថៃ ឃីម"
        },
        {
            "barcode": "171135416",
            "dpc": "03014218501",
            "name": "ពៅ លកក្រូច"
        },
        {
            "barcode": "171135417",
            "dpc": "03014218601",
            "name": "សូត្រ និល"
        },
        {
            "barcode": "171135418",
            "dpc": "03014218701",
            "name": "សូត្រ វៃ"
        },
        {
            "barcode": "171135419",
            "dpc": "03014218801",
            "name": "ជូន មន្ថា"
        },
        {
            "barcode": "171135420",
            "dpc": "03014218901",
            "name": "ស សារិទ្ធ"
        },
        {
            "barcode": "171135421",
            "dpc": "03014219001",
            "name": "សុខ ឆេង"
        },
        {
            "barcode": "171135422",
            "dpc": "03014219201",
            "name": "បូ ដាណា"
        },
        {
            "barcode": "171135423",
            "dpc": "03014219301",
            "name": "ហូប៊ុន ណារឿន"
        },
        {
            "barcode": "171135424",
            "dpc": "03014219401",
            "name": "ឌួង សុឃុននារី"
        },
        {
            "barcode": "171135425",
            "dpc": "03014219501",
            "name": "ម៉ែន គង់"
        },
        {
            "barcode": "171135426",
            "dpc": "03014219601",
            "name": "សំ ប៊ុនណាត"
        },
        {
            "barcode": "171135427",
            "dpc": "03014219701",
            "name": "គីង វ៉ាត"
        },
        {
            "barcode": "171135428",
            "dpc": "03014219801",
            "name": "លី ធានប៉ាវ"
        },
        {
            "barcode": "171135429",
            "dpc": "03014219901",
            "name": "ឈាន ហរទ័យ"
        },
        {
            "barcode": "171135430",
            "dpc": "03014220001",
            "name": "គួច លាភ"
        },
        {
            "barcode": "171135431",
            "dpc": "03014220101",
            "name": "ញ៉ រ៉ុម"
        },
        {
            "barcode": "171135432",
            "dpc": "03014220201",
            "name": "ជូវ ម៉េងពៅ"
        },
        {
            "barcode": "171135433",
            "dpc": "03014220301",
            "name": "ពៅ"
        },
        {
            "barcode": "171135434",
            "dpc": "03014220401",
            "name": "ហេង ស៊ត"
        },
        {
            "barcode": "171135435",
            "dpc": "03014220501",
            "name": "ប៉ូច ភិរម្យ"
        },
        {
            "barcode": "171135436",
            "dpc": "03014220601",
            "name": "យាន់ ចាន់ឡេង"
        },
        {
            "barcode": "171135437",
            "dpc": "03014220701",
            "name": "ស្រី ពិសី"
        },
        {
            "barcode": "171135438",
            "dpc": "03014220801",
            "name": "ឃុត រក្សារដ្ឋ"
        },
        {
            "barcode": "171135439",
            "dpc": "03014220901",
            "name": "សុខ សាវឿន"
        },
        {
            "barcode": "171135440",
            "dpc": "03014221101",
            "name": "យ៉ាន ដាលីន"
        },
        {
            "barcode": "171135441",
            "dpc": "03014221201",
            "name": "យ៉ាន យ៉ាស៊ីគីន"
        },
        {
            "barcode": "171135442",
            "dpc": "03014221301",
            "name": "យ៉ាន រីហ្វីន"
        },
        {
            "barcode": "171135443",
            "dpc": "03014221401",
            "name": "យឿ សៅយ៉ុត"
        },
        {
            "barcode": "171135444",
            "dpc": "03014221501",
            "name": "ប្រាក់ គីរី"
        },
        {
            "barcode": "171135445",
            "dpc": "03014221601",
            "name": "ណុប ឬទ្ធីពង្ស"
        },
        {
            "barcode": "171135446",
            "dpc": "03014221701",
            "name": "យ៉េក ស៊ីហៀង"
        },
        {
            "barcode": "171135447",
            "dpc": "03014221901",
            "name": "ទិន សាលី"
        },
        {
            "barcode": "171135448",
            "dpc": "03014222201",
            "name": "កែន ហ៊ុន"
        },
        {
            "barcode": "171135449",
            "dpc": "03014222301",
            "name": "ពីវ ត្រប់"
        },
        {
            "barcode": "171135450",
            "dpc": "03014222401",
            "name": "ឆាំ សុខុម"
        },
        {
            "barcode": "171135451",
            "dpc": "03014222501",
            "name": "ម៉ៅ ប៊ុនធី"
        },
        {
            "barcode": "171135452",
            "dpc": "03014222601",
            "name": "ឈឿត សំអុល"
        },
        {
            "barcode": "171135453",
            "dpc": "03014222701",
            "name": "លី សឿប"
        },
        {
            "barcode": "171135454",
            "dpc": "03014222801",
            "name": "លី វិចិត្រ"
        },
        {
            "barcode": "171135455",
            "dpc": "03014222901",
            "name": "រ៉ាន់ ខា"
        },
        {
            "barcode": "171135456",
            "dpc": "03014223101",
            "name": "ហម សារ៉ុម"
        },
        {
            "barcode": "171135457",
            "dpc": "03014223201",
            "name": "ហួត ស៊ីណា"
        },
        {
            "barcode": "171135458",
            "dpc": "03014223301",
            "name": "ឯល ទីណា"
        },
        {
            "barcode": "171135459",
            "dpc": "03014223401",
            "name": "ឡេង ច័ន្ទនី"
        },
        {
            "barcode": "171135460",
            "dpc": "03014223501",
            "name": "ពុំ រដ្ឋា"
        },
        {
            "barcode": "171135461",
            "dpc": "03014223601",
            "name": "វង្ស ចាន់ថុនា"
        },
        {
            "barcode": "171135462",
            "dpc": "03014223701",
            "name": "ផាត់ សុភណ័"
        },
        {
            "barcode": "171135463",
            "dpc": "03014223801",
            "name": "ហេង សេងហុង"
        },
        {
            "barcode": "171135464",
            "dpc": "03014224001",
            "name": "ស៊ាន ឆវី"
        },
        {
            "barcode": "171135465",
            "dpc": "03014224101",
            "name": "លី ប៊ុនអេង"
        },
        {
            "barcode": "171135466",
            "dpc": "03014224201",
            "name": "ជុំ ទៀត"
        },
        {
            "barcode": "171135467",
            "dpc": "03014224301",
            "name": "ទោ លឿត"
        },
        {
            "barcode": "171135468",
            "dpc": "03014224401",
            "name": "សុខ រិទ្ធ"
        },
        {
            "barcode": "171135469",
            "dpc": "03014224501",
            "name": "ប៉ូ វណ្ណា"
        },
        {
            "barcode": "171135470",
            "dpc": "03014224701",
            "name": "ពេជ្រ ធារ៉េត"
        },
        {
            "barcode": "171135471",
            "dpc": "03014224801",
            "name": "ណយ សាវឿត"
        },
        {
            "barcode": "171135472",
            "dpc": "03014224901",
            "name": "ឆាយ លាភា"
        },
        {
            "barcode": "171135473",
            "dpc": "03014225001",
            "name": "វង់ រដ្ឋា"
        },
        {
            "barcode": "171135474",
            "dpc": "03014225101",
            "name": "តា លឿង"
        },
        {
            "barcode": "171135475",
            "dpc": "03014225201",
            "name": "ឆាយ សេងឌឿម"
        },
        {
            "barcode": "171135476",
            "dpc": "03014225301",
            "name": "ចាន់ រ៉ូឡែន"
        },
        {
            "barcode": "171135477",
            "dpc": "03014225501",
            "name": "អ៊ុច ម៉ៅ"
        },
        {
            "barcode": "171135478",
            "dpc": "03014225601",
            "name": "ឈួន ឈឿត"
        },
        {
            "barcode": "171135479",
            "dpc": "03014225701",
            "name": "រឿន រ៉េត"
        },
        {
            "barcode": "171135480",
            "dpc": "03014225801",
            "name": "មាឃ សុគន្ធី"
        },
        {
            "barcode": "171135481",
            "dpc": "03014225901",
            "name": "លី ហេង"
        },
        {
            "barcode": "171135482",
            "dpc": "03014226001",
            "name": "តន ចាន់នឿន"
        },
        {
            "barcode": "171135483",
            "dpc": "03014226101",
            "name": "ហួត សេរីវុឌ្ឍ"
        },
        {
            "barcode": "171135484",
            "dpc": "03014226201",
            "name": "គុណ សីហា"
        },
        {
            "barcode": "171135485",
            "dpc": "03014226301",
            "name": "ហែល សុធី"
        },
        {
            "barcode": "171135486",
            "dpc": "03014226401",
            "name": "ជុង ស៊ុងតេត"
        },
        {
            "barcode": "171135487",
            "dpc": "03014226501",
            "name": "ពេជ្រ សារឿន"
        },
        {
            "barcode": "171135488",
            "dpc": "03014226701",
            "name": "ព្រឿង ប្រឹម"
        },
        {
            "barcode": "171135489",
            "dpc": "03014226801",
            "name": "ឆាយ លាង"
        },
        {
            "barcode": "171135490",
            "dpc": "03014226901",
            "name": "នៅ ថា"
        },
        {
            "barcode": "171135491",
            "dpc": "03014227001",
            "name": "រឹត យី"
        },
        {
            "barcode": "171135492",
            "dpc": "03014227101",
            "name": "វុធ គន្ធា"
        },
        {
            "barcode": "171135493",
            "dpc": "03014227201",
            "name": "ឈួន តុល"
        },
        {
            "barcode": "171135494",
            "dpc": "03014227301",
            "name": "ធឿម សុផា"
        },
        {
            "barcode": "171135495",
            "dpc": "03014227501",
            "name": "ខ្វាត ភាព"
        },
        {
            "barcode": "171135496",
            "dpc": "03014227601",
            "name": "ពី សារ៉ាត់"
        },
        {
            "barcode": "171135497",
            "dpc": "03014227701",
            "name": "រិន ផល្លាភ"
        },
        {
            "barcode": "171135498",
            "dpc": "03014227801",
            "name": "សោម សុខលី"
        },
        {
            "barcode": "171135499",
            "dpc": "03014227901",
            "name": "ងួន អេង"
        },
        {
            "barcode": "171135500",
            "dpc": "03014228001",
            "name": "ហឿង សាវុធ"
        },
        {
            "barcode": "171135501",
            "dpc": "03014228101",
            "name": "ជុំ សាវន"
        },
        {
            "barcode": "171135502",
            "dpc": "03014228201",
            "name": "ចិន ដារ៉ា"
        },
        {
            "barcode": "171135503",
            "dpc": "03014228301",
            "name": "កុត ដុះ"
        },
        {
            "barcode": "171135504",
            "dpc": "03014228401",
            "name": "សួន ស៊ាន"
        },
        {
            "barcode": "171135505",
            "dpc": "03014228501",
            "name": "មឿ យឿត"
        },
        {
            "barcode": "171135506",
            "dpc": "03014228601",
            "name": "ប៉ូ សាក់នី"
        },
        {
            "barcode": "171135507",
            "dpc": "03014228701",
            "name": "ខៀវ សត្យា"
        },
        {
            "barcode": "171135508",
            "dpc": "03014228801",
            "name": "វ៉ន ពេជ្រ"
        },
        {
            "barcode": "171135509",
            "dpc": "03014228901",
            "name": "រ៉ុន សារឿត"
        },
        {
            "barcode": "171135510",
            "dpc": "03014229001",
            "name": "ហឿម ហឿត"
        },
        {
            "barcode": "171135511",
            "dpc": "03014229101",
            "name": "រ៉ែម សារិន"
        },
        {
            "barcode": "171135512",
            "dpc": "03014229201",
            "name": "គឹម ផន"
        },
        {
            "barcode": "171135513",
            "dpc": "03014229301",
            "name": "យ៉ុម ឡាត"
        },
        {
            "barcode": "171135514",
            "dpc": "03014229501",
            "name": "ឆេង កុជលាង"
        },
        {
            "barcode": "171135515",
            "dpc": "03014229601",
            "name": "ថូ"
        },
        {
            "barcode": "171135516",
            "dpc": "03014229701",
            "name": "តាន់ ឡេងថៃ"
        },
        {
            "barcode": "171135517",
            "dpc": "03014229901",
            "name": "នឿន សារ៉េត"
        },
        {
            "barcode": "171135518",
            "dpc": "03014230001",
            "name": "សូត ពឿន"
        },
        {
            "barcode": "171135519",
            "dpc": "03014230101",
            "name": "សូត ឆឿត"
        },
        {
            "barcode": "171135520",
            "dpc": "03014230201",
            "name": "ឡឹង វ៉ាត់"
        },
        {
            "barcode": "171135521",
            "dpc": "03014230301",
            "name": "ហង្ស ម៉ុក"
        },
        {
            "barcode": "171135522",
            "dpc": "03014230401",
            "name": "យុត វ៉ែន"
        },
        {
            "barcode": "171135523",
            "dpc": "03014230501",
            "name": "លឿប ម៉ៅ"
        },
        {
            "barcode": "171135524",
            "dpc": "03014230601",
            "name": "ញៅ យៀត"
        },
        {
            "barcode": "171135525",
            "dpc": "03014230701",
            "name": "ហោង ផាន"
        },
        {
            "barcode": "171135526",
            "dpc": "03014230801",
            "name": "ឡុង លន់"
        },
        {
            "barcode": "171135527",
            "dpc": "03014230901",
            "name": "ណូច គ"
        },
        {
            "barcode": "171135528",
            "dpc": "03014231001",
            "name": "អោប អ៊ឹម"
        },
        {
            "barcode": "171135529",
            "dpc": "03014231101",
            "name": "ហាច សុខុម"
        },
        {
            "barcode": "171135530",
            "dpc": "03014231201",
            "name": "ញៅ យឿត"
        },
        {
            "barcode": "171135531",
            "dpc": "03014231301",
            "name": "វឿន វី"
        },
        {
            "barcode": "171135532",
            "dpc": "03014231401",
            "name": "យិន សារឿន"
        },
        {
            "barcode": "171135533",
            "dpc": "03014231501",
            "name": "ឡុង ឈន"
        },
        {
            "barcode": "171135534",
            "dpc": "03014231601",
            "name": "ខៀវ សេរីរត្ន័"
        },
        {
            "barcode": "171135535",
            "dpc": "03014231701",
            "name": "កែវ កឹមណៃ"
        },
        {
            "barcode": "171135536",
            "dpc": "03014231801",
            "name": "គី ហក់"
        },
        {
            "barcode": "171135537",
            "dpc": "03014231901",
            "name": "ធួក សាវេត"
        },
        {
            "barcode": "171135538",
            "dpc": "03014232001",
            "name": "ឆោម សារើ"
        },
        {
            "barcode": "171135539",
            "dpc": "03014232101",
            "name": "គង់ សុខុន"
        },
        {
            "barcode": "171135540",
            "dpc": "03014232201",
            "name": "កង់ ខេង"
        },
        {
            "barcode": "171135541",
            "dpc": "03014232301",
            "name": "នី ភើយ"
        },
        {
            "barcode": "171135542",
            "dpc": "03014232401",
            "name": "ហៀម ហឿត"
        },
        {
            "barcode": "171135543",
            "dpc": "03014232501",
            "name": "រើយ ថារត៊្ន"
        },
        {
            "barcode": "171135544",
            "dpc": "03014232701",
            "name": "ហឿ សុខា"
        },
        {
            "barcode": "171135545",
            "dpc": "03014232801",
            "name": "ប៉ែន ឃាង"
        },
        {
            "barcode": "171135546",
            "dpc": "03014232901",
            "name": "រៀង រ៉ាឌី"
        },
        {
            "barcode": "171135547",
            "dpc": "03014233101",
            "name": "ឆម ឡឹម"
        },
        {
            "barcode": "171135548",
            "dpc": "03014233201",
            "name": "គឹម ហូរ"
        },
        {
            "barcode": "171135549",
            "dpc": "03014233301",
            "name": "ព្រហ្ម ស៊ីដេត"
        },
        {
            "barcode": "171135550",
            "dpc": "03014233401",
            "name": "លួត លី"
        },
        {
            "barcode": "171135551",
            "dpc": "03014233501",
            "name": "ហៀប សាវត្តី"
        },
        {
            "barcode": "171135552",
            "dpc": "03014233601",
            "name": "អ៊ុន វើន"
        },
        {
            "barcode": "171135553",
            "dpc": "03014233701",
            "name": "ឡាច ផាត"
        },
        {
            "barcode": "171135554",
            "dpc": "03014233801",
            "name": "រ៉េត កក្កដា"
        },
        {
            "barcode": "171135555",
            "dpc": "03014233901",
            "name": "កឹក កន"
        },
        {
            "barcode": "171135556",
            "dpc": "03014234001",
            "name": "ហៀន វឿត"
        },
        {
            "barcode": "171135557",
            "dpc": "03014234101",
            "name": "ប្រឹង យើន"
        },
        {
            "barcode": "171135558",
            "dpc": "03014234201",
            "name": "ចាន់ ថេន"
        },
        {
            "barcode": "171135559",
            "dpc": "03014234301",
            "name": "យ៉ាត ពឿត"
        },
        {
            "barcode": "171135560",
            "dpc": "03014234401",
            "name": "ឆយ សារ៉ាត"
        },
        {
            "barcode": "171135561",
            "dpc": "03014234501",
            "name": "ហៀន រ៉េត"
        },
        {
            "barcode": "171135562",
            "dpc": "03014234601",
            "name": "ណុប រ៉ាវង្ស"
        },
        {
            "barcode": "171135563",
            "dpc": "03014234701",
            "name": "អៀម ស៊ីណា"
        },
        {
            "barcode": "171135564",
            "dpc": "03014234801",
            "name": "អៀប ចំណាប់"
        },
        {
            "barcode": "171135565",
            "dpc": "03014234901",
            "name": "ឡុង ហាក់"
        },
        {
            "barcode": "171135566",
            "dpc": "03014235001",
            "name": "អ៊ឹម ឈឹន"
        },
        {
            "barcode": "171135567",
            "dpc": "03014235101",
            "name": "នង សុខា"
        },
        {
            "barcode": "171135568",
            "dpc": "03014235201",
            "name": "មាឃ ណារី"
        },
        {
            "barcode": "171135569",
            "dpc": "03014235301",
            "name": "រត្ន័ ថា"
        },
        {
            "barcode": "171135570",
            "dpc": "03014235401",
            "name": "គួច ផល្លា ១"
        },
        {
            "barcode": "171135571",
            "dpc": "03014235501",
            "name": "លី ង៉ា"
        },
        {
            "barcode": "171135572",
            "dpc": "03014235701",
            "name": "សេង សុឈីង"
        },
        {
            "barcode": "171135573",
            "dpc": "03014235801",
            "name": "អ៊ុក សៀងហ៊ុន"
        },
        {
            "barcode": "171135574",
            "dpc": "03014235901",
            "name": "ហង់ សិលិា"
        },
        {
            "barcode": "171135575",
            "dpc": "03014236001",
            "name": "ហ៊ូ មេងស៊ាន"
        },
        {
            "barcode": "171135576",
            "dpc": "03014236101",
            "name": "ហ៊ន ធី"
        },
        {
            "barcode": "171135577",
            "dpc": "03014236201",
            "name": "ក្តិប សារិន"
        },
        {
            "barcode": "171135578",
            "dpc": "03014236301",
            "name": "ពេញ រដ្ធា"
        },
        {
            "barcode": "171135579",
            "dpc": "03014236401",
            "name": "រ៉ែម ឈឿត"
        },
        {
            "barcode": "171135580",
            "dpc": "03014236501",
            "name": "រុន សារិទ្ធ"
        },
        {
            "barcode": "171135581",
            "dpc": "03014236601",
            "name": "អ៊ឹម ឌីណា"
        },
        {
            "barcode": "171135582",
            "dpc": "03014236701",
            "name": "ស៊ីម សីវគីម"
        },
        {
            "barcode": "171135583",
            "dpc": "03014236801",
            "name": "ខាំ សារ៉ាវុត"
        },
        {
            "barcode": "171135584",
            "dpc": "03014237001",
            "name": "អួន សំ"
        },
        {
            "barcode": "171135585",
            "dpc": "03014237201",
            "name": "ឈុន ណៃ"
        },
        {
            "barcode": "171135586",
            "dpc": "03014237301",
            "name": "អ៊ី គីមគួន"
        },
        {
            "barcode": "171135587",
            "dpc": "03014237401",
            "name": "រីន សុភាព"
        },
        {
            "barcode": "171135588",
            "dpc": "03014237501",
            "name": "យ៉ែម សុផល"
        },
        {
            "barcode": "171135589",
            "dpc": "03014237601",
            "name": "ថៃ ស្រីប៉ូច"
        },
        {
            "barcode": "171135590",
            "dpc": "03014237701",
            "name": "សេន សុខុម"
        },
        {
            "barcode": "171135591",
            "dpc": "03014237801",
            "name": "សឿប សារ៉ុន"
        },
        {
            "barcode": "171135592",
            "dpc": "03014237901",
            "name": "រ៉ា សុភ័ក្រ"
        },
        {
            "barcode": "171135593",
            "dpc": "03014238001",
            "name": "ទួន សីហា"
        },
        {
            "barcode": "171135594",
            "dpc": "03014238101",
            "name": "អូន ចាន់ណារី"
        },
        {
            "barcode": "171135595",
            "dpc": "03014238201",
            "name": "យឹម ណារី"
        },
        {
            "barcode": "171135596",
            "dpc": "03014238301",
            "name": "ចំរើន បញ្ញា"
        },
        {
            "barcode": "171135597",
            "dpc": "03014238401",
            "name": "លេខ វណ្ណា"
        },
        {
            "barcode": "171135598",
            "dpc": "03014238501",
            "name": "ស៊ាង ប៊ុនឈាន"
        },
        {
            "barcode": "171135599",
            "dpc": "03014244001",
            "name": "ចាន់ សំអុល"
        },
        {
            "barcode": "171135600",
            "dpc": "03014238601",
            "name": "យី សារ៉ូ"
        },
        {
            "barcode": "171135601",
            "dpc": "03014238701",
            "name": "គឹម ឡាយ"
        },
        {
            "barcode": "171135602",
            "dpc": "03014244101",
            "name": "កៅ ហួរ"
        },
        {
            "barcode": "171135603",
            "dpc": "03014238801",
            "name": "ទន់ សូលីណែត"
        },
        {
            "barcode": "171135604",
            "dpc": "03014244201",
            "name": "យិន ហឿម"
        },
        {
            "barcode": "171135605",
            "dpc": "03014244301",
            "name": "ហួន សារឿត"
        },
        {
            "barcode": "171135606",
            "dpc": "03014238901",
            "name": "នង វ៉ាន់ថន"
        },
        {
            "barcode": "171135607",
            "dpc": "03014239001",
            "name": "អាប ឈុនអេង"
        },
        {
            "barcode": "171135608",
            "dpc": "03014239201",
            "name": "កៅ អ៊ាងឡាយ"
        },
        {
            "barcode": "171135609",
            "dpc": "03014239301",
            "name": "តាន់ ទីទី"
        },
        {
            "barcode": "171135610",
            "dpc": "03014244501",
            "name": "លេង វណ្ណៈ"
        },
        {
            "barcode": "171135611",
            "dpc": "03014239401",
            "name": "ស៊្រាន ពៅ"
        },
        {
            "barcode": "171135612",
            "dpc": "03014239501",
            "name": "ឡាច ធឿប"
        },
        {
            "barcode": "171135613",
            "dpc": "03014244601",
            "name": "ជា សុរស់"
        },
        {
            "barcode": "171135614",
            "dpc": "03014239601",
            "name": "ឌី ស្រីល័ក្ខ"
        },
        {
            "barcode": "171135615",
            "dpc": "03014239701",
            "name": "ទិន យ៉េក"
        },
        {
            "barcode": "171135616",
            "dpc": "03014239801",
            "name": "ស ប៊ុនធី"
        },
        {
            "barcode": "171135617",
            "dpc": "03014244701",
            "name": "ផៃ រ៉ា"
        },
        {
            "barcode": "171135618",
            "dpc": "03014239901",
            "name": "ហែម ពិសល់"
        },
        {
            "barcode": "171135619",
            "dpc": "03014244801",
            "name": "ឆៃ ឈន"
        },
        {
            "barcode": "171135620",
            "dpc": "03014240001",
            "name": "ពេជ្រ សុភ័ក្រ"
        },
        {
            "barcode": "171135621",
            "dpc": "03014240101",
            "name": "ជនពិការឡាប៉ាឡូម៉ា"
        },
        {
            "barcode": "171135622",
            "dpc": "03014240201",
            "name": "ឈើត ប៉ារ៉ាឌី"
        },
        {
            "barcode": "171135623",
            "dpc": "03014240301",
            "name": "ជី សុខហ៊ុន"
        },
        {
            "barcode": "171135624",
            "dpc": "03014240401",
            "name": "ប្រាក់ បូណេត"
        },
        {
            "barcode": "171135625",
            "dpc": "03014240501",
            "name": "ធី ដូណ"
        },
        {
            "barcode": "171135626",
            "dpc": "03014240701",
            "name": "ជា ផល្លី"
        },
        {
            "barcode": "171135627",
            "dpc": "03014240801",
            "name": "សុខ សុវណ្ណរ៉ា"
        },
        {
            "barcode": "171135628",
            "dpc": "03014240901",
            "name": "ភូង វុទ្ធី"
        },
        {
            "barcode": "171135629",
            "dpc": "03014241001",
            "name": "ដាញ់ សុវណ្ណរ៉ា"
        },
        {
            "barcode": "171135630",
            "dpc": "03014241101",
            "name": "វ័រ វីឡា"
        },
        {
            "barcode": "171135631",
            "dpc": "03014241201",
            "name": "ថា វុទ្ធី"
        },
        {
            "barcode": "171135632",
            "dpc": "03014241401",
            "name": "ឃឹម សំណុម"
        },
        {
            "barcode": "171135633",
            "dpc": "03014241501",
            "name": "អឿ ណាន់"
        },
        {
            "barcode": "171135634",
            "dpc": "03014241601",
            "name": "អ៊ុន សុផាត"
        },
        {
            "barcode": "171135635",
            "dpc": "03014241701",
            "name": "ហម ថារី"
        },
        {
            "barcode": "171135636",
            "dpc": "03014241801",
            "name": "ពៅ លក្ខិណា"
        },
        {
            "barcode": "171135637",
            "dpc": "03014241901",
            "name": "ហូ ប៊ុនធឿន"
        },
        {
            "barcode": "171135638",
            "dpc": "03014242001",
            "name": "អែវ សុជា"
        },
        {
            "barcode": "171135639",
            "dpc": "03014242101",
            "name": "សឿម វណ្ណី"
        },
        {
            "barcode": "171135640",
            "dpc": "03014242201",
            "name": "សេក សៀង"
        },
        {
            "barcode": "171135641",
            "dpc": "03014242301",
            "name": "ជួប ស៊ីដា"
        },
        {
            "barcode": "171135642",
            "dpc": "03014242401",
            "name": "ប៉ូយ ប៊ុនធឿន"
        },
        {
            "barcode": "171135643",
            "dpc": "03014242501",
            "name": "ឈើយ ឆុន"
        },
        {
            "barcode": "171135644",
            "dpc": "03014242601",
            "name": "ថា វុទ្ធូ"
        },
        {
            "barcode": "171135645",
            "dpc": "03014242701",
            "name": "គង ណូ"
        },
        {
            "barcode": "171135646",
            "dpc": "03014244901",
            "name": "សាន វាសនា"
        },
        {
            "barcode": "171135647",
            "dpc": "03014242801",
            "name": "សឿម សំណាង"
        },
        {
            "barcode": "171135648",
            "dpc": "03014242901",
            "name": "សុ លី"
        },
        {
            "barcode": "171135649",
            "dpc": "03014243301",
            "name": "រុន រ៉ា"
        },
        {
            "barcode": "171135650",
            "dpc": "03014243401",
            "name": "ឈឿន សុខឃឿន"
        },
        {
            "barcode": "171135651",
            "dpc": "03014243501",
            "name": "សោម វិត"
        },
        {
            "barcode": "171135652",
            "dpc": "03014243701",
            "name": "ទួត សុខន"
        },
        {
            "barcode": "171135653",
            "dpc": "03014243801",
            "name": "ស្រី រ័ត្ន"
        },
        {
            "barcode": "171135654",
            "dpc": "03014243901",
            "name": "ឃីម សោភ័ណ្ឌ"
        },
        {
            "barcode": "171135655",
            "dpc": "03014245001",
            "name": "ឌួង សោភ័ណ្ឌ"
        },
        {
            "barcode": "171135656",
            "dpc": "03014245101",
            "name": "ឆម ឆវី"
        },
        {
            "barcode": "171135657",
            "dpc": "03014245201",
            "name": "លឿម សំខាន់"
        },
        {
            "barcode": "171135658",
            "dpc": "03014245301",
            "name": "ប៉េង តុលា"
        },
        {
            "barcode": "171135659",
            "dpc": "03014245401",
            "name": "ឃួន កំសាន"
        },
        {
            "barcode": "171135660",
            "dpc": "03014245501",
            "name": "ពៅ ប៊ុនធឿន"
        },
        {
            "barcode": "171135661",
            "dpc": "03014245601",
            "name": "បាន ម៉ី"
        },
        {
            "barcode": "171135662",
            "dpc": "03014245701",
            "name": "ឆាន សាវន"
        },
        {
            "barcode": "171135663",
            "dpc": "03014245801",
            "name": "ប៉ាត ភូម៉ារិទ្ធ"
        },
        {
            "barcode": "171135664",
            "dpc": "03014248001",
            "name": "ឈាង គង់"
        },
        {
            "barcode": "171135665",
            "dpc": "03014247901",
            "name": "សុខ ម៉ាណែត"
        },
        {
            "barcode": "171135666",
            "dpc": "03014247801",
            "name": "ប៉ែន ណារី"
        },
        {
            "barcode": "171135667",
            "dpc": "03014247701",
            "name": "ប៉ិច ស៊ីណា"
        },
        {
            "barcode": "171135668",
            "dpc": "03014245901",
            "name": "អឿ សុដានី"
        },
        {
            "barcode": "171135669",
            "dpc": "03014246001",
            "name": "ផ្លែក នី"
        },
        {
            "barcode": "171135670",
            "dpc": "03014247601",
            "name": "អ៊ាប ហុកលី"
        },
        {
            "barcode": "171135671",
            "dpc": "03014246101",
            "name": "ភ្លៀន ឈួក"
        },
        {
            "barcode": "171135672",
            "dpc": "03014247501",
            "name": "លាង ហេង"
        },
        {
            "barcode": "171135673",
            "dpc": "03014246201",
            "name": "ម៉ៃ ចិន្តា"
        },
        {
            "barcode": "171135674",
            "dpc": "03014247401",
            "name": "ងួន រ៉ានី"
        },
        {
            "barcode": "171135675",
            "dpc": "03014246501",
            "name": "សារ៉ាន ផារ៉ាត់"
        },
        {
            "barcode": "171135676",
            "dpc": "03014247301",
            "name": "ទេស សារឿន"
        },
        {
            "barcode": "171135677",
            "dpc": "03014246601",
            "name": "ឆុន សុភាន់"
        },
        {
            "barcode": "171135678",
            "dpc": "03014246701",
            "name": "សុខ ឆន"
        },
        {
            "barcode": "171135679",
            "dpc": "03014247201",
            "name": "សុខ ប៊ុណារី"
        },
        {
            "barcode": "171135680",
            "dpc": "03014246801",
            "name": "ចេវ ថាវី"
        },
        {
            "barcode": "171135681",
            "dpc": "03014246901",
            "name": "តាំង សូសិលា"
        },
        {
            "barcode": "171135682",
            "dpc": "03014247101",
            "name": "ជុំ សូនីតា"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
