let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171135683",
            "dpc": "03014400101",
            "name": "ម៉ៅ សារ៉ាត"
        },
        {
            "barcode": "171135684",
            "dpc": "03014400201",
            "name": "ឌួង វាសនា១"
        },
        {
            "barcode": "171135685",
            "dpc": "03014400301",
            "name": "ឌួង វាសនា២"
        },
        {
            "barcode": "171135686",
            "dpc": "03014400401",
            "name": "រ៉ូ រ៉ស់ហ្វី"
        },
        {
            "barcode": "171135687",
            "dpc": "03014400501",
            "name": "មែ តេង"
        },
        {
            "barcode": "171135688",
            "dpc": "03014400601",
            "name": "ឆោម ឡងឌី"
        },
        {
            "barcode": "171135689",
            "dpc": "03014400701",
            "name": "ម៉ម លីន"
        },
        {
            "barcode": "171135690",
            "dpc": "03014400801",
            "name": "សុត បញ្ញា"
        },
        {
            "barcode": "171135691",
            "dpc": "03014400901",
            "name": "មុំ ស្រីពៅ"
        },
        {
            "barcode": "171135692",
            "dpc": "03014401101",
            "name": "យឹម ចាន់ណារី"
        },
        {
            "barcode": "171135693",
            "dpc": "03014401201",
            "name": "រី សុខគាន"
        },
        {
            "barcode": "171135694",
            "dpc": "03014401301",
            "name": "រស់ ផលសម្បត្តិ"
        },
        {
            "barcode": "171135695",
            "dpc": "03014401401",
            "name": "ហេង សៅយ៉ាត"
        },
        {
            "barcode": "171135696",
            "dpc": "03014401501",
            "name": "វង្ស គឹមឡាង"
        },
        {
            "barcode": "171135697",
            "dpc": "03014401601",
            "name": "ម៉ៅ សារ៉ាត២"
        },
        {
            "barcode": "171135698",
            "dpc": "03014401701",
            "name": "ហៀង ថាវី"
        },
        {
            "barcode": "171135699",
            "dpc": "03014401801",
            "name": "យ៉ុត យ៉ាន់"
        },
        {
            "barcode": "171135700",
            "dpc": "03014401901",
            "name": "ឆុម វ៊ិត"
        },
        {
            "barcode": "171135701",
            "dpc": "03014402001",
            "name": "ប៉ូ ពៅ"
        },
        {
            "barcode": "171135702",
            "dpc": "03014402101",
            "name": "លី លី"
        },
        {
            "barcode": "171135703",
            "dpc": "03014402201",
            "name": "សេង សុខធារី"
        },
        {
            "barcode": "171135704",
            "dpc": "03014402301",
            "name": "សំ និមល់"
        },
        {
            "barcode": "171135705",
            "dpc": "03014402401",
            "name": "អាន គឹមឡាយ"
        },
        {
            "barcode": "171135706",
            "dpc": "03014402501",
            "name": "លី ផានី"
        },
        {
            "barcode": "171135707",
            "dpc": "03014402701",
            "name": "ឆាំ មារ៉ា"
        },
        {
            "barcode": "171135708",
            "dpc": "03014402801",
            "name": "សំ អាងសត្យា"
        },
        {
            "barcode": "171135709",
            "dpc": "03014402901",
            "name": "ពេជ្រ គន្ធា"
        },
        {
            "barcode": "171135710",
            "dpc": "03014403001",
            "name": "អ៊ុន សុវិុត"
        },
        {
            "barcode": "171135711",
            "dpc": "03014403101",
            "name": "ទុំ ក្លឹង"
        },
        {
            "barcode": "171135712",
            "dpc": "03014403301",
            "name": "ជា សារាន"
        },
        {
            "barcode": "171135713",
            "dpc": "03014403401",
            "name": "លី ចាន់ណា"
        },
        {
            "barcode": "171135714",
            "dpc": "03014403501",
            "name": "ចាន់ សារ៉ាត់"
        },
        {
            "barcode": "171135715",
            "dpc": "03014403701",
            "name": "ព្រំ ផាន"
        },
        {
            "barcode": "171135716",
            "dpc": "03014403801",
            "name": "ចៅ ហ្វឹង"
        },
        {
            "barcode": "171135717",
            "dpc": "03014403901",
            "name": "អៀប ប៊ុន"
        },
        {
            "barcode": "171135718",
            "dpc": "03014404001",
            "name": "ដួង លីដា"
        },
        {
            "barcode": "171135719",
            "dpc": "03014404101",
            "name": "យឹម ស្រស់"
        },
        {
            "barcode": "171135720",
            "dpc": "03014404201",
            "name": "ហ៊ាន សុធា"
        },
        {
            "barcode": "171135721",
            "dpc": "03014404401",
            "name": "ទាវ សុផល"
        },
        {
            "barcode": "171135722",
            "dpc": "03014404501",
            "name": "កយ វី"
        },
        {
            "barcode": "171135723",
            "dpc": "03014401001",
            "name": "ថាច់ វណ្ណអុន"
        },
        {
            "barcode": "171135724",
            "dpc": "03014404601",
            "name": "ឡៃ  ឡាត់"
        },
        {
            "barcode": "171135725",
            "dpc": "03014404701",
            "name": "ស៊ុន ភឿត"
        },
        {
            "barcode": "171135726",
            "dpc": "03014404801",
            "name": "តឿ រ៉ុង"
        },
        {
            "barcode": "171135727",
            "dpc": "03014404901",
            "name": "យោក ហ៊ុន"
        },
        {
            "barcode": "171135728",
            "dpc": "03014405001",
            "name": "យោក ធី"
        },
        {
            "barcode": "171135729",
            "dpc": "03014405101",
            "name": "ឌី សុភាវី"
        },
        {
            "barcode": "171135730",
            "dpc": "03014405201",
            "name": "ទុយ ស្រស់"
        },
        {
            "barcode": "171135731",
            "dpc": "03014405301",
            "name": "ចៅ ហ្វឹង២"
        },
        {
            "barcode": "171135732",
            "dpc": "03014405401",
            "name": "តែ គី"
        },
        {
            "barcode": "171135733",
            "dpc": "03014405501",
            "name": "ស្ដើង ឌី"
        },
        {
            "barcode": "171135734",
            "dpc": "03014405701",
            "name": "ហឿន សុធា"
        },
        {
            "barcode": "171135735",
            "dpc": "03014405801",
            "name": "អាង ហ៊ុយ"
        },
        {
            "barcode": "171135736",
            "dpc": "03014405901",
            "name": "សុខ ហ៊ុន"
        },
        {
            "barcode": "171135737",
            "dpc": "03014406001",
            "name": "ញឹក ចំរើន"
        },
        {
            "barcode": "171135738",
            "dpc": "03014406101",
            "name": "សុខ ភាង"
        },
        {
            "barcode": "171135739",
            "dpc": "03014406301",
            "name": "ស៊ី ចិន្ដា"
        },
        {
            "barcode": "171135740",
            "dpc": "03014406401",
            "name": "គី ម៉េងទុយ១"
        },
        {
            "barcode": "171135741",
            "dpc": "03014406501",
            "name": "គី ម៉េងទុយ"
        },
        {
            "barcode": "171135742",
            "dpc": "03014406601",
            "name": "វិញ ឡេង"
        },
        {
            "barcode": "171135743",
            "dpc": "03014406701",
            "name": "វិញ ប៊ុនឆៃ"
        },
        {
            "barcode": "171135744",
            "dpc": "03014406801",
            "name": "ឈៀង ឈុន"
        },
        {
            "barcode": "171135745",
            "dpc": "03014406901",
            "name": "អ៊ុង សុធារី"
        },
        {
            "barcode": "171135746",
            "dpc": "03014407001",
            "name": "ង៉ុក វរី"
        },
        {
            "barcode": "171135747",
            "dpc": "03014407101",
            "name": "ឡៃ រឿង"
        },
        {
            "barcode": "171135748",
            "dpc": "03014407201",
            "name": "ពិន ឈឿ"
        },
        {
            "barcode": "171135749",
            "dpc": "03014407301",
            "name": "ឌុច សំ"
        },
        {
            "barcode": "171135750",
            "dpc": "03014407401",
            "name": "កែវ សុផល"
        },
        {
            "barcode": "171135751",
            "dpc": "03014407501",
            "name": "ឡាំ គឹមហៀង"
        },
        {
            "barcode": "171135752",
            "dpc": "03014407601",
            "name": "ឆាយ សុធា"
        },
        {
            "barcode": "171135753",
            "dpc": "03014407701",
            "name": "វិន ផល្លី"
        },
        {
            "barcode": "171135754",
            "dpc": "03014407801",
            "name": "ឈុន គឹមលី"
        },
        {
            "barcode": "171135755",
            "dpc": "03014408001",
            "name": "យាង យៀប"
        },
        {
            "barcode": "171135756",
            "dpc": "03014408101",
            "name": "ជា ចំរើន"
        },
        {
            "barcode": "171135757",
            "dpc": "03014408201",
            "name": "សុខ ភាព"
        },
        {
            "barcode": "171135758",
            "dpc": "03014408301",
            "name": "ថៃ ស្រីពៅ"
        },
        {
            "barcode": "171135759",
            "dpc": "03014408401",
            "name": "រស់ វណ្ណារី"
        },
        {
            "barcode": "171135760",
            "dpc": "03014408501",
            "name": "វង្ស វី"
        },
        {
            "barcode": "171135761",
            "dpc": "03014408601",
            "name": "ជា តែហុង"
        },
        {
            "barcode": "171135762",
            "dpc": "03014408701",
            "name": "ស៊្រាង រ៉ាតូ"
        },
        {
            "barcode": "171135763",
            "dpc": "03014408801",
            "name": "ស៊្រាង រ៉ាតូ ១"
        },
        {
            "barcode": "171135764",
            "dpc": "03014408901",
            "name": "ស៊ុយ គឹមហៃ"
        },
        {
            "barcode": "171135765",
            "dpc": "03014409001",
            "name": "ចេង ហ៊ាង ១"
        },
        {
            "barcode": "171135766",
            "dpc": "03014409101",
            "name": "ចេង ហ៊ាង ២"
        },
        {
            "barcode": "171135767",
            "dpc": "03014409201",
            "name": "ប្រឹម យឿក"
        },
        {
            "barcode": "171135768",
            "dpc": "03014409301",
            "name": "គង់ សុភ័ក្រ"
        },
        {
            "barcode": "171135769",
            "dpc": "03014409401",
            "name": "អ៊ិត ចន្រ្ទា"
        },
        {
            "barcode": "171135770",
            "dpc": "03014409501",
            "name": "អ៊ឹង សុគុន្ធ"
        },
        {
            "barcode": "171135771",
            "dpc": "03014409601",
            "name": "ភួង សុភាស់"
        },
        {
            "barcode": "171135772",
            "dpc": "03014409701",
            "name": "ទេព ហ៊ាន"
        },
        {
            "barcode": "171135773",
            "dpc": "03014409801",
            "name": "សយ សេរី"
        },
        {
            "barcode": "171135774",
            "dpc": "03014409901",
            "name": "វ៉ាន់ ថូ"
        },
        {
            "barcode": "171135775",
            "dpc": "03014410001",
            "name": "ប៉ែន សូនី"
        },
        {
            "barcode": "171135776",
            "dpc": "03014410101",
            "name": "អួន ហ៊ល"
        }
    ];


barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
