let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=

    [
        {
            "barcode": "171133016",
            "dpc": "03014503201",
            "name": "សេក អាយ"
        },
        {
            "barcode": "171133017",
            "dpc": "03014500101",
            "name": "សាន គឹមឆេង"
        },
        {
            "barcode": "171133018",
            "dpc": "03014508101",
            "name": "ស្រី ម៉ាណេត"
        },
        {
            "barcode": "171133019",
            "dpc": "03014508201",
            "name": "ជឿន ស៊ីនឿន"
        },
        {
            "barcode": "171133020",
            "dpc": "03014508301",
            "name": "សំ វុន"
        },
        {
            "barcode": "171133021",
            "dpc": "03014508401",
            "name": "ជេត ស៊ន"
        },
        {
            "barcode": "171133022",
            "dpc": "03014508501",
            "name": "មិ សាមឿត"
        },
        {
            "barcode": "171133023",
            "dpc": "03014508601",
            "name": "វ៉ាន និមល"
        },
        {
            "barcode": "171133024",
            "dpc": "03014508701",
            "name": "ឡុច និមល"
        },
        {
            "barcode": "171133025",
            "dpc": "03014508801",
            "name": "យឿន យ៉ុន"
        },
        {
            "barcode": "171133026",
            "dpc": "03014508901",
            "name": "យ៉ុង យ៉ុន"
        },
        {
            "barcode": "171133027",
            "dpc": "03014509001",
            "name": "លុយ ដារ៉ា"
        },
        {
            "barcode": "171133028",
            "dpc": "03014509101",
            "name": "ឈយ រុន"
        },
        {
            "barcode": "171133029",
            "dpc": "03014509201",
            "name": "ម៉ា ស៊ីថា"
        },
        {
            "barcode": "171133030",
            "dpc": "03014509301",
            "name": "ឆាយ ណារី"
        },
        {
            "barcode": "171133031",
            "dpc": "03014509401",
            "name": "ទុយ សានិន"
        },
        {
            "barcode": "171133032",
            "dpc": "03014509501",
            "name": "គ្រួច សំអឿន"
        },
        {
            "barcode": "171133033",
            "dpc": "03014509601",
            "name": "អេង គឹមសាន្ត"
        },
        {
            "barcode": "171133034",
            "dpc": "03014509701",
            "name": "ចាន់ ស៊ីណា"
        },
        {
            "barcode": "171133035",
            "dpc": "03014509801",
            "name": "ជំ ចំរើន"
        },
        {
            "barcode": "171133036",
            "dpc": "03014509901",
            "name": "ចេវ ឈើយ"
        },
        {
            "barcode": "171133037",
            "dpc": "03014510001",
            "name": "នួរ លីណា"
        },
        {
            "barcode": "171133038",
            "dpc": "03014510101",
            "name": "តែ ឈុន"
        },
        {
            "barcode": "171133039",
            "dpc": "03014510201",
            "name": "យ៉េម អែល"
        },
        {
            "barcode": "171133040",
            "dpc": "03014510301",
            "name": "ទេព សាមុន"
        },
        {
            "barcode": "171133041",
            "dpc": "03014510401",
            "name": "លន ស៊ីចែម"
        },
        {
            "barcode": "171133042",
            "dpc": "03014510501",
            "name": "ជុំ រិទ្ធី"
        },
        {
            "barcode": "171133043",
            "dpc": "03014510701",
            "name": "អ៊ឹង ខួង"
        },
        {
            "barcode": "171133044",
            "dpc": "03014510801",
            "name": "អ៊ី សាវុន"
        },
        {
            "barcode": "171133045",
            "dpc": "03014510901",
            "name": "ឌុក សារឿត"
        },
        {
            "barcode": "171133046",
            "dpc": "03014511001",
            "name": "សាលាជំនីក"
        },
        {
            "barcode": "171133047",
            "dpc": "03014511201",
            "name": "ម៉ៅ សុស"
        },
        {
            "barcode": "171133048",
            "dpc": "03014511301",
            "name": "សុស សុវណ្ណ"
        },
        {
            "barcode": "171133049",
            "dpc": "03014511401",
            "name": "រៀម ដារា"
        },
        {
            "barcode": "171133050",
            "dpc": "03014511501",
            "name": "ម៉ៅ សាមឿន"
        },
        {
            "barcode": "171133051",
            "dpc": "03014511601",
            "name": "ទីសត្តឃាត ស/សង្កែរ"
        },
        {
            "barcode": "171133052",
            "dpc": "03014511801",
            "name": "លៀម ហ៊ុន"
        },
        {
            "barcode": "171133053",
            "dpc": "03014511901",
            "name": "ឆេង នឿត"
        },
        {
            "barcode": "171133054",
            "dpc": "03014512001",
            "name": "ផល មុន្នី"
        },
        {
            "barcode": "171133055",
            "dpc": "03014512101",
            "name": "ណាម ឆាន់"
        },
        {
            "barcode": "171133056",
            "dpc": "03014512201",
            "name": "យុត ប្រុស"
        },
        {
            "barcode": "171133057",
            "dpc": "03014512301",
            "name": "ស្វាយ យ៉េន"
        },
        {
            "barcode": "171133058",
            "dpc": "03014512401",
            "name": "អ៊ូរ ម៉ាក"
        },
        {
            "barcode": "171133059",
            "dpc": "03014512501",
            "name": "សឿន ស៊ាប"
        },
        {
            "barcode": "171133060",
            "dpc": "03014512601",
            "name": "យ៉ាន ហាន"
        },
        {
            "barcode": "171133061",
            "dpc": "03014512701",
            "name": "សឿន ធី"
        },
        {
            "barcode": "171133062",
            "dpc": "03014512801",
            "name": "ឯក ស៊ន"
        },
        {
            "barcode": "171133063",
            "dpc": "03014512901",
            "name": "យ៉ែក សុរឿន"
        },
        {
            "barcode": "171133064",
            "dpc": "03014513001",
            "name": "ឯក ឡាត់"
        },
        {
            "barcode": "171133065",
            "dpc": "03014513201",
            "name": "វ៉ាត វុន"
        },
        {
            "barcode": "171133066",
            "dpc": "03014513401",
            "name": "សឿន សឿម"
        },
        {
            "barcode": "171133067",
            "dpc": "03014513601",
            "name": "កែវ សារ៉ា"
        },
        {
            "barcode": "171133068",
            "dpc": "03014513701",
            "name": "ផល វាសនា"
        },
        {
            "barcode": "171133069",
            "dpc": "03014513801",
            "name": "ឡាច វីឡា"
        },
        {
            "barcode": "171133070",
            "dpc": "03014513901",
            "name": "សត់ ឡី"
        },
        {
            "barcode": "171133071",
            "dpc": "03014514001",
            "name": "រឿម ឈន"
        },
        {
            "barcode": "171133072",
            "dpc": "03014514101",
            "name": "ម៉ាន សំណាងហាន"
        },
        {
            "barcode": "171133073",
            "dpc": "03014514201",
            "name": "ពេជ្រ វើន"
        },
        {
            "barcode": "171133074",
            "dpc": "03014500201",
            "name": "អ៊ុក វី"
        },
        {
            "barcode": "171133075",
            "dpc": "03014500301",
            "name": "ស៊ុយ សឿប"
        },
        {
            "barcode": "171133076",
            "dpc": "03014500401",
            "name": "តា កួយ"
        },
        {
            "barcode": "171133077",
            "dpc": "03014500501",
            "name": "កែវ លីយ៉េន"
        },
        {
            "barcode": "171133078",
            "dpc": "03014500601",
            "name": "ហួរ ហួន"
        },
        {
            "barcode": "171133079",
            "dpc": "03014500801",
            "name": "សោម វុទ្ធី"
        },
        {
            "barcode": "171133080",
            "dpc": "03014500901",
            "name": "ប្លង សេដ្ឋា"
        },
        {
            "barcode": "171133081",
            "dpc": "03014501001",
            "name": "ព្រាប សារឿន"
        },
        {
            "barcode": "171133082",
            "dpc": "03014501101",
            "name": "យ៉ូន យ៉ាន"
        },
        {
            "barcode": "171133083",
            "dpc": "03014501201",
            "name": "យ៉ូន យ៉ាន២"
        },
        {
            "barcode": "171133084",
            "dpc": "03014501301",
            "name": "គឹម សុង"
        },
        {
            "barcode": "171133085",
            "dpc": "03014501401",
            "name": "ញឹក ឆាត"
        },
        {
            "barcode": "171133086",
            "dpc": "03014501501",
            "name": "រ៉េត ឆុន"
        },
        {
            "barcode": "171133087",
            "dpc": "03014501601",
            "name": "កាំ ស៊ាន"
        },
        {
            "barcode": "171133088",
            "dpc": "03014501801",
            "name": "សេង សាវឿន"
        },
        {
            "barcode": "171133089",
            "dpc": "03014501701",
            "name": "ម៉ក់ ទូច"
        },
        {
            "barcode": "171133090",
            "dpc": "03014501901",
            "name": "កៅ ប៊ួយ"
        },
        {
            "barcode": "171133091",
            "dpc": "03014502201",
            "name": "វ៉ាន សាវឿង"
        },
        {
            "barcode": "171133092",
            "dpc": "03014502001",
            "name": "ឡេង ណារី"
        },
        {
            "barcode": "171133093",
            "dpc": "03014502101",
            "name": "ជឿម ពុធហេង"
        },
        {
            "barcode": "171133094",
            "dpc": "03014502301",
            "name": "តូ ទុំ"
        },
        {
            "barcode": "171133095",
            "dpc": "03014502401",
            "name": "រ័ត្ន សារ៉ុម"
        },
        {
            "barcode": "171133096",
            "dpc": "03014502501",
            "name": "មាន ញ៉ាន"
        },
        {
            "barcode": "171133097",
            "dpc": "03014502701",
            "name": "ឡាប ឡាង"
        },
        {
            "barcode": "171133098",
            "dpc": "03014502801",
            "name": "លៀប លឿម"
        },
        {
            "barcode": "171133099",
            "dpc": "03014502901",
            "name": "ឯក សេង"
        },
        {
            "barcode": "171133100",
            "dpc": "03014503001",
            "name": "វ៉ាន ស៊ីនួន"
        },
        {
            "barcode": "171133101",
            "dpc": "03014503101",
            "name": "ហ៊ាន ធឿន"
        },
        {
            "barcode": "171133102",
            "dpc": "03014503301",
            "name": "ឈឺន វើន"
        },
        {
            "barcode": "171133103",
            "dpc": "03014503401",
            "name": "ឆ សុធឿត"
        },
        {
            "barcode": "171133104",
            "dpc": "03014503501",
            "name": "ហ៊ាន តឹកលី"
        },
        {
            "barcode": "171133105",
            "dpc": "03014503601",
            "name": "អ៊ុក សុធី"
        },
        {
            "barcode": "171133106",
            "dpc": "03014503701",
            "name": "ម៉ម មួន"
        },
        {
            "barcode": "171133107",
            "dpc": "03014503801",
            "name": "ឆិន ចន្ទ័សុធី"
        },
        {
            "barcode": "171133108",
            "dpc": "03014503901",
            "name": "ងិន ខេមរិទ្ធ"
        },
        {
            "barcode": "171133109",
            "dpc": "03014504001",
            "name": "ខាន់ ផល្លា"
        },
        {
            "barcode": "171133110",
            "dpc": "03014504101",
            "name": "ម៉ុក ដារ៉ាឌីកា"
        },
        {
            "barcode": "171133111",
            "dpc": "03014504201",
            "name": "វិត្ត កូឡា"
        },
        {
            "barcode": "171133112",
            "dpc": "03014504301",
            "name": "អេង ស៊ីផា"
        },
        {
            "barcode": "171133113",
            "dpc": "03014504401",
            "name": "នី រស្មី"
        },
        {
            "barcode": "171133114",
            "dpc": "03014504501",
            "name": "អ៊ំ ម៉ាញ"
        },
        {
            "barcode": "171133115",
            "dpc": "03014504601",
            "name": "ឡី ឡា"
        },
        {
            "barcode": "171133116",
            "dpc": "03014504701",
            "name": "ឆន ឡី"
        },
        {
            "barcode": "171133117",
            "dpc": "03014504801",
            "name": "មាស សាវ៉ន"
        },
        {
            "barcode": "171133118",
            "dpc": "03014504901",
            "name": "ស៊ុន ស៊ែម"
        },
        {
            "barcode": "171133119",
            "dpc": "03014505001",
            "name": "ឈឿត សារឿត"
        },
        {
            "barcode": "171133120",
            "dpc": "03014505101",
            "name": "វ៉ាន សុខុន"
        },
        {
            "barcode": "171133121",
            "dpc": "03014505201",
            "name": "ជូន រឿត"
        },
        {
            "barcode": "171133122",
            "dpc": "03014505301",
            "name": "គង់ លន"
        },
        {
            "barcode": "171133123",
            "dpc": "03014505401",
            "name": "អំ ពុទ្ធារី"
        },
        {
            "barcode": "171133124",
            "dpc": "03014505501",
            "name": "អ៊ូរ ហឿង"
        },
        {
            "barcode": "171133125",
            "dpc": "03014505601",
            "name": "ទុយ ផល"
        },
        {
            "barcode": "171133126",
            "dpc": "03014505701",
            "name": "វ៉ាន់ ណាវី"
        },
        {
            "barcode": "171133127",
            "dpc": "03014505801",
            "name": "អ៊ុក ស៊ីនួន"
        },
        {
            "barcode": "171133128",
            "dpc": "03014505901",
            "name": "វ៉ៃ ប៉ូ"
        },
        {
            "barcode": "171133129",
            "dpc": "03014506001",
            "name": "ភិន សុវណ្ណដាវី"
        },
        {
            "barcode": "171133130",
            "dpc": "03014506101",
            "name": "អែវ និមល"
        },
        {
            "barcode": "171133131",
            "dpc": "03014506201",
            "name": "យ៉ាន ឧស្មាន"
        },
        {
            "barcode": "171133132",
            "dpc": "03014506301",
            "name": "យ៉ើ សោហ្វី"
        },
        {
            "barcode": "171133133",
            "dpc": "03014506401",
            "name": "នេះ យាកតូក"
        },
        {
            "barcode": "171133134",
            "dpc": "03014506501",
            "name": "ម៉ែន ធារ៉ា"
        },
        {
            "barcode": "171133135",
            "dpc": "03014506601",
            "name": "វី ចំរើន"
        },
        {
            "barcode": "171133136",
            "dpc": "03014506801",
            "name": "ប៊ី ហន"
        },
        {
            "barcode": "171133137",
            "dpc": "03014506701",
            "name": "ផាត ចាន់រិទ្ធ"
        },
        {
            "barcode": "171133138",
            "dpc": "03014506901",
            "name": "ហូវ ហៀប"
        },
        {
            "barcode": "171133139",
            "dpc": "03014507001",
            "name": "ប៊ូរ វណ្ណនី"
        },
        {
            "barcode": "171133140",
            "dpc": "03014507101",
            "name": "ចាន់ សេង"
        },
        {
            "barcode": "171133141",
            "dpc": "03014507201",
            "name": "អោប សាវឿន"
        },
        {
            "barcode": "171133142",
            "dpc": "03014507301",
            "name": "ហុង ហោ"
        },
        {
            "barcode": "171133143",
            "dpc": "03014507501",
            "name": "ឈិន សុចិត្រា"
        },
        {
            "barcode": "171133144",
            "dpc": "03014507401",
            "name": "ខៀវ វិចិត្ត"
        },
        {
            "barcode": "171133145",
            "dpc": "03014507701",
            "name": "សុង ញឹប"
        },
        {
            "barcode": "171133146",
            "dpc": "03014507801",
            "name": "លិក ហ្វិចលាង"
        },
        {
            "barcode": "171133147",
            "dpc": "03014507901",
            "name": "សុត សុជាតិ"
        },
        {
            "barcode": "171133148",
            "dpc": "03014508001",
            "name": "បឹង រាត្រី"
        },
        {
            "barcode": "171133149",
            "dpc": "03014511101",
            "name": "សុស សាវន្ត័"
        },
        {
            "barcode": "171133150",
            "dpc": "03014514301",
            "name": "សាលាបឋមសិក្សាវត្តតាមិម"
        },
        {
            "barcode": "171133151",
            "dpc": "03014514401",
            "name": "ធួ គន្ធី"
        },
        {
            "barcode": "171133152",
            "dpc": "03014514501",
            "name": "ញ៉ូង​ ប៉ាន់"
        },
        {
            "barcode": "171133153",
            "dpc": "03014514601",
            "name": "ចៅ សុផានី"
        },
        {
            "barcode": "171133154",
            "dpc": "03014514701",
            "name": "អ៊ុល ឯក"
        },
        {
            "barcode": "171133155",
            "dpc": "03014514801",
            "name": "គឹម សារី"
        },
        {
            "barcode": "171133156",
            "dpc": "03014514901",
            "name": "ជ ពន្លឺ"
        },
        {
            "barcode": "171133157",
            "dpc": "03014515001",
            "name": "អៀង រិន"
        },
        {
            "barcode": "171133158",
            "dpc": "03014515101",
            "name": "កែវ វេត"
        },
        {
            "barcode": "171133159",
            "dpc": "03014515201",
            "name": "សៀន កញ្ចារ៉ា"
        },
        {
            "barcode": "171133160",
            "dpc": "03014515701",
            "name": "ភោគ តុល"
        },
        {
            "barcode": "171133161",
            "dpc": "03014515801",
            "name": "អតិថិជនថ្មី"
        },
        {
            "barcode": "171133162",
            "dpc": "03014515901",
            "name": "ចែម សេង"
        },
        {
            "barcode": "171133163",
            "dpc": "03014516001",
            "name": "រ៉ុង ចន្តា"
        },
        {
            "barcode": "171133164",
            "dpc": "03014516101",
            "name": "រូម សារិន"
        },
        {
            "barcode": "171133165",
            "dpc": "03014516301",
            "name": "ធឹម សុផា"
        },
        {
            "barcode": "171133166",
            "dpc": "03014516401",
            "name": "ស៊ូយ វណ្ណ"
        },
        {
            "barcode": "171133167",
            "dpc": "03014516501",
            "name": "សែម បណ្កា"
        },
        {
            "barcode": "171133168",
            "dpc": "03014516701",
            "name": "យ៉ុង តុងហាន់"
        },
        {
            "barcode": "171133169",
            "dpc": "03014516601",
            "name": "យន ចាន់ដារ៉ា"
        },
        {
            "barcode": "171133170",
            "dpc": "03014516801",
            "name": "ចែង យិញ"
        },
        {
            "barcode": "171133171",
            "dpc": "03014516901",
            "name": "រុន ដានី"
        },
        {
            "barcode": "171133172",
            "dpc": "03014517001",
            "name": "ឡោ សុខុម"
        },
        {
            "barcode": "171133173",
            "dpc": "03014517101",
            "name": "កឺ គឹមសៀង"
        },
        {
            "barcode": "171133174",
            "dpc": "03014517201",
            "name": "អៀង ចាន់ធា"
        },
        {
            "barcode": "171133175",
            "dpc": "03014517301",
            "name": "ឈួន ចាន់ណា"
        },
        {
            "barcode": "171133176",
            "dpc": "03014517401",
            "name": "សេង ខុម"
        },
        {
            "barcode": "171133177",
            "dpc": "03014517501",
            "name": "ថន សុខគង់"
        },
        {
            "barcode": "171133178",
            "dpc": "03014517601",
            "name": "ចាប ស្មាន"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
