let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171137482",
            "dpc": "03020739801",
            "name": "អ៊ិន យូឃាង"
        },
        {
            "barcode": "171137483",
            "dpc": "03020737301",
            "name": "វ៉ាន់ចាន់ ធី"
        },
        {
            "barcode": "171137484",
            "dpc": "03020737401",
            "name": "ទុយ ហួន"
        },
        {
            "barcode": "171137485",
            "dpc": "03020737501",
            "name": "ឃួន ពុជ"
        },
        {
            "barcode": "171137486",
            "dpc": "03020737601",
            "name": "ពៅ រដ្ឋា"
        },
        {
            "barcode": "171137487",
            "dpc": "03020737701",
            "name": "ជុច សារឿត"
        },
        {
            "barcode": "171137488",
            "dpc": "03020737901",
            "name": "យិន រដ្ឋា"
        },
        {
            "barcode": "171137489",
            "dpc": "03020737801",
            "name": "ហម វ៉ុង"
        },
        {
            "barcode": "171137490",
            "dpc": "03020703001",
            "name": "ថាន់ ម៉ុយ"
        },
        {
            "barcode": "171137491",
            "dpc": "03020702901",
            "name": "ចាប ឃីម"
        },
        {
            "barcode": "171137492",
            "dpc": "03020707101",
            "name": "អ៊ឹង យក់ឃន"
        },
        {
            "barcode": "171137493",
            "dpc": "03020706901",
            "name": "ព្រំវិហាសាវ័តថ្មី"
        },
        {
            "barcode": "171137494",
            "dpc": "03020706801",
            "name": "គុយ ជួយ"
        },
        {
            "barcode": "171137495",
            "dpc": "03020706701",
            "name": "ធូស ផានណា"
        },
        {
            "barcode": "171137496",
            "dpc": "03020706601",
            "name": "លឹម  សាមេត"
        },
        {
            "barcode": "171137497",
            "dpc": "03020706501",
            "name": "ប៉ា ពូន"
        },
        {
            "barcode": "171137498",
            "dpc": "03020706401",
            "name": "សៅ សុកាន"
        },
        {
            "barcode": "171137499",
            "dpc": "03020706301",
            "name": "សូ សែម"
        },
        {
            "barcode": "171137500",
            "dpc": "03020706201",
            "name": "ប៊ុន វណ្ណា"
        },
        {
            "barcode": "171137501",
            "dpc": "03020706101",
            "name": "ឡាប ម៉ាប់"
        },
        {
            "barcode": "171137502",
            "dpc": "03020706001",
            "name": "ស្មាន់ សំប៊ុន"
        },
        {
            "barcode": "171137503",
            "dpc": "03020705901",
            "name": "សោម គង់"
        },
        {
            "barcode": "171137504",
            "dpc": "03020705801",
            "name": "ចាយ សុធី"
        },
        {
            "barcode": "171137505",
            "dpc": "03020705701",
            "name": "ការាស់សាំងអូរចារ"
        },
        {
            "barcode": "171137506",
            "dpc": "03020705601",
            "name": "សំ ស៊ិន"
        },
        {
            "barcode": "171137507",
            "dpc": "03020705501",
            "name": "ចាន់ ថា"
        },
        {
            "barcode": "171137508",
            "dpc": "03020705401",
            "name": "សាង ឃៀង"
        },
        {
            "barcode": "171137509",
            "dpc": "03020705301",
            "name": "ឃួន  ងួន"
        },
        {
            "barcode": "171137510",
            "dpc": "03020705001",
            "name": "សេង ទូច"
        },
        {
            "barcode": "171137511",
            "dpc": "03020704901",
            "name": "ឈឹម សួន"
        },
        {
            "barcode": "171137512",
            "dpc": "03020704501",
            "name": "ឡាញ់ សំបូរ"
        },
        {
            "barcode": "171137513",
            "dpc": "03020704401",
            "name": "សាន ងិន"
        },
        {
            "barcode": "171137514",
            "dpc": "03020704301",
            "name": "យី ស៊ីម"
        },
        {
            "barcode": "171137515",
            "dpc": "03020704201",
            "name": "លី សារ៉ា"
        },
        {
            "barcode": "171137516",
            "dpc": "03020704101",
            "name": "ចាន់ សំអាង"
        },
        {
            "barcode": "171137517",
            "dpc": "03020703901",
            "name": "សុក ផល្លា"
        },
        {
            "barcode": "171137518",
            "dpc": "03020703801",
            "name": "ខៀវ សំអឿន"
        },
        {
            "barcode": "171137519",
            "dpc": "03020703701",
            "name": "តៀម  សារ៉េត"
        },
        {
            "barcode": "171137520",
            "dpc": "03020703601",
            "name": "លក្ខ ទិត្យ"
        },
        {
            "barcode": "171137521",
            "dpc": "03020703501",
            "name": "ហៀ សោ"
        },
        {
            "barcode": "171137522",
            "dpc": "03020703401",
            "name": "ជឹម  សារ៉ាយ"
        },
        {
            "barcode": "171137523",
            "dpc": "03020703301",
            "name": "ខាំ នីន"
        },
        {
            "barcode": "171137524",
            "dpc": "03020703201",
            "name": "យិន សុពល"
        },
        {
            "barcode": "171137525",
            "dpc": "03020701601",
            "name": "ង៉ែត យឿន"
        },
        {
            "barcode": "171137526",
            "dpc": "03020712301",
            "name": "ប៉ា គឹមស៊ត"
        },
        {
            "barcode": "171137527",
            "dpc": "03020712101",
            "name": "លី តេង"
        },
        {
            "barcode": "171137528",
            "dpc": "03020711901",
            "name": "ទុយ ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171137529",
            "dpc": "03020711701",
            "name": "នួន ញឿត"
        },
        {
            "barcode": "171137530",
            "dpc": "03020711501",
            "name": "សាន សុភី"
        },
        {
            "barcode": "171137531",
            "dpc": "03020711401",
            "name": "ម៉ុក ប៊ុនធឿន"
        },
        {
            "barcode": "171137532",
            "dpc": "03020711301",
            "name": "សារិ វណ្ណា"
        },
        {
            "barcode": "171137533",
            "dpc": "03020711201",
            "name": "ម៉ុក វ៉ាន់ថានី"
        },
        {
            "barcode": "171137534",
            "dpc": "03020711101",
            "name": "គង់ យ៉ាវ"
        },
        {
            "barcode": "171137535",
            "dpc": "03020711001",
            "name": "កែវ រ៉េត"
        },
        {
            "barcode": "171137536",
            "dpc": "03020710901",
            "name": "សុខ ម៉ន"
        },
        {
            "barcode": "171137537",
            "dpc": "03020710801",
            "name": "កង សុផល"
        },
        {
            "barcode": "171137538",
            "dpc": "03020710701",
            "name": "លឹម ហួន"
        },
        {
            "barcode": "171137539",
            "dpc": "03020710601",
            "name": "យាន រ៉ាស៊ីន"
        },
        {
            "barcode": "171137540",
            "dpc": "03020710501",
            "name": "សួស បូរ"
        },
        {
            "barcode": "171137541",
            "dpc": "03020710401",
            "name": "ជាង ធី"
        },
        {
            "barcode": "171137542",
            "dpc": "03020710301",
            "name": "ដាំ ភឿក"
        },
        {
            "barcode": "171137543",
            "dpc": "03020710201",
            "name": "ឈុន វុន"
        },
        {
            "barcode": "171137544",
            "dpc": "03020710101",
            "name": "ចាន់ សុន"
        },
        {
            "barcode": "171137545",
            "dpc": "03020710001",
            "name": "ប៉ី  សំអុល"
        },
        {
            "barcode": "171137546",
            "dpc": "03020709901",
            "name": "ផ្លុង សារឿន"
        },
        {
            "barcode": "171137547",
            "dpc": "03020709801",
            "name": "ឌុក ទូច"
        },
        {
            "barcode": "171137548",
            "dpc": "03020709701",
            "name": "ភី ឈន"
        },
        {
            "barcode": "171137549",
            "dpc": "03020709601",
            "name": "យ៉ែម ង៉ា"
        },
        {
            "barcode": "171137550",
            "dpc": "03020709501",
            "name": "កង សារី"
        },
        {
            "barcode": "171137551",
            "dpc": "03020709401",
            "name": "ងួន វ៉ាន"
        },
        {
            "barcode": "171137552",
            "dpc": "03020709301",
            "name": "ចាន់ សន"
        },
        {
            "barcode": "171137553",
            "dpc": "03020709201",
            "name": "វូ ធា"
        },
        {
            "barcode": "171137554",
            "dpc": "03020709101",
            "name": "អេង សំអាន"
        },
        {
            "barcode": "171137555",
            "dpc": "03020709001",
            "name": "គង់ សំបូរ"
        },
        {
            "barcode": "171137556",
            "dpc": "03020708901",
            "name": "សួ គឹមសៀន"
        },
        {
            "barcode": "171137557",
            "dpc": "03020708801",
            "name": "សួ គឹមសាន"
        },
        {
            "barcode": "171137558",
            "dpc": "03020708701",
            "name": "ចាន់ តី"
        },
        {
            "barcode": "171137559",
            "dpc": "03020708601",
            "name": "ម៉ុក សាមឿន"
        },
        {
            "barcode": "171137560",
            "dpc": "03020708301",
            "name": "រើន ផារី"
        },
        {
            "barcode": "171137561",
            "dpc": "03020708201",
            "name": "សំ សុខខា"
        },
        {
            "barcode": "171137562",
            "dpc": "03020708101",
            "name": "ឈឹម ទូច"
        },
        {
            "barcode": "171137563",
            "dpc": "03020708001",
            "name": "ឈុន ឃី"
        },
        {
            "barcode": "171137564",
            "dpc": "03020707901",
            "name": "ពិន វ៉ារី"
        },
        {
            "barcode": "171137565",
            "dpc": "03020707801",
            "name": "យោក  ឆង"
        },
        {
            "barcode": "171137566",
            "dpc": "03020707701",
            "name": "ឆូយ សុខ"
        },
        {
            "barcode": "171137567",
            "dpc": "03020707601",
            "name": "នុត ផល្លី"
        },
        {
            "barcode": "171137568",
            "dpc": "03020707401",
            "name": "សាន់ ចាយ"
        },
        {
            "barcode": "171137569",
            "dpc": "03020707201",
            "name": "អុំ  ឌុច"
        },
        {
            "barcode": "171137570",
            "dpc": "03020723701",
            "name": "ឃួន ដេត"
        },
        {
            "barcode": "171137571",
            "dpc": "03020723601",
            "name": "ស្រី បណ្តូល"
        },
        {
            "barcode": "171137572",
            "dpc": "03020723501",
            "name": "តោ វុដ្ឋា"
        },
        {
            "barcode": "171137573",
            "dpc": "03020723401",
            "name": "ផា  សាវឿន"
        },
        {
            "barcode": "171137574",
            "dpc": "03020723301",
            "name": "អឿង សុខុន"
        },
        {
            "barcode": "171137575",
            "dpc": "03020723201",
            "name": "កៅ ម៉េងគ្រាន់"
        },
        {
            "barcode": "171137576",
            "dpc": "03020723101",
            "name": "អួន ចាន់ធីតា"
        },
        {
            "barcode": "171137577",
            "dpc": "03020723001",
            "name": "សម សាវើន"
        },
        {
            "barcode": "171137578",
            "dpc": "03020722901",
            "name": "ប្រាជ្ញ រុន"
        },
        {
            "barcode": "171137579",
            "dpc": "03020722801",
            "name": "ឡៃ សាមុនធី"
        },
        {
            "barcode": "171137580",
            "dpc": "03020722701",
            "name": "សួស សុម៉ាលី"
        },
        {
            "barcode": "171137581",
            "dpc": "03020722601",
            "name": "ស្រី រឿន"
        },
        {
            "barcode": "171137582",
            "dpc": "03020722501",
            "name": "ឃឹម សុផាត់"
        },
        {
            "barcode": "171137583",
            "dpc": "03020722401",
            "name": "ស៊ូ ណែវ"
        },
        {
            "barcode": "171137584",
            "dpc": "03020722301",
            "name": "ភោគ សន"
        },
        {
            "barcode": "171137585",
            "dpc": "03020722201",
            "name": "សុខ ឯម"
        },
        {
            "barcode": "171137586",
            "dpc": "03020722101",
            "name": "កែវ  សោភ័ណ"
        },
        {
            "barcode": "171137587",
            "dpc": "03020721801",
            "name": "អ៊ុក ណារិន"
        },
        {
            "barcode": "171137588",
            "dpc": "03020721701",
            "name": "ស្រី ថែសេង"
        },
        {
            "barcode": "171137589",
            "dpc": "03020721601",
            "name": "សារិ សុខុម"
        },
        {
            "barcode": "171137590",
            "dpc": "03020721501",
            "name": "លីម  សែន"
        },
        {
            "barcode": "171137591",
            "dpc": "03020721301",
            "name": "នួន ញ៉"
        },
        {
            "barcode": "171137592",
            "dpc": "03020721201",
            "name": "សេង ឡាយ"
        },
        {
            "barcode": "171137593",
            "dpc": "03020721101",
            "name": "អុំ  ឌឿ"
        },
        {
            "barcode": "171137594",
            "dpc": "03020714901",
            "name": "ប្រាក់ លឿត"
        },
        {
            "barcode": "171137595",
            "dpc": "03020714801",
            "name": "ស៊ី ណា"
        },
        {
            "barcode": "171137596",
            "dpc": "03020714701",
            "name": "ឃុន វណ្ណៈ"
        },
        {
            "barcode": "171137597",
            "dpc": "03020714601",
            "name": "មាស ទាវ"
        },
        {
            "barcode": "171137598",
            "dpc": "03020714501",
            "name": "ជា លីខា"
        },
        {
            "barcode": "171137599",
            "dpc": "03020714401",
            "name": "អោ ភឹម"
        },
        {
            "barcode": "171137600",
            "dpc": "03020714301",
            "name": "ហេង ឆែម"
        },
        {
            "barcode": "171137601",
            "dpc": "03020714201",
            "name": "ប៉ែន ណារិទ្ធ"
        },
        {
            "barcode": "171137602",
            "dpc": "03020713901",
            "name": "អុន  ពិសុទ្ធ"
        },
        {
            "barcode": "171137603",
            "dpc": "03020713801",
            "name": "ស្រី វ៉ាន"
        },
        {
            "barcode": "171137604",
            "dpc": "03020713601",
            "name": "ជួប ហាក់"
        },
        {
            "barcode": "171137605",
            "dpc": "03020713501",
            "name": "មុំ ច្រេន"
        },
        {
            "barcode": "171137606",
            "dpc": "03020713401",
            "name": "ក្រុមហ៊ុន 016"
        },
        {
            "barcode": "171137607",
            "dpc": "03020713301",
            "name": "ឡោ សុខជា"
        },
        {
            "barcode": "171137608",
            "dpc": "03020713201",
            "name": "ប្រេម ឌឿន"
        },
        {
            "barcode": "171137609",
            "dpc": "03020713101",
            "name": "ប៉ិល សុផល"
        },
        {
            "barcode": "171137610",
            "dpc": "03020713001",
            "name": "ពូក ធឿន"
        },
        {
            "barcode": "171137611",
            "dpc": "03020712901",
            "name": "ទ្រី ថា"
        },
        {
            "barcode": "171137612",
            "dpc": "03020712801",
            "name": "សៀង សុឃៀង"
        },
        {
            "barcode": "171137613",
            "dpc": "03020712701",
            "name": "ចិន ខ្មៅ(រ៉ាន់)"
        },
        {
            "barcode": "171137614",
            "dpc": "03020712601",
            "name": "ហ៊ួត  គឹមស៊ា"
        },
        {
            "barcode": "171137615",
            "dpc": "03020712501",
            "name": "ហោ ហុង"
        },
        {
            "barcode": "171137616",
            "dpc": "03020712401",
            "name": "អ៊ុយ ចាន់ធន"
        },
        {
            "barcode": "171137617",
            "dpc": "03020711801",
            "name": "យ៉ោក  សារី"
        },
        {
            "barcode": "171137618",
            "dpc": "03020720901",
            "name": "ហុក សារុំ"
        },
        {
            "barcode": "171137619",
            "dpc": "03020720801",
            "name": "ប៉ាច ផល្លី"
        },
        {
            "barcode": "171137620",
            "dpc": "03020720701",
            "name": "ប៉ាច សារឿន"
        },
        {
            "barcode": "171137621",
            "dpc": "03020720601",
            "name": "មាស ពៅ"
        },
        {
            "barcode": "171137622",
            "dpc": "03020720501",
            "name": "ជួន បុប្ផា"
        },
        {
            "barcode": "171137623",
            "dpc": "03020720401",
            "name": "យឹម សន្រ្ទីណ៍ (២)"
        },
        {
            "barcode": "171137624",
            "dpc": "03020720301",
            "name": "យឹម សន្រ្ទីណ៍ (១)"
        },
        {
            "barcode": "171137625",
            "dpc": "03020720201",
            "name": "តាន់ គឹមស៊ាង"
        },
        {
            "barcode": "171137626",
            "dpc": "03020720101",
            "name": "ឈូ  អេង"
        },
        {
            "barcode": "171137627",
            "dpc": "03020720001",
            "name": "ទិស្នាក់ការគណៈបក្ស"
        },
        {
            "barcode": "171137628",
            "dpc": "03020719901",
            "name": "ប៊ិន សារាយ"
        },
        {
            "barcode": "171137629",
            "dpc": "03020719801",
            "name": "ភោក គឹមសាន"
        },
        {
            "barcode": "171137630",
            "dpc": "03020719701",
            "name": "ចាន ប៊ុនរឿន"
        },
        {
            "barcode": "171137631",
            "dpc": "03020719601",
            "name": "លី គឹមយុន"
        },
        {
            "barcode": "171137632",
            "dpc": "03020719501",
            "name": "ពិន ស្រីបូរ"
        },
        {
            "barcode": "171137633",
            "dpc": "03020719401",
            "name": "ញឹក ចាន់ធឿន"
        },
        {
            "barcode": "171137634",
            "dpc": "03020719301",
            "name": "ទឹម យ៉ន"
        },
        {
            "barcode": "171137635",
            "dpc": "03020719201",
            "name": "ហម ថន"
        },
        {
            "barcode": "171137636",
            "dpc": "03020718901",
            "name": "ស៊ូ ខាសៀង"
        },
        {
            "barcode": "171137637",
            "dpc": "03020718801",
            "name": "ម៉េង ទូច"
        },
        {
            "barcode": "171137638",
            "dpc": "03020718701",
            "name": "ង៉ាន ងឹម"
        },
        {
            "barcode": "171137639",
            "dpc": "03020718601",
            "name": "កើត សេរី"
        },
        {
            "barcode": "171137640",
            "dpc": "03020718501",
            "name": "រ៉េត សារ៉ែន"
        },
        {
            "barcode": "171137641",
            "dpc": "03020718401",
            "name": "យ៉យ ហ៊ាន"
        },
        {
            "barcode": "171137642",
            "dpc": "03020718301",
            "name": "កៅ សាវុទ្ធី"
        },
        {
            "barcode": "171137643",
            "dpc": "03020718201",
            "name": "ម៉ៅ នី"
        },
        {
            "barcode": "171137644",
            "dpc": "03020718101",
            "name": "ប៊ុន ថូល"
        },
        {
            "barcode": "171137645",
            "dpc": "03020717901",
            "name": "ឃ្លាំង យូអ៊ិន"
        },
        {
            "barcode": "171137646",
            "dpc": "03020717701",
            "name": "ប៊ុន សារុន"
        },
        {
            "barcode": "171137647",
            "dpc": "03020717601",
            "name": "សុខ គី"
        },
        {
            "barcode": "171137648",
            "dpc": "03020717401",
            "name": "សុខ វិបុល"
        },
        {
            "barcode": "171137649",
            "dpc": "03020717301",
            "name": "ជូ វុទ្ធី"
        },
        {
            "barcode": "171137650",
            "dpc": "03020717201",
            "name": "រ៉ាន បូណាត"
        },
        {
            "barcode": "171137651",
            "dpc": "03020717101",
            "name": "ឈឹន  សុភា"
        },
        {
            "barcode": "171137652",
            "dpc": "03020717001",
            "name": "ហេង សារ៉ាន់"
        },
        {
            "barcode": "171137653",
            "dpc": "03020716901",
            "name": "សាន នី (១)"
        },
        {
            "barcode": "171137654",
            "dpc": "03020716801",
            "name": "ឈឹម រ៉ាដែន"
        },
        {
            "barcode": "171137655",
            "dpc": "03020716701",
            "name": "ឈុន ហួរ"
        },
        {
            "barcode": "171137656",
            "dpc": "03020716601",
            "name": "ចាន់ ឃឿង"
        },
        {
            "barcode": "171137657",
            "dpc": "03020716501",
            "name": "គឹម ម៉ាលីវាន់ ៣"
        },
        {
            "barcode": "171137658",
            "dpc": "03020716401",
            "name": "គឹម ម៉ាលីវាន់ ២"
        },
        {
            "barcode": "171137659",
            "dpc": "03020716301",
            "name": "គឹម ម៉ាលីវាន់ ១"
        },
        {
            "barcode": "171137660",
            "dpc": "03020716201",
            "name": "ច័ន្ទ សុគុន"
        },
        {
            "barcode": "171137661",
            "dpc": "03020716101",
            "name": "ចាន់ ម៉េង"
        },
        {
            "barcode": "171137662",
            "dpc": "03020716001",
            "name": "សាយ ប៊ុនធី (១)"
        },
        {
            "barcode": "171137663",
            "dpc": "03020715901",
            "name": "សាយ ប៊ុនធី (២)"
        },
        {
            "barcode": "171137664",
            "dpc": "03020732701",
            "name": "ឈុត សារិន"
        },
        {
            "barcode": "171137665",
            "dpc": "03020732601",
            "name": "ប្រឹង ចន្ធូ"
        },
        {
            "barcode": "171137666",
            "dpc": "03020732501",
            "name": "សុខ ជាតិ"
        },
        {
            "barcode": "171137667",
            "dpc": "03020732401",
            "name": "យឹម  សារ៉េត"
        },
        {
            "barcode": "171137668",
            "dpc": "03020730201",
            "name": "គ្រី សម្បត្តិ"
        },
        {
            "barcode": "171137669",
            "dpc": "03020730101",
            "name": "សុខ សុខខា"
        },
        {
            "barcode": "171137670",
            "dpc": "03020730001",
            "name": "គិត ដូនារី"
        },
        {
            "barcode": "171137671",
            "dpc": "03020729901",
            "name": "តាំង ចាន់ធី"
        },
        {
            "barcode": "171137672",
            "dpc": "03020729801",
            "name": "តែង ឃុនណា"
        },
        {
            "barcode": "171137673",
            "dpc": "03020729701",
            "name": "ចៅ វ៉ាន់"
        },
        {
            "barcode": "171137674",
            "dpc": "03020729501",
            "name": "ម៉ៅ  ហុក"
        },
        {
            "barcode": "171137675",
            "dpc": "03020729401",
            "name": "ញ៉េប  វ៉ាន់ទី"
        },
        {
            "barcode": "171137676",
            "dpc": "03020729301",
            "name": "សុខ វិញ"
        },
        {
            "barcode": "171137677",
            "dpc": "03020729201",
            "name": "ម៉ុង សាង"
        },
        {
            "barcode": "171137678",
            "dpc": "03020729101",
            "name": "ឆាន់ ស៊ីញ"
        },
        {
            "barcode": "171137679",
            "dpc": "03020728901",
            "name": "ឡើយ ហេង"
        },
        {
            "barcode": "171137680",
            "dpc": "03020728701",
            "name": "សេ ហ៊ាង"
        },
        {
            "barcode": "171137681",
            "dpc": "03020728601",
            "name": "យូ ចាន់ទី"
        },
        {
            "barcode": "171137682",
            "dpc": "03020728401",
            "name": "សុខ គង់"
        },
        {
            "barcode": "171137683",
            "dpc": "03020728301",
            "name": "ឆេង ហួរ"
        },
        {
            "barcode": "171137684",
            "dpc": "03020728201",
            "name": "ជា វ៉ាត់"
        },
        {
            "barcode": "171137685",
            "dpc": "03020727901",
            "name": "យូ រីតា"
        },
        {
            "barcode": "171137686",
            "dpc": "03020727801",
            "name": "ភូ ចេង"
        },
        {
            "barcode": "171137687",
            "dpc": "03020727601",
            "name": "នួន ញ៉"
        },
        {
            "barcode": "171137688",
            "dpc": "03020713701",
            "name": "ជ្រិន អេង"
        },
        {
            "barcode": "171137689",
            "dpc": "03020727501",
            "name": "ស យីម"
        },
        {
            "barcode": "171137690",
            "dpc": "03020727401",
            "name": "ម៉ែន គង់"
        },
        {
            "barcode": "171137691",
            "dpc": "03020727301",
            "name": "កែវ តឿ"
        },
        {
            "barcode": "171137692",
            "dpc": "03020727201",
            "name": "លី សុភាព"
        },
        {
            "barcode": "171137693",
            "dpc": "03020727001",
            "name": "សៅ ចំប៉ី"
        },
        {
            "barcode": "171137694",
            "dpc": "03020726801",
            "name": "ថាច់ ហង្ស"
        },
        {
            "barcode": "171137695",
            "dpc": "03020726701",
            "name": "សាម ភកប៉ា"
        },
        {
            "barcode": "171137696",
            "dpc": "03020726601",
            "name": "លីន"
        },
        {
            "barcode": "171137697",
            "dpc": "03020726501",
            "name": "ញឹម សារិទ្ធ"
        },
        {
            "barcode": "171137698",
            "dpc": "03020726401",
            "name": "បូរ ប៉ុច"
        },
        {
            "barcode": "171137699",
            "dpc": "03020726301",
            "name": "នន់ គឹមថែ"
        },
        {
            "barcode": "171137700",
            "dpc": "03020726201",
            "name": "ឌិត សេរីសុផាណ្ណា"
        },
        {
            "barcode": "171137701",
            "dpc": "03020726101",
            "name": "មីន  សុខាន"
        },
        {
            "barcode": "171137702",
            "dpc": "03020726001",
            "name": "ស៊ូ ផាន"
        },
        {
            "barcode": "171137703",
            "dpc": "03020725801",
            "name": "មាស គាំ ៤"
        },
        {
            "barcode": "171137704",
            "dpc": "03020725701",
            "name": "មាស គាំ ៣"
        },
        {
            "barcode": "171137705",
            "dpc": "03020725601",
            "name": "មាស គាំ ២"
        },
        {
            "barcode": "171137706",
            "dpc": "03020725501",
            "name": "មាស គាំ ១"
        },
        {
            "barcode": "171137707",
            "dpc": "03020725401",
            "name": "ជឹម សុទ្ធា"
        },
        {
            "barcode": "171137708",
            "dpc": "03020725301",
            "name": "សោម សុភា"
        },
        {
            "barcode": "171137709",
            "dpc": "03020725201",
            "name": "សំ សារឿន"
        },
        {
            "barcode": "171137710",
            "dpc": "03020725101",
            "name": "ពៅ បុប្ផា"
        },
        {
            "barcode": "171137711",
            "dpc": "03020725001",
            "name": "អ៊ុន ចំរើន"
        },
        {
            "barcode": "171137712",
            "dpc": "03020724901",
            "name": "គឹម សុវណ្ណ"
        },
        {
            "barcode": "171137713",
            "dpc": "03020724601",
            "name": "តឹក លីម"
        },
        {
            "barcode": "171137714",
            "dpc": "03020724401",
            "name": "គិន  ភីណា"
        },
        {
            "barcode": "171137715",
            "dpc": "03020724301",
            "name": "គិន  ចិន្តា"
        },
        {
            "barcode": "171137716",
            "dpc": "03020724201",
            "name": "រ៉ិល រឿប"
        },
        {
            "barcode": "171137717",
            "dpc": "03020724101",
            "name": "កែវ  ស៊ីណា"
        },
        {
            "barcode": "171137718",
            "dpc": "03020724001",
            "name": "ឆន់ ចំរើន"
        },
        {
            "barcode": "171137719",
            "dpc": "03020723901",
            "name": "លឹម សារិទ្ធ"
        },
        {
            "barcode": "171137720",
            "dpc": "03020715801",
            "name": "ផន សុភា"
        },
        {
            "barcode": "171137721",
            "dpc": "03020715701",
            "name": "សាក់ សុខុម"
        },
        {
            "barcode": "171137722",
            "dpc": "03020715601",
            "name": "ឌី ហុង"
        },
        {
            "barcode": "171137723",
            "dpc": "03020715501",
            "name": "កែវ គឹមឈៀង"
        },
        {
            "barcode": "171137724",
            "dpc": "03020715401",
            "name": "ចាន់ ឌី"
        },
        {
            "barcode": "171137725",
            "dpc": "03020715301",
            "name": "ស្វាយ ផុន"
        },
        {
            "barcode": "171137726",
            "dpc": "03020715201",
            "name": "ប៉ិច វី"
        },
        {
            "barcode": "171137727",
            "dpc": "03020715101",
            "name": "សេង លាវ"
        },
        {
            "barcode": "171137728",
            "dpc": "03020715001",
            "name": "រស់ ភី"
        },
        {
            "barcode": "171137729",
            "dpc": "03020742101",
            "name": "គា  ខេមរី"
        },
        {
            "barcode": "171137730",
            "dpc": "03020742001",
            "name": "ចេង  យូអ៊ីម"
        },
        {
            "barcode": "171137731",
            "dpc": "03020741901",
            "name": "ហេង តាំងស្រេង"
        },
        {
            "barcode": "171137732",
            "dpc": "03020741801",
            "name": "ឈន   សុបុណ្យ"
        },
        {
            "barcode": "171137733",
            "dpc": "03020741701",
            "name": "ខាត់  ថន"
        },
        {
            "barcode": "171137734",
            "dpc": "03020737101",
            "name": "គឹម  ខេត្ត"
        },
        {
            "barcode": "171137735",
            "dpc": "03020737001",
            "name": "សាយ  ទូច"
        },
        {
            "barcode": "171137736",
            "dpc": "03020736901",
            "name": "មុំ   សុភាព"
        },
        {
            "barcode": "171137737",
            "dpc": "03020736801",
            "name": "គង់  ច័ន្ទគ្រឹស្នា"
        },
        {
            "barcode": "171137738",
            "dpc": "03020736701",
            "name": "ហែម  ធីតា"
        },
        {
            "barcode": "171137739",
            "dpc": "03020736601",
            "name": "ប៉ែន  លីម"
        },
        {
            "barcode": "171137740",
            "dpc": "03020736501",
            "name": "វង់  ថាវន"
        },
        {
            "barcode": "171137741",
            "dpc": "03020736401",
            "name": "ផន   ឆវី"
        },
        {
            "barcode": "171137742",
            "dpc": "03020736301",
            "name": "ខាវ  ភ័ណ្ឌ"
        },
        {
            "barcode": "171137743",
            "dpc": "03020736201",
            "name": "នួន   ផល្លា"
        },
        {
            "barcode": "171137744",
            "dpc": "03020736101",
            "name": "ឈិន  សាន"
        },
        {
            "barcode": "171137745",
            "dpc": "03020736001",
            "name": "ខឹម  ចេនឡា"
        },
        {
            "barcode": "171137746",
            "dpc": "03020735901",
            "name": "កៅ   ស៊ីផាន"
        },
        {
            "barcode": "171137747",
            "dpc": "03020735801",
            "name": "ឆឺយ  សុផល"
        },
        {
            "barcode": "171137748",
            "dpc": "03020735701",
            "name": "ជ័យ  ស៊ីណេត"
        },
        {
            "barcode": "171137749",
            "dpc": "03020735601",
            "name": "ទូ  តូនី"
        },
        {
            "barcode": "171137750",
            "dpc": "03020735501",
            "name": "ហៀង   សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171137751",
            "dpc": "03020735401",
            "name": "អ៊ឹម  ស្រីមាន"
        },
        {
            "barcode": "171137752",
            "dpc": "03020735301",
            "name": "សួន   វ៉ុន"
        },
        {
            "barcode": "171137753",
            "dpc": "03020735201",
            "name": "យ៉ាន់  សារឿន"
        },
        {
            "barcode": "171137754",
            "dpc": "03020735101",
            "name": "ថៃ  ប៉ៃលីន"
        },
        {
            "barcode": "171137755",
            "dpc": "03020735001",
            "name": "កាញ ឡេង"
        },
        {
            "barcode": "171137756",
            "dpc": "03020734901",
            "name": "ម៉ុញ សុគន្ធា"
        },
        {
            "barcode": "171137757",
            "dpc": "03020734701",
            "name": "អ៊ឹម ប៉េងលី"
        },
        {
            "barcode": "171137758",
            "dpc": "03020734601",
            "name": "ទូច ឥត"
        },
        {
            "barcode": "171137759",
            "dpc": "03020734501",
            "name": "ភួង ណាត"
        },
        {
            "barcode": "171137760",
            "dpc": "03020734401",
            "name": "អុំ  សាវឿន"
        },
        {
            "barcode": "171137761",
            "dpc": "03020734301",
            "name": "រិទ្ធ សម្បត្តិ"
        },
        {
            "barcode": "171137762",
            "dpc": "03020734201",
            "name": "អ៊ូ  សារ៉េត"
        },
        {
            "barcode": "171137763",
            "dpc": "03020734101",
            "name": "ផល សុធា (៣)"
        },
        {
            "barcode": "171137764",
            "dpc": "03020734001",
            "name": "ហៀង ភារិទ្ធ"
        },
        {
            "barcode": "171137765",
            "dpc": "03020733901",
            "name": "ផូ នីម"
        },
        {
            "barcode": "171137766",
            "dpc": "03020733801",
            "name": "ហ៊ីង ស៊ីផេង"
        },
        {
            "barcode": "171137767",
            "dpc": "03020733701",
            "name": "ផល សុធា"
        },
        {
            "barcode": "171137768",
            "dpc": "03020733601",
            "name": "អេង ពេជ្ជរា"
        },
        {
            "barcode": "171137769",
            "dpc": "03020733501",
            "name": "ឃ្លោក  ផល្លា"
        },
        {
            "barcode": "171137770",
            "dpc": "03020733401",
            "name": "ហួយ ឡុង"
        },
        {
            "barcode": "171137771",
            "dpc": "03020733301",
            "name": "ត្រៃ  ដុល"
        },
        {
            "barcode": "171137772",
            "dpc": "03020733201",
            "name": "អ៊ិង គីមឡាយ"
        },
        {
            "barcode": "171137773",
            "dpc": "03020733101",
            "name": "វណ្ណ ស្រីដា"
        },
        {
            "barcode": "171137774",
            "dpc": "03020733001",
            "name": "រុន ពៅ"
        },
        {
            "barcode": "171137775",
            "dpc": "03020732801",
            "name": "សំ រ៉ងទ្រី"
        },
        {
            "barcode": "171137776",
            "dpc": "03020732301",
            "name": "ជួប អៀង"
        },
        {
            "barcode": "171137777",
            "dpc": "03020732201",
            "name": "វ៉ាន់ ប៉េងហ៊ីម"
        },
        {
            "barcode": "171137778",
            "dpc": "03020732101",
            "name": "ជាម ហេង"
        },
        {
            "barcode": "171137779",
            "dpc": "03020731901",
            "name": "ចែម ពូន"
        },
        {
            "barcode": "171137780",
            "dpc": "03020731701",
            "name": "រស់ សុភា"
        },
        {
            "barcode": "171137781",
            "dpc": "03020731601",
            "name": "សាត  ហ៊ន"
        },
        {
            "barcode": "171137782",
            "dpc": "03020731501",
            "name": "ផល  សុធា"
        },
        {
            "barcode": "171137783",
            "dpc": "03020731401",
            "name": "ហម  សារិទ្ធ"
        },
        {
            "barcode": "171137784",
            "dpc": "03020731301",
            "name": "ចែម  ផាន"
        },
        {
            "barcode": "171137785",
            "dpc": "03020731201",
            "name": "ស៊ិន ផល្លី"
        },
        {
            "barcode": "171137786",
            "dpc": "03020731101",
            "name": "រ័ត្ន ម៉េង"
        },
        {
            "barcode": "171137787",
            "dpc": "03020731001",
            "name": "អ៊ូ  អែល"
        },
        {
            "barcode": "171137788",
            "dpc": "03020730901",
            "name": "លី    គី"
        },
        {
            "barcode": "171137789",
            "dpc": "03020730801",
            "name": "ឈួន  ឆែម"
        },
        {
            "barcode": "171137790",
            "dpc": "03020730701",
            "name": "ភុក  គង់"
        },
        {
            "barcode": "171137791",
            "dpc": "03020730601",
            "name": "ហ៊ីង   រឿន"
        },
        {
            "barcode": "171137792",
            "dpc": "03020730401",
            "name": "ម៉ក់  ដានី"
        },
        {
            "barcode": "171137793",
            "dpc": "03020729001",
            "name": "វ័រ សុកជា"
        },
        {
            "barcode": "171137794",
            "dpc": "03020728501",
            "name": "ម៉ៃ ម៉ៃ"
        },
        {
            "barcode": "171137795",
            "dpc": "03020747901",
            "name": "យស់ ហ៊ាង"
        },
        {
            "barcode": "171137796",
            "dpc": "03020747801",
            "name": "តាំង  ឡេងហ៊ាង"
        },
        {
            "barcode": "171137797",
            "dpc": "03020747601",
            "name": "តន់ យឿត"
        },
        {
            "barcode": "171137798",
            "dpc": "03020742701",
            "name": "ជួន ស៊ីណា"
        },
        {
            "barcode": "171137799",
            "dpc": "03020742301",
            "name": "យី ស៊ូ"
        },
        {
            "barcode": "171137800",
            "dpc": "03020742201",
            "name": "ព្រំ ឈូវង្ស"
        },
        {
            "barcode": "171137801",
            "dpc": "03020741601",
            "name": "ម៉ៃ ចាន់ណារី"
        },
        {
            "barcode": "171137802",
            "dpc": "03020741501",
            "name": "ម៉ែន សៀក"
        },
        {
            "barcode": "171137803",
            "dpc": "03020741401",
            "name": "ស៊ា លាង"
        },
        {
            "barcode": "171137804",
            "dpc": "03020741301",
            "name": "អ៊ូច ចាន់ថុន"
        },
        {
            "barcode": "171137805",
            "dpc": "03020741201",
            "name": "លឹម ឆេង"
        },
        {
            "barcode": "171137806",
            "dpc": "03020741101",
            "name": "ចាន់ កង"
        },
        {
            "barcode": "171137807",
            "dpc": "03020741001",
            "name": "ពៅ ហ៊ន"
        },
        {
            "barcode": "171137808",
            "dpc": "03020740901",
            "name": "សុខ ពីង"
        },
        {
            "barcode": "171137809",
            "dpc": "03020740801",
            "name": "ហ៊ុន រឿន"
        },
        {
            "barcode": "171137810",
            "dpc": "03020740701",
            "name": "សម សារ៉ែម"
        },
        {
            "barcode": "171137811",
            "dpc": "03020740601",
            "name": "សុខ ឡា"
        },
        {
            "barcode": "171137812",
            "dpc": "03020740501",
            "name": "ឈឹន  ឈឿន"
        },
        {
            "barcode": "171137813",
            "dpc": "03020740401",
            "name": "ម៉ូល  ង៉េន"
        },
        {
            "barcode": "171137814",
            "dpc": "03020739901",
            "name": "ហង់ លី"
        },
        {
            "barcode": "171137815",
            "dpc": "03020739701",
            "name": "សឿម សឿង ១"
        },
        {
            "barcode": "171137816",
            "dpc": "03020739601",
            "name": "ទុយ សុផល"
        },
        {
            "barcode": "171137817",
            "dpc": "03020739501",
            "name": "សោម ឈន"
        },
        {
            "barcode": "171137818",
            "dpc": "03020739401",
            "name": "ហូ ហេង"
        },
        {
            "barcode": "171137819",
            "dpc": "03020739301",
            "name": "សុខ ធី"
        },
        {
            "barcode": "171137820",
            "dpc": "03020739201",
            "name": "សោម សារឹម"
        },
        {
            "barcode": "171137821",
            "dpc": "03020739101",
            "name": "ប៉ិច កក្កដា"
        },
        {
            "barcode": "171137822",
            "dpc": "03020739001",
            "name": "វ៉ាង វន"
        },
        {
            "barcode": "171137823",
            "dpc": "03020738901",
            "name": "ប៉ិច ចំណាន"
        },
        {
            "barcode": "171137824",
            "dpc": "03020738801",
            "name": "អ៊ី សុខុម"
        },
        {
            "barcode": "171137825",
            "dpc": "03020738701",
            "name": "ង៉ែត ងួន"
        },
        {
            "barcode": "171137826",
            "dpc": "03020738601",
            "name": "ធួន  ថាវី"
        },
        {
            "barcode": "171137827",
            "dpc": "03020738501",
            "name": "បួន ឡៃហ៊ាង"
        },
        {
            "barcode": "171137828",
            "dpc": "03020738301",
            "name": "នៅ​ ចំរើន"
        },
        {
            "barcode": "171137829",
            "dpc": "03020738201",
            "name": "អៀង ពៅ"
        },
        {
            "barcode": "171137830",
            "dpc": "03020738101",
            "name": "សួន សុភាព"
        },
        {
            "barcode": "171137831",
            "dpc": "03020747501",
            "name": "ចៅ ហូវ"
        },
        {
            "barcode": "171137832",
            "dpc": "03020747401",
            "name": "នង ស៊ីថា ២"
        },
        {
            "barcode": "171137833",
            "dpc": "03020747301",
            "name": "កាន់ រ៉ា"
        },
        {
            "barcode": "171137834",
            "dpc": "03020747201",
            "name": "ថ្លាង លឹមម៉ុង"
        },
        {
            "barcode": "171137835",
            "dpc": "03020747101",
            "name": "យន សាខុន"
        },
        {
            "barcode": "171137836",
            "dpc": "03020747001",
            "name": "សរ ហេង"
        },
        {
            "barcode": "171137837",
            "dpc": "03020746901",
            "name": "កែវ ជ្រឹង"
        },
        {
            "barcode": "171137838",
            "dpc": "03020746801",
            "name": "យ៉ាត កំសាន្ត"
        },
        {
            "barcode": "171137839",
            "dpc": "03020746701",
            "name": "ហាច ម៉ៅ"
        },
        {
            "barcode": "171137840",
            "dpc": "03020746601",
            "name": "គឹម ហៀន"
        },
        {
            "barcode": "171137841",
            "dpc": "03020746501",
            "name": "តូច សំ"
        },
        {
            "barcode": "171137842",
            "dpc": "03020746401",
            "name": "ស ឡេង"
        },
        {
            "barcode": "171137843",
            "dpc": "03020746301",
            "name": "ទូច ថុង"
        },
        {
            "barcode": "171137844",
            "dpc": "03020746201",
            "name": "ម៉ុន វ៉ាត"
        },
        {
            "barcode": "171137845",
            "dpc": "03020746001",
            "name": "នង ស៊ីថា ១"
        },
        {
            "barcode": "171137846",
            "dpc": "03020745601",
            "name": "នូវ ផល្លា"
        },
        {
            "barcode": "171137847",
            "dpc": "03020745201",
            "name": "នូ ហៃ"
        },
        {
            "barcode": "171137848",
            "dpc": "03020745101",
            "name": "សយ ឡាក់"
        },
        {
            "barcode": "171137849",
            "dpc": "03020745001",
            "name": "ប៉េង ហួត"
        },
        {
            "barcode": "171137850",
            "dpc": "03020744901",
            "name": "ហម ហ៊ន"
        },
        {
            "barcode": "171137851",
            "dpc": "03020744801",
            "name": "អៀង លីវិន"
        },
        {
            "barcode": "171137852",
            "dpc": "03020744701",
            "name": "អ៊ី អេន"
        },
        {
            "barcode": "171137853",
            "dpc": "03020744601",
            "name": "ព្រំ  ចន្ថា"
        },
        {
            "barcode": "171137854",
            "dpc": "03020744501",
            "name": "ម៉ែន ម៉ន"
        },
        {
            "barcode": "171137855",
            "dpc": "03020744401",
            "name": "បាន ចាន់ណា"
        },
        {
            "barcode": "171137856",
            "dpc": "03020744201",
            "name": "ផន ខែម"
        },
        {
            "barcode": "171137857",
            "dpc": "03020744101",
            "name": "លឹម សួន"
        },
        {
            "barcode": "171137858",
            "dpc": "03020744001",
            "name": "គល់  ភក្តី"
        },
        {
            "barcode": "171137859",
            "dpc": "03020743901",
            "name": "ឡាច សម្បត្តិ"
        },
        {
            "barcode": "171137860",
            "dpc": "03020743801",
            "name": "ផន  សុផល"
        },
        {
            "barcode": "171137861",
            "dpc": "03020743701",
            "name": "លី  ង៉ូវ"
        },
        {
            "barcode": "171137862",
            "dpc": "03020743601",
            "name": "ដួង  ប្រុស"
        },
        {
            "barcode": "171137863",
            "dpc": "03020743501",
            "name": "គុំ វន្នី ២"
        },
        {
            "barcode": "171137864",
            "dpc": "03020743401",
            "name": "សោម  ម៉ៅ"
        },
        {
            "barcode": "171137865",
            "dpc": "03020743101",
            "name": "ឆាយ រ៉ុង"
        },
        {
            "barcode": "171137866",
            "dpc": "03020743001",
            "name": "ដៀប  ហ៊ួរ"
        },
        {
            "barcode": "171137867",
            "dpc": "03020742801",
            "name": "ទី ដេង"
        },
        {
            "barcode": "171137868",
            "dpc": "03020742601",
            "name": "ផូ ផល"
        },
        {
            "barcode": "171137869",
            "dpc": "03020742501",
            "name": "ផៃ ប៉េងស៊្រា"
        },
        {
            "barcode": "171137870",
            "dpc": "03020742401",
            "name": "ជា ទូច"
        },
        {
            "barcode": "171137871",
            "dpc": "03020740301",
            "name": "ស៊ឹង  ប៉ូយ"
        },
        {
            "barcode": "171137872",
            "dpc": "03020740201",
            "name": "លឹម ឈាង"
        },
        {
            "barcode": "171137873",
            "dpc": "03020740101",
            "name": "សួស សុង"
        },
        {
            "barcode": "171137874",
            "dpc": "03020740001",
            "name": "ចាម ធា"
        },
        {
            "barcode": "171137875",
            "dpc": "03020746101",
            "name": "អ៊ុយ ម៉េងហួន"
        },
        {
            "barcode": "171137876",
            "dpc": "03020745901",
            "name": "ភិន ភីរ៉ុង"
        },
        {
            "barcode": "171137877",
            "dpc": "03020745801",
            "name": "ភិន  ភីរុណ"
        },
        {
            "barcode": "171137878",
            "dpc": "03020745701",
            "name": "គឹម យី"
        },
        {
            "barcode": "171137879",
            "dpc": "03020745501",
            "name": "សាយ សារឿន"
        },
        {
            "barcode": "171137880",
            "dpc": "03020745401",
            "name": "អ៊ូ ភុំ"
        },
        {
            "barcode": "171137881",
            "dpc": "03020745301",
            "name": "វ៉ាន ផាន"
        },
        {
            "barcode": "171137882",
            "dpc": "03020744301",
            "name": "ជៀម ផុន"
        },
        {
            "barcode": "171137883",
            "dpc": "03020714001",
            "name": "ឈួន  ធឿន"
        },
        {
            "barcode": "171137884",
            "dpc": "03020714101",
            "name": "ខាត់  សំអាត"
        },
        {
            "barcode": "171137885",
            "dpc": "03020721901",
            "name": "ស៊ុន  ណារី"
        },
        {
            "barcode": "171137886",
            "dpc": "03020722001",
            "name": "ចក់  រដ្ឋា"
        },
        {
            "barcode": "171137887",
            "dpc": "03020723801",
            "name": "ឃ្លោត    លឿត"
        },
        {
            "barcode": "171137888",
            "dpc": "03020727701",
            "name": "ម៉ៅ  សារុំ"
        },
        {
            "barcode": "171137889",
            "dpc": "03020728801",
            "name": "គឹម  ហួរ"
        },
        {
            "barcode": "171137890",
            "dpc": "03020730501",
            "name": "ប្រាក់ ឈួន"
        },
        {
            "barcode": "171137891",
            "dpc": "03020734801",
            "name": "ម៉ុញ៉  សុខា"
        },
        {
            "barcode": "171137892",
            "dpc": "03020737201",
            "name": "សែ  សារ៉ាន់"
        },
        {
            "barcode": "171137893",
            "dpc": "03020738401",
            "name": "លឹម  ឡៃហ៊ាង"
        },
        {
            "barcode": "171137894",
            "dpc": "03020743301",
            "name": "ទូច  ឃៀង"
        },
        {
            "barcode": "171137895",
            "dpc": "03020700101",
            "name": "លួង  ប៊ុនធឿន"
        },
        {
            "barcode": "171137896",
            "dpc": "03020700201",
            "name": "លៀក  ស៊្រុន"
        },
        {
            "barcode": "171137897",
            "dpc": "03020700301",
            "name": "ទូច  ម៉ៅ"
        },
        {
            "barcode": "171137898",
            "dpc": "03020700401",
            "name": "វី  ផា"
        },
        {
            "barcode": "171137899",
            "dpc": "03020700501",
            "name": "ប៊ុន  វណ្ណះ"
        },
        {
            "barcode": "171137900",
            "dpc": "03020700601",
            "name": "ឆាយ  លៀប"
        },
        {
            "barcode": "171137901",
            "dpc": "03020700701",
            "name": "តាំង  ឆេងលី"
        },
        {
            "barcode": "171137902",
            "dpc": "03020700801",
            "name": "ស្បោង  ប៊ុនធឿន"
        },
        {
            "barcode": "171137903",
            "dpc": "03020701001",
            "name": "ប៊ុន  ស្រេង"
        },
        {
            "barcode": "171137904",
            "dpc": "03020701101",
            "name": "ទេស  ស៊ីណា"
        },
        {
            "barcode": "171137905",
            "dpc": "03020701201",
            "name": "វ័ន  ពន"
        },
        {
            "barcode": "171137906",
            "dpc": "03020701301",
            "name": "អឿន  ប៉ាក់"
        },
        {
            "barcode": "171137907",
            "dpc": "03020701401",
            "name": "ងិន  ឆេងអ៊ី"
        },
        {
            "barcode": "171137908",
            "dpc": "03020701501",
            "name": "បង់  ប៉ុក"
        },
        {
            "barcode": "171137909",
            "dpc": "03020701701",
            "name": "កូវ  ទៀង"
        },
        {
            "barcode": "171137910",
            "dpc": "03020701801",
            "name": "គិត  ជី"
        },
        {
            "barcode": "171137911",
            "dpc": "03020701901",
            "name": "ម៉ី  លី"
        },
        {
            "barcode": "171137912",
            "dpc": "03020702001",
            "name": "រ័ត្ន  ង៉ែត"
        },
        {
            "barcode": "171137913",
            "dpc": "03020702201",
            "name": "ព្រំ  សឿន"
        },
        {
            "barcode": "171137914",
            "dpc": "03020702301",
            "name": "សេក  ឈឺន"
        },
        {
            "barcode": "171137915",
            "dpc": "03020702401",
            "name": "ឃុន  ធៀន"
        },
        {
            "barcode": "171137916",
            "dpc": "03020702501",
            "name": "កុយ  វណ្ណា"
        },
        {
            "barcode": "171137917",
            "dpc": "03020702601",
            "name": "អុំ   ស៊ីម"
        },
        {
            "barcode": "171137918",
            "dpc": "03020702701",
            "name": "អ៊ូ  លីម"
        },
        {
            "barcode": "171137919",
            "dpc": "03020702801",
            "name": "លី  វ៉ា"
        },
        {
            "barcode": "171137920",
            "dpc": "03020724501",
            "name": "ប៊ុន   លី"
        },
        {
            "barcode": "171137921",
            "dpc": "03020730301",
            "name": "ពិន ដាមរ៉ា"
        },
        {
            "barcode": "171137922",
            "dpc": "03020748001",
            "name": "គង់ ភីរម្យ"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
