let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171140572",
            "dpc": "03020842501",
            "name": "រ៉ើន ស៊ិនណារ៉ុង"
        },
        {
            "barcode": "171140573",
            "dpc": "03020842601",
            "name": "លី ឈៀងហោ"
        },
        {
            "barcode": "171140574",
            "dpc": "03020842701",
            "name": "ប៉ោ លី"
        },
        {
            "barcode": "171140575",
            "dpc": "03020842801",
            "name": "ឃុន ជឿន"
        },
        {
            "barcode": "171140576",
            "dpc": "03020842901",
            "name": "ខ្លួត ពិសិទ្ធ"
        },
        {
            "barcode": "171140577",
            "dpc": "03020843201",
            "name": "អ៊ុំ ប៊ុនធី"
        },
        {
            "barcode": "171140578",
            "dpc": "03020843301",
            "name": "ទួក ឌិន"
        },
        {
            "barcode": "171140579",
            "dpc": "03020800401",
            "name": "ស៊ុន សេន"
        },
        {
            "barcode": "171140580",
            "dpc": "03020843101",
            "name": "ម៉ា ចិន្តា"
        },
        {
            "barcode": "171140581",
            "dpc": "03020800201",
            "name": "ញឹម សារិន"
        },
        {
            "barcode": "171140582",
            "dpc": "03020800301",
            "name": "ម៉ិល សុខា"
        },
        {
            "barcode": "171140583",
            "dpc": "03020800501",
            "name": "បែន សំណាង"
        },
        {
            "barcode": "171140584",
            "dpc": "03020800601",
            "name": "អ៊ុក ថែ"
        },
        {
            "barcode": "171140585",
            "dpc": "03020800701",
            "name": "មឿន ភឿន"
        },
        {
            "barcode": "171140586",
            "dpc": "03020800801",
            "name": "ម៉ា សុខា"
        },
        {
            "barcode": "171140587",
            "dpc": "03020843401",
            "name": "កែវ វុទ្ធី"
        },
        {
            "barcode": "171140588",
            "dpc": "03020843501",
            "name": "ងី ផេង"
        },
        {
            "barcode": "171140589",
            "dpc": "03020843601",
            "name": "សុខ ថា"
        },
        {
            "barcode": "171140590",
            "dpc": "03020843801",
            "name": "គុយ ងី"
        },
        {
            "barcode": "171140591",
            "dpc": "03020843901",
            "name": "តាំង សុង"
        },
        {
            "barcode": "171140592",
            "dpc": "03020844101",
            "name": "ប៊ុន ឡុង"
        },
        {
            "barcode": "171140593",
            "dpc": "03020844201",
            "name": "ឌិន ប្រង់"
        },
        {
            "barcode": "171140594",
            "dpc": "03020844301",
            "name": "រស់ ផល"
        },
        {
            "barcode": "171140595",
            "dpc": "03020844401",
            "name": "សួន ស៊ុនហាក់"
        },
        {
            "barcode": "171140596",
            "dpc": "03020844501",
            "name": "សេង ឆាង"
        },
        {
            "barcode": "171140597",
            "dpc": "03020844601",
            "name": "ហេង គីមហុង"
        },
        {
            "barcode": "171140598",
            "dpc": "03020844701",
            "name": "មណ្ឌលសុខភាព"
        },
        {
            "barcode": "171140599",
            "dpc": "03020844801",
            "name": "ជ័រ ឃីម"
        },
        {
            "barcode": "171140600",
            "dpc": "03020844901",
            "name": "រស់ ចំរើន"
        },
        {
            "barcode": "171140601",
            "dpc": "03020845001",
            "name": "សុខ ឡាវ"
        },
        {
            "barcode": "171140602",
            "dpc": "03020801101",
            "name": "ទឹម ភាន"
        },
        {
            "barcode": "171140603",
            "dpc": "03020801201",
            "name": "ទឹម ហាប់"
        },
        {
            "barcode": "171140604",
            "dpc": "03020801301",
            "name": "ទឹម សុធិន"
        },
        {
            "barcode": "171140605",
            "dpc": "03020801001",
            "name": "ញឹក សុគន្ធ"
        },
        {
            "barcode": "171140606",
            "dpc": "03020800901",
            "name": "ប៊ុន សុង"
        },
        {
            "barcode": "171140607",
            "dpc": "03020801401",
            "name": "ឥន ញ៉ែត"
        },
        {
            "barcode": "171140608",
            "dpc": "03020801701",
            "name": "យឹម សុវណ្ណី"
        },
        {
            "barcode": "171140609",
            "dpc": "03020801501",
            "name": "ចាន់ ធី"
        },
        {
            "barcode": "171140610",
            "dpc": "03020801601",
            "name": "ឈៀង ថុង"
        },
        {
            "barcode": "171140611",
            "dpc": "03020801801",
            "name": "លឹម គីមអ៊ី"
        },
        {
            "barcode": "171140612",
            "dpc": "03020801901",
            "name": "ឡុត យាន"
        },
        {
            "barcode": "171140613",
            "dpc": "03020802001",
            "name": "នូវ រុន"
        },
        {
            "barcode": "171140614",
            "dpc": "03020802101",
            "name": "ឌុក វ៉ាន់ថា"
        },
        {
            "barcode": "171140615",
            "dpc": "03020802401",
            "name": "ពុធ ហេង"
        },
        {
            "barcode": "171140616",
            "dpc": "03020841301",
            "name": "ដុស សារ៉ាត់"
        },
        {
            "barcode": "171140617",
            "dpc": "03020841101",
            "name": "គុយ ម៉េង"
        },
        {
            "barcode": "171140618",
            "dpc": "03020841401",
            "name": "ឌុល សុភី"
        },
        {
            "barcode": "171140619",
            "dpc": "03020841201",
            "name": "យឿន ប៊ុនណារ៉ា"
        },
        {
            "barcode": "171140620",
            "dpc": "03020841501",
            "name": "ហេង វាសនា"
        },
        {
            "barcode": "171140621",
            "dpc": "03020841701",
            "name": "វ៉ាន់ សាវើយ"
        },
        {
            "barcode": "171140622",
            "dpc": "03020841801",
            "name": "ហាក់ ហ៊ុយ"
        },
        {
            "barcode": "171140623",
            "dpc": "03020841901",
            "name": "ដុស វណ្ណា"
        },
        {
            "barcode": "171140624",
            "dpc": "03020842001",
            "name": "វ៉ាយ សារ ១"
        },
        {
            "barcode": "171140625",
            "dpc": "03020842101",
            "name": "វ៉ាយ សារ ២"
        },
        {
            "barcode": "171140626",
            "dpc": "03020842201",
            "name": "ពេជ្រ ចំរើន"
        },
        {
            "barcode": "171140627",
            "dpc": "03020842301",
            "name": "ព្រំ សុខុម"
        },
        {
            "barcode": "171140628",
            "dpc": "03020842401",
            "name": "ប៊ុន សាវុធ"
        },
        {
            "barcode": "171140629",
            "dpc": "03020802301",
            "name": "ប៊ុន ប៉ាក់"
        },
        {
            "barcode": "171140630",
            "dpc": "03020802201",
            "name": "សេង លៀប"
        },
        {
            "barcode": "171140631",
            "dpc": "03020802501",
            "name": "នាក់ចាន់ ថន"
        },
        {
            "barcode": "171140632",
            "dpc": "03020802601",
            "name": "ឈឿន ហន"
        },
        {
            "barcode": "171140633",
            "dpc": "03020802701",
            "name": "រ៉ឹម សុគន្ធ"
        },
        {
            "barcode": "171140634",
            "dpc": "03020802801",
            "name": "រឹម សារឿត"
        },
        {
            "barcode": "171140635",
            "dpc": "03020803001",
            "name": "ពៅ បូរិន"
        },
        {
            "barcode": "171140636",
            "dpc": "03020803101",
            "name": "រស់ ចំរើន"
        },
        {
            "barcode": "171140637",
            "dpc": "03020803201",
            "name": "ម៉ក់ ហន"
        },
        {
            "barcode": "171140638",
            "dpc": "03020803301",
            "name": "ឃ្លោក សំបូរ"
        },
        {
            "barcode": "171140639",
            "dpc": "03020803401",
            "name": "យ៉ាង សៀវសេង"
        },
        {
            "barcode": "171140640",
            "dpc": "03020803501",
            "name": "ស៊ុន សុភី"
        },
        {
            "barcode": "171140641",
            "dpc": "03020803601",
            "name": "ឈឹម វុត្ថា"
        },
        {
            "barcode": "171140642",
            "dpc": "03020803701",
            "name": "លាភ​ ឈន់"
        },
        {
            "barcode": "171140643",
            "dpc": "03020803801",
            "name": "ម៉ៅ ប៊ុនធឿន"
        },
        {
            "barcode": "171140644",
            "dpc": "03020840601",
            "name": "សែម សោភា"
        },
        {
            "barcode": "171140645",
            "dpc": "03020818901",
            "name": "នូ កង"
        },
        {
            "barcode": "171140646",
            "dpc": "03020817401",
            "name": "វិន សាំ"
        },
        {
            "barcode": "171140647",
            "dpc": "03020818101",
            "name": "ហម សីណា"
        },
        {
            "barcode": "171140648",
            "dpc": "03020818201",
            "name": "ឆុន សុភាព"
        },
        {
            "barcode": "171140649",
            "dpc": "03020836001",
            "name": "ឆូយ លាងគីម"
        },
        {
            "barcode": "171140650",
            "dpc": "03020836101",
            "name": "ហេង ហុង"
        },
        {
            "barcode": "171140651",
            "dpc": "03020836301",
            "name": "លីវ គៀត"
        },
        {
            "barcode": "171140652",
            "dpc": "03020836201",
            "name": "ជាង ពៅ"
        },
        {
            "barcode": "171140653",
            "dpc": "03020836401",
            "name": "សុក ទុយ"
        },
        {
            "barcode": "171140654",
            "dpc": "03020836501",
            "name": "សៀង តិច"
        },
        {
            "barcode": "171140655",
            "dpc": "03020836601",
            "name": "តាំង សារ"
        },
        {
            "barcode": "171140656",
            "dpc": "03020836901",
            "name": "ជូរ ហេង"
        },
        {
            "barcode": "171140657",
            "dpc": "03020837001",
            "name": "លី ស៊ីវចេង"
        },
        {
            "barcode": "171140658",
            "dpc": "03020837101",
            "name": "តាំង យី"
        },
        {
            "barcode": "171140659",
            "dpc": "03020837201",
            "name": "អៀម ពៅ"
        },
        {
            "barcode": "171140660",
            "dpc": "03020837501",
            "name": "ពេជ្រ ដារ៉ុង"
        },
        {
            "barcode": "171140661",
            "dpc": "03020837601",
            "name": "ជា ប៉ុង"
        },
        {
            "barcode": "171140662",
            "dpc": "03020837701",
            "name": "ញ៉ែម ពិសិទ្ធ"
        },
        {
            "barcode": "171140663",
            "dpc": "03020837801",
            "name": "ខ្លូត ណារ៉ុង"
        },
        {
            "barcode": "171140664",
            "dpc": "03020837901",
            "name": "សាន ថាន"
        },
        {
            "barcode": "171140665",
            "dpc": "03020838001",
            "name": "ម៉ែន សុធៃ"
        },
        {
            "barcode": "171140666",
            "dpc": "03020838101",
            "name": "កែវ ផៃសាន"
        },
        {
            "barcode": "171140667",
            "dpc": "03020838301",
            "name": "ញឹក សុវណ្ណ"
        },
        {
            "barcode": "171140668",
            "dpc": "03020838501",
            "name": "ពៅ ពិសិទ្ធ"
        },
        {
            "barcode": "171140669",
            "dpc": "03020838601",
            "name": "ឈុន ខេង"
        },
        {
            "barcode": "171140670",
            "dpc": "03020838801",
            "name": "ភឹម គឹមលន់"
        },
        {
            "barcode": "171140671",
            "dpc": "03020837301",
            "name": "ចៅ គីមយ៉េន"
        },
        {
            "barcode": "171140672",
            "dpc": "03020837401",
            "name": "ទៀង រតនា"
        },
        {
            "barcode": "171140673",
            "dpc": "03020838901",
            "name": "គុយ ហ៊ី ១"
        },
        {
            "barcode": "171140674",
            "dpc": "03020839001",
            "name": "គុយ ហ៊ី ២"
        },
        {
            "barcode": "171140675",
            "dpc": "03020839601",
            "name": "ចាន ខេមរៈ"
        },
        {
            "barcode": "171140676",
            "dpc": "03020839401",
            "name": "ឡាយ គុណ"
        },
        {
            "barcode": "171140677",
            "dpc": "03020839301",
            "name": "ឡាច ហៀក"
        },
        {
            "barcode": "171140678",
            "dpc": "03020839101",
            "name": "សម សុខា"
        },
        {
            "barcode": "171140679",
            "dpc": "03020839701",
            "name": "ប្រាក់ ធី"
        },
        {
            "barcode": "171140680",
            "dpc": "03020839901",
            "name": "ពិន ចាន់ថន"
        },
        {
            "barcode": "171140681",
            "dpc": "03020840001",
            "name": "លន់ ញឹក"
        },
        {
            "barcode": "171140682",
            "dpc": "03020840101",
            "name": "ហ៊ុន ណៃ"
        },
        {
            "barcode": "171140683",
            "dpc": "03020840201",
            "name": "តាំង សុថា"
        },
        {
            "barcode": "171140684",
            "dpc": "03020840301",
            "name": "សួន សំណាង"
        },
        {
            "barcode": "171140685",
            "dpc": "03020841001",
            "name": "គឹម ដេត"
        },
        {
            "barcode": "171140686",
            "dpc": "03020840901",
            "name": "ង៉ោ ច្រុង"
        },
        {
            "barcode": "171140687",
            "dpc": "03020840801",
            "name": "ម៉េង លាង"
        },
        {
            "barcode": "171140688",
            "dpc": "03020840701",
            "name": "ឡាំ ហ៊ុល"
        },
        {
            "barcode": "171140689",
            "dpc": "03020840401",
            "name": "ហេង ថេងហៀង"
        },
        {
            "barcode": "171140690",
            "dpc": "03020803901",
            "name": "យឹម ឆេង"
        },
        {
            "barcode": "171140691",
            "dpc": "03020804201",
            "name": "រ៉ែ យ៉ា"
        },
        {
            "barcode": "171140692",
            "dpc": "03020804301",
            "name": "ណម បាន់នូ"
        },
        {
            "barcode": "171140693",
            "dpc": "03020804401",
            "name": "ជិន ធៀម"
        },
        {
            "barcode": "171140694",
            "dpc": "03020804501",
            "name": "លន់ ឈន"
        },
        {
            "barcode": "171140695",
            "dpc": "03020804001",
            "name": "ហន ណន"
        },
        {
            "barcode": "171140696",
            "dpc": "03020804101",
            "name": "ភុក ចាន់ណា"
        },
        {
            "barcode": "171140697",
            "dpc": "03020804601",
            "name": "អ៊ឹង អ៊ាម"
        },
        {
            "barcode": "171140698",
            "dpc": "03020804701",
            "name": "អ៊ាម ទី"
        },
        {
            "barcode": "171140699",
            "dpc": "03020804801",
            "name": "អៀម ប៊ិន"
        },
        {
            "barcode": "171140700",
            "dpc": "03020804901",
            "name": "ប៊ុន ស្រេង"
        },
        {
            "barcode": "171140701",
            "dpc": "03020805001",
            "name": "ស៊ុន ផាន់ណា"
        },
        {
            "barcode": "171140702",
            "dpc": "03020805101",
            "name": "ទិត ឡា"
        },
        {
            "barcode": "171140703",
            "dpc": "03020805201",
            "name": "ជៀវ សានណាវី"
        },
        {
            "barcode": "171140704",
            "dpc": "03020805301",
            "name": "លឹម អៀវណាំ ១"
        },
        {
            "barcode": "171140705",
            "dpc": "03020805501",
            "name": "ចែ ទូច"
        },
        {
            "barcode": "171140706",
            "dpc": "03020806001",
            "name": "អ៊ឹម អ៊ីវ"
        },
        {
            "barcode": "171140707",
            "dpc": "03020805701",
            "name": "លុក ចន្ថា"
        },
        {
            "barcode": "171140708",
            "dpc": "03020805601",
            "name": "អ៊ឹម ហួរ"
        },
        {
            "barcode": "171140709",
            "dpc": "03020806101",
            "name": "ង៉ក់ ធីង"
        },
        {
            "barcode": "171140710",
            "dpc": "03020806201",
            "name": "អ៊ិម ហួត"
        },
        {
            "barcode": "171140711",
            "dpc": "03020806301",
            "name": "ណៃ ស៊ាន"
        },
        {
            "barcode": "171140712",
            "dpc": "03020806401",
            "name": "សេង ទុន"
        },
        {
            "barcode": "171140713",
            "dpc": "03020806501",
            "name": "សាញ់ សុង"
        },
        {
            "barcode": "171140714",
            "dpc": "03020806701",
            "name": "សាំង ហយ"
        },
        {
            "barcode": "171140715",
            "dpc": "03020806801",
            "name": "អ៊ឹម ថាវរី"
        },
        {
            "barcode": "171140716",
            "dpc": "03020806901",
            "name": "អៀត វុទ្ធី"
        },
        {
            "barcode": "171140717",
            "dpc": "03020807001",
            "name": "ហ៊ុន លក្ខិណា"
        },
        {
            "barcode": "171140718",
            "dpc": "03020807101",
            "name": "អោម សុថារី"
        },
        {
            "barcode": "171140719",
            "dpc": "03020807201",
            "name": "យឹម អៀនគីម"
        },
        {
            "barcode": "171140720",
            "dpc": "03020828101",
            "name": "សាយ ហុង"
        },
        {
            "barcode": "171140721",
            "dpc": "03020828001",
            "name": "ប៉ែន សាលី"
        },
        {
            "barcode": "171140722",
            "dpc": "03020829301",
            "name": "កូ គួយហួង"
        },
        {
            "barcode": "171140723",
            "dpc": "03020828201",
            "name": "សុខ សូត្រ"
        },
        {
            "barcode": "171140724",
            "dpc": "03020829201",
            "name": "ស៊ុន តឹក"
        },
        {
            "barcode": "171140725",
            "dpc": "03020829001",
            "name": "ក្លឹង នួន"
        },
        {
            "barcode": "171140726",
            "dpc": "03020828301",
            "name": "វ៉ៃ ប៊ិស"
        },
        {
            "barcode": "171140727",
            "dpc": "03020828401",
            "name": "សុខ ប៉ោយ"
        },
        {
            "barcode": "171140728",
            "dpc": "03020828501",
            "name": "វណ្ណ រតនា"
        },
        {
            "barcode": "171140729",
            "dpc": "03020828601",
            "name": "វឹង មុន្នី"
        },
        {
            "barcode": "171140730",
            "dpc": "03020828701",
            "name": "សុខ ចាន់រឿន"
        },
        {
            "barcode": "171140731",
            "dpc": "03020805801",
            "name": "សុខ ធារី"
        },
        {
            "barcode": "171140732",
            "dpc": "03020805901",
            "name": "លឹម អៀវណាំ ២"
        },
        {
            "barcode": "171140733",
            "dpc": "03020828801",
            "name": "ទិត្យ អ៊ឹង"
        },
        {
            "barcode": "171140734",
            "dpc": "03020836801",
            "name": "គឹម ឆាយ"
        },
        {
            "barcode": "171140735",
            "dpc": "03020836701",
            "name": "តាំង យី ៣"
        },
        {
            "barcode": "171140736",
            "dpc": "03020827701",
            "name": "ឡេង វួច"
        },
        {
            "barcode": "171140737",
            "dpc": "03020827901",
            "name": "ចាន់ សោភា"
        },
        {
            "barcode": "171140738",
            "dpc": "03020807401",
            "name": "ប៉ាវ សាំងហេង"
        },
        {
            "barcode": "171140739",
            "dpc": "03020807501",
            "name": "សុខ សាមិត្ត"
        },
        {
            "barcode": "171140740",
            "dpc": "03020809101",
            "name": "ផន សុផាត"
        },
        {
            "barcode": "171140741",
            "dpc": "03020807601",
            "name": "គី ទ្រី"
        },
        {
            "barcode": "171140742",
            "dpc": "03020807801",
            "name": "គុណ ស្រុន"
        },
        {
            "barcode": "171140743",
            "dpc": "03020808001",
            "name": "សិត អេងផល"
        },
        {
            "barcode": "171140744",
            "dpc": "03020808101",
            "name": "លួន សុខនី"
        },
        {
            "barcode": "171140745",
            "dpc": "03020808201",
            "name": "សុន ទ្រី"
        },
        {
            "barcode": "171140746",
            "dpc": "03020808301",
            "name": "ហង់ ខន"
        },
        {
            "barcode": "171140747",
            "dpc": "03020808401",
            "name": "ជា ពៅ"
        },
        {
            "barcode": "171140748",
            "dpc": "03020807901",
            "name": "សៀង គង់ហេង"
        },
        {
            "barcode": "171140749",
            "dpc": "03020808501",
            "name": "ស៊ិន ឈុត"
        },
        {
            "barcode": "171140750",
            "dpc": "03020808601",
            "name": "ខឹម សេង"
        },
        {
            "barcode": "171140751",
            "dpc": "03020808701",
            "name": "វ៉ែន សាយ"
        },
        {
            "barcode": "171140752",
            "dpc": "03020808801",
            "name": "សួន ចន្ថា"
        },
        {
            "barcode": "171140753",
            "dpc": "03020808901",
            "name": "ព្រុំ សារឿន"
        },
        {
            "barcode": "171140754",
            "dpc": "03020809001",
            "name": "អាង ទូច"
        },
        {
            "barcode": "171140755",
            "dpc": "03020809201",
            "name": "ឈឹម យ៉ុង"
        },
        {
            "barcode": "171140756",
            "dpc": "03020809301",
            "name": "កាញ់ សូយ"
        },
        {
            "barcode": "171140757",
            "dpc": "03020809401",
            "name": "គង់ វណ្ណា"
        },
        {
            "barcode": "171140758",
            "dpc": "03020825601",
            "name": "គឹម ឡាង"
        },
        {
            "barcode": "171140759",
            "dpc": "03020825701",
            "name": "គឹម សារ៉ាន់"
        },
        {
            "barcode": "171140760",
            "dpc": "03020825801",
            "name": "ហាក់ ស៊ុនហេង"
        },
        {
            "barcode": "171140761",
            "dpc": "03020825901",
            "name": "ឃុន ងួន១"
        },
        {
            "barcode": "171140762",
            "dpc": "03020831301",
            "name": "ឃួន ងួន"
        },
        {
            "barcode": "171140763",
            "dpc": "03020826001",
            "name": "ជៀប ណារ៉ុង"
        },
        {
            "barcode": "171140764",
            "dpc": "03020826101",
            "name": "កាំង ហុក ២"
        },
        {
            "barcode": "171140765",
            "dpc": "03020831401",
            "name": "កាំង ហុក"
        },
        {
            "barcode": "171140766",
            "dpc": "03020831501",
            "name": "ទូច ញ៉ុល"
        },
        {
            "barcode": "171140767",
            "dpc": "03020826201",
            "name": "កុយ អៀង"
        },
        {
            "barcode": "171140768",
            "dpc": "03020826301",
            "name": "ងិន ចេង"
        },
        {
            "barcode": "171140769",
            "dpc": "03020826401",
            "name": "សៅ ទី"
        },
        {
            "barcode": "171140770",
            "dpc": "03020826501",
            "name": "លឿង ស្រីនិត"
        },
        {
            "barcode": "171140771",
            "dpc": "03020826601",
            "name": "ជុំ ពិទ័ក្ក"
        },
        {
            "barcode": "171140772",
            "dpc": "03020826701",
            "name": "កាំ ហុក ១"
        },
        {
            "barcode": "171140773",
            "dpc": "03020826801",
            "name": "លឹម ផល"
        },
        {
            "barcode": "171140774",
            "dpc": "03020827001",
            "name": "ហ៊ុន យឿន"
        },
        {
            "barcode": "171140775",
            "dpc": "03020827301",
            "name": "ចាន់ សារឿន"
        },
        {
            "barcode": "171140776",
            "dpc": "03020827401",
            "name": "ឡោ ស្រេង"
        },
        {
            "barcode": "171140777",
            "dpc": "03020827501",
            "name": "ម៉ៅ ឃុន"
        },
        {
            "barcode": "171140778",
            "dpc": "03020829401",
            "name": "ម៉ឹន វិបុល"
        },
        {
            "barcode": "171140779",
            "dpc": "03020835901",
            "name": "ឡុង គីមហេង"
        },
        {
            "barcode": "171140780",
            "dpc": "03020835801",
            "name": "ជី ឆាយ"
        },
        {
            "barcode": "171140781",
            "dpc": "03020835701",
            "name": "ថន សឿម"
        },
        {
            "barcode": "171140782",
            "dpc": "03020835601",
            "name": "ហុង ហ៊ុលឡេង់"
        },
        {
            "barcode": "171140783",
            "dpc": "03020835501",
            "name": "ហួយ ខេង"
        },
        {
            "barcode": "171140784",
            "dpc": "03020835401",
            "name": "ង៉ូវ ថៃ"
        },
        {
            "barcode": "171140785",
            "dpc": "03020835301",
            "name": "សេង ប្រាង្គ"
        },
        {
            "barcode": "171140786",
            "dpc": "03020835201",
            "name": "សេង ផាត"
        },
        {
            "barcode": "171140787",
            "dpc": "03020835101",
            "name": "វិញ ហៃ"
        },
        {
            "barcode": "171140788",
            "dpc": "03020835001",
            "name": "សេដ្ឋ សាខា"
        },
        {
            "barcode": "171140789",
            "dpc": "03020834901",
            "name": "ស៊ីន ថា"
        },
        {
            "barcode": "171140790",
            "dpc": "03020834801",
            "name": "ឡៃ ឆេងវែង"
        },
        {
            "barcode": "171140791",
            "dpc": "03020834701",
            "name": "ផាន ទូច"
        },
        {
            "barcode": "171140792",
            "dpc": "03020834601",
            "name": "ង៉ូវ គីម"
        },
        {
            "barcode": "171140793",
            "dpc": "03020834501",
            "name": "ឈិត រ៉ែម"
        },
        {
            "barcode": "171140794",
            "dpc": "03020834401",
            "name": "យ៉ម ឆន"
        },
        {
            "barcode": "171140795",
            "dpc": "03020834201",
            "name": "អ៊ុក ផន"
        },
        {
            "barcode": "171140796",
            "dpc": "03020834301",
            "name": "ហាស់ ហ៊ន"
        },
        {
            "barcode": "171140797",
            "dpc": "03020834101",
            "name": "អ៊ុន សុខា"
        },
        {
            "barcode": "171140798",
            "dpc": "03020834001",
            "name": "ប៊ូ ប៉ិច"
        },
        {
            "barcode": "171140799",
            "dpc": "03020833901",
            "name": "ហេង ហាវ"
        },
        {
            "barcode": "171140800",
            "dpc": "03020833801",
            "name": "ហេង កង"
        },
        {
            "barcode": "171140801",
            "dpc": "03020833701",
            "name": "អ៊ុល ងឿប"
        },
        {
            "barcode": "171140802",
            "dpc": "03020833601",
            "name": "ជីប ណារ៉ុង"
        },
        {
            "barcode": "171140803",
            "dpc": "03020833501",
            "name": "កែវ នី"
        },
        {
            "barcode": "171140804",
            "dpc": "03020833401",
            "name": "ឈុត សោភ័ណ្ឌ"
        },
        {
            "barcode": "171140805",
            "dpc": "03020833301",
            "name": "សុខ ប៊ុនអៀង"
        },
        {
            "barcode": "171140806",
            "dpc": "03020833201",
            "name": "ហេង គង់"
        },
        {
            "barcode": "171140807",
            "dpc": "03020833101",
            "name": "អ៊ឹង សេង"
        },
        {
            "barcode": "171140808",
            "dpc": "03020833001",
            "name": "តេង ឈាង"
        },
        {
            "barcode": "171140809",
            "dpc": "03020832901",
            "name": "ដួង ដានី"
        },
        {
            "barcode": "171140810",
            "dpc": "03020832801",
            "name": "ខ្ចៅ សំកុល ១"
        },
        {
            "barcode": "171140811",
            "dpc": "03020832701",
            "name": "ហុង គា"
        },
        {
            "barcode": "171140812",
            "dpc": "03020832601",
            "name": "ប៊ុន ស្រេង"
        },
        {
            "barcode": "171140813",
            "dpc": "03020832501",
            "name": "តាំង ឈាងហួរ"
        },
        {
            "barcode": "171140814",
            "dpc": "03020832401",
            "name": "ម៉ុង ចាន់សារ៉េត"
        },
        {
            "barcode": "171140815",
            "dpc": "03020832201",
            "name": "ខាន់ ពៅ"
        },
        {
            "barcode": "171140816",
            "dpc": "03020832101",
            "name": "ខៀវ បូរ៉េត"
        },
        {
            "barcode": "171140817",
            "dpc": "03020832301",
            "name": "ខ្ចៅ សំកុល ២"
        },
        {
            "barcode": "171140818",
            "dpc": "03020832001",
            "name": "ដុស រីដេត"
        },
        {
            "barcode": "171140819",
            "dpc": "03020831901",
            "name": "ហែម អឿន"
        },
        {
            "barcode": "171140820",
            "dpc": "03020831801",
            "name": "សុខ ស៊ុយ"
        },
        {
            "barcode": "171140821",
            "dpc": "03020831601",
            "name": "សេង ហាន់"
        },
        {
            "barcode": "171140822",
            "dpc": "03020831201",
            "name": "លឹម គឹមឡាង"
        },
        {
            "barcode": "171140823",
            "dpc": "03020831101",
            "name": "អ៊ឹង ផិតទី"
        },
        {
            "barcode": "171140824",
            "dpc": "03020830901",
            "name": "ឈួន ឡេង"
        },
        {
            "barcode": "171140825",
            "dpc": "03020831001",
            "name": "លឿង ឆារ៉ា"
        },
        {
            "barcode": "171140826",
            "dpc": "03020830801",
            "name": "លី ឃួង"
        },
        {
            "barcode": "171140827",
            "dpc": "03020830701",
            "name": "សម ស៊ីណា"
        },
        {
            "barcode": "171140828",
            "dpc": "03020830601",
            "name": "យាន បូលី"
        },
        {
            "barcode": "171140829",
            "dpc": "03020830501",
            "name": "ស្រី នេ"
        },
        {
            "barcode": "171140830",
            "dpc": "03020830401",
            "name": "ប៉ែត សីហា"
        },
        {
            "barcode": "171140831",
            "dpc": "03020830301",
            "name": "ហ៊ិន គឹមហ៊តឌី"
        },
        {
            "barcode": "171140832",
            "dpc": "03020830201",
            "name": "សៀង ជៀកផេង"
        },
        {
            "barcode": "171140833",
            "dpc": "03020830101",
            "name": "ឆាយ ចាន់"
        },
        {
            "barcode": "171140834",
            "dpc": "03020829901",
            "name": "ញាណ សុផាត"
        },
        {
            "barcode": "171140835",
            "dpc": "03020829801",
            "name": "សុខ ធី"
        },
        {
            "barcode": "171140836",
            "dpc": "03020829701",
            "name": "ឈុន សុខ"
        },
        {
            "barcode": "171140837",
            "dpc": "03020829601",
            "name": "ជូ គង់"
        },
        {
            "barcode": "171140838",
            "dpc": "03020829501",
            "name": "អ៊ុក សុវណ្ណលី"
        },
        {
            "barcode": "171140839",
            "dpc": "03020813601",
            "name": "កែវ មនោ"
        },
        {
            "barcode": "171140840",
            "dpc": "03020846401",
            "name": "មួន ងិៈ"
        },
        {
            "barcode": "171140841",
            "dpc": "03020846501",
            "name": "ពេជ្រ ម៉ារី"
        },
        {
            "barcode": "171140842",
            "dpc": "03020846601",
            "name": "ឆាយ វ៉ាន់ឌី"
        },
        {
            "barcode": "171140843",
            "dpc": "03020846701",
            "name": "អោម ណាវី"
        },
        {
            "barcode": "171140844",
            "dpc": "03020846801",
            "name": "ញ៉េម ឈឿត"
        },
        {
            "barcode": "171140845",
            "dpc": "03020846901",
            "name": "សៀង ស៊ីណាត"
        },
        {
            "barcode": "171140846",
            "dpc": "03020847101",
            "name": "នែម វ៉ាន់"
        },
        {
            "barcode": "171140847",
            "dpc": "03020847201",
            "name": "ទឹម សារុំ"
        },
        {
            "barcode": "171140848",
            "dpc": "03020847301",
            "name": "ហម គឹមប៉ោ"
        },
        {
            "barcode": "171140849",
            "dpc": "03020847501",
            "name": "ទឹម វ៉ាន់រិទ្ធ"
        },
        {
            "barcode": "171140850",
            "dpc": "03020846201",
            "name": "សុខ លាង"
        },
        {
            "barcode": "171140851",
            "dpc": "03020846101",
            "name": "គុយ សត្យា"
        },
        {
            "barcode": "171140852",
            "dpc": "03020846001",
            "name": "សំ គង់"
        },
        {
            "barcode": "171140853",
            "dpc": "03020845301",
            "name": "នូ ឆវី"
        },
        {
            "barcode": "171140854",
            "dpc": "03020845201",
            "name": "នូ ឆាវ"
        },
        {
            "barcode": "171140855",
            "dpc": "03020847601",
            "name": "ឌឿម សាមុជ"
        },
        {
            "barcode": "171140856",
            "dpc": "03020847701",
            "name": "ណយ រ៉ាវុធ"
        },
        {
            "barcode": "171140857",
            "dpc": "03020847901",
            "name": "គង់ សំអាត"
        },
        {
            "barcode": "171140858",
            "dpc": "03020817201",
            "name": "សេង សាវដា"
        },
        {
            "barcode": "171140859",
            "dpc": "03020817301",
            "name": "ប៊ុន សេងហ៊ាង"
        },
        {
            "barcode": "171140860",
            "dpc": "03020817501",
            "name": "គុយ ច្រិប"
        },
        {
            "barcode": "171140861",
            "dpc": "03020817101",
            "name": "ទេព តឿម"
        },
        {
            "barcode": "171140862",
            "dpc": "03020824501",
            "name": "សំ សារួម"
        },
        {
            "barcode": "171140863",
            "dpc": "03020816801",
            "name": "បៃ យាន"
        },
        {
            "barcode": "171140864",
            "dpc": "03020817701",
            "name": "ឡឹក សំបូរ"
        },
        {
            "barcode": "171140865",
            "dpc": "03020817801",
            "name": "ខ្លូត សំបូរ"
        },
        {
            "barcode": "171140866",
            "dpc": "03020817901",
            "name": "ប៉ិច ចិន្តា"
        },
        {
            "barcode": "171140867",
            "dpc": "03020818001",
            "name": "អ៊ី សាមិត្ត"
        },
        {
            "barcode": "171140868",
            "dpc": "03020818401",
            "name": "លាប ឈន់"
        },
        {
            "barcode": "171140869",
            "dpc": "03020815901",
            "name": "ហូវ សានី"
        },
        {
            "barcode": "171140870",
            "dpc": "03020816001",
            "name": "សេង វ៉ាន់លី"
        },
        {
            "barcode": "171140871",
            "dpc": "03020816101",
            "name": "សុខ សាន"
        },
        {
            "barcode": "171140872",
            "dpc": "03020816201",
            "name": "សុខ គង់"
        },
        {
            "barcode": "171140873",
            "dpc": "03020816301",
            "name": "ង៉ែត វិភូ (២)"
        },
        {
            "barcode": "171140874",
            "dpc": "03020818801",
            "name": "គល់ ឈុន"
        },
        {
            "barcode": "171140875",
            "dpc": "03020818601",
            "name": "ចាន់ សុខន"
        },
        {
            "barcode": "171140876",
            "dpc": "03020816401",
            "name": "អៀង ឆេង"
        },
        {
            "barcode": "171140877",
            "dpc": "03020840501",
            "name": "ស៊ូ ស្រីនិ"
        },
        {
            "barcode": "171140878",
            "dpc": "03020816701",
            "name": "ខ្លូត សម្បត្តិ"
        },
        {
            "barcode": "171140879",
            "dpc": "03020816901",
            "name": "សុខ ឡម"
        },
        {
            "barcode": "171140880",
            "dpc": "03020818501",
            "name": "ឈុន លឿត"
        },
        {
            "barcode": "171140881",
            "dpc": "03020819001",
            "name": "នង សុផល"
        },
        {
            "barcode": "171140882",
            "dpc": "03020819301",
            "name": "សូ សាវុធ"
        },
        {
            "barcode": "171140883",
            "dpc": "03020819601",
            "name": "ឃិន ពៅ"
        },
        {
            "barcode": "171140884",
            "dpc": "03020819701",
            "name": "ហេង សុភារុណ"
        },
        {
            "barcode": "171140885",
            "dpc": "03020819801",
            "name": "ឡោ ចិន្តា"
        },
        {
            "barcode": "171140886",
            "dpc": "03020819901",
            "name": "សយ គឹមសាន្ត"
        },
        {
            "barcode": "171140887",
            "dpc": "03020820201",
            "name": "ពុធ សំរិទ្ធ"
        },
        {
            "barcode": "171140888",
            "dpc": "03020820501",
            "name": "គុណ សម្ផស្ស"
        },
        {
            "barcode": "171140889",
            "dpc": "03020820601",
            "name": "ម៉ក សាលី"
        },
        {
            "barcode": "171140890",
            "dpc": "03020822001",
            "name": "គង់ គន្ធា"
        },
        {
            "barcode": "171140891",
            "dpc": "03020821101",
            "name": "ខៀវ ពៅ"
        },
        {
            "barcode": "171140892",
            "dpc": "03020821001",
            "name": "ឡោ សម្បត្តិ"
        },
        {
            "barcode": "171140893",
            "dpc": "03020820901",
            "name": "រស់ វ៉ាវី"
        },
        {
            "barcode": "171140894",
            "dpc": "03020820801",
            "name": "ទិត សារួន"
        },
        {
            "barcode": "171140895",
            "dpc": "03020820701",
            "name": "ហុល រិន"
        },
        {
            "barcode": "171140896",
            "dpc": "03020820401",
            "name": "ពៅ សត្យ"
        },
        {
            "barcode": "171140897",
            "dpc": "03020820301",
            "name": "ខឹម ចាន់"
        },
        {
            "barcode": "171140898",
            "dpc": "03020820101",
            "name": "វិន សាវេន"
        },
        {
            "barcode": "171140899",
            "dpc": "03020820001",
            "name": "សុខ សារ៉ាត់"
        },
        {
            "barcode": "171140900",
            "dpc": "03020819501",
            "name": "គឹម សុភុន"
        },
        {
            "barcode": "171140901",
            "dpc": "03020819401",
            "name": "នង ហ៊ាន"
        },
        {
            "barcode": "171140902",
            "dpc": "03020821201",
            "name": "កង សារ៉េន"
        },
        {
            "barcode": "171140903",
            "dpc": "03020821301",
            "name": "ពៅ វុទ្ធី"
        },
        {
            "barcode": "171140904",
            "dpc": "03020821401",
            "name": "ហ៊ីម លិញ"
        },
        {
            "barcode": "171140905",
            "dpc": "03020815301",
            "name": "សោ ជ្រឿន"
        },
        {
            "barcode": "171140906",
            "dpc": "03020821501",
            "name": "ម៉ម ណុល"
        },
        {
            "barcode": "171140907",
            "dpc": "03020821701",
            "name": "តាំង ចាំងហួយ"
        },
        {
            "barcode": "171140908",
            "dpc": "03020821601",
            "name": "ភួង ស៊ីម"
        },
        {
            "barcode": "171140909",
            "dpc": "03020821801",
            "name": "ហុក សេង"
        },
        {
            "barcode": "171140910",
            "dpc": "03020822101",
            "name": "យិន ឌី"
        },
        {
            "barcode": "171140911",
            "dpc": "03020822201",
            "name": "សេង ម៉េងសាម"
        },
        {
            "barcode": "171140912",
            "dpc": "03020845101",
            "name": "គឹម លន់"
        },
        {
            "barcode": "171140913",
            "dpc": "03020845401",
            "name": "នូ វ៉ារី"
        },
        {
            "barcode": "171140914",
            "dpc": "03020845901",
            "name": "លឹម ហាន"
        },
        {
            "barcode": "171140915",
            "dpc": "03020845801",
            "name": "មណ្ឌល កុម៉ាកំព្រា"
        },
        {
            "barcode": "171140916",
            "dpc": "03020845701",
            "name": "រៀន វីរៈ"
        },
        {
            "barcode": "171140917",
            "dpc": "03020845601",
            "name": "លុក ចន្ថា"
        },
        {
            "barcode": "171140918",
            "dpc": "03020845501",
            "name": "ខែត្រ សៀង"
        },
        {
            "barcode": "171140919",
            "dpc": "03020821901",
            "name": "ងួន គន"
        },
        {
            "barcode": "171140920",
            "dpc": "03020846301",
            "name": "សុខ សុផល"
        },
        {
            "barcode": "171140921",
            "dpc": "03020847001",
            "name": "ហ៊ុន សាលី"
        },
        {
            "barcode": "171140922",
            "dpc": "03020817601",
            "name": "ទុយ សុផល"
        },
        {
            "barcode": "171140923",
            "dpc": "03020824401",
            "name": "ញូង ផែន"
        },
        {
            "barcode": "171140924",
            "dpc": "03020824301",
            "name": "ម៉ែន ឆយ"
        },
        {
            "barcode": "171140925",
            "dpc": "03020824201",
            "name": "អៃ អឿន"
        },
        {
            "barcode": "171140926",
            "dpc": "03020824101",
            "name": "ជឹម ចិន្តា"
        },
        {
            "barcode": "171140927",
            "dpc": "03020824001",
            "name": "អ៊ី ខេង"
        },
        {
            "barcode": "171140928",
            "dpc": "03020823901",
            "name": "រ៉ែម សំណាង"
        },
        {
            "barcode": "171140929",
            "dpc": "03020823801",
            "name": "ឆាន់ ជី"
        },
        {
            "barcode": "171140930",
            "dpc": "03020823701",
            "name": "និន ផល្លា"
        },
        {
            "barcode": "171140931",
            "dpc": "03020823601",
            "name": "អ៊ឹង ឈួរឆាយ"
        },
        {
            "barcode": "171140932",
            "dpc": "03020823501",
            "name": "នូ ប៊ុនណា"
        },
        {
            "barcode": "171140933",
            "dpc": "03020823401",
            "name": "ម៉ៅ ប៊ន"
        },
        {
            "barcode": "171140934",
            "dpc": "03020823301",
            "name": "ព ពៅ"
        },
        {
            "barcode": "171140935",
            "dpc": "03020823201",
            "name": "កូវ ជីងប៊ុង"
        },
        {
            "barcode": "171140936",
            "dpc": "03020823101",
            "name": "ឆាយ លីន"
        },
        {
            "barcode": "171140937",
            "dpc": "03020823001",
            "name": "ឡឹក ចាន់រិទ្ធី"
        },
        {
            "barcode": "171140938",
            "dpc": "03020822901",
            "name": "អុក សេន"
        },
        {
            "barcode": "171140939",
            "dpc": "03020822801",
            "name": "ម៉ិល ណារិន"
        },
        {
            "barcode": "171140940",
            "dpc": "03020822701",
            "name": "ឆោម ឈឺយ"
        },
        {
            "barcode": "171140941",
            "dpc": "03020822501",
            "name": "ឃួន សុខុម"
        },
        {
            "barcode": "171140942",
            "dpc": "03020822401",
            "name": "ឌិត សាលួត"
        },
        {
            "barcode": "171140943",
            "dpc": "03020822301",
            "name": "ប៊ុន ឡុង"
        },
        {
            "barcode": "171140944",
            "dpc": "03020813801",
            "name": "គ្រី ទិត្យ"
        },
        {
            "barcode": "171140945",
            "dpc": "03020813701",
            "name": "ជិន សុភា"
        },
        {
            "barcode": "171140946",
            "dpc": "03020813501",
            "name": "រ៉ឹន ណារ៉ាន់"
        },
        {
            "barcode": "171140947",
            "dpc": "03020813401",
            "name": "យិន រឿម"
        },
        {
            "barcode": "171140948",
            "dpc": "03020813301",
            "name": "ម៉ាង សារុំ"
        },
        {
            "barcode": "171140949",
            "dpc": "03020813001",
            "name": "តោ ចិន្តា"
        },
        {
            "barcode": "171140950",
            "dpc": "03020812901",
            "name": "ពូ ពេក"
        },
        {
            "barcode": "171140951",
            "dpc": "03020812801",
            "name": "សុខ លី"
        },
        {
            "barcode": "171140952",
            "dpc": "03020812501",
            "name": "ជា ឃុន"
        },
        {
            "barcode": "171140953",
            "dpc": "03020825501",
            "name": "ឆាយ គឹមទឹង"
        },
        {
            "barcode": "171140954",
            "dpc": "03020825401",
            "name": "សៀក ឈរ"
        },
        {
            "barcode": "171140955",
            "dpc": "03020825301",
            "name": "ដឿក ម៉ៅ"
        },
        {
            "barcode": "171140956",
            "dpc": "03020825101",
            "name": "អាង យ៉េង"
        },
        {
            "barcode": "171140957",
            "dpc": "03020824901",
            "name": "ហួត ឡាយ"
        },
        {
            "barcode": "171140958",
            "dpc": "03020824801",
            "name": "ឈិន វៃ"
        },
        {
            "barcode": "171140959",
            "dpc": "03020824701",
            "name": "យក់ ហ៊ុន"
        },
        {
            "barcode": "171140960",
            "dpc": "03020824601",
            "name": "ជាង ម៉ុង"
        },
        {
            "barcode": "171140961",
            "dpc": "03020812301",
            "name": "អ៊ឹង ឡេងហ៊ួត"
        },
        {
            "barcode": "171140962",
            "dpc": "03020812201",
            "name": "គឹម បូផៃ"
        },
        {
            "barcode": "171140963",
            "dpc": "03020812101",
            "name": "យឿន អឿន"
        },
        {
            "barcode": "171140964",
            "dpc": "03020811901",
            "name": "គឹម សុងវិចិត្រ"
        },
        {
            "barcode": "171140965",
            "dpc": "03020811801",
            "name": "គឹម បុត្តា"
        },
        {
            "barcode": "171140966",
            "dpc": "03020811701",
            "name": "លុយ រដ្ឋា"
        },
        {
            "barcode": "171140967",
            "dpc": "03020811601",
            "name": "វែង ថៃ"
        },
        {
            "barcode": "171140968",
            "dpc": "03020811501",
            "name": "អ៊ាង សុខា"
        },
        {
            "barcode": "171140969",
            "dpc": "03020811401",
            "name": "ពៅ រ៉េន"
        },
        {
            "barcode": "171140970",
            "dpc": "03020811301",
            "name": "ពេជ្រ សុខា"
        },
        {
            "barcode": "171140971",
            "dpc": "03020811201",
            "name": "ស៊ន ហ៊ុន"
        },
        {
            "barcode": "171140972",
            "dpc": "03020811101",
            "name": "ប៉ាវ ចាន់តារា"
        },
        {
            "barcode": "171140973",
            "dpc": "03020811001",
            "name": "អេង អ៊ាង"
        },
        {
            "barcode": "171140974",
            "dpc": "03020810901",
            "name": "ប៉ូ ទូច"
        },
        {
            "barcode": "171140975",
            "dpc": "03020810801",
            "name": "គូ កាម"
        },
        {
            "barcode": "171140976",
            "dpc": "03020810701",
            "name": "គឹម សេង"
        },
        {
            "barcode": "171140977",
            "dpc": "03020810601",
            "name": "សេង សំរេច"
        },
        {
            "barcode": "171140978",
            "dpc": "03020810301",
            "name": "អាត ច្រិប"
        },
        {
            "barcode": "171140979",
            "dpc": "03020810201",
            "name": "ប្រាក់ ឡុង"
        },
        {
            "barcode": "171140980",
            "dpc": "03020810101",
            "name": "ឈៀង ឡានី"
        },
        {
            "barcode": "171140981",
            "dpc": "03020810001",
            "name": "ពឹង ស៊ីម៉េង"
        },
        {
            "barcode": "171140982",
            "dpc": "03020809901",
            "name": "លី ឈុន"
        },
        {
            "barcode": "171140983",
            "dpc": "03020809801",
            "name": "យក់ តាំង"
        },
        {
            "barcode": "171140984",
            "dpc": "03020809701",
            "name": "លឹម ហាប់"
        },
        {
            "barcode": "171140985",
            "dpc": "03020809601",
            "name": "ចាប សុធី"
        },
        {
            "barcode": "171140986",
            "dpc": "03020809501",
            "name": "សេង ជា"
        },
        {
            "barcode": "171140987",
            "dpc": "03020815601",
            "name": "នៅ យ៉ារ័ត្ន"
        },
        {
            "barcode": "171140988",
            "dpc": "03020815401",
            "name": "ម៉ៅ ហ៊ុន"
        },
        {
            "barcode": "171140989",
            "dpc": "03020815201",
            "name": "អាត់ សឿន"
        },
        {
            "barcode": "171140990",
            "dpc": "03020815101",
            "name": "ស៊ា លឹមទ្រី"
        },
        {
            "barcode": "171140991",
            "dpc": "03020815001",
            "name": "គឹម សុខសាន្ត"
        },
        {
            "barcode": "171140992",
            "dpc": "03020814901",
            "name": "អ៊ឹង សារ៉ាត់"
        },
        {
            "barcode": "171140993",
            "dpc": "03020814801",
            "name": "ហួយ ឡាន"
        },
        {
            "barcode": "171140994",
            "dpc": "03020814601",
            "name": "សុខ ប៊ូ"
        },
        {
            "barcode": "171140995",
            "dpc": "03020814501",
            "name": "លុក សំប៊ុន"
        },
        {
            "barcode": "171140996",
            "dpc": "03020814401",
            "name": "ទឹម ប៉ូល"
        },
        {
            "barcode": "171140997",
            "dpc": "03020814301",
            "name": "សេង ហ៊ីម"
        },
        {
            "barcode": "171140998",
            "dpc": "03020814101",
            "name": "ប្រាក់ គង់"
        },
        {
            "barcode": "171140999",
            "dpc": "03020814001",
            "name": "ជា ដាំ"
        },
        {
            "barcode": "171141000",
            "dpc": "03020813901",
            "name": "អ៊ុន រឿន"
        },
        {
            "barcode": "171141001",
            "dpc": "03020813201",
            "name": "សោម យ៉ម"
        },
        {
            "barcode": "171141002",
            "dpc": "03020813101",
            "name": "ជៀវ ហ្វីលីប"
        },
        {
            "barcode": "171141003",
            "dpc": "03020812701",
            "name": "សុខ វុទ្ធី"
        },
        {
            "barcode": "171141004",
            "dpc": "03020812401",
            "name": "ជៀម ហ៊ាង"
        },
        {
            "barcode": "171141005",
            "dpc": "03020848001",
            "name": "ឌឿម សាមុជ"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
