let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=

    [
        {
            "barcode": "171141006",
            "dpc": "03020920901",
            "name": "សុខ នាង"
        },
        {
            "barcode": "171141007",
            "dpc": "03020921701",
            "name": "មឿន ឈឿត"
        },
        {
            "barcode": "171141008",
            "dpc": "03020921601",
            "name": "សុខ កប"
        },
        {
            "barcode": "171141009",
            "dpc": "03020921401",
            "name": "កែវ វាសនា"
        },
        {
            "barcode": "171141010",
            "dpc": "03020921301",
            "name": "ពិន ប៊ុនថន"
        },
        {
            "barcode": "171141011",
            "dpc": "03020921201",
            "name": "ស៊ាន សុខណាល់"
        },
        {
            "barcode": "171141012",
            "dpc": "03020921101",
            "name": "អ៊ឹម រតនា"
        },
        {
            "barcode": "171141013",
            "dpc": "03020921001",
            "name": "ហួ  ហេង"
        },
        {
            "barcode": "171141014",
            "dpc": "03020919501",
            "name": "សា រឿន"
        },
        {
            "barcode": "171141015",
            "dpc": "03020919801",
            "name": "ជួង អាន"
        },
        {
            "barcode": "171141016",
            "dpc": "03020919701",
            "name": "ជ  គឹមហេង"
        },
        {
            "barcode": "171141017",
            "dpc": "03020919601",
            "name": "ជៀប សូរ"
        },
        {
            "barcode": "171141018",
            "dpc": "03020919901",
            "name": "ឡាយ សាយ"
        },
        {
            "barcode": "171141019",
            "dpc": "03020920001",
            "name": "យូ ហៀក"
        },
        {
            "barcode": "171141020",
            "dpc": "03020920101",
            "name": "គ្រី ឈួន"
        },
        {
            "barcode": "171141021",
            "dpc": "03020920201",
            "name": "ឆន លួត"
        },
        {
            "barcode": "171141022",
            "dpc": "03020920301",
            "name": "ឆន ឆាន"
        },
        {
            "barcode": "171141023",
            "dpc": "03020920401",
            "name": "ទ្រី លួត"
        },
        {
            "barcode": "171141024",
            "dpc": "03020920501",
            "name": "គឹម សុខាល័យ"
        },
        {
            "barcode": "171141025",
            "dpc": "03020920601",
            "name": "សឹង ពៅ"
        },
        {
            "barcode": "171141026",
            "dpc": "03020920701",
            "name": "គង់ ហុង"
        },
        {
            "barcode": "171141027",
            "dpc": "03020919301",
            "name": "រឿង តាន់"
        },
        {
            "barcode": "171141028",
            "dpc": "03020919201",
            "name": "កែវ ពិសិទ្ធ"
        },
        {
            "barcode": "171141029",
            "dpc": "03020919101",
            "name": "ម៉ាន់ លិញ"
        },
        {
            "barcode": "171141030",
            "dpc": "03020919001",
            "name": "ជួន រដ្ឋា"
        },
        {
            "barcode": "171141031",
            "dpc": "03020918801",
            "name": "គឹម គាង"
        },
        {
            "barcode": "171141032",
            "dpc": "03020918901",
            "name": "កឹម  ឌី"
        },
        {
            "barcode": "171141033",
            "dpc": "03020918601",
            "name": "សោម ឌឿន"
        },
        {
            "barcode": "171141034",
            "dpc": "03020917301",
            "name": "ម៉ៅ ធី"
        },
        {
            "barcode": "171141035",
            "dpc": "03020917201",
            "name": "ពិន ថាវី"
        },
        {
            "barcode": "171141036",
            "dpc": "03020917101",
            "name": "គង់ អន"
        },
        {
            "barcode": "171141037",
            "dpc": "03020917001",
            "name": "ម៉ឹង សុខុន"
        },
        {
            "barcode": "171141038",
            "dpc": "03020917601",
            "name": "ឈុំ ដេត"
        },
        {
            "barcode": "171141039",
            "dpc": "03020917701",
            "name": "ហៀក ស្រេង"
        },
        {
            "barcode": "171141040",
            "dpc": "03020917801",
            "name": "វ៉ា  ប៊ុនយឿត"
        },
        {
            "barcode": "171141041",
            "dpc": "03020917901",
            "name": "ហេង ហុកម៉េង"
        },
        {
            "barcode": "171141042",
            "dpc": "03020918001",
            "name": "យិន ហុង"
        },
        {
            "barcode": "171141043",
            "dpc": "03020918101",
            "name": "សុខ វែង"
        },
        {
            "barcode": "171141044",
            "dpc": "03020918201",
            "name": "លេ សុខ"
        },
        {
            "barcode": "171141045",
            "dpc": "03020918301",
            "name": "លឿង សុលីដា"
        },
        {
            "barcode": "171141046",
            "dpc": "03020918401",
            "name": "ស៊ិន និត្យាលីន"
        },
        {
            "barcode": "171141047",
            "dpc": "03020918501",
            "name": "សំ ឡាយ"
        },
        {
            "barcode": "171141048",
            "dpc": "03020917401",
            "name": "សុខ ឌី"
        },
        {
            "barcode": "171141049",
            "dpc": "03020917501",
            "name": "អ៊ុង សំអន"
        },
        {
            "barcode": "171141050",
            "dpc": "03020916901",
            "name": "យ៉ា សុផៃលីន"
        },
        {
            "barcode": "171141051",
            "dpc": "03020916801",
            "name": "ឌឹម  វី"
        },
        {
            "barcode": "171141052",
            "dpc": "03020916701",
            "name": "ធឹង វន"
        },
        {
            "barcode": "171141053",
            "dpc": "03020916601",
            "name": "មុ ភឿន"
        },
        {
            "barcode": "171141054",
            "dpc": "03020916501",
            "name": "ពុធ ចំរើន"
        },
        {
            "barcode": "171141055",
            "dpc": "03020916401",
            "name": "សុខ សុផាត"
        },
        {
            "barcode": "171141056",
            "dpc": "03020916301",
            "name": "គឹម ឡេង"
        },
        {
            "barcode": "171141057",
            "dpc": "03020915601",
            "name": "ហៀក ស្រេង ១"
        },
        {
            "barcode": "171141058",
            "dpc": "03020915701",
            "name": "ហៀក ស្រេង ២"
        },
        {
            "barcode": "171141059",
            "dpc": "03020915801",
            "name": "ហៀក ស្រេង ៣"
        },
        {
            "barcode": "171141060",
            "dpc": "03020915901",
            "name": "ហៀក ស្រេង ៤"
        },
        {
            "barcode": "171141061",
            "dpc": "03020915301",
            "name": "ស្វាយ ចំរិទ្ធ"
        },
        {
            "barcode": "171141062",
            "dpc": "03020923001",
            "name": "ទូច ហេង"
        },
        {
            "barcode": "171141063",
            "dpc": "03020922901",
            "name": "គង់ គា"
        },
        {
            "barcode": "171141064",
            "dpc": "03020922801",
            "name": "តាំង ហាលឹម"
        },
        {
            "barcode": "171141065",
            "dpc": "03020927401",
            "name": "អ៊ិន យូឃាង"
        },
        {
            "barcode": "171141066",
            "dpc": "03020931101",
            "name": "ម៉ែន  ម៉ាន"
        },
        {
            "barcode": "171141067",
            "dpc": "03020931701",
            "name": "ជុំ ចំរ៉ុង"
        },
        {
            "barcode": "171141068",
            "dpc": "03020932001",
            "name": "សា ម៉ន"
        },
        {
            "barcode": "171141069",
            "dpc": "03020932101",
            "name": "លី ស្រូន"
        },
        {
            "barcode": "171141070",
            "dpc": "03020932301",
            "name": "ភូ ផល្លី"
        },
        {
            "barcode": "171141071",
            "dpc": "03020932401",
            "name": "សឹង សារៀម"
        },
        {
            "barcode": "171141072",
            "dpc": "03020933401",
            "name": "សយ បូរ៉ា"
        },
        {
            "barcode": "171141073",
            "dpc": "03020933501",
            "name": "សយ ប៉ូលីន"
        },
        {
            "barcode": "171141074",
            "dpc": "03020933601",
            "name": "ពត សាវ៉ុង"
        },
        {
            "barcode": "171141075",
            "dpc": "03020932201",
            "name": "កាក់ សិលា"
        },
        {
            "barcode": "171141076",
            "dpc": "03020935401",
            "name": "នង វណ្ណៈ"
        },
        {
            "barcode": "171141077",
            "dpc": "03020935301",
            "name": "នង​ ស៊ីផាន់"
        },
        {
            "barcode": "171141078",
            "dpc": "03020935201",
            "name": "នង ប៊ុន ធឿន"
        },
        {
            "barcode": "171141079",
            "dpc": "03020935101",
            "name": "នន់ វណ្ណា"
        },
        {
            "barcode": "171141080",
            "dpc": "03020935001",
            "name": "អុំ  វណ្ណា"
        },
        {
            "barcode": "171141081",
            "dpc": "03020934801",
            "name": "គឹម អនោ"
        },
        {
            "barcode": "171141082",
            "dpc": "03020934701",
            "name": "ចាន់ យ៉េន"
        },
        {
            "barcode": "171141083",
            "dpc": "03020934601",
            "name": "សោម កុសល់"
        },
        {
            "barcode": "171141084",
            "dpc": "03020934501",
            "name": "មាស គឹមលន់"
        },
        {
            "barcode": "171141085",
            "dpc": "03020934401",
            "name": "ទ្រី ចំរ៉ុង"
        },
        {
            "barcode": "171141086",
            "dpc": "03020934201",
            "name": "ទូច សំអាង"
        },
        {
            "barcode": "171141087",
            "dpc": "03020934101",
            "name": "ទូច ដាវី"
        },
        {
            "barcode": "171141088",
            "dpc": "03020934001",
            "name": "ទូច សំអ៊ីន"
        },
        {
            "barcode": "171141089",
            "dpc": "03020933901",
            "name": "ឈួង រ៉ាវ៉ៃ"
        },
        {
            "barcode": "171141090",
            "dpc": "03020933801",
            "name": "សួន វណ្ណា"
        },
        {
            "barcode": "171141091",
            "dpc": "03020933701",
            "name": "ណុប ស៊ឹម"
        },
        {
            "barcode": "171141092",
            "dpc": "03020933301",
            "name": "លាង   ស៊ីវហេង"
        },
        {
            "barcode": "171141093",
            "dpc": "03020933001",
            "name": "ហេវ បាស៊ាន"
        },
        {
            "barcode": "171141094",
            "dpc": "03020932901",
            "name": "ហេង បេងឈុន"
        },
        {
            "barcode": "171141095",
            "dpc": "03020933201",
            "name": "ផាត ភីរុណ"
        },
        {
            "barcode": "171141096",
            "dpc": "03020932701",
            "name": "ឈុំ នារី"
        },
        {
            "barcode": "171141097",
            "dpc": "03020932601",
            "name": "លឹម ប៊ុនសឺ"
        },
        {
            "barcode": "171141098",
            "dpc": "03020932501",
            "name": "ទី វត្ថា"
        },
        {
            "barcode": "171141099",
            "dpc": "03020932801",
            "name": "ទេស អាណុង"
        },
        {
            "barcode": "171141100",
            "dpc": "03020937401",
            "name": "កៅ សួម"
        },
        {
            "barcode": "171141101",
            "dpc": "03020937301",
            "name": "លាយ សាវឿន"
        },
        {
            "barcode": "171141102",
            "dpc": "03020937201",
            "name": "តាំង សុផល"
        },
        {
            "barcode": "171141103",
            "dpc": "03020937101",
            "name": "ពៅ សាំង"
        },
        {
            "barcode": "171141104",
            "dpc": "03020937001",
            "name": "ជ័យ សែន"
        },
        {
            "barcode": "171141105",
            "dpc": "03020936901",
            "name": "ឈួង  ផាន់នី"
        },
        {
            "barcode": "171141106",
            "dpc": "03020936801",
            "name": "សេង សុភាព"
        },
        {
            "barcode": "171141107",
            "dpc": "03020936701",
            "name": "ឡុង សារុំ"
        },
        {
            "barcode": "171141108",
            "dpc": "03020936601",
            "name": "មាស បាន"
        },
        {
            "barcode": "171141109",
            "dpc": "03020936301",
            "name": "គឹម តាន់យ៉ា"
        },
        {
            "barcode": "171141110",
            "dpc": "03020936401",
            "name": "សោ វិចិត្រ"
        },
        {
            "barcode": "171141111",
            "dpc": "03020938301",
            "name": "អុំ  ណារិន"
        },
        {
            "barcode": "171141112",
            "dpc": "03020938201",
            "name": "ប៉ិល ដារ៉ា"
        },
        {
            "barcode": "171141113",
            "dpc": "03020938101",
            "name": "បុល  ដាវីត"
        },
        {
            "barcode": "171141114",
            "dpc": "03020938001",
            "name": "ប៉ិល ឆវិឌ្ឍន៍"
        },
        {
            "barcode": "171141115",
            "dpc": "03020937801",
            "name": "ហាស់ ស៊ីផាន់"
        },
        {
            "barcode": "171141116",
            "dpc": "03020937901",
            "name": "ចក់ ឆន"
        },
        {
            "barcode": "171141117",
            "dpc": "03020937701",
            "name": "ទឹម ភី"
        },
        {
            "barcode": "171141118",
            "dpc": "03020937601",
            "name": "ខ្វែក វ៉ាន់ឌឿន"
        },
        {
            "barcode": "171141119",
            "dpc": "03020935901",
            "name": "គឹម សុផានី"
        },
        {
            "barcode": "171141120",
            "dpc": "03020935801",
            "name": "មាស សារី"
        },
        {
            "barcode": "171141121",
            "dpc": "03020935701",
            "name": "ហេ បុប្ផា"
        },
        {
            "barcode": "171141122",
            "dpc": "03020935601",
            "name": "ខុង មន្នី"
        },
        {
            "barcode": "171141123",
            "dpc": "03020935501",
            "name": "អូន សៀន"
        },
        {
            "barcode": "171141124",
            "dpc": "03020936201",
            "name": "គឹម គា"
        },
        {
            "barcode": "171141125",
            "dpc": "03020936101",
            "name": "គឹម ហេង"
        },
        {
            "barcode": "171141126",
            "dpc": "03020923301",
            "name": "ថេង សុជាតា"
        },
        {
            "barcode": "171141127",
            "dpc": "03020923401",
            "name": "អ៊ឹង ម៉េងលី"
        },
        {
            "barcode": "171141128",
            "dpc": "03020923501",
            "name": "វង្ស ដាវី"
        },
        {
            "barcode": "171141129",
            "dpc": "03020923601",
            "name": "តេង សោភ័ណ្ឌ"
        },
        {
            "barcode": "171141130",
            "dpc": "03020923701",
            "name": "ព្រុំ ប្រសិទ្ធ"
        },
        {
            "barcode": "171141131",
            "dpc": "03020923801",
            "name": "ស៊ី អ៊ីវ"
        },
        {
            "barcode": "171141132",
            "dpc": "03020923901",
            "name": "ជា សុខចេង"
        },
        {
            "barcode": "171141133",
            "dpc": "03020924001",
            "name": "ជា ពៅ"
        },
        {
            "barcode": "171141134",
            "dpc": "03020924601",
            "name": "អុំ ប៉េងសុង"
        },
        {
            "barcode": "171141135",
            "dpc": "03020925201",
            "name": "សោម សុផា"
        },
        {
            "barcode": "171141136",
            "dpc": "03020925301",
            "name": "អេន សុវណ្ណារ៉ា"
        },
        {
            "barcode": "171141137",
            "dpc": "03020925401",
            "name": "ស៊ុន ហឿន"
        },
        {
            "barcode": "171141138",
            "dpc": "03020925501",
            "name": "ហែម រ៉ា"
        },
        {
            "barcode": "171141139",
            "dpc": "03020925601",
            "name": "នូ ផន"
        },
        {
            "barcode": "171141140",
            "dpc": "03020925701",
            "name": "ម៉េង ទី"
        },
        {
            "barcode": "171141141",
            "dpc": "03020925801",
            "name": "ម៉ៅ ស្រីកែវ"
        },
        {
            "barcode": "171141142",
            "dpc": "03020925901",
            "name": "សុខ សាលួត"
        },
        {
            "barcode": "171141143",
            "dpc": "03020926001",
            "name": "ចាន់ យ៉ា"
        },
        {
            "barcode": "171141144",
            "dpc": "03020926101",
            "name": "រស់ សាម៉ែន"
        },
        {
            "barcode": "171141145",
            "dpc": "03020926201",
            "name": "ជិន លាភ"
        },
        {
            "barcode": "171141146",
            "dpc": "03020926301",
            "name": "ស៊ុន បេ"
        },
        {
            "barcode": "171141147",
            "dpc": "03020926401",
            "name": "ម៉ាក់ ស៊ីណាត"
        },
        {
            "barcode": "171141148",
            "dpc": "03020926501",
            "name": "សេង ថេង"
        },
        {
            "barcode": "171141149",
            "dpc": "03020926601",
            "name": "យៀង នៅ"
        },
        {
            "barcode": "171141150",
            "dpc": "03020926701",
            "name": "ពេជ្រ ហេង"
        },
        {
            "barcode": "171141151",
            "dpc": "03020926801",
            "name": "កែវ សន"
        },
        {
            "barcode": "171141152",
            "dpc": "03020927001",
            "name": "ប៊ុន យ៉ារីន"
        },
        {
            "barcode": "171141153",
            "dpc": "03020926901",
            "name": "គុណ សារ៉ូ"
        },
        {
            "barcode": "171141154",
            "dpc": "03020927101",
            "name": "សាំង ភៅ"
        },
        {
            "barcode": "171141155",
            "dpc": "03020927201",
            "name": "លឹម យូហេង"
        },
        {
            "barcode": "171141156",
            "dpc": "03020927301",
            "name": "ង៉ុយ ស៊ីម"
        },
        {
            "barcode": "171141157",
            "dpc": "03020927501",
            "name": "សម ភារិន"
        },
        {
            "barcode": "171141158",
            "dpc": "03020927601",
            "name": "តោ ចាន់ថន"
        },
        {
            "barcode": "171141159",
            "dpc": "03020927701",
            "name": "លី ប៊ុនរៀន ១"
        },
        {
            "barcode": "171141160",
            "dpc": "03020927801",
            "name": "ហាន់ សុជិត"
        },
        {
            "barcode": "171141161",
            "dpc": "03020927901",
            "name": "លី ប៊ុនរឿន ២"
        },
        {
            "barcode": "171141162",
            "dpc": "03020928001",
            "name": "តោ ចាន់ថន ២"
        },
        {
            "barcode": "171141163",
            "dpc": "03020928101",
            "name": "ថោ សាន"
        },
        {
            "barcode": "171141164",
            "dpc": "03020928201",
            "name": "ចាន់ ឌឿន"
        },
        {
            "barcode": "171141165",
            "dpc": "03020928301",
            "name": "កូវ ជិញសៀង"
        },
        {
            "barcode": "171141166",
            "dpc": "03020928401",
            "name": "ភួង មេត្តា"
        },
        {
            "barcode": "171141167",
            "dpc": "03020928701",
            "name": "ម៉ា ព្រៀន"
        },
        {
            "barcode": "171141168",
            "dpc": "03020928801",
            "name": "ហ៊ុន  ណៃ"
        },
        {
            "barcode": "171141169",
            "dpc": "03020929001",
            "name": "ប៉ៃ  ទ្រី"
        },
        {
            "barcode": "171141170",
            "dpc": "03020929101",
            "name": "មុត ឈាង"
        },
        {
            "barcode": "171141171",
            "dpc": "03020929201",
            "name": "សោម សាវុន"
        },
        {
            "barcode": "171141172",
            "dpc": "03020929301",
            "name": "ទៀង សូលីណា"
        },
        {
            "barcode": "171141173",
            "dpc": "03020929401",
            "name": "ខេង ម៉ាក់ខេន"
        },
        {
            "barcode": "171141174",
            "dpc": "03020929501",
            "name": "នាង អ៊ីវ៉ាត"
        },
        {
            "barcode": "171141175",
            "dpc": "03020929601",
            "name": "ឈឹម សិលា"
        },
        {
            "barcode": "171141176",
            "dpc": "03020929701",
            "name": "សោម សាវួច"
        },
        {
            "barcode": "171141177",
            "dpc": "03020924301",
            "name": "ផេង សុភី"
        },
        {
            "barcode": "171141178",
            "dpc": "03020924501",
            "name": "ដង  ខ្វិត"
        },
        {
            "barcode": "171141179",
            "dpc": "03020924701",
            "name": "លឹម ប៉ូលីន"
        },
        {
            "barcode": "171141180",
            "dpc": "03020924801",
            "name": "កង វណ្ណៈ"
        },
        {
            "barcode": "171141181",
            "dpc": "03020924901",
            "name": "ចាន់ វ៉ារ៉ាសៀន"
        },
        {
            "barcode": "171141182",
            "dpc": "03020925001",
            "name": "ចាន់ ម៉ូនីតា"
        },
        {
            "barcode": "171141183",
            "dpc": "03020925101",
            "name": "ផូ ចិន"
        },
        {
            "barcode": "171141184",
            "dpc": "03020941701",
            "name": "គន់ សារូ"
        },
        {
            "barcode": "171141185",
            "dpc": "03020941901",
            "name": "យ៉ង់ ប៉ូឡែន"
        },
        {
            "barcode": "171141186",
            "dpc": "03020942001",
            "name": "ជា គីម"
        },
        {
            "barcode": "171141187",
            "dpc": "03020942201",
            "name": "ផា ចន្ធូរ"
        },
        {
            "barcode": "171141188",
            "dpc": "03020942301",
            "name": "ខៀវ ស៊ី"
        },
        {
            "barcode": "171141189",
            "dpc": "03020942401",
            "name": "ឈុំ កែវ"
        },
        {
            "barcode": "171141190",
            "dpc": "03020942501",
            "name": "ទា ហ៊ុយ"
        },
        {
            "barcode": "171141191",
            "dpc": "03020942601",
            "name": "ទា ប៊ុនគា"
        },
        {
            "barcode": "171141192",
            "dpc": "03020939601",
            "name": "ងុវ៉ូ  ដៀប"
        },
        {
            "barcode": "171141193",
            "dpc": "03020939801",
            "name": "ហុក ចន្ទ្រា"
        },
        {
            "barcode": "171141194",
            "dpc": "03020939901",
            "name": "វ៉ាយ គល់"
        },
        {
            "barcode": "171141195",
            "dpc": "03020940301",
            "name": "យឹម សាវឿន"
        },
        {
            "barcode": "171141196",
            "dpc": "03020940601",
            "name": "មៀច សាម៉េត"
        },
        {
            "barcode": "171141197",
            "dpc": "03020940701",
            "name": "កែវ អ៊ឹម"
        },
        {
            "barcode": "171141198",
            "dpc": "03020940801",
            "name": "ព្រឿន ប្រសិទ្ធ"
        },
        {
            "barcode": "171141199",
            "dpc": "03020940901",
            "name": "អ៊ឹង ចាន់ធី"
        },
        {
            "barcode": "171141200",
            "dpc": "03020941001",
            "name": "ព្រឿង គៀវ"
        },
        {
            "barcode": "171141201",
            "dpc": "03020941101",
            "name": "អ៊ឹម ដាវី"
        },
        {
            "barcode": "171141202",
            "dpc": "03020940501",
            "name": "អ៊ឹម ដាញ៉ឹម"
        },
        {
            "barcode": "171141203",
            "dpc": "03020940401",
            "name": "ចាន់ មុំ"
        },
        {
            "barcode": "171141204",
            "dpc": "03020940101",
            "name": "ផាវ មុន្នី"
        },
        {
            "barcode": "171141205",
            "dpc": "03020940201",
            "name": "គី សែ"
        },
        {
            "barcode": "171141206",
            "dpc": "03020941301",
            "name": "រៀន ណារ៉ា"
        },
        {
            "barcode": "171141207",
            "dpc": "03020941401",
            "name": "កូវ ជិញសៀង"
        },
        {
            "barcode": "171141208",
            "dpc": "03020941601",
            "name": "យក់ ចំរើន"
        },
        {
            "barcode": "171141209",
            "dpc": "03020942801",
            "name": "ម៉ៅ រ័ត្នមុនី"
        },
        {
            "barcode": "171141210",
            "dpc": "03020942901",
            "name": "ទូច វណ្ណី"
        },
        {
            "barcode": "171141211",
            "dpc": "03020943001",
            "name": "គា សិលា"
        },
        {
            "barcode": "171141212",
            "dpc": "03020941801",
            "name": "កែវ គឹមសាន"
        },
        {
            "barcode": "171141213",
            "dpc": "03020939001",
            "name": "ចាន់ សុខឡេង"
        },
        {
            "barcode": "171141214",
            "dpc": "03020939201",
            "name": "ឃុន អ៊ូ"
        },
        {
            "barcode": "171141215",
            "dpc": "03020939301",
            "name": "ណី សំណា"
        },
        {
            "barcode": "171141216",
            "dpc": "03020939401",
            "name": "ង៉ូវ ហ៊ុយ"
        },
        {
            "barcode": "171141217",
            "dpc": "03020939501",
            "name": "ស ហាវ"
        },
        {
            "barcode": "171141218",
            "dpc": "03020942701",
            "name": "សែម សុខា"
        },
        {
            "barcode": "171141219",
            "dpc": "03020938701",
            "name": "វ៉ធ សុខុម"
        },
        {
            "barcode": "171141220",
            "dpc": "03020938501",
            "name": "អ៊ី ឆេង"
        },
        {
            "barcode": "171141221",
            "dpc": "03020938601",
            "name": "ញ៉ក់ ពីវ"
        },
        {
            "barcode": "171141222",
            "dpc": "03020938801",
            "name": "ប៉ុល កែវ"
        },
        {
            "barcode": "171141223",
            "dpc": "03020938901",
            "name": "គឹម កេង"
        },
        {
            "barcode": "171141224",
            "dpc": "03020945301",
            "name": "សាំង បូរ៉ា"
        },
        {
            "barcode": "171141225",
            "dpc": "03020945401",
            "name": "មឿង សារិទ្ធ"
        },
        {
            "barcode": "171141226",
            "dpc": "03020945501",
            "name": "ហេង សុវណ្ណ"
        },
        {
            "barcode": "171141227",
            "dpc": "03020945601",
            "name": "សុខ អេង"
        },
        {
            "barcode": "171141228",
            "dpc": "03020945801",
            "name": "ឌឹម វិរោង"
        },
        {
            "barcode": "171141229",
            "dpc": "03020945701",
            "name": "អ៊ុន សំប៊ុន"
        },
        {
            "barcode": "171141230",
            "dpc": "03020945901",
            "name": "គឹម  ទ្រី"
        },
        {
            "barcode": "171141231",
            "dpc": "03020946001",
            "name": "សាន ថាវៀង"
        },
        {
            "barcode": "171141232",
            "dpc": "03020946101",
            "name": "វិន វន"
        },
        {
            "barcode": "171141233",
            "dpc": "03020946201",
            "name": "ស្រី សំណាង"
        },
        {
            "barcode": "171141234",
            "dpc": "03020946301",
            "name": "ម៉ុយ ដារ៉ាវុធ"
        },
        {
            "barcode": "171141235",
            "dpc": "03020946401",
            "name": "ទិព្វ ចន្ទវិបុល"
        },
        {
            "barcode": "171141236",
            "dpc": "03020946501",
            "name": "ភោគ វុទ្ធី"
        },
        {
            "barcode": "171141237",
            "dpc": "03020946601",
            "name": "ស៊ុន ចំរ៉ាត់ ១"
        },
        {
            "barcode": "171141238",
            "dpc": "03020946701",
            "name": "ស៊ុន ចំរ៉ាត់ ២"
        },
        {
            "barcode": "171141239",
            "dpc": "03020946801",
            "name": "នូ វណ្ណា"
        },
        {
            "barcode": "171141240",
            "dpc": "03020946901",
            "name": "សោម សុផា"
        },
        {
            "barcode": "171141241",
            "dpc": "03020947101",
            "name": "ស ម៉ារ៉ា"
        },
        {
            "barcode": "171141242",
            "dpc": "03020947201",
            "name": "តាំង ជៀវឡាយ"
        },
        {
            "barcode": "171141243",
            "dpc": "03020947301",
            "name": "អ៊ីវ ឈឿប"
        },
        {
            "barcode": "171141244",
            "dpc": "03020947401",
            "name": "លឹម ហ៊ាង ៥"
        },
        {
            "barcode": "171141245",
            "dpc": "03020947501",
            "name": "ងួន សុខគង់"
        },
        {
            "barcode": "171141246",
            "dpc": "03020947601",
            "name": "ពឹង ភាព"
        },
        {
            "barcode": "171141247",
            "dpc": "03020947701",
            "name": "គង់ ថៃឆេង"
        },
        {
            "barcode": "171141248",
            "dpc": "03020947801",
            "name": "លី មួយនី"
        },
        {
            "barcode": "171141249",
            "dpc": "03020947901",
            "name": "មៀច កន"
        },
        {
            "barcode": "171141250",
            "dpc": "03020943101",
            "name": "ម៉ែន សាម៉ុន ២"
        },
        {
            "barcode": "171141251",
            "dpc": "03020943201",
            "name": "ហម ហ៊ន"
        },
        {
            "barcode": "171141252",
            "dpc": "03020943301",
            "name": "ចាន់ ប៊ុនធី"
        },
        {
            "barcode": "171141253",
            "dpc": "03020943401",
            "name": "ណុប សុដេត"
        },
        {
            "barcode": "171141254",
            "dpc": "03020943501",
            "name": "ជៀវ  គឹមឈៀត"
        },
        {
            "barcode": "171141255",
            "dpc": "03020943601",
            "name": "ម៉ាញ់ កែវ"
        },
        {
            "barcode": "171141256",
            "dpc": "03020943701",
            "name": "ជាវ ស្រៀង"
        },
        {
            "barcode": "171141257",
            "dpc": "03020943801",
            "name": "អ៊ុយ ជិនណា"
        },
        {
            "barcode": "171141258",
            "dpc": "03020943901",
            "name": "អ៊ុន សំអូន"
        },
        {
            "barcode": "171141259",
            "dpc": "03020944001",
            "name": "អ៊ុន សំអាត"
        },
        {
            "barcode": "171141260",
            "dpc": "03020944101",
            "name": "សួន សុវណ្ណ"
        },
        {
            "barcode": "171141261",
            "dpc": "03020944201",
            "name": "ម៉ម ឡា"
        },
        {
            "barcode": "171141262",
            "dpc": "03020944301",
            "name": "ធន់ សេរី"
        },
        {
            "barcode": "171141263",
            "dpc": "03020944401",
            "name": "ជិន ហុង"
        },
        {
            "barcode": "171141264",
            "dpc": "03020944501",
            "name": "យិន ដាំ"
        },
        {
            "barcode": "171141265",
            "dpc": "03020944601",
            "name": "ខេង ឡាយ"
        },
        {
            "barcode": "171141266",
            "dpc": "03020944701",
            "name": "អ៊ឹម ហៃ"
        },
        {
            "barcode": "171141267",
            "dpc": "03020944801",
            "name": "ហៃ សុភាព"
        },
        {
            "barcode": "171141268",
            "dpc": "03020944901",
            "name": "ហម នី"
        },
        {
            "barcode": "171141269",
            "dpc": "03020945101",
            "name": "ទុយ ប៊ុនឈត"
        },
        {
            "barcode": "171141270",
            "dpc": "03020945201",
            "name": "សំ ប៊ុន"
        },
        {
            "barcode": "171141271",
            "dpc": "03020914201",
            "name": "វត្តលៀប"
        },
        {
            "barcode": "171141272",
            "dpc": "03020945001",
            "name": "សេង ថៃលី"
        },
        {
            "barcode": "171141273",
            "dpc": "03020941501",
            "name": "វ៉ាន់ វារី"
        },
        {
            "barcode": "171141274",
            "dpc": "03020939701",
            "name": "ហួយ ប៊ុនឡេង"
        },
        {
            "barcode": "171141275",
            "dpc": "03020911601",
            "name": "សុច  សុផល"
        },
        {
            "barcode": "171141276",
            "dpc": "03020913301",
            "name": "ទ្រីញ  អាន"
        },
        {
            "barcode": "171141277",
            "dpc": "03020915501",
            "name": "ពេទ្យ  ផាវ៉ាន់"
        },
        {
            "barcode": "171141278",
            "dpc": "03020919401",
            "name": "ម៉ែន   តិច"
        },
        {
            "barcode": "171141279",
            "dpc": "03020921801",
            "name": "ឡុង   ដេត"
        },
        {
            "barcode": "171141280",
            "dpc": "03020921901",
            "name": "លឹម  ហ៊ួសាន"
        },
        {
            "barcode": "171141281",
            "dpc": "03020922001",
            "name": "សុខ   ប៊ុននី"
        },
        {
            "barcode": "171141282",
            "dpc": "03020922401",
            "name": "យឹម  ឈឿម"
        },
        {
            "barcode": "171141283",
            "dpc": "03020922501",
            "name": "ដាំ  សាម៉ី"
        },
        {
            "barcode": "171141284",
            "dpc": "03020922701",
            "name": "ហៀក  ស្រេង ៩"
        },
        {
            "barcode": "171141285",
            "dpc": "03020923101",
            "name": "ណាំ  ទីស៊ុនធួក"
        },
        {
            "barcode": "171141286",
            "dpc": "03020923201",
            "name": "ណាំ  ចាន់ថានី"
        },
        {
            "barcode": "171141287",
            "dpc": "03020924101",
            "name": "ធូ  ចឹក"
        },
        {
            "barcode": "171141288",
            "dpc": "03020924201",
            "name": "អួន  សុភី"
        },
        {
            "barcode": "171141289",
            "dpc": "03020929801",
            "name": "វ៉ាន់    អេង"
        },
        {
            "barcode": "171141290",
            "dpc": "03020929901",
            "name": "នួន   ផល្លី"
        },
        {
            "barcode": "171141291",
            "dpc": "03020930001",
            "name": "តាន់  គឹមស៊ាន"
        },
        {
            "barcode": "171141292",
            "dpc": "03020930101",
            "name": "អ៊ឹម  សារឿន"
        },
        {
            "barcode": "171141293",
            "dpc": "03020930201",
            "name": "ម៉ន  ម៉ុន"
        },
        {
            "barcode": "171141294",
            "dpc": "03020930301",
            "name": "ញ៉ែម  មឿន"
        },
        {
            "barcode": "171141295",
            "dpc": "03020930401",
            "name": "សៅ  ភីរិទ្ធ"
        },
        {
            "barcode": "171141296",
            "dpc": "03020930501",
            "name": "សៅ  ភីរុទ្ធ"
        },
        {
            "barcode": "171141297",
            "dpc": "03020930601",
            "name": "ហឿន  សំរិទ្ធិ"
        },
        {
            "barcode": "171141298",
            "dpc": "03020930701",
            "name": "តាំង  សេងហ៊ាង"
        },
        {
            "barcode": "171141299",
            "dpc": "03020930801",
            "name": "ធូ  សុជាតិ"
        },
        {
            "barcode": "171141300",
            "dpc": "03020930901",
            "name": "កាន  ហួ"
        },
        {
            "barcode": "171141301",
            "dpc": "03020931001",
            "name": "លាយ  សុភី"
        },
        {
            "barcode": "171141302",
            "dpc": "03020931201",
            "name": "ហួត  សុគុណ ២"
        },
        {
            "barcode": "171141303",
            "dpc": "03020931301",
            "name": "ខ្លង  សារិន"
        },
        {
            "barcode": "171141304",
            "dpc": "03020931401",
            "name": "វ៉ាន់  ថុល"
        },
        {
            "barcode": "171141305",
            "dpc": "03020931501",
            "name": "ចេង  ឡៃ"
        },
        {
            "barcode": "171141306",
            "dpc": "03020931601",
            "name": "សំ  សុន"
        },
        {
            "barcode": "171141307",
            "dpc": "03020931801",
            "name": "មុំ  ឌឹម"
        },
        {
            "barcode": "171141308",
            "dpc": "03020931901",
            "name": "ឌឹម  សំអាង"
        },
        {
            "barcode": "171141309",
            "dpc": "03020941201",
            "name": "ហាក់  ថាំង"
        },
        {
            "barcode": "171141310",
            "dpc": "03020922101",
            "name": "ងិន  សារ៉េត"
        },
        {
            "barcode": "171141311",
            "dpc": "03020922201",
            "name": "ហេង  រក្សា"
        },
        {
            "barcode": "171141312",
            "dpc": "03020922301",
            "name": "សាន  លាងគីម"
        },
        {
            "barcode": "171141313",
            "dpc": "03020909001",
            "name": "ប៊ី ទូច"
        },
        {
            "barcode": "171141314",
            "dpc": "03020909401",
            "name": "ហេង អូន"
        },
        {
            "barcode": "171141315",
            "dpc": "03020909501",
            "name": "សួរ ណាលី"
        },
        {
            "barcode": "171141316",
            "dpc": "03020909601",
            "name": "ច័ន្ទ ចៀន"
        },
        {
            "barcode": "171141317",
            "dpc": "03020909701",
            "name": "ទី ផាត"
        },
        {
            "barcode": "171141318",
            "dpc": "03020909801",
            "name": "ហេង សារ៉ាត់"
        },
        {
            "barcode": "171141319",
            "dpc": "03020909901",
            "name": "វង្ស សុក្រសារវ័ន្ត"
        },
        {
            "barcode": "171141320",
            "dpc": "03020910001",
            "name": "ជុំ អុល"
        },
        {
            "barcode": "171141321",
            "dpc": "03020910101",
            "name": "គង់ ផៃ"
        },
        {
            "barcode": "171141322",
            "dpc": "03020910301",
            "name": "យឹម  សំបូរ"
        },
        {
            "barcode": "171141323",
            "dpc": "03020907701",
            "name": "វេង  ហោ"
        },
        {
            "barcode": "171141324",
            "dpc": "03020907801",
            "name": "ថុង គឹមស៊ួរ"
        },
        {
            "barcode": "171141325",
            "dpc": "03020907901",
            "name": "វង្ស វឹង"
        },
        {
            "barcode": "171141326",
            "dpc": "03020908601",
            "name": "ឡេង ឃុនសុខផល្លី"
        },
        {
            "barcode": "171141327",
            "dpc": "03020908701",
            "name": "ឡយ ប៊ុនធឿន"
        },
        {
            "barcode": "171141328",
            "dpc": "03020908801",
            "name": "អេង ប៊ុនហេង"
        },
        {
            "barcode": "171141329",
            "dpc": "03020908901",
            "name": "វិញ រ៉ាឌី"
        },
        {
            "barcode": "171141330",
            "dpc": "03020909301",
            "name": "ឡាយ សុខខេង"
        },
        {
            "barcode": "171141331",
            "dpc": "03020908501",
            "name": "ឡៅ ឆាយទ្រី"
        },
        {
            "barcode": "171141332",
            "dpc": "03020908401",
            "name": "ជួង ខ្វា"
        },
        {
            "barcode": "171141333",
            "dpc": "03020908301",
            "name": "ថេង"
        },
        {
            "barcode": "171141334",
            "dpc": "03020908201",
            "name": "ឃុន សុឆី"
        },
        {
            "barcode": "171141335",
            "dpc": "03020908101",
            "name": "ចន សំណាង"
        },
        {
            "barcode": "171141336",
            "dpc": "03020908001",
            "name": "សុខ ចាន់"
        },
        {
            "barcode": "171141337",
            "dpc": "03020907601",
            "name": "សុខ សារ៉ាន់"
        },
        {
            "barcode": "171141338",
            "dpc": "03020907501",
            "name": "រស់ ឈន"
        },
        {
            "barcode": "171141339",
            "dpc": "03020907401",
            "name": "ហេង ចាន់ថា"
        },
        {
            "barcode": "171141340",
            "dpc": "03020907301",
            "name": "ព្រំ ធៀន"
        },
        {
            "barcode": "171141341",
            "dpc": "03020907201",
            "name": "គ្រី គឹមឈន"
        },
        {
            "barcode": "171141342",
            "dpc": "03020907101",
            "name": "រឿម សក់"
        },
        {
            "barcode": "171141343",
            "dpc": "03020907001",
            "name": "ចាន់ នី"
        },
        {
            "barcode": "171141344",
            "dpc": "03020906901",
            "name": "សាំង ស៊ីថា"
        },
        {
            "barcode": "171141345",
            "dpc": "03020906601",
            "name": "វិសុទ្ធ រដ្ឋា"
        },
        {
            "barcode": "171141346",
            "dpc": "03020906501",
            "name": "ចាន់ សូយ៉េត"
        },
        {
            "barcode": "171141347",
            "dpc": "03020905701",
            "name": "ញ៉ែម សឿន"
        },
        {
            "barcode": "171141348",
            "dpc": "03020905801",
            "name": "និត ស៊ីញ"
        },
        {
            "barcode": "171141349",
            "dpc": "03020905901",
            "name": "អ៊ុក វង្ស"
        },
        {
            "barcode": "171141350",
            "dpc": "03020906001",
            "name": "ខូវ ឈូក"
        },
        {
            "barcode": "171141351",
            "dpc": "03020906101",
            "name": "សៀង សុថង ១"
        },
        {
            "barcode": "171141352",
            "dpc": "03020906201",
            "name": "សៀង សុថង ២"
        },
        {
            "barcode": "171141353",
            "dpc": "03020906301",
            "name": "សៀង សុថង ៣"
        },
        {
            "barcode": "171141354",
            "dpc": "03020906401",
            "name": "អែល សយ"
        },
        {
            "barcode": "171141355",
            "dpc": "03020905201",
            "name": "អ៊ឹង ចាន់ថន"
        },
        {
            "barcode": "171141356",
            "dpc": "03020905301",
            "name": "ហឿន ឌឿ"
        },
        {
            "barcode": "171141357",
            "dpc": "03020905401",
            "name": "ធី គិន"
        },
        {
            "barcode": "171141358",
            "dpc": "03020905501",
            "name": "សូរ សុគុណ"
        },
        {
            "barcode": "171141359",
            "dpc": "03020905601",
            "name": "ឆាយ សារ៉េត ១"
        },
        {
            "barcode": "171141360",
            "dpc": "03020905001",
            "name": "ម៉ែន  ហួត"
        },
        {
            "barcode": "171141361",
            "dpc": "03020904601",
            "name": "គូ សុគន្ធាវី"
        },
        {
            "barcode": "171141362",
            "dpc": "03020904801",
            "name": "ស វុទ្ធី"
        },
        {
            "barcode": "171141363",
            "dpc": "03020904701",
            "name": "សៀវ គឹមថា"
        },
        {
            "barcode": "171141364",
            "dpc": "03020905101",
            "name": "សៀវ ចន្នី"
        },
        {
            "barcode": "171141365",
            "dpc": "03020904401",
            "name": "ហង់ ប៊ុនថន"
        },
        {
            "barcode": "171141366",
            "dpc": "03020904301",
            "name": "អ៊ុយ លីវ ៩"
        },
        {
            "barcode": "171141367",
            "dpc": "03020904201",
            "name": "អ៊ុយ លីវ ៨"
        },
        {
            "barcode": "171141368",
            "dpc": "03020904101",
            "name": "អ៊ុយ លីវ ៧"
        },
        {
            "barcode": "171141369",
            "dpc": "03020904001",
            "name": "អ៊ុយ លីវ  ៦"
        },
        {
            "barcode": "171141370",
            "dpc": "03020903901",
            "name": "អ៊ុយ លីវ ៥"
        },
        {
            "barcode": "171141371",
            "dpc": "03020903801",
            "name": "អ៊ុយ លីវ ៤"
        },
        {
            "barcode": "171141372",
            "dpc": "03020903701",
            "name": "អ៊ុយ លីវ ៣"
        },
        {
            "barcode": "171141373",
            "dpc": "03020903601",
            "name": "អ៊ុយ លីវ ២"
        },
        {
            "barcode": "171141374",
            "dpc": "03020903501",
            "name": "អ៊ុយ លីវ ១"
        },
        {
            "barcode": "171141375",
            "dpc": "03020903401",
            "name": "តាន់ ម៉ាល័យ"
        },
        {
            "barcode": "171141376",
            "dpc": "03020903301",
            "name": "អេង សុវណ្ណី"
        },
        {
            "barcode": "171141377",
            "dpc": "03020903201",
            "name": "កៅ ឈួនណារ៉ា"
        },
        {
            "barcode": "171141378",
            "dpc": "03020903101",
            "name": "អ៊ឹម សុជិត"
        },
        {
            "barcode": "171141379",
            "dpc": "03020903001",
            "name": "ម៉ី សាវី"
        },
        {
            "barcode": "171141380",
            "dpc": "03020902901",
            "name": "អ៊ឹម ហឿន"
        },
        {
            "barcode": "171141381",
            "dpc": "03020902601",
            "name": "រស់ សុក្រិត"
        },
        {
            "barcode": "171141382",
            "dpc": "03020902501",
            "name": "អ៊ុង សាមី"
        },
        {
            "barcode": "171141383",
            "dpc": "03020902401",
            "name": "តន់ ប៊ុនរឿង"
        },
        {
            "barcode": "171141384",
            "dpc": "03020900101",
            "name": "លី  ឆយ"
        },
        {
            "barcode": "171141385",
            "dpc": "03020900401",
            "name": "សាលាហ្វឹកហ្វឺនភាសាអន្តរជាតិ"
        },
        {
            "barcode": "171141386",
            "dpc": "03020900301",
            "name": "ហឺ ដាវី"
        },
        {
            "barcode": "171141387",
            "dpc": "03020900501",
            "name": "អៀង សុភី"
        },
        {
            "barcode": "171141388",
            "dpc": "03020900701",
            "name": "សួន សំរិទ្ធ"
        },
        {
            "barcode": "171141389",
            "dpc": "03020900801",
            "name": "ហម រិទ្ធ"
        },
        {
            "barcode": "171141390",
            "dpc": "03020900901",
            "name": "ថុល សុធា"
        },
        {
            "barcode": "171141391",
            "dpc": "03020901001",
            "name": "លី ប៊ួយ"
        },
        {
            "barcode": "171141392",
            "dpc": "03020901101",
            "name": "តូច ស៊ុនណារ៉ា"
        },
        {
            "barcode": "171141393",
            "dpc": "03020901201",
            "name": "ហម មន្នី"
        },
        {
            "barcode": "171141394",
            "dpc": "03020901301",
            "name": "នួម  ឆៃរួម"
        },
        {
            "barcode": "171141395",
            "dpc": "03020901401",
            "name": "ម៉ក់ ផាន់ណា"
        },
        {
            "barcode": "171141396",
            "dpc": "03020901501",
            "name": "សុខ ស្រីមុំ"
        },
        {
            "barcode": "171141397",
            "dpc": "03020901601",
            "name": "ស្វាយ ថាវរិទ្ធ"
        },
        {
            "barcode": "171141398",
            "dpc": "03020901801",
            "name": "ជ័រ សុវណ្ណ"
        },
        {
            "barcode": "171141399",
            "dpc": "03020901901",
            "name": "គួយ តាំងអេង"
        },
        {
            "barcode": "171141400",
            "dpc": "03020902001",
            "name": "យិន យក់"
        },
        {
            "barcode": "171141401",
            "dpc": "03020901701",
            "name": "ពិន ស៊ីវត្ថា"
        },
        {
            "barcode": "171141402",
            "dpc": "03020902101",
            "name": "ជូរ ឆានហួត"
        },
        {
            "barcode": "171141403",
            "dpc": "03020902201",
            "name": "មុំ បុណ្យបូរិន"
        },
        {
            "barcode": "171141404",
            "dpc": "03020902301",
            "name": "ស៊ុន វ៉ាន់ណូ"
        },
        {
            "barcode": "171141405",
            "dpc": "03020910501",
            "name": "សុខ គឹមហៀក"
        },
        {
            "barcode": "171141406",
            "dpc": "03020910601",
            "name": "ម៉ុង ចាន់សារ៉េត"
        },
        {
            "barcode": "171141407",
            "dpc": "03020910701",
            "name": "សោម កញ្ញារ័ត្ន"
        },
        {
            "barcode": "171141408",
            "dpc": "03020910801",
            "name": "ម៉ុក សារិវណ្ណា"
        },
        {
            "barcode": "171141409",
            "dpc": "03020910901",
            "name": "ឈាង សុវណ្ណា"
        },
        {
            "barcode": "171141410",
            "dpc": "03020911001",
            "name": "ហែម សិលា"
        },
        {
            "barcode": "171141411",
            "dpc": "03020911101",
            "name": "ហេង វែងឈៀង"
        },
        {
            "barcode": "171141412",
            "dpc": "03020911201",
            "name": "ប៉ាន់ នី"
        },
        {
            "barcode": "171141413",
            "dpc": "03020911401",
            "name": "លី ឆទិញ"
        },
        {
            "barcode": "171141414",
            "dpc": "03020911501",
            "name": "យិន កោ"
        },
        {
            "barcode": "171141415",
            "dpc": "03020911701",
            "name": "ចែង ឆុំ"
        },
        {
            "barcode": "171141416",
            "dpc": "03020911901",
            "name": "ណូ ប៊ុនធឿន"
        },
        {
            "barcode": "171141417",
            "dpc": "03020912001",
            "name": "ពៅ សុង"
        },
        {
            "barcode": "171141418",
            "dpc": "03020912101",
            "name": "អៀង គឹមថុល"
        },
        {
            "barcode": "171141419",
            "dpc": "03020912201",
            "name": "ចន  សំណាង"
        },
        {
            "barcode": "171141420",
            "dpc": "03020912301",
            "name": "ផល លាងហ៊ីម"
        },
        {
            "barcode": "171141421",
            "dpc": "03020912401",
            "name": "សេង ទៀង"
        },
        {
            "barcode": "171141422",
            "dpc": "03020912601",
            "name": "ឈឿង ឆន"
        },
        {
            "barcode": "171141423",
            "dpc": "03020912701",
            "name": "សារិ អឿន"
        },
        {
            "barcode": "171141424",
            "dpc": "03020912801",
            "name": "ចាន់ ពៅ"
        },
        {
            "barcode": "171141425",
            "dpc": "03020912901",
            "name": "ឆាយ សារ៉េត"
        },
        {
            "barcode": "171141426",
            "dpc": "03020913001",
            "name": "ហាស់ អសនី"
        },
        {
            "barcode": "171141427",
            "dpc": "03020913101",
            "name": "ឃុន ងួន(ថ្មី)"
        },
        {
            "barcode": "171141428",
            "dpc": "03020913201",
            "name": "ថោង បូរាណ"
        },
        {
            "barcode": "171141429",
            "dpc": "03020913401",
            "name": "ប៊ុន ដេត"
        },
        {
            "barcode": "171141430",
            "dpc": "03020913501",
            "name": "កែវ ហួត"
        },
        {
            "barcode": "171141431",
            "dpc": "03020913601",
            "name": "គា វណ្ណា"
        },
        {
            "barcode": "171141432",
            "dpc": "03020913701",
            "name": "សេង ហ៊ុយ"
        },
        {
            "barcode": "171141433",
            "dpc": "03020913801",
            "name": "សុខ ចាន់"
        },
        {
            "barcode": "171141434",
            "dpc": "03020913901",
            "name": "អ៊ិន ប្រាជ្ញ"
        },
        {
            "barcode": "171141435",
            "dpc": "03020914001",
            "name": "សុង ហុង (ចាស់)"
        },
        {
            "barcode": "171141436",
            "dpc": "03020914301",
            "name": "ដែង  រស្មី"
        },
        {
            "barcode": "171141437",
            "dpc": "03020914401",
            "name": "សុង ហុង (ថ្មី)"
        },
        {
            "barcode": "171141438",
            "dpc": "03020914501",
            "name": "យ៉ាំ ថោង"
        },
        {
            "barcode": "171141439",
            "dpc": "03020914601",
            "name": "ប៊ុន ហូហេង"
        },
        {
            "barcode": "171141440",
            "dpc": "03020914701",
            "name": "អ៊ឹង ប៊ុនហុង"
        },
        {
            "barcode": "171141441",
            "dpc": "03020914801",
            "name": "ដៀប ទ្រី"
        },
        {
            "barcode": "171141442",
            "dpc": "03020914901",
            "name": "វិទ្យាស្ថានវប្បធម៌បារាំង"
        },
        {
            "barcode": "171141443",
            "dpc": "03020915101",
            "name": "សុខ សុផាត ៣"
        },
        {
            "barcode": "171141444",
            "dpc": "03020915001",
            "name": "វែង ស្រ៊ុន ១"
        },
        {
            "barcode": "171141445",
            "dpc": "03020915201",
            "name": "វែង ស្រ៊ុន ៤"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
