let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171136151",
            "dpc": "03031207301",
            "name": "សៀង សៀក ខេង"
        },
        {
            "barcode": "171136152",
            "dpc": "03031245801",
            "name": "ឃី យ៉ា"
        },
        {
            "barcode": "171136153",
            "dpc": "03031245701",
            "name": "ជ គាង"
        },
        {
            "barcode": "171136154",
            "dpc": "03031245601",
            "name": "ឆាយ ម៉េងហ៊ាង"
        },
        {
            "barcode": "171136155",
            "dpc": "03031245501",
            "name": "ម៉េង ជូ"
        },
        {
            "barcode": "171136156",
            "dpc": "03031245401",
            "name": "អ៊ូច ដានី"
        },
        {
            "barcode": "171136157",
            "dpc": "03031245301",
            "name": "គឹម រដ្ឋា"
        },
        {
            "barcode": "171136158",
            "dpc": "03031238601",
            "name": "អ៊ុក ទូច"
        },
        {
            "barcode": "171136159",
            "dpc": "03031245101",
            "name": "ឈុន សុរិយា"
        },
        {
            "barcode": "171136160",
            "dpc": "03031245001",
            "name": "ចាន់ ប៊ុនលឿម"
        },
        {
            "barcode": "171136161",
            "dpc": "03031244901",
            "name": "អ៊ុក ផាន់ណាក់"
        },
        {
            "barcode": "171136162",
            "dpc": "03031244801",
            "name": "រៀន ឌ័រ"
        },
        {
            "barcode": "171136163",
            "dpc": "03031244601",
            "name": "អ៊ុង ឃុន"
        },
        {
            "barcode": "171136164",
            "dpc": "03031244701",
            "name": "ហេង ឡាង"
        },
        {
            "barcode": "171136165",
            "dpc": "03031244001",
            "name": "ចេត ហ៊ួរ"
        },
        {
            "barcode": "171136166",
            "dpc": "03031242601",
            "name": "ទ្រី គឹមទៀង"
        },
        {
            "barcode": "171136167",
            "dpc": "03031242701",
            "name": "ប៊ិន ពៅ"
        },
        {
            "barcode": "171136168",
            "dpc": "03031243001",
            "name": "លឹម លី"
        },
        {
            "barcode": "171136169",
            "dpc": "03031243101",
            "name": "ហាង  សំណាង"
        },
        {
            "barcode": "171136170",
            "dpc": "03031244101",
            "name": "រុន រ៉ឹយ"
        },
        {
            "barcode": "171136171",
            "dpc": "03031244201",
            "name": "ឡុង ណាគ្រី"
        },
        {
            "barcode": "171136172",
            "dpc": "03031244301",
            "name": "ស សារ៉ាបូពាន៍"
        },
        {
            "barcode": "171136173",
            "dpc": "03031244401",
            "name": "អ៊ុយ វណ្ណា"
        },
        {
            "barcode": "171136174",
            "dpc": "03031244501",
            "name": "បៅ តុង"
        },
        {
            "barcode": "171136175",
            "dpc": "03031243301",
            "name": "យន សម្បត្តិ"
        },
        {
            "barcode": "171136176",
            "dpc": "03031243401",
            "name": "សុខ សុធារិទ្ធ"
        },
        {
            "barcode": "171136177",
            "dpc": "03031243501",
            "name": "កេន ម៉ៅ"
        },
        {
            "barcode": "171136178",
            "dpc": "03031243601",
            "name": "ឌុច សុម៉ាលី"
        },
        {
            "barcode": "171136179",
            "dpc": "03031243701",
            "name": "យន ស៊ីន"
        },
        {
            "barcode": "171136180",
            "dpc": "03031243801",
            "name": "ដួង ម៉ុន"
        },
        {
            "barcode": "171136181",
            "dpc": "03031243901",
            "name": "ប្រាក់ លីវណ្ណៈ"
        },
        {
            "barcode": "171136182",
            "dpc": "03031243201",
            "name": "ឈឺន ឡូវ"
        },
        {
            "barcode": "171136183",
            "dpc": "03031242901",
            "name": "សំ​ វឹង"
        },
        {
            "barcode": "171136184",
            "dpc": "03031242801",
            "name": "ផៃ ធឿន"
        },
        {
            "barcode": "171136185",
            "dpc": "03031222301",
            "name": "សួ សុផារ៉ាប់"
        },
        {
            "barcode": "171136186",
            "dpc": "03031242501",
            "name": "ទេព សា"
        },
        {
            "barcode": "171136187",
            "dpc": "03031242401",
            "name": "ទេព ស៊ីម"
        },
        {
            "barcode": "171136188",
            "dpc": "03031242301",
            "name": "ស៊ូ ខឿត"
        },
        {
            "barcode": "171136189",
            "dpc": "03031242201",
            "name": "ឈីវ កិរិយា"
        },
        {
            "barcode": "171136190",
            "dpc": "03031242101",
            "name": "ឃុន សុភាព"
        },
        {
            "barcode": "171136191",
            "dpc": "03031242001",
            "name": "ហោ ជា"
        },
        {
            "barcode": "171136192",
            "dpc": "03031241901",
            "name": "អ្នក ម៉ាង"
        },
        {
            "barcode": "171136193",
            "dpc": "03031241801",
            "name": "លី ហ៊ាង (ឈិម សារុំ)"
        },
        {
            "barcode": "171136194",
            "dpc": "03031241701",
            "name": "ណង អឿន"
        },
        {
            "barcode": "171136195",
            "dpc": "03031241601",
            "name": "អ៊ឹវ សារិកាកែវ"
        },
        {
            "barcode": "171136196",
            "dpc": "03031241501",
            "name": "សុខ ហេង"
        },
        {
            "barcode": "171136197",
            "dpc": "03031241401",
            "name": "ឌុច រី"
        },
        {
            "barcode": "171136198",
            "dpc": "03031241301",
            "name": "ណាត គង់"
        },
        {
            "barcode": "171136199",
            "dpc": "03031241101",
            "name": "សុខ នី"
        },
        {
            "barcode": "171136200",
            "dpc": "03031241001",
            "name": "សុខ ធី"
        },
        {
            "barcode": "171136201",
            "dpc": "03031240901",
            "name": "ប៉ិន សុខុន"
        },
        {
            "barcode": "171136202",
            "dpc": "03031240801",
            "name": "សុខ ស៊ីវន"
        },
        {
            "barcode": "171136203",
            "dpc": "03031240701",
            "name": "មិន ញឹម"
        },
        {
            "barcode": "171136204",
            "dpc": "03031240601",
            "name": "ផៃ គង់"
        },
        {
            "barcode": "171136205",
            "dpc": "03031240501",
            "name": "ឈុយ ឡឹម"
        },
        {
            "barcode": "171136206",
            "dpc": "03031240401",
            "name": "អឿន ប្រុស"
        },
        {
            "barcode": "171136207",
            "dpc": "03031240301",
            "name": "នុត ធូក"
        },
        {
            "barcode": "171136208",
            "dpc": "03031240201",
            "name": "អៀង វិន"
        },
        {
            "barcode": "171136209",
            "dpc": "03031240101",
            "name": "វង្ស ឈុតនី"
        },
        {
            "barcode": "171136210",
            "dpc": "03031240001",
            "name": "សេង ទូច"
        },
        {
            "barcode": "171136211",
            "dpc": "03031239901",
            "name": "ជា ថា"
        },
        {
            "barcode": "171136212",
            "dpc": "03031239801",
            "name": "ឈួន ង៉ូវ"
        },
        {
            "barcode": "171136213",
            "dpc": "03031239701",
            "name": "ថាច់  ចិន្តា"
        },
        {
            "barcode": "171136214",
            "dpc": "03031239601",
            "name": "រី សុខា"
        },
        {
            "barcode": "171136215",
            "dpc": "03031247201",
            "name": "ជុន ផាត"
        },
        {
            "barcode": "171136216",
            "dpc": "03031247101",
            "name": "អុំ សុភី"
        },
        {
            "barcode": "171136217",
            "dpc": "03031247001",
            "name": "ស៊ី នួន"
        },
        {
            "barcode": "171136218",
            "dpc": "03031246901",
            "name": "ប៉ាវ មុនយីន"
        },
        {
            "barcode": "171136219",
            "dpc": "03031246801",
            "name": "លឹម គឹមស្រេង"
        },
        {
            "barcode": "171136220",
            "dpc": "03031246701",
            "name": "វ៉ាន់ ណារី"
        },
        {
            "barcode": "171136221",
            "dpc": "03031246601",
            "name": "គិវ ល័យ"
        },
        {
            "barcode": "171136222",
            "dpc": "03031246401",
            "name": "គិម សឿន"
        },
        {
            "barcode": "171136223",
            "dpc": "03031246301",
            "name": "ពិន ខាន"
        },
        {
            "barcode": "171136224",
            "dpc": "03031246201",
            "name": "គឹម ហួយ"
        },
        {
            "barcode": "171136225",
            "dpc": "03031246101",
            "name": "ពិន ម៉ុក"
        },
        {
            "barcode": "171136226",
            "dpc": "03031246001",
            "name": "គង់ សេរី"
        },
        {
            "barcode": "171136227",
            "dpc": "03031245901",
            "name": "សាយ សូ"
        },
        {
            "barcode": "171136228",
            "dpc": "03031239501",
            "name": "លឹម ឆាយ"
        },
        {
            "barcode": "171136229",
            "dpc": "03031239401",
            "name": "ថៃ គង់"
        },
        {
            "barcode": "171136230",
            "dpc": "03031239301",
            "name": "លឹម   ឈន"
        },
        {
            "barcode": "171136231",
            "dpc": "03031239201",
            "name": "ឡោ ខៃ"
        },
        {
            "barcode": "171136232",
            "dpc": "03031239101",
            "name": "លន់ ត្រៃ"
        },
        {
            "barcode": "171136233",
            "dpc": "03031239001",
            "name": "ប៊ិន អូន"
        },
        {
            "barcode": "171136234",
            "dpc": "03031238901",
            "name": "បួន គឹមស្រឿង"
        },
        {
            "barcode": "171136235",
            "dpc": "03031238701",
            "name": "ប៊ុន ចាន់មុនី"
        },
        {
            "barcode": "171136236",
            "dpc": "03031238501",
            "name": "ហោ អៀង"
        },
        {
            "barcode": "171136237",
            "dpc": "03031238401",
            "name": "ប៊ី ណាលីន"
        },
        {
            "barcode": "171136238",
            "dpc": "03031238301",
            "name": "ប៊ិន អឿន"
        },
        {
            "barcode": "171136239",
            "dpc": "03031238201",
            "name": "ចាន់ ស៊ន"
        },
        {
            "barcode": "171136240",
            "dpc": "03031238101",
            "name": "ហៃ តុង"
        },
        {
            "barcode": "171136241",
            "dpc": "03031238001",
            "name": "ស៊ិន សំរេច"
        },
        {
            "barcode": "171136242",
            "dpc": "03031237901",
            "name": "ចាន់ សំអោ"
        },
        {
            "barcode": "171136243",
            "dpc": "03031237801",
            "name": "ផាវ ប៊ុនតឹក"
        },
        {
            "barcode": "171136244",
            "dpc": "03031237701",
            "name": "កែវ អន"
        },
        {
            "barcode": "171136245",
            "dpc": "03031237601",
            "name": "រី សុខា"
        },
        {
            "barcode": "171136246",
            "dpc": "03031237501",
            "name": "គាវ ណយ"
        },
        {
            "barcode": "171136247",
            "dpc": "03031237401",
            "name": "អ៊ឹ ហ៊ុយ"
        },
        {
            "barcode": "171136248",
            "dpc": "03031237301",
            "name": "សៅ សឿន"
        },
        {
            "barcode": "171136249",
            "dpc": "03031237201",
            "name": "ថេន សារឿន"
        },
        {
            "barcode": "171136250",
            "dpc": "03031237101",
            "name": "មួយ ឡេង"
        },
        {
            "barcode": "171136251",
            "dpc": "03031237001",
            "name": "ស៊ិ ស៊ីវ"
        },
        {
            "barcode": "171136252",
            "dpc": "03031236901",
            "name": "គឹម រដ្ឋា"
        },
        {
            "barcode": "171136253",
            "dpc": "03031211801",
            "name": "នី សារ៉ា"
        },
        {
            "barcode": "171136254",
            "dpc": "03031236801",
            "name": "ម៉ឹក សូនី"
        },
        {
            "barcode": "171136255",
            "dpc": "03031236701",
            "name": "ឈុំ ផល្លី"
        },
        {
            "barcode": "171136256",
            "dpc": "03031236601",
            "name": "គួច ហាវ"
        },
        {
            "barcode": "171136257",
            "dpc": "03031236501",
            "name": "ប៊ុន គង់"
        },
        {
            "barcode": "171136258",
            "dpc": "03031236401",
            "name": "លន់ ស៊ីម"
        },
        {
            "barcode": "171136259",
            "dpc": "03031236301",
            "name": "កែវ ភូមិន្ទ"
        },
        {
            "barcode": "171136260",
            "dpc": "03031236201",
            "name": "ចឹក គា"
        },
        {
            "barcode": "171136261",
            "dpc": "03031236101",
            "name": "ទាវ យ៉ាន់"
        },
        {
            "barcode": "171136262",
            "dpc": "03031236001",
            "name": "លី ឡេង"
        },
        {
            "barcode": "171136263",
            "dpc": "03031235901",
            "name": "ចាន់ ថុល"
        },
        {
            "barcode": "171136264",
            "dpc": "03031235801",
            "name": "សឿម កែវ"
        },
        {
            "barcode": "171136265",
            "dpc": "03031235701",
            "name": "វ៉ាន់  បូយ៉ា"
        },
        {
            "barcode": "171136266",
            "dpc": "03031226501",
            "name": "ខេង  ស្រីទូច"
        },
        {
            "barcode": "171136267",
            "dpc": "03031225901",
            "name": "ស៊ឹម  សុផល"
        },
        {
            "barcode": "171136268",
            "dpc": "03031225701",
            "name": "ស៊ីវ  ជុយ"
        },
        {
            "barcode": "171136269",
            "dpc": "03031225601",
            "name": "សេង  គឹមឈុន"
        },
        {
            "barcode": "171136270",
            "dpc": "03031225501",
            "name": "មៀច  សុមន៍"
        },
        {
            "barcode": "171136271",
            "dpc": "03031225401",
            "name": "ស៊ូ  អៀ"
        },
        {
            "barcode": "171136272",
            "dpc": "03031225301",
            "name": "គី  គង់"
        },
        {
            "barcode": "171136273",
            "dpc": "03031225201",
            "name": "ម៉ុន  មីកា"
        },
        {
            "barcode": "171136274",
            "dpc": "03031225101",
            "name": "ចេស  សាវុធ"
        },
        {
            "barcode": "171136275",
            "dpc": "03031225001",
            "name": "យ៉ាន  ហួត ២"
        },
        {
            "barcode": "171136276",
            "dpc": "03031224901",
            "name": "យ៉ាន  ហួត ១"
        },
        {
            "barcode": "171136277",
            "dpc": "03031224801",
            "name": "គុយ  សុខ"
        },
        {
            "barcode": "171136278",
            "dpc": "03031224701",
            "name": "តាំង  សាន់"
        },
        {
            "barcode": "171136279",
            "dpc": "03031224601",
            "name": "លឹម  សារ៉ម"
        },
        {
            "barcode": "171136280",
            "dpc": "03031224501",
            "name": "សេង  យ៉ុន"
        },
        {
            "barcode": "171136281",
            "dpc": "03031224401",
            "name": "ជូ  ម៉ាត់លី"
        },
        {
            "barcode": "171136282",
            "dpc": "03031224301",
            "name": "គង់  ឈុន"
        },
        {
            "barcode": "171136283",
            "dpc": "03031224201",
            "name": "ស្មាន់  ប៉ិច"
        },
        {
            "barcode": "171136284",
            "dpc": "03031224101",
            "name": "ចាន់  គឹមហ៊ាង"
        },
        {
            "barcode": "171136285",
            "dpc": "03031224001",
            "name": "ងិន  យឹម"
        },
        {
            "barcode": "171136286",
            "dpc": "03031223901",
            "name": "ហែម  សាវ៉ាត"
        },
        {
            "barcode": "171136287",
            "dpc": "03031223801",
            "name": "លីវ  សុខា"
        },
        {
            "barcode": "171136288",
            "dpc": "03031223701",
            "name": "គង់  ផៃ"
        },
        {
            "barcode": "171136289",
            "dpc": "03031223401",
            "name": "សណ្នាគារខេមរា ១"
        },
        {
            "barcode": "171136290",
            "dpc": "03031223301",
            "name": "សៀង  ស៊ុតថង"
        },
        {
            "barcode": "171136291",
            "dpc": "03031223201",
            "name": "ឃុន  ហេង"
        },
        {
            "barcode": "171136292",
            "dpc": "03031223101",
            "name": "ថាច់  ជួន"
        },
        {
            "barcode": "171136293",
            "dpc": "03031223001",
            "name": "ម៉ៅ  សុផល"
        },
        {
            "barcode": "171136294",
            "dpc": "03031222901",
            "name": "ធុយ  ជួប"
        },
        {
            "barcode": "171136295",
            "dpc": "03031222801",
            "name": "ឯក  ជិវ័ន ២"
        },
        {
            "barcode": "171136296",
            "dpc": "03031222601",
            "name": "ទេព   ហ៊ាន"
        },
        {
            "barcode": "171136297",
            "dpc": "03031222501",
            "name": "សុស  ឈូក"
        },
        {
            "barcode": "171136298",
            "dpc": "03031222401",
            "name": "ស  បេងទូ"
        },
        {
            "barcode": "171136299",
            "dpc": "03031222201",
            "name": "ណៃ  គឹមស៊ុន"
        },
        {
            "barcode": "171136300",
            "dpc": "03031222101",
            "name": "ហុក  ឃន"
        },
        {
            "barcode": "171136301",
            "dpc": "03031222001",
            "name": "ចៅ  សូវង្ស"
        },
        {
            "barcode": "171136302",
            "dpc": "03031221201",
            "name": "ង៉ោ  សុធី"
        },
        {
            "barcode": "171136303",
            "dpc": "03031221101",
            "name": "ឌុច   សៀង"
        },
        {
            "barcode": "171136304",
            "dpc": "03031221001",
            "name": "ហាក់  ស្រី"
        },
        {
            "barcode": "171136305",
            "dpc": "03031220901",
            "name": "ទេព  ហ៊ឹម"
        },
        {
            "barcode": "171136306",
            "dpc": "03031220801",
            "name": "អេង  សាវឿន ២"
        },
        {
            "barcode": "171136307",
            "dpc": "03031220701",
            "name": "អេង  សាវឿន"
        },
        {
            "barcode": "171136308",
            "dpc": "03031220601",
            "name": "ឈិន  យាន"
        },
        {
            "barcode": "171136309",
            "dpc": "03031220501",
            "name": "ឃុន  ស៊ាង"
        },
        {
            "barcode": "171136310",
            "dpc": "03031223601",
            "name": "វង្ស  ផាន់"
        },
        {
            "barcode": "171136311",
            "dpc": "03031200201",
            "name": "ឌុច ចំរ៉ាត់"
        },
        {
            "barcode": "171136312",
            "dpc": "03031200301",
            "name": "ឡេង លីម"
        },
        {
            "barcode": "171136313",
            "dpc": "03031200401",
            "name": "ឯម ស៊ីថុល"
        },
        {
            "barcode": "171136314",
            "dpc": "03031200501",
            "name": "មាស ស៊ីណាត"
        },
        {
            "barcode": "171136315",
            "dpc": "03031200601",
            "name": "សុខ មឿន"
        },
        {
            "barcode": "171136316",
            "dpc": "03031200701",
            "name": "ភូ សុផល"
        },
        {
            "barcode": "171136317",
            "dpc": "03031200801",
            "name": "សួន ជន"
        },
        {
            "barcode": "171136318",
            "dpc": "03031200901",
            "name": "នូ ម៉េង"
        },
        {
            "barcode": "171136319",
            "dpc": "03031201001",
            "name": "តែ ពៅចិន្តា"
        },
        {
            "barcode": "171136320",
            "dpc": "03031201101",
            "name": "តុក សួរ"
        },
        {
            "barcode": "171136321",
            "dpc": "03031201201",
            "name": "សោម សាឃឿង"
        },
        {
            "barcode": "171136322",
            "dpc": "03031201301",
            "name": "ខួច សុផល"
        },
        {
            "barcode": "171136323",
            "dpc": "03031201401",
            "name": "លឹម ហួត"
        },
        {
            "barcode": "171136324",
            "dpc": "03031201501",
            "name": "ទឹម វណ្ណា"
        },
        {
            "barcode": "171136325",
            "dpc": "03031201601",
            "name": "អែម  ហ៊ន"
        },
        {
            "barcode": "171136326",
            "dpc": "03031201701",
            "name": "ជូ ធានហួត"
        },
        {
            "barcode": "171136327",
            "dpc": "03031201801",
            "name": "ខៀវ សារ៉ូ"
        },
        {
            "barcode": "171136328",
            "dpc": "03031201901",
            "name": "ហ៊ុយ គឹមសេម"
        },
        {
            "barcode": "171136329",
            "dpc": "03031202001",
            "name": "ទារ៍ សារ៉ាត់"
        },
        {
            "barcode": "171136330",
            "dpc": "03031202101",
            "name": "វែង ឃុន"
        },
        {
            "barcode": "171136331",
            "dpc": "03031202201",
            "name": "ទឹម ជូនេត្រ្ត"
        },
        {
            "barcode": "171136332",
            "dpc": "03031202301",
            "name": "សុខ ហេង"
        },
        {
            "barcode": "171136333",
            "dpc": "03031202401",
            "name": "ឆេង ហួត"
        },
        {
            "barcode": "171136334",
            "dpc": "03031202501",
            "name": "នូ ស៊ីធឿន"
        },
        {
            "barcode": "171136335",
            "dpc": "03031202601",
            "name": "ជា គឹមហង់"
        },
        {
            "barcode": "171136336",
            "dpc": "03031202701",
            "name": "យិន សុខេន"
        },
        {
            "barcode": "171136337",
            "dpc": "03031202801",
            "name": "សេង ហួរ"
        },
        {
            "barcode": "171136338",
            "dpc": "03031202901",
            "name": "ចៅ ឈឹមភីរម្យ"
        },
        {
            "barcode": "171136339",
            "dpc": "03031203001",
            "name": "ព្រំ ដាយ"
        },
        {
            "barcode": "171136340",
            "dpc": "03031203101",
            "name": "ម៉ឹន សារី"
        },
        {
            "barcode": "171136341",
            "dpc": "03031203201",
            "name": "ប៉ាន់ ផង់"
        },
        {
            "barcode": "171136342",
            "dpc": "03031203301",
            "name": "ជា គីញឈួង"
        },
        {
            "barcode": "171136343",
            "dpc": "03031203401",
            "name": "ជា វ៉ៃ"
        },
        {
            "barcode": "171136344",
            "dpc": "03031203501",
            "name": "ឡាំ  ឆវី"
        },
        {
            "barcode": "171136345",
            "dpc": "03031203601",
            "name": "ប៉ែន  នាង"
        },
        {
            "barcode": "171136346",
            "dpc": "03031203701",
            "name": "ឆាន   សូ"
        },
        {
            "barcode": "171136347",
            "dpc": "03031203801",
            "name": "ឈិន   ង៉ាម"
        },
        {
            "barcode": "171136348",
            "dpc": "03031203901",
            "name": "ចាន់  ប្រម"
        },
        {
            "barcode": "171136349",
            "dpc": "03031204001",
            "name": "គឹម  សាយ"
        },
        {
            "barcode": "171136350",
            "dpc": "03031204101",
            "name": "គុណ  ភាព"
        },
        {
            "barcode": "171136351",
            "dpc": "03031204201",
            "name": "ឡេង  រ័ត្ន"
        },
        {
            "barcode": "171136352",
            "dpc": "03031204301",
            "name": "មៀន  សុផល"
        },
        {
            "barcode": "171136353",
            "dpc": "03031204401",
            "name": "មាស   ធន"
        },
        {
            "barcode": "171136354",
            "dpc": "03031204501",
            "name": "ឱក  ឈៀក"
        },
        {
            "barcode": "171136355",
            "dpc": "03031204601",
            "name": "គួយ  គឹមស៊ន"
        },
        {
            "barcode": "171136356",
            "dpc": "03031204701",
            "name": "ជុំ  សំណាង"
        },
        {
            "barcode": "171136357",
            "dpc": "03031205101",
            "name": "សុខ  ឡាវ"
        },
        {
            "barcode": "171136358",
            "dpc": "03031205201",
            "name": "អ៊ុក   ហេង"
        },
        {
            "barcode": "171136359",
            "dpc": "03031205301",
            "name": "សយ  សារិក"
        },
        {
            "barcode": "171136360",
            "dpc": "03031205401",
            "name": "ទុចូ  ម៉ៅ"
        },
        {
            "barcode": "171136361",
            "dpc": "03031205601",
            "name": "ប៊ីន  សារ៉ន"
        },
        {
            "barcode": "171136362",
            "dpc": "03031205501",
            "name": "ប៉េង  តាំងហៃ"
        },
        {
            "barcode": "171136363",
            "dpc": "03031205701",
            "name": "ម៉ី  សុវណ្ណ"
        },
        {
            "barcode": "171136364",
            "dpc": "03031205801",
            "name": "ប៉ាន់  វណ្ណះ"
        },
        {
            "barcode": "171136365",
            "dpc": "03031205901",
            "name": "ប៉ិញ ច័ន្ទឧត្តម"
        },
        {
            "barcode": "171136366",
            "dpc": "03031206001",
            "name": "ឆន  ហួត"
        },
        {
            "barcode": "171136367",
            "dpc": "03031206101",
            "name": "យឹម  មាន"
        },
        {
            "barcode": "171136368",
            "dpc": "03031206201",
            "name": "ជូ  ម៉ាឡែន"
        },
        {
            "barcode": "171136369",
            "dpc": "03031206301",
            "name": "ណៃ  គឹមវ៉ិត"
        },
        {
            "barcode": "171136370",
            "dpc": "03031206401",
            "name": "សុខ  ឡាវ"
        },
        {
            "barcode": "171136371",
            "dpc": "03031206501",
            "name": "សេង  សុភាព"
        },
        {
            "barcode": "171136372",
            "dpc": "03031206601",
            "name": "សាន  គឹម  ស៊ត"
        },
        {
            "barcode": "171136373",
            "dpc": "03031206801",
            "name": "គង់  ឈឿន"
        },
        {
            "barcode": "171136374",
            "dpc": "03031206901",
            "name": "អង្កការ ស៊ី.អ.អែស"
        },
        {
            "barcode": "171136375",
            "dpc": "03031207001",
            "name": "ភោគ  សារ័ត្ន"
        },
        {
            "barcode": "171136376",
            "dpc": "03031207101",
            "name": "គុយ  វិចិត្រ"
        },
        {
            "barcode": "171136377",
            "dpc": "03031207201",
            "name": "គុយ  ម៉េង"
        },
        {
            "barcode": "171136378",
            "dpc": "03031207701",
            "name": "គី  សេរី"
        },
        {
            "barcode": "171136379",
            "dpc": "03031207801",
            "name": "ទិត  សុខ"
        },
        {
            "barcode": "171136380",
            "dpc": "03031207901",
            "name": "លី  ហួរ"
        },
        {
            "barcode": "171136381",
            "dpc": "03031208001",
            "name": "ហេង  ភួន"
        },
        {
            "barcode": "171136382",
            "dpc": "03031208101",
            "name": "វ៉ាន់  ញ៉ាញ់"
        },
        {
            "barcode": "171136383",
            "dpc": "03031208201",
            "name": "តែ   សុផាន់ណា"
        },
        {
            "barcode": "171136384",
            "dpc": "03031208301",
            "name": "ឈុន ចិន្តា"
        },
        {
            "barcode": "171136385",
            "dpc": "03031208401",
            "name": "អ៊ឹង  សេង"
        },
        {
            "barcode": "171136386",
            "dpc": "03031208501",
            "name": "ស៊ុយ  លីម"
        },
        {
            "barcode": "171136387",
            "dpc": "03031208601",
            "name": "ស្រី  សឹង"
        },
        {
            "barcode": "171136388",
            "dpc": "03031208701",
            "name": "ឌី  យ៉ុន"
        },
        {
            "barcode": "171136389",
            "dpc": "03031208801",
            "name": "លឹម  សុខគី"
        },
        {
            "barcode": "171136390",
            "dpc": "03031208901",
            "name": "ទេព  សាកន"
        },
        {
            "barcode": "171136391",
            "dpc": "03031209101",
            "name": "លី  ណាំ"
        },
        {
            "barcode": "171136392",
            "dpc": "03031209201",
            "name": "រស់  សុខុម"
        },
        {
            "barcode": "171136393",
            "dpc": "03031209301",
            "name": "ឆាង  ហេង"
        },
        {
            "barcode": "171136394",
            "dpc": "03031209401",
            "name": "រស់ សុផុន"
        },
        {
            "barcode": "171136395",
            "dpc": "03031209501",
            "name": "អាំឡង់  ឌី"
        },
        {
            "barcode": "171136396",
            "dpc": "03031209601",
            "name": "ខ្លូត  រិទ្ធ"
        },
        {
            "barcode": "171136397",
            "dpc": "03031209701",
            "name": "ញឹម ហុង"
        },
        {
            "barcode": "171136398",
            "dpc": "03031209801",
            "name": "អ៊ឹង  សេងទិន"
        },
        {
            "barcode": "171136399",
            "dpc": "03031209901",
            "name": "ម៉ូវ  សម្បត្តិ"
        },
        {
            "barcode": "171136400",
            "dpc": "03031210001",
            "name": "តូម  អូន"
        },
        {
            "barcode": "171136401",
            "dpc": "03031210101",
            "name": "សា  កញ្ញា"
        },
        {
            "barcode": "171136402",
            "dpc": "03031210201",
            "name": "ខេង  សុខឡាយ"
        },
        {
            "barcode": "171136403",
            "dpc": "03031210301",
            "name": "ប្រាក់  ថុង"
        },
        {
            "barcode": "171136404",
            "dpc": "03031210401",
            "name": "គ្រុយ  មុយហ្គិច"
        },
        {
            "barcode": "171136405",
            "dpc": "03031210501",
            "name": "ច្រាយ  ប៊ុន"
        },
        {
            "barcode": "171136406",
            "dpc": "03031210601",
            "name": "ង៉ែត  តុន"
        },
        {
            "barcode": "171136407",
            "dpc": "03031210701",
            "name": "សំ  លីង"
        },
        {
            "barcode": "171136408",
            "dpc": "03031210801",
            "name": "សាន  គឹមស៊ត"
        },
        {
            "barcode": "171136409",
            "dpc": "03031210901",
            "name": "តុក គឹមស៊្រុន"
        },
        {
            "barcode": "171136410",
            "dpc": "03031211001",
            "name": "លន់   សំប៊ី"
        },
        {
            "barcode": "171136411",
            "dpc": "03031211101",
            "name": "ស៊ឹម  សល្យ"
        },
        {
            "barcode": "171136412",
            "dpc": "03031211201",
            "name": "ជា  សាបឿន"
        },
        {
            "barcode": "171136413",
            "dpc": "03031211301",
            "name": "យូរ  ចន្ថា"
        },
        {
            "barcode": "171136414",
            "dpc": "03031211401",
            "name": "ស្មី  រដ្ឋា"
        },
        {
            "barcode": "171136415",
            "dpc": "03031211501",
            "name": "អ៊ុក  វណ្ណា"
        },
        {
            "barcode": "171136416",
            "dpc": "03031211601",
            "name": "ពិន  ណារ៉េត"
        },
        {
            "barcode": "171136417",
            "dpc": "03031211701",
            "name": "សៅ  តាប់"
        },
        {
            "barcode": "171136418",
            "dpc": "03031214101",
            "name": "ជា សារិន"
        },
        {
            "barcode": "171136419",
            "dpc": "03031214301",
            "name": "អន ថាវរិទ្ធ"
        },
        {
            "barcode": "171136420",
            "dpc": "03031214501",
            "name": "វង្ស ឃុតឈឿង"
        },
        {
            "barcode": "171136421",
            "dpc": "03031214601",
            "name": "សេង ហ៊ាង"
        },
        {
            "barcode": "171136422",
            "dpc": "03031214701",
            "name": "សេង សៀហៃ ១"
        },
        {
            "barcode": "171136423",
            "dpc": "03031214801",
            "name": "សេង សៀហៃ ២"
        },
        {
            "barcode": "171136424",
            "dpc": "03031214901",
            "name": "មាស សាម៉ុន"
        },
        {
            "barcode": "171136425",
            "dpc": "03031215001",
            "name": "ខៀវ សេងលី"
        },
        {
            "barcode": "171136426",
            "dpc": "03031215201",
            "name": "ជំនឿ សិច្ចរ៉ា ១"
        },
        {
            "barcode": "171136427",
            "dpc": "03031215301",
            "name": "ជំនឿ សិច្ចរ៉ា ២"
        },
        {
            "barcode": "171136428",
            "dpc": "03031215401",
            "name": "ថាច់ សែ"
        },
        {
            "barcode": "171136429",
            "dpc": "03031215501",
            "name": "ឌឹម វីរោចន៍"
        },
        {
            "barcode": "171136430",
            "dpc": "03031215601",
            "name": "ពុំ សារិក"
        },
        {
            "barcode": "171136431",
            "dpc": "03031215701",
            "name": "ឈឹម គ្រីហ្វុង"
        },
        {
            "barcode": "171136432",
            "dpc": "03031215801",
            "name": "តេង ហេង"
        },
        {
            "barcode": "171136433",
            "dpc": "03031215901",
            "name": "អ៊ុក គឹមទី"
        },
        {
            "barcode": "171136434",
            "dpc": "03031216001",
            "name": "កណ្តៀង ជឿន"
        },
        {
            "barcode": "171136435",
            "dpc": "03031216101",
            "name": "ព្រំ ធៀន"
        },
        {
            "barcode": "171136436",
            "dpc": "03031216201",
            "name": "លឹម ហ៊ុន"
        },
        {
            "barcode": "171136437",
            "dpc": "03031216301",
            "name": "អ៊ឹម លាភ"
        },
        {
            "barcode": "171136438",
            "dpc": "03031216401",
            "name": "វង្ស គឹមហ៊ាង"
        },
        {
            "barcode": "171136439",
            "dpc": "03031216501",
            "name": "អ៊ិន ញឹម"
        },
        {
            "barcode": "171136440",
            "dpc": "03031216701",
            "name": "សួន  សារុន"
        },
        {
            "barcode": "171136441",
            "dpc": "03031216801",
            "name": "សៀង  ហ៊ាង"
        },
        {
            "barcode": "171136442",
            "dpc": "03031216901",
            "name": "ឯល  វ៉ាន់"
        },
        {
            "barcode": "171136443",
            "dpc": "03031217001",
            "name": "គី  ទិត"
        },
        {
            "barcode": "171136444",
            "dpc": "03031217101",
            "name": "អុំ  វណ្ណះ"
        },
        {
            "barcode": "171136445",
            "dpc": "03031217201",
            "name": "ឆេង  ទ្រី"
        },
        {
            "barcode": "171136446",
            "dpc": "03031217301",
            "name": "សុខ  ប៊ុនដារា"
        },
        {
            "barcode": "171136447",
            "dpc": "03031217401",
            "name": "ជូ អ៊ឹម"
        },
        {
            "barcode": "171136448",
            "dpc": "03031217501",
            "name": "ថូយ ទ្រី"
        },
        {
            "barcode": "171136449",
            "dpc": "03031217601",
            "name": "ខៀវ ភីរុណ"
        },
        {
            "barcode": "171136450",
            "dpc": "03031217701",
            "name": "តន់ សាវ៉េត"
        },
        {
            "barcode": "171136451",
            "dpc": "03031217801",
            "name": "ទិត្យ សុផល"
        },
        {
            "barcode": "171136452",
            "dpc": "03031217901",
            "name": "ឃៀន ខឿម"
        },
        {
            "barcode": "171136453",
            "dpc": "03031218001",
            "name": "ម៉ែន ទីន"
        },
        {
            "barcode": "171136454",
            "dpc": "03031218101",
            "name": "គឹម ទុយ"
        },
        {
            "barcode": "171136455",
            "dpc": "03031218201",
            "name": "ម៉ៅ សាម៉េត"
        },
        {
            "barcode": "171136456",
            "dpc": "03031218301",
            "name": "ប៊ុន ប៊ុនធឿន"
        },
        {
            "barcode": "171136457",
            "dpc": "03031218401",
            "name": "រៀន វីវៈ"
        },
        {
            "barcode": "171136458",
            "dpc": "03031218501",
            "name": "ជំនឿ សិច្ចរ៉ា"
        },
        {
            "barcode": "171136459",
            "dpc": "03031218601",
            "name": "ឡា ឡាប"
        },
        {
            "barcode": "171136460",
            "dpc": "03031218801",
            "name": "អ៊ុំ ខេមរា"
        },
        {
            "barcode": "171136461",
            "dpc": "03031218901",
            "name": "សេង សុភរា"
        },
        {
            "barcode": "171136462",
            "dpc": "03031219001",
            "name": "លន់ ម៉ាណែត"
        },
        {
            "barcode": "171136463",
            "dpc": "03031219101",
            "name": "ទិត្យ ឈៀង"
        },
        {
            "barcode": "171136464",
            "dpc": "03031219201",
            "name": "ជឹម សុខឡាយ"
        },
        {
            "barcode": "171136465",
            "dpc": "03031219301",
            "name": "គង់ ស្រីនាង"
        },
        {
            "barcode": "171136466",
            "dpc": "03031216601",
            "name": "ជូន រិទ្ធី"
        },
        {
            "barcode": "171136467",
            "dpc": "03031219401",
            "name": "មាស ឡូញ ២"
        },
        {
            "barcode": "171136468",
            "dpc": "03031219501",
            "name": "សួស សុខ"
        },
        {
            "barcode": "171136469",
            "dpc": "03031219601",
            "name": "សាក់ ចំរើន"
        },
        {
            "barcode": "171136470",
            "dpc": "03031219701",
            "name": "មាស ឡូញ ១"
        },
        {
            "barcode": "171136471",
            "dpc": "03031219801",
            "name": "ហ៊ិន ពេញ"
        },
        {
            "barcode": "171136472",
            "dpc": "03031219901",
            "name": "ឃឿម គឹមហោ"
        },
        {
            "barcode": "171136473",
            "dpc": "03031231701",
            "name": "ប៉ែន ពិរោះ"
        },
        {
            "barcode": "171136474",
            "dpc": "03031204901",
            "name": "កេតុ សឿ"
        },
        {
            "barcode": "171136475",
            "dpc": "03031247901",
            "name": "សៅ សោភ័ណ្ឌ"
        },
        {
            "barcode": "171136476",
            "dpc": "03031247801",
            "name": "គឹម បឹង"
        },
        {
            "barcode": "171136477",
            "dpc": "03031247601",
            "name": "សួន សុខេង"
        },
        {
            "barcode": "171136478",
            "dpc": "03031247501",
            "name": "អ៊ុក ចិប"
        },
        {
            "barcode": "171136479",
            "dpc": "03031247401",
            "name": "ង៉ែត បុប្ផាចាន់"
        },
        {
            "barcode": "171136480",
            "dpc": "03031247301",
            "name": "អ៊ុក បូរ៉ា"
        },
        {
            "barcode": "171136481",
            "dpc": "03031226601",
            "name": "ផល ម៉ុន"
        },
        {
            "barcode": "171136482",
            "dpc": "03031226701",
            "name": "មួង ស៊ុនហេង ១"
        },
        {
            "barcode": "171136483",
            "dpc": "03031226801",
            "name": "រឿន សោភ័ណ្ឌ"
        },
        {
            "barcode": "171136484",
            "dpc": "03031226901",
            "name": "គុយ សុខ"
        },
        {
            "barcode": "171136485",
            "dpc": "03031227001",
            "name": "ដួង សុខសារិន"
        },
        {
            "barcode": "171136486",
            "dpc": "03031227101",
            "name": "ម៉ា រ៉ុន"
        },
        {
            "barcode": "171136487",
            "dpc": "03031227201",
            "name": "សុខ ឈឿន"
        },
        {
            "barcode": "171136488",
            "dpc": "03031227301",
            "name": "អាត់ ខែម"
        },
        {
            "barcode": "171136489",
            "dpc": "03031227401",
            "name": "លឹម សុខវ៉ាន់"
        },
        {
            "barcode": "171136490",
            "dpc": "03031227501",
            "name": "យ៉ាត គឹមលិន"
        },
        {
            "barcode": "171136491",
            "dpc": "03031227601",
            "name": "ញ៉ុញ សាណុំ"
        },
        {
            "barcode": "171136492",
            "dpc": "03031227801",
            "name": "មឿន ឆ័យ"
        },
        {
            "barcode": "171136493",
            "dpc": "03031245201",
            "name": "គង់ សាន"
        },
        {
            "barcode": "171136494",
            "dpc": "03031227901",
            "name": "ភុំ វ៉ារ៉ែន"
        },
        {
            "barcode": "171136495",
            "dpc": "03031228001",
            "name": "ជួង ខ្វា"
        },
        {
            "barcode": "171136496",
            "dpc": "03031228101",
            "name": "គឹម លាង"
        },
        {
            "barcode": "171136497",
            "dpc": "03031228201",
            "name": "ពិន ជុំ"
        },
        {
            "barcode": "171136498",
            "dpc": "03031228301",
            "name": "យ៉ត ឆាត់"
        },
        {
            "barcode": "171136499",
            "dpc": "03031228401",
            "name": "វង់ យីវគីញ"
        },
        {
            "barcode": "171136500",
            "dpc": "03031228501",
            "name": "វ៉ន ឈុនលី"
        },
        {
            "barcode": "171136501",
            "dpc": "03031228601",
            "name": "ហ៊ី ឈុន"
        },
        {
            "barcode": "171136502",
            "dpc": "03031228701",
            "name": "ហេង ពៅ"
        },
        {
            "barcode": "171136503",
            "dpc": "03031228801",
            "name": "ឡោ យក់ លន់"
        },
        {
            "barcode": "171136504",
            "dpc": "03031228901",
            "name": "តេង លឹម"
        },
        {
            "barcode": "171136505",
            "dpc": "03031229001",
            "name": "មួង ស៊ុនហេង ២"
        },
        {
            "barcode": "171136506",
            "dpc": "03031229101",
            "name": "ប៉ោ ស៊ីថា"
        },
        {
            "barcode": "171136507",
            "dpc": "03031230701",
            "name": "សុខ ឡាវ"
        },
        {
            "barcode": "171136508",
            "dpc": "03031230601",
            "name": "សេង កុសល់"
        },
        {
            "barcode": "171136509",
            "dpc": "03031230501",
            "name": "សោ គឹមសាន"
        },
        {
            "barcode": "171136510",
            "dpc": "03031230401",
            "name": "មឹក ហួយ"
        },
        {
            "barcode": "171136511",
            "dpc": "03031230301",
            "name": "រី ដេត"
        },
        {
            "barcode": "171136512",
            "dpc": "03031230201",
            "name": "អ៊ុក ចាប"
        },
        {
            "barcode": "171136513",
            "dpc": "03031230101",
            "name": "ម៉ោញ សារ៉ាត់"
        },
        {
            "barcode": "171136514",
            "dpc": "03031230001",
            "name": "វ៉ាន់ ម៉ានី"
        },
        {
            "barcode": "171136515",
            "dpc": "03031229801",
            "name": "ហួយ កុសល់"
        },
        {
            "barcode": "171136516",
            "dpc": "03031229701",
            "name": "ជៀវ វន"
        },
        {
            "barcode": "171136517",
            "dpc": "03031229601",
            "name": "ដាំ​ ស្វាង"
        },
        {
            "barcode": "171136518",
            "dpc": "03031229501",
            "name": "ឌី ញ៉ុន"
        },
        {
            "barcode": "171136519",
            "dpc": "03031229201",
            "name": "សយ សុផល"
        },
        {
            "barcode": "171136520",
            "dpc": "03031232601",
            "name": "តាំង ស៊ុនហួរ"
        },
        {
            "barcode": "171136521",
            "dpc": "03031232501",
            "name": "ខៀវ ស៊ន"
        },
        {
            "barcode": "171136522",
            "dpc": "03031232401",
            "name": "លី គឹមសាន"
        },
        {
            "barcode": "171136523",
            "dpc": "03031232301",
            "name": "ឃុត សាអុំ"
        },
        {
            "barcode": "171136524",
            "dpc": "03031232201",
            "name": "វង់ ថាវ៉ន"
        },
        {
            "barcode": "171136525",
            "dpc": "03031232101",
            "name": "គឹម សារ៉ន"
        },
        {
            "barcode": "171136526",
            "dpc": "03031232001",
            "name": "ឈួន គឹមឈន"
        },
        {
            "barcode": "171136527",
            "dpc": "03031231901",
            "name": "យប់ វង់"
        },
        {
            "barcode": "171136528",
            "dpc": "03031231801",
            "name": "អាន ថាវី"
        },
        {
            "barcode": "171136529",
            "dpc": "03031231601",
            "name": "កង យេត"
        },
        {
            "barcode": "171136530",
            "dpc": "03031231501",
            "name": "ណៃ គឹមសុន"
        },
        {
            "barcode": "171136531",
            "dpc": "03031231401",
            "name": "រាជ ថេត"
        },
        {
            "barcode": "171136532",
            "dpc": "03031231301",
            "name": "ជូរ សុខហេង"
        },
        {
            "barcode": "171136533",
            "dpc": "03031231201",
            "name": "តាន់ សុខា"
        },
        {
            "barcode": "171136534",
            "dpc": "03031231101",
            "name": "ខ្លួត បឿន"
        },
        {
            "barcode": "171136535",
            "dpc": "03031231001",
            "name": "តោ ជុន"
        },
        {
            "barcode": "171136536",
            "dpc": "03031230901",
            "name": "ឌួង សំអុល"
        },
        {
            "barcode": "171136537",
            "dpc": "03031230801",
            "name": "ពុធ សំអាន"
        },
        {
            "barcode": "171136538",
            "dpc": "03031213801",
            "name": "សៀង សុវឌ្ឍនា ៣"
        },
        {
            "barcode": "171136539",
            "dpc": "03031213901",
            "name": "សៀ ស៊ិន"
        },
        {
            "barcode": "171136540",
            "dpc": "03031213701",
            "name": "សៀង សុវឌ្ឍនា ២"
        },
        {
            "barcode": "171136541",
            "dpc": "03031213501",
            "name": "ជូ ផល្លា"
        },
        {
            "barcode": "171136542",
            "dpc": "03031213401",
            "name": "យក់ ហ៊ុន"
        },
        {
            "barcode": "171136543",
            "dpc": "03031213301",
            "name": "យាំ យ៉េត ២"
        },
        {
            "barcode": "171136544",
            "dpc": "03031213201",
            "name": "យាំ យ៉េត ១"
        },
        {
            "barcode": "171136545",
            "dpc": "03031213101",
            "name": "អៀម ម៉េងគង់"
        },
        {
            "barcode": "171136546",
            "dpc": "03031213001",
            "name": "សយ ស្រ៊ុន"
        },
        {
            "barcode": "171136547",
            "dpc": "03031212901",
            "name": "សេង ហឹយ"
        },
        {
            "barcode": "171136548",
            "dpc": "03031212801",
            "name": "ហ៊ីន ភួងណារី"
        },
        {
            "barcode": "171136549",
            "dpc": "03031212701",
            "name": "ចាន់ ផារិន"
        },
        {
            "barcode": "171136550",
            "dpc": "03031212601",
            "name": "អ៊ុំ ចិត្រ"
        },
        {
            "barcode": "171136551",
            "dpc": "03031212501",
            "name": "ភោគ រស្មី"
        },
        {
            "barcode": "171136552",
            "dpc": "03031212401",
            "name": "ទេស កៅ"
        },
        {
            "barcode": "171136553",
            "dpc": "03031212301",
            "name": "ជុំ ស៊ីថា"
        },
        {
            "barcode": "171136554",
            "dpc": "03031212201",
            "name": "ឌឿ សង្វាវ៉ាន"
        },
        {
            "barcode": "171136555",
            "dpc": "03031212101",
            "name": "រួម រុន"
        },
        {
            "barcode": "171136556",
            "dpc": "03031235501",
            "name": "វិញ យ៉េន"
        },
        {
            "barcode": "171136557",
            "dpc": "03031235601",
            "name": "ហុង ងួន"
        },
        {
            "barcode": "171136558",
            "dpc": "03031235401",
            "name": "ឡុង វ៉ាន់នី"
        },
        {
            "barcode": "171136559",
            "dpc": "03031235301",
            "name": "សំ វីឡុង"
        },
        {
            "barcode": "171136560",
            "dpc": "03031234301",
            "name": "ទូច មុំ"
        },
        {
            "barcode": "171136561",
            "dpc": "03031234201",
            "name": "ភោគ ឡឹក"
        },
        {
            "barcode": "171136562",
            "dpc": "03031234101",
            "name": "សេង គុណ"
        },
        {
            "barcode": "171136563",
            "dpc": "03031234001",
            "name": "និល ប៊ុនណ្ណា"
        },
        {
            "barcode": "171136564",
            "dpc": "03031233901",
            "name": "ហុក សុខា"
        },
        {
            "barcode": "171136565",
            "dpc": "03031233701",
            "name": "លាង ស្រេង"
        },
        {
            "barcode": "171136566",
            "dpc": "03031234601",
            "name": "ហែម ទុំ"
        },
        {
            "barcode": "171136567",
            "dpc": "03031234701",
            "name": "ស៊ឹម វ៉ាន់"
        },
        {
            "barcode": "171136568",
            "dpc": "03031234801",
            "name": "លី សារុំ"
        },
        {
            "barcode": "171136569",
            "dpc": "03031234901",
            "name": "សេន សារឿន"
        },
        {
            "barcode": "171136570",
            "dpc": "03031235001",
            "name": "ជា សម្បត្តិ"
        },
        {
            "barcode": "171136571",
            "dpc": "03031235101",
            "name": "កង ណារីន"
        },
        {
            "barcode": "171136572",
            "dpc": "03031235201",
            "name": "នៃ ច័ន្ទថន"
        },
        {
            "barcode": "171136573",
            "dpc": "03031233601",
            "name": "លន់ ឡៃមិញ"
        },
        {
            "barcode": "171136574",
            "dpc": "03031233401",
            "name": "ពេជ្រ បុប្ផា"
        },
        {
            "barcode": "171136575",
            "dpc": "03031233301",
            "name": "រស់ ឃ្លោក"
        },
        {
            "barcode": "171136576",
            "dpc": "03031233201",
            "name": "ម៉ៅ ផល្លា"
        },
        {
            "barcode": "171136577",
            "dpc": "03031233101",
            "name": "ទុយ ប៊ុនរ៉ាត់"
        },
        {
            "barcode": "171136578",
            "dpc": "03031232901",
            "name": "ថន នី"
        },
        {
            "barcode": "171136579",
            "dpc": "03031232801",
            "name": "លាវ សុជាតិ"
        },
        {
            "barcode": "171136580",
            "dpc": "03031211901",
            "name": "ឃឹម សារ៉ន"
        },
        {
            "barcode": "171136581",
            "dpc": "03031232701",
            "name": "សេង ភី"
        },
        {
            "barcode": "171136582",
            "dpc": "03031200101",
            "name": "ព្រាប   វន"
        },
        {
            "barcode": "171136583",
            "dpc": "03031205001",
            "name": "ខៀវ  សំបូរ"
        },
        {
            "barcode": "171136584",
            "dpc": "03031212001",
            "name": "គណៈបក្សប្រជាជន"
        },
        {
            "barcode": "171136585",
            "dpc": "03031220101",
            "name": "ចៅ  ហ្វឹង (៥៥៥ )"
        },
        {
            "barcode": "171136586",
            "dpc": "03031220201",
            "name": "ពេជ្រ  ណាឡុង"
        },
        {
            "barcode": "171136587",
            "dpc": "03031220301",
            "name": "ឡុង  ប៊ុនហេង"
        },
        {
            "barcode": "171136588",
            "dpc": "03031220401",
            "name": "គឹម  ស៊្រុន"
        },
        {
            "barcode": "171136589",
            "dpc": "03031222701",
            "name": "ឯក  ជិវ័ន ១"
        },
        {
            "barcode": "171136590",
            "dpc": "03031226301",
            "name": "បែន  ភួង"
        },
        {
            "barcode": "171136591",
            "dpc": "03031233001",
            "name": "ឡាច  ប៊ុនថាច"
        },
        {
            "barcode": "171136592",
            "dpc": "03031234501",
            "name": "ផាត់  មុំ"
        },
        {
            "barcode": "171136593",
            "dpc": "03031246501",
            "name": "ឡុង  វ៉ាន់រ៉ា"
        },
        {
            "barcode": "171136594",
            "dpc": "03031221301",
            "name": "តូច  ស៊ិនណារ៉ា"
        },
        {
            "barcode": "171136595",
            "dpc": "03031221401",
            "name": "វែង  ស៊្រុន"
        },
        {
            "barcode": "171136596",
            "dpc": "03031221501",
            "name": "ណុប  សាមិ"
        },
        {
            "barcode": "171136597",
            "dpc": "03031221601",
            "name": "ឡាយ  គឹមហៀក"
        },
        {
            "barcode": "171136598",
            "dpc": "03031221701",
            "name": "យូ  គង់"
        },
        {
            "barcode": "171136599",
            "dpc": "03031221801",
            "name": "ផាត់  តុង"
        },
        {
            "barcode": "171136600",
            "dpc": "03031221901",
            "name": "លឿង  ប៊ួយ"
        },
        {
            "barcode": "171136601",
            "dpc": "03031225801",
            "name": "យោង  យិន"
        },
        {
            "barcode": "171136602",
            "dpc": "03031226001",
            "name": "ពឹង  គឹមហួរ"
        },
        {
            "barcode": "171136603",
            "dpc": "03031226101",
            "name": "យ៉ាន់  លឿម"
        },
        {
            "barcode": "171136604",
            "dpc": "03031226201",
            "name": "ថង  សៀង"
        },
        {
            "barcode": "171136605",
            "dpc": "03031226401",
            "name": "ចៅ  វៃឈូ"
        },
        {
            "barcode": "171136606",
            "dpc": "03031248001",
            "name": "រឿន ខុន"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
