let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171134031",
            "dpc": "03013148001",
            "name": "សុខ សារ៉ាត់"
        },
        {
            "barcode": "171134032",
            "dpc": "03013147901",
            "name": "ផេង សាវឹង"
        },
        {
            "barcode": "171134033",
            "dpc": "03013147801",
            "name": "លី សាឡែន"
        },
        {
            "barcode": "171134034",
            "dpc": "03013147701",
            "name": "អៀវ សារឿន"
        },
        {
            "barcode": "171134035",
            "dpc": "03013147601",
            "name": "ទេព  ចាន់ដារ៉ា"
        },
        {
            "barcode": "171134036",
            "dpc": "03013147501",
            "name": "មឿត សុគន្ធ"
        },
        {
            "barcode": "171134037",
            "dpc": "03013147401",
            "name": "សាយ  ចំនាន"
        },
        {
            "barcode": "171134038",
            "dpc": "03013147101",
            "name": "តូ ផានិត"
        },
        {
            "barcode": "171134039",
            "dpc": "03013147001",
            "name": "ទុំ  ខ្លេត"
        },
        {
            "barcode": "171134040",
            "dpc": "03013146901",
            "name": "ទេព ជឿន"
        },
        {
            "barcode": "171134041",
            "dpc": "03013146801",
            "name": "ជួន សារឿម"
        },
        {
            "barcode": "171134042",
            "dpc": "03013146701",
            "name": "វ៉ាន  វ៉ុន"
        },
        {
            "barcode": "171134043",
            "dpc": "03013146601",
            "name": "សឿ  សុភ័ណ"
        },
        {
            "barcode": "171134044",
            "dpc": "03013146501",
            "name": "សឿ សុភា"
        },
        {
            "barcode": "171134045",
            "dpc": "03013146301",
            "name": "ឈួយ  ទឺ"
        },
        {
            "barcode": "171134046",
            "dpc": "03013146001",
            "name": "សាន្ត សារ៉ា"
        },
        {
            "barcode": "171134047",
            "dpc": "03013145901",
            "name": "វ៉ាន់ ង៉ែត"
        },
        {
            "barcode": "171134048",
            "dpc": "03013145801",
            "name": "ឆាំ  សារ៉ា"
        },
        {
            "barcode": "171134049",
            "dpc": "03013145701",
            "name": "រឹម សារុំ"
        },
        {
            "barcode": "171134050",
            "dpc": "03013145601",
            "name": "វ៉ុង សារុន"
        },
        {
            "barcode": "171134051",
            "dpc": "03013145501",
            "name": "រឿន រើក"
        },
        {
            "barcode": "171134052",
            "dpc": "03013145401",
            "name": "តន សុខា"
        },
        {
            "barcode": "171134053",
            "dpc": "03013145301",
            "name": "វិន សុធាវី"
        },
        {
            "barcode": "171134054",
            "dpc": "03013145201",
            "name": "ទេស សារឿន"
        },
        {
            "barcode": "171134055",
            "dpc": "03013145101",
            "name": "ឡាំ ណើយ"
        },
        {
            "barcode": "171134056",
            "dpc": "03013145001",
            "name": "យាំ ចាន់ត្រា"
        },
        {
            "barcode": "171134057",
            "dpc": "03013144901",
            "name": "នង ចាន់ថាល់"
        },
        {
            "barcode": "171134058",
            "dpc": "03013144701",
            "name": "យ៉ត វុទ្ឋី"
        },
        {
            "barcode": "171134059",
            "dpc": "03013144601",
            "name": "យ៉ត សាវឿត១"
        },
        {
            "barcode": "171134060",
            "dpc": "03013144501",
            "name": "ឯក  ស្រីមុំ"
        },
        {
            "barcode": "171134061",
            "dpc": "03013144401",
            "name": "ទេព កុសល់"
        },
        {
            "barcode": "171134062",
            "dpc": "03013144301",
            "name": "ភួង សុនិតា"
        },
        {
            "barcode": "171134063",
            "dpc": "03013144201",
            "name": "ម៉ម សុខា"
        },
        {
            "barcode": "171134064",
            "dpc": "03013144101",
            "name": "ស្រី ចិន្តា"
        },
        {
            "barcode": "171134065",
            "dpc": "03013144001",
            "name": "សាញ់ កាំង"
        },
        {
            "barcode": "171134066",
            "dpc": "03013143901",
            "name": "អ៊ុន សុវណ្ណ"
        },
        {
            "barcode": "171134067",
            "dpc": "03013143801",
            "name": "នួន  វេន"
        },
        {
            "barcode": "171134068",
            "dpc": "03013143701",
            "name": "ប៉ែន សយ"
        },
        {
            "barcode": "171134069",
            "dpc": "03013143601",
            "name": "សាម រិទ្ឋ"
        },
        {
            "barcode": "171134070",
            "dpc": "03013143501",
            "name": "លក រ៉ា"
        },
        {
            "barcode": "171134071",
            "dpc": "03013143401",
            "name": "ធឿន  សេងហៃ"
        },
        {
            "barcode": "171134072",
            "dpc": "03013143301",
            "name": "ណឹប តាវ"
        },
        {
            "barcode": "171134073",
            "dpc": "03013143201",
            "name": "សុខ សាត់"
        },
        {
            "barcode": "171134074",
            "dpc": "03013143101",
            "name": "មិត្ត សំណាង"
        },
        {
            "barcode": "171134075",
            "dpc": "03013143001",
            "name": "មិត្ត  ឡៃហួយ"
        },
        {
            "barcode": "171134076",
            "dpc": "03013142901",
            "name": "វង្ស  ទូច"
        },
        {
            "barcode": "171134077",
            "dpc": "03013142801",
            "name": "ទុំ  ឈឿត"
        },
        {
            "barcode": "171134078",
            "dpc": "03013142701",
            "name": "ហ៊ុយ សំផន"
        },
        {
            "barcode": "171134079",
            "dpc": "03013142601",
            "name": "រិ ធាវី"
        },
        {
            "barcode": "171134080",
            "dpc": "03013142501",
            "name": "ស៊ាង សឿន"
        },
        {
            "barcode": "171134081",
            "dpc": "03013142401",
            "name": "គង់ ទុំ"
        },
        {
            "barcode": "171134082",
            "dpc": "03013142301",
            "name": "រីន វណ្ណារ័ត្ន"
        },
        {
            "barcode": "171134083",
            "dpc": "03013142201",
            "name": "ស៊ុន សុវណ្ណារិទ្ឋ"
        },
        {
            "barcode": "171134084",
            "dpc": "03013142101",
            "name": "ស្រី សុខឃាង"
        },
        {
            "barcode": "171134085",
            "dpc": "03013141901",
            "name": "វ៉ាន់ សាវី"
        },
        {
            "barcode": "171134086",
            "dpc": "03013141801",
            "name": "វ៉ាន់  ខូវ"
        },
        {
            "barcode": "171134087",
            "dpc": "03013141701",
            "name": "ស្រូច លឹម២"
        },
        {
            "barcode": "171134088",
            "dpc": "03013141601",
            "name": "កៅ  ចំរើន"
        },
        {
            "barcode": "171134089",
            "dpc": "03013141401",
            "name": "ឆាយ ឡូយ"
        },
        {
            "barcode": "171134090",
            "dpc": "03013141301",
            "name": "ណាំ រ៉ាវ័ន្ត"
        },
        {
            "barcode": "171134091",
            "dpc": "03013141201",
            "name": "ពៅ រី"
        },
        {
            "barcode": "171134092",
            "dpc": "03013141001",
            "name": "គុយ ឆោមរ័ត្ន"
        },
        {
            "barcode": "171134093",
            "dpc": "03013140801",
            "name": "ទុយ គី"
        },
        {
            "barcode": "171134094",
            "dpc": "03013140701",
            "name": "លីន ស៊ីណាត"
        },
        {
            "barcode": "171134095",
            "dpc": "03013140601",
            "name": "ឆុន វណ្ណឌឿន"
        },
        {
            "barcode": "171134096",
            "dpc": "03013140501",
            "name": "ស៊ូ  រឿន"
        },
        {
            "barcode": "171134097",
            "dpc": "03013140401",
            "name": "ផល ណាវី"
        },
        {
            "barcode": "171134098",
            "dpc": "03013140301",
            "name": "សេន  ផល្លា"
        },
        {
            "barcode": "171134099",
            "dpc": "03013140201",
            "name": "សុត ចន្ថា"
        },
        {
            "barcode": "171134100",
            "dpc": "03013140101",
            "name": "ហម ផារី"
        },
        {
            "barcode": "171134101",
            "dpc": "03013140001",
            "name": "លី លន់"
        },
        {
            "barcode": "171134102",
            "dpc": "03013139901",
            "name": "សៀវ មន្ថា"
        },
        {
            "barcode": "171134103",
            "dpc": "03013139801",
            "name": "គា  ធូន"
        },
        {
            "barcode": "171134104",
            "dpc": "03013139601",
            "name": "ជា ឆៃយ៉ា"
        },
        {
            "barcode": "171134105",
            "dpc": "03013139501",
            "name": "អ៊ន សារិទ្ឋិ"
        },
        {
            "barcode": "171134106",
            "dpc": "03013139401",
            "name": "ម៉ៅ  ថាន់"
        },
        {
            "barcode": "171134107",
            "dpc": "03013139201",
            "name": "អេង មួយហ៊ាក"
        },
        {
            "barcode": "171134108",
            "dpc": "03013139101",
            "name": "ម៉េង  សុផៃ"
        },
        {
            "barcode": "171134109",
            "dpc": "03013139001",
            "name": "ហួយ  គឹមឈរ"
        },
        {
            "barcode": "171134110",
            "dpc": "03013138901",
            "name": "ជា និស្ស័យ"
        },
        {
            "barcode": "171134111",
            "dpc": "03013138801",
            "name": "មួន  ម៉ាប់"
        },
        {
            "barcode": "171134112",
            "dpc": "03013138701",
            "name": "គា​​  ឡៃ"
        },
        {
            "barcode": "171134113",
            "dpc": "03013138601",
            "name": "ម៉ាន់  អ៊ុលឡាវី"
        },
        {
            "barcode": "171134114",
            "dpc": "03013138501",
            "name": "ម៉ាន់  អ៊ុំមី"
        },
        {
            "barcode": "171134115",
            "dpc": "03013138401",
            "name": "ងិន សុវណ្ណ"
        },
        {
            "barcode": "171134116",
            "dpc": "03013138201",
            "name": "សោម ឆាន់"
        },
        {
            "barcode": "171134117",
            "dpc": "03013138101",
            "name": "គ្រី  ហ៊ាង"
        },
        {
            "barcode": "171134118",
            "dpc": "03013138001",
            "name": "យ៉ុង  យ៉ាន់"
        },
        {
            "barcode": "171134119",
            "dpc": "03013137901",
            "name": "សេង  ចាន់"
        },
        {
            "barcode": "171134120",
            "dpc": "03013137801",
            "name": "ហ៊ីម  ឈួប"
        },
        {
            "barcode": "171134121",
            "dpc": "03013137701",
            "name": "ម៉  ឈៀប"
        },
        {
            "barcode": "171134122",
            "dpc": "03013137601",
            "name": "ជាំ  ចាន់"
        },
        {
            "barcode": "171134123",
            "dpc": "03013137501",
            "name": "ខែម  ខេន"
        },
        {
            "barcode": "171134124",
            "dpc": "03013137401",
            "name": "សោម មុនី"
        },
        {
            "barcode": "171134125",
            "dpc": "03013137301",
            "name": "ទូត រុំម្លាស់"
        },
        {
            "barcode": "171134126",
            "dpc": "03013137201",
            "name": "រុំ  វ៉ាន់ធី"
        },
        {
            "barcode": "171134127",
            "dpc": "03013137101",
            "name": "អ៊ិត  មាលា"
        },
        {
            "barcode": "171134128",
            "dpc": "03013137001",
            "name": "កោ  ចិត្ត្រា"
        },
        {
            "barcode": "171134129",
            "dpc": "03013136901",
            "name": "ប្រាក់ គីណា"
        },
        {
            "barcode": "171134130",
            "dpc": "03013136801",
            "name": "ហម  ប៊ុនរិទ្ឋ"
        },
        {
            "barcode": "171134131",
            "dpc": "03013136601",
            "name": "ឡុង  វឿត"
        },
        {
            "barcode": "171134132",
            "dpc": "03013136401",
            "name": "ប្រា កូណាល"
        },
        {
            "barcode": "171134133",
            "dpc": "03013136301",
            "name": "ថោង ប្រានី"
        },
        {
            "barcode": "171134134",
            "dpc": "03013136101",
            "name": "ឈួម"
        },
        {
            "barcode": "171134135",
            "dpc": "03013135901",
            "name": "សុខ  យ៉េត"
        },
        {
            "barcode": "171134136",
            "dpc": "03013135801",
            "name": "សៅ  សេក"
        },
        {
            "barcode": "171134137",
            "dpc": "03013135601",
            "name": "អ៊ិង  កុច"
        },
        {
            "barcode": "171134138",
            "dpc": "03013135501",
            "name": "ទេព  គឹមសា"
        },
        {
            "barcode": "171134139",
            "dpc": "03013135401",
            "name": "អ៊ុង  សុវណ្ណ"
        },
        {
            "barcode": "171134140",
            "dpc": "03013135301",
            "name": "ឡែម  ដូត"
        },
        {
            "barcode": "171134141",
            "dpc": "03013135201",
            "name": "សៅ  រ៉ា"
        },
        {
            "barcode": "171134142",
            "dpc": "03013135101",
            "name": "គង់  សម្ជស្ស"
        },
        {
            "barcode": "171134143",
            "dpc": "03013135001",
            "name": "អ៊ុក  សុផល"
        },
        {
            "barcode": "171134144",
            "dpc": "03013134901",
            "name": "ថុក  ហ៊ឺ"
        },
        {
            "barcode": "171134145",
            "dpc": "03013134801",
            "name": "សុទ្ថ  សុផារត្ន័"
        },
        {
            "barcode": "171134146",
            "dpc": "03013134701",
            "name": "ឈាង  ចន្ធូ"
        },
        {
            "barcode": "171134147",
            "dpc": "03013134601",
            "name": "ម៉ែន  បូរី"
        },
        {
            "barcode": "171134148",
            "dpc": "03013134501",
            "name": "ឡាច  វីរៈ"
        },
        {
            "barcode": "171134149",
            "dpc": "03013134401",
            "name": "ហេង  វណ្ណា"
        },
        {
            "barcode": "171134150",
            "dpc": "03013134301",
            "name": "ផន  ស្រីដា"
        },
        {
            "barcode": "171134151",
            "dpc": "03013134201",
            "name": "កិៈ  ចិន្តា"
        },
        {
            "barcode": "171134152",
            "dpc": "03013134001",
            "name": "ឈុន  ធី"
        },
        {
            "barcode": "171134153",
            "dpc": "03013133901",
            "name": "រ៉ន  សារ៉េន"
        },
        {
            "barcode": "171134154",
            "dpc": "03013133801",
            "name": "មិត្ត  ឆើន"
        },
        {
            "barcode": "171134155",
            "dpc": "03013133701",
            "name": "ប៊ុន  សាឃឹន"
        },
        {
            "barcode": "171134156",
            "dpc": "03013133601",
            "name": "ហែល  ហម"
        },
        {
            "barcode": "171134157",
            "dpc": "03013133501",
            "name": "ឈុន  ប៊ុនឈួង"
        },
        {
            "barcode": "171134158",
            "dpc": "03013133401",
            "name": "តុល  ចាប"
        },
        {
            "barcode": "171134159",
            "dpc": "03013133301",
            "name": "ចាន់  សិលា"
        },
        {
            "barcode": "171134160",
            "dpc": "03013133201",
            "name": "ព្រូ  ដា"
        },
        {
            "barcode": "171134161",
            "dpc": "03013133101",
            "name": "មាន  សុវណ្ណសូនី"
        },
        {
            "barcode": "171134162",
            "dpc": "03013133001",
            "name": "មាន សុវណ្ណធីតា"
        },
        {
            "barcode": "171134163",
            "dpc": "03013132901",
            "name": "សៀង យឹងខាន់"
        },
        {
            "barcode": "171134164",
            "dpc": "03013132801",
            "name": "រៀន  ហាប"
        },
        {
            "barcode": "171134165",
            "dpc": "03013132701",
            "name": "គឹម  រ៉ុរឿង"
        },
        {
            "barcode": "171134166",
            "dpc": "03013132601",
            "name": "សាន  ទូច"
        },
        {
            "barcode": "171134167",
            "dpc": "03013132501",
            "name": "ឈៀន  សុភាព"
        },
        {
            "barcode": "171134168",
            "dpc": "03013132401",
            "name": "ជា  សាវៀង"
        },
        {
            "barcode": "171134169",
            "dpc": "03013132301",
            "name": "វ័រ  វ៉ាត"
        },
        {
            "barcode": "171134170",
            "dpc": "03013132201",
            "name": "ទូត  កក្កដា"
        },
        {
            "barcode": "171134171",
            "dpc": "03013132101",
            "name": "ហ៊ត  ពឿត"
        },
        {
            "barcode": "171134172",
            "dpc": "03013132001",
            "name": "ជា  មឿត"
        },
        {
            "barcode": "171134173",
            "dpc": "03013131901",
            "name": "យ៉ែម  យឿម"
        },
        {
            "barcode": "171134174",
            "dpc": "03013131801",
            "name": "ជុន  ស្រីជី"
        },
        {
            "barcode": "171134175",
            "dpc": "03013131701",
            "name": "ផន  ផល្លា"
        },
        {
            "barcode": "171134176",
            "dpc": "03013131601",
            "name": "សុខ  តណ"
        },
        {
            "barcode": "171134177",
            "dpc": "03013131501",
            "name": "ជឿង  បូណា"
        },
        {
            "barcode": "171134178",
            "dpc": "03013131401",
            "name": "យឹម  សុជាតិ"
        },
        {
            "barcode": "171134179",
            "dpc": "03013131301",
            "name": "ម៉ី  វាសនា"
        },
        {
            "barcode": "171134180",
            "dpc": "03013131201",
            "name": "ឈួន  សេងហួង"
        },
        {
            "barcode": "171134181",
            "dpc": "03013131101",
            "name": "មុំ  សុភាព"
        },
        {
            "barcode": "171134182",
            "dpc": "03013131001",
            "name": "លឹម  ឃុន"
        },
        {
            "barcode": "171134183",
            "dpc": "03013130901",
            "name": "ម៉េត  មករា"
        },
        {
            "barcode": "171134184",
            "dpc": "03013130801",
            "name": "ចាន់  សុធា"
        },
        {
            "barcode": "171134185",
            "dpc": "03013130701",
            "name": "សាន  សម្បត្តិ"
        },
        {
            "barcode": "171134186",
            "dpc": "03013130601",
            "name": "សែស  រ៉ា"
        },
        {
            "barcode": "171134187",
            "dpc": "03013130501",
            "name": "ក្រេម  សាវ៉ាង"
        },
        {
            "barcode": "171134188",
            "dpc": "03013130401",
            "name": "សឿន  ធី"
        },
        {
            "barcode": "171134189",
            "dpc": "03013130301",
            "name": "ឡុង  ហុង"
        },
        {
            "barcode": "171134190",
            "dpc": "03013130201",
            "name": "សុច  សូនី"
        },
        {
            "barcode": "171134191",
            "dpc": "03013130101",
            "name": "ភុំ  រក្សា ​"
        },
        {
            "barcode": "171134192",
            "dpc": "03013129901",
            "name": "ចេត យី"
        },
        {
            "barcode": "171134193",
            "dpc": "03013129801",
            "name": "សុខ  សំណាង"
        },
        {
            "barcode": "171134194",
            "dpc": "03013129701",
            "name": "នួន  ផន"
        },
        {
            "barcode": "171134195",
            "dpc": "03013129601",
            "name": "ហែម  សុធា"
        },
        {
            "barcode": "171134196",
            "dpc": "03013129501",
            "name": "មឿន  ពុយ"
        },
        {
            "barcode": "171134197",
            "dpc": "03013129401",
            "name": "សំ   នៅ"
        },
        {
            "barcode": "171134198",
            "dpc": "03013129301",
            "name": "ពេជ្រ  ឆោមឆវណ្ណ"
        },
        {
            "barcode": "171134199",
            "dpc": "03013129201",
            "name": "ភទ្ធ  មុន្នី"
        },
        {
            "barcode": "171134200",
            "dpc": "03013129001",
            "name": "ភិន  ប៊ុនណ្ណាត"
        },
        {
            "barcode": "171134201",
            "dpc": "03013128901",
            "name": "ស៊ីម  ស៊ាន"
        },
        {
            "barcode": "171134202",
            "dpc": "03013128801",
            "name": "ស៊ីន  ថា"
        },
        {
            "barcode": "171134203",
            "dpc": "03013128701",
            "name": "សុក  រតនា"
        },
        {
            "barcode": "171134204",
            "dpc": "03013128601",
            "name": "វង់   សាវ៉ុង"
        },
        {
            "barcode": "171134205",
            "dpc": "03013128501",
            "name": "បែត  អឿម"
        },
        {
            "barcode": "171134206",
            "dpc": "03013128401",
            "name": "ប្រស់  សឿប"
        },
        {
            "barcode": "171134207",
            "dpc": "03013128301",
            "name": "វែន  សុខុម"
        },
        {
            "barcode": "171134208",
            "dpc": "03013128201",
            "name": "ផា  គឹមហៀក"
        },
        {
            "barcode": "171134209",
            "dpc": "03013128101",
            "name": "សុខ  ធី"
        },
        {
            "barcode": "171134210",
            "dpc": "03013127901",
            "name": "អ៊ូ  ចំរើន"
        },
        {
            "barcode": "171134211",
            "dpc": "03013127801",
            "name": "អ៊ូ  វឿត"
        },
        {
            "barcode": "171134212",
            "dpc": "03013127701",
            "name": "ឆៃ   ណារិទ្ធ"
        },
        {
            "barcode": "171134213",
            "dpc": "03013127601",
            "name": "សុខ  ឈៀន"
        },
        {
            "barcode": "171134214",
            "dpc": "03013127501",
            "name": "សៀម សុន"
        },
        {
            "barcode": "171134215",
            "dpc": "03013127401",
            "name": "ហេង  ឆាំ"
        },
        {
            "barcode": "171134216",
            "dpc": "03013127201",
            "name": "សួស  យ៉ុតថាណូ"
        },
        {
            "barcode": "171134217",
            "dpc": "03013127101",
            "name": "តាំង  ប៊ូហេង"
        },
        {
            "barcode": "171134218",
            "dpc": "03013127001",
            "name": "វ៉ាត  ស៊ីម"
        },
        {
            "barcode": "171134219",
            "dpc": "03013126901",
            "name": "ឈុន  លក្ខិណា"
        },
        {
            "barcode": "171134220",
            "dpc": "03013126801",
            "name": "តាំង  ណាំសែ"
        },
        {
            "barcode": "171134221",
            "dpc": "03013126601",
            "name": "កែវ  ចំចន្ទ័"
        },
        {
            "barcode": "171134222",
            "dpc": "03013126501",
            "name": "ធូ  សុខណា"
        },
        {
            "barcode": "171134223",
            "dpc": "03013126401",
            "name": "អៀ  វេងម៉ុង"
        },
        {
            "barcode": "171134224",
            "dpc": "03013126301",
            "name": "អ៊ុល  សុផល"
        },
        {
            "barcode": "171134225",
            "dpc": "03013126201",
            "name": "កាយ  ចាន់ថន់"
        },
        {
            "barcode": "171134226",
            "dpc": "03013126101",
            "name": "ប្រាក់ ថា"
        },
        {
            "barcode": "171134227",
            "dpc": "03013126001",
            "name": "ភ័ក្រ"
        },
        {
            "barcode": "171134228",
            "dpc": "03013125901",
            "name": "នួន  វាសនា"
        },
        {
            "barcode": "171134229",
            "dpc": "03013125801",
            "name": "ប៉ិច  ប៉ូ"
        },
        {
            "barcode": "171134230",
            "dpc": "03013125701",
            "name": "វង្ស  សុផា"
        },
        {
            "barcode": "171134231",
            "dpc": "03013125601",
            "name": "អ៊ឹង សុគន្ធ"
        },
        {
            "barcode": "171134232",
            "dpc": "03013125501",
            "name": "នួន  ផាត"
        },
        {
            "barcode": "171134233",
            "dpc": "03013125301",
            "name": "ឈៀង  ហៀប"
        },
        {
            "barcode": "171134234",
            "dpc": "03013125201",
            "name": "ប៉ូលី  ង៉ាន់"
        },
        {
            "barcode": "171134235",
            "dpc": "03013125001",
            "name": "ផុន  មុំ"
        },
        {
            "barcode": "171134236",
            "dpc": "03013124901",
            "name": "មួង  មន៉"
        },
        {
            "barcode": "171134237",
            "dpc": "03013124801",
            "name": "រ៉ន  ណាន"
        },
        {
            "barcode": "171134238",
            "dpc": "03013124701",
            "name": "វិត  មូណូ"
        },
        {
            "barcode": "171134239",
            "dpc": "03013124601",
            "name": "រ៉េន  វឿន"
        },
        {
            "barcode": "171134240",
            "dpc": "03013124401",
            "name": "វឹង  មួច"
        },
        {
            "barcode": "171134241",
            "dpc": "03013124201",
            "name": "តាត់  ហ៊ន"
        },
        {
            "barcode": "171134242",
            "dpc": "03013124101",
            "name": "ផាត់  ភីវីរៈ"
        },
        {
            "barcode": "171134243",
            "dpc": "03013124001",
            "name": "យ៉ក់  តាំងលី"
        },
        {
            "barcode": "171134244",
            "dpc": "03013123901",
            "name": "គីរី  សត្យា"
        },
        {
            "barcode": "171134245",
            "dpc": "03013123801",
            "name": "តូច  ធីណូ"
        },
        {
            "barcode": "171134246",
            "dpc": "03013123701",
            "name": "តូច  ប៊ុនធី"
        },
        {
            "barcode": "171134247",
            "dpc": "03013123601",
            "name": "ចាយ  ផល្លី"
        },
        {
            "barcode": "171134248",
            "dpc": "03013123501",
            "name": "វ៉ន លឿត"
        },
        {
            "barcode": "171134249",
            "dpc": "03013123401",
            "name": "ឃុន  លក្ខិណា"
        },
        {
            "barcode": "171134250",
            "dpc": "03013123301",
            "name": "អ៊ិត  ហ៊ុំ"
        },
        {
            "barcode": "171134251",
            "dpc": "03013123201",
            "name": "មិត  យ៉ត"
        },
        {
            "barcode": "171134252",
            "dpc": "03013123101",
            "name": "សៀង  ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171134253",
            "dpc": "03013123001",
            "name": "សៀង  ខុន"
        },
        {
            "barcode": "171134254",
            "dpc": "03013122901",
            "name": "សៀង  ម៉ាប់"
        },
        {
            "barcode": "171134255",
            "dpc": "03013122801",
            "name": "សៀង  កាំងហ៊ុន"
        },
        {
            "barcode": "171134256",
            "dpc": "03013122701",
            "name": "សោ  ចន្ទ័រី"
        },
        {
            "barcode": "171134257",
            "dpc": "03013122601",
            "name": "តាំង  ប៊ុនធឿយ"
        },
        {
            "barcode": "171134258",
            "dpc": "03013122501",
            "name": "គី  ឡុង"
        },
        {
            "barcode": "171134259",
            "dpc": "03013122401",
            "name": "ទៀវ  គឹមវ៉ាន់"
        },
        {
            "barcode": "171134260",
            "dpc": "03013122301",
            "name": "ហេង  គឹម"
        },
        {
            "barcode": "171134261",
            "dpc": "03013122201",
            "name": "ហេង  ឃន"
        },
        {
            "barcode": "171134262",
            "dpc": "03013122101",
            "name": "មាស  នឿន"
        },
        {
            "barcode": "171134263",
            "dpc": "03013122001",
            "name": "ប៉ែន  មី"
        },
        {
            "barcode": "171134264",
            "dpc": "03013121901",
            "name": "សាំង  សុខា"
        },
        {
            "barcode": "171134265",
            "dpc": "03013121801",
            "name": "ទៀវ  យូហឿល"
        },
        {
            "barcode": "171134266",
            "dpc": "03013121701",
            "name": "អុង  ដារ៉ា"
        },
        {
            "barcode": "171134267",
            "dpc": "03013121601",
            "name": "សៀន  ជុំ"
        },
        {
            "barcode": "171134268",
            "dpc": "03013121501",
            "name": "ហួត  ឈើយ"
        },
        {
            "barcode": "171134269",
            "dpc": "03013121401",
            "name": "ហៀ  ម៉ៅ"
        },
        {
            "barcode": "171134270",
            "dpc": "03013121301",
            "name": "ម៉ៅ  រើន"
        },
        {
            "barcode": "171134271",
            "dpc": "03013121201",
            "name": "ស៊ុយ អ៊ឹង"
        },
        {
            "barcode": "171134272",
            "dpc": "03013121101",
            "name": "ប៉ែន  សុផល"
        },
        {
            "barcode": "171134273",
            "dpc": "03013121001",
            "name": "សម  ម៉េត"
        },
        {
            "barcode": "171134274",
            "dpc": "03013120901",
            "name": "ជា  រស់"
        },
        {
            "barcode": "171134275",
            "dpc": "03013120801",
            "name": "ផាន់  អូន"
        },
        {
            "barcode": "171134276",
            "dpc": "03013120701",
            "name": "ង៉ូវ  សារិទ្ធ"
        },
        {
            "barcode": "171134277",
            "dpc": "03013120501",
            "name": "ភួង  ភណ័្ឌ"
        },
        {
            "barcode": "171134278",
            "dpc": "03013120401",
            "name": "ផន  សុខុម"
        },
        {
            "barcode": "171134279",
            "dpc": "03013120301",
            "name": "ហុង  ហេង"
        },
        {
            "barcode": "171134280",
            "dpc": "03013120201",
            "name": "លឹម  ដារ៉ា"
        },
        {
            "barcode": "171134281",
            "dpc": "03013120101",
            "name": "ឈុន  សៅយ៉ុត"
        },
        {
            "barcode": "171134282",
            "dpc": "03013120001",
            "name": "ងើយ  សំបូរ"
        },
        {
            "barcode": "171134283",
            "dpc": "03013119901",
            "name": "ង៉ុល  ងួន"
        },
        {
            "barcode": "171134284",
            "dpc": "03013119801",
            "name": "សឿន   សុខា"
        },
        {
            "barcode": "171134285",
            "dpc": "03013119501",
            "name": "កែវ  អូន"
        },
        {
            "barcode": "171134286",
            "dpc": "03013119401",
            "name": "នង  ប៊ុនធឿន"
        },
        {
            "barcode": "171134287",
            "dpc": "03013119301",
            "name": "ហម  រតនា"
        },
        {
            "barcode": "171134288",
            "dpc": "03013119201",
            "name": "ញឹក  ផល"
        },
        {
            "barcode": "171134289",
            "dpc": "03013119101",
            "name": "យ៉ែម  គឹមស៊ុន"
        },
        {
            "barcode": "171134290",
            "dpc": "03013119001",
            "name": "ហួត  សំបាន"
        },
        {
            "barcode": "171134291",
            "dpc": "03013118901",
            "name": "គឹម  រិទ្ធ"
        },
        {
            "barcode": "171134292",
            "dpc": "03013118801",
            "name": "នៅ  សាលឹម"
        },
        {
            "barcode": "171134293",
            "dpc": "03013118701",
            "name": "ហ៊ុយ  ឈឿន"
        },
        {
            "barcode": "171134294",
            "dpc": "03013118601",
            "name": "លុច  លី"
        },
        {
            "barcode": "171134295",
            "dpc": "03013118501",
            "name": "ម៉ៅ  វឿង"
        },
        {
            "barcode": "171134296",
            "dpc": "03013118401",
            "name": "លឹម  គឹមអេង"
        },
        {
            "barcode": "171134297",
            "dpc": "03013118301",
            "name": "ថាច់  ដុក"
        },
        {
            "barcode": "171134298",
            "dpc": "03013118201",
            "name": "សាលារៀនបោះពោធិ"
        },
        {
            "barcode": "171134299",
            "dpc": "03013118101",
            "name": "យូ  លីន"
        },
        {
            "barcode": "171134300",
            "dpc": "03013118001",
            "name": "យ៉ាង  ឈួម"
        },
        {
            "barcode": "171134301",
            "dpc": "03013117901",
            "name": "អៀង  ចិន្តា"
        },
        {
            "barcode": "171134302",
            "dpc": "03013117801",
            "name": "ទូច  រំចេក"
        },
        {
            "barcode": "171134303",
            "dpc": "03013117701",
            "name": "ទូច  សំបូរ"
        },
        {
            "barcode": "171134304",
            "dpc": "03013117601",
            "name": "ទូច  សម្បត្តិ"
        },
        {
            "barcode": "171134305",
            "dpc": "03013117501",
            "name": "ចាន់  ស៊ត"
        },
        {
            "barcode": "171134306",
            "dpc": "03013117401",
            "name": "អ៊ូច  សាវុធ"
        },
        {
            "barcode": "171134307",
            "dpc": "03013117301",
            "name": "ឆោង  គឹមយឿប"
        },
        {
            "barcode": "171134308",
            "dpc": "03013117201",
            "name": "បួ  ផានិត"
        },
        {
            "barcode": "171134309",
            "dpc": "03013117101",
            "name": "ហុង  សុខេន"
        },
        {
            "barcode": "171134310",
            "dpc": "03013117001",
            "name": "សាន់  វ៉ុន"
        },
        {
            "barcode": "171134311",
            "dpc": "03013116901",
            "name": "សេក  ភី"
        },
        {
            "barcode": "171134312",
            "dpc": "03013116801",
            "name": "សំ  រីណា"
        },
        {
            "barcode": "171134313",
            "dpc": "03013116701",
            "name": "រាជ  ឈិន"
        },
        {
            "barcode": "171134314",
            "dpc": "03013116601",
            "name": "កាន់  សាម៉េត"
        },
        {
            "barcode": "171134315",
            "dpc": "03013116401",
            "name": "រ៉េន  ដារត្ន័"
        },
        {
            "barcode": "171134316",
            "dpc": "03013116301",
            "name": "វើយ  ថា"
        },
        {
            "barcode": "171134317",
            "dpc": "03013116201",
            "name": "ភិន  សារ៉ុន"
        },
        {
            "barcode": "171134318",
            "dpc": "03013116101",
            "name": "អ៊ុំ  គុំភឿន"
        },
        {
            "barcode": "171134319",
            "dpc": "03013116001",
            "name": "ឆាន  សារឿន"
        },
        {
            "barcode": "171134320",
            "dpc": "03013115901",
            "name": "ឆាន   ស៊ីភន"
        },
        {
            "barcode": "171134321",
            "dpc": "03013115801",
            "name": "អាង  អានីតា"
        },
        {
            "barcode": "171134322",
            "dpc": "03013115701",
            "name": "រ៉េត  ប៊ុនថង"
        },
        {
            "barcode": "171134323",
            "dpc": "03013115601",
            "name": "អ៊ុច  សាវុន"
        },
        {
            "barcode": "171134324",
            "dpc": "03013115501",
            "name": "អូច  ភាព"
        },
        {
            "barcode": "171134325",
            "dpc": "03013115401",
            "name": "ស៊ាន  វុទ្ធី"
        },
        {
            "barcode": "171134326",
            "dpc": "03013115301",
            "name": "ភឿក  អ៊ីង"
        },
        {
            "barcode": "171134327",
            "dpc": "03013115201",
            "name": "ឆាត  កាម៉ាច"
        },
        {
            "barcode": "171134328",
            "dpc": "03013115101",
            "name": "ស្រី  សុភក្រ័"
        },
        {
            "barcode": "171134329",
            "dpc": "03013115001",
            "name": "មុត  ភារម្យ"
        },
        {
            "barcode": "171134330",
            "dpc": "03013114901",
            "name": "ហួច  ចន្នី"
        },
        {
            "barcode": "171134331",
            "dpc": "03013114801",
            "name": "សោម  សាន្ត"
        },
        {
            "barcode": "171134332",
            "dpc": "03013114701",
            "name": "គី  គាន"
        },
        {
            "barcode": "171134333",
            "dpc": "03013114601",
            "name": "ផែង  សាវរី"
        },
        {
            "barcode": "171134334",
            "dpc": "03013114501",
            "name": "ឆើត  កន្យាណ"
        },
        {
            "barcode": "171134335",
            "dpc": "03013114401",
            "name": "ឡម  មៀង"
        },
        {
            "barcode": "171134336",
            "dpc": "03013114301",
            "name": "ងឿន  ចាន់សុជាតិ"
        },
        {
            "barcode": "171134337",
            "dpc": "03013114201",
            "name": "គឹម  វណ្ណា"
        },
        {
            "barcode": "171134338",
            "dpc": "03013114101",
            "name": "ប៊ី  ប៉េង"
        },
        {
            "barcode": "171134339",
            "dpc": "03013114001",
            "name": "ឈួន  ឈូរ៉ា"
        },
        {
            "barcode": "171134340",
            "dpc": "03013113901",
            "name": "ញឹម  ស៊ីថាន"
        },
        {
            "barcode": "171134341",
            "dpc": "03013113801",
            "name": "ស៊ឹម  សំប៊ួ"
        },
        {
            "barcode": "171134342",
            "dpc": "03013113601",
            "name": "សោម  ស៊ាន"
        },
        {
            "barcode": "171134343",
            "dpc": "03013113401",
            "name": "ទូច ផល្លី"
        },
        {
            "barcode": "171134344",
            "dpc": "03013113301",
            "name": "ប៊ុត សេរី"
        },
        {
            "barcode": "171134345",
            "dpc": "03013113201",
            "name": "សួ  មិញ"
        },
        {
            "barcode": "171134346",
            "dpc": "03013113101",
            "name": "ប៉ែន  សុខា"
        },
        {
            "barcode": "171134347",
            "dpc": "03013113001",
            "name": "យ៉ុន  វឿត"
        },
        {
            "barcode": "171134348",
            "dpc": "03013112901",
            "name": "ចាន់  សុវណ្ណ"
        },
        {
            "barcode": "171134349",
            "dpc": "03013112801",
            "name": "អ៊ិត  ដាវុធ"
        },
        {
            "barcode": "171134350",
            "dpc": "03013112601",
            "name": "ង៉ែត  ជឿង"
        },
        {
            "barcode": "171134351",
            "dpc": "03013112501",
            "name": "ឡុង  វិចិត្រ"
        },
        {
            "barcode": "171134352",
            "dpc": "03013112401",
            "name": "ជឿម ណារិន"
        },
        {
            "barcode": "171134353",
            "dpc": "03013112301",
            "name": "សឿម  ទ្រី"
        },
        {
            "barcode": "171134354",
            "dpc": "03013112201",
            "name": "សំ  រិតកង"
        },
        {
            "barcode": "171134355",
            "dpc": "03013112101",
            "name": "ប៉ុង  សុផាត"
        },
        {
            "barcode": "171134356",
            "dpc": "03013112001",
            "name": "គង់  ចាន់ណាត"
        },
        {
            "barcode": "171134357",
            "dpc": "03013111901",
            "name": "ហេង  សុភាព"
        },
        {
            "barcode": "171134358",
            "dpc": "03013111701",
            "name": "ឃួន  វិច្ឆិកា"
        },
        {
            "barcode": "171134359",
            "dpc": "03013111601",
            "name": "ឈៀង  លីណា"
        },
        {
            "barcode": "171134360",
            "dpc": "03013111501",
            "name": "ចាន់   សាវិត"
        },
        {
            "barcode": "171134361",
            "dpc": "03013111401",
            "name": "ប៉ុល  ពេជ្រ"
        },
        {
            "barcode": "171134362",
            "dpc": "03013111301",
            "name": "តឹង  នៅ"
        },
        {
            "barcode": "171134363",
            "dpc": "03013111201",
            "name": "ទុយ  ចិន្តា"
        },
        {
            "barcode": "171134364",
            "dpc": "03013111101",
            "name": "ចំរើន វិច្ឆិកា"
        },
        {
            "barcode": "171134365",
            "dpc": "03013111001",
            "name": "ហេង  ឃន"
        },
        {
            "barcode": "171134366",
            "dpc": "03013110901",
            "name": "ព្រំ  សុភិន"
        },
        {
            "barcode": "171134367",
            "dpc": "03013110801",
            "name": "ឆេង  ឌី"
        },
        {
            "barcode": "171134368",
            "dpc": "03013110701",
            "name": "ថាច់  កូដាវី"
        },
        {
            "barcode": "171134369",
            "dpc": "03013110601",
            "name": "ទឹតលី ចំរើន"
        },
        {
            "barcode": "171134370",
            "dpc": "03013110501",
            "name": "ម៉ី  ជា"
        },
        {
            "barcode": "171134371",
            "dpc": "03013110301",
            "name": "មាន  ផាវ"
        },
        {
            "barcode": "171134372",
            "dpc": "03013110201",
            "name": "មាន  សុភ័ក្រ"
        },
        {
            "barcode": "171134373",
            "dpc": "03013110101",
            "name": "សេង  ហ៊ាង"
        },
        {
            "barcode": "171134374",
            "dpc": "03013110001",
            "name": "ថេត  សុធា"
        },
        {
            "barcode": "171134375",
            "dpc": "03013109901",
            "name": "ឈិត  គន្ធី"
        },
        {
            "barcode": "171134376",
            "dpc": "03013109801",
            "name": "ជា  វ៉ាន់ណូ"
        },
        {
            "barcode": "171134377",
            "dpc": "03013109701",
            "name": "តុង  មារីកា"
        },
        {
            "barcode": "171134378",
            "dpc": "03013109501",
            "name": "ស៊ុំ  សំអ៊ុល"
        },
        {
            "barcode": "171134379",
            "dpc": "03013109401",
            "name": "គៀង  យ៉ា"
        },
        {
            "barcode": "171134380",
            "dpc": "03013109301",
            "name": "ជាស  សម្បត្តិ"
        },
        {
            "barcode": "171134381",
            "dpc": "03013109201",
            "name": "ឈៀង  ឆវន្ត័"
        },
        {
            "barcode": "171134382",
            "dpc": "03013109101",
            "name": "វ៉ាត  សុខា"
        },
        {
            "barcode": "171134383",
            "dpc": "03013109001",
            "name": "ម៉ឹង  សាវ៉ាត់"
        },
        {
            "barcode": "171134384",
            "dpc": "03013108901",
            "name": "ផាត់  មុំ"
        },
        {
            "barcode": "171134385",
            "dpc": "03013108801",
            "name": "គឹម  សេង"
        },
        {
            "barcode": "171134386",
            "dpc": "03013108701",
            "name": "ឡាត់  លី"
        },
        {
            "barcode": "171134387",
            "dpc": "03013108601",
            "name": "ចិន  រើត"
        },
        {
            "barcode": "171134388",
            "dpc": "03013108501",
            "name": "ង៉ាត់  នឿត"
        },
        {
            "barcode": "171134389",
            "dpc": "03013108401",
            "name": "ស៊ុន  គឹមហៃ"
        },
        {
            "barcode": "171134390",
            "dpc": "03013108301",
            "name": "វាន់   សុខា"
        },
        {
            "barcode": "171134391",
            "dpc": "03013108201",
            "name": "ស៊ុន  យូណាន"
        },
        {
            "barcode": "171134392",
            "dpc": "03013108101",
            "name": "ហេង  ថុល"
        },
        {
            "barcode": "171134393",
            "dpc": "03013108001",
            "name": "ស៊ុម  វ៉ុង"
        },
        {
            "barcode": "171134394",
            "dpc": "03013107901",
            "name": "ព្រីង  យ៉េត"
        },
        {
            "barcode": "171134395",
            "dpc": "03013107801",
            "name": "ឡោ  ឈឿត"
        },
        {
            "barcode": "171134396",
            "dpc": "03013107701",
            "name": "ញឹក  សាវ៉ង"
        },
        {
            "barcode": "171134397",
            "dpc": "03013107601",
            "name": "ទេព  សាវឿន"
        },
        {
            "barcode": "171134398",
            "dpc": "03013107401",
            "name": "លឿង  លុយ"
        },
        {
            "barcode": "171134399",
            "dpc": "03013107201",
            "name": "ហេង  ហ៊ាង"
        },
        {
            "barcode": "171134400",
            "dpc": "03013107101",
            "name": "សោម  សឺនឺ"
        },
        {
            "barcode": "171134401",
            "dpc": "03013107001",
            "name": "ញឹក  ពុំ"
        },
        {
            "barcode": "171134402",
            "dpc": "03013106901",
            "name": "ហេង  ឈឿ"
        },
        {
            "barcode": "171134403",
            "dpc": "03013106801",
            "name": "ស៊ុន  សាខាត"
        },
        {
            "barcode": "171134404",
            "dpc": "03013106701",
            "name": "ហ៊ុន  សាម៉េត"
        },
        {
            "barcode": "171134405",
            "dpc": "03013106601",
            "name": "យ៉ុង  វុធ"
        },
        {
            "barcode": "171134406",
            "dpc": "03013106501",
            "name": "យួម  ស៊ីយ៉េត"
        },
        {
            "barcode": "171134407",
            "dpc": "03013106401",
            "name": "វ៉ិត  កំសាន្ត"
        },
        {
            "barcode": "171134408",
            "dpc": "03013106301",
            "name": "ហ៊ុន  យ៉ត"
        },
        {
            "barcode": "171134409",
            "dpc": "03013106201",
            "name": "ប៊យ  ពូន"
        },
        {
            "barcode": "171134410",
            "dpc": "03013106101",
            "name": "ជិន  ធារី"
        },
        {
            "barcode": "171134411",
            "dpc": "03013105901",
            "name": "ថោង  សាេវត"
        },
        {
            "barcode": "171134412",
            "dpc": "03013105801",
            "name": "ហង់  ឈឿយ"
        },
        {
            "barcode": "171134413",
            "dpc": "03013105701",
            "name": "គឹង  វឿង"
        },
        {
            "barcode": "171134414",
            "dpc": "03013105601",
            "name": "គៀង  ចាន់ណា"
        },
        {
            "barcode": "171134415",
            "dpc": "03013105501",
            "name": "ង៉ា  ផារី"
        },
        {
            "barcode": "171134416",
            "dpc": "03013105401",
            "name": "ចាន់ រី"
        },
        {
            "barcode": "171134417",
            "dpc": "03013105301",
            "name": "យ៉េន  យឿត"
        },
        {
            "barcode": "171134418",
            "dpc": "03013105201",
            "name": "ផាន់  ផល្លី"
        },
        {
            "barcode": "171134419",
            "dpc": "03013105101",
            "name": "គៀង  ប៊ុនលី"
        },
        {
            "barcode": "171134420",
            "dpc": "03013105001",
            "name": "អាន  សំណាង"
        },
        {
            "barcode": "171134421",
            "dpc": "03013104901",
            "name": "ទូច"
        },
        {
            "barcode": "171134422",
            "dpc": "03013104801",
            "name": "ទូច  ស៊ីណាត"
        },
        {
            "barcode": "171134423",
            "dpc": "03013104701",
            "name": "ផន  សាវឿង"
        },
        {
            "barcode": "171134424",
            "dpc": "03013104501",
            "name": "សាយ  ចន្ថា"
        },
        {
            "barcode": "171134425",
            "dpc": "03013104401",
            "name": "អ៊ឹម  សុខចំរើន"
        },
        {
            "barcode": "171134426",
            "dpc": "03013104301",
            "name": "វ៉ាន់  សារិទ្ធិ"
        },
        {
            "barcode": "171134427",
            "dpc": "03013104201",
            "name": "យ៉ាំ  ចាន់"
        },
        {
            "barcode": "171134428",
            "dpc": "03013104101",
            "name": "អៀវ  វ៉ាន់ដេត"
        },
        {
            "barcode": "171134429",
            "dpc": "03013104001",
            "name": "ព្រឿង  ព្រិច"
        },
        {
            "barcode": "171134430",
            "dpc": "03013103901",
            "name": "កែ  ផល្លា"
        },
        {
            "barcode": "171134431",
            "dpc": "03013103801",
            "name": "សុក  រតនះ"
        },
        {
            "barcode": "171134432",
            "dpc": "03013103701",
            "name": "មាស  រិន"
        },
        {
            "barcode": "171134433",
            "dpc": "03013103401",
            "name": "ពុំ  ប្រុស"
        },
        {
            "barcode": "171134434",
            "dpc": "03013103301",
            "name": "ហុក  ហាន"
        },
        {
            "barcode": "171134435",
            "dpc": "03013103201",
            "name": "ព្រឿង  ឆៀប"
        },
        {
            "barcode": "171134436",
            "dpc": "03013103001",
            "name": "ទិត្យ  ថា"
        },
        {
            "barcode": "171134437",
            "dpc": "03013102901",
            "name": "ថៃ  យ៉ុន"
        },
        {
            "barcode": "171134438",
            "dpc": "03013102801",
            "name": "អ៊ុច  អឿន"
        },
        {
            "barcode": "171134439",
            "dpc": "03013102601",
            "name": "លឹម  ខេង"
        },
        {
            "barcode": "171134440",
            "dpc": "03013102501",
            "name": "ងិន  សុផល"
        },
        {
            "barcode": "171134441",
            "dpc": "03013102401",
            "name": "ឡូ  ប៊ុនប៉ា"
        },
        {
            "barcode": "171134442",
            "dpc": "03013102301",
            "name": "វ៉ាត់  ចិន្តា"
        },
        {
            "barcode": "171134443",
            "dpc": "03013102201",
            "name": "ទី  កុសល់"
        },
        {
            "barcode": "171134444",
            "dpc": "03013102101",
            "name": "ស៊ុន  គីមអូន"
        },
        {
            "barcode": "171134445",
            "dpc": "03013102001",
            "name": "វ៉ាត  ស៊ីម"
        },
        {
            "barcode": "171134446",
            "dpc": "03013101901",
            "name": "អ៊ុំ  សាឡាត"
        },
        {
            "barcode": "171134447",
            "dpc": "03013101701",
            "name": "ចៅ  ធឿន"
        },
        {
            "barcode": "171134448",
            "dpc": "03013101601",
            "name": "ឃុំ  ជ្រា"
        },
        {
            "barcode": "171134449",
            "dpc": "03013101501",
            "name": "ម៉ិត  ឃន"
        },
        {
            "barcode": "171134450",
            "dpc": "03013101401",
            "name": "ផែន  ហ៊ីម"
        },
        {
            "barcode": "171134451",
            "dpc": "03013101301",
            "name": "ជា  ជួម"
        },
        {
            "barcode": "171134452",
            "dpc": "03013101201",
            "name": "ឈិន  សារុំ"
        },
        {
            "barcode": "171134453",
            "dpc": "03013101101",
            "name": "ស  ស៊ីម"
        },
        {
            "barcode": "171134454",
            "dpc": "03013101001",
            "name": "កែវ   តាំង"
        },
        {
            "barcode": "171134455",
            "dpc": "03013100901",
            "name": "ធូ  មុន្នីរិទ្ធិ"
        },
        {
            "barcode": "171134456",
            "dpc": "03013100801",
            "name": "តេន  ឡេន"
        },
        {
            "barcode": "171134457",
            "dpc": "03013100701",
            "name": "សឹង  សុផាត"
        },
        {
            "barcode": "171134458",
            "dpc": "03013100601",
            "name": "អ៊ូ  សាវ័ន្ត"
        },
        {
            "barcode": "171134459",
            "dpc": "03013100501",
            "name": "ញ៉េម  ស្រូង"
        },
        {
            "barcode": "171134460",
            "dpc": "03013100401",
            "name": "យស  យឿន"
        },
        {
            "barcode": "171134461",
            "dpc": "03013100301",
            "name": "មុត  សាវន្ត័"
        },
        {
            "barcode": "171134462",
            "dpc": "03013100201",
            "name": "អ៊ុក  សុធា"
        },
        {
            "barcode": "171134463",
            "dpc": "03013100101",
            "name": "ឈន   ណាវី"
        },
        {
            "barcode": "171134464",
            "dpc": "03013136201",
            "name": "ហួត  កប"
        },
        {
            "barcode": "171134465",
            "dpc": "03013136501",
            "name": "ដែង សុវណ្ណរ៉ា"
        },
        {
            "barcode": "171134466",
            "dpc": "03013111801",
            "name": "ញ៉  លីម៉ា"
        },
        {
            "barcode": "171134467",
            "dpc": "03013110401",
            "name": "សែម  ឃន"
        },
        {
            "barcode": "171134468",
            "dpc": "03013103101",
            "name": "ឆម  ធឿន"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
