let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=
    [
        {
            "barcode": "171131645",
            "dpc": "03013444901",
            "name": "យឿង សាវី"
        },
        {
            "barcode": "171131646",
            "dpc": "03013400101",
            "name": "ជា គឹមឆេង"
        },
        {
            "barcode": "171131647",
            "dpc": "03013400201",
            "name": "ជីយ សំណាង"
        },
        {
            "barcode": "171131648",
            "dpc": "03013400301",
            "name": "ជ័យ គឹមឈុន"
        },
        {
            "barcode": "171131649",
            "dpc": "03013400401",
            "name": "ញ៉ា គឹមលី"
        },
        {
            "barcode": "171131650",
            "dpc": "03013400501",
            "name": "ឌី សូភី"
        },
        {
            "barcode": "171131651",
            "dpc": "03013400601",
            "name": "ហ៊ឺម ចន្ទធី"
        },
        {
            "barcode": "171131652",
            "dpc": "03013400701",
            "name": "តៅ គឹមវែង"
        },
        {
            "barcode": "171131653",
            "dpc": "03013400801",
            "name": "ឈឹត ចន្ថា"
        },
        {
            "barcode": "171131654",
            "dpc": "03013400901",
            "name": "ឈឹត សៀវបេង"
        },
        {
            "barcode": "171131655",
            "dpc": "03013401101",
            "name": "ជ រ៉ែន"
        },
        {
            "barcode": "171131656",
            "dpc": "03013401201",
            "name": "ឈុត សាឃូម"
        },
        {
            "barcode": "171131657",
            "dpc": "03013401301",
            "name": "សេក វាសនា"
        },
        {
            "barcode": "171131658",
            "dpc": "03013401401",
            "name": "សេក វីបុល"
        },
        {
            "barcode": "171131659",
            "dpc": "03013401501",
            "name": "ផូ សុវណ្ណរិទ្ធ"
        },
        {
            "barcode": "171131660",
            "dpc": "03013401601",
            "name": "ហូ នរ៉ា"
        },
        {
            "barcode": "171131661",
            "dpc": "03013401701",
            "name": "ជា ប៊ុននី"
        },
        {
            "barcode": "171131662",
            "dpc": "03013401801",
            "name": "កង សារៀប"
        },
        {
            "barcode": "171131663",
            "dpc": "03013401901",
            "name": "ជេត ម៉ារ៉ាឌី"
        },
        {
            "barcode": "171131664",
            "dpc": "03013402001",
            "name": "ឈឹត សំផុន"
        },
        {
            "barcode": "171131665",
            "dpc": "03013402101",
            "name": "ឈឿន សុវណ្ណរិទ្ធ"
        },
        {
            "barcode": "171131666",
            "dpc": "03013402201",
            "name": "ទៀង ពត"
        },
        {
            "barcode": "171131667",
            "dpc": "03013402301",
            "name": "ហេង សារឿត"
        },
        {
            "barcode": "171131668",
            "dpc": "03013402401",
            "name": "លាង វិច្ឆិកា"
        },
        {
            "barcode": "171131669",
            "dpc": "03013402501",
            "name": "ពុំ ប្រុស"
        },
        {
            "barcode": "171131670",
            "dpc": "03013402601",
            "name": "ពិន សារ៉ែត"
        },
        {
            "barcode": "171131671",
            "dpc": "03013402701",
            "name": "ពិន សំបូររាសី"
        },
        {
            "barcode": "171131672",
            "dpc": "03013402801",
            "name": "ជុំ មិថុនា"
        },
        {
            "barcode": "171131673",
            "dpc": "03013402901",
            "name": "ឡុង សត្យា"
        },
        {
            "barcode": "171131674",
            "dpc": "03013403001",
            "name": "សុង សុភ័ក្រ្ត"
        },
        {
            "barcode": "171131675",
            "dpc": "03013403101",
            "name": "មឹក ចន្ថា"
        },
        {
            "barcode": "171131676",
            "dpc": "03013403201",
            "name": "មឹក មករា"
        },
        {
            "barcode": "171131677",
            "dpc": "03013403301",
            "name": "យួន ចាន់យ៉ា"
        },
        {
            "barcode": "171131678",
            "dpc": "03013403401",
            "name": "ហេង សុភារី"
        },
        {
            "barcode": "171131679",
            "dpc": "03013403501",
            "name": "សៅ ម៉េង"
        },
        {
            "barcode": "171131680",
            "dpc": "03013403601",
            "name": "ធៀម ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171131681",
            "dpc": "03013403701",
            "name": "គី គឿម"
        },
        {
            "barcode": "171131682",
            "dpc": "03013403801",
            "name": "ខេង ប៊ុនណា"
        },
        {
            "barcode": "171131683",
            "dpc": "03013403901",
            "name": "ប៉ុក ចាន់រស្មី"
        },
        {
            "barcode": "171131684",
            "dpc": "03013404001",
            "name": "សង លីណា"
        },
        {
            "barcode": "171131685",
            "dpc": "03013404101",
            "name": "គ្រុយ ចាន់រិទ្ធិ"
        },
        {
            "barcode": "171131686",
            "dpc": "03013404201",
            "name": "សៅ សុភាព"
        },
        {
            "barcode": "171131687",
            "dpc": "03013404401",
            "name": "ឈឿ វាសនា"
        },
        {
            "barcode": "171131688",
            "dpc": "03013404501",
            "name": "រួម ហេង"
        },
        {
            "barcode": "171131689",
            "dpc": "03013404601",
            "name": "កែវ វណ្ណា"
        },
        {
            "barcode": "171131690",
            "dpc": "03013404701",
            "name": "អង់ មុន្នីរត័្ន"
        },
        {
            "barcode": "171131691",
            "dpc": "03013404801",
            "name": "នង បូរណា"
        },
        {
            "barcode": "171131692",
            "dpc": "03013404901",
            "name": "នង ចន្ថា"
        },
        {
            "barcode": "171131693",
            "dpc": "03013405001",
            "name": "សេក បូរណ"
        },
        {
            "barcode": "171131694",
            "dpc": "03013405101",
            "name": "ជា អាង"
        },
        {
            "barcode": "171131695",
            "dpc": "03013405201",
            "name": "នង ចាន់នី"
        },
        {
            "barcode": "171131696",
            "dpc": "03013405301",
            "name": "ឆៃ វណ្ណរិទ្ធ"
        },
        {
            "barcode": "171131697",
            "dpc": "03013405401",
            "name": "ឆេង ប៉េងលន់"
        },
        {
            "barcode": "171131698",
            "dpc": "03013405501",
            "name": "នង សារ៉ាន"
        },
        {
            "barcode": "171131699",
            "dpc": "03013405601",
            "name": "អ៊ាម ណៃ"
        },
        {
            "barcode": "171131700",
            "dpc": "03013405701",
            "name": "ដេត អេងលី"
        },
        {
            "barcode": "171131701",
            "dpc": "03013405801",
            "name": "កឹម ឈួយ"
        },
        {
            "barcode": "171131702",
            "dpc": "03013405901",
            "name": "សិន ធី"
        },
        {
            "barcode": "171131703",
            "dpc": "03013406101",
            "name": "លុត ផល្លា"
        },
        {
            "barcode": "171131704",
            "dpc": "03013406201",
            "name": "ផូ មុំ"
        },
        {
            "barcode": "171131705",
            "dpc": "03013406301",
            "name": "ផូ វណ្ណ"
        },
        {
            "barcode": "171131706",
            "dpc": "03013406401",
            "name": "ឃី ឆេងសុកសាន្ត"
        },
        {
            "barcode": "171131707",
            "dpc": "03013406601",
            "name": "អុន លីវីណា"
        },
        {
            "barcode": "171131708",
            "dpc": "03013406701",
            "name": "វ៉ាត ហឹង"
        },
        {
            "barcode": "171131709",
            "dpc": "03013406801",
            "name": "វ៉ាត វ៉ាន់ថា"
        },
        {
            "barcode": "171131710",
            "dpc": "03013406901",
            "name": "ប៉ុក សុជាតិ"
        },
        {
            "barcode": "171131711",
            "dpc": "03013407001",
            "name": "ទឹម ហ៊ុច"
        },
        {
            "barcode": "171131712",
            "dpc": "03013407101",
            "name": "លឹម ហួត"
        },
        {
            "barcode": "171131713",
            "dpc": "03013407201",
            "name": "អាង គឹមឈាន"
        },
        {
            "barcode": "171131714",
            "dpc": "03013407301",
            "name": "ខឹម វឿត"
        },
        {
            "barcode": "171131715",
            "dpc": "03013407401",
            "name": "ផាវ សុផានី"
        },
        {
            "barcode": "171131716",
            "dpc": "03013407501",
            "name": "យី ស៊ុយ"
        },
        {
            "barcode": "171131717",
            "dpc": "03013407601",
            "name": "គឹម ហុង"
        },
        {
            "barcode": "171131718",
            "dpc": "03013407701",
            "name": "ស្រុន លាងវូច"
        },
        {
            "barcode": "171131719",
            "dpc": "03013407801",
            "name": "សេង រដ្ខា"
        },
        {
            "barcode": "171131720",
            "dpc": "03013407901",
            "name": "យុយ ប៉ា"
        },
        {
            "barcode": "171131721",
            "dpc": "03013408001",
            "name": "ទូច គុណណែ"
        },
        {
            "barcode": "171131722",
            "dpc": "03013408101",
            "name": "វា ហាក"
        },
        {
            "barcode": "171131723",
            "dpc": "03013408201",
            "name": "ណាំ សុវណ្ណរ៉ា"
        },
        {
            "barcode": "171131724",
            "dpc": "03013408301",
            "name": "ជាម ជម្ពរត័្ន"
        },
        {
            "barcode": "171131725",
            "dpc": "03013408401",
            "name": "បេង ស៊ុយ"
        },
        {
            "barcode": "171131726",
            "dpc": "03013408501",
            "name": "ហ៊ិន សឿម"
        },
        {
            "barcode": "171131727",
            "dpc": "03013408601",
            "name": "ឆ្លាម សម្បត្តិ"
        },
        {
            "barcode": "171131728",
            "dpc": "03013408701",
            "name": "យាន ឡងឌី"
        },
        {
            "barcode": "171131729",
            "dpc": "03013408801",
            "name": "ឈុំ វ័ន"
        },
        {
            "barcode": "171131730",
            "dpc": "03013408901",
            "name": "យិន ជួយ"
        },
        {
            "barcode": "171131731",
            "dpc": "03013409001",
            "name": "សំ វូហា"
        },
        {
            "barcode": "171131732",
            "dpc": "03013409101",
            "name": "រៀន សម្បត្តិ"
        },
        {
            "barcode": "171131733",
            "dpc": "03013409201",
            "name": "រិត សុឃិន"
        },
        {
            "barcode": "171131734",
            "dpc": "03013409301",
            "name": "ខៀវ ហួន"
        },
        {
            "barcode": "171131735",
            "dpc": "03013409601",
            "name": "រិត សុខាន់"
        },
        {
            "barcode": "171131736",
            "dpc": "03013409701",
            "name": "អ៊ិត សំណាង"
        },
        {
            "barcode": "171131737",
            "dpc": "03013409801",
            "name": "ចៅ សៅ"
        },
        {
            "barcode": "171131738",
            "dpc": "03013409901",
            "name": "ចៀម រត័្ន"
        },
        {
            "barcode": "171131739",
            "dpc": "03013410001",
            "name": "មិល សាវិន"
        },
        {
            "barcode": "171131740",
            "dpc": "03013410101",
            "name": "អ៊ឹម សារូន"
        },
        {
            "barcode": "171131741",
            "dpc": "03013410201",
            "name": "សាមី សាវែង"
        },
        {
            "barcode": "171131742",
            "dpc": "03013410301",
            "name": "ចៅ ជៀវ"
        },
        {
            "barcode": "171131743",
            "dpc": "03013410401",
            "name": "សំ លីង"
        },
        {
            "barcode": "171131744",
            "dpc": "03013410501",
            "name": "ហុក ហេង"
        },
        {
            "barcode": "171131745",
            "dpc": "03013410701",
            "name": "នី សុខឃៀង"
        },
        {
            "barcode": "171131746",
            "dpc": "03013410801",
            "name": "គីម វណ្ណា"
        },
        {
            "barcode": "171131747",
            "dpc": "03013410901",
            "name": "យាំង សុវណ្ណារា"
        },
        {
            "barcode": "171131748",
            "dpc": "03013411001",
            "name": "ទ្រី វុត្ថា"
        },
        {
            "barcode": "171131749",
            "dpc": "03013411101",
            "name": "ទិព្វ សុហេង"
        },
        {
            "barcode": "171131750",
            "dpc": "03013411201",
            "name": "តូច កុសល់"
        },
        {
            "barcode": "171131751",
            "dpc": "03013411301",
            "name": "រី រ៉ាន"
        },
        {
            "barcode": "171131752",
            "dpc": "03013411401",
            "name": "លី សុវណ្ណ"
        },
        {
            "barcode": "171131753",
            "dpc": "03013411501",
            "name": "សំ យ៉េត"
        },
        {
            "barcode": "171131754",
            "dpc": "03013411601",
            "name": "ឃួន សារ៉ាន់"
        },
        {
            "barcode": "171131755",
            "dpc": "03013411801",
            "name": "ញៀវ ប៊ូរ"
        },
        {
            "barcode": "171131756",
            "dpc": "03013411901",
            "name": "មាស សាអែម"
        },
        {
            "barcode": "171131757",
            "dpc": "03013412001",
            "name": "តូច សុខុម"
        },
        {
            "barcode": "171131758",
            "dpc": "03013412101",
            "name": "រ៉ម យឹង"
        },
        {
            "barcode": "171131759",
            "dpc": "03013412201",
            "name": "ធូន ពេជ្រ"
        },
        {
            "barcode": "171131760",
            "dpc": "03013412301",
            "name": "ហុង សេដ្ឋា"
        },
        {
            "barcode": "171131761",
            "dpc": "03013412401",
            "name": "សៀន វើន"
        },
        {
            "barcode": "171131762",
            "dpc": "03013412501",
            "name": "ជឹង ជីវន័្ត"
        },
        {
            "barcode": "171131763",
            "dpc": "03013412601",
            "name": "នីរត័្ន"
        },
        {
            "barcode": "171131764",
            "dpc": "03013412701",
            "name": "យឹន យីវ"
        },
        {
            "barcode": "171131765",
            "dpc": "03013413001",
            "name": "យោក ស្វាង"
        },
        {
            "barcode": "171131766",
            "dpc": "03013413201",
            "name": "យាំ ទូច"
        },
        {
            "barcode": "171131767",
            "dpc": "03013413301",
            "name": "ចៅ ទយ"
        },
        {
            "barcode": "171131768",
            "dpc": "03013413401",
            "name": "យាំ ខាន់"
        },
        {
            "barcode": "171131769",
            "dpc": "03013413501",
            "name": "លី តឹក"
        },
        {
            "barcode": "171131770",
            "dpc": "03013413701",
            "name": "យូម ធារ៉ា"
        },
        {
            "barcode": "171131771",
            "dpc": "03013413801",
            "name": "ប៊ុន លឹមអេង"
        },
        {
            "barcode": "171131772",
            "dpc": "03013413901",
            "name": "សុខ បាន"
        },
        {
            "barcode": "171131773",
            "dpc": "03013414001",
            "name": "ថា សំរិត"
        },
        {
            "barcode": "171131774",
            "dpc": "03013414101",
            "name": "ជូម ប៊ុនទៀង"
        },
        {
            "barcode": "171131775",
            "dpc": "03013414201",
            "name": "សាន្ត ពីសី"
        },
        {
            "barcode": "171131776",
            "dpc": "03013414301",
            "name": "ហឿង ហ្វូ"
        },
        {
            "barcode": "171131777",
            "dpc": "03013414401",
            "name": "នូម ចក់"
        },
        {
            "barcode": "171131778",
            "dpc": "03013414501",
            "name": "ម៊ុយ"
        },
        {
            "barcode": "171131779",
            "dpc": "03013414601",
            "name": "ហឿង ទី"
        },
        {
            "barcode": "171131780",
            "dpc": "03013414701",
            "name": "ហូម ខ្វែក"
        },
        {
            "barcode": "171131781",
            "dpc": "03013414801",
            "name": "យឹម ផងឌី"
        },
        {
            "barcode": "171131782",
            "dpc": "03013414901",
            "name": "ស៊ុន រតនា"
        },
        {
            "barcode": "171131783",
            "dpc": "03013415001",
            "name": "ប៉ន យើន"
        },
        {
            "barcode": "171131784",
            "dpc": "03013415101",
            "name": "អ៊ុច សាវង"
        },
        {
            "barcode": "171131785",
            "dpc": "03013415201",
            "name": "ញឹក រ៉ាត់"
        },
        {
            "barcode": "171131786",
            "dpc": "03013415301",
            "name": "ញឹក ឃុន្នី"
        },
        {
            "barcode": "171131787",
            "dpc": "03013415401",
            "name": "ញឹក សំណាង"
        },
        {
            "barcode": "171131788",
            "dpc": "03013415501",
            "name": "ញឹក ពន្លឹ"
        },
        {
            "barcode": "171131789",
            "dpc": "03013415601",
            "name": "នុត ប្រណិត"
        },
        {
            "barcode": "171131790",
            "dpc": "03013415701",
            "name": "មឿន ស្រីលក្ខណ៌"
        },
        {
            "barcode": "171131791",
            "dpc": "03013415801",
            "name": "មាន ឡាយ"
        },
        {
            "barcode": "171131792",
            "dpc": "03013415901",
            "name": "សៀក ពិសិដ្ខ"
        },
        {
            "barcode": "171131793",
            "dpc": "03013416001",
            "name": "សង ប៊ុនលត"
        },
        {
            "barcode": "171131794",
            "dpc": "03013416101",
            "name": "ស្រី សុភក្រ័"
        },
        {
            "barcode": "171131795",
            "dpc": "03013416201",
            "name": "ម៉ិល បោះ"
        },
        {
            "barcode": "171131796",
            "dpc": "03013416301",
            "name": "ឆឿម ឈឿយ"
        },
        {
            "barcode": "171131797",
            "dpc": "03013416401",
            "name": "សិត រិត"
        },
        {
            "barcode": "171131798",
            "dpc": "03013416501",
            "name": "កូច គឹមលី"
        },
        {
            "barcode": "171131799",
            "dpc": "03013416701",
            "name": "ផ្លុង សាត"
        },
        {
            "barcode": "171131800",
            "dpc": "03013416801",
            "name": "ខៀក វណ្ណស៊ី"
        },
        {
            "barcode": "171131801",
            "dpc": "03013416901",
            "name": "ស៊ុន រ៉ែម"
        },
        {
            "barcode": "171131802",
            "dpc": "03013417001",
            "name": "ជា សារ៉ាតឌី"
        },
        {
            "barcode": "171131803",
            "dpc": "03013417101",
            "name": "ផាត វុទ្ធី"
        },
        {
            "barcode": "171131804",
            "dpc": "03013417301",
            "name": "សូន ភេន"
        },
        {
            "barcode": "171131805",
            "dpc": "03013417401",
            "name": "អាត ប៊ុនរត័្ន"
        },
        {
            "barcode": "171131806",
            "dpc": "03013417501",
            "name": "ដូ ម៉េងអង់"
        },
        {
            "barcode": "171131807",
            "dpc": "03013417601",
            "name": "បាន ចន្ធី"
        },
        {
            "barcode": "171131808",
            "dpc": "03013417701",
            "name": "ម៉ម មាន"
        },
        {
            "barcode": "171131809",
            "dpc": "03013417801",
            "name": "ណាល់ ពៅ"
        },
        {
            "barcode": "171131810",
            "dpc": "03013418001",
            "name": "គឹម ថង"
        },
        {
            "barcode": "171131811",
            "dpc": "03013418101",
            "name": "ជា យឹន"
        },
        {
            "barcode": "171131812",
            "dpc": "03013418201",
            "name": "កែង រ៉ា"
        },
        {
            "barcode": "171131813",
            "dpc": "03013418301",
            "name": "សេង សាត"
        },
        {
            "barcode": "171131814",
            "dpc": "03013418401",
            "name": "អែម សៀ"
        },
        {
            "barcode": "171131815",
            "dpc": "03013418501",
            "name": "ចៅ ឈឿត"
        },
        {
            "barcode": "171131816",
            "dpc": "03013418601",
            "name": "សំ សុធា"
        },
        {
            "barcode": "171131817",
            "dpc": "03013418701",
            "name": "ឃឹម កន្យាណ"
        },
        {
            "barcode": "171131818",
            "dpc": "03013418901",
            "name": "ណម គង់"
        },
        {
            "barcode": "171131819",
            "dpc": "03013419001",
            "name": "សឹម កំណត់"
        },
        {
            "barcode": "171131820",
            "dpc": "03013419201",
            "name": "យូ ចន្ថា"
        },
        {
            "barcode": "171131821",
            "dpc": "03013419301",
            "name": "ហាច គឹមហុង"
        },
        {
            "barcode": "171131822",
            "dpc": "03013419401",
            "name": "ស្រី បេង"
        },
        {
            "barcode": "171131823",
            "dpc": "03013419501",
            "name": "ចៅ កាំចាន់"
        },
        {
            "barcode": "171131824",
            "dpc": "03013419701",
            "name": "ចៅ លី"
        },
        {
            "barcode": "171131825",
            "dpc": "03013419801",
            "name": "ឃួយ ស៊ីម"
        },
        {
            "barcode": "171131826",
            "dpc": "03013419901",
            "name": "វ័រ ហេង"
        },
        {
            "barcode": "171131827",
            "dpc": "03013420001",
            "name": "យ៉ាំ បូ"
        },
        {
            "barcode": "171131828",
            "dpc": "03013420101",
            "name": "ចុង ជួយ"
        },
        {
            "barcode": "171131829",
            "dpc": "03013420201",
            "name": "ឈឿង សំណាង"
        },
        {
            "barcode": "171131830",
            "dpc": "03013420301",
            "name": "អំ សំអុន"
        },
        {
            "barcode": "171131831",
            "dpc": "03013420401",
            "name": "ឡោ រង់"
        },
        {
            "barcode": "171131832",
            "dpc": "03013420501",
            "name": "ហោ លី"
        },
        {
            "barcode": "171131833",
            "dpc": "03013420601",
            "name": "ស សុវណ្ណ"
        },
        {
            "barcode": "171131834",
            "dpc": "03013420701",
            "name": "ហោ គឹមតុល"
        },
        {
            "barcode": "171131835",
            "dpc": "03013420801",
            "name": "ចាន់ គឹមអន"
        },
        {
            "barcode": "171131836",
            "dpc": "03013420901",
            "name": "អេង មួយលី"
        },
        {
            "barcode": "171131837",
            "dpc": "03013421001",
            "name": "យឹន វុតធី"
        },
        {
            "barcode": "171131838",
            "dpc": "03013421101",
            "name": "ថែ  ឡាន់"
        },
        {
            "barcode": "171131839",
            "dpc": "03013421201",
            "name": "ផាន  ជៀម"
        },
        {
            "barcode": "171131840",
            "dpc": "03013421301",
            "name": "កោ  សុថា"
        },
        {
            "barcode": "171131841",
            "dpc": "03013421501",
            "name": "ឡាយ  រត្ន័"
        },
        {
            "barcode": "171131842",
            "dpc": "03013421601",
            "name": "ផាន  ភឿន"
        },
        {
            "barcode": "171131843",
            "dpc": "03013421701",
            "name": "ឆាន  កឹង"
        },
        {
            "barcode": "171131844",
            "dpc": "03013422001",
            "name": "កេវ  រីជុំ"
        },
        {
            "barcode": "171131845",
            "dpc": "03013422101",
            "name": "ជែ  ជង់"
        },
        {
            "barcode": "171131846",
            "dpc": "03013422201",
            "name": "ប៉ោង  ម៉េង"
        },
        {
            "barcode": "171131847",
            "dpc": "03013422301",
            "name": "អនុវិទ្យាល័យ អូរដំបង ១"
        },
        {
            "barcode": "171131848",
            "dpc": "03013422401",
            "name": "ជិន  ចាន់រស្មី"
        },
        {
            "barcode": "171131849",
            "dpc": "03013422501",
            "name": "ចាន់  នូ"
        },
        {
            "barcode": "171131850",
            "dpc": "03013422601",
            "name": "យិង  កាង"
        },
        {
            "barcode": "171131851",
            "dpc": "03013422701",
            "name": "យិន  កុង"
        },
        {
            "barcode": "171131852",
            "dpc": "03013422801",
            "name": "ចៅ  សាន់ហ្វាត"
        },
        {
            "barcode": "171131853",
            "dpc": "03013422901",
            "name": "ឡាច  វឌ្ឍនៈ"
        },
        {
            "barcode": "171131854",
            "dpc": "03013423001",
            "name": "ជា  ហេង"
        },
        {
            "barcode": "171131855",
            "dpc": "03013423101",
            "name": "ជិន សាម៊ុយ"
        },
        {
            "barcode": "171131856",
            "dpc": "03013423201",
            "name": "ថ្លាង  សាវឿត"
        },
        {
            "barcode": "171131857",
            "dpc": "03013423301",
            "name": "កឹម  ឡុង"
        },
        {
            "barcode": "171131858",
            "dpc": "03013423401",
            "name": "ឈុន  ហុង"
        },
        {
            "barcode": "171131859",
            "dpc": "03013423501",
            "name": "សឹង  គឹមលន់"
        },
        {
            "barcode": "171131860",
            "dpc": "03013423601",
            "name": "ហម  គឹមឈួយ"
        },
        {
            "barcode": "171131861",
            "dpc": "03013423701",
            "name": "ឡាច  តូច"
        },
        {
            "barcode": "171131862",
            "dpc": "03013423801",
            "name": "ស្វាយ  ចំរ៉ាត់"
        },
        {
            "barcode": "171131863",
            "dpc": "03013423901",
            "name": "ជុំ  សំបូរ"
        },
        {
            "barcode": "171131864",
            "dpc": "03013424001",
            "name": "ណៃ  ហេង"
        },
        {
            "barcode": "171131865",
            "dpc": "03013424101",
            "name": "វឿន  សុផុន"
        },
        {
            "barcode": "171131866",
            "dpc": "03013424401",
            "name": "សួន  ឈៀង"
        },
        {
            "barcode": "171131867",
            "dpc": "03013424501",
            "name": "ហុង  គង់"
        },
        {
            "barcode": "171131868",
            "dpc": "03013424601",
            "name": "ឡុច  ហួរលាង"
        },
        {
            "barcode": "171131869",
            "dpc": "03013424701",
            "name": "ព្រឿង  ពៅ"
        },
        {
            "barcode": "171131870",
            "dpc": "03013424801",
            "name": "មឿន  ពុយ ៣"
        },
        {
            "barcode": "171131871",
            "dpc": "03013424901",
            "name": "មឿន  ពុយ ២"
        },
        {
            "barcode": "171131872",
            "dpc": "03013425001",
            "name": "ហម  រដ្ឋា"
        },
        {
            "barcode": "171131873",
            "dpc": "03013425101",
            "name": "និន  រិន"
        },
        {
            "barcode": "171131874",
            "dpc": "03013425201",
            "name": "យិម  ប៊ុនឆប"
        },
        {
            "barcode": "171131875",
            "dpc": "03013425301",
            "name": "ម៉ាក  ចិន"
        },
        {
            "barcode": "171131876",
            "dpc": "03013425401",
            "name": "ហៀង  សាវ៉ន"
        },
        {
            "barcode": "171131877",
            "dpc": "03013425501",
            "name": "ចាន់  អាន"
        },
        {
            "barcode": "171131878",
            "dpc": "03013425601",
            "name": "ជុំ  ណារិទ្ធ"
        },
        {
            "barcode": "171131879",
            "dpc": "03013425701",
            "name": "ហាក  ចំរើន"
        },
        {
            "barcode": "171131880",
            "dpc": "03013425801",
            "name": "ឌុច  គន្ធា"
        },
        {
            "barcode": "171131881",
            "dpc": "03013425901",
            "name": "ឌុច  ឈត"
        },
        {
            "barcode": "171131882",
            "dpc": "03013426001",
            "name": "ឡុច  ស៊ុន"
        },
        {
            "barcode": "171131883",
            "dpc": "03013426101",
            "name": "មាស  សាវឿត"
        },
        {
            "barcode": "171131884",
            "dpc": "03013426201",
            "name": "សួន  ហឿង"
        },
        {
            "barcode": "171131885",
            "dpc": "03013426301",
            "name": "លី  អូន"
        },
        {
            "barcode": "171131886",
            "dpc": "03013426401",
            "name": "ឡៅ  ហុង"
        },
        {
            "barcode": "171131887",
            "dpc": "03013426501",
            "name": "ឈីវ គង់"
        },
        {
            "barcode": "171131888",
            "dpc": "03013426601",
            "name": "ស៊ុយ  សុវត្ថារ៉ា"
        },
        {
            "barcode": "171131889",
            "dpc": "03013426801",
            "name": "វរ័  ដារ៉ា"
        },
        {
            "barcode": "171131890",
            "dpc": "03013426901",
            "name": "លឹម  ស៊ីណា"
        },
        {
            "barcode": "171131891",
            "dpc": "03013427001",
            "name": "ហេង   សេត្ថា"
        },
        {
            "barcode": "171131892",
            "dpc": "03013427101",
            "name": "ដុស  ម៉ៅ"
        },
        {
            "barcode": "171131893",
            "dpc": "03013427201",
            "name": "ដុស  ផល"
        },
        {
            "barcode": "171131894",
            "dpc": "03013427301",
            "name": "គឹម  សុវណ្ណ"
        },
        {
            "barcode": "171131895",
            "dpc": "03013427401",
            "name": "ឈី  គឹមឆៃ"
        },
        {
            "barcode": "171131896",
            "dpc": "03013428201",
            "name": "ឌី  តុលា"
        },
        {
            "barcode": "171131897",
            "dpc": "03013428301",
            "name": "សៅ  ពិសិដ្ឋ"
        },
        {
            "barcode": "171131898",
            "dpc": "03013428501",
            "name": "ដាំ  សុង"
        },
        {
            "barcode": "171131899",
            "dpc": "03013428601",
            "name": "តាំង  ប៊ុនហឿម"
        },
        {
            "barcode": "171131900",
            "dpc": "03013429201",
            "name": "កែវ  ភិរុណ"
        },
        {
            "barcode": "171131901",
            "dpc": "03013429301",
            "name": "ឈឿន  ភេង"
        },
        {
            "barcode": "171131902",
            "dpc": "03013429401",
            "name": "ឌី  ចិន្តា"
        },
        {
            "barcode": "171131903",
            "dpc": "03013429601",
            "name": "អូច  ចាន់លី"
        },
        {
            "barcode": "171131904",
            "dpc": "03013429701",
            "name": "ផល  សុធា"
        },
        {
            "barcode": "171131905",
            "dpc": "03013429801",
            "name": "ប្រាក់  កូណាល់"
        },
        {
            "barcode": "171131906",
            "dpc": "03013429901",
            "name": "ជូន  លឿត"
        },
        {
            "barcode": "171131907",
            "dpc": "03013430001",
            "name": "ដុស  ពេញ"
        },
        {
            "barcode": "171131908",
            "dpc": "03013430101",
            "name": "ហាក់  ឡឹង"
        },
        {
            "barcode": "171131909",
            "dpc": "03013430301",
            "name": "ស៊ឹម  ប៊ុនវី"
        },
        {
            "barcode": "171131910",
            "dpc": "03013430401",
            "name": "ញឹក  ផល្លា"
        },
        {
            "barcode": "171131911",
            "dpc": "03013430501",
            "name": "ហឹម  សុភាព"
        },
        {
            "barcode": "171131912",
            "dpc": "03013430601",
            "name": "សេង  ហ៊ត"
        },
        {
            "barcode": "171131913",
            "dpc": "03013430701",
            "name": "ហ៊ាន  ម៉ុនសុវណ្ណ"
        },
        {
            "barcode": "171131914",
            "dpc": "03013430801",
            "name": "យឿត  ប៊ុនយីម"
        },
        {
            "barcode": "171131915",
            "dpc": "03013430901",
            "name": "ធឿម  ធឿន"
        },
        {
            "barcode": "171131916",
            "dpc": "03013431001",
            "name": "ចាន់  ឌីភិរម្យ"
        },
        {
            "barcode": "171131917",
            "dpc": "03013431101",
            "name": "ខុង  សុវណ្ណ"
        },
        {
            "barcode": "171131918",
            "dpc": "03013431301",
            "name": "ហ៊ុយ  ចន្ថា"
        },
        {
            "barcode": "171131919",
            "dpc": "03013431401",
            "name": "ស៊ុម  សាន្ត"
        },
        {
            "barcode": "171131920",
            "dpc": "03013431501",
            "name": "តោ   ចន្ធូ"
        },
        {
            "barcode": "171131921",
            "dpc": "03013431601",
            "name": "ម៉ៅ  វិជិត"
        },
        {
            "barcode": "171131922",
            "dpc": "03013431701",
            "name": "ហែម  សុជាតិ"
        },
        {
            "barcode": "171131923",
            "dpc": "03013431801",
            "name": "ព្រឿង  ឃុន"
        },
        {
            "barcode": "171131924",
            "dpc": "03013431901",
            "name": "េព្រឿង  ឃាន"
        },
        {
            "barcode": "171131925",
            "dpc": "03013432001",
            "name": "ជាង  លី"
        },
        {
            "barcode": "171131926",
            "dpc": "03013432101",
            "name": "ជា  វណ្ណា"
        },
        {
            "barcode": "171131927",
            "dpc": "03013432301",
            "name": "មិន  ណូយ"
        },
        {
            "barcode": "171131928",
            "dpc": "03013432401",
            "name": "ឈុត  សំណាង"
        },
        {
            "barcode": "171131929",
            "dpc": "03013432501",
            "name": "ហ៊ុល  គឹមហៀង"
        },
        {
            "barcode": "171131930",
            "dpc": "03013432601",
            "name": "ម៉ុក  យឿម"
        },
        {
            "barcode": "171131931",
            "dpc": "03013432901",
            "name": "ព្រំ  ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171131932",
            "dpc": "03013433001",
            "name": "ឃី  សុភាព"
        },
        {
            "barcode": "171131933",
            "dpc": "03013433101",
            "name": "យូ  មេត្តា"
        },
        {
            "barcode": "171131934",
            "dpc": "03013433201",
            "name": "ព្រំ  មាសគ្រឹះស្នា"
        },
        {
            "barcode": "171131935",
            "dpc": "03013433301",
            "name": "ញ៉ុក  ចន្តា"
        },
        {
            "barcode": "171131936",
            "dpc": "03013433501",
            "name": "ឈុត  យ៉ាន"
        },
        {
            "barcode": "171131937",
            "dpc": "03013433801",
            "name": "ម៉ៅ  ណារិន"
        },
        {
            "barcode": "171131938",
            "dpc": "03013434001",
            "name": "កើត  ប៊ុនុឈើន"
        },
        {
            "barcode": "171131939",
            "dpc": "03013434101",
            "name": "ម៉ៅ  ណារឿន"
        },
        {
            "barcode": "171131940",
            "dpc": "03013434201",
            "name": "ជូប  ប៊ុនទៀង"
        },
        {
            "barcode": "171131941",
            "dpc": "03013434401",
            "name": "ប៉ូ  អូន"
        },
        {
            "barcode": "171131942",
            "dpc": "03013434501",
            "name": "ប៉ូ  សឿត"
        },
        {
            "barcode": "171131943",
            "dpc": "03013434601",
            "name": "ពុំ  នឹម"
        },
        {
            "barcode": "171131944",
            "dpc": "03013434701",
            "name": "គង់  សុខ"
        },
        {
            "barcode": "171131945",
            "dpc": "03013434901",
            "name": "កើត  សារិន"
        },
        {
            "barcode": "171131946",
            "dpc": "03013435001",
            "name": "ញឹក  ស៊ត"
        },
        {
            "barcode": "171131947",
            "dpc": "03013435101",
            "name": "ថង  ណយ"
        },
        {
            "barcode": "171131948",
            "dpc": "03013435201",
            "name": "សឿង  ទី"
        },
        {
            "barcode": "171131949",
            "dpc": "03013435301",
            "name": "ឡាំ  មឿន"
        },
        {
            "barcode": "171131950",
            "dpc": "03013435401",
            "name": "យាយ អូស្ត្រាលី"
        },
        {
            "barcode": "171131951",
            "dpc": "03013435501",
            "name": "ថាច់  ចិន្តា"
        },
        {
            "barcode": "171131952",
            "dpc": "03013435601",
            "name": "ហ៊ឹម  សុខុម"
        },
        {
            "barcode": "171131953",
            "dpc": "03013435701",
            "name": "យឹន  ឃុន"
        },
        {
            "barcode": "171131954",
            "dpc": "03013435801",
            "name": "យឹន ចាន់ណា"
        },
        {
            "barcode": "171131955",
            "dpc": "03013435901",
            "name": "ឆែម  ប៊ុនឈឹន"
        },
        {
            "barcode": "171131956",
            "dpc": "03013436001",
            "name": "ទ្រី  គឹមសួន"
        },
        {
            "barcode": "171131957",
            "dpc": "03013436101",
            "name": "ឡោះ  សាវុធ"
        },
        {
            "barcode": "171131958",
            "dpc": "03013436201",
            "name": "ឡោះ  សំណាង"
        },
        {
            "barcode": "171131959",
            "dpc": "03013436301",
            "name": "ឡុញ  ឌឿន"
        },
        {
            "barcode": "171131960",
            "dpc": "03013436401",
            "name": "សុខ  ប្រុស"
        },
        {
            "barcode": "171131961",
            "dpc": "03013436601",
            "name": "ហឹម  ប៊ុនហឿន"
        },
        {
            "barcode": "171131962",
            "dpc": "03013436701",
            "name": "ប៊ុត  ស៊ីណា"
        },
        {
            "barcode": "171131963",
            "dpc": "03013436801",
            "name": "គឹម  ប៊ុនឈៀប ២"
        },
        {
            "barcode": "171131964",
            "dpc": "03013436901",
            "name": "ញ៉ែម  សំអឿន"
        },
        {
            "barcode": "171131965",
            "dpc": "03013437001",
            "name": "សេង  សុវណ្ណ"
        },
        {
            "barcode": "171131966",
            "dpc": "03013437101",
            "name": "ឡេង  បូរ៉ា"
        },
        {
            "barcode": "171131967",
            "dpc": "03013437201",
            "name": "ឡោ  ស៊ីនួន"
        },
        {
            "barcode": "171131968",
            "dpc": "03013437301",
            "name": "គង់  ឈួន"
        },
        {
            "barcode": "171131969",
            "dpc": "03013437401",
            "name": "សៀវ  រឿប"
        },
        {
            "barcode": "171131970",
            "dpc": "03013437501",
            "name": "សៅ  ស៊ីណា"
        },
        {
            "barcode": "171131971",
            "dpc": "03013437601",
            "name": "ស្ងួន  រៀប"
        },
        {
            "barcode": "171131972",
            "dpc": "03013437801",
            "name": "ឡោ  ណាល់"
        },
        {
            "barcode": "171131973",
            "dpc": "03013437901",
            "name": "សែន  ចំរើន"
        },
        {
            "barcode": "171131974",
            "dpc": "03013438001",
            "name": "សឹម  លី"
        },
        {
            "barcode": "171131975",
            "dpc": "03013438101",
            "name": "អេង  សុគន្ធា"
        },
        {
            "barcode": "171131976",
            "dpc": "03013438201",
            "name": "ផន  សុភាព"
        },
        {
            "barcode": "171131977",
            "dpc": "03013438301",
            "name": "លឿង  បូ"
        },
        {
            "barcode": "171131978",
            "dpc": "03013438401",
            "name": "ផល  សេងហ៊ួន"
        },
        {
            "barcode": "171131979",
            "dpc": "03013438501",
            "name": "ជុំំ  ណារិន"
        },
        {
            "barcode": "171131980",
            "dpc": "03013438601",
            "name": "ហ៊ឹម  យ៉ាន់"
        },
        {
            "barcode": "171131981",
            "dpc": "03013438701",
            "name": "ប៉ៅ  សបិន"
        },
        {
            "barcode": "171131982",
            "dpc": "03013438801",
            "name": "ផ្ទះ. ក. ភ.វត្តតាមិម​"
        },
        {
            "barcode": "171131983",
            "dpc": "03013438901",
            "name": "សេន  សុធី"
        },
        {
            "barcode": "171131984",
            "dpc": "03013439001",
            "name": "ហួត  ប៊ុនធឿន"
        },
        {
            "barcode": "171131985",
            "dpc": "03013439201",
            "name": "មឿត  ស្រីមុំ"
        },
        {
            "barcode": "171131986",
            "dpc": "03013439301",
            "name": "ស  សារ៉ុន"
        },
        {
            "barcode": "171131987",
            "dpc": "03013439401",
            "name": "ម៉ៅ  មឿត"
        },
        {
            "barcode": "171131988",
            "dpc": "03013439501",
            "name": "តិ  ហុង"
        },
        {
            "barcode": "171131989",
            "dpc": "03013439601",
            "name": "តិ  ហ៊ុយ"
        },
        {
            "barcode": "171131990",
            "dpc": "03013439701",
            "name": "អ៊ុំ  មៀន"
        },
        {
            "barcode": "171131991",
            "dpc": "03013439801",
            "name": "សារុំ  ចាន់ថា"
        },
        {
            "barcode": "171131992",
            "dpc": "03013439901",
            "name": "នួម  ណារី"
        },
        {
            "barcode": "171131993",
            "dpc": "03013440001",
            "name": "តូច  ជុំ"
        },
        {
            "barcode": "171131994",
            "dpc": "03013440101",
            "name": "ម៉ៅ  វណ្ណនី"
        },
        {
            "barcode": "171131995",
            "dpc": "03013440201",
            "name": "ញ៉ែម  ជាបឡេង"
        },
        {
            "barcode": "171131996",
            "dpc": "03013440301",
            "name": "ឈន   វណ្ណឌី"
        },
        {
            "barcode": "171131997",
            "dpc": "03013440401",
            "name": "ហូរ  ឈុន"
        },
        {
            "barcode": "171131998",
            "dpc": "03013440501",
            "name": "លី  រដ្ឋា"
        },
        {
            "barcode": "171131999",
            "dpc": "03013440601",
            "name": "យ៉ាត  ជឿត"
        },
        {
            "barcode": "171132000",
            "dpc": "03013440701",
            "name": "គង់  ស៊ីយ៉ូន"
        },
        {
            "barcode": "171132001",
            "dpc": "03013440801",
            "name": "វ៉ាន  ប៊ុនឆៃ"
        },
        {
            "barcode": "171132002",
            "dpc": "03013440901",
            "name": "ផាត  ភារៈ"
        },
        {
            "barcode": "171132003",
            "dpc": "03013441001",
            "name": "ផាត  សាន្តប៉ា"
        },
        {
            "barcode": "171132004",
            "dpc": "03013441101",
            "name": "សាន់  ចិត្ត"
        },
        {
            "barcode": "171132005",
            "dpc": "03013441201",
            "name": "គង់  សុគន្ធី"
        },
        {
            "barcode": "171132006",
            "dpc": "03013441301",
            "name": "ចាប  ជេតនា"
        },
        {
            "barcode": "171132007",
            "dpc": "03013441401",
            "name": "គង់  សំណាង"
        },
        {
            "barcode": "171132008",
            "dpc": "03013441501",
            "name": "សុខ  អេង"
        },
        {
            "barcode": "171132009",
            "dpc": "03013441601",
            "name": "ឆាយ  កុសល"
        },
        {
            "barcode": "171132010",
            "dpc": "03013441701",
            "name": "ចែ  សៀកគីម"
        },
        {
            "barcode": "171132011",
            "dpc": "03013441801",
            "name": "ហេង  ហម"
        },
        {
            "barcode": "171132012",
            "dpc": "03013441901",
            "name": "ឡុច  វន"
        },
        {
            "barcode": "171132013",
            "dpc": "03013442001",
            "name": "វឿត  សម្ផស្ស"
        },
        {
            "barcode": "171132014",
            "dpc": "03013442101",
            "name": "មាស  សំអឿន"
        },
        {
            "barcode": "171132015",
            "dpc": "03013442201",
            "name": "ហ៊ុន  ធើន"
        },
        {
            "barcode": "171132016",
            "dpc": "03013442301",
            "name": "មាស  ប៊ុនធឿន"
        },
        {
            "barcode": "171132017",
            "dpc": "03013442401",
            "name": "សើ  ប៊ុននឿន"
        },
        {
            "barcode": "171132018",
            "dpc": "03013442501",
            "name": "ព្រហ្ម  ស៊ីណាត"
        },
        {
            "barcode": "171132019",
            "dpc": "03013442601",
            "name": "ផា  សូវ"
        },
        {
            "barcode": "171132020",
            "dpc": "03013442701",
            "name": "រស់  សារ៉ុន"
        },
        {
            "barcode": "171132021",
            "dpc": "03013442801",
            "name": "តាន់  ហុងលឹម"
        },
        {
            "barcode": "171132022",
            "dpc": "03013442901",
            "name": "លឹម  ហឿម"
        },
        {
            "barcode": "171132023",
            "dpc": "03013443201",
            "name": "រ៉ាយ ភីរម្យ"
        },
        {
            "barcode": "171132024",
            "dpc": "03013443301",
            "name": "ម៉ា  ទីនេ"
        },
        {
            "barcode": "171132025",
            "dpc": "03013443401",
            "name": "រឿន   ប៊ុនរ៉ាត់"
        },
        {
            "barcode": "171132026",
            "dpc": "03013443501",
            "name": "ប៊ូ  ថា"
        },
        {
            "barcode": "171132027",
            "dpc": "03013443601",
            "name": "ឈ  សាវ៉ុន"
        },
        {
            "barcode": "171132028",
            "dpc": "03013443701",
            "name": "លឹម ចាន់ដារ៉ា"
        },
        {
            "barcode": "171132029",
            "dpc": "03013443801",
            "name": "គឹម  វ៉ានថា"
        },
        {
            "barcode": "171132030",
            "dpc": "03013443901",
            "name": "ថុន  បាន"
        },
        {
            "barcode": "171132031",
            "dpc": "03013444101",
            "name": "វ៉ាន  តារ៉ា"
        },
        {
            "barcode": "171132032",
            "dpc": "03013444201",
            "name": "ផាន  សំណាង"
        },
        {
            "barcode": "171132033",
            "dpc": "03013444301",
            "name": "ផាន  រ៉ា"
        },
        {
            "barcode": "171132034",
            "dpc": "03013444401",
            "name": "ឆាន   កុសល់"
        },
        {
            "barcode": "171132035",
            "dpc": "03013444501",
            "name": "ជៀម  សេង"
        },
        {
            "barcode": "171132036",
            "dpc": "03013444601",
            "name": "តូយ  ស្រីមុំ"
        },
        {
            "barcode": "171132037",
            "dpc": "03013444701",
            "name": "ណាត  ចិន្តា"
        },
        {
            "barcode": "171132038",
            "dpc": "03013444801",
            "name": "ថើន  ដួងចន្ទ័"
        },
        {
            "barcode": "171132039",
            "dpc": "03013445001",
            "name": "ម៉ាប់  កេត"
        },
        {
            "barcode": "171132040",
            "dpc": "03013445201",
            "name": "ម៉ក ប៊ុនទិត្យ"
        },
        {
            "barcode": "171132041",
            "dpc": "03013445301",
            "name": "ទេន  ប៊ុនហឹង"
        },
        {
            "barcode": "171132042",
            "dpc": "03013445501",
            "name": "លាស់  ហាង"
        },
        {
            "barcode": "171132043",
            "dpc": "03013445601",
            "name": "ជា  ម៉េង"
        },
        {
            "barcode": "171132044",
            "dpc": "03013445801",
            "name": "លី  ខ្លឿន"
        },
        {
            "barcode": "171132045",
            "dpc": "03013445901",
            "name": "តឹក  សាវង្ស"
        },
        {
            "barcode": "171132046",
            "dpc": "03013446001",
            "name": "យ៉េម  យិន"
        },
        {
            "barcode": "171132047",
            "dpc": "03013446201",
            "name": "ហូរ   ផានី"
        },
        {
            "barcode": "171132048",
            "dpc": "03013446301",
            "name": "អឿ  កំសាន្ត"
        },
        {
            "barcode": "171132049",
            "dpc": "03013446401",
            "name": "ខួញ  សាម៉េត"
        },
        {
            "barcode": "171132050",
            "dpc": "03013446501",
            "name": "ញ៉ែម  សំណាង"
        },
        {
            "barcode": "171132051",
            "dpc": "03013446701",
            "name": "ហាយ  សំណាង"
        },
        {
            "barcode": "171132052",
            "dpc": "03013446801",
            "name": "ណន  ម៉ៅ"
        },
        {
            "barcode": "171132053",
            "dpc": "03013446901",
            "name": "តឿ  សាវុន"
        },
        {
            "barcode": "171132054",
            "dpc": "03013447001",
            "name": "ភោ ស៊ីថា"
        },
        {
            "barcode": "171132055",
            "dpc": "03013447101",
            "name": "ភោ សម្បត្តិ"
        },
        {
            "barcode": "171132056",
            "dpc": "03013447201",
            "name": "នី អេង"
        },
        {
            "barcode": "171132057",
            "dpc": "03013447301",
            "name": "មឿន  ម៉ារ័ត្ន"
        },
        {
            "barcode": "171132058",
            "dpc": "03013447501",
            "name": "រឿន ទឿម"
        },
        {
            "barcode": "171132059",
            "dpc": "03013447701",
            "name": "ខិល លឿ"
        },
        {
            "barcode": "171132060",
            "dpc": "03013447801",
            "name": "មឿន សិត"
        },
        {
            "barcode": "171132061",
            "dpc": "03013447901",
            "name": "វ៉ាត សុហេង"
        }
    ];

barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
