let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=

    [
        {
            "barcode": "171133179",
            "dpc": "03023500101",
            "name": "រិន ណូក"
        },
        {
            "barcode": "171133180",
            "dpc": "03023500201",
            "name": "យូ ថៃ"
        },
        {
            "barcode": "171133181",
            "dpc": "03023500301",
            "name": "អ៊ុក រ៉ាន់"
        },
        {
            "barcode": "171133182",
            "dpc": "03023500401",
            "name": "ន៉ូ ចាន់ណារី"
        },
        {
            "barcode": "171133183",
            "dpc": "03023500501",
            "name": "ចៅ សំរិត"
        },
        {
            "barcode": "171133184",
            "dpc": "03023500601",
            "name": "ហេង គឹមសួ"
        },
        {
            "barcode": "171133185",
            "dpc": "03023500701",
            "name": "ហុក គីម"
        },
        {
            "barcode": "171133186",
            "dpc": "03023500801",
            "name": "ហ៊ួន ឃុត"
        },
        {
            "barcode": "171133187",
            "dpc": "03023500901",
            "name": "ទ្រី ភក្តី"
        },
        {
            "barcode": "171133188",
            "dpc": "03023501001",
            "name": "សៀង មុំ"
        },
        {
            "barcode": "171133189",
            "dpc": "03023501101",
            "name": "សែម សំអាត"
        },
        {
            "barcode": "171133190",
            "dpc": "03023501201",
            "name": "សយ សម្ជស្ស"
        },
        {
            "barcode": "171133191",
            "dpc": "03023501301",
            "name": "ម៉ៅ សាម៉ុយ"
        },
        {
            "barcode": "171133192",
            "dpc": "03023501401",
            "name": "ម៉ៅ វិចិត្រ"
        },
        {
            "barcode": "171133193",
            "dpc": "03023501501",
            "name": "លី រ៉ាសាត"
        },
        {
            "barcode": "171133194",
            "dpc": "03023501701",
            "name": "ឆាយ ផាត"
        },
        {
            "barcode": "171133195",
            "dpc": "03023501801",
            "name": "ឃឿន សំ"
        },
        {
            "barcode": "171133196",
            "dpc": "03023501901",
            "name": "អ៊ួច ឪរ៉ាល់"
        },
        {
            "barcode": "171133197",
            "dpc": "03023502001",
            "name": "គង់ ប៊ុនលី"
        },
        {
            "barcode": "171133198",
            "dpc": "03023502101",
            "name": "ហេង ឡុង"
        },
        {
            "barcode": "171133199",
            "dpc": "03023502201",
            "name": "សាត សុខា"
        },
        {
            "barcode": "171133200",
            "dpc": "03023502301",
            "name": "ផុន សំ"
        },
        {
            "barcode": "171133201",
            "dpc": "03023502401",
            "name": "ញ៉ឹក សាគុណ"
        },
        {
            "barcode": "171133202",
            "dpc": "03023502601",
            "name": "ពេជ្រ ចាន់ដារ៉ា"
        },
        {
            "barcode": "171133203",
            "dpc": "03023502701",
            "name": "ឯក កុសល់"
        },
        {
            "barcode": "171133204",
            "dpc": "03023502801",
            "name": "កែវ សុខសាន្ត"
        },
        {
            "barcode": "171133205",
            "dpc": "03023502901",
            "name": "ដាំ សារុន"
        },
        {
            "barcode": "171133206",
            "dpc": "03023503001",
            "name": "នង មាសរិទ្ធិ"
        },
        {
            "barcode": "171133207",
            "dpc": "03023503201",
            "name": "ណន នី"
        },
        {
            "barcode": "171133208",
            "dpc": "03023503301",
            "name": "កុក ហាន"
        },
        {
            "barcode": "171133209",
            "dpc": "03023503601",
            "name": "ដិប គឹមនី"
        },
        {
            "barcode": "171133210",
            "dpc": "03023503701",
            "name": "ទៀប វិរ:"
        },
        {
            "barcode": "171133211",
            "dpc": "03023503801",
            "name": "វង្ស ចំរើន"
        },
        {
            "barcode": "171133212",
            "dpc": "03023503901",
            "name": "ចាន់ វិច្ចិកា"
        },
        {
            "barcode": "171133213",
            "dpc": "03023504001",
            "name": "វ៉ាន់ ហម"
        },
        {
            "barcode": "171133214",
            "dpc": "03023504101",
            "name": "គី យូឡុង"
        },
        {
            "barcode": "171133215",
            "dpc": "03023504201",
            "name": "ព្រហ្ម សេរីបុត្រ"
        },
        {
            "barcode": "171133216",
            "dpc": "03023504301",
            "name": "សោម ពិសិដ្ធ"
        },
        {
            "barcode": "171133217",
            "dpc": "03023504501",
            "name": "ជ័យ សារី"
        },
        {
            "barcode": "171133218",
            "dpc": "03023504601",
            "name": "សួន សានិត"
        },
        {
            "barcode": "171133219",
            "dpc": "03023504701",
            "name": "ម៉ុម សឿន"
        },
        {
            "barcode": "171133220",
            "dpc": "03023504801",
            "name": "ស៊ុន គង់"
        },
        {
            "barcode": "171133221",
            "dpc": "03023504901",
            "name": "ស្តង់ លេខ៧១"
        },
        {
            "barcode": "171133222",
            "dpc": "03023505001",
            "name": "ប៉ាល ស្រីលក្ខ"
        },
        {
            "barcode": "171133223",
            "dpc": "03023505101",
            "name": "សឿត តឿ"
        },
        {
            "barcode": "171133224",
            "dpc": "03023505201",
            "name": "​ប្រាក់ សុទ្ទដារ៉ា"
        },
        {
            "barcode": "171133225",
            "dpc": "03023505301",
            "name": "វ៉ាន់ រត្ន័"
        },
        {
            "barcode": "171133226",
            "dpc": "03023505401",
            "name": "ទិត្យ សំពៀក"
        },
        {
            "barcode": "171133227",
            "dpc": "03023505501",
            "name": "ចាន់ សារិន"
        },
        {
            "barcode": "171133228",
            "dpc": "03023505601",
            "name": "យ៉ាត ពៅ"
        },
        {
            "barcode": "171133229",
            "dpc": "03023505701",
            "name": "ពោធិ មានរិទ្ធ"
        },
        {
            "barcode": "171133230",
            "dpc": "03023505801",
            "name": "តុន សុគុណ"
        },
        {
            "barcode": "171133231",
            "dpc": "03023505901",
            "name": "ប្រាក់ ណាវី"
        },
        {
            "barcode": "171133232",
            "dpc": "03023506001",
            "name": "ឡង អឿន"
        },
        {
            "barcode": "171133233",
            "dpc": "03023506101",
            "name": "ប្រាក់ ឌារ៉ា"
        },
        {
            "barcode": "171133234",
            "dpc": "03023506201",
            "name": "សុខ សឿន"
        },
        {
            "barcode": "171133235",
            "dpc": "03023506301",
            "name": "ប៉ា យ៉ន"
        },
        {
            "barcode": "171133236",
            "dpc": "03023506501",
            "name": "សារ ភក្តី"
        },
        {
            "barcode": "171133237",
            "dpc": "03023506601",
            "name": "ហៀង ហ៊ុច"
        },
        {
            "barcode": "171133238",
            "dpc": "03023506701",
            "name": "ពេញ សុន"
        },
        {
            "barcode": "171133239",
            "dpc": "03023506801",
            "name": "ខោល ពៅ"
        },
        {
            "barcode": "171133240",
            "dpc": "03023506901",
            "name": "ខោល មីឌី"
        },
        {
            "barcode": "171133241",
            "dpc": "03023507001",
            "name": "គឹម ស្រ៊ុន"
        },
        {
            "barcode": "171133242",
            "dpc": "03023507101",
            "name": "ឃួន ចំរើន"
        },
        {
            "barcode": "171133243",
            "dpc": "03023507201",
            "name": "ចាន់ សួរ"
        },
        {
            "barcode": "171133244",
            "dpc": "03023507301",
            "name": "ញ៊ឹក សុខា"
        },
        {
            "barcode": "171133245",
            "dpc": "03023507401",
            "name": "ថុល ស៊ីថាត"
        },
        {
            "barcode": "171133246",
            "dpc": "03023507501",
            "name": "បូ ភី២"
        },
        {
            "barcode": "171133247",
            "dpc": "03023507601",
            "name": "ឈឹម ស៊ី"
        },
        {
            "barcode": "171133248",
            "dpc": "03023507701",
            "name": "បាន ឡង"
        },
        {
            "barcode": "171133249",
            "dpc": "03023507801",
            "name": "ណី ស្រីដា"
        },
        {
            "barcode": "171133250",
            "dpc": "03023507901",
            "name": "គីម សុខនី"
        },
        {
            "barcode": "171133251",
            "dpc": "03023508001",
            "name": "សុខ សាវ៉ាត"
        },
        {
            "barcode": "171133252",
            "dpc": "03023508101",
            "name": "លឹម ហេង"
        },
        {
            "barcode": "171133253",
            "dpc": "03023508201",
            "name": "សុះ សុខគី"
        },
        {
            "barcode": "171133254",
            "dpc": "03023508301",
            "name": "សេន រ៉ាវី"
        },
        {
            "barcode": "171133255",
            "dpc": "03023508401",
            "name": "ហង ម៉ាន់"
        },
        {
            "barcode": "171133256",
            "dpc": "03023508501",
            "name": "លឿន ម៉ាទីនី"
        },
        {
            "barcode": "171133257",
            "dpc": "03023508601",
            "name": "សំ អូន"
        },
        {
            "barcode": "171133258",
            "dpc": "03023508701",
            "name": "ជុំ ផល្លី"
        },
        {
            "barcode": "171133259",
            "dpc": "03023508801",
            "name": "សាវី ម៉ូហាំម៉ាត"
        },
        {
            "barcode": "171133260",
            "dpc": "03023508901",
            "name": "ហក់ សាហ្វី"
        },
        {
            "barcode": "171133261",
            "dpc": "03023509001",
            "name": "ឡោះ អ៊ីសើ"
        },
        {
            "barcode": "171133262",
            "dpc": "03023509101",
            "name": "ឯល សាហ្វី"
        },
        {
            "barcode": "171133263",
            "dpc": "03023509201",
            "name": "សារ៉ូ សាលី"
        },
        {
            "barcode": "171133264",
            "dpc": "03023509301",
            "name": "ម៉ាត់ លី"
        },
        {
            "barcode": "171133265",
            "dpc": "03023509401",
            "name": "ស៊ុប រីម"
        },
        {
            "barcode": "171133266",
            "dpc": "03023509501",
            "name": "រ៉េះ ជា"
        },
        {
            "barcode": "171133267",
            "dpc": "03023509601",
            "name": "ទូច អាស៊ីយ៉ាល់"
        },
        {
            "barcode": "171133268",
            "dpc": "03023509701",
            "name": "ហ៊ីម សាលី"
        },
        {
            "barcode": "171133269",
            "dpc": "03023509801",
            "name": "ស៊ុប ហ្វាត់"
        },
        {
            "barcode": "171133270",
            "dpc": "03023509901",
            "name": "គង់ សុវណ្ណ"
        },
        {
            "barcode": "171133271",
            "dpc": "03023510001",
            "name": "ទី ម៉ារីសា"
        },
        {
            "barcode": "171133272",
            "dpc": "03023510101",
            "name": "ម៉ាត់ អ៊ីសើ"
        },
        {
            "barcode": "171133273",
            "dpc": "03023510201",
            "name": "ឡេះ ម៉ាត់តែម"
        },
        {
            "barcode": "171133274",
            "dpc": "03023510301",
            "name": "ឡោ វណ្ណដា"
        },
        {
            "barcode": "171133275",
            "dpc": "03023510401",
            "name": "លី រ៉ូហ្សាល"
        },
        {
            "barcode": "171133276",
            "dpc": "03023510501",
            "name": "អ៊ឹង ធៀនប៉ាវ"
        },
        {
            "barcode": "171133277",
            "dpc": "03023510601",
            "name": "ឡឹប យើ"
        },
        {
            "barcode": "171133278",
            "dpc": "03023510701",
            "name": "យល់ វុទ្ធី"
        },
        {
            "barcode": "171133279",
            "dpc": "03023510801",
            "name": "អ៊ឹម សុត្តា"
        },
        {
            "barcode": "171133280",
            "dpc": "03023510901",
            "name": "សុទ្ធ វាសនា"
        },
        {
            "barcode": "171133281",
            "dpc": "03023511001",
            "name": "ធឿម គឹមលាង"
        },
        {
            "barcode": "171133282",
            "dpc": "03023511101",
            "name": "កឹម ផល្លា"
        },
        {
            "barcode": "171133283",
            "dpc": "03023511201",
            "name": "ធឿន ចាន់ថា"
        },
        {
            "barcode": "171133284",
            "dpc": "03023511301",
            "name": "កែវ សិទ្ធ"
        },
        {
            "barcode": "171133285",
            "dpc": "03023511401",
            "name": "ស៊ីន ស៊ីវន"
        },
        {
            "barcode": "171133286",
            "dpc": "03023511501",
            "name": "ស៊ុន ស្នា"
        },
        {
            "barcode": "171133287",
            "dpc": "03023511601",
            "name": "ស្មាន់ វីរ៉ូ"
        },
        {
            "barcode": "171133288",
            "dpc": "03023511701",
            "name": "ខ្លូត សារ៉ាត់"
        },
        {
            "barcode": "171133289",
            "dpc": "03023511801",
            "name": "ប៉ិល វិសារ"
        },
        {
            "barcode": "171133290",
            "dpc": "03023511901",
            "name": "សុខ ប៊ិន"
        },
        {
            "barcode": "171133291",
            "dpc": "03023512001",
            "name": "ម៉ោញ ណាល់"
        },
        {
            "barcode": "171133292",
            "dpc": "03023512101",
            "name": "លី ហេងណាំអេង"
        },
        {
            "barcode": "171133293",
            "dpc": "03023512201",
            "name": "តែល នុច"
        },
        {
            "barcode": "171133294",
            "dpc": "03023512301",
            "name": "ហម សុធី"
        },
        {
            "barcode": "171133295",
            "dpc": "03023512401",
            "name": "សាប់ សារេត"
        },
        {
            "barcode": "171133296",
            "dpc": "03023512501",
            "name": "លឿម ភេន"
        },
        {
            "barcode": "171133297",
            "dpc": "03023512601",
            "name": "យិប ភី"
        },
        {
            "barcode": "171133298",
            "dpc": "03023512701",
            "name": "ងួន ឃាន"
        },
        {
            "barcode": "171133299",
            "dpc": "03023512901",
            "name": "លឹម ធិចហ៊ុន"
        },
        {
            "barcode": "171133300",
            "dpc": "03023513001",
            "name": "ហម សម្បត្តិ"
        },
        {
            "barcode": "171133301",
            "dpc": "03023513101",
            "name": "ជួន សាវង្ស"
        },
        {
            "barcode": "171133302",
            "dpc": "03023513201",
            "name": "សួង រី"
        },
        {
            "barcode": "171133303",
            "dpc": "03023513401",
            "name": "មាន និច្ច"
        },
        {
            "barcode": "171133304",
            "dpc": "03023513601",
            "name": "ឌី នាង"
        },
        {
            "barcode": "171133305",
            "dpc": "03023513701",
            "name": "ណូ សេន"
        },
        {
            "barcode": "171133306",
            "dpc": "03023513801",
            "name": "ឌុច ផន"
        },
        {
            "barcode": "171133307",
            "dpc": "03023513901",
            "name": "ប្រាក់ ផាន់នី"
        },
        {
            "barcode": "171133308",
            "dpc": "03023514001",
            "name": "កាន់ កង"
        },
        {
            "barcode": "171133309",
            "dpc": "03023514101",
            "name": "មុន មុំ"
        },
        {
            "barcode": "171133310",
            "dpc": "03023514201",
            "name": "អ៊ុន សុគុណ"
        },
        {
            "barcode": "171133311",
            "dpc": "03023514301",
            "name": "ហ៊ួន នៅ"
        },
        {
            "barcode": "171133312",
            "dpc": "03023514401",
            "name": "យ៉ន សារុន"
        },
        {
            "barcode": "171133313",
            "dpc": "03023514501",
            "name": "ឃុន ថាវ"
        },
        {
            "barcode": "171133314",
            "dpc": "03023514601",
            "name": "ផ្លោក សាវ៉ាង"
        },
        {
            "barcode": "171133315",
            "dpc": "03023514701",
            "name": "មុត វ៉ាន់"
        },
        {
            "barcode": "171133316",
            "dpc": "03023514801",
            "name": "វិន ដា"
        },
        {
            "barcode": "171133317",
            "dpc": "03023514901",
            "name": "ប្រាក់ សន"
        },
        {
            "barcode": "171133318",
            "dpc": "03023515001",
            "name": "កោះ ផៃ"
        },
        {
            "barcode": "171133319",
            "dpc": "03023515101",
            "name": "ជា​ ដារ៉ា"
        },
        {
            "barcode": "171133320",
            "dpc": "03023515301",
            "name": "យ៉ុន រឿត"
        },
        {
            "barcode": "171133321",
            "dpc": "03023515401",
            "name": "ជា ជឿន"
        },
        {
            "barcode": "171133322",
            "dpc": "03023515501",
            "name": "គង់ សុខ"
        },
        {
            "barcode": "171133323",
            "dpc": "03023515601",
            "name": "វ៉ាន់ ណារិទ្ធ"
        },
        {
            "barcode": "171133324",
            "dpc": "03023515701",
            "name": "លី នានិត"
        },
        {
            "barcode": "171133325",
            "dpc": "03023515801",
            "name": "ស៊ី រីវណ្ណី"
        },
        {
            "barcode": "171133326",
            "dpc": "03023515901",
            "name": "ថោ វណ្ណ"
        },
        {
            "barcode": "171133327",
            "dpc": "03023516001",
            "name": "ស៊ុត សុវណ្ណ"
        },
        {
            "barcode": "171133328",
            "dpc": "03023516101",
            "name": "ស៊ុត គីមលីន"
        },
        {
            "barcode": "171133329",
            "dpc": "03023516201",
            "name": "លី ដាវី"
        },
        {
            "barcode": "171133330",
            "dpc": "03023516301",
            "name": "លី ដា"
        },
        {
            "barcode": "171133331",
            "dpc": "03023516401",
            "name": "ប៉ុល ង៉ូវ"
        },
        {
            "barcode": "171133332",
            "dpc": "03023516501",
            "name": "សែម ពន្លក"
        },
        {
            "barcode": "171133333",
            "dpc": "03023516601",
            "name": "ស៊ិន កីនី"
        },
        {
            "barcode": "171133334",
            "dpc": "03023516801",
            "name": "យឿប វីរះ"
        },
        {
            "barcode": "171133335",
            "dpc": "03023516901",
            "name": "ឡុង ស៊ីថា"
        },
        {
            "barcode": "171133336",
            "dpc": "03023517001",
            "name": "កុយ ណាឫទ្ធិ"
        },
        {
            "barcode": "171133337",
            "dpc": "03023517101",
            "name": "ម៉ូត សារីយ៉ា"
        },
        {
            "barcode": "171133338",
            "dpc": "03023517201",
            "name": "មឿន រ័នណា"
        },
        {
            "barcode": "171133339",
            "dpc": "03023517301",
            "name": "មឿន សុម៉ាត្រា"
        },
        {
            "barcode": "171133340",
            "dpc": "03023517401",
            "name": "ឯម សំអឿន"
        },
        {
            "barcode": "171133341",
            "dpc": "03023517501",
            "name": "សំ រ៉ាត់"
        },
        {
            "barcode": "171133342",
            "dpc": "03023517601",
            "name": "ឃឹម ចំរើន"
        },
        {
            "barcode": "171133343",
            "dpc": "03023517701",
            "name": "ចាន់ អេង"
        },
        {
            "barcode": "171133344",
            "dpc": "03023517801",
            "name": "មាស សារុន"
        },
        {
            "barcode": "171133345",
            "dpc": "03023517901",
            "name": "ងឿប ណាត"
        },
        {
            "barcode": "171133346",
            "dpc": "03023518001",
            "name": "សា សើរ"
        },
        {
            "barcode": "171133347",
            "dpc": "03023518101",
            "name": "លឹម​ ប៊ូឡា"
        },
        {
            "barcode": "171133348",
            "dpc": "03023518201",
            "name": "មល់ បុប្ជា"
        },
        {
            "barcode": "171133349",
            "dpc": "03023518301",
            "name": "ជា សិទ្ធិ១"
        },
        {
            "barcode": "171133350",
            "dpc": "03023518401",
            "name": "ជា ឆនណារិទ្ធ"
        },
        {
            "barcode": "171133351",
            "dpc": "03023518601",
            "name": "ជា ណារិន"
        },
        {
            "barcode": "171133352",
            "dpc": "03023518701",
            "name": "ឡុង សីលា"
        },
        {
            "barcode": "171133353",
            "dpc": "03023518801",
            "name": "ឃឿត ទូច"
        },
        {
            "barcode": "171133354",
            "dpc": "03023519001",
            "name": "ឈួ ហាក់គាង"
        },
        {
            "barcode": "171133355",
            "dpc": "03023519101",
            "name": "វណ្ណា ចំរើន"
        },
        {
            "barcode": "171133356",
            "dpc": "03023519201",
            "name": "នូ ធារឿន"
        },
        {
            "barcode": "171133357",
            "dpc": "03023519301",
            "name": "ទិត្យ សុផាន"
        },
        {
            "barcode": "171133358",
            "dpc": "03023519501",
            "name": "ប៉ាង ភីរម្យ"
        },
        {
            "barcode": "171133359",
            "dpc": "03023519401",
            "name": "ទិត្យ សារឹម"
        },
        {
            "barcode": "171133360",
            "dpc": "03023519601",
            "name": "ចាន់ ថុល"
        },
        {
            "barcode": "171133361",
            "dpc": "03023519701",
            "name": "ហ៊ិន សំរ៉ង"
        },
        {
            "barcode": "171133362",
            "dpc": "03023519801",
            "name": "ឯក ខាំ"
        },
        {
            "barcode": "171133363",
            "dpc": "03023520101",
            "name": "ផាន់ សុផុន"
        },
        {
            "barcode": "171133364",
            "dpc": "03023520201",
            "name": "ឈូក ឆុន"
        },
        {
            "barcode": "171133365",
            "dpc": "03023520301",
            "name": "សយ អ៊ី"
        },
        {
            "barcode": "171133366",
            "dpc": "03023520501",
            "name": "យី សាវឿន"
        },
        {
            "barcode": "171133367",
            "dpc": "03023520601",
            "name": "សារ៉ង សារ:សិន្ធុ"
        },
        {
            "barcode": "171133368",
            "dpc": "03023520701",
            "name": "កែវ សារ៉េត"
        },
        {
            "barcode": "171133369",
            "dpc": "03023520801",
            "name": "នឹម សោភា"
        },
        {
            "barcode": "171133370",
            "dpc": "03023520901",
            "name": "ម៉ៅ ពឿន"
        },
        {
            "barcode": "171133371",
            "dpc": "03023521001",
            "name": "ងួន ចិន្តា"
        },
        {
            "barcode": "171133372",
            "dpc": "03023521101",
            "name": "ង៉ែត យានី"
        },
        {
            "barcode": "171133373",
            "dpc": "03023521301",
            "name": "ញ៉ឹក ថេត"
        },
        {
            "barcode": "171133374",
            "dpc": "03023521401",
            "name": "សោម សារ៉េត"
        },
        {
            "barcode": "171133375",
            "dpc": "03023521501",
            "name": "គង់ សុខុម"
        },
        {
            "barcode": "171133376",
            "dpc": "03023521601",
            "name": "ភាច ផល"
        },
        {
            "barcode": "171133377",
            "dpc": "03023521701",
            "name": "លី​ សាមឌី"
        },
        {
            "barcode": "171133378",
            "dpc": "03023521801",
            "name": "ប៊ុត សៃ"
        },
        {
            "barcode": "171133379",
            "dpc": "03023522001",
            "name": "យី សារឿត"
        },
        {
            "barcode": "171133380",
            "dpc": "03023522201",
            "name": "អ៊ុយ សារឿប"
        },
        {
            "barcode": "171133381",
            "dpc": "03023522301",
            "name": "អ៊ុក គឹមហេង"
        },
        {
            "barcode": "171133382",
            "dpc": "03023522401",
            "name": "កន ផល"
        },
        {
            "barcode": "171133383",
            "dpc": "03023522501",
            "name": "សាំង វួចគាង"
        },
        {
            "barcode": "171133384",
            "dpc": "03023522601",
            "name": "សៀង ចាន់សេថា"
        },
        {
            "barcode": "171133385",
            "dpc": "03023522701",
            "name": "រឹន គឹមហ៊ន"
        },
        {
            "barcode": "171133386",
            "dpc": "03023522801",
            "name": "ប៉ែន បុប្ផា"
        },
        {
            "barcode": "171133387",
            "dpc": "03023522901",
            "name": "ប្រាក់ ច័ន្ទសេរី"
        },
        {
            "barcode": "171133388",
            "dpc": "03023523001",
            "name": "ហ៊ន សុវណ្ណ"
        },
        {
            "barcode": "171133389",
            "dpc": "03023523101",
            "name": "និន សុភ័ក្រ"
        },
        {
            "barcode": "171133390",
            "dpc": "03023523201",
            "name": "អ៊ុក មន្ថា"
        },
        {
            "barcode": "171133391",
            "dpc": "03023523301",
            "name": "ឌី សុនថុល"
        },
        {
            "barcode": "171133392",
            "dpc": "03023523401",
            "name": "កុយ ឆាយ"
        },
        {
            "barcode": "171133393",
            "dpc": "03023523501",
            "name": "ស៊ីវ ស៊ីណែត"
        },
        {
            "barcode": "171133394",
            "dpc": "03023523601",
            "name": "ប៊ុន ឈន"
        },
        {
            "barcode": "171133395",
            "dpc": "03023523701",
            "name": "ប៊ុន ឈឿត"
        },
        {
            "barcode": "171133396",
            "dpc": "03023523801",
            "name": "វត្តក្តុល១"
        },
        {
            "barcode": "171133397",
            "dpc": "03023524101",
            "name": "វិទ្យាល័យក្តុលដូនទាវ"
        },
        {
            "barcode": "171133398",
            "dpc": "03023524201",
            "name": "ជា ឡង់"
        },
        {
            "barcode": "171133399",
            "dpc": "03023524301",
            "name": "លឹម សំណាង"
        },
        {
            "barcode": "171133400",
            "dpc": "03023524401",
            "name": "សាយ ពិសិទ្ធ"
        },
        {
            "barcode": "171133401",
            "dpc": "03023524501",
            "name": "ឡឹង សេរី"
        },
        {
            "barcode": "171133402",
            "dpc": "03023524601",
            "name": "អន មិនា"
        },
        {
            "barcode": "171133403",
            "dpc": "03023524701",
            "name": "ឈុំ សោហ៉ា"
        },
        {
            "barcode": "171133404",
            "dpc": "03023524901",
            "name": "ណយ ណារ៉ុង"
        },
        {
            "barcode": "171133405",
            "dpc": "03023525001",
            "name": "ស៊ឹម សាខន"
        },
        {
            "barcode": "171133406",
            "dpc": "03023525101",
            "name": "ឃឹម ប៊ុនឈឿម"
        },
        {
            "barcode": "171133407",
            "dpc": "03023525201",
            "name": "ហ៊ន វុទ្ទី"
        },
        {
            "barcode": "171133408",
            "dpc": "03023525301",
            "name": "ឡោ ឈៀង"
        },
        {
            "barcode": "171133409",
            "dpc": "03023525501",
            "name": "សី យិច"
        },
        {
            "barcode": "171133410",
            "dpc": "03023525701",
            "name": "លឹម ខេ"
        },
        {
            "barcode": "171133411",
            "dpc": "03023525801",
            "name": "ភាព សុផាត"
        },
        {
            "barcode": "171133412",
            "dpc": "03023526001",
            "name": "ញឹម ប្រាង"
        },
        {
            "barcode": "171133413",
            "dpc": "03023526101",
            "name": "អ៊ឹម ព្រែក"
        },
        {
            "barcode": "171133414",
            "dpc": "03023526201",
            "name": "សុខ ហុង"
        },
        {
            "barcode": "171133415",
            "dpc": "03023526301",
            "name": "ស៊ាន សាន"
        },
        {
            "barcode": "171133416",
            "dpc": "03023526501",
            "name": "ហេង តិល"
        },
        {
            "barcode": "171133417",
            "dpc": "03023526701",
            "name": "ឈុំ ឈួម"
        },
        {
            "barcode": "171133418",
            "dpc": "03023526901",
            "name": "ខឹម យ៉ូន"
        },
        {
            "barcode": "171133419",
            "dpc": "03023527001",
            "name": "នង ប៊ឺន"
        },
        {
            "barcode": "171133420",
            "dpc": "03023527101",
            "name": "ឡែប សុផែ"
        },
        {
            "barcode": "171133421",
            "dpc": "03023527201",
            "name": "ឃឹម សាវុធ"
        },
        {
            "barcode": "171133422",
            "dpc": "03023527301",
            "name": "សុខ លីដានី"
        },
        {
            "barcode": "171133423",
            "dpc": "03023527401",
            "name": "ព្រៀង ស៊ីណាត"
        },
        {
            "barcode": "171133424",
            "dpc": "03023527501",
            "name": "ស្ងៀម សុខា"
        },
        {
            "barcode": "171133425",
            "dpc": "03023527601",
            "name": "ប៉យ សាវ៉ាន"
        },
        {
            "barcode": "171133426",
            "dpc": "03023527701",
            "name": "ម៉ៅ ចាន់លី"
        },
        {
            "barcode": "171133427",
            "dpc": "03023527801",
            "name": "ជុន គឹមហ៊ួរ"
        },
        {
            "barcode": "171133428",
            "dpc": "03023527901",
            "name": "ចាន់ ផល្លា"
        },
        {
            "barcode": "171133429",
            "dpc": "03023528001",
            "name": "សឿម រិន"
        },
        {
            "barcode": "171133430",
            "dpc": "03023528101",
            "name": "អេង ឆែម១"
        },
        {
            "barcode": "171133431",
            "dpc": "03023528301",
            "name": "ចន សុន្យា"
        },
        {
            "barcode": "171133432",
            "dpc": "03023528401",
            "name": "ចន សុន្យា១"
        },
        {
            "barcode": "171133433",
            "dpc": "03023528601",
            "name": "ពេជ្រ ច័ន្ទមុនី"
        },
        {
            "barcode": "171133434",
            "dpc": "03023528701",
            "name": "ម៉ៅ ចាន់លី"
        },
        {
            "barcode": "171133435",
            "dpc": "03023528801",
            "name": "គង់ សុន"
        },
        {
            "barcode": "171133436",
            "dpc": "03023528901",
            "name": "ហៀក ពុទ្ធី"
        },
        {
            "barcode": "171133437",
            "dpc": "03023529001",
            "name": "ទន់ ខេន"
        },
        {
            "barcode": "171133438",
            "dpc": "03023529101",
            "name": "ជុំ លក្ខណា"
        },
        {
            "barcode": "171133439",
            "dpc": "03023529201",
            "name": "ញ៉េប ភីរម្យ"
        },
        {
            "barcode": "171133440",
            "dpc": "03023529401",
            "name": "ភួង សូម"
        },
        {
            "barcode": "171133441",
            "dpc": "03023529601",
            "name": "ប៉ុល ណារ៉ែន"
        },
        {
            "barcode": "171133442",
            "dpc": "03023529701",
            "name": "អ៊ាន ណារៀង"
        },
        {
            "barcode": "171133443",
            "dpc": "03023529801",
            "name": "ផាវី ភី"
        },
        {
            "barcode": "171133444",
            "dpc": "03023529901",
            "name": "លៀង គឹមស៊ា"
        },
        {
            "barcode": "171133445",
            "dpc": "03023530001",
            "name": "រ៉ែម ណារ៉ុង"
        },
        {
            "barcode": "171133446",
            "dpc": "03023530101",
            "name": "រិទ្ថ សារី"
        },
        {
            "barcode": "171133447",
            "dpc": "03023530201",
            "name": "ម៉ ចាន់"
        },
        {
            "barcode": "171133448",
            "dpc": "03023530301",
            "name": "ជុំ សារីណា"
        },
        {
            "barcode": "171133449",
            "dpc": "03023530401",
            "name": "តាំ ម៉ាប់"
        },
        {
            "barcode": "171133450",
            "dpc": "03023530501",
            "name": "ឪក សាមៀន"
        },
        {
            "barcode": "171133451",
            "dpc": "03023530601",
            "name": "ថាត រុន"
        },
        {
            "barcode": "171133452",
            "dpc": "03023530701",
            "name": "ចេក សារិទ្ធ"
        },
        {
            "barcode": "171133453",
            "dpc": "03023530801",
            "name": "ហុង ស៊ីវ"
        },
        {
            "barcode": "171133454",
            "dpc": "03023530901",
            "name": "សួន ឆុន"
        },
        {
            "barcode": "171133455",
            "dpc": "03023531001",
            "name": "ញៀប សារុន"
        },
        {
            "barcode": "171133456",
            "dpc": "03023531101",
            "name": "ឡង់ វុទ្ទី"
        },
        {
            "barcode": "171133457",
            "dpc": "03023531201",
            "name": "សៀង ចយ"
        },
        {
            "barcode": "171133458",
            "dpc": "03023531301",
            "name": "ថ្លុង សឹរី"
        },
        {
            "barcode": "171133459",
            "dpc": "03023531401",
            "name": "បូរ ស៊ីថា"
        },
        {
            "barcode": "171133460",
            "dpc": "03023531501",
            "name": "ឈឿង ឆែម"
        },
        {
            "barcode": "171133461",
            "dpc": "03023531601",
            "name": "ម៉ក់ សុធា"
        },
        {
            "barcode": "171133462",
            "dpc": "03023531701",
            "name": "សាន ហ៊ុន"
        },
        {
            "barcode": "171133463",
            "dpc": "03023531801",
            "name": "ច្រែង ឈឿម"
        },
        {
            "barcode": "171133464",
            "dpc": "03023531901",
            "name": "ពៅ ប៊ុន ថា"
        },
        {
            "barcode": "171133465",
            "dpc": "03023532001",
            "name": "ហ៊ន យក់ហៀប"
        },
        {
            "barcode": "171133466",
            "dpc": "03023532101",
            "name": "ហាក់ សន"
        },
        {
            "barcode": "171133467",
            "dpc": "03023532201",
            "name": "តោ ឈូក"
        },
        {
            "barcode": "171133468",
            "dpc": "03023532301",
            "name": "រួម បូរី"
        },
        {
            "barcode": "171133469",
            "dpc": "03023532401",
            "name": "ឈិន សំអឿន"
        },
        {
            "barcode": "171133470",
            "dpc": "03023532501",
            "name": "ម៉ៅ សំបុណ្យ"
        },
        {
            "barcode": "171133471",
            "dpc": "03023532601",
            "name": "សុខ ស៊ីម"
        },
        {
            "barcode": "171133472",
            "dpc": "03023532701",
            "name": "កែម ស៊ីណៃ"
        },
        {
            "barcode": "171133473",
            "dpc": "03023532801",
            "name": "ឈួន ផាត"
        },
        {
            "barcode": "171133474",
            "dpc": "03023532901",
            "name": "យឹម យុន"
        },
        {
            "barcode": "171133475",
            "dpc": "03023533001",
            "name": "ស៊ឹម សៃនី"
        },
        {
            "barcode": "171133476",
            "dpc": "03023533101",
            "name": "ម៉ន រឿត"
        },
        {
            "barcode": "171133477",
            "dpc": "03023533201",
            "name": "ហេង វាសនា"
        },
        {
            "barcode": "171133478",
            "dpc": "03023533301",
            "name": "សំ ចាន់"
        },
        {
            "barcode": "171133479",
            "dpc": "03023533401",
            "name": "សួន ម៉ាប់"
        },
        {
            "barcode": "171133480",
            "dpc": "03023533501",
            "name": "គង់ វាសនា"
        },
        {
            "barcode": "171133481",
            "dpc": "03023533601",
            "name": "ហាក់ ឈឿន"
        },
        {
            "barcode": "171133482",
            "dpc": "03023533701",
            "name": "ម៉ង សុធី"
        },
        {
            "barcode": "171133483",
            "dpc": "03023533801",
            "name": "សេង ញឹម"
        },
        {
            "barcode": "171133484",
            "dpc": "03023533901",
            "name": "សួន នឹម"
        },
        {
            "barcode": "171133485",
            "dpc": "03023534001",
            "name": "ម៉ូត សេរី"
        },
        {
            "barcode": "171133486",
            "dpc": "03023534101",
            "name": "ជី សុជាតិ"
        },
        {
            "barcode": "171133487",
            "dpc": "03023534201",
            "name": "សែម ថន"
        },
        {
            "barcode": "171133488",
            "dpc": "03023534301",
            "name": "ម៉ូត ខន"
        },
        {
            "barcode": "171133489",
            "dpc": "03023534401",
            "name": "ម៉ូ ប៊ុន"
        },
        {
            "barcode": "171133490",
            "dpc": "03023534501",
            "name": "ជី សុខរ៉ន"
        },
        {
            "barcode": "171133491",
            "dpc": "03023534601",
            "name": "យូ ទី"
        },
        {
            "barcode": "171133492",
            "dpc": "03023534701",
            "name": "ហ៊ូ ហេង"
        },
        {
            "barcode": "171133493",
            "dpc": "03023534801",
            "name": "មុត ម៉ុច"
        },
        {
            "barcode": "171133494",
            "dpc": "03023534901",
            "name": "ព្រុំ មុនី"
        },
        {
            "barcode": "171133495",
            "dpc": "03023535001",
            "name": "លឹម គី"
        },
        {
            "barcode": "171133496",
            "dpc": "03023535101",
            "name": "ឡេង ម៉ាស៊ីន"
        },
        {
            "barcode": "171133497",
            "dpc": "03023535201",
            "name": "ម៉ក់ ហម"
        },
        {
            "barcode": "171133498",
            "dpc": "03023535301",
            "name": "អ៊ាន សុធី"
        },
        {
            "barcode": "171133499",
            "dpc": "03023535501",
            "name": "អឿន ហ៊ត"
        },
        {
            "barcode": "171133500",
            "dpc": "03023535601",
            "name": "ពេជ្រ ណូក"
        },
        {
            "barcode": "171133501",
            "dpc": "03023535801",
            "name": "លឹម គឹមស៊ុន"
        },
        {
            "barcode": "171133502",
            "dpc": "03023536001",
            "name": "ម៉ូ រ៉ាត់"
        },
        {
            "barcode": "171133503",
            "dpc": "03023536201",
            "name": "ហុង ដារ៉ា"
        },
        {
            "barcode": "171133504",
            "dpc": "03023536401",
            "name": "ឪ ដែន"
        },
        {
            "barcode": "171133505",
            "dpc": "03023536501",
            "name": "សុខ ទូច"
        },
        {
            "barcode": "171133506",
            "dpc": "03023536601",
            "name": "ជា សារ៉េន"
        },
        {
            "barcode": "171133507",
            "dpc": "03023536701",
            "name": "ជា ញាន"
        },
        {
            "barcode": "171133508",
            "dpc": "03023536801",
            "name": "យឿត សាវី"
        },
        {
            "barcode": "171133509",
            "dpc": "03023536901",
            "name": "យ៉ង់ យឿត"
        },
        {
            "barcode": "171133510",
            "dpc": "03023537001",
            "name": "សណ្តែក ម៉ុច"
        },
        {
            "barcode": "171133511",
            "dpc": "03023537101",
            "name": "យ៉ង ធី"
        },
        {
            "barcode": "171133512",
            "dpc": "03023537201",
            "name": "ហេង អាត់"
        },
        {
            "barcode": "171133513",
            "dpc": "03023537301",
            "name": "ហាន ហ៊ីង"
        },
        {
            "barcode": "171133514",
            "dpc": "03023537501",
            "name": "អ៊ិត ហឿត"
        },
        {
            "barcode": "171133515",
            "dpc": "03023537601",
            "name": "នៅ តាំង"
        },
        {
            "barcode": "171133516",
            "dpc": "03023537701",
            "name": "ឈា សិលា"
        },
        {
            "barcode": "171133517",
            "dpc": "03023537801",
            "name": "ព្រុំ  ស៊ីថុល"
        },
        {
            "barcode": "171133518",
            "dpc": "03023537901",
            "name": "ព្រុំ ស៊ីថុល២"
        },
        {
            "barcode": "171133519",
            "dpc": "03023538001",
            "name": "ឈាង សោមា"
        },
        {
            "barcode": "171133520",
            "dpc": "03023538101",
            "name": "ឈា សុផានី"
        },
        {
            "barcode": "171133521",
            "dpc": "03023538201",
            "name": "លឹម នាង"
        },
        {
            "barcode": "171133522",
            "dpc": "03023538301",
            "name": "សែម សុខុម"
        },
        {
            "barcode": "171133523",
            "dpc": "03023538401",
            "name": "ចន សុផាណា"
        },
        {
            "barcode": "171133524",
            "dpc": "03023538501",
            "name": "ង៉ោ ប៉ុនពេជ្រ"
        },
        {
            "barcode": "171133525",
            "dpc": "03023538701",
            "name": "ប៉ូច សុភណ្ណារិទ្ធ"
        },
        {
            "barcode": "171133526",
            "dpc": "03023538801",
            "name": "អុំ រដ្ធា"
        },
        {
            "barcode": "171133527",
            "dpc": "03023538901",
            "name": "ទី ថា"
        },
        {
            "barcode": "171133528",
            "dpc": "03023539001",
            "name": "ជេត កុសល់"
        },
        {
            "barcode": "171133529",
            "dpc": "03023539101",
            "name": "ឡាប វណ្ណឌី"
        },
        {
            "barcode": "171133530",
            "dpc": "03023539201",
            "name": "យុន តៃអាន"
        },
        {
            "barcode": "171133531",
            "dpc": "03023539301",
            "name": "ផេង សំប៊ូន"
        },
        {
            "barcode": "171133532",
            "dpc": "03023539401",
            "name": "ហាន ហ៊ីង"
        },
        {
            "barcode": "171133533",
            "dpc": "03023539501",
            "name": "ហេង សុវណ្ណ"
        },
        {
            "barcode": "171133534",
            "dpc": "03023539601",
            "name": "សោម ទីន"
        },
        {
            "barcode": "171133535",
            "dpc": "03023539701",
            "name": "យ៉ត សាង"
        },
        {
            "barcode": "171133536",
            "dpc": "03023539801",
            "name": "គង់ សុផន"
        },
        {
            "barcode": "171133537",
            "dpc": "03023539901",
            "name": "ទឹម រី​"
        },
        {
            "barcode": "171133538",
            "dpc": "03023540001",
            "name": "ហឿន នាង"
        },
        {
            "barcode": "171133539",
            "dpc": "03023540101",
            "name": "ឡាច ព្រីន"
        },
        {
            "barcode": "171133540",
            "dpc": "03023540201",
            "name": "ប៉ាន សុខា"
        },
        {
            "barcode": "171133541",
            "dpc": "03023540301",
            "name": "មុំ សុភាព"
        },
        {
            "barcode": "171133542",
            "dpc": "03023540401",
            "name": "ព្រីង ចាប"
        },
        {
            "barcode": "171133543",
            "dpc": "03023540501",
            "name": "ពៅ ប៊ុនថា"
        },
        {
            "barcode": "171133544",
            "dpc": "03023540801",
            "name": "ពេជ្រ ណារ៉ាន់"
        },
        {
            "barcode": "171133545",
            "dpc": "03023540901",
            "name": "ហែម សារ៉េត"
        },
        {
            "barcode": "171133546",
            "dpc": "03023541001",
            "name": "ឆៃ សារ៉ា"
        },
        {
            "barcode": "171133547",
            "dpc": "03023541101",
            "name": "ឡត ប៊ុនថុន"
        },
        {
            "barcode": "171133548",
            "dpc": "03023541201",
            "name": "ឡត ប៊ុនថុន១"
        },
        {
            "barcode": "171133549",
            "dpc": "03023541301",
            "name": "ពេជ្រ ថោងលឿម"
        },
        {
            "barcode": "171133550",
            "dpc": "03023541401",
            "name": "នៅ នី"
        },
        {
            "barcode": "171133551",
            "dpc": "03023541501",
            "name": "ឈ ហេងទាវ"
        },
        {
            "barcode": "171133552",
            "dpc": "03023541601",
            "name": "ទិត្យ សុខុម"
        },
        {
            "barcode": "171133553",
            "dpc": "03023541701",
            "name": "តុល ថុល"
        },
        {
            "barcode": "171133554",
            "dpc": "03023541801",
            "name": "ជុំ នឿម"
        },
        {
            "barcode": "171133555",
            "dpc": "03023542101",
            "name": "វ៉ាន វ៉ៃ"
        },
        {
            "barcode": "171133556",
            "dpc": "03023542301",
            "name": "ញ៉ុក យ៉េន"
        },
        {
            "barcode": "171133557",
            "dpc": "03023542701",
            "name": "សោរ ទូច"
        },
        {
            "barcode": "171133558",
            "dpc": "03023542801",
            "name": "យុន ឡៅស៊ិត"
        },
        {
            "barcode": "171133559",
            "dpc": "03023542901",
            "name": "យ៉ុន ឡៅសត្តិ១"
        },
        {
            "barcode": "171133560",
            "dpc": "03023543001",
            "name": "ព្រុំ  វុទ្ធី"
        },
        {
            "barcode": "171133561",
            "dpc": "03023543101",
            "name": "ថេត រីឆាន"
        },
        {
            "barcode": "171133562",
            "dpc": "03023543201",
            "name": "រៀល ថងសឺត"
        },
        {
            "barcode": "171133563",
            "dpc": "03023543301",
            "name": "ចាន់ ឆឿង"
        },
        {
            "barcode": "171133564",
            "dpc": "03023543401",
            "name": "សោម វណ្ណី"
        },
        {
            "barcode": "171133565",
            "dpc": "03023543501",
            "name": "ប្រាក់ យស់ផា"
        },
        {
            "barcode": "171133566",
            "dpc": "03023543701",
            "name": "អ៊ិន សេរី"
        },
        {
            "barcode": "171133567",
            "dpc": "03023543801",
            "name": "អេង លីសាលុយ"
        },
        {
            "barcode": "171133568",
            "dpc": "03023543901",
            "name": "ទិត្យ អាន"
        },
        {
            "barcode": "171133569",
            "dpc": "03023544101",
            "name": "ឡេង ធារី"
        },
        {
            "barcode": "171133570",
            "dpc": "03023544301",
            "name": "សយ យ៉េត"
        },
        {
            "barcode": "171133571",
            "dpc": "03023544501",
            "name": "ហោ លឿប"
        },
        {
            "barcode": "171133572",
            "dpc": "03023544601",
            "name": "ឡេង ប៊ុនរ៉ុង"
        },
        {
            "barcode": "171133573",
            "dpc": "03023544701",
            "name": "សាលាបឋមសិក្សាថ្កូវ"
        },
        {
            "barcode": "171133574",
            "dpc": "03023544801",
            "name": "យ៉ុង ទី"
        },
        {
            "barcode": "171133575",
            "dpc": "03023544901",
            "name": "ផុន ភឿត"
        },
        {
            "barcode": "171133576",
            "dpc": "03023545001",
            "name": "ផុន សុខ"
        },
        {
            "barcode": "171133577",
            "dpc": "03023545101",
            "name": "អ៊ុច រ៉ាត់"
        },
        {
            "barcode": "171133578",
            "dpc": "03023545201",
            "name": "សោម ស៊ួរ"
        },
        {
            "barcode": "171133579",
            "dpc": "03023545301",
            "name": "ហែម វត្តី"
        },
        {
            "barcode": "171133580",
            "dpc": "03023545401",
            "name": "ទិត្យ ផេង"
        },
        {
            "barcode": "171133581",
            "dpc": "03023545501",
            "name": "វ៉ាត សារ៉ាត់"
        },
        {
            "barcode": "171133582",
            "dpc": "03023545601",
            "name": "ឡេង សុខុម"
        },
        {
            "barcode": "171133583",
            "dpc": "03023545701",
            "name": "សៅ យ៉ា"
        },
        {
            "barcode": "171133584",
            "dpc": "03023545901",
            "name": "ប៉ិច ប៊ុនរិទ្ធ"
        },
        {
            "barcode": "171133585",
            "dpc": "03023546101",
            "name": "ឆែម ឆន"
        },
        {
            "barcode": "171133586",
            "dpc": "03023546201",
            "name": "រឿន ឈូក"
        },
        {
            "barcode": "171133587",
            "dpc": "03023546301",
            "name": "អេង ចាន់ថង"
        },
        {
            "barcode": "171133588",
            "dpc": "03023546401",
            "name": "យឿត ហ៊ាង"
        },
        {
            "barcode": "171133589",
            "dpc": "03023546501",
            "name": "យឿត ហាង១"
        },
        {
            "barcode": "171133590",
            "dpc": "03023546701",
            "name": "យឿត ហ៊ាង៣"
        },
        {
            "barcode": "171133591",
            "dpc": "03023546801",
            "name": "ងួន រ៉ានី"
        },
        {
            "barcode": "171133592",
            "dpc": "03023547201",
            "name": "ឈាន ភីរ៉ា"
        },
        {
            "barcode": "171133593",
            "dpc": "03023547401",
            "name": "សាំង សុវត្តិ"
        },
        {
            "barcode": "171133594",
            "dpc": "03023547501",
            "name": "សង ណារ៉ែន"
        },
        {
            "barcode": "171133595",
            "dpc": "03023547601",
            "name": "ប៊ុន តុងបូរ៉ារិទ្ធ"
        },
        {
            "barcode": "171133596",
            "dpc": "03023547701",
            "name": "ជួង ចន្ជី"
        },
        {
            "barcode": "171133597",
            "dpc": "03023547801",
            "name": "លី សម្បត្តិ"
        },
        {
            "barcode": "171133598",
            "dpc": "03023547901",
            "name": "ឆូ រដ្ឋមូលី"
        },
        {
            "barcode": "171133599",
            "dpc": "03023502501",
            "name": "យន់ សាវ័ន្ត"
        },
        {
            "barcode": "171133600",
            "dpc": "03023548001",
            "name": "នូរ ប៊ុណ្ណារ៉ា"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
