let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=

    [
        {
            "barcode": "171133601",
            "dpc": "03013700101",
            "name": "ហុក សុខា"
        },
        {
            "barcode": "171133602",
            "dpc": "03013700201",
            "name": "ជុំ សុគុណ"
        },
        {
            "barcode": "171133603",
            "dpc": "03013700301",
            "name": "ភួង ចន្ថា"
        },
        {
            "barcode": "171133604",
            "dpc": "03013700401",
            "name": "ទី ប៊ុនរឿង"
        },
        {
            "barcode": "171133605",
            "dpc": "03013700501",
            "name": "ឈូក សាមឿន"
        },
        {
            "barcode": "171133606",
            "dpc": "03013700601",
            "name": "ជី វុទ្ទី"
        },
        {
            "barcode": "171133607",
            "dpc": "03013700701",
            "name": "លឹម សន្ទនា"
        },
        {
            "barcode": "171133608",
            "dpc": "03013700801",
            "name": "ក្រួច ឈួន"
        },
        {
            "barcode": "171133609",
            "dpc": "03013700901",
            "name": "ទិត្យ នី"
        },
        {
            "barcode": "171133610",
            "dpc": "03013701001",
            "name": "រួត ចន្ទ័សុហា"
        },
        {
            "barcode": "171133611",
            "dpc": "03013701101",
            "name": "សេង ណាវី"
        },
        {
            "barcode": "171133612",
            "dpc": "03013701201",
            "name": "លាង ប៊ុន"
        },
        {
            "barcode": "171133613",
            "dpc": "03013701301",
            "name": "មឹង ខុម"
        },
        {
            "barcode": "171133614",
            "dpc": "03013701401",
            "name": "ឆែក សាវន្ត័"
        },
        {
            "barcode": "171133615",
            "dpc": "03013701501",
            "name": "សួន ចិត្រ"
        },
        {
            "barcode": "171133616",
            "dpc": "03013701601",
            "name": "ហាក រ៉ាវី"
        },
        {
            "barcode": "171133617",
            "dpc": "03013701701",
            "name": "ស្រី សំបាន"
        },
        {
            "barcode": "171133618",
            "dpc": "03013701801",
            "name": "អ៊ឹម ផារ៉ា"
        },
        {
            "barcode": "171133619",
            "dpc": "03013701901",
            "name": "តាប់ កឿន"
        },
        {
            "barcode": "171133620",
            "dpc": "03013702001",
            "name": "ឯក សុវណ្ណ២"
        },
        {
            "barcode": "171133621",
            "dpc": "03013702101",
            "name": "ផាត់ ម៉ូវ"
        },
        {
            "barcode": "171133622",
            "dpc": "03013702201",
            "name": "ឃុត សារ៉ែត"
        },
        {
            "barcode": "171133623",
            "dpc": "03013702301",
            "name": "សៀវ គឹមសាន្ត"
        },
        {
            "barcode": "171133624",
            "dpc": "03013702401",
            "name": "វី ម៉ៅ"
        },
        {
            "barcode": "171133625",
            "dpc": "03013702601",
            "name": "ប្លង់ សុជាតិ"
        },
        {
            "barcode": "171133626",
            "dpc": "03013702701",
            "name": "រ៉ន និន"
        },
        {
            "barcode": "171133627",
            "dpc": "03013702801",
            "name": "សួង សុភា"
        },
        {
            "barcode": "171133628",
            "dpc": "03013702901",
            "name": "ប៉ុក ថេង"
        },
        {
            "barcode": "171133629",
            "dpc": "03013703001",
            "name": "ឈឹម សំអុល"
        },
        {
            "barcode": "171133630",
            "dpc": "03013703101",
            "name": "សុខ ផល្លី"
        },
        {
            "barcode": "171133631",
            "dpc": "03013703201",
            "name": "ជា រដ្ឋា"
        },
        {
            "barcode": "171133632",
            "dpc": "03013703301",
            "name": "សាលាបឋមសិក្សា ស្វាយធំ"
        },
        {
            "barcode": "171133633",
            "dpc": "03013703501",
            "name": "តូច សៅវ៉ារ៉ា"
        },
        {
            "barcode": "171133634",
            "dpc": "03013703601",
            "name": "ប៉ួត វុន"
        },
        {
            "barcode": "171133635",
            "dpc": "03013703701",
            "name": "ហោម មន្នី"
        },
        {
            "barcode": "171133636",
            "dpc": "03013703901",
            "name": "សៀង សុគន្ធ"
        },
        {
            "barcode": "171133637",
            "dpc": "03013704001",
            "name": "អេង ស៊ីណា"
        },
        {
            "barcode": "171133638",
            "dpc": "03013704201",
            "name": "អោក ភាព"
        },
        {
            "barcode": "171133639",
            "dpc": "03013704301",
            "name": "កែង គឹមតេង"
        },
        {
            "barcode": "171133640",
            "dpc": "03013704401",
            "name": "អាង កែវ"
        },
        {
            "barcode": "171133641",
            "dpc": "03013704601",
            "name": "ជី ស៊ង"
        },
        {
            "barcode": "171133642",
            "dpc": "03013704801",
            "name": "វឿន វ៉ាន់"
        },
        {
            "barcode": "171133643",
            "dpc": "03013704901",
            "name": "ហ៊ា កង់"
        },
        {
            "barcode": "171133644",
            "dpc": "03013705001",
            "name": "ហេង ម៉ៅ"
        },
        {
            "barcode": "171133645",
            "dpc": "03013705201",
            "name": "ស្រស់ គីមហាក់"
        },
        {
            "barcode": "171133646",
            "dpc": "03013705301",
            "name": "រឿង ឆាន"
        },
        {
            "barcode": "171133647",
            "dpc": "03013705401",
            "name": "លិញ សុផល"
        },
        {
            "barcode": "171133648",
            "dpc": "03013705501",
            "name": "ជៀប រីណា"
        },
        {
            "barcode": "171133649",
            "dpc": "03013705601",
            "name": "ឈុំ ស្រីអូន"
        },
        {
            "barcode": "171133650",
            "dpc": "03013705701",
            "name": "ប៊ុន រើន"
        },
        {
            "barcode": "171133651",
            "dpc": "03013705801",
            "name": "តុប ចាន់ផល្លា"
        },
        {
            "barcode": "171133652",
            "dpc": "03013705901",
            "name": "យឹម ទ្រី"
        },
        {
            "barcode": "171133653",
            "dpc": "03013706001",
            "name": "រស់ ចាន់ដារ៉ា"
        },
        {
            "barcode": "171133654",
            "dpc": "03013706101",
            "name": "គា សុខ"
        },
        {
            "barcode": "171133655",
            "dpc": "03013706301",
            "name": "ហែម ឡាប"
        },
        {
            "barcode": "171133656",
            "dpc": "03013706401",
            "name": "អូច ម៉ៅ"
        },
        {
            "barcode": "171133657",
            "dpc": "03013706501",
            "name": "សយ សៀង"
        },
        {
            "barcode": "171133658",
            "dpc": "03013706601",
            "name": "ជៀម ចិន្តា"
        },
        {
            "barcode": "171133659",
            "dpc": "03013706801",
            "name": "អ៊ុក ឆនន្ត័"
        },
        {
            "barcode": "171133660",
            "dpc": "03013706901",
            "name": "អ៊ុក ណាវុធ"
        },
        {
            "barcode": "171133661",
            "dpc": "03013707001",
            "name": "ជុំ សុភា"
        },
        {
            "barcode": "171133662",
            "dpc": "03013707101",
            "name": "អៀម រិននឿត"
        },
        {
            "barcode": "171133663",
            "dpc": "03013707401",
            "name": "ឆេង ចាន់រ៉ា"
        },
        {
            "barcode": "171133664",
            "dpc": "03013707501",
            "name": "ឃឹម ឆុំ"
        },
        {
            "barcode": "171133665",
            "dpc": "03013707601",
            "name": "ព្រំ ក្រាញ់"
        },
        {
            "barcode": "171133666",
            "dpc": "03013707701",
            "name": "មុំ ណូក"
        },
        {
            "barcode": "171133667",
            "dpc": "03013707801",
            "name": "នុត ឈិន"
        },
        {
            "barcode": "171133668",
            "dpc": "03013708001",
            "name": "គង់ ពីណា"
        },
        {
            "barcode": "171133669",
            "dpc": "03013708101",
            "name": "ឆាយ រិទ្វី"
        },
        {
            "barcode": "171133670",
            "dpc": "03013708201",
            "name": "ផា សុភាវី"
        },
        {
            "barcode": "171133671",
            "dpc": "03013708301",
            "name": "ចេង សុខហៀង"
        },
        {
            "barcode": "171133672",
            "dpc": "03013708401",
            "name": "លឹម ម៉េង"
        },
        {
            "barcode": "171133673",
            "dpc": "03013708501",
            "name": "ឈឿម ឆៃយ៉ា"
        },
        {
            "barcode": "171133674",
            "dpc": "03013708601",
            "name": "គង់ អៀប"
        },
        {
            "barcode": "171133675",
            "dpc": "03013708701",
            "name": "លឹប ដាវហេង"
        },
        {
            "barcode": "171133676",
            "dpc": "03013708801",
            "name": "ជឿន សុជា"
        },
        {
            "barcode": "171133677",
            "dpc": "03013708901",
            "name": "ទីង ហាកហ៊ុច"
        },
        {
            "barcode": "171133678",
            "dpc": "03013709001",
            "name": "ឌុង សំណាង"
        },
        {
            "barcode": "171133679",
            "dpc": "03013709101",
            "name": "ទឹម វុន"
        },
        {
            "barcode": "171133680",
            "dpc": "03013709201",
            "name": "ធឿន សោភា"
        },
        {
            "barcode": "171133681",
            "dpc": "03013709301",
            "name": "ហ៊ីម ហួច"
        },
        {
            "barcode": "171133682",
            "dpc": "03013709401",
            "name": "ង៉ែត អ៊ុន"
        },
        {
            "barcode": "171133683",
            "dpc": "03013709501",
            "name": "ហឹង សាវើន"
        },
        {
            "barcode": "171133684",
            "dpc": "03013709601",
            "name": "ឡុង វុន"
        },
        {
            "barcode": "171133685",
            "dpc": "03013709701",
            "name": "ឌៀប រិទ្ធស្យា"
        },
        {
            "barcode": "171133686",
            "dpc": "03013709801",
            "name": "ប៉ា សារ៉ា"
        },
        {
            "barcode": "171133687",
            "dpc": "03013709901",
            "name": "ឡយ លី"
        },
        {
            "barcode": "171133688",
            "dpc": "03013710001",
            "name": "ឌូង សូត្រ"
        },
        {
            "barcode": "171133689",
            "dpc": "03013710101",
            "name": "លី ស្រីអេង"
        },
        {
            "barcode": "171133690",
            "dpc": "03013710201",
            "name": "ស៊ុន សារី"
        },
        {
            "barcode": "171133691",
            "dpc": "03013710301",
            "name": "នៅ រតនា"
        },
        {
            "barcode": "171133692",
            "dpc": "03013710401",
            "name": "ណាត ហឿន"
        },
        {
            "barcode": "171133693",
            "dpc": "03013710501",
            "name": "សាំង សុគន្ធារិទ្ធ"
        },
        {
            "barcode": "171133694",
            "dpc": "03013710601",
            "name": "ង៉ែត សុខ"
        },
        {
            "barcode": "171133695",
            "dpc": "03013710701",
            "name": "ឃ្លាំង អៀន"
        },
        {
            "barcode": "171133696",
            "dpc": "03013710801",
            "name": "ស៊ន កឺ"
        },
        {
            "barcode": "171133697",
            "dpc": "03013710901",
            "name": "ហ៊ត ដារៀង"
        },
        {
            "barcode": "171133698",
            "dpc": "03013711001",
            "name": "ហ៊ត សារឿប"
        },
        {
            "barcode": "171133699",
            "dpc": "03013711101",
            "name": "អឿម ប៉ោក"
        },
        {
            "barcode": "171133700",
            "dpc": "03013711201",
            "name": "ប្រាក់ ហន"
        },
        {
            "barcode": "171133701",
            "dpc": "03013711301",
            "name": "លី ចិន្តា"
        },
        {
            "barcode": "171133702",
            "dpc": "03013711401",
            "name": "កូន ផល្លា"
        },
        {
            "barcode": "171133703",
            "dpc": "03013711501",
            "name": "ឆេង ឆន"
        },
        {
            "barcode": "171133704",
            "dpc": "03013711601",
            "name": "រៀប សុពណ៏"
        },
        {
            "barcode": "171133705",
            "dpc": "03013711801",
            "name": "វ៉ាន សៅរិទ្ទ"
        },
        {
            "barcode": "171133706",
            "dpc": "03013712001",
            "name": "កែវ វុទ្ធី"
        },
        {
            "barcode": "171133707",
            "dpc": "03013712101",
            "name": "ខៀវ ពៅ"
        },
        {
            "barcode": "171133708",
            "dpc": "03013712201",
            "name": "ចាន់ សុភ័ណ្ឌ"
        },
        {
            "barcode": "171133709",
            "dpc": "03013712301",
            "name": "សិន ភេន"
        },
        {
            "barcode": "171133710",
            "dpc": "03013712401",
            "name": "ទូច ចន្ថា"
        },
        {
            "barcode": "171133711",
            "dpc": "03013712501",
            "name": "ភុំ លី"
        },
        {
            "barcode": "171133712",
            "dpc": "03013712601",
            "name": "ជា ឡេង"
        },
        {
            "barcode": "171133713",
            "dpc": "03013712701",
            "name": "ទេព លឿប"
        },
        {
            "barcode": "171133714",
            "dpc": "03013712801",
            "name": "និត ជីវន័្ត"
        },
        {
            "barcode": "171133715",
            "dpc": "03013712901",
            "name": "ប៊ុននាង សុនន្ទ"
        },
        {
            "barcode": "171133716",
            "dpc": "03013713101",
            "name": "ទិត្យ សេរីយស"
        },
        {
            "barcode": "171133717",
            "dpc": "03013713201",
            "name": "បាង រ៉ា"
        },
        {
            "barcode": "171133718",
            "dpc": "03013713301",
            "name": "លី ជីអ៊ី"
        },
        {
            "barcode": "171133719",
            "dpc": "03013713401",
            "name": "តែម គឹមសួង"
        },
        {
            "barcode": "171133720",
            "dpc": "03013713501",
            "name": "ហុង ឃឿត"
        },
        {
            "barcode": "171133721",
            "dpc": "03013713601",
            "name": "ឡាប រិខា"
        },
        {
            "barcode": "171133722",
            "dpc": "03013713701",
            "name": "រ៉ុង រតនៈ"
        },
        {
            "barcode": "171133723",
            "dpc": "03013713801",
            "name": "ផា ជៀវ"
        },
        {
            "barcode": "171133724",
            "dpc": "03013714001",
            "name": "ស៊ុយ សូវៀត"
        },
        {
            "barcode": "171133725",
            "dpc": "03013714101",
            "name": "អ៊ឹង តាំងហេង"
        },
        {
            "barcode": "171133726",
            "dpc": "03013714201",
            "name": "អ៊ី វិច្ឋិកា"
        },
        {
            "barcode": "171133727",
            "dpc": "03013714301",
            "name": "សេក ណារ៉េត"
        },
        {
            "barcode": "171133728",
            "dpc": "03013714401",
            "name": "ហួត ភ័ណ្ឌ"
        },
        {
            "barcode": "171133729",
            "dpc": "03013714501",
            "name": "ហង្ស វណ្ណសុទ្ធ"
        },
        {
            "barcode": "171133730",
            "dpc": "03013714601",
            "name": "ទន់ ភក្តី"
        },
        {
            "barcode": "171133731",
            "dpc": "03013714701",
            "name": "កង់ រឿត"
        },
        {
            "barcode": "171133732",
            "dpc": "03013714801",
            "name": "ឈីវ ខុម"
        },
        {
            "barcode": "171133733",
            "dpc": "03013714901",
            "name": "ម៉ម ឈន"
        },
        {
            "barcode": "171133734",
            "dpc": "03013715001",
            "name": "ហេង មុន្នីចិន្តា"
        },
        {
            "barcode": "171133735",
            "dpc": "03013715101",
            "name": "ប៉ោ សុវណ្ណ:"
        },
        {
            "barcode": "171133736",
            "dpc": "03013715201",
            "name": "លាប ទីប"
        },
        {
            "barcode": "171133737",
            "dpc": "03013715301",
            "name": "យឿន សុជាតិ"
        },
        {
            "barcode": "171133738",
            "dpc": "03013715401",
            "name": "រៀម ធាត់"
        },
        {
            "barcode": "171133739",
            "dpc": "03013715601",
            "name": "យូ រ៉ាដេត"
        },
        {
            "barcode": "171133740",
            "dpc": "03013715701",
            "name": "កិន អង់ផល្លា"
        },
        {
            "barcode": "171133741",
            "dpc": "03013715801",
            "name": "កិន គីនណារិន"
        },
        {
            "barcode": "171133742",
            "dpc": "03013715901",
            "name": "កិន គីរំដួល"
        },
        {
            "barcode": "171133743",
            "dpc": "03013716001",
            "name": "កិន គីរ៉ានី"
        },
        {
            "barcode": "171133744",
            "dpc": "03013716101",
            "name": "កិន សាខាឌី"
        },
        {
            "barcode": "171133745",
            "dpc": "03013716201",
            "name": "ជា ហេង"
        },
        {
            "barcode": "171133746",
            "dpc": "03013716301",
            "name": "ជ័យ ឆាយ"
        },
        {
            "barcode": "171133747",
            "dpc": "03013716401",
            "name": "ចេង ទ្រី"
        },
        {
            "barcode": "171133748",
            "dpc": "03013716501",
            "name": "លាប គាវ"
        },
        {
            "barcode": "171133749",
            "dpc": "03013716601",
            "name": "ប៉ែន ឃីម"
        },
        {
            "barcode": "171133750",
            "dpc": "03013716701",
            "name": "ចាន់ បូរិន"
        },
        {
            "barcode": "171133751",
            "dpc": "03013716801",
            "name": "វិទ្យាល័យ អន្លង់វិល"
        },
        {
            "barcode": "171133752",
            "dpc": "03013716901",
            "name": "ប៊ុនឈឿយ សុម៉ាលី"
        },
        {
            "barcode": "171133753",
            "dpc": "03013717001",
            "name": "ប៊ុនឈឿយ ចាន់មុន្នី"
        },
        {
            "barcode": "171133754",
            "dpc": "03013717101",
            "name": "ឈឺត សួម"
        },
        {
            "barcode": "171133755",
            "dpc": "03013717201",
            "name": "ណុប ពោល២"
        },
        {
            "barcode": "171133756",
            "dpc": "03013717301",
            "name": "ណុប ស៊ីន"
        },
        {
            "barcode": "171133757",
            "dpc": "03013717401",
            "name": "យិប គង់"
        },
        {
            "barcode": "171133758",
            "dpc": "03013717501",
            "name": "ស៊ុយ សុវណ្ណា"
        },
        {
            "barcode": "171133759",
            "dpc": "03013717601",
            "name": "លឹម គឹមហេង"
        },
        {
            "barcode": "171133760",
            "dpc": "03013717701",
            "name": "​ហឺសេរីលក្ខណ មន្នី"
        },
        {
            "barcode": "171133761",
            "dpc": "03013717801",
            "name": "រុំ ឈាងលី"
        },
        {
            "barcode": "171133762",
            "dpc": "03013717901",
            "name": "ស៊ាន នី"
        },
        {
            "barcode": "171133763",
            "dpc": "03013718001",
            "name": "ហុក រៀង"
        },
        {
            "barcode": "171133764",
            "dpc": "03013718101",
            "name": "ពយ ឈាន"
        },
        {
            "barcode": "171133765",
            "dpc": "03013718201",
            "name": "ចែម សៀន"
        },
        {
            "barcode": "171133766",
            "dpc": "03013718301",
            "name": "ព្រីម ណាត"
        },
        {
            "barcode": "171133767",
            "dpc": "03013718401",
            "name": "ហ៊ុន ផាន់ណា"
        },
        {
            "barcode": "171133768",
            "dpc": "03013718601",
            "name": "កូន ប៊ុនឈាន"
        },
        {
            "barcode": "171133769",
            "dpc": "03013718701",
            "name": "ឃួន ស៊ីនួន"
        },
        {
            "barcode": "171133770",
            "dpc": "03013718901",
            "name": "តែង ឡឹម"
        },
        {
            "barcode": "171133771",
            "dpc": "03013719001",
            "name": "ម៉ម មួន"
        },
        {
            "barcode": "171133772",
            "dpc": "03013719101",
            "name": "ឈួយ យ៉ុន"
        },
        {
            "barcode": "171133773",
            "dpc": "03013719201",
            "name": "ចាន់ ឈួក"
        },
        {
            "barcode": "171133774",
            "dpc": "03013719301",
            "name": "ភឿង សាវុធ"
        },
        {
            "barcode": "171133775",
            "dpc": "03013719401",
            "name": "សំ បូណា"
        },
        {
            "barcode": "171133776",
            "dpc": "03013719501",
            "name": "សំ សុជី"
        },
        {
            "barcode": "171133777",
            "dpc": "03013719601",
            "name": "គង់ គឿត"
        },
        {
            "barcode": "171133778",
            "dpc": "03013719701",
            "name": "អ៊ាន សុខអេង"
        },
        {
            "barcode": "171133779",
            "dpc": "03013719901",
            "name": "កេន សាវី"
        },
        {
            "barcode": "171133780",
            "dpc": "03013720001",
            "name": "ប៉ុច សុឃឿន"
        },
        {
            "barcode": "171133781",
            "dpc": "03013720101",
            "name": "ទេព មុំ"
        },
        {
            "barcode": "171133782",
            "dpc": "03013720201",
            "name": "ប៊ុន សារុន"
        },
        {
            "barcode": "171133783",
            "dpc": "03013720301",
            "name": "កែវ ភាវី"
        },
        {
            "barcode": "171133784",
            "dpc": "03013720401",
            "name": "អាន បឿន"
        },
        {
            "barcode": "171133785",
            "dpc": "03013720501",
            "name": "ដន មែងជា"
        },
        {
            "barcode": "171133786",
            "dpc": "03013720601",
            "name": "ហេង ឆាយ"
        },
        {
            "barcode": "171133787",
            "dpc": "03013720701",
            "name": "អាន ចិន្ថា"
        },
        {
            "barcode": "171133788",
            "dpc": "03013720801",
            "name": "ជួ កែវពិសិដ្ឋ"
        },
        {
            "barcode": "171133789",
            "dpc": "03013720901",
            "name": "នួរ សារ៉ាត់ធី"
        },
        {
            "barcode": "171133790",
            "dpc": "03013721001",
            "name": "យ៉ន ចន្ធួ"
        },
        {
            "barcode": "171133791",
            "dpc": "03013721101",
            "name": "ម៉ៅ ម៉ាលីលី"
        },
        {
            "barcode": "171133792",
            "dpc": "03013721201",
            "name": "ឌី សុខលីម"
        },
        {
            "barcode": "171133793",
            "dpc": "03013721301",
            "name": "ដោ ដារ៉ាវី"
        },
        {
            "barcode": "171133794",
            "dpc": "03013721401",
            "name": "ទេព សាម៉ុន"
        },
        {
            "barcode": "171133795",
            "dpc": "03013721501",
            "name": "យឹម ប៉ូលីន"
        },
        {
            "barcode": "171133796",
            "dpc": "03013721601",
            "name": "មាន សុវណ្នធីតា"
        },
        {
            "barcode": "171133797",
            "dpc": "03013721701",
            "name": "អ៊ឹត ភឿន"
        },
        {
            "barcode": "171133798",
            "dpc": "03013721801",
            "name": "រុន សុភាព"
        },
        {
            "barcode": "171133799",
            "dpc": "03013721901",
            "name": "សយ ធឿន"
        },
        {
            "barcode": "171133800",
            "dpc": "03013722101",
            "name": "សៀង វ៉ន់ថា"
        },
        {
            "barcode": "171133801",
            "dpc": "03013722201",
            "name": "សៀងអែម មរកត"
        },
        {
            "barcode": "171133802",
            "dpc": "03013722301",
            "name": "សៀង វ៉ាន"
        },
        {
            "barcode": "171133803",
            "dpc": "03013722401",
            "name": "ឈុន សាវុត"
        },
        {
            "barcode": "171133804",
            "dpc": "03013722501",
            "name": "លុក ចាន់រ៉ាស៊ី"
        },
        {
            "barcode": "171133805",
            "dpc": "03013722601",
            "name": "អាង សំអ៊ុន"
        },
        {
            "barcode": "171133806",
            "dpc": "03013722701",
            "name": "អៀង សារឿន"
        },
        {
            "barcode": "171133807",
            "dpc": "03013722801",
            "name": "ខាវ អ៊ាង"
        },
        {
            "barcode": "171133808",
            "dpc": "03013722901",
            "name": "ស សុភ័ក្រ"
        },
        {
            "barcode": "171133809",
            "dpc": "03013723001",
            "name": "ពឿត រិន"
        },
        {
            "barcode": "171133810",
            "dpc": "03013723201",
            "name": "ងិន ទូច"
        },
        {
            "barcode": "171133811",
            "dpc": "03013723301",
            "name": "ហាត ម៉ាប់"
        },
        {
            "barcode": "171133812",
            "dpc": "03013723401",
            "name": "ធឿន សុផាន់នី"
        },
        {
            "barcode": "171133813",
            "dpc": "03013723501",
            "name": "ឈុន សាវើន"
        },
        {
            "barcode": "171133814",
            "dpc": "03013723601",
            "name": "ឈុន សាខុម"
        },
        {
            "barcode": "171133815",
            "dpc": "03013723701",
            "name": "ឈុត ប៊ុនលឿត"
        },
        {
            "barcode": "171133816",
            "dpc": "03013723901",
            "name": "សិន សាន្ត"
        },
        {
            "barcode": "171133817",
            "dpc": "03013724001",
            "name": "អៀង លួត"
        },
        {
            "barcode": "171133818",
            "dpc": "03013724101",
            "name": "ឈួយ សុធី"
        },
        {
            "barcode": "171133819",
            "dpc": "03013724201",
            "name": "អែម រ៉ាឌី"
        },
        {
            "barcode": "171133820",
            "dpc": "03013724301",
            "name": "លឹម ហូង"
        },
        {
            "barcode": "171133821",
            "dpc": "03013724401",
            "name": "លន គ្រួច"
        },
        {
            "barcode": "171133822",
            "dpc": "03013724501",
            "name": "វ៉ន កំសត់"
        },
        {
            "barcode": "171133823",
            "dpc": "03013724601",
            "name": "មឿន ពៅ"
        },
        {
            "barcode": "171133824",
            "dpc": "03013724701",
            "name": "ង៉ូវ ឌៀប"
        },
        {
            "barcode": "171133825",
            "dpc": "03013724801",
            "name": "ស គ្រីម៉ុត"
        },
        {
            "barcode": "171133826",
            "dpc": "03013724901",
            "name": "យឹម វិចិត្រ"
        },
        {
            "barcode": "171133827",
            "dpc": "03013725001",
            "name": "ឆៃ ប៊ុនយៀន"
        },
        {
            "barcode": "171133828",
            "dpc": "03013725101",
            "name": "ឌឿន ណាវី"
        },
        {
            "barcode": "171133829",
            "dpc": "03013725201",
            "name": "ឌឿន ណារ៉ុង"
        },
        {
            "barcode": "171133830",
            "dpc": "03013725301",
            "name": "រុណ វណ្ណរ៉ា"
        },
        {
            "barcode": "171133831",
            "dpc": "03013725401",
            "name": "អ៊ូរ សាវ៉ុង"
        },
        {
            "barcode": "171133832",
            "dpc": "03013725501",
            "name": "សុខ នរិន្ទ"
        },
        {
            "barcode": "171133833",
            "dpc": "03013725601",
            "name": "សួ គឹមឡាង"
        },
        {
            "barcode": "171133834",
            "dpc": "03013725701",
            "name": "ឆោម រ៉ាន់"
        },
        {
            "barcode": "171133835",
            "dpc": "03013725901",
            "name": "អ៊ុន វណ្ណា"
        },
        {
            "barcode": "171133836",
            "dpc": "03013726001",
            "name": "មុន ហ៊ុំ"
        },
        {
            "barcode": "171133837",
            "dpc": "03013726101",
            "name": "ស្រស់ អូន"
        },
        {
            "barcode": "171133838",
            "dpc": "03013726201",
            "name": "ឆឺត នេត"
        },
        {
            "barcode": "171133839",
            "dpc": "03013726301",
            "name": "ម៉ី ដារ៉ា"
        },
        {
            "barcode": "171133840",
            "dpc": "03013726401",
            "name": "នង បណ្ណា"
        },
        {
            "barcode": "171133841",
            "dpc": "03013726501",
            "name": "ឈួន សំណាង"
        },
        {
            "barcode": "171133842",
            "dpc": "03013726601",
            "name": "គង់ ណារិន"
        },
        {
            "barcode": "171133843",
            "dpc": "03013726701",
            "name": "ភឿត រ៉េត"
        },
        {
            "barcode": "171133844",
            "dpc": "03013726801",
            "name": "យិន តូ"
        },
        {
            "barcode": "171133845",
            "dpc": "03013726901",
            "name": "ឡេង បាន"
        },
        {
            "barcode": "171133846",
            "dpc": "03013727001",
            "name": "សាយ ធួន"
        },
        {
            "barcode": "171133847",
            "dpc": "03013727201",
            "name": "សុខ សុផល"
        },
        {
            "barcode": "171133848",
            "dpc": "03013727301",
            "name": "ឈិត បុទុម"
        },
        {
            "barcode": "171133849",
            "dpc": "03013727401",
            "name": "សុង សុភាព"
        },
        {
            "barcode": "171133850",
            "dpc": "03013727701",
            "name": "ម៉ែន ភារុណ"
        },
        {
            "barcode": "171133851",
            "dpc": "03013727801",
            "name": "ប៊ី ម៉េងស៊"
        },
        {
            "barcode": "171133852",
            "dpc": "03013727901",
            "name": "ឌួង វាសនា"
        },
        {
            "barcode": "171133853",
            "dpc": "03013728001",
            "name": "តូច ប៊ុនថន"
        },
        {
            "barcode": "171133854",
            "dpc": "03013728201",
            "name": "សេង ហឺ"
        },
        {
            "barcode": "171133855",
            "dpc": "03013728301",
            "name": "ស៊ុម វុធ"
        },
        {
            "barcode": "171133856",
            "dpc": "03013728501",
            "name": "ធូគឹម លន់"
        },
        {
            "barcode": "171133857",
            "dpc": "03013728601",
            "name": "ប៉ុល សុភេង"
        },
        {
            "barcode": "171133858",
            "dpc": "03013728701",
            "name": "កៅ ធារ៉ា"
        },
        {
            "barcode": "171133859",
            "dpc": "03013728801",
            "name": "ឌុច វាសនា"
        },
        {
            "barcode": "171133860",
            "dpc": "03013728901",
            "name": "ម៉ៅ ប៊ុនថន"
        },
        {
            "barcode": "171133861",
            "dpc": "03013729001",
            "name": "ម៉ី មន្តា"
        },
        {
            "barcode": "171133862",
            "dpc": "03013729101",
            "name": "ហេង ប៊ុនឡាយ"
        },
        {
            "barcode": "171133863",
            "dpc": "03013729201",
            "name": "ហេង វិចិត្រ"
        },
        {
            "barcode": "171133864",
            "dpc": "03013729301",
            "name": "ស៊ីម ផល្លី"
        },
        {
            "barcode": "171133865",
            "dpc": "03013729401",
            "name": "ឡោ ប៊ុនទួន"
        },
        {
            "barcode": "171133866",
            "dpc": "03013729501",
            "name": "សាក់ ស៊ុន"
        },
        {
            "barcode": "171133867",
            "dpc": "03013729601",
            "name": "ម៉ុត ចន្ជី"
        },
        {
            "barcode": "171133868",
            "dpc": "03013729701",
            "name": "ឡេង ឌី"
        },
        {
            "barcode": "171133869",
            "dpc": "03013729801",
            "name": "ចក សុខុម"
        },
        {
            "barcode": "171133870",
            "dpc": "03013729901",
            "name": "ឡង វាសនា"
        },
        {
            "barcode": "171133871",
            "dpc": "03013730201",
            "name": "វិញ ហង់"
        },
        {
            "barcode": "171133872",
            "dpc": "03013730301",
            "name": "គា ពេជ្រនេត្រា"
        },
        {
            "barcode": "171133873",
            "dpc": "03013730401",
            "name": "គា មករា"
        },
        {
            "barcode": "171133874",
            "dpc": "03013730501",
            "name": "តន ចន្ទី"
        },
        {
            "barcode": "171133875",
            "dpc": "03013730601",
            "name": "តន ចាន់ទុំ"
        },
        {
            "barcode": "171133876",
            "dpc": "03013730701",
            "name": "តូច ណម"
        },
        {
            "barcode": "171133877",
            "dpc": "03013730801",
            "name": "លូង ស្រីរ៏ត្ន"
        },
        {
            "barcode": "171133878",
            "dpc": "03013730901",
            "name": "តូច តែម"
        },
        {
            "barcode": "171133879",
            "dpc": "03013731001",
            "name": "ឈុំ ប៉ិច"
        },
        {
            "barcode": "171133880",
            "dpc": "03013731101",
            "name": "ផន ផល្លី"
        },
        {
            "barcode": "171133881",
            "dpc": "03013731201",
            "name": "ស្រេង សេងហ៊ា"
        },
        {
            "barcode": "171133882",
            "dpc": "03013731301",
            "name": "ចាន់ សុធី"
        },
        {
            "barcode": "171133883",
            "dpc": "03013731501",
            "name": "អៀន ណារិន"
        },
        {
            "barcode": "171133884",
            "dpc": "03013731601",
            "name": "ញ៉ែ ឡាយ"
        },
        {
            "barcode": "171133885",
            "dpc": "03013731701",
            "name": "មាន នី"
        },
        {
            "barcode": "171133886",
            "dpc": "03013731801",
            "name": "ឆាន់ កែម"
        },
        {
            "barcode": "171133887",
            "dpc": "03013731901",
            "name": "ឈិត លំអង"
        },
        {
            "barcode": "171133888",
            "dpc": "03013732001",
            "name": "ពេជ្រ ខាន់"
        },
        {
            "barcode": "171133889",
            "dpc": "03013732101",
            "name": "ប៉ែន ស្រីលីន"
        },
        {
            "barcode": "171133890",
            "dpc": "03013732201",
            "name": "អាង រ៉េន"
        },
        {
            "barcode": "171133891",
            "dpc": "03013732301",
            "name": "រ៉េត សត្តារតន៏"
        },
        {
            "barcode": "171133892",
            "dpc": "03013732401",
            "name": "ជិន វីរៈ"
        },
        {
            "barcode": "171133893",
            "dpc": "03013732501",
            "name": "វ៉ើន ផល្លី"
        },
        {
            "barcode": "171133894",
            "dpc": "03013732601",
            "name": "និត សោភា"
        },
        {
            "barcode": "171133895",
            "dpc": "03013732701",
            "name": "ហ៊ីម ប៊ុនទិត្យ"
        },
        {
            "barcode": "171133896",
            "dpc": "03013732801",
            "name": "ងួន រដ្ឋា"
        },
        {
            "barcode": "171133897",
            "dpc": "03013732901",
            "name": "ង៉ែត សាវុធ"
        },
        {
            "barcode": "171133898",
            "dpc": "03013733101",
            "name": "សាតា​ ហ៊រ"
        },
        {
            "barcode": "171133899",
            "dpc": "03013733201",
            "name": "ស សារឿន"
        },
        {
            "barcode": "171133900",
            "dpc": "03013733301",
            "name": "អូច និល"
        },
        {
            "barcode": "171133901",
            "dpc": "03013733401",
            "name": "ជា ស្រ៊ុន"
        },
        {
            "barcode": "171133902",
            "dpc": "03013733501",
            "name": "ម៉ៅ ស្រស់"
        },
        {
            "barcode": "171133903",
            "dpc": "03013733701",
            "name": "ងួន អាដាមស៊ី"
        },
        {
            "barcode": "171133904",
            "dpc": "03013733801",
            "name": "លី គឹមសាន្ត"
        },
        {
            "barcode": "171133905",
            "dpc": "03013733901",
            "name": "កែវ សារុំ"
        },
        {
            "barcode": "171133906",
            "dpc": "03013734001",
            "name": "សែម គឹមហ៊ិន"
        },
        {
            "barcode": "171133907",
            "dpc": "03013734101",
            "name": "អន អៀម"
        },
        {
            "barcode": "171133908",
            "dpc": "03013734201",
            "name": "ធឿម ប៊ុនធីម"
        },
        {
            "barcode": "171133909",
            "dpc": "03013734301",
            "name": "ស៊ូ ភល្លិយ៉ា"
        },
        {
            "barcode": "171133910",
            "dpc": "03013734401",
            "name": "ជោក រស្មី"
        },
        {
            "barcode": "171133911",
            "dpc": "03013734501",
            "name": "កុក ឡៃយាន"
        },
        {
            "barcode": "171133912",
            "dpc": "03013734601",
            "name": "រួន វណ្ណះ"
        },
        {
            "barcode": "171133913",
            "dpc": "03013734701",
            "name": "ឡឹក ស្រីលក្ខ័"
        },
        {
            "barcode": "171133914",
            "dpc": "03013734801",
            "name": "ខា ផាន"
        },
        {
            "barcode": "171133915",
            "dpc": "03013734901",
            "name": "សយ សារ៉ាក់"
        },
        {
            "barcode": "171133916",
            "dpc": "03013735001",
            "name": "សូរ​ សុភក្ត្រា"
        },
        {
            "barcode": "171133917",
            "dpc": "03013735101",
            "name": "តង ចិន្តា"
        },
        {
            "barcode": "171133918",
            "dpc": "03013735201",
            "name": "រើន ម៉ាឡា"
        },
        {
            "barcode": "171133919",
            "dpc": "03013735301",
            "name": "អេង សោភា"
        },
        {
            "barcode": "171133920",
            "dpc": "03013735501",
            "name": "ឈឹម ចាន់ចរិយា"
        },
        {
            "barcode": "171133921",
            "dpc": "03013735601",
            "name": "ឈីវ រចនា"
        },
        {
            "barcode": "171133922",
            "dpc": "03013735801",
            "name": "ចាយ អាន"
        },
        {
            "barcode": "171133923",
            "dpc": "03013735901",
            "name": "កែន ឆើយ"
        },
        {
            "barcode": "171133924",
            "dpc": "03013736001",
            "name": "ចង់ រឿត"
        },
        {
            "barcode": "171133925",
            "dpc": "03013736101",
            "name": "ទូច អុល"
        },
        {
            "barcode": "171133926",
            "dpc": "03013736201",
            "name": "ឈឿន ភូ"
        },
        {
            "barcode": "171133927",
            "dpc": "03013736301",
            "name": "ណាន់ ចិន្តា"
        },
        {
            "barcode": "171133928",
            "dpc": "03013736501",
            "name": "ម៉ន ផាន់ណា"
        },
        {
            "barcode": "171133929",
            "dpc": "03013736601",
            "name": "កែវ ណារត្ន័"
        },
        {
            "barcode": "171133930",
            "dpc": "03013736701",
            "name": "ព្រីង វណ្ណនី"
        },
        {
            "barcode": "171133931",
            "dpc": "03013736901",
            "name": "វ៉ាន់ សឿន"
        },
        {
            "barcode": "171133932",
            "dpc": "03013737001",
            "name": "ខឹង សំណាង"
        },
        {
            "barcode": "171133933",
            "dpc": "03013737101",
            "name": "ម៉ា វ៉ុង"
        },
        {
            "barcode": "171133934",
            "dpc": "03013737201",
            "name": "ឡាច វ៉ុង"
        },
        {
            "barcode": "171133935",
            "dpc": "03013737301",
            "name": "ឆែម សារឿត"
        },
        {
            "barcode": "171133936",
            "dpc": "03013737401",
            "name": "ខេង ពិសី"
        },
        {
            "barcode": "171133937",
            "dpc": "03013737501",
            "name": "ឆឺន ណាន់"
        },
        {
            "barcode": "171133938",
            "dpc": "03013737601",
            "name": "ឈួក វិចិត្រ"
        },
        {
            "barcode": "171133939",
            "dpc": "03013737801",
            "name": "ប៉ិច ស៊ីហា"
        },
        {
            "barcode": "171133940",
            "dpc": "03013737901",
            "name": "សោម សុធា"
        },
        {
            "barcode": "171133941",
            "dpc": "03013738001",
            "name": "អុំ សៅរ៉ានី"
        },
        {
            "barcode": "171133942",
            "dpc": "03013738101",
            "name": "សាវ៉ាត ទីណា"
        },
        {
            "barcode": "171133943",
            "dpc": "03013738201",
            "name": "ឆែម រី"
        },
        {
            "barcode": "171133944",
            "dpc": "03013738301",
            "name": "ជា ប៉ូឡូ"
        },
        {
            "barcode": "171133945",
            "dpc": "03013738401",
            "name": "គង់ វត្តា"
        },
        {
            "barcode": "171133946",
            "dpc": "03013738501",
            "name": "នៅ សេដ្ឋា"
        },
        {
            "barcode": "171133947",
            "dpc": "03013738601",
            "name": "នួម សំរិទ្ទ"
        },
        {
            "barcode": "171133948",
            "dpc": "03013738701",
            "name": "ខុម សុឃឿន"
        },
        {
            "barcode": "171133949",
            "dpc": "03013738801",
            "name": "សុខ ធីតា"
        },
        {
            "barcode": "171133950",
            "dpc": "03013738901",
            "name": "ជឹម ឈន"
        },
        {
            "barcode": "171133951",
            "dpc": "03013739001",
            "name": "អ៊ុន រី"
        },
        {
            "barcode": "171133952",
            "dpc": "03013739101",
            "name": "ជិន រិន"
        },
        {
            "barcode": "171133953",
            "dpc": "03013739201",
            "name": "ហម ធី"
        },
        {
            "barcode": "171133954",
            "dpc": "03013739401",
            "name": "ហូត​ វិច្ចិកា"
        },
        {
            "barcode": "171133955",
            "dpc": "03013739501",
            "name": "ម៉ាត ម៉ារីយ៉ង"
        },
        {
            "barcode": "171133956",
            "dpc": "03013739601",
            "name": "ជន រី"
        },
        {
            "barcode": "171133957",
            "dpc": "03013739801",
            "name": "ត្រឿង រដ្ខសាស្តា"
        },
        {
            "barcode": "171133958",
            "dpc": "03013739901",
            "name": "ទ្រឿង រដ្ខតេវី"
        },
        {
            "barcode": "171133959",
            "dpc": "03013740001",
            "name": "ប៉ាច ចិន្តា"
        },
        {
            "barcode": "171133960",
            "dpc": "03013740101",
            "name": "កង់ ចំរើន"
        },
        {
            "barcode": "171133961",
            "dpc": "03013740201",
            "name": "បូ លីវី"
        },
        {
            "barcode": "171133962",
            "dpc": "03013740301",
            "name": "អ៊ី ហ្គិចលីម"
        },
        {
            "barcode": "171133963",
            "dpc": "03013740401",
            "name": "ព្រហ្ម ស៊ីនណាត"
        },
        {
            "barcode": "171133964",
            "dpc": "03013740501",
            "name": "ញូង ចំរើន"
        },
        {
            "barcode": "171133965",
            "dpc": "03013740601",
            "name": "វ៉ាន ធៀវ"
        },
        {
            "barcode": "171133966",
            "dpc": "03013740701",
            "name": "នុត នាង ៣"
        },
        {
            "barcode": "171133967",
            "dpc": "03013740801",
            "name": "ង៉ែត វ៉ានថាវ"
        },
        {
            "barcode": "171133968",
            "dpc": "03013740901",
            "name": "គឹម សុខា"
        },
        {
            "barcode": "171133969",
            "dpc": "03013741001",
            "name": "ចាន់ ហួយ"
        },
        {
            "barcode": "171133970",
            "dpc": "03013741101",
            "name": "ណន សុនាថ"
        },
        {
            "barcode": "171133971",
            "dpc": "03013741301",
            "name": "រស វណ្ណរ៉ា"
        },
        {
            "barcode": "171133972",
            "dpc": "03013741401",
            "name": "ផា បាណូ"
        },
        {
            "barcode": "171133973",
            "dpc": "03013741501",
            "name": "រើយ រឿត"
        },
        {
            "barcode": "171133974",
            "dpc": "03013741601",
            "name": "មុត សម្បត្តិ"
        },
        {
            "barcode": "171133975",
            "dpc": "03013741701",
            "name": "ថេត ណាវ៉ាន់នី"
        },
        {
            "barcode": "171133976",
            "dpc": "03013741801",
            "name": "រៀម សុធា"
        },
        {
            "barcode": "171133977",
            "dpc": "03013741901",
            "name": "ម៉ៅ គន្ធា"
        },
        {
            "barcode": "171133978",
            "dpc": "03013742001",
            "name": "ជួន ប៊ុនធួក"
        },
        {
            "barcode": "171133979",
            "dpc": "03013742101",
            "name": "វុត ណៃ"
        },
        {
            "barcode": "171133980",
            "dpc": "03013742201",
            "name": "អឿម ជីម"
        },
        {
            "barcode": "171133981",
            "dpc": "03013742401",
            "name": "មឿន ពុយ"
        },
        {
            "barcode": "171133982",
            "dpc": "03013742501",
            "name": "ហឿង សារ៉ាត់៣"
        },
        {
            "barcode": "171133983",
            "dpc": "03013742701",
            "name": "ប៊ុន រិទ្ធលួន"
        },
        {
            "barcode": "171133984",
            "dpc": "03013742801",
            "name": "សូ សាវឿត"
        },
        {
            "barcode": "171133985",
            "dpc": "03013743001",
            "name": "ប៊ុត សុម៉ាលី"
        },
        {
            "barcode": "171133986",
            "dpc": "03013743101",
            "name": "ឆំ ជី"
        },
        {
            "barcode": "171133987",
            "dpc": "03013743201",
            "name": "ទុយ ពៅ"
        },
        {
            "barcode": "171133988",
            "dpc": "03013743401",
            "name": "ទុយ ហាន"
        },
        {
            "barcode": "171133989",
            "dpc": "03013743501",
            "name": "ង៉ា សិញ"
        },
        {
            "barcode": "171133990",
            "dpc": "03013743601",
            "name": "កៀង សាលួម"
        },
        {
            "barcode": "171133991",
            "dpc": "03013743901",
            "name": "សួ ស្រីលីន"
        },
        {
            "barcode": "171133992",
            "dpc": "03013744001",
            "name": "ផៃ មុន្នី"
        },
        {
            "barcode": "171133993",
            "dpc": "03013744101",
            "name": "កែវ វណ្ណារី"
        },
        {
            "barcode": "171133994",
            "dpc": "03013744201",
            "name": "ម៉ឹង វិត្ត"
        },
        {
            "barcode": "171133995",
            "dpc": "03013744301",
            "name": "ជៀម ទ្រា"
        },
        {
            "barcode": "171133996",
            "dpc": "03013744401",
            "name": "សួន ដារ៉ា"
        },
        {
            "barcode": "171133997",
            "dpc": "03013744501",
            "name": "ហួន ថូយ"
        },
        {
            "barcode": "171133998",
            "dpc": "03013744601",
            "name": "ជៀម ប៉ិ"
        },
        {
            "barcode": "171133999",
            "dpc": "03013744701",
            "name": "មាន ចិន្តាមុន្នី"
        },
        {
            "barcode": "171134000",
            "dpc": "03013744801",
            "name": "នូ ដាលីន"
        },
        {
            "barcode": "171134001",
            "dpc": "03013744901",
            "name": "ពេជ្រ វណ្ណី"
        },
        {
            "barcode": "171134002",
            "dpc": "03013745001",
            "name": "ហេង សុខន"
        },
        {
            "barcode": "171134003",
            "dpc": "03013745101",
            "name": "សឿង ប៊ុនធឿន"
        },
        {
            "barcode": "171134004",
            "dpc": "03013745201",
            "name": "សៀវ យី"
        },
        {
            "barcode": "171134005",
            "dpc": "03013745301",
            "name": "ប៉ែន សោភ័ណ្ឌ"
        },
        {
            "barcode": "171134006",
            "dpc": "03013745401",
            "name": "ប៊ុ​ន ជ្រឹង"
        },
        {
            "barcode": "171134007",
            "dpc": "03013745501",
            "name": "មុំ ចាន់នីតា"
        },
        {
            "barcode": "171134008",
            "dpc": "03013745601",
            "name": "ទុំ លីដា"
        },
        {
            "barcode": "171134009",
            "dpc": "03013745701",
            "name": "តៀត ស្រស់"
        },
        {
            "barcode": "171134010",
            "dpc": "03013745901",
            "name": "ញ៉ែម សារឿន"
        },
        {
            "barcode": "171134011",
            "dpc": "03013746001",
            "name": "រឿន ប៊ុនរ័ត្ន"
        },
        {
            "barcode": "171134012",
            "dpc": "03013746101",
            "name": "ម៉ាត ថាន់"
        },
        {
            "barcode": "171134013",
            "dpc": "03013746201",
            "name": "ដាញ់ សុទ្ធាវី"
        },
        {
            "barcode": "171134014",
            "dpc": "03013746301",
            "name": "កុយ ថន"
        },
        {
            "barcode": "171134015",
            "dpc": "03013746401",
            "name": "ឈឹន ចំរើន"
        },
        {
            "barcode": "171134016",
            "dpc": "03013746501",
            "name": "លី កៀត"
        },
        {
            "barcode": "171134017",
            "dpc": "03013746601",
            "name": "សាំង វាសនា"
        },
        {
            "barcode": "171134018",
            "dpc": "03013746701",
            "name": "សុខ ពឿន"
        },
        {
            "barcode": "171134019",
            "dpc": "03013746901",
            "name": "យ៉េន សាម៉ុន"
        },
        {
            "barcode": "171134020",
            "dpc": "03013747001",
            "name": "ទេព ហុង"
        },
        {
            "barcode": "171134021",
            "dpc": "03013747101",
            "name": "ទូច ចុះ"
        },
        {
            "barcode": "171134022",
            "dpc": "03013747201",
            "name": "យឿន ច្រឹប"
        },
        {
            "barcode": "171134023",
            "dpc": "03013747301",
            "name": "អឿង សុឆាន់"
        },
        {
            "barcode": "171134024",
            "dpc": "03013747401",
            "name": "ឆេង ឆៃលី"
        },
        {
            "barcode": "171134025",
            "dpc": "03013747501",
            "name": "ទី គីមហួង"
        },
        {
            "barcode": "171134026",
            "dpc": "03013747601",
            "name": "ម៉េង ផល្លីន"
        },
        {
            "barcode": "171134027",
            "dpc": "03013747701",
            "name": "ទេស ហុង"
        },
        {
            "barcode": "171134028",
            "dpc": "03013747801",
            "name": "មុំ ចំរើន"
        },
        {
            "barcode": "171134029",
            "dpc": "03013747901",
            "name": "ស៊ីម ស៊ីត្រា"
        },
        {
            "barcode": "171134030",
            "dpc": "03013748001",
            "name": "ជួប ស្រីរត្ន័"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
