let start=moment('2018-01-01').toDate();
let end=moment('2018-01-30').toDate();

let barcodes=

    [
        {
            "barcode": "171135777",
            "dpc": "03024300101",
            "name": "កែម រតនា"
        },
        {
            "barcode": "171135778",
            "dpc": "03024300201",
            "name": "ស៊ិន សុទ្ធ"
        },
        {
            "barcode": "171135779",
            "dpc": "03024300301",
            "name": "តុក ស៊ីវគៀង"
        },
        {
            "barcode": "171135780",
            "dpc": "03024300401",
            "name": "ទាវ កៅ"
        },
        {
            "barcode": "171135781",
            "dpc": "03024300501",
            "name": "ឡុង ស៊ាងអេន"
        },
        {
            "barcode": "171135782",
            "dpc": "03024300601",
            "name": "ជៀម រ៉ាន់"
        },
        {
            "barcode": "171135783",
            "dpc": "03024300701",
            "name": "យីវ វណ្ណ:"
        },
        {
            "barcode": "171135784",
            "dpc": "03024300801",
            "name": "ប៊ូ ពេជ្រ"
        },
        {
            "barcode": "171135785",
            "dpc": "03024300901",
            "name": "ឈឺន សារឿន"
        },
        {
            "barcode": "171135786",
            "dpc": "03024301001",
            "name": "សឿន កុសល់"
        },
        {
            "barcode": "171135787",
            "dpc": "03024301101",
            "name": "ងូន ភា"
        },
        {
            "barcode": "171135788",
            "dpc": "03024301201",
            "name": "អ៊ុំ ឡុញ"
        },
        {
            "barcode": "171135789",
            "dpc": "03024301301",
            "name": "ប៊ូ ម៉ាច"
        },
        {
            "barcode": "171135790",
            "dpc": "03024301501",
            "name": "សូត្រ សង"
        },
        {
            "barcode": "171135791",
            "dpc": "03024301601",
            "name": "ស៊ុប ម៉ាន"
        },
        {
            "barcode": "171135792",
            "dpc": "03024301701",
            "name": "ស្រី យ៉ាត"
        },
        {
            "barcode": "171135793",
            "dpc": "03024301801",
            "name": "ម៉ម សុផា"
        },
        {
            "barcode": "171135794",
            "dpc": "03024301901",
            "name": "សៅ វឿត"
        },
        {
            "barcode": "171135795",
            "dpc": "03024302001",
            "name": "ហ៊ុន ធីម"
        },
        {
            "barcode": "171135796",
            "dpc": "03024302101",
            "name": "វ៉ន សុវណ្ណ"
        },
        {
            "barcode": "171135797",
            "dpc": "03024302201",
            "name": "ភាជ សុខុម"
        },
        {
            "barcode": "171135798",
            "dpc": "03024302301",
            "name": "មឿក សុភា"
        },
        {
            "barcode": "171135799",
            "dpc": "03024302401",
            "name": "មាស សាម៉ុន"
        },
        {
            "barcode": "171135800",
            "dpc": "03024302501",
            "name": "សុះ ហុង"
        },
        {
            "barcode": "171135801",
            "dpc": "03024302801",
            "name": "ផាត់ ទីម៉ាស"
        },
        {
            "barcode": "171135802",
            "dpc": "03024302901",
            "name": "អួន ឡាត់"
        },
        {
            "barcode": "171135803",
            "dpc": "03024303001",
            "name": "លី ទូច"
        },
        {
            "barcode": "171135804",
            "dpc": "03024303101",
            "name": "សូន សារិន"
        },
        {
            "barcode": "171135805",
            "dpc": "03024303301",
            "name": "លី ឡាយ"
        },
        {
            "barcode": "171135806",
            "dpc": "03024303401",
            "name": "ឡម ផាន"
        },
        {
            "barcode": "171135807",
            "dpc": "03024303601",
            "name": "យក់ រ៉េន"
        },
        {
            "barcode": "171135808",
            "dpc": "03024303701",
            "name": "ចាន់ សុផាវី"
        },
        {
            "barcode": "171135809",
            "dpc": "03024303801",
            "name": "ប៉ិច ផាន"
        },
        {
            "barcode": "171135810",
            "dpc": "03024303901",
            "name": "ប៉ិច សួស"
        },
        {
            "barcode": "171135811",
            "dpc": "03024304001",
            "name": "ភួង អឿន"
        },
        {
            "barcode": "171135812",
            "dpc": "03024304101",
            "name": "គីម សំអុល"
        },
        {
            "barcode": "171135813",
            "dpc": "03024304201",
            "name": "សំរិទ្ធ លុច"
        },
        {
            "barcode": "171135814",
            "dpc": "03024304301",
            "name": "វី រ៉ាវ៉ាត់"
        },
        {
            "barcode": "171135815",
            "dpc": "03024304401",
            "name": "យ័ន ណាត"
        },
        {
            "barcode": "171135816",
            "dpc": "03024304501",
            "name": "សាន់ ស៊ីន"
        },
        {
            "barcode": "171135817",
            "dpc": "03024304601",
            "name": "រីម លន់"
        },
        {
            "barcode": "171135818",
            "dpc": "03024305001",
            "name": "រុន វុទ្ទី"
        },
        {
            "barcode": "171135819",
            "dpc": "03024305101",
            "name": "ណុម រ៉េត"
        },
        {
            "barcode": "171135820",
            "dpc": "03024305201",
            "name": "ឈិន ឡា"
        },
        {
            "barcode": "171135821",
            "dpc": "03024305301",
            "name": "ជា សំហុន"
        },
        {
            "barcode": "171135822",
            "dpc": "03024305401",
            "name": "សេង រីហ៊"
        },
        {
            "barcode": "171135823",
            "dpc": "03024305501",
            "name": "ភឿក រ៉ាត"
        },
        {
            "barcode": "171135824",
            "dpc": "03024305601",
            "name": "លួត ចាន់ថុល"
        },
        {
            "barcode": "171135825",
            "dpc": "03024305701",
            "name": "សុត ស៊ីណា"
        },
        {
            "barcode": "171135826",
            "dpc": "03024305901",
            "name": "រឿម មុំ"
        },
        {
            "barcode": "171135827",
            "dpc": "03024306101",
            "name": "ភាជ ឈាន"
        },
        {
            "barcode": "171135828",
            "dpc": "03024306201",
            "name": "តូច វួចហួយ"
        },
        {
            "barcode": "171135829",
            "dpc": "03024306301",
            "name": "ថាវ ឌឿក"
        },
        {
            "barcode": "171135830",
            "dpc": "03024306401",
            "name": "ផាន់ ប៊ុនធួន"
        },
        {
            "barcode": "171135831",
            "dpc": "03024306501",
            "name": "ផាន សុភា"
        },
        {
            "barcode": "171135832",
            "dpc": "03024306601",
            "name": "ឈន ឆាន"
        },
        {
            "barcode": "171135833",
            "dpc": "03024306701",
            "name": "ប៊ុត សាម៉េត"
        },
        {
            "barcode": "171135834",
            "dpc": "03024306801",
            "name": "ឈិន កក្កដា"
        },
        {
            "barcode": "171135835",
            "dpc": "03024307001",
            "name": "រ៉ាត់ ចិត្រា"
        },
        {
            "barcode": "171135836",
            "dpc": "03024307101",
            "name": "ផេង សុធា"
        },
        {
            "barcode": "171135837",
            "dpc": "03024307201",
            "name": "ហម លាភី"
        },
        {
            "barcode": "171135838",
            "dpc": "03024307501",
            "name": "ម៉ុត ស្រីរដ្ឋ"
        },
        {
            "barcode": "171135839",
            "dpc": "03024307801",
            "name": "ផ្ទះលេខ214"
        },
        {
            "barcode": "171135840",
            "dpc": "03024307901",
            "name": "ផ្ទះលេខ139"
        },
        {
            "barcode": "171135841",
            "dpc": "03024308001",
            "name": "ម៉ាលីស"
        },
        {
            "barcode": "171135842",
            "dpc": "03024308101",
            "name": "ឡោះ យ៉ាស់"
        },
        {
            "barcode": "171135843",
            "dpc": "03024308201",
            "name": "លី សាក់"
        },
        {
            "barcode": "171135844",
            "dpc": "03024308301",
            "name": "សាន សោភា"
        },
        {
            "barcode": "171135845",
            "dpc": "03024308401",
            "name": "ហម សុជាតិ"
        },
        {
            "barcode": "171135846",
            "dpc": "03024308501",
            "name": "ប៊ុន សុវណ្ណ"
        },
        {
            "barcode": "171135847",
            "dpc": "03024308601",
            "name": "អឹម ប៊ីន"
        },
        {
            "barcode": "171135848",
            "dpc": "03024308701",
            "name": "ទ្រិញ សម្បត្តិ"
        },
        {
            "barcode": "171135849",
            "dpc": "03024308801",
            "name": "ឆាយ បូរ៉ាទីន"
        },
        {
            "barcode": "171135850",
            "dpc": "03024308901",
            "name": "ឌឹម រិទ្ធិ"
        },
        {
            "barcode": "171135851",
            "dpc": "03024309001",
            "name": "ចាន់ ផល្លា"
        },
        {
            "barcode": "171135852",
            "dpc": "03024309101",
            "name": "ឈុន សាន"
        },
        {
            "barcode": "171135853",
            "dpc": "03024309201",
            "name": "បាន ឡង២"
        },
        {
            "barcode": "171135854",
            "dpc": "03024309301",
            "name": "ម៉ៅ សារ៉ាវុធ"
        },
        {
            "barcode": "171135855",
            "dpc": "03024309401",
            "name": "ហ៊ីង គីរីរ័ត្ន"
        },
        {
            "barcode": "171135856",
            "dpc": "03024309801",
            "name": "ជឺ តុងសួរ"
        },
        {
            "barcode": "171135857",
            "dpc": "03024309901",
            "name": "ទ័រ វ៉ាន់២"
        },
        {
            "barcode": "171135858",
            "dpc": "03024310201",
            "name": "ហេង សុផា"
        },
        {
            "barcode": "171135859",
            "dpc": "03024310301",
            "name": "ឡុង រ័ត្នមុន្នី"
        },
        {
            "barcode": "171135860",
            "dpc": "03024310401",
            "name": "នូន ផល្លី"
        },
        {
            "barcode": "171135861",
            "dpc": "03024310501",
            "name": "ហេង លី"
        },
        {
            "barcode": "171135862",
            "dpc": "03024310601",
            "name": "សុខ ចំរើន"
        },
        {
            "barcode": "171135863",
            "dpc": "03024310701",
            "name": "ម៉ក់ ចំណាន"
        },
        {
            "barcode": "171135864",
            "dpc": "03024310801",
            "name": "ហូរ ទិត្យ"
        },
        {
            "barcode": "171135865",
            "dpc": "03024311301",
            "name": "ផាត សុផានិត"
        },
        {
            "barcode": "171135866",
            "dpc": "03024311401",
            "name": "សាយ ស៊ីណា"
        },
        {
            "barcode": "171135867",
            "dpc": "03024311501",
            "name": "សៅ ឆម"
        },
        {
            "barcode": "171135868",
            "dpc": "03024311601",
            "name": "ឈាង សារ៉ន"
        },
        {
            "barcode": "171135869",
            "dpc": "03024311701",
            "name": "ជា កែវ"
        },
        {
            "barcode": "171135870",
            "dpc": "03024311801",
            "name": "នួន បុប្ភា"
        },
        {
            "barcode": "171135871",
            "dpc": "03024311901",
            "name": "អ៊ុន ចន្ថា"
        },
        {
            "barcode": "171135872",
            "dpc": "03024312001",
            "name": "អឿន គីមសេង"
        },
        {
            "barcode": "171135873",
            "dpc": "03024312101",
            "name": "គង់ ថេត"
        },
        {
            "barcode": "171135874",
            "dpc": "03024312201",
            "name": "ច័ន្ទ ដារ៉ា"
        },
        {
            "barcode": "171135875",
            "dpc": "03024312301",
            "name": "សេង ឡេង"
        },
        {
            "barcode": "171135876",
            "dpc": "03024312401",
            "name": "សាំ ប៊ី"
        },
        {
            "barcode": "171135877",
            "dpc": "03024312501",
            "name": "ដួង សុភ័ក្រ"
        },
        {
            "barcode": "171135878",
            "dpc": "03024312601",
            "name": "គង់ សារ៉េត"
        },
        {
            "barcode": "171135879",
            "dpc": "03024312701",
            "name": "នាង នីម"
        },
        {
            "barcode": "171135880",
            "dpc": "03024312801",
            "name": "គី ជិនតូ"
        },
        {
            "barcode": "171135881",
            "dpc": "03024312901",
            "name": "ផាន់ វុទ្ទី"
        },
        {
            "barcode": "171135882",
            "dpc": "03024313001",
            "name": "ជា វន្ថា"
        },
        {
            "barcode": "171135883",
            "dpc": "03024313101",
            "name": "យាន យុន"
        },
        {
            "barcode": "171135884",
            "dpc": "03024313201",
            "name": "រ៉ាត សុភ័ក"
        },
        {
            "barcode": "171135885",
            "dpc": "03024313301",
            "name": "ធឿន ចេក"
        },
        {
            "barcode": "171135886",
            "dpc": "03024313401",
            "name": "សុក ហ៊"
        },
        {
            "barcode": "171135887",
            "dpc": "03024313501",
            "name": "ជា យ៉ាន"
        },
        {
            "barcode": "171135888",
            "dpc": "03024313601",
            "name": "ម៉ៅ ឡា"
        },
        {
            "barcode": "171135889",
            "dpc": "03024313701",
            "name": "ពត សុខេន"
        },
        {
            "barcode": "171135890",
            "dpc": "03024314001",
            "name": "កប គិន"
        },
        {
            "barcode": "171135891",
            "dpc": "03024314101",
            "name": "ឌី សួរ"
        },
        {
            "barcode": "171135892",
            "dpc": "03024314201",
            "name": "ភី ជន"
        },
        {
            "barcode": "171135893",
            "dpc": "03024314301",
            "name": "យ៉ៅ វ៉ា"
        },
        {
            "barcode": "171135894",
            "dpc": "03024314401",
            "name": "យ៉ៅ អូន"
        },
        {
            "barcode": "171135895",
            "dpc": "03024314501",
            "name": "ទូច ប្រម"
        },
        {
            "barcode": "171135896",
            "dpc": "03024314601",
            "name": "ទូច ព្រឿន"
        },
        {
            "barcode": "171135897",
            "dpc": "03024314701",
            "name": "ទី"
        },
        {
            "barcode": "171135898",
            "dpc": "03024314801",
            "name": "គី សុជាតិ"
        },
        {
            "barcode": "171135899",
            "dpc": "03024314901",
            "name": "ឡេង ណាល់"
        },
        {
            "barcode": "171135900",
            "dpc": "03024315001",
            "name": "គី សាវិញ"
        },
        {
            "barcode": "171135901",
            "dpc": "03024315101",
            "name": "ហុង វណ្ណដេត"
        },
        {
            "barcode": "171135902",
            "dpc": "03024315201",
            "name": "ញ៉េន ញ៉ាវ"
        },
        {
            "barcode": "171135903",
            "dpc": "03024315301",
            "name": "ហេង គុណ"
        },
        {
            "barcode": "171135904",
            "dpc": "03024315401",
            "name": "ជុំ សារ័ត្ន"
        },
        {
            "barcode": "171135905",
            "dpc": "03024315501",
            "name": "ហេង បូរី"
        },
        {
            "barcode": "171135906",
            "dpc": "03024315601",
            "name": "នី អាន"
        },
        {
            "barcode": "171135907",
            "dpc": "03024315701",
            "name": "សឺន ម៉ៅ"
        },
        {
            "barcode": "171135908",
            "dpc": "03024315801",
            "name": "សុខ សុភ័ក្រ"
        },
        {
            "barcode": "171135909",
            "dpc": "03024315901",
            "name": "ស៊ឹម ពេជ្រ"
        },
        {
            "barcode": "171135910",
            "dpc": "03024316001",
            "name": "ហ៊ត សុធីណា"
        },
        {
            "barcode": "171135911",
            "dpc": "03024316101",
            "name": "សេង សុយ៉ាដា"
        },
        {
            "barcode": "171135912",
            "dpc": "03024316201",
            "name": "អឹម ដារ៉ា"
        },
        {
            "barcode": "171135913",
            "dpc": "03024316301",
            "name": "ជា សុធាវី"
        },
        {
            "barcode": "171135914",
            "dpc": "03024316401",
            "name": "មាង ឡែន"
        },
        {
            "barcode": "171135915",
            "dpc": "03024316501",
            "name": "សេង ប៊ុនសួរ"
        },
        {
            "barcode": "171135916",
            "dpc": "03024316601",
            "name": "សៅ លឹមស្រៀង"
        },
        {
            "barcode": "171135917",
            "dpc": "03024316701",
            "name": "ហាប់ គឹមហាក់"
        },
        {
            "barcode": "171135918",
            "dpc": "03024316901",
            "name": "រស់ សុផល"
        },
        {
            "barcode": "171135919",
            "dpc": "03024317101",
            "name": "ចាន់ ប៊ុនធឿន"
        },
        {
            "barcode": "171135920",
            "dpc": "03024317201",
            "name": "ហ៊ុច សុវណ្ណ"
        },
        {
            "barcode": "171135921",
            "dpc": "03024317301",
            "name": "ប៉ិញ ឈាងហាក់"
        },
        {
            "barcode": "171135922",
            "dpc": "03024317401",
            "name": "កែវ ធានី"
        },
        {
            "barcode": "171135923",
            "dpc": "03024317501",
            "name": "ផាន់ ស្រស់"
        },
        {
            "barcode": "171135924",
            "dpc": "03024317601",
            "name": "លឹម លេងអៀង"
        },
        {
            "barcode": "171135925",
            "dpc": "03024317701",
            "name": "ញ៉ឹម ដារ៉ា"
        },
        {
            "barcode": "171135926",
            "dpc": "03024317801",
            "name": "តឹក សុផល"
        },
        {
            "barcode": "171135927",
            "dpc": "03024317901",
            "name": "ប៉ុក ប៊ុន"
        },
        {
            "barcode": "171135928",
            "dpc": "03024318001",
            "name": "ប៉ិច ភៅ"
        },
        {
            "barcode": "171135929",
            "dpc": "03024318101",
            "name": "ប៉ុក សុផារី"
        },
        {
            "barcode": "171135930",
            "dpc": "03024318201",
            "name": "សែ ធារិទ្ធ"
        },
        {
            "barcode": "171135931",
            "dpc": "03024318401",
            "name": "សុខ សុវណ្ណរិទ្ធ"
        },
        {
            "barcode": "171135932",
            "dpc": "03024318501",
            "name": "ឈិន ស"
        },
        {
            "barcode": "171135933",
            "dpc": "03024318601",
            "name": "ទួន ចំរើន"
        },
        {
            "barcode": "171135934",
            "dpc": "03024318701",
            "name": "សុខ កុសល់"
        },
        {
            "barcode": "171135935",
            "dpc": "03024318901",
            "name": "អ៊ួក រ៉េន"
        },
        {
            "barcode": "171135936",
            "dpc": "03024319001",
            "name": "លី ខន"
        },
        {
            "barcode": "171135937",
            "dpc": "03024319101",
            "name": "សុខ ពឿន"
        },
        {
            "barcode": "171135938",
            "dpc": "03024319201",
            "name": "គឹម ហ៊ុន"
        },
        {
            "barcode": "171135939",
            "dpc": "03024319301",
            "name": "ឆម សាង"
        },
        {
            "barcode": "171135940",
            "dpc": "03024319401",
            "name": "សេក សាលី"
        },
        {
            "barcode": "171135941",
            "dpc": "03024319501",
            "name": "ជ័យ វណ្ណី"
        },
        {
            "barcode": "171135942",
            "dpc": "03024319601",
            "name": "អ៊ឹម និល"
        },
        {
            "barcode": "171135943",
            "dpc": "03024319701",
            "name": "សន សុផល"
        },
        {
            "barcode": "171135944",
            "dpc": "03024319801",
            "name": "ជួន ស៊ីវន្ថា"
        },
        {
            "barcode": "171135945",
            "dpc": "03024320001",
            "name": "គង់ ទ្រី"
        },
        {
            "barcode": "171135946",
            "dpc": "03024320101",
            "name": "សុខ នា"
        },
        {
            "barcode": "171135947",
            "dpc": "03024320201",
            "name": "ក្នាន សម្ផស្ស"
        },
        {
            "barcode": "171135948",
            "dpc": "03024320301",
            "name": "តឹក សារ៉េត"
        },
        {
            "barcode": "171135949",
            "dpc": "03024320401",
            "name": "ចិន ឡៃប៉ាល់"
        },
        {
            "barcode": "171135950",
            "dpc": "03024320501",
            "name": "ឆេង លី"
        },
        {
            "barcode": "171135951",
            "dpc": "03024320601",
            "name": "រ៉ុម វណ្ណា"
        },
        {
            "barcode": "171135952",
            "dpc": "03024320701",
            "name": "ឯក សុផល"
        },
        {
            "barcode": "171135953",
            "dpc": "03024320801",
            "name": "ហេង ហោ"
        },
        {
            "barcode": "171135954",
            "dpc": "03024320901",
            "name": "ម៉ែត ពេញ"
        },
        {
            "barcode": "171135955",
            "dpc": "03024321001",
            "name": "ឈឿម សុភាព"
        },
        {
            "barcode": "171135956",
            "dpc": "03024321101",
            "name": "ហួន សាយ័ន្ត"
        },
        {
            "barcode": "171135957",
            "dpc": "03024321201",
            "name": "តាំង សុខអេង"
        },
        {
            "barcode": "171135958",
            "dpc": "03024321301",
            "name": "ចាន់ ធឿន"
        },
        {
            "barcode": "171135959",
            "dpc": "03024321401",
            "name": "រឿន សុឃឿន"
        },
        {
            "barcode": "171135960",
            "dpc": "03024321501",
            "name": "ម៉ៅ វុទ្ធី"
        },
        {
            "barcode": "171135961",
            "dpc": "03024321601",
            "name": "រ័ត្ន ស៊ុននារី"
        },
        {
            "barcode": "171135962",
            "dpc": "03024321701",
            "name": "សៅ ឈី"
        },
        {
            "barcode": "171135963",
            "dpc": "03024321801",
            "name": "នី សំអាត"
        },
        {
            "barcode": "171135964",
            "dpc": "03024321901",
            "name": "ស៊ីម ស៊ីន"
        },
        {
            "barcode": "171135965",
            "dpc": "03024322001",
            "name": "សុខ សំ"
        },
        {
            "barcode": "171135966",
            "dpc": "03024322201",
            "name": "រស់ ហាន"
        },
        {
            "barcode": "171135967",
            "dpc": "03024322301",
            "name": "រស់ ហៀង"
        },
        {
            "barcode": "171135968",
            "dpc": "03024322401",
            "name": "យិន កុសល់"
        },
        {
            "barcode": "171135969",
            "dpc": "03024322501",
            "name": "យិន ផា"
        },
        {
            "barcode": "171135970",
            "dpc": "03024322601",
            "name": "ហៀក គ្រី"
        },
        {
            "barcode": "171135971",
            "dpc": "03024322701",
            "name": "ជា សឿន"
        },
        {
            "barcode": "171135972",
            "dpc": "03024322801",
            "name": "ប៊ុន លី"
        },
        {
            "barcode": "171135973",
            "dpc": "03024323001",
            "name": "លិម ផៃអេង"
        },
        {
            "barcode": "171135974",
            "dpc": "03024323101",
            "name": "ម៉ក់ សុឆេប"
        },
        {
            "barcode": "171135975",
            "dpc": "03024323201",
            "name": "តូច សារិទ្ធ"
        },
        {
            "barcode": "171135976",
            "dpc": "03024323301",
            "name": "ជា សុបិន"
        },
        {
            "barcode": "171135977",
            "dpc": "03024323401",
            "name": "បៀន ប៉ាក់"
        },
        {
            "barcode": "171135978",
            "dpc": "03024323601",
            "name": "ចេវ នាង"
        },
        {
            "barcode": "171135979",
            "dpc": "03024323701",
            "name": "ប៉ូច វឌ្ឍនា"
        },
        {
            "barcode": "171135980",
            "dpc": "03024323801",
            "name": "ទឹម សុភា"
        },
        {
            "barcode": "171135981",
            "dpc": "03024323901",
            "name": "អ៊ុយ ឈាន"
        },
        {
            "barcode": "171135982",
            "dpc": "03024324001",
            "name": "ភោគ សុភី"
        },
        {
            "barcode": "171135983",
            "dpc": "03024324101",
            "name": "ហេង បូរ៉ា"
        },
        {
            "barcode": "171135984",
            "dpc": "03024324201",
            "name": "ម៉ែន សារិន"
        },
        {
            "barcode": "171135985",
            "dpc": "03024324301",
            "name": "ផេង សុភា"
        },
        {
            "barcode": "171135986",
            "dpc": "03024324401",
            "name": "លី សុខា"
        },
        {
            "barcode": "171135987",
            "dpc": "03024324501",
            "name": "ខឹម វណ្ណារី"
        },
        {
            "barcode": "171135988",
            "dpc": "03024324701",
            "name": "ឡាង ភី"
        },
        {
            "barcode": "171135989",
            "dpc": "03024324801",
            "name": "ហេង គឹមលាង"
        },
        {
            "barcode": "171135990",
            "dpc": "03024324901",
            "name": "គឹម ផេងអាន"
        },
        {
            "barcode": "171135991",
            "dpc": "03024325001",
            "name": "យាន តិ"
        },
        {
            "barcode": "171135992",
            "dpc": "03024325101",
            "name": "ប៊ូ ម៉ាប់"
        },
        {
            "barcode": "171135993",
            "dpc": "03024325201",
            "name": "ស្រ៊ាង ស្រីទូច"
        },
        {
            "barcode": "171135994",
            "dpc": "03024325301",
            "name": "ហាត ហាក់"
        },
        {
            "barcode": "171135995",
            "dpc": "03024325401",
            "name": "អ៊ុន ឈួន"
        },
        {
            "barcode": "171135996",
            "dpc": "03024325501",
            "name": "ប៉ិច ម៉ៅ"
        },
        {
            "barcode": "171135997",
            "dpc": "03024325601",
            "name": "លឹម លីណា"
        },
        {
            "barcode": "171135998",
            "dpc": "03024325701",
            "name": "អឿន សំអាត"
        },
        {
            "barcode": "171135999",
            "dpc": "03024325801",
            "name": "សោម ណារិន"
        },
        {
            "barcode": "171136000",
            "dpc": "03024325901",
            "name": "ប៉ោក ចាន់ថន"
        },
        {
            "barcode": "171136001",
            "dpc": "03024326001",
            "name": "លិម ឈៀងហួ"
        },
        {
            "barcode": "171136002",
            "dpc": "03024326101",
            "name": "ណុប ណារ៉ា ៧"
        },
        {
            "barcode": "171136003",
            "dpc": "03024326201",
            "name": "ហង់ រស់"
        },
        {
            "barcode": "171136004",
            "dpc": "03024326301",
            "name": "ណុប ណារ៉ា ៨"
        },
        {
            "barcode": "171136005",
            "dpc": "03024326401",
            "name": "តឿន ពិសាល"
        },
        {
            "barcode": "171136006",
            "dpc": "03024326501",
            "name": "ឈឿន ញ៉ិល"
        },
        {
            "barcode": "171136007",
            "dpc": "03024326601",
            "name": "ឡុង សាវ៉េត"
        },
        {
            "barcode": "171136008",
            "dpc": "03024326801",
            "name": "ចាន់ គឹមឡេង ១៧២"
        },
        {
            "barcode": "171136009",
            "dpc": "03024327001",
            "name": "សួង កែន"
        },
        {
            "barcode": "171136010",
            "dpc": "03024327101",
            "name": "មាស សុវណ្ណ"
        },
        {
            "barcode": "171136011",
            "dpc": "03024327201",
            "name": "យ៉ាក ដៀត"
        },
        {
            "barcode": "171136012",
            "dpc": "03024327301",
            "name": "មាត់ លី"
        },
        {
            "barcode": "171136013",
            "dpc": "03024327401",
            "name": "ចាន់ ណៃ"
        },
        {
            "barcode": "171136014",
            "dpc": "03024327501",
            "name": "ម៉ៅ ឆាន់"
        },
        {
            "barcode": "171136015",
            "dpc": "03024327601",
            "name": "អ៊ាន វណ្ណេត"
        },
        {
            "barcode": "171136016",
            "dpc": "03024327801",
            "name": "សៀវ រតនា"
        },
        {
            "barcode": "171136017",
            "dpc": "03024327901",
            "name": "ចាន់ ស៊ីថា"
        },
        {
            "barcode": "171136018",
            "dpc": "03024328001",
            "name": "ឯក គេន"
        },
        {
            "barcode": "171136019",
            "dpc": "03024328101",
            "name": "និច ម៉ានី"
        },
        {
            "barcode": "171136020",
            "dpc": "03024328201",
            "name": "វិទ្យាល័យដុងបូសូរ"
        },
        {
            "barcode": "171136021",
            "dpc": "03024328301",
            "name": "ទេព ហ៊ីម"
        },
        {
            "barcode": "171136022",
            "dpc": "03024328401",
            "name": "ឡាយ ចិន្ដា"
        },
        {
            "barcode": "171136023",
            "dpc": "03024328501",
            "name": "អ៊ុច យួម"
        },
        {
            "barcode": "171136024",
            "dpc": "03024328601",
            "name": "ដន ឌី"
        },
        {
            "barcode": "171136025",
            "dpc": "03024328701",
            "name": "ច័ន្ទ ថា"
        },
        {
            "barcode": "171136026",
            "dpc": "03024328801",
            "name": "នៅ យុង"
        },
        {
            "barcode": "171136027",
            "dpc": "03024328901",
            "name": "ស៊ុក វាសនា"
        },
        {
            "barcode": "171136028",
            "dpc": "03024329001",
            "name": "សួម ចាន់រស្មី"
        },
        {
            "barcode": "171136029",
            "dpc": "03024329101",
            "name": "ចាន់ សារ៉ន"
        },
        {
            "barcode": "171136030",
            "dpc": "03024329201",
            "name": "សុខ រ៉ាន់"
        },
        {
            "barcode": "171136031",
            "dpc": "03024329301",
            "name": "អ៊ុន ទៀហេង"
        },
        {
            "barcode": "171136032",
            "dpc": "03024329401",
            "name": "នី សំអាន"
        },
        {
            "barcode": "171136033",
            "dpc": "03024329501",
            "name": "វ៉ាយ សារ"
        },
        {
            "barcode": "171136034",
            "dpc": "03024329601",
            "name": "ប៉េង លីគឹមឡាយ"
        },
        {
            "barcode": "171136035",
            "dpc": "03024329701",
            "name": "ហេង ដួងចន្ថាដាមុនី"
        },
        {
            "barcode": "171136036",
            "dpc": "03024329801",
            "name": "ឆាយ សុភាព"
        },
        {
            "barcode": "171136037",
            "dpc": "03024329901",
            "name": "ជា សុខគង់"
        },
        {
            "barcode": "171136038",
            "dpc": "03024330001",
            "name": "ប៉ូ រ៉ោស៊ីហាស់"
        },
        {
            "barcode": "171136039",
            "dpc": "03024330101",
            "name": "សួស ឆិន"
        },
        {
            "barcode": "171136040",
            "dpc": "03024330201",
            "name": "អាត់ សាឌី"
        },
        {
            "barcode": "171136041",
            "dpc": "03024330301",
            "name": "ឆឹង ឆុន"
        },
        {
            "barcode": "171136042",
            "dpc": "03024330401",
            "name": "លឿត លឿប"
        },
        {
            "barcode": "171136043",
            "dpc": "03024330501",
            "name": "សឿន សិទ្ធិ"
        },
        {
            "barcode": "171136044",
            "dpc": "03024330601",
            "name": "ខេង ហឿន"
        },
        {
            "barcode": "171136045",
            "dpc": "03024330701",
            "name": "ង៉ែត វ៉ាន់នី"
        },
        {
            "barcode": "171136046",
            "dpc": "03024330801",
            "name": "ម៉ៅ ច័ន្ទដាណា"
        },
        {
            "barcode": "171136047",
            "dpc": "03024330901",
            "name": "តូ សេង ២"
        },
        {
            "barcode": "171136048",
            "dpc": "03024331001",
            "name": "ច្រែង ឌូវ៉ាន់"
        },
        {
            "barcode": "171136049",
            "dpc": "03024331101",
            "name": "មេ អូន"
        },
        {
            "barcode": "171136050",
            "dpc": "03024331201",
            "name": "ឡាង ហឿន"
        },
        {
            "barcode": "171136051",
            "dpc": "03024331301",
            "name": "ក្លឹង បាន់នឿត"
        },
        {
            "barcode": "171136052",
            "dpc": "03024331401",
            "name": "គឹម ចាន់ធី"
        },
        {
            "barcode": "171136053",
            "dpc": "03024331501",
            "name": "ស័រ សំណាង"
        },
        {
            "barcode": "171136054",
            "dpc": "03024331601",
            "name": "ឡោ អ៊ិតលៀ"
        },
        {
            "barcode": "171136055",
            "dpc": "03024331701",
            "name": "ភី សុខ"
        },
        {
            "barcode": "171136056",
            "dpc": "03024331801",
            "name": "ង៉ូវ សុខ"
        },
        {
            "barcode": "171136057",
            "dpc": "03024331901",
            "name": "សោម ណាវី"
        },
        {
            "barcode": "171136058",
            "dpc": "03024332001",
            "name": "ភួ ពុយ"
        },
        {
            "barcode": "171136059",
            "dpc": "03024332101",
            "name": "ហេង យាន"
        },
        {
            "barcode": "171136060",
            "dpc": "03024332201",
            "name": "សាន ពលៈ"
        },
        {
            "barcode": "171136061",
            "dpc": "03024302601",
            "name": "ស៊ីវ សុផល"
        },
        {
            "barcode": "171136062",
            "dpc": "03024302701",
            "name": "ឃឿប បូរិន"
        },
        {
            "barcode": "171136063",
            "dpc": "03024332301",
            "name": "សាឯម ពិសី"
        },
        {
            "barcode": "171136064",
            "dpc": "03024332401",
            "name": "អ៊ុត លាក់"
        },
        {
            "barcode": "171136065",
            "dpc": "03024332501",
            "name": "អ៊ុត សុឃឿប"
        },
        {
            "barcode": "171136066",
            "dpc": "03024332601",
            "name": "ក្រង ភារិន"
        },
        {
            "barcode": "171136067",
            "dpc": "03024332701",
            "name": "អៀង សុផារ៉ា ១"
        },
        {
            "barcode": "171136068",
            "dpc": "03024332801",
            "name": "អៀង សុផារ៉ា ២"
        },
        {
            "barcode": "171136069",
            "dpc": "03024332901",
            "name": "អៀង សុផារ៉ា ៣"
        },
        {
            "barcode": "171136070",
            "dpc": "03024333001",
            "name": "ណុប ស៊ីដារ៉ា"
        },
        {
            "barcode": "171136071",
            "dpc": "03024333101",
            "name": "ឃួន ជីឡាំ"
        },
        {
            "barcode": "171136072",
            "dpc": "03024333201",
            "name": "រឿង យ៉ាណូ"
        },
        {
            "barcode": "171136073",
            "dpc": "03024333301",
            "name": "យ៉ែម យឿត"
        },
        {
            "barcode": "171136074",
            "dpc": "03024333401",
            "name": "ទន់ ដា"
        },
        {
            "barcode": "171136075",
            "dpc": "03024333501",
            "name": "ពៅ សុជាតិ"
        },
        {
            "barcode": "171136076",
            "dpc": "03024333601",
            "name": "ឆាយ ឡេង"
        },
        {
            "barcode": "171136077",
            "dpc": "03024333701",
            "name": "សុខ មាន"
        },
        {
            "barcode": "171136078",
            "dpc": "03024333801",
            "name": "ជា តៃស៊ីន"
        },
        {
            "barcode": "171136079",
            "dpc": "03024333901",
            "name": "វ៉ាន់ សុត្រា"
        },
        {
            "barcode": "171136080",
            "dpc": "03024334001",
            "name": "អុំ ណារ៉ន"
        },
        {
            "barcode": "171136081",
            "dpc": "03024334101",
            "name": "រស់ វ៉ារីណ្ណា"
        },
        {
            "barcode": "171136082",
            "dpc": "03024334201",
            "name": "ទា ប៊ុនហ៊ាង"
        },
        {
            "barcode": "171136083",
            "dpc": "03024334301",
            "name": "ឈុំ ពុទ្ធិ"
        },
        {
            "barcode": "171136084",
            "dpc": "03024334401",
            "name": "ប៊ុន លី"
        },
        {
            "barcode": "171136085",
            "dpc": "03024334501",
            "name": "ហួត គឹមស៊ា"
        },
        {
            "barcode": "171136086",
            "dpc": "03024334601",
            "name": "សៅ ឆូយ"
        },
        {
            "barcode": "171136087",
            "dpc": "03024341901",
            "name": "ឈឿន ដាវុធ៥៩"
        },
        {
            "barcode": "171136088",
            "dpc": "03024334701",
            "name": "វណ្ណ វិទូ"
        },
        {
            "barcode": "171136089",
            "dpc": "03024334801",
            "name": "ហេង ចន្ធី"
        },
        {
            "barcode": "171136090",
            "dpc": "03024341801",
            "name": "ប៊ូ ហេមC1"
        },
        {
            "barcode": "171136091",
            "dpc": "03024334901",
            "name": "ខេង ពៅ"
        },
        {
            "barcode": "171136092",
            "dpc": "03024341701",
            "name": "ផ្ទះលេខC2"
        },
        {
            "barcode": "171136093",
            "dpc": "03024335001",
            "name": "សោម លន់"
        },
        {
            "barcode": "171136094",
            "dpc": "03024335101",
            "name": "អៀង ឆំ"
        },
        {
            "barcode": "171136095",
            "dpc": "03024335201",
            "name": "ទិត្យ សុផារី"
        },
        {
            "barcode": "171136096",
            "dpc": "03024335301",
            "name": "សុខ ម៉ាច"
        },
        {
            "barcode": "171136097",
            "dpc": "03024341601",
            "name": "ផ្ទះលេខC3"
        },
        {
            "barcode": "171136098",
            "dpc": "03024335401",
            "name": "ទន់ ធន់"
        },
        {
            "barcode": "171136099",
            "dpc": "03024335501",
            "name": "អ៊ី សាវន្ត"
        },
        {
            "barcode": "171136100",
            "dpc": "03024335601",
            "name": "យូ ទូច"
        },
        {
            "barcode": "171136101",
            "dpc": "03024335701",
            "name": "ទូច គង់"
        },
        {
            "barcode": "171136102",
            "dpc": "03024341401",
            "name": "ផ្ទះលេខC5"
        },
        {
            "barcode": "171136103",
            "dpc": "03024335801",
            "name": "ម៉ៅ ចាន់ឡន"
        },
        {
            "barcode": "171136104",
            "dpc": "03024335901",
            "name": "យ៉េន ណារ៉ា"
        },
        {
            "barcode": "171136105",
            "dpc": "03024336001",
            "name": "ព្លឿង សាវើន"
        },
        {
            "barcode": "171136106",
            "dpc": "03024336101",
            "name": "ហៀក សាវុធ"
        },
        {
            "barcode": "171136107",
            "dpc": "03024336201",
            "name": "ចាន់ ឧត្តម"
        },
        {
            "barcode": "171136108",
            "dpc": "03024336301",
            "name": "ថ្លាង សុឃឿត"
        },
        {
            "barcode": "171136109",
            "dpc": "03024336401",
            "name": "ចាន់ គឹមលី"
        },
        {
            "barcode": "171136110",
            "dpc": "03024336501",
            "name": "ឈន សកុណា"
        },
        {
            "barcode": "171136111",
            "dpc": "03024336601",
            "name": "វិត រស្មី"
        },
        {
            "barcode": "171136112",
            "dpc": "03024336701",
            "name": "តាត ឡា"
        },
        {
            "barcode": "171136113",
            "dpc": "03024336801",
            "name": "ខន ឃឺន"
        },
        {
            "barcode": "171136114",
            "dpc": "03024336901",
            "name": "គង់ សុវណ្ណារ៉េត"
        },
        {
            "barcode": "171136115",
            "dpc": "03024337001",
            "name": "ឈិន ឆាយរ័ត្ន"
        },
        {
            "barcode": "171136116",
            "dpc": "03024337101",
            "name": "ឃឿប សៅណាលី"
        },
        {
            "barcode": "171136117",
            "dpc": "03024341301",
            "name": "ផ្ទះលេខC6"
        },
        {
            "barcode": "171136118",
            "dpc": "03024341201",
            "name": "ផ្ទះលេខC7"
        },
        {
            "barcode": "171136119",
            "dpc": "03024341101",
            "name": "ផ្ទះលេខC8"
        },
        {
            "barcode": "171136120",
            "dpc": "03024341001",
            "name": "ផ្ទះលេខC9"
        },
        {
            "barcode": "171136121",
            "dpc": "03024337201",
            "name": "ហ៊ន ម៉ៅ"
        },
        {
            "barcode": "171136122",
            "dpc": "03024337301",
            "name": "តូ ព្រេក"
        },
        {
            "barcode": "171136123",
            "dpc": "03024337401",
            "name": "ប៊ុត ឡាប"
        },
        {
            "barcode": "171136124",
            "dpc": "03024337501",
            "name": "វឿត ឃឿត"
        },
        {
            "barcode": "171136125",
            "dpc": "03024337601",
            "name": "ផា រស្មី"
        },
        {
            "barcode": "171136126",
            "dpc": "03024337701",
            "name": "ជិន សុផានីD01"
        },
        {
            "barcode": "171136127",
            "dpc": "03024337801",
            "name": "ផ្ទះលេខD02"
        },
        {
            "barcode": "171136128",
            "dpc": "03024337901",
            "name": "ឡាំ សុភាវី D03"
        },
        {
            "barcode": "171136129",
            "dpc": "03024338001",
            "name": "ផ្ទះលេខ D04"
        },
        {
            "barcode": "171136130",
            "dpc": "03024338101",
            "name": "មាស សាវឿនD05"
        },
        {
            "barcode": "171136131",
            "dpc": "03024338201",
            "name": "ផ្ទះលេខ D06"
        },
        {
            "barcode": "171136132",
            "dpc": "03024338301",
            "name": "ផ្ទះលេខ D07"
        },
        {
            "barcode": "171136133",
            "dpc": "03024338401",
            "name": "ផ្ទះលេខ​ D08"
        },
        {
            "barcode": "171136134",
            "dpc": "03024338501",
            "name": "វឿន ស៊ីម៉េងD09"
        },
        {
            "barcode": "171136135",
            "dpc": "03024338601",
            "name": "ម៉ែន សុភក្ដិD10"
        },
        {
            "barcode": "171136136",
            "dpc": "03024338701",
            "name": "ផ្ទះលេខ D11"
        },
        {
            "barcode": "171136137",
            "dpc": "03024338801",
            "name": "ផ្ទះលេខ D12"
        },
        {
            "barcode": "171136138",
            "dpc": "03024338901",
            "name": "ផ្ទះលេខ D13"
        },
        {
            "barcode": "171136139",
            "dpc": "03024339101",
            "name": "ផ្ទះលេខ D15"
        },
        {
            "barcode": "171136140",
            "dpc": "03024339601",
            "name": "ផ្ទះលេខ D20"
        },
        {
            "barcode": "171136141",
            "dpc": "03024339901",
            "name": "ផ្ទះលេខ C20"
        },
        {
            "barcode": "171136142",
            "dpc": "03024340001",
            "name": "ផ្ទះលេខ C19"
        },
        {
            "barcode": "171136143",
            "dpc": "03024340101",
            "name": "ផ្ទះលេខ C18"
        },
        {
            "barcode": "171136144",
            "dpc": "03024340201",
            "name": "ផ្ទះលេខ C17"
        },
        {
            "barcode": "171136145",
            "dpc": "03024340301",
            "name": "ផ្ទះលេខ C16"
        },
        {
            "barcode": "171136146",
            "dpc": "03024340401",
            "name": "ផ្ទះលេខ C15"
        },
        {
            "barcode": "171136147",
            "dpc": "03024340501",
            "name": "ផ្ទះលេខ C14"
        },
        {
            "barcode": "171136148",
            "dpc": "03024340601",
            "name": "ប៉ោយ ឈុនលី C13"
        },
        {
            "barcode": "171136149",
            "dpc": "03024340701",
            "name": "ច្រៀង ស៊ាងឡេង C12"
        },
        {
            "barcode": "171136150",
            "dpc": "03024340801",
            "name": "កែវ រតនះ C11"
        }
    ];
barcodes.forEach(function(bar){
    let customer=db.wb_customer.findOne({dpc:bar.dpc});
    db.wb_meterReadingJournalDetails.update({customerId:customer._id,newReadingDate:{$gt:start,$lte:end}},{$set:{subBarcode:bar.barcode}});
});
